{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "Narrativereport",
    "1": "Notice",
    "2": "accomplishments",
    "3": "actionplan",
    "4": "administrative",
    "5": "advertisementhiring",
    "6": "app",
    "7": "approval",
    "8": "assessmentprogram",
    "9": "attend",
    "10": "award",
    "11": "banktransac",
    "12": "bulletininfomaterials",
    "13": "career",
    "14": "cert",
    "15": "certacceptance",
    "16": "certcopyright",
    "17": "certemployment",
    "18": "certenrollment",
    "19": "certofappearance",
    "20": "certofcash",
    "21": "certofmembership",
    "22": "certofparticipation",
    "23": "certoftraining",
    "24": "chedro",
    "25": "classobserve",
    "26": "cofservice",
    "27": "collectionpolicy",
    "28": "collegecode",
    "29": "collegesyllabi",
    "30": "consultation",
    "31": "criteria",
    "32": "diploma",
    "33": "dtr",
    "34": "dutiesandresponsibilities",
    "35": "employmentrecord",
    "36": "entranceform",
    "37": "evalform",
    "38": "expandtraining",
    "39": "facultypromotion",
    "40": "grades of sheet",
    "41": "gradesofsheet",
    "42": "honorabledismissal",
    "43": "ipcr",
    "44": "lab",
    "45": "letter",
    "46": "librarygoal",
    "47": "manual",
    "48": "medicalrecord",
    "49": "memo",
    "50": "minutes",
    "51": "nbc461",
    "52": "numofdropout",
    "53": "ojt",
    "54": "orgchart10",
    "55": "pds",
    "56": "policy",
    "57": "programinvitation",
    "58": "projectproposal",
    "59": "proofbystudent",
    "60": "purchaseorder",
    "61": "purchaserequest",
    "62": "pyroll",
    "63": "researchagenda",
    "64": "resolution",
    "65": "studentinfosheet",
    "66": "syllabi",
    "67": "tesdacertification",
    "68": "thesismanuscript",
    "69": "tor",
    "70": "tracerstudy",
    "71": "travelorder",
    "72": "vmgo",
    "73": "workload"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Narrativereport": 0,
    "Notice": 1,
    "accomplishments": 2,
    "actionplan": 3,
    "administrative": 4,
    "advertisementhiring": 5,
    "app": 6,
    "approval": 7,
    "assessmentprogram": 8,
    "attend": 9,
    "award": 10,
    "banktransac": 11,
    "bulletininfomaterials": 12,
    "career": 13,
    "cert": 14,
    "certacceptance": 15,
    "certcopyright": 16,
    "certemployment": 17,
    "certenrollment": 18,
    "certofappearance": 19,
    "certofcash": 20,
    "certofmembership": 21,
    "certofparticipation": 22,
    "certoftraining": 23,
    "chedro": 24,
    "classobserve": 25,
    "cofservice": 26,
    "collectionpolicy": 27,
    "collegecode": 28,
    "collegesyllabi": 29,
    "consultation": 30,
    "criteria": 31,
    "diploma": 32,
    "dtr": 33,
    "dutiesandresponsibilities": 34,
    "employmentrecord": 35,
    "entranceform": 36,
    "evalform": 37,
    "expandtraining": 38,
    "facultypromotion": 39,
    "grades of sheet": 40,
    "gradesofsheet": 41,
    "honorabledismissal": 42,
    "ipcr": 43,
    "lab": 44,
    "letter": 45,
    "librarygoal": 46,
    "manual": 47,
    "medicalrecord": 48,
    "memo": 49,
    "minutes": 50,
    "nbc461": 51,
    "numofdropout": 52,
    "ojt": 53,
    "orgchart10": 54,
    "pds": 55,
    "policy": 56,
    "programinvitation": 57,
    "projectproposal": 58,
    "proofbystudent": 59,
    "purchaseorder": 60,
    "purchaserequest": 61,
    "pyroll": 62,
    "researchagenda": 63,
    "resolution": 64,
    "studentinfosheet": 65,
    "syllabi": 66,
    "tesdacertification": 67,
    "thesismanuscript": 68,
    "tor": 69,
    "tracerstudy": 70,
    "travelorder": 71,
    "vmgo": 72,
    "workload": 73
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 30522
}
