[
    {
        "image": "acknowform1_synth_10_aug1.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES BILE office af the vice Chancebor for Student afais om Ocioner 17, 2028 at Narre Hall, whe LL: Campus ion of curfew policies by entering dormdary s pronibited under Section 9 OF (he a was conducted a violation of universt student, THs 19 ory Management Office a registered dormitory pokey infractions: vii by an reside a8 att nave reported after designated hours without aul versity Residential Lae Handocok. tf the Dormitory Disciplinary Boars, including 16 0 of your written siateme: ne following residential ommnon at tines and damages sary period, you current THON, SUMMARS ty footag mnoriza! A thorough investiga! invernews win cormitory £29 placed in voit restriction from conmitory Lie Responsibility Worksh tus, BEHAVIORAL EXPE! conduct and strict adhe 00 Ab), compliance with wsiter pal REQUIREMENTS: You are sequired f nory community sence, FINANCIAL ACCOUNTABILITY: F2 office withir: fiteen (15) days, Faliure te receipt of this notice ana your commuement 19 1a CRUZ Director, Re and Housing S payment ATIONS, During your Bt dormitory Bo icles, anc enoperatic nce of quiet hours: £10205 PM te staff REHABILITS Lite Coordinator and compete BC nent of P4026 OC ma noid cn ing alt mposed races sof dort iversity Cashier s jential Lite 2022 35138 ribet SAMANTHA DAVIS BRINTED FAME OF Date Contact Nurrdbae Bacelh Astosied SanATRE Date” Noverrber INSTRUCTIONS Kindy print and eubenit this form to the Office of the Dear"
    },
    {
        "image": "acknowform1_synth_10_aug2.png",
        "label": "acknowform",
        "ocr_text": "IVERSITY OF THE PHE INES DILIMAN Offing of the Vice C! Hor for Student Artairs ACADEMIC INTEGRITY ACKNOWLEDCEM {. This format no by the xement Office. The incident i u currentiy teste as These actions are expressly prcmibit ATION SUMMARY S ofthe esidents A thorough investigator we 8 HOUSING pio be pl immediately, th TATIONS: Dating your pro you must maintal all cormitory pokeles. This vvsitor 00 ely wi ef quist hours (10 00 Pat te vg) aii ng Services rector, Residential Li and Conta SNSTRUCTIONS Kindy print and sube: sit vhis form to the Office of the ean"
    },
    {
        "image": "acknowform1_synth_10_aug3.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Office of the Vice Chancellor for ‘Student Affairs SAMANTHA DAVIS SIGNATURE OVER Date November 15, 2025 Facultv Colle PRINTED NAME OF STUDENT ‘ae School institute Institute of Management Attested: STEVEN CHOI Student Number 2022 35130 re Contact Number; 09459238551 ee"
    },
    {
        "image": "acknowform1_synth_10_aug4.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Office of the Vice Chancellor for Student Affairs ACADEMIC INTEGRITY ACKNOWLEDGEMENT. Dear Student, This formal notice addresses a violation of university residential policies as documented by the Dormitory Management Office. The incident in question occurred on October 17, 2025 at Narra Hall, where you currently reside as a registered dormitory student. VIOLATION DETAILS: Campus Security and Dormitory Staff have reported the following policy infractions: violation of curfew policies by entering dormitory after designated hours without authorization. These actions are expressly prohibited under Section 9 of the University Residential Life Handbook. INVESTIGATION SUMMARY: A thorough investigation was conducted by the Dormitory Disciplinary Board, including review of securty footage, interviews with dormitory residents and staff, and examination of your written statement submitted on October 23, 2025. HOUSING SANCTIONS Effective immediately, the following residential sanctions are imposed: written warning to be placed in your housing file restriction from dormitory common areas for 2 weeks, mandatory attendance at the Residential Life Responsibilty Workshop, payment of fines and damages totaling 4 026 00, and probationary housing status. BEHAVIORAL EXPECTATIONS: During your probationary period, you must maintain ‘exemplary Conduct and strict adherence to all dormitory policies. This includes observance of quiet hours (10 00 PM to 6 00 AM), compliance with visitor policies, and cooperation with dormitory staff. REHABILITATION REQUIREMENTS: You are required to meet bi weekly with the Residential Life Coordinator and complete 50 ours of dormitory community service. FINANCIAL ACCOUNTABILITY: Payment of 4 026 00 must be made to the University Cashier s Office within fifteen (15) days. Failure to settle will result in a hold on your student account. Your signature acknowledges receipt ofthis notice and your commitment to futfling all imposed Sanctions. Respecttlly submited, ANTONIO JOSE M. CRUZ Director, Residential Life and Housing Services SAMANTHA DAVIS Student Number 2022 35130 SIGNATURE OVER PRINTED NAME OF STUDENT Date: November 15, 2025 Facultv Colleae /SchooVinatitute Contact Number: 09459238551 Institute of Management a Attested: STEVEN CHOI SIGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date November 17, 2025 INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_10_aug5.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSH Y OF THE PHILIPPINES OILIMAN Office of the Vice Chancellor for Stuaent Affairs, ACADEMIC INTEGRITY ACKNOWLEDGEMENT Dear Surient, This tormai notice aderesses a violation of university resident! polcies as documenico by the Dormrory Management Office. The incident in question occurred on October 17. 2026 at Narta Hall, where you currently reside as a registered dotaitory student, VIOLATION DETAILS’ Campus Security aid Dormitory Statt have reported the following policy infractions. violation of curtew policies by entering Gorraitary alter desgnaied hours witout authorwation. These actions are expressly pronittes under Section S of the University Residential Life Handbook INVES? IGATION SUMMARY” A thorugh invesigation was conducted by the Dormiory Miscipinary Board, inctuding review of secunty footage, interviews with dormitory residents and staff, and examination of vour written statement submitted on Cetober 23 2025 HOUSING SANCTIONS: Effective mmnectateyy, the following residential sanchons are Imposed: written warning ts be placed in your housing Iie, resiricdon trom dormitory commen areas for 2 weeks, mandatory atendance at the Residential Life Responsibility Worsnep, payment of fines and damages totaling 4 026 06, and probationary housing stalus. BEHAVIORAL EXPECTATIONS. During your probationary period, you must maintain exemplary conduct ano strict atherence to ait dormitory polices. This inciudes observance of quiet hours (10 00 PHA to wpance with visitor policies, end conperation with GormMory stall REHABILITATION, REQUIREMENTS: You are required to meet Diweekly with the Residential Life Coordinator ang complete SC ours of dormitory community service FINANCIAL ACCOUNTABILITY: Payment of 84 026 U0 must be mece to the University Cashier s Ofice wihin Mean (15) days Falture to sete wil resul in a old an your student Socount Your signature acknowledges receipt of this noice ang your commitment fo fullwing al imposed sanchons, Respecttuy submited, ANTONIO JOSE M. CRUZ Director, Residential Lite and Housing Services __ SAMANTHA DAVIS . Studerd Member, 2022 38139 SHGNATURE GVER PRITTID NAME GF STUDENT sever 15, 2025, eae Sclvnet nat state of Management Contact Number Attested: STEVEN CHO! “SIGNATURE GVEN PRINTED NAML OF PARENT GUARDIAN Date: Moverbae 47, 2035 INSTRUCTIONS Kingy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_1_aug1.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Office of Student Affairs and Services STUDENT CODE OF CONDUCT AGREEMENT Dear Student, This formal notice addresses a violation of university residential policies as documented by the Dormitory Management Office. The incident in question occurred on October 13, 2025 at Molave Dormitory, where you currently reside as a registered dormitory student. VIOLATION DETAILS: Campus Security and Dormitory Staff have reported the following policy infractions: unauthorized modification of room facilities and installation of prohibited appliances. These actions are expressly prohibited under Section 5 of the University Residential Life Handbook. INVESTIGATION SUMMARY: A thorough investigation was conducted by the Dormitory Disciplinary Board, including review of security footage, interviews with dormitory residents and staff, and examination of your written statement submitted on October 18, 2025. HOUSING SANCTIONS: Effective immediately, the following residential sanctions are imposed: written warning to be placed in your housing file, restriction from dormitory common areas for 3 weeks, mandatory attendance at the Residential Lite Responsibility Workshop, payment of fines and damages totaling 3 655 00, and probationary housing status. BEHAVIORAL EXPECTATIONS: During your probationary period, you must maintain exemplary conduct and strict adherence to all dormitory policies. This includes observance of quiet hours (10 00 PM to 6 00 AM), compliance with visitor policies, and cooperation with dormitory staff. REHABILITATION REQUIREMENTS: You are required to meet bi weekly with the Residential Life Coordinator and complete 33 hours of dormitory community service. FINANCIAL ACCOUNTABILITY: Payment of 3 655 00 must be made to the University Cashier s Office within fifteen (15) days. Failure to settle will result in a hold on your student account. Your signature acknowledges receipt of this notice and your commitment to fultiling all imposed sanctions. Respectfully submitted, ANTONIO JOSE M. CRUZ Director, Residential Life and Housing Service: JACOB GARCIA Student Number 2022 55200 ‘SIGNATURE OVER PRINTED NAME OF STUDENT Date November 14, 2025 Facultv Colleae School Inetitute Contact Number; 09263984260 College of Science Attested: JONATHAN JAMES ‘SIGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date: November 16, 2025 INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_1_aug2.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Office of Student Affairs ang Services documented by the October 13, 2025 at Molave Dormitory, dormitory student. VIOLATION pj meet bi weekly with the Residential Lite Coordinator and complete 33 ours of dormitory community service FINANCIAL ACCOUNTABILITY: Payment of 3 655 00 must be made {0 the University Cashier s Office within heen (15) days. Faiure to sete wil result ina hold on your student 2ccount. Your signature acknowledges [celPt ofthis notice and your commitment to Tuttiting all imposed Sanctions. Respecttully submitted, ANTONIO. YOSE M. CRUZ Director, Residential Lite ang Housing Services JACOB GARCIA ‘Student Number 2022 55200 ‘SIGNATURE OVER PRINTED NAME OF STUDENT Date November 14, 2025 Facultv Colleae/ jer Contact Number; 09263984260 College of Science —— Attested: JONATHAN: JAMES SIGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date: November 16, 2025 INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_1_aug3.png",
        "label": "acknowform",
        "ocr_text": "ocurmenitedl by the Dorrattory sanagem The incident in A Oeke 2028 ai Motave where you C {VIOLATION DETAIL cure and inauthiorized mod ited appiances, ressly prohibited under realtery, 5. Cape have reported the followin: ation Section staif, and exer ete housi Wve Immediately, the fo fe, re be placed in you ricuen from do: 5 00, ane pre Sus. BEHAVIORAL EX and Su AM) QUIREM hours of doi conduc! trict adherence to all dormitory pi This includes cbse j dorraltory sta, REHARILITAT You ate required to mect bin ai Life Coordinator and co FINANCIAL ACCOUNTABILITY: Payment of ®: ithin Witeen 115) days. F f with visitor poucies. and 558 00 1a. jure to sete wil nold on your student is notice and your commitment to tall GRUZ Director, Res ges receipt of! -NTOMIO JOSE g all Imposed ig al imposed Life and Housi Sturignk Number: 2 Contact Humber INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_1_aug4.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Omice of Suntent Aftairs ans Services at Motive Fogistered dormiory student VIOLATION DETAILS: Campus Security ane POmBOHY Sah have reported the tem soiey SB AanOFZeS raKicaton Of oom taciities ant Rstakaton of protibnted epphances These actions are e Residentas JSCOS Garcia ‘A _ ‘Seeder thariver; 2222 88260 SONATURE OVER DATO NAME OF SitoERT ——— Date: ravernber 4 4, 2025 SN ele Xchectintinge am Epltope ot Scrence a Altested: JONATHAN JAMES ONTO Gita BRRTIID hae Gy Rasseemerme SSNATORE Git PRRTTID Ta OF OMEN ElaRDiaN Date: Novemeee $6, 2025"
    },
    {
        "image": "acknowform1_synth_1_aug5.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS ‘Omice of Student Affairs and Serdaces STUDENT CODE OF CONDUCT AGREEMENT Dear Student, This formal notice adsressas 2 votation of university resdental policies 38 documented bY thre Octoder 13, 2025 at Molave Dormitory, Dormitory Management Office, “The meident in question occurred oft STON DETAILS. Campus Security anid wwhere you currenty reside as 1 Dormitory Staff have reported the fosowing policy actors instazation of prohibited to ne University Cashiers Office within account. Your signature acknowledges sanctions. Respecttu y submited, ANT gestered Gomory student VIOLAT unauthorized meditation of room tacsities and ssupmitied on Octover 18, 202% waitten warning to be placed your ahendance at ihe Residential to sethe wi resutl in a Raid on your student receipt of is notice and your commicnect fo futing at MNposeS pend JOSE M. CRUZ rector, Residential Lite anc Housing Service redone thetier: 2072 SRE __SACOB GARCIA SHGNATORE WER TRINTED RADE OF STUDENT Dete: November 14 Sanus aliens Scbeabiontmee JONATHAN JAMES Gentact Henbver 09263994260 re GiGRATURE GTR PROUTEO NUABAT OF PASERT GUAROIAN Date: Novernmer 16 2025 INSTRUCTIONS Kindy print ‘and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_2_aug1.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY ‘Student Discipline Formation Office BRETT JACKSON SIGNATURE OVER PRINTED Date November 14, 2025 Facultv Colleae SchaoUinctitite Institute of Management. Student Number 2020 64364 SS Contact Number: 09907761592 NAME OF STUDENT Altested: NATALIE MOORE ‘SIGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date November 16, 2025 INSTRUCTIONS Kindy print and Submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_2_aug2.png",
        "label": "acknowform",
        "ocr_text": "DE LASALLE UNIVERSITY Discipline Formation Office BEHAVIORAL WARNING [ACKNOWLEDGEMENT «to officially document a violation ofa ed by the university s policies on ‘scholarly conduct. The Academic Integ igation into allegations regarding your submitted requirements for BIO 204 Cell Biology IG OF RESPONSIBILITY: Based on substantial evidence including plagiarism detection 'e course instructor, Dr. Greg Dominguez, the committee finds that you ‘authorized collaboration on individual assignments and ‘ch of academic trust. ACADEMIC PENALTY: The following academic sanctions are hereby imposed: a grade of ZERO (0) for the submitted requirement, a reduction of sine ful etter grade in the final course grade, mandatory completion ‘of the Academic Integrity Seminar. anda formal notation on your academic transcript. FUTURE IMPLICATIONS: This violation will remain part of your permanent academic record. Any subsequent violation ‘ll result in more severe penallles including automatic failure in the course, suspension ‘rom the university, or permanent dismissal. EDUCATIONAL REQUIREMENTS: You must ‘complete attendance at three (3) sessions of the ‘academic Integrity Workshop paper on the conducted by the Teaching ane Learning Center and submit ‘comprehensive research importance of academic honesty. PROBATIONARY ‘STATUS: You are hereby placed on ‘Academic Integrity probation for one (1) full academic year. During this period, ail your submitted academic ‘work may be subject to enhanced scrutiny. Your signature below confirms that you have read, understood, and accept responsibilty for this violation ‘and its consequences. Sincerely, JOSE EMMANUEL C. REYES, PhD Chair, ‘academic Integrity Committee ‘student cademic integrity rity Committee Nas Dear Student, This ‘acknowledgement form serve: standards as define completed its invest ‘and Genetics. FINDIN oftware results and testimony from ‘th are responsible for academic dishonesty: Un ‘examinations. This cons! ‘Student Number 2020 64364 BRETT JACKSON “SIGNATURE OVER PRINTED NAME OF STUDENT Date: November 14, 2025, Facultv Colleae SchooVInstitute Contact Number 09907761592 institute of Management —— oe Attested: NATALIE MOORE FIGRATURE OVER PRINTED NAME ‘OF PARENT GUARDIAN Date: November 16, 2025 INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_2_aug3.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVI RSTY Student Disciptine Formation Office AORM. WARNING ACKNOWLEDG iy document wiotath {The Academic 5 toy BIO 2 emanit form serves te official standard pleted fs investigation into allegations egarding your submited reguiremens tics, FINDING OF SONSIBILETY, Based on substantial evidesice n°% sing plagiarism det “or. Greg Dominguez, te cornensice Brak that you poration on indivtual assignments a4 ACADERNIO PENALTY: THe follows ERO (0) for the submitted requirernent, reduction of npiction of the Academic tntagrtty Seminey, anda xg violation wal remain patt of yOu? severe penaitigs insiuaing ation TONA unauthorized col sacri are res nie dishet examinations. This utes a serious breach of 3¢ ations are hereby smposed: a grads of 2 one full etter grade in the final cOUTS! de, mandatory 20 tation on your academic teanscript, FUTUR record. Any sunsequert /olation Wil Te she course, suspension Rom the univers, OF permanent st coraplete attendance at three (8) s2380n5 2 the Academic! arring Genter ane subst a cownprenensis search pa “ayuiss: You are hereby placed oP A demic year, During this pesto, afl YOU\" gubmiited academic work may DI ‘confirms tat you have real, understved, and accept aces. SinceTeN. £8, PRD Chair, sso iN MOTE aisrnissat, EDUCA format nol pernanent acad vi he Teaching and Le acted by dance of acadeinic sp for one (4) Si at vyour signatu e Be honesty PROBATIONARY S Probate anced Sct ig viniation anid 8 respensiilty for th ernie integra Corn Acat tee Saudderst Nurnber Rane Contes Hainer ym te the Office ef the Bean at and submit this fo INSTRUCTIONS Kindy prt"
    },
    {
        "image": "acknowform1_synth_2_aug4.png",
        "label": "acknowform",
        "ocr_text": "DE LASALLE UNIVERSITY Siusent Disciptine Formation Office 3 ACKNOWLE: SEN BEHAVIORAL iv AR es to officially document a violation of academic integrity The Academic integrity Committee 89s requirements for BHO 204 Ce! This acknowiedgement formn $e policies on schoiany conduct Baar Stier standards a completed its ding your submt stantial evidence Including plagiarisin detection instructor, Or. Greg Domingues, the committee finds that you collaboration on inatvidual assignments and i. ACADEMIC PENALTY: The folowing fied requirement satiemnic integrity S hig viclation will ramein part of your ies metuding automatic NAL, demic integrity Workshop aponisibte ter ie examinations, This constitutes geademtic sanctions are hereby imposed: grade of ZERO ‘one full fetter grade in the thal course grade, mandatory compistion of nia notation aiscript, FUTURE IMPLICATIONS: T permanent aoademic re bseqtient visiation wil resull In more severe penal allure in the course, suspension from the university, or permanent eismissal OUIREMENTS: You tendanoe at three {3} sessions of the A conducted by the Teaching arid Learning Center and submit a comprehensive 1 importance ef academic honesly. PROBATIONARY STATUS re hereby Probation tor ong {1} ul academic year During ihis period, 2fl your suiorutied acad read, understood, 2 reduction of ina, and on your academic BUCA Bust compie You g fit accepy 8, PhO Chal uty. Your s oture below gonfirms that you nai quences. Sincerely. povsititiy for this violation end #3 cans Academic integtity commutes Stusdent Number 20264 Eavontsitoilaine Schwabe Cantact Numer: 99907761597 ibale of Management Altestod NATALIE MOORE GENATERE OVER DRATTED FAG OF DARHT SUARDIAN Tate: sovernber 18, 2025 INSTRUCTIONS Kindy print and submit this form to the (iffee of the Dean"
    },
    {
        "image": "acknowform1_synth_2_aug5.png",
        "label": "acknowform",
        "ocr_text": "DE LASALLE UNIVERS! student Disciplin« BEHAVIORAL WARNI rm serves to officially 40% scholarly condi regarding your submit and Geneti software results and complet formal notation on your a itted require reach of academic trust ZERO (0) for the submitted requirement, ITY ve Formation Office ING [ACKNOWLEDGEMENT n of academic integrity rity Committee Nas BIO 204 Cell Biology plagiarism detection committee finds that you inaividual assignments and ACADEMIC PENALTY: The following a reduction of tion of the Academic Integrity ‘seminar, and nis violation will remain part ‘of your more severe penalties including automatic gismissal. EDUCATIONAL permanent academic record failure in the Course. suspension from the university, OF permanent REQUIREMENTS: You must complete attendance at inree (°) sessions of the Academic Integrity Workshop conducted by the Teaching and Learning Center and submit comprehensive research paper on the iy et academic honesty. PROBAT! wy STATUS: You are hereby placed OP ‘Academic Integrity Probation for one (1) full academic year. During this period. al Your ‘submitted academic work may De subject to ennanced scrutiny. Your sgnalut® elow confirms that you nave read understood, and accept responsibility for this violation ‘and its consequences. sincerely. “JOSE EMMANUEL C. REYES, PP Chair, ‘academic integrity committer BRETT JACKSON. ‘student Number 2020 64364 “SIGNATURE OVER PRINTED ‘NAME OF STUDENT Date November 14 2025, Facutty Colleae SchooV institute Contact Number (09907761592 insttute of Management EES Attested: NATALIE MOORE SIGNATURE ‘OVER PRINTED NAME OF PARENT GUARDIAN Date: November 16, 2025 rnd submit this form to the Office of the Dean INSTRUCTIONS Kindy print 2"
    },
    {
        "image": "acknowform1_synth_3_aug1.png",
        "label": "acknowform",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Office of Student Affairs STUDENT CONDUCT ACKNOWLEDGEMENT FORM Dear Student, This acknowledgement form serves to officiaty document a woraiton of academic integrity standards as defined by the university s policies on scholarly conduct. The Academic integrity Committee nas complsted its investigation into allegations regarding your submited reguiements for ENG 101 Engksh ‘Composition and Rhetoric. FINDING OF RESPONSIBILITY. Based on substantial evidence meluding plaglarisin detection sofware results and testimony from tne course instructor, Dr. Whitney Murphy, the committee fines that you are responsibie for acagzmic dishonesty: plagiarism involving substanital portions of text copied without proper attribution. This constitutes a serious breach of academic trust. ACADEMIC PENALTY: The following academic sanctions ae hereby imposed: a grade of ZERO (0) for the submited requirement, a reduction of one full letter grade tn the final course grade, manvatory completion of the Academic integrity Seminar, and a foirnal notation on your academic transcript, FUTURE IMPLICATIONS: ‘This vioiaton wit remaln part of your permanent academic record. Any subsequent violation wei result fn more severe penaliies including autornatic taiure in the course, suspension from the university, or permanent dismissal, EQUCATIONAL REQUIREMENTS: You must complete attendance at three (3) sessions 0: the Acagemic integrity Workshop conducted by the Teaching end Learning Center and eubinit a comprehensive research paper on the importance of academic honesty. PROBATIONARY STATUS: You are nereby placed on Academic integrity Probation for one (1) fui academic year. During this period, ait your submitted academic work may be subject to enhanced scrutiny. Your signature beiow contis that you have read, understood, and accept responsibilty for th s violation and its consequences. Sincerely, JOSE EMMANUEL REYES, PhD Chair, Academic integrty Commitice JEISHA BROWN Student Number: 202261809 Facumeiailroe Shoobindtinde: Concact Number: 097435 CoWege of Social Su ences ard Pritosopty —_— Attested. ASHLEY WATTS SIGRATONE GER a ‘NANAE OF PARENT GUARDIAN INSTRUCTIONS Kindy print and submit this form te the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_3_aug2.png",
        "label": "acknowform",
        "ocr_text": "NEO OE MANILA UNIVERSITY, “ice of Student A STUDENT CONDUCT AC 7 FORM r Student, T nove gement form seives te officially document a violation: andaras as detined by the policies on scholarly conduct. The A nie integrity Committee has mplete ulrements for ENG 101 ore: plagial osition and Rhetoric, FIND Wo Setect tee Tings that yo capica without prope: SALTY: The fotlowin i a reduct ce melding Murphy. 1 sre results com are hereby impo grade in the final cour n your acadet your permanent academic recare Any s: quent violation the univers ion tr omatic failure in the course, susper You must complete attendance at three (3) session: g ter ang submit a campreher ih pape? on the a nesty F You are h grity Probation for one (4) tu academic y Mc work May be subject to enhanced scrutiny. Your signature below confi jad Lean Wwe feny placed on Academic int sat Duuring this period, all your subres ns thal you have reed, acad MIMANUEL C. undersiosd, and ac for this vie PhO Chair, Ai sponsibitity dion and is consequences. Sincerely, JOS e ic Integrity Comm Student Husnber PRINTED NAME GF G7 Facuiticulivea Schoutinatuine Contact Morne: ncas and Philos: INSTRUCTIONS Kindy print and submit tris form to the Oftice of the Dean"
    },
    {
        "image": "acknowform1_synth_3_aug3.png",
        "label": "acknowform",
        "ocr_text": "ATENES DE MANILA UNIVERSITY Office of Student Affairs STUDENT CONGUCY ACKNOW DGE NT FORM, mnie ike amie integrity Cammutiee has for ENG 101. Ene anitla! evidence including i@ GUUISe Instructor, Dr. Whitney Murphy, the 9 involving su fext copied without proper attribution. This constitutes a serious breach of acadtemuc trust. At PENALTY: The following academic sanctions are hereby imposed: a grave of ZERO (0) for the submittea requirement, a rexuction of one full letter grade i the final course grade, manda’ mplation of the Acadernic integrity Seminar, and a formal aotation on your academic Wanscrnpt. FUTURE IMPLICATIONS: lation wat remain part of your permar fecord. Any subsequent violation wit resuit in more severe penaities including course, suspension trom the university, oF permanent Dear Student, This ecknowiedya Standards as Getined by the university s policies on scholarly conduct. The Ac coinpieled fis investi: llegations regarding your submiited requiremen Composition and Rhetoric. FINDING OF RESPONSIBILITY: Based on suibsta ism detection from «eS {0 Officially document a violation of acai ADERNS dismissal EDUCATIONAL REQUIREMENTS: You must complete attanitance at three (3) sessions of the Ae Integrity Werkshap conducted by tte Teaching and Leaming Center and submit a comprenensive research paper on the importance of academic hon on Academic infegrliy Probation fer one {7} full academic year. During this period, al Scasemic work may be subject to enhanced scrutiny. Your gignature below confirms thet you have cead, undersioog, and accept responsibility for this violation and Re consequences. Sincerely REYES, Phi Chair, Academuc integnly Commitiee PROBATIONARY STATUS. You ate bk B Suatont Robes Bi2DH16CS Contact Number: G8T435745 16 Adtosied ASHI “GGHATIRE OVER BRIRTED Hiaha® GF PARENT GUARDIAN Gate: Navernber 17, 20 INSTRUCTIONS Gndy print and submit this form te the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_3_aug4.png",
        "label": "acknowform",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Gflice of Student Attain STUDENT CONDUCT ACKNOWLEDGEMEN FORM Dear Student, This acknowedgement form serves to oificiatty docu! standards 88 delined by the university s paticies on schotarty co com ations regarding your submitted requiremenss for ENG 194 English Com OF RESPOR Y: Based on substentiat evsienc plagiarism detection software results and testimony from ine cours Br. Whi mi academic dishonesty: pl 4) Substantial poitio fext copied without proper attrinution. This canstilules a sertous breach of academic trust. ACAD! PENALTY’ The following academic sanctions are hereby imposed: a gra omitted sequirement, a restuction of one ful etler grade fn the tina! Grave, mi compiation of Acacemic inlagrity Se clation op your academic transcript. FUTURE IMPLICAT) This violation wit remain part of your permanent acacemile record. Any subsequent viciatian wil more severe penalties ischiding aute in the course, suspension trom the university dismissal, EDUCATIONAL REGLIREMENTS: You mu: atienaance at tree (3) = Academic Integrity Workshop con ting Center and submit a comprenensive Ace of academic honesty, PROBATIONARY STAT: o hereby placed egrity Probation for one (4 ful 9 this pe academic work ntay be sublect ts enhanced scruling. Your signature be food. and accept respensibilty for this vioiation and its consequences, Sincel PHD Chair, Academic Integrity Committee at a violation of scadiemic integrity duci. The Academic integrity Commities iow confirms that you nave rexa, JOSE EMMANLER C Contact Numer; 08783514574 Altes: ASHLEY WAITS INSTRUCTIONS Kindy print ard aubmit this form te the Office of tte Dean"
    },
    {
        "image": "acknowform1_synth_3_aug5.png",
        "label": "acknowform",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Office of Student Affairs STUDENT CONDUCT ACKNOWLEDGEMENT FORM Dear Student, This acknowledgement form serves to officially document a violation of academic integrity standards as defined by the university s policies on scholarly conduct. The Academic integrity Committee has completed is investigation into allegations regarding your submitted requirements for ENG 101 English Composition and Rhetoric. FINDING OF RESPONSIBILITY: Based on substantial evidence including plagiarism detection software results and testimony from the course instructor, Dr Whitney Murphy, the committee finds that you are responsible for academic dishonesty: plagiarism invoWving substantial portions of text copied without proper attribution. This constitutes a serious breach of academic trust. ACADEMIC PENALTY: The following academic sanctions are hereby imposed: a grade of ZERO (0) for the submitted requirement, a reduction of one full etter grade in the final course grade, mandatory completion of the tacademic Integrity Seminar, and a formal notation on your academic transcript, FUTURE IMPLICATIONS: ‘This violation will remain part of your permanent academic record. Any subsequent violation will result in more severe penalties including automatic failure in the course, suspension from the university, or permanent dismissal. EDUCATIONAL REQUIREMENTS: You must complete attendance at three (3) sessions of the ‘Academic integrity Workshop conducted by the Teaching and Learning Center and submit a comprehensive research paper on the importance of academic honesty. PROBATIONARY STATUS: You are hereby placed con Academic Integrity Probation for one (1) full academic year. During this period, all Your submitted academic work may be subject to enhanced scrutiny. Your signature below confirms that you have read, understood, and accept responsibilty for this violation and its consequences. Sincerely. JOSE EMMANUEL C. REYES, PhD Chair, Academic Integrity Committee JENNA BROWN Student Number; 2022 61609 SIGNATURE OVER PRINTED NAME OF STUDENT Date November 16, 2025 09743514514 Facultv Colleae School institute Contact Number College of Social Sciences and Philosophy Attested: ASHLEY WATTS “SIGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date: November 17, 2025 INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_4_aug1.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF THE PHILIPPE ES OHIMAN Difice of the Vice Chancellor tor Student AN3HS SCIPLINARY ACTION NOT 7 fairs has of university pot ation regarding viofation The Ctice of Stute occurred on Seplomber Nc The ar Student, This lelter serves as formal nal 4 in the Sludent Handbook and Code of Conduct o reguianons 2s outined svolvement in an fncicent tha TURE OF VIOLATE ed a report concerning your ine Administration Builsing, NAT 12 feileawing offense: fallure to comply with safety and sec ions. This behavior ig in diract violation af Arlicie 5, Secton IWARY ACTION: Alter careful review acts and your 4, 2028, the Student Discipsaary Commit coord, community serv receive estiga 24, 2025 at Campus Cuadrangie r that you committe: Js a5 mandated by university regu ity Student Code of Conduct itten explanation submitted on September 2: Wye fokowing sanction: written reprimand with Rete fective immediately and shall re HEC 1 in Sta ain in your permanent student record. T jong of this disciplinary action, inckiding: completion of 34 hours of community service wittin the u inandatery atendance at the Student Conduct Workshop scheduled for November 27, 2025, snd regular meetings wf the Gua Affairs Office, RIGHT TO APPEAL. Yau hiave the right to aopest this decision within five (5) worng Gays from receipt of [his notice Appeals toust be submitied in wiiting to the OF Vice Chancellor for Student Affairs. By signing below, you acknowledge receip! anid undierstancting of this diszipinary ackon a agree to comply with at nsed conditions, Respeciiully, MARIA CHRISTINA R. SANTOS Died ice of Student Aftzis ours}. This decsion is DITIONS: You are required te comply with aif con: 81830 Stadent Phuedver SiGHATURE OVER BRATTE: tate November 16, 2025 9094493464. Conmact Number College of Architect Attexted: DRIGUEZ ENT GUSRDAN INSTRUCTIONS Kindy print and submit this ferm to the Office of the Bear"
    },
    {
        "image": "acknowform1_synth_4_aug2.png",
        "label": "acknowform",
        "ocr_text": "DILMAN PIN dent Att WVERSITY OF THE PHIL Chancellor for ‘office of the Vie STUDENT DISCIPLINARY ACTION NOTE y poticles dant, This sete! tees as formal notification regarding a vietation of un nd ouutin 2 Sludent Handbook and Code of Genduct, The Oifice of Student Affairs has vivedi and investigated a report concerning your invelvernent ip an incident thal occurred on Sepi agie near the Adnunistration Building. NATURE OF VIDLSTICN: the ligation determined that you committed the folowing offense: failure fo comply with sataty and security proloccis as mandated ny university regulations. This behavior is in dvect violation of Arbeie on 10 af iv We of Conduct, DISCIPLINARY ACTION, After careful review cf the fas your woilten explanation submited on September 24, 2025, ihe Student Diseipinary Conwnittee has decided to impnse the followeng sancton: written reprimand with notation in student record, community service (40 fours). This decision 2 immediately ane shat remain in yeur perma nt record, TERMS AND CONDITIONS: You ate required 16 comply with aff conditin aiseipinary action, inctuding. cumpistion of 34 hours of communtiy servi fendance at the Student Conduct Workshop scheduled for November 27, 2025, and regular meelings with the Stacent Atairs Offic RIGHT TO APPEAL: You have the rgh! to appeal this decision within five (5) working days from receipt of this potiog. Appeals must he submitted ms writing fo the Office of the Vice Chancellor for Stugent Afairs. By signing stow, you ackrowledge receipt ang understanding c: ary action and agree to comply with alt 08 SRA CHRISTINA R SANTOS Director, Otfice of Student Affairs nod in ths es studi Student Number 2020 f Contect Minter 0405164 Attested: JOHNNY RODRIGUEZ ~HGRATURE OVER PRU FRD NAME OF RARERITGURESIEN Wate: Movember I, 2 INSTRUCTIONS Kindy print and submit this form te the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_4_aug3.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Office of the Vice Chancellor for Student Affairs JEREMY LOWE ‘SIGNATURE OVER PRINTED NAME OF STUDENT Student Number; 2020 81830 re Date November 16, 2025 Facultv Colleae School inctitute 7 Contact Number: 09149316426 College of Architecture SS Attested: JOHNNY RODRIGUEZ SIGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date: November 17, 2025 SS ES INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_4_aug4.png",
        "label": "acknowform",
        "ocr_text": "VE RSITY OF THE PHILIPPINE: Office of the Vice Chancellor for Student Altai STUDENT DISCIPLINARY ACTION NOTIC! Der Student, as outlined in the Student Hai 8 torimia! oiation of and Code of Conduct regula received and investigates a your Investigation determined that you committed the fohowing offense: faiture to comply andated by university re This be 's in direct violation of art fe of Cons PY ACTION, Atier milled of Seplember 24, 2625, the Student Disciptin in student fety and security etic protocals 10 ot the Unt ul review of the tacts and your fo written ex has ded impose the following sanction. written reprimand with not hours). This decision is effective imn AND CONDITIONS. You are requi completion of 34 nours of commu Conduct Workshop schedu! RIGHT TO APPEAL: Yo: S must be sul fy service with meetings with the S ¥, you acknowk ditions. Resp Sge rece fo comply with alt ident Stustent Sumber 2020 84830 Contact Mumber: 091403564."
    },
    {
        "image": "acknowform1_synth_4_aug5.png",
        "label": "acknowform",
        "ocr_text": "PHILIPPINES DIUMAN UNIVERSITY OF THE Office of he Vice Chancellor for Student Afairs: STUDENT DISCIPLINARY ACTION NOT Nation of university polities and student Affairs has on September yet as formal notification regarding 2 e Student Handbook and Cade of report concerning your involvement in an inc 2 Administration fullding. NATURE OF VIOLATION: The <i that you committed the following offense: failure to comply with safely and security cniversity regulations. This heheeor is in direct vioistion of Aricie 8, Section duck, DISCIPLINARY ACTION: After careful review of the 24, 2028, 3 rt Discs ittee has decided t0 Dear Student, This letter 2A, 2025 at Camp investigation deterntn protocols as mandated bs the University Student Code yriftan exptanation submitted on Sepiernber impose the following sanction: weiten reprimand wih notation i hours), This dects diately and shall remain in your permanent student AND CONDITIONS: fe required to comply with al conaitions of this 4 completion of 24 hours of community service within the universily, mandat y atten conduct Worksop schecided for Never! 2085, end regular mestings with the Sumtent Afi Oi Wes RIGHT TO APPEAL: You have the right to appeal this decision within five (S) warding 78% notice. Appeals must be sub Student Affairs. By signitg Office. ceipt of this, View Chanceior te ipinary action anc Stuxdent Number: Contact Numiser: 00149340428 SacultciCaitene Scbaai inttate cine 198 oF SI Aateston JOM RODRIGUEZ INSTRUCTIONS Kindy print and submit this form te the Offize ef the Dean"
    },
    {
        "image": "acknowform1_synth_5_aug1.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS. coffins uf Studerd AM sTupeNt CODE OF CONDUET AGREEMENT otcies ag documented By Te 49. 2028 at Samipaguta Ha, city ant orversily resisentiat 9 min question eccurad OT ere aes vcorentary student. VIOLATION DEV ALS: Campus Seo fosting ynauinorizes overrignt quests i sage Sechon Tote Universtiy gation was conmuctest BY INS anitory resients an mat novice eaaresses 2 voiation oF ent Office. The meee: iners you CaTeriy FESIE OS registered pormitory Statt have reported te soRoWING P vrotation of wisi pomeles. These BEG ar STIGATION near Suudent, TH seammitery Manages” psncy anteactions: xpressiy pronintied wit JAAR A inoroug terdews wait ‘i Reesudemas Le Handbook, HVE ormiory Cisepanery Board ipekuting rernew oF security 1OOTAGE ren statement subenlted on SepSeANDS g28, HOUSING SANCTIONS: godt vntnen avamning fo Be placed your eon of your wit rive wnmesiaiaty, whe folowing ageisential sanctions are AE He. restietion trem dosmatery COMMON creas tor weeks, mancatory af cowie, payment of BES a6 GMI rotaiing 1 916 00, and probatonny powwNg EXPECTATIONS. During Your OF auonaty peried, you rust eaaintat exemplary nce to a cormatnry poweies. TS Requdes observance of aut now s (10 9g PM vena yt visor poiiies, an caoperaro sea dormitory stall, REHABILITATION You are required to moet Hwee ph the Resist fe CoarceN ater and complete 47 day sence. FIBANGIAL PEL OUNTABE ITY: Payment of P1076 0 must he mace _o settle wit recut if a hold an your student staft, and exate dance at the Residential aowsing Life Responenity status. BEHAVIORA, ner to the university Cashiers Office WARE fee (15) days. Pats og receipt of inis ritice and Your ammnitment f9 eling all unposed wenjential Lite and Housing Servic account, Your signature acknowt Nancsons. Respectiulty submnete, At CRUZ DEC ANTONIO 10\" faudens Hemnber SGT OVE ane «Hevea 19 2025, “Sila Scheele stron FEAT Caen Rturaises Autested: SHANNON BRYANT “GERRI GR SRE EaS HARA OF #4 TRON gees Novesnoet 18 abmiit this form ko the Oe ofthe Beer INSTRUCTIONS"
    },
    {
        "image": "acknowform1_synth_5_aug2.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF Olfice of Stude ITO TOMAS STUDENT CODi SREEMENT ‘eat Student, This tarmal notice addres Sonn where you currently reside a8 a registered dormiftory shut Dorniory Staff have reported siviaiien of visitor policies. These actions are expressly prohibited under Section 7 of the Unwersity Residential Life sar INVESTIGATION SUMMARY: A thorough investigation was conducted by Ihe review of 8 fon of your written statera: Hately, the following residential sanctions are imposed: writlen warning fo be placed in your ton from dormitory cumman areas f0 5, mandatory attendance at the Reside Life Responsitiity Workshop, payment af fines anu damages foialing 1 018 09, ans probat status. GEHAVIORAL EXPECTATIONS: Ouring your probationary period, you must mainfain exemplary candy ico to all dormary po! Includes observance of quiet hours (10 00 PM ie 6 00 AN), compliance with viskor golicies, and cooperation with dormitory siaif, REHABILITATION REQUIREMENTS: You are required to mee! bi weekty with the Restsentia! Life Coordinator and complete 47 ho nity service, FINANCIAL AG! STY: Payment of 1 078 00 must be made fo the University Cashier s Office wit en (13) day sete walt re account, Your siinutire acknowledges receipt of this notice and your commitment to fuiflting a spose sanctions, Respecttully submitted, ANTON! JOSE M. CRUZ Direc esidential policies as documented by the ory Management Office. The incident in question occurred on September 19, 2028 al Sampaguita Hal, cd VIOLATION DET AHS: Campus Securiy z esting unauthorized overnight £5 Of dormitory com, in 8 hold on your student 4 esidenttal Lite and Housing Se Student Noonber Contact Nueniver “BenATIRE OVER PRINTED THK OF DARETGUARTIN Date: idovember 18, 2026 INSTRUCTIONS Kindly print and submit this form to the Oftice of the Dean"
    },
    {
        "image": "acknowform1_synth_5_aug3.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY oF SANTO TOMAS Office of Student Affairs ang Services Date: November 16, 2025 Facultv Colleae Scho, ‘Student Number: 2024 76543 NAME OF STUDENT Schoo! of information Technology ne Contact Number Attested: 09303286597"
    },
    {
        "image": "acknowform1_synth_5_aug4.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Ofice of Statens anairs and Services STUDENT CODE oF ocy Dest Stud NOUCT AGREE Ener “ent, This formal notice addresses a vistaton of SWEESIY Cesidestiat rosiciog ag ocumentes by me Dormitory Managersent Office. The incwant in Sesion eciared on September 19 2 whete You curerty resige as a feghitered dor Goneitery sist nave 6 tense MitOrY Student YO. a: 18d the fotaving Policy infractions: postin Wolalon of ister policies. thes, ScHONS ae expressly profited undey Reskientiay ite Handboox, STGATION SUMMARY. a Shorougt. Wivesty Dotritory Bisciotinary Soare, Including review of security footage, intern S37, ana CXamingtion of YOUr writen Satine: Submitted 25. HOUSiNe: Sénen Evlecinve immediateiy. tne roa, Tesidealiat ssnctons are impose writen ws Rou Tows. 9 (9 be paced et your Sormitary common areas tor 4 WeEKS. thancatory attendance at the Resiae: OB, Payment of tines sit Samnayes totaling #4 319 99 PECTATIONS: Su Satlon Was conducted ay tne POS Wet Gomntory resiconts ang Seplemoer 24, 2036 ONSIDHity Works Status, BENSViORAL conetiaet an Hct ithe: YO probationary perio, you rust y r 76708 10 af dormitory policies. nag ‘nchidas observance of guist ROUES (10 00 PM tn 8 00 Axi, comphance win vstos Bolicies, and cooperation vats SOrmOry Sa, REHABILITATION, REQU TS\" You ave required to p Resitentiat Le Cours hours of dermitery Sommurity service. Sinus a fa thet University Cashier s tecount Your ator and comptets a7 Y: Payment 2f 3 018 00 must be mate eitic Wilt result in 2 hk oF FOUr stunens nd your comminnent ta Fattting 36 imposed Director, Resicentie tte ang Housing s i CUNT AB) 198) days. Faiturs te g fof fhis note JOSE M. cruz C2 within fitted: Signature ackrovatedges rexein SOnclions. Respecthaty sepmiieg ANTONIO. ices ‘Shident Nurctiny Cootect Mumnber"
    },
    {
        "image": "acknowform1_synth_5_aug5.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Office of Student Affairs and Services"
    },
    {
        "image": "acknowform1_synth_6_aug1.png",
        "label": "acknowform",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES. ‘Student Development and Services Office BEHAVIORAL WARNING ACKNOWLEDGEMENT Dear Student, This formal notice addresses a violation of university residential policies as documented by the Dormitory Management Office. The incident in question occurred on October 07, 2025 at Narra Hall, where you currently reside as a registered dormitory student. VIOLATION DETAILS: Campus Security and Dormitory Staff have reported the following policy infractions: failure to maintain cleanliness standards resulting in health and safety concerns. These actions are expressly prohibited under Section 8 of the University Residential Life Handbook. INVESTIGATION SUMMARY: A thorough investigation was conducted by the Dormitory Disciplinary Board, including review of security footage, interviews with dormitory residents and staff, and examination of your written statement submitted on October 14, 2025. HOUSING SANCTIONS: Effective immediately, the following residential sanctions are imposed: written warning to be placed in your housing file, restriction trom dormitory common areas for 4 weeks, mandatory attendance at the Residential Life Responsibility Workshop, payment of fines and damages totaling 2 871 00, and probationary housing status. BEHAVIORAL EXPECTATIONS: During your probationary period, you must maintain exemplary conduct and strict adherence to all dormitory policies. This includes observance of quiet hours (10 00 PM to 6 00 AM), compliance with visitor policies, and cooperation with dormitory staff. REHABILITATION REQUIREMENTS: You are required to meet bi weekly with the Residential Life Coordinator and complete 60 hours of dormitory community service. FINANCIAL ACCOUNTABILITY: Payment of 2 871 00 must be made to the University Cashier s Office within fifteen (15) days. Failure to settle will result in a hold on your student account. Your signature acknowledges receipt of this notice and your commitment to fulfilling all imposed sanctions. Respectfully submitted, ANTONIO JOSE M. CRUZ Director, Residential Life and Housing Services ANTHONY AGUILAR Student Number: 2023 25058 SIGNATURE OVER PRINTED NAME OF STUDENT Date: November 17, 2025 Facultv Colleae Schoolinst College of Science Contact Number: 09249146856 Altested: REBECCA PERRY ‘SIGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date November 20, 2025 INSTRUCTIONS indy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_6_aug2.png",
        "label": "acknowform",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Student Development and Services Office BEHAVIORAL WARNING ACKNOWLEDGEMENT Dear Student, This formal notice addresses a violation of university residential policies as documented by the Dormitory Management Office. The incident in question occurred on October 07, 2025 at Narra Hall, where you currently reside as a registered dormitory student. VIOLATION DETAILS: Campus Security and Dormitory Staff have reported the following policy infractions: failure to maintain cleanliness standards resulting in health and safety concerns. These actions are expressly prohibited under Section 8 of the University Residential Life Handbook. INVESTIGATION SUMMARY: A thorough investigation was conducted by the Dormitory Disciplinary Board, including review of security footage, interviews with dormitory residents and staff, and examination of your written statement submitted on October 14, 2025. HOUSING SANCTIONS: Effective immediately, the following residential sanctions are imposed: written warning to be placed in your housing file, restriction from dormitory common areas for 4 weeks, mandatory attendance at the Residential Life Responsibility Workshop, payment of fines and damages totaling 2 871 00, and probationary housing status. BEHAVIORAL EXPECTATIONS: During your probationary period, you must maintain exemplary conduct and strict adherence to all dormitory policies. This includes observance of quiet hours (10 00 PM to 6 00 AM), compliance with visitor policies, and cooperation with dormitory staff. REHABILITATION REQUIREMENTS: You are required to meet bi weekly with the Residential Life Coordinator and complete 60 hours of dormitory community service. FINANCIAL ACCOUNTABILITY: Payment of ®2 871 00 must be made to the University Cashier s Office within fifteen (15) days. Failure to settle will result in a hold on your student account. Your signature acknowledges receipt of this notice and your commitment to fultiling all imposed sanctions. Respectfully submitted, ANTONIO JOSE M. CRUZ Director, Residential Life and Housing Services ANTHONY AGUILAR: Student Number 2023 25058 SIGNATURE OVER PRINTED NAME OF STUDENT Date: November 17, 2025 Facultv Colleae Schoal Inetitute Contact Number: 09249146856 College of Science Attested: REBECCA PERRY ‘SIGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date: November 20, 2025 INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_6_aug3.png",
        "label": "acknowform",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Student Development and Services Office BEHAVIORAL WARNING ACKNOWLEDGEMENT Dear Student, This formal notice addresses a violation of university residential policies as documented by the Dormitory Management Office. The incident in question occurred on October 07, 2025 at Narra Hall, where you currently reside as a registered dormitory student. VIOLATION DETAILS: Campus Security and Dormitory Staff have reported the following policy infractions: failure to maintain cleanliness standards resulting in health and safety concerns. These actions are expressly prohibited under Section 8 of the University Residential Life Handbook. INVESTIGATION SUMMARY: A thorough investigation was conducted by the Dormitory Disciplinary Board, including review of security footage, interviews with dormitory residents and staff, and examination of your written statement submitted on October 14, 2025. HOUSING SANCTIONS: Effective immediately, the following residential sanctions are imposed: written warning to be placed in your housing file, restriction from dormitory common areas for 4 weeks, mandatory attendance at the Residential Life Responsibility Workshop, payment of fines and damages totaling 2 871 00, and probationary housing status. BEHAVIORAL EXPECTATIONS: During your probationary period, you must maintain exemplary conduct and strict adherence to all dormitory policies. This includes observance of quiet hours (10 00 PM to 6 00 AM), compliance with visitor policies, and cooperation with dormitory staff. REHABILITATION REQUIREMENTS: You are required to meet bi weekly with the Residential Life Coordinator and complete 60 hours of dormitory community service. FINANCIAL ACCOUNTABILITY: Payment of ®2 871 00 must be made to the University Cashier s Office within fifteen (15) days. Failure to settle will result in a hold on your student account. Your signature acknowledges receipt of this notice and your commitment to fulfilling all imposed sanctions. Respectfully submitted, ANTONIO JOSE M. CRUZ Director, Residential Life and Housing Services ANTHONY AGUILAR Student Number 2023 25058 SIGNATURE OVER PRINTED NAME OF STUDENT Date: November 17, 2025 Facultv Colleae School institute Contact Number: 09249146856 College of Science Attested: REBECCA PERRY ‘SIGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date November 20, 2025 INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_6_aug4.png",
        "label": "acknowform",
        "ocr_text": "POLYTECH f UNIV TY Gi THE Pt Suudent Development and Services Office BEHAWO AL WARNE 5 vinkati Incident in qu fed dormitory LS: Campus maintain 1 Section 8 of t \\y probioned ta AMARY. thorcug! vestigation was thon of your wri using fie, restriction fom dorri AGMS: Dunng y ali F policies ory po ‘on with gory LITATION NTABILITY: F tinstor and nt of BY 87 1 00 must be made hours of dormitory community service to the University Castiei s Office within i account. Your signature acknowsle oni to ful elfully su AIRE OVER PRISTED 1 Contact Murer the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_6_aug5.png",
        "label": "acknowform",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Student Development and Services Office BEHAVIORAL WARNING ACKNOWLEDGEMENT Dear Student, This formal notice addresses a violation of university residential policies as documented by the Dormitory Management Office. The incident in question occurred on October 07, 2026 at Narra Hal, where you currently reside as a registered dormitory student. VIOLATION DETAILS: Campus Security and Dormitory Staff have reported the following policy inractions: failure to maintain cleanliness standards resulting in health and safety concerns. These actions are expressly prohibited under Section 6 of the University Residential Life Handbook. INVESTIGATION SUMMARY: A thorough investigation was conducted by the Dormitory Disciplinary Board, including review of security footage, interviews with dormitory residents and statt, and examination of your written statement submitted on October 14, 2025. HOUSING SANCTIONS: Effective immediately, the following residential sanctions are imposed: written warning to be placed in your housing fle, restriction from dormitory common areas for 4 weeks, mandatory attendance at the Residential Life Responsiblity Workshop, payment of fines and damages totaling P2 87 1 00, and probationary housing status, BEHAVIORAL EXPECTATIONS: During your probationary period, you must maintain exemplary conduct and strict adherence to all dormitory policies. This includes observance of quiet hours (10 00 PM fo 6 00 AM), compliance with visitor policies, and cooperation with dormitory staff. REHABILITATION REQUIREMENTS: You are required to meet biweekly with the Residential Life Coordinator and complete 60 hours of dormitory community service. FINANCIAL ACCOUNTABILITY: Payment of 2 871 00 must be made to the University Cashier s Office within fifteen (15) days. Failure to settle will result in a hold on your student account, Your signature acknowledges receipt of this notice and your commitment to futfling all imposea sanctions. Respectully submitted, ANTONIO JOSE M. CRUZ Director, Residential Life and Housing Services ANTHONY AGUILAR Student Number 2023 25058 SIGNATURE OVER PRINTED NAME OF STUDENT Date November 17, 2025 Facultv Colleae SchoaVinstitute College of Science 09249146856 Contact Number Attested: REBECCA PERRY “SIGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date November 20, 2025 INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_7_aug1.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Office of Shiuent Affars and Services STUDENT CONQUCT ACKNGWREDGEMENT FORM ear Student, This fommai notice addresses 3 vintaton of univer sly restdenual pokes as documented oy the Dormftory Man agement Office The meageni in question occurred on October 41, 2025 at Samgagute Hist where vou Fun erviy Teside 23 a tester dermtory stugent. VOLATION DETAILS. Campus Securty and Dorrntory Statt have reporied tie fokewang pevicy iniachons tatile to manlan ceantness statviaiae fesuttng if fieann ang safety concems These actuns are expressty pronbted under Secticn 4 ot the Jeteersdy Residential Le Harcuonk INVESTIGATION SUMMARY A Metough myestizaion wes concuctsd By the Dormitory Orscipinary Boars. cluding review of secutty footage interviews with Cormiary resutents 204 Staf, and examination of your wien statement sutmitied on Octoder 13, 2025 HOUSING SANCTIONS Ellecitve mnmedistely, the foloatig reskkentia! sanctens are imposed, writen waning to De Picea ie your Housing ihe. resiretion Mom dormtcry common a eas tor 2 weEkS, mandatory atengance at we Resicentat Lie Responsaity Worksitce, payment of Rings ang camages tataing 1 50 00 ana propanonary rousing Malus, BEPAVIORAL EXPECTATIONS Ouring your provationary pened yeu must manian exemplary Onda and SiIEt adherence 12 38 donmMory povicles Ths metudes obsENance Of quiet NoUrS (10 60 PA to 6 90 AM), compherce with vistor policies. and cooperation wth dormitory staff. REHABILITATION REQUIREMENTS You are required to meat bt weekly weth the Resident tial 1 fe Coorditiator ano compiete 20 hours of dormitary conumunty service FINANCIAL ACCOUNTABILITY. Payment of 1 630 00 must be marse to Me Universty Casheers Office within titeen (15) days Faure fo vette wit reset in a notd on your stutert accent Your signatwe acknowtedges recempt of thes Nobce wna your coMMMeR! to uiteany all MNposed Sanchers, Respecituty sunmittec, ANTONIO JOSE M CRU? Crector, Resdental Lite and Housing Services Modena facntve,, 2079 32 a PRINTED Wat OF Ste Contant tuber: 09394501025 DEREK ONEILL OV _ WERRATORE UFR BAITED WIE OF PARED Date: Newemner 15 2625 CORA INSTRUCTIONS Kindy print and submit this form Lo the Office of the Deen"
    },
    {
        "image": "acknowform1_synth_7_aug2.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Office of Student affairs and Services STUDENT CONDUCT ACKNOWLEDGEMENT FORM hours of dormitory community service. FINANCIAL ACCOUNTABILITY: Payment of 1 630 00 must be made to the University Cashier s Office within fiteen (15) days. Failure to settie will resutt in a hold on your student account. Your signature acknowledges receipt of this notice and your commitment to fuffling all imposed Sanctions. Respectfully submitted, ANTONIO JOSE M. ORUZ Director, Residential Lite and Housing Services TIM ANDERSON Student Number 2020 52197 SIGNATURE OVER PRINTED NAME OF STUDENT Date: November 13, 2025 Facultv Colleae School inctitute 7 Sl ore, 09394601026 ‘School of information Technology SSS Attested: DEREK ONEILL DVM ‘SIGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date: November 16, 2025 INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_7_aug3.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY oF SANTO TOMAS Office of Student Affairs ang Services During your probationary 6 00 Auten Stet acherence to at dormitory eon: Period, you must, This includes 5 00 AM), compliance with visitor Policies, ang Residential maintain e; Of quiet hours (10 00 PM to with dormitory staf, REHABILITATION REQUIREMENTS. You are requred to meet biweekly win ie Lute hours of dormitory TIM ANDERSON ‘Student Number 2020 5219; NeRATURE OVER PRINTED Rabat OF STUDENT Date: November 13, 2025 3, ‘Soren oma Technology Altested: DEREK ONEILL vm DuONATURE OVER PRINTED NAME OF PARENT GUARDIAN jate November 16, 2025 TRUCTONS: Endy i an stmt onthe Oe sn ex"
    },
    {
        "image": "acknowform1_synth_7_aug4.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO Tomes Office Saitert Attairs ans Se arvices: STLDENT CONDUCT ACKNOWLEDGE iT FORM Dear Student, This tormal nofice addresse: walalion of university residential policies as documented by the Docmiory Management Office The incident in question cecured an Cetober 11, 2028 at Sampaguita tall Where you currentty reside as 3 registered divmmitory student, VIOLATION OETA S Cainpus Securtiy as Dormitory Statt have reported the fatowing policy indractions: failure to maintain cleantinass wandards resulting in Reals and satety cansems, These actions ate expressly prohibited under Section 4 of the University Reside: k, INVESTIGATION SUMMARY: thorough investigation was conducted by the Dorautory Oiseiplinary Boara, including review of security Interviews wiih dormitory residents ‘and stall, and examination of your written statement sub 8, 2025, HOUSING SANCTIONS. Btlactive immediately. the t ‘lial sanctions are imposed: written warning to te pled in your ousing te, restrichon from darniiory comman areas for 2 weeks, mandatory attendance at he Resicentiat Life Responsibitty Workstiop, payiaent cf fries acd damages intaling #7 630 00, ana probation y housing Status, BEHAVIORAL EXPECTATIONS: During your protuthonary period, you must mamta e: Conduct Sha stict adherence to all dormitory policies. This mneludes ebservance of quiet ty 3 00 AM), compliance with visto; palletes, and cooperation with darmutory staff. REHABILITATION REGUIREMENTS: You are required tn mae! bi weekly with the Residentis! Lt nator and compiete 20 fours of dormitory community service. nt of P1635 05 musi pe made wt Hers Cfice within fitesn (18) days Failure to settie wit sesutt in 2 hold on your stusent account Your signaiure acknowledges receipt of tis nolice and your commitment! sanctions. Respectfuly subn ng ail imposed Med, SNTOMIO JOSE M. CRUZ Director, Resifential Lite and Housing Services Ti AIDERSON SENATE OVER PRI Date: Novexter #2. 2025 Suan Bumbe Cortact Mewniber Atissied: DEREK ONEML BVM INSTRUCTIONS iGady print and subenit this form te the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_7_aug5.png",
        "label": "acknowform",
        "ocr_text": "VERSITY OF SANTO TOM Office of Student Affairs ana TUDENT CONDUCT ACKNOWLEDGEM Denr Student, This formai not Dormitory Managem 2 actions are expressly prohibited under Section 4 of the jentia! Life Handbook, INVESTIGATION SUMMAR'? 4 thorough investi by the Dorniiory Disciplinary Board, including review ar ang examination of yaur written stateine clus tmrnediately, the totowing resident dents mitory footage, inferviews wilh son October 18 3 SANCTIONS: anctions are imposed: writlen warning to be plac sing file, restriction from dormitory common areas ter 2 weeks, mandatory attendance at the Resie s tolaling 1 830 00, sad pr ial ponsibiiity Workshop, payment of fines ang dan: silonary housing 35. BEHAVIORAL EXPECTATIONS: During your probationary period, you must i adherence to al! demmitory ga! mnpiiance with visitor pol Ir With a ith the Resientia: Lite Coordinator and SILITY: Payment of B1 636 90 must be made University Cashiers Office within fiteen (18) days Fatiure te seitle will result m a noid an yo ignature acknowiecges rec mitment tet FTONIO JOSE M. ORL. recount, Your s upmiite font Number: 2020 52197 ARE OF SHUBENT Contact Mumber: 983946040 Attestedt INSTRUC nd submit this forms te the Office of the Oean IONS Kindy print"
    },
    {
        "image": "acknowform1_synth_8_aug1.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF THE PHILIPPIIES 94 y Office ot tp ice Chancetior S0F Stucem Attairs STUDENT CODE OF con Dear Student Thy acknowledgement Staraleras a3 defined by the COIpieieg Jevestigation Composition ant saicy plagiarism detection so Caninittes fas Slectranic ye WUCT AGREEMENT form serves to oft TSHY S policies on schotsely coy ct. otecstiens regardicn youre Sebtnitted ra FINDING OF RESPONSIBn Fry Based a fe fesuits and testimony trom the tou Hat you are Cialy document a v Slalion of scademsic The Acagemic tntegs ‘auiremens tor Er Substantial evidence i strucasr, integrny ifiy ity Commies: has 0? Engien Rehsding Richaea Tanner me uasaitnorzed materials art ACH OF academe best ACADEME G} for the submited 2 Piancatory compte ot tye URE IMPLina: NS: 7 permanent Kademic rern, aay Sabsequen: Sidiation wit fesult ia aetna furs in the course, suspenee, fo te un REMENTS: You must complete ate; rortestags cones 2 dishonesty. use leiter grade iy nd a formap scadenn: fotation on your Feity, OF permanent Acadenvic integrity Tetance at thee (3) sessions of the Sucled by the Teaching ang Lear ny Center ana ste TERERICH Dapier on the importance of Beaders ha i comprencnesive nest). PROBATIONARY sraTus YOu are heresy piaced GRE (1} ful acadetey ng thls penod, al your submited Shanced Scrutiny. Your stenature Dele conioms that your have read NY for this vitasion anal ts consi ehees. Sinceraly. JOSE KHBY De sudiect to JANET Hur Rutt Humber: 2 Conece Purves Atsested, BICHARL HERAAH INSTRUCTIONS Sindy Point and subroit this form te the Office of the Bean"
    },
    {
        "image": "acknowform1_synth_8_aug2.png",
        "label": "acknowform",
        "ocr_text": "ES OIIMAN TY OF THE PHILIPPIN Unt Office of th ior for Student Aras Chane! UCT AGREEMENT UDENT CODE OF CON emi integrity gnty Committee bas ciaily document a violation of “inte Student, Tuis acknowiedgerent form serves te c y s paliies on scholarly conduct. The: AC stand ny the university mpieted its investigation into allegations regarding your subraited requirements for ENG 761 English Composition anc Rhetoric FINDING OF RE FY: flased on substantial evidence incluting ctor, Dy. Richard Fanner, me 9 results aed festimony trom the course inst of unauthorized breach of academic plagiarism detection softs ni you ate respon electro g examinations. Ths ENALTY: The following academic sanctions are hereby imposed: a grace of Zé i ietter grace in the Ena! course grade, mandatary comoretion sn on your academic tar IMPLICATIO emanent academic record. Any subsequent visiation wit result chsinn fravn the university, of permanent ie for academuc oishore: oramttes: finals more sismissal. ED! Acad cs ‘esearch fiapo! on the importance of academic honesty. PROBATIONARY STAI on Academe probation for one £1) full acagensic year, Luring this perieg, all your subratied demic work may be SYbj od gorutiny. Your signature below uo have read ood, and accep! Tesponsibilty for this violation arnt its consequences, Siicere! REYES, Ped Chair, Academic integrity Committ you! placed cl to emhane under: 2023 74267 Suadent Nuniber TIGNATURE GW uP gar 19a77% Contact Mummers attested: MICHAEL HERMAN BURRS BARE iA WURE GUER BRINE MAME OF 20, 200 INSTRUCTIONS Kindy print aod submit this form to the Office of"
    },
    {
        "image": "acknowform1_synth_8_aug3.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Office of the Vice Chancellor for Student Affairs STUDENT CODE OF CONDUCT AGREEMENT Dear Student, This acknowledgement form serves to officially document a violation of academic integrity standards as defined by the university s policies on scholarly conduct. The Academic Integrity Committee has completed its investigation into allegations regarding your submitted requirements for ENG 101 English Composition and Rhetoric. FINDING OF RESPONSIBILITY: Based on substantial evidence including plagiarism detection software results and testimony from the course instructor, Dr. Richard Tanner, the committee finds that you are responsible for academic dishonesty: use of unauthorized materials and electronic devices during examinations. This constitutes a serious breach of academic trust. ACADEMIC PENALTY: The following academic sanctions are hereby imposed: a grade of ZERO (0) for the submitted requirement, a reduction of one full letter grade in the final course grade, mandatory completion of the Academic Integrity Seminar, and a formal notation on your academic transcript. FUTURE IMPLICATIONS This violation will remain part of your permanent academic record. Any subsequent violation will result in more severe penalties including automatic failure in the course, suspension from the university, or permanent dismissal EDUCATIONAL REQUIREMENTS: You must complete attendance at three (3) sessions of the Academic integrity Workshop conducted by the Teaching and Learning Center and submit a comprehensive research paper on the importance of academic honesty. PROBATIONARY STATUS: You are hereby placed on Academic Integrity Probation for one (1) full academic year. During this period, all your submitted academic work may be subject to enhanced scrutiny. Your signature below confirms that you have read understood, and accept responsibility for this violation and its consequences. Sincerely, JOSE EMMANUEL C REYES, PhD Chair, Academic integrity Committee JANET HUNT ‘Student Number: 2023 74267 ‘SIGNATURE OVER PRINTED NAME OF STUDENT Date November 17, 2025 Faculty Colleae School institute Contact Number: 09719227244 School of Economics Attested: MICHAEL HERMAN SIGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date: November 20, 2025 INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_8_aug4.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Office of the Vice Chancellor for Student Affairs STUDENT CODE OF CONDUCT AGREEMENT Dear Student, This acknowledgement form serves to officially document a violation of academic integrity standards as defined by the university s policies on scholarly conduct. The Academic Integrity Committee has completed its investigation into allegations regarding your submitted requirements for ENG 101 English Composition and Rhetoric. FINDING OF RESPONSIBILITY: Based on substantial evidence including plagiarism detection software results and testimony from the course instructor, Dr. Richard Tanner, the committee finds that you are responsible for academic dishonesty: use of unauthorized materials and electronic devices during examinations. This constitutes a serious breach of academic trust. ACADEMIC PENALTY: The following academic sanctions are hereby imposed: a grade of ZERO (0) for the submitted requirement, a reduction of one full letter grade in the final course grade, mandatory completion of the Academic Integrity Seminar, and a formal notation on your academic transcript. FUTURE IMPLICATIONS: This violation will remain part of your permanent academic record. Any subsequent violation will result in more severe penalties including automatic failure in the course, suspension from the university, or permanent dismissal. EDUCATIONAL REQUIREMENTS: You must complete attendance at three (3) sessions of the Academic Integrity Workshop conducted by the Teaching and Learning Center and submit a comprehensive research paper on the importance of academic honesty. PROBATIONARY STATUS: You are hereby placed ‘on Academic Integrity Probation for one (1) full academic year. During this period, all your submitted academic work may be subject to enhanced scrutiny. Your signature below confirms that you have read, understood, and accept responsibility for this violation and its consequences. Sincerely, JOSE EMMANUEL C. REYES, PhD Chair, Academic Integrity Committee 2023 74267 JANET HUNT. ‘Student Number ‘SIGNATURE OVER PRINTED NAME OF STUDENT Date: November 17, 2025 Facultv Colleae SchooW institute Contact Number; 09719227244 ‘School of Economics Attested: MICHAEL HERMAN SIGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date: November 20, 2025 INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_8_aug5.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Office of the Vice Chancellor for Student Aftairs REYES, PhD Chair, Academic integrity Committee JANET HUNT Student Number: 2023 74267 ‘SIGNATURE OVER PRINTED NAME OF STUDENT ae Date: November 17, 2025 Facultv Colleae School institute Contact Number: 09719227244 ‘School of Economics TS Attested: MICHAEL HERMAN SIGNATURE OVE 'R PRINTED NAME OF PARENT GUARDIAN Date November 20, 2025 INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_9_aug1.png",
        "label": "acknowform",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Office of Student Affairs STUDENT CONDUCT ACKNOWLEDGEMENT FORM Dear Student, This formal notice addresses a violation of university residential policies as documented by the Dormitory Management Office. The incident in question occurred on October 18, 2025 at Kalayaan Residence Hall, where you currently reside as a registered dormitory student. VIOLATION DETAILS: Campus Security and Dormitory Staff have reported the following policy infractions: failure to maintain cleanliness ‘standards resulting in health and safety concerns. These actions are expressly prohibited under Section 8 of the University Residential Life Handbook INVESTIGATION SUMMARY A thorough investigation was tesidents and staff, and examination of your written statement submitted on October 25, 2025. HOUSING ‘SANCTIONS: Effective immediately, the following residential sanctions are imposed: written warning to be placed in your housing file. restriction from dormitory common areas for 2 weeks, mandatory attendance at the Residential Life Responsibility Workshop, payment of fines and damages totaling 1 376 00, and probationary housing status. BEHAVIORAL EXPECTATIONS: During your probationary period, you must ‘maintain exemplary conduct and strict adherence to all dormitory policies. This includes observance of quiet hours (10 00 PM to 6 00 AM), compliance with visitor policies, and cooperation with dormitory staff. REHABILITATION REQUIREMENTS: You are required to meet bi weekly with the Residential Life Coordinator and complete 43 hours of dormitory community service. FINANCIAL ACCOUNTABILITY: Payment of 1 376 00 must be made to the University Cashier s Office within fifteen (15) days. Failure to settle will result in a hold on your student account. Your signature acknowledges receipt of this notice and your commitment to futfiling all imposed sanctions. Respectfully submitted, ANTONIO JOSE M. CRUZ Director, Residential Life and Housing Services MICHAEL GIBBS ‘Student Number; 2022 82212 SIGNATURE OVER PRINTED NAME OF STUDENT Date November 15 2025 Faculty Callens School ntaae Contact Number; 09261154495 College of Engineenng Attested: BRIAN WILSON “SUGNATURE OVER PRINTED NAME OF PARENT GUARDIAN Date: November 16, 2025 INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_9_aug2.png",
        "label": "acknowform",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Office of Student Aftairs ‘STUDENT CONDUCT ACKNOWLEDGEMENT FORM Dear Student. This formal notice addresses a violation of university resitential policies as documented by the BRIAN WILSON [| MONATURE OVER PRINTED NAME OF PARENT GUARDIAN Date November 16, 2025 —e— INSTRUCTIONS Kindy print and submit this form to the Office of the Dean"
    },
    {
        "image": "acknowform1_synth_9_aug3.png",
        "label": "acknowform",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Office of Student affairs iccount. Your Director, Residential Lite ang Housing Services MICHAEL GIBBS SIGNATURE OVER PRINTED NAME OF STUDENT Date November 15, 2025 Facultv Colleae Schoolnatiitey College of Engineering Attested: BRIAN WILSON sanctions. Respectfully 5 Signature acknowledges receipt of this notice and ‘ubmitted, ANTONIO JOSE M, CRUZ Student Number 2022 82212 TT Contact Number: 09261154495"
    },
    {
        "image": "acknowform1_synth_9_aug4.png",
        "label": "acknowform",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY (Office of Student Affairs STUDENT CONDUCT ACKNOWLEDGEMENT FORM Dear Student, This formal notice addresses a violadon of university residential policies as documented by the Dormitory Management Gmoe. The incident in question occurred on October 18, 2025 ai Kaiayaon Residence Hail, where you current reskte as a registered dormitory student. VIOLATION DETAILS. Campus Secunty and Dormitory Siatt have reported the iatowing policy infractions: talure to maintain cleaniiness standards resuiting in heath and safety concems. These actions are expressly profioited under Section 8 of ine University Residential Lite Handboor, INVESTIGATION SUMMARY: A thoraugh investigation was conducted by the Dormitory Discipinary Board, including review of securty footage, interviews with dormitory residents and staf, and examination of your wititen statement submitted on Octopet 25, 2025. HOUSING SANCTIONS: Effective immedistely, the fatlowing residentiai sanctions are umposes: written warming to be placed in your housing ite, restricten trom dormtory common areas for 2 weeks, mandatory attendance at the Residentiat Life Responsiditty Workshop, payment of fines amt damages totaling 1 376 00, and probatonary housing status. BEHAVIORAL EXPECTATIONS: During your probationary penod, you must maintain exenipiaty conduct and strcl adherence to af dormitory patcies. This includes observance of quiet hours (10 00 PM 10 6 00 AM), compliance: van visitor policies, and cooperation wit dormitory statt REHABILITATION REQUIREMENTS: You ave required to meet bi weekly with the Residential Ltfe ‘Cocro nator and complete 43 hours cf dormitory community service. FINANCIAL ACCOUNTABILITY: Payment of 1 376 00 must be made to the University Cachler s Office within fitwen (15) days. Fature to sete wet result m a hold on your student account. Your signature acknowledges receipt of this notice and your commftment to futtiing alt imposed sanctions. Respectuly submitted, ANTONIO JOSE M. CRUZ Director, Residential Life and Housing Services Studeort Meenboes 2022 82212 ~~ GHATORE OVER PRINTED NANAE OF STUDENT I Date. Novanter 16, 2425 ineubKaioneticeaetinaianes Coutact Numniver 09281154495 Anested: BRIAN WILSON TATE GAR DRINTID RODE OF OARENT GUARDIAN Dates November 18 2025 INSTRUCTIONS Kindy print and supmit this form te the Office ofthe Dean"
    },
    {
        "image": "acknowform1_synth_9_aug5.png",
        "label": "acknowform",
        "ocr_text": "Dear Stu Tora not anager Comnitery ‘OPEN TB. 2625 at iaiayaar MOERT VIOLATION Gotntory 6; POSES: water wy weeks ential Lite Re. Probationary hous ena ang to be ngs HAWORAL Exg ain iris MBIAIY congue REHAl Lasterence 692M) compiane TATION REQUiEy ANS com, S. This and conpe; OP30F vee oF uit Coordin lets 43 ho FAHON Wath aor Bowesiohy wth the pe HAE FeUTED te MENU Life Urs Of dietary community ser Ke FINANOHEL ac Payment of 1376 60 must Be made to the Universit Sette wat re COUNT ARN ry Pa KOI On your WOU commiment to Directoy Cashiers Ofiee ey MEM ACCOUNT yoy TCHONS Re Housing Service a S Favre te sinature acy: Pecit 5A meoseR 5, ge NOM Reseential wie g this notice any Stuieet Rime, ONE OP STSENT Mace Muinbes AR SIAR INSTRUCTIONS Kinay Print and submit this form ce the Office ot the Bes"
    },
    {
        "image": "acknowform2_synth_11_aug1.png",
        "label": "acknowform",
        "ocr_text": "MELA SALLE UNIVER: Y 201 Tei rns, Marta 1588. tot taney MEMORANDUM OF AGREEMENT ACKNOWLEDGE i “cement oattnennnaseaes Diites rooster 03, 2035 Geer Vico President for Acatioy tile Affars George OF She Partners hips Thomas, Thy *ontocige and cartim our etietion s sccaptance Beament with Bical versity forthe unplemars Han of the “Tectrotagy Franafer ag Herioral io ceatborste with Your estesrmad instlastion iy this OF 4 vents, astablisnes 9 Ermovation Hus ints nershi agreement, which 8 faculty exch 28 ad 1SANS OuESnat iy oY Fesponaitiities: provision af lites, Joint phan) important endeavor The part Sarna all be elfactive foe a sexioet ACS, Meech callabenitian, sal the agreement ard coms pisliied tacuity SY eMtensicn progam, Que institution ily snore Sbligailons in good taith, Heth Patios agrac impternentation, Biocation of MOLES SAY FesoUECES and faci PrOgress eepesting, s5eh cemnpliance ‘wits att tS fe Flt ath ad atetl for seogeasn, NENG six! Coertingtion of eetieltien teguler communication ant Spelcable tas, cegitotions, ang institutional peticies. Trig Partrmenbiys ations. ptt Statsgie piortles nd reinforces ou Sammnitinens te pnviding quali Collstcration wil yiaid signi ty edkcation ad cart benalits for cur students, facatty. act PEAS with Blot ur Institut mnie excellence. Wa siicipale that its fer tha sppcrtucity 1 May Me S888 cur sivcare aperictaton University arsi took fe ON catdating collaboration Our tua iy prepared to SOMMmSnco werk on the agrees ectivitios ine Cestaly upen fiization of aft aamiinistrat Coveeine, please ds not husitote ty convene our S Shands you have 9 ‘Stfice at your sxttiost convenione M6 OY Quasticns or MATTHEW CRAWFORD Authorized Signanne MATTHEW CRAWFORD ean Graduate Seheet ECE; EIVED AND ACH"
    },
    {
        "image": "acknowform2_synth_11_aug2.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY ‘2401 Tah Avena, Nana 1004, Raetio Mies MEMORANDUM OF AGREEMENT ACKNOWLEDGEMENT Date: Wovenbe: 03, 2025 Dear View President for Academic Attairs George Thomas, This letter sarvas to formally acknowledge mid confim our institution s acceptance f the Partnership Agreement with Bicol University for the implementation of the “Technology Transfer and Innovation Hub\" initiative, We ave ‘honored to collaborate with your esteemed institution in this important exdsaver. Tha partnership agoemsnt, which shal be attactive tor a patiod of 4 years, establishes comprehensive frumeverk for cosparation in curicuium develepment, fscutty exchangy, research colaborai an, and community extension programs. Our institition fily endorses the objectives and terms outlinad in the agreenier2 and commits to fulfil alt obtigatians in goed folth Both parties agree to the following kay respensitinies: provision of qualifise faculty and staff for program implementation, atocation of necessary resources and faclities, joint planning and coordination of activities, sega comrmunication and ‘progtnss reporting, and compliance with ali applicable laws, regulations, and insthusicnal paicles. This partnership abgres with on inslitubon s strategic criarties ond reinforces our commitment is providing quaity education and promoting academic excetance. We enticigate that this collaboration wil yield significant banefits for ow students, facuity, and the brvader academic community. We express cu sere appreciation fox the opportunity to pevinor with Bice# University and look forsard to successful and andning cotatnration Our tasm is prepared to commence work on the wgread activities immediately unos finalization of a administrative requirements. Should you have any cusstions or concerns, please do net hesitate 10 contact our office al your emtlest convenience Respectiully yours, MATTHEW CRAWFORD Rithorzed Signature MATIHEW CRAWFORD Dean, Graduate School Print Name and Title a RR RECEIVED ANG ACKNOWLEOGED Page t oft"
    },
    {
        "image": "acknowform2_synth_11_aug3.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Tah Avenue, Manta 1004, Metro Manta MEMORANDUM OF AGREEMENT ACKNOWLEDGEMENT care ase do ot hesitate to contact ou ofice at your eaiest MATTHEW CRAWFORD Authorized Signature MATTHEW CRAWFORD Dean, Graduate School Print Name and Tite November 05 2025 Date Page 1 of 1 RECEIVED AND ACKNOWLEDGED"
    },
    {
        "image": "acknowform2_synth_11_aug4.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avenue, Mania 1004, Metro Mania MEMORANDUM OF AGREEMENT ACKNOWLEDGEMENT Date: November 03, 2025 Dear Vice President for Academic Affairs George Thomas, This letter serves to formally acknowledge and confirm our institution s acceptance of the Partnership Agreement with Bicol University for the implementation of the “Technology Transfer and Innovation Hub” initiative. We are honored to collaborate with your esteemed institution in this important endeavor. The partnership agreement, which shall be effective for a period of 4 years, establishes a comprehensive framework for cooperation in curriculum development, faculty exchange, research collaboration, and ‘community extension programs. Our institution fully endorses the objectives and terms outlined in the agreement and commits to fulfilling all obligations in good faith. Both parties agree to the following key responsibilities: provision of qualified faculty and staff for program implementation, allocation of necessary resources and facilities, joint planning and coordination of activities, regular communication and progress reporting, and compliance with all applicable laws, regulations, and institutional policies. This partnership aligns with our institution s strategic priorities and reinforces our commitment to providing quality education and promoting academic excellence. We anticipate that this collaboration will yield significant benefits for our students, faculty, and the broader academic community. We express our sincere appreciation for the opportunity to partner with Bicol University and look forward to a successful and enduring collaboration. Our team is prepared to commence work on the agreed activities immediately upon finalization of all administrative requirements. Should you have any questions or concems, please do not hesitate to contact our office at your earliest convenience. Respectfully yours, MATTHEW CRAWFORD Authorized Signature MATTHEW CRAWFORD Dean, Graduate School Print Name and Title November 05, 2025 Date RECEIVED AND ACKNOWLEDGED Page 1 of 1"
    },
    {
        "image": "acknowform2_synth_11_aug5.png",
        "label": "acknowform",
        "ocr_text": "BE LA SALLI Rant Tat swan, nwa 1098, Metro Wie AGREEMENT ACKNOWLE! MORANDUM Gi MEI Date: Mevainber 03, 20% acknowéerige and confine our institution s accent vation Hut? initiative, We cit shall be effective for a petiod cearch catiaboratlon, and fuliing 3 tes foam Technology Transfer and inno Dear Vice President for Academic Affairs George Thomas, This etter sen fie Bastnarship Agreement with Bice! University for the imiplemantatcs of the” hhonsved to coftaborate with your esteemed institution in this rmportant ers oy ‘The partnership aginement urd yen, estabishes a comprehensive framework for cooperation: in Cus UAT development, feowity exchange, extecsion pengiams. Ot ine objectiver and terms oullined in the agreement and comm sponsibiliies: provision of qualifies faculty and ataff fer progran dination of activities, regular comeunization and Tinis partnership afigirs with our in excallence. We artic re ey ities, joint planning and coor tation, and fnstiational pol reation and prometing academic ‘he broedor scatiemic commu. ‘Ne express our sineore appreciation il snd enduring coliaboretion. Our team is prepared t© fons in good f aiocation of nacessaly FaS50 aii appiicabie laws, 7g ration: ment to prevising Gus dents, fe edd fook foraard te a susce: inforces ory conrenlin fis for our yield significant bene! ity to pertuer with Bico! U sroed sctivities immediately spon tinalization of 2 Late to contact one offies at your savliest convent 23, Should you have any questions oF i administrative requirement 2, Raspectiully yours, Print Name and THe:"
    },
    {
        "image": "acknowform2_synth_12_aug1.png",
        "label": "acknowform",
        "ocr_text": "UNIVER Siry rt, Mania 1904, Metiy Manga BORATION A CKNOWLEDGER af Univ rein President duudith Sa (MOU ex. Savage, We DE LA SALLE suite fonnaity kncwtedge ERSITY ay 2 Visayas State Uy y Yoru NIV lance of ths Memoonduin katona colisheration and Jnterstenging ins Fostering ings fabliches the teens Pacity Building Sand aed reseaich acty Out instton atfims its cernmiiment to tne Sunelpies sod sbjecty emient ang z vd their achiavesnent. Srineipal ay include er and Faculty moby progr fecitties, joint conte essary 64 calladyovas sssful imoiern Hive 1esearch andl HY extension and yarn scholatty py ahd laboratory ‘Institutions agies te provide education, ex; P cepabitines mnhtinsst, this. co ollaberation Cooperation ang eharect ality of mista cement of forwaid to duit) tive parinershig Oh, UBPOT ani coliaborat ibute to the advan, Det the negetiation process ap ds ready te Yery iraty yours, ioe. agreed programs and 5 ignaiure TIMOTHY RERNANDE, 2 and D APPROVED"
    },
    {
        "image": "acknowform2_synth_12_aug2.png",
        "label": "acknowform",
        "ocr_text": "DELA Sats Eby RSITy R601 Tat venue, ands 1004, sete ane RESEARCH COLLAB CRA TION AG KNOWLEDGE MENT nnn ee ‘ber 08, 2025 Bes University Prasisant duce Savage ‘s8Q¢ receipt and acceptance of th Mernoran BMOU} exacted betawens DE LA gag LE UNIVERSITY ane Visavas State University regarding “Facusiy Devaig Progam”. This agreement ReHentS 8 sigoitcant step fepward in fgg ihe lestikalont collaboration ond sch ane Fission. The MOU estanvishes i Sms and conditions for coop. talon Fn vaous uradern Noveniier 26, 26; tRulion aftinns ts coeaitonant ta th pleat SveMend, Principal amas of collahon faculty mobitty programs, collaborative ceseare BA STeNS Bhd acoder: symposia, ant o PRCENSETY Suoport ard re education We urite ta tommelly acknenl Um OF Understand nent and Capacity Autiging 8 OU Shared ache ties over the periog Suilived in this agcacment andi prrient and program fang of livary aed taboratory AGRE 10 provide *unltes for enbaccing the quality of We are confident thar thexagh mutter ts tonuary 14, 7 168 10 Work dian aticclation, student ap y publications, ANd CUubToRCH activities, Both i Nership offers tramenderee oppor Rettig experiaries for our stun ry wots esotees Spanditey research capabilties, and ceepatation and shavad comnitms Pbiiopine higher sek etien strong ae ord Your cantiauae sup iS pat ing vahuat {1 Collsboration wil yieut sesitive oy Yor both institutions anei advan, “ith the SBI of ceoperotion deenspstnates ‘MouThour the negotaten process ane {ook fenwvaee wr hatte: starts reas to borin 9 Plementatton of the agreed fen, Then you for on. Very thuly yours, em We ap earibate te th ‘aisnd of nrogEaTNS act TIMOTHY Hera, NER TIMOTHY HERMANDE? View Presttont for neactamic As ACCEPTED AND ag PROVED Page tof i"
    },
    {
        "image": "acknowform2_synth_12_aug3.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avenue, Mania 1004, Metro Manila RESEARCH COLLABORATION ACKNOWLEDGEMENT ee Date: November 08, 2025 Dear University President Judith Savage, We write to formally acknowledge receipt and acceptance of the Memorandum of Understanding (MOU) executed between DE LA SALLE UNIVERSITY and Visayas State University regarding \"Faculty Development and Capacity Building Program’. This agreement represents a significant step forward in fostering institutional collaboration and advancing our shared educational mission. The MOU establishes the terms and conditions for cooperation in various academic and research activities over the period from November 26, 2025 to January 14, 2027. Our institution affirms its commitment to the principles and objectives outlined in this agreement and pledges to work diligently toward their achievement. Principal areas of collaboration include: joint curriculum development and program articulation, student and facuity mobility programs, collaborative research projects and scholarly publications, sharing of library and laboratory facilities, joint conferences and academic symposia, and community extension and outreach activities. Both institutions agree to provide necessary support and resources for successful implementation. This partnership offers tremendous opportunities for enhancing the quality of ‘education, expanding research capabilities, and creating valuable learning experiences for our students. We are confident that through mutual cooperation and shared commitment, this collaboration will yield positive outcomes for both institutions and contribute to the advancement of Philippine higher education. We appreciate the spirit of cooperation demonstrated throughout the negotiation process and look forward to building a strong and productive partnership. Our institution stands ready to begin implementation of the agreed programs and activities, Thank you for your continued support and collaboration. Very truly yours, TIMOTHY HERNANDEZ Authorized Signature TIMOTHY HERNANDEZ Vice President for Academic Affairs Print Name and Title November 10, 2025 Date ACCEPTED AND APPROVED Page 1 of 1"
    },
    {
        "image": "acknowform2_synth_12_aug4.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY ‘PAD Tat Avene, Manis 1098, Metro Manta RESEARCH COLLABORATION ACKNOWLEDGEMENT Date: Noversser 08, 2025 Dear University Presidsnt Judith Savage, We write to formally acknowiadge recaipt anni acceplance of the Nlemorardum of Understanding (WOU) executed between DE LA SALLE UNIVERSITY and Visayas Stote University mgarding “Faculty Development and Capacity Bultdiog Progrann’. This agreement represents 2 significant step forward in fostering institutions? coliaboration und advancing our sneved educational mission. The MOU establishes the terms and conditions fe: cooperation in verious academic and research activities over the peried from November 26, 2026 to January 14, 2027. Our institution alfimns its commitment ta the principles and objectives outlined in this agreament and piadges to week diligsntly toward their echievement. Principal aress of collaboration include: joint cuniculum development and program articulation, student and focuity mobility programs. cullaborstive reasearch projects end scholarly publications, shering of ibrecy and laboratory fecitiées, joint conferences and acacemic symposia and community extension anv! outresch activities. Bcth institutions agree to provid ecestary suspart ona rescareas for successfut implementation. This partnership offers tremendous opportunities for enhancing the quality of ‘education, expanding research capabilities, and creating valuatis lesming experiences for our sivdenis. We are confident that through mstuat cooperation and sivred cominitmant, this collaboration wil yield positive outcornes ior both institutions ond contribute to tie advancement of Philippine higher educatios We appreciate the spit ut cooperation det onstrated tiroughou' the negotintion process and look forward! to buibding 2 sirang and productive partnership. Our institution stands ready to begin implementation of the agreed grogams and activites. Thank you for your continued support and coltabomntion. Very indy yours, TIMOTHY HERNANDEZ Authorizes ‘Signature TIMOTHY HERNAHOEZ Vice President for Acaddoraic Afiairs Print Name end Tite November 10, 2025 Date AQCEPTED AND APPROVED Page 1 of?"
    },
    {
        "image": "acknowform2_synth_12_aug5.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avenue, Manila 1004, Metro Mania RESEARCH COLLABORATION ACKNOWLEDGEMENT Date: November 08, 2025 Dear University President Judith Savage, We write to formally acknowledge receipt and acceptance of the Memorandum of Understanding (MOU) executed between DE LA SALLE UNIVERSITY and Visayas State University regarding \"Faculty Development and Capacity Building Program”. This agreement represents a significant step forward in fostering institutional collaboration and advancing our shared educational mission. The MOU establishes the terms and conditions for cooperation in various academic and research activities over the period from November 26, 2025 to January 14, 2027. Our institution affirms its commitment to the principles and objectives outlined in this agreement and pledges to work diligently toward their achievement. Principal areas of collaboration include: joint curriculum development and program articulation, student and faculty mobility programs, collaborative research projects and scholarly publications, sharing of library and laboratory faclties, joint conferences and academic symposia, and community extension and outreach activities. Both institutions agree to provide necessary support and resources for successful implementation. This partnership offers tremendous opportunities for enhancing the quality of ‘education, expanding research capabilities, and creating valuable leaming experiences for our students. We are confident that through mutual cooperation and shared commitment, this collaboration will yield positive outcomes for both institutions and contribute to the advancement of Philippine higher education. We appreciate the spirit of cooperation demonstrated throughout the negotiation process and look forward to building ‘a strong and productive partnership. Our institution stands ready to begin implementation of the agreed programs and activities. Thank you for your continued support and collaboration. Very truly yours, TIMOTHY HERNANDEZ. Authorized Signature TIMOTHY HERNANDEZ Vice Presidentfor Academic Afars Print Name and Title November 10, 2025 Date Page 1 of 1 ACCEPTED AND APPROVED 9"
    },
    {
        "image": "acknowform2_synth_13_aug1.png",
        "label": "acknowform",
        "ocr_text": "ATENEO DE MANILA Lit WVERSITY Loyata Meights, Guecan City (198, Het Murs STIPUNONAL PARTNERSHIP ac Dats: November 12, 2625 Gear Dean, Graduate School Jessica Washington, We nksntedge receipt and acceptance of the Memorandu 2 (MOU) executed belwuen ATENEO DE MANILA UNIVERSITY and Sicct tinh ‘ty Building Program”. This agrserent represents a sig ‘shared educational mission. The MOU establishes the terns period from December 08, 202% to February 20, agreement and pledges to wari diligently teay for, stu fas. joint piovitie necessary quality of educ. it advancement ef Phi forward to builting 3 19 furmally ec of Nn and edvancing cur ous academ e and reseay the pincie ch activities over the and objectives outlined in this sd ther Nisvement. Principal areas of co! cality programs, coltaboralive research >s and acid UpOGr ad mevources for eucceastal implemen ion and cutrasch activities, Both institutions agree to P offers tremendous opportunities for enhancing the netiences tor aur studer Ss. We are cunt for bath insittutions ar a that through i contsbuabs to the poine Fighar education, We appreciate the spit of coupszatlon damanatmted throughout the nogeiation process and lock Song dbs Frodctive partnersijp. Our institution stands ready to bogin imlermanation ofthe agreed proarares and Thank you for your cuntinuad support and collaboration ES BRYANT JAMES BRYANT Page 1 of 1"
    },
    {
        "image": "acknowform2_synth_13_aug2.png",
        "label": "acknowform",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Loye helps Gos ty 1108, Rete Marsa RONAL PARTNERS HP ACKNOWL DGEMENT ember #2, 2025 2ean, Graduate Schost Jeseica Washington, We waite to Fo Understanding (MOU) executed behween AT This agreement on, The MOL establishes the tems and concitiens 2025 to Fairaary 20, 2020. Our ik Signy fevard their peance of the Memorandum of versity regarding “Faculty Development and ig institutional coltsbnration and advanci oojeration In various ssedemie and rage titution aifinns ifs commnitment ta the principles and object hevement. Prin of coltaber 8, Collaborative research projects and sche A conferences and academic symposia, a Support and ful implementation. This af education, expending resus and va ‘utval cooperation and shared commitment, this collabarstion wil yleld postive outcomes for beth advancement sf Philippine righer p. We appreciate the spirit of cooparation demonstrated thr forward to butling a strong ard productive partnership. Oxr institution stands ready to tivities. Thank you for your cant GE MANILA UNIVERSITY and Bicol U: for netied from December 0: oreanient and pledges program aticulation, ati shaving of brary end ch activities, Both institutions agree to parinership offers tremendous 0; tunitive tor entencing the bh capab stitutions and conitibute to the oes the negatlation proc entation of ti 6 anal look agreed programs and ert and collaboration. ny truly yours, Print Name and Tith Revember 12, Bage tort"
    },
    {
        "image": "acknowform2_synth_13_aug3.png",
        "label": "acknowform",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Loyola Heights, Quezon Oty 1108, Mato Ment INSTITUTIONAL PARTNERSHIP ACKNOWLEDGEMENT ledge receipt and acceptance of the Memorandum of INIVERSITY and Bicol University regarding \"Faculty Development and {ep forward in fostering institutional collaboration and advancing our various academic and research activilles over the vfs its commitment to the pinciples ‘and objectives outtined in this ‘ulum development and ment, Principal areas of collaboration include: joint curtic jects and scholarly publications, sharing of library and jon and outreach activities. Both institutions agree to ation. This partnership offers tremendous opportunities for enhancing the faluable leaming experiences ‘are confident that through tive outcomes for bot “Jomonstrated throughout the negotiation process and look begin implementation of the agreed programs and Date: November 12, 2025 Dear Dean, Graduate School Jessica We Understanding (MOU) executed between Capacity Building Program’. This agreement repre: shared educational miss hes the terms period from December 09, 20: ‘agreement and pledges to work sili vitieulation, student and faculty moDIIY programs, laboratory: facilities, joint conferences de necessary support and resources for successful implement quality of education, expanding research capabilities, and creating v ward shared commitment, this collaboration will yield post mutual cooperation advancement of Phi er aducation. We appreciate the spit of cooperation ‘ip. Our institution stands ready to forward to building a strong and sctivities. Thank you for your cot ery truly yours, ashington, We wit to formally acknow ‘ATENEO DE MANILA Ul sents a significant st ‘and conditions for cooperation in JAMES BRYANT Ruthorized Signature JAMES: BRYANT Vice Pr resident for Academic Affairs Print Name and Title November 12 2025 Date Page 1 of 1 ACCEPTED AND APPROVED"
    },
    {
        "image": "acknowform2_synth_13_aug4.png",
        "label": "acknowform",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Loyola Heights, Quezon Cty 1108, Metro Manila INSTITUTIONAL PARTNERSHIP ACKNOWLEDGEMENT Date: November 12, 2025 Dear Dean, Graduate School Jessica Washington, We write to formally acknowledge receipt and acceptance of the Memorandum of Understanding (MOU) executed between ATENEO DE MANILA UNIVERSITY and Bicol University regarding \"Faculty Development and Capacity Building Program’. This agreement represents a significant step forward in fostering institutional collaboration and advancing our shared educational mission. The MOU establishes the terms and conditions for cooperation in various academic and research activities over the period from December 09, 2025 to February 20, 2028. Our institution affirms its commitment to the principles and objectives outlined in this agreement and pledges to work diligently toward their achievement. Principal areas of collaboration include: joint curriculum development and program articulation, student and faculty mobility programs, collaborative research projects and scholarly publications, sharing of library and laboratory facilities, joint conferences and academic symposia, and community extension and outreach activities. Both institutions agree to provide necessary support and resources for successful implementation. This partnership offers tremendous opportunities for enhancing the ‘quality of education, expanding research capabilities, and creating valuable leaming experiences for our students. We are confident that through mutual cooperation and shared commitment, this collaboration will yield positive outcomes for both institutions and contribute to the advancement of Philippine higher education. We appreciate the spirit of cooperation demonstrated throughout the negotiation process and look forward to building a strong and productive partnership. Our institution stands ready to begin implementation of the agreed programs and activities. Thank you for your continued support and collaboration. Very truly yours, JAMES BRYANT Authorized Signature JAMES BRYANT Vice President for Academic Affairs Print Name and Title November 12, 2025 Date ACCEPTED AND APPROVED Page 1 of 1"
    },
    {
        "image": "acknowform2_synth_13_aug5.png",
        "label": "acknowform",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Loyola Megnts Quezon Cty 1108 Mate Mande INSTITUTIONAL PARTNERSHIP ACKNOWLEDGEMENT ee Date: November 12, 2025 Dear Dean, Graduate School Jessica Washington, We write to formally acknowledge receipt and acceptance of the Memorandum of Understanding (MOU) executed between ATENEO DE MANILA UNIVERSITY and Bicol University regarding “Faculty Development and Capacity Building Program” This agreement represents a signficant step forward in fostering institutional collaboration and advancing Out shared educational mission The MOU establishes the terms and conditions for cooperation in various academic and research activities over the period trom December 09, 2025 to February 20, 2028 Our institution affirms its commitment to the principles and objectives outlined in this ‘agreement and pledges to work diligently toward their achievement. Principal areas of collaboration include joint curiculum development and program articulation, student and facuity mobility programs. collaborative research projects and scholarly publications ‘sharing of library and laboratory facilities, joint conferences and academic symposia, and community extension and outreach activities Both institutions agree fo provide necessary support and resources for successful implementation This partnership offers tremendous opportunties for ‘enhancing the quality of education, expanding research capabilities, and creating valuable leaming experiences for ou students We are confident that through mutual cooperation and shared commitment, this collaboration wil yield positive outcomes for both institutions and contribute to the chvencersent of Philippine higher education We appreciate the spirit of cooperation demonstrated throughout the nagetiation process and look forward to bulking a strong and productive partnership Our institution stands ready to begin implementation of the agreed programs and activities Thank you for your continued support and collaboration Very truly yours, JAMES BRYANT Authorized Signature: JAMES BRYANT Vice President for Academic Affairs Print Name and Title November 12 2025 Date ee Page 1 of 1 ACCEPTED AND APPROVED"
    },
    {
        "image": "acknowform2_synth_14_aug1.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY EMORANDUM OF GUIDE RS TANDING COUP IRMATION a Rley, We ate pleased to fotmally acknowed: i Normal University for the end accepiance of Memorandum of and Pritipo cliakorative project ti icuiur This portnershio marks significant snllestone december nee and vase: acuity development initias ath 8 chievement of mutual objective lnchsde esta hip activi on resources and intohieciust nd a that wit contniyate t cial partnershie our respective academi >etety Please tee! free 10 contact ement Sincera 2 the af ement of higher education iy th ipoines and ctasie opoortunities jabor ati effects cue share convnitment so innovation, ané service to 5 tur office should cequite any clarification oF wisitionsl infenmation ibis sckron ELIZABET: Authoria HVED ANG ACKNOWLEDGED"
    },
    {
        "image": "acknowform2_synth_14_aug2.png",
        "label": "acknowform",
        "ocr_text": "OE UA SALLE UNIVERSITY 2801 Tot Avanos, Mamie 1008, Nitra Fsnia HERSTANDING CONFIRMATION “somerset rina nna menipsansnennnennene emational Atfairs Office Kar MGA) hetwaen DE LA S) 4 Quality Assurance Orojec innovation in tha Pi Rilay, We are plnased ts famatly ackromtadge csipt and acceptas sollaborative project ‘is pertneishio marks a sigeticant mitsstone in advan ippines. Tha agrewment, atfective from December 18, 202 to Dacember 14, 202 5, facully development initetives, joint research prejects, and 1 iy towered the tation, regular monitoring and evalastion of partnership activities, expitable atu odie, review and amendment as necessary. ur institutlon pledges f activities. We look forward to productive baneficial partnership Philippines and crosie opportunities for our ree innovation, and service to s this ackrowledgemmnt. $i acral University for th led “Cures ving academic exostience and rs lum ig ara ayeinen file maintalaitg the highest standards of tf joint ondivet, Key prt i intllectust seoparly rights, and fatticigation in af agiexs apon ute te the adbvencement of higher axiucation ta the fects cast sharad commitment to excetlenc ation oF site srnation vexparch i supnest and act adtemic communtias. Tits collaboration: ren to contact cur office shold yoru requis any clan LEZABETH SILVA Authorized Signahire IZASETH S! swercity me and Tile Page Toft IVED AND &CKNOWLEDGED 3"
    },
    {
        "image": "acknowform2_synth_14_aug3.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avenue, Manta 1004, Metro Manta MEMORANDUM OF UNDERSTANDING CONFIRMATION ELIZABETH SILVA Authored Sca __ _____ ELIZABETH SILVA Ubiverty President Print Name and Title ‘October 25, 2025 Date RECEIVED AND ACKNOWLEDGED Page 1 off"
    },
    {
        "image": "acknowform2_synth_14_aug4.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY 2501 Taf Avenve, Mande ibs. Neto Manta MEMORANDUM OF UNDERS TANDING CONFIRMATION i Date: ccwner 23, 2025 Dear Directs, iterations! Affairs Office Kiva Rey Fy ce Beas to fareaty ackrowteriga seit and accepzancn cf the Metnccaccn of Agreormant (MOR) detwner: OE LA SALLE UNIVERSITY and Phijppioe Nomai Universtiy forthe callaborsve picjent bed “Coriculum Enhancement ond Quality Assizance Project” Thie Patlomohip mocks a slunticart mestone sn advancing acawnic excatence and research innovation n the Philippines The agroement. efectie trom Dacomber 18 WS to Deceniver 14, 2027, suttines the Framwneek for cooperation in research projects, and reaource shating amargaments. Bosh ELIZABETH S1LVA Authotlead Signatae ELIZABETH SILVA University President Wane wa Print Name and Title Cetober 25 2025 5 Tee Seetemepeeeeeee Sscrnneeiieneeeee RECEIVED AND ACKHOWLEDGED Page tof i"
    },
    {
        "image": "acknowform2_synth_14_aug5.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY 20 Tat Avenue, Mande 1904, Kuro Mare MEMORANDUM OF UNDERSTANDING CONFIRMATION nd Date: October 23 2025 Dear Director, intamationst Afteirs Office Karta FBiey ‘We ave pleased to formally acknestedge receipt enc accupsarics ofthe Memorandum of aoe oe auhytowwon OE LASALLE UREVERSITY ad Pine Neat Urry eh cerning lst ea Enhancemant and Quality Assurance Project This patnerstip mares sigaficict slestone i advancing arademic actinic snd research ‘home Dacamber 18, 2025 ta Deceenbar 14, X27, cuties she framework fer cooperation incewation in the Piitinpions. The agreement, afiective “sevenprnect ilies, cr seneavch peec s, and resource shoring avangamenrs, Goh ‘objectives whe maintaining te highest standarte of academic ‘echaiw: establishment of ksit steering committee to oversee en ng an evn poring eee and secs Pope 2 provision for parodic review cna amendment a6 recess 7 activities. We look forward to m productive and mesuaity lenevation, and service to society. Preane fee! free to this acknowledgement. Sincerely, ELIZABETH SILVA ELIZABETH SILVA University Provident Bani Name and Talo a oetabae 25 2025 a eT RECEIVED ANC ACKNOWLEDGED"
    },
    {
        "image": "acknowform2_synth_15_aug1.png",
        "label": "acknowform",
        "ocr_text": "ARIE Coe es eee fF asthe Bo Giilaees ty for the ems ty fo Syrian Exchange ath Miislity sitiarque™ eta pelensiee a newath or coneerotoa a ou Bo Pode seen adi mnrn i - outlast ¢"
    },
    {
        "image": "acknowform2_synth_15_aug2.png",
        "label": "acknowform",
        "ocr_text": "ERSITY DE LA SALLE UNIV! aah Yan we SHIP AC cknowiedg Dale osine ves tp formally g. This etter 9 for tha implementation Connie 8 President for ivensity iain endeavor 7 an in cut mawork for coopera a comprehensive rseg the sowing Fey Te3R0% patois: sion fully 8n tion and gular comin wr insutution s 2 that this othe fol ios, an tions in goed tasth, Bos ities, joint plaanieg if institutional policies ns. and aiion and promoting aeademi sn af neweesary 1 puree mmimant 19 oro erie Com paved vy questions oF pes cur ccs and the Breeder acad ant enaiuting £C) g significant bar nor with Bicol Unk trative requien jately Ueo? wariense. Respect TIpFANY BAMIELS E1VED AMD CONFIRMED"
    },
    {
        "image": "acknowform2_synth_15_aug3.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avenue, Manila 1004, Metro Manila PARTNERSHIP AGREEMENT ACKNOWLEDGEMENT ———-.—SS Date: October 31, 2025 Dear Vice President for Research and Development Connie S| acceptance of the Partnership Agreement with Bicol Universi We are honored to collaborate with your esteemed institution period of 2 years, establishes a comprehensive framework parks, This letter serves to formally acknowledge and confirm our institution s ity for the implementation of the “Student Exchange and Mobilty Initiative” initiative. in this important endeavor. The partnership agreement, which shall be effective for for cooperation in curiculum development, faculty exchange, research commence work on the agreed activities immediately upon final concems, please do not hesitate to contact our office at your TIFFANY DANIELS Authorized Signature TIFFANY DANIELS Dean, Graduate School Print Name and Title November 02, 2025 Date RECEIVED AND CONFIRMED Page 1 of 1"
    },
    {
        "image": "acknowform2_synth_15_aug4.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY “M01 Tat Aveese, Manda 1004, Metra Maia PARTNERSHIP AGREEMENT ACKNOWLEDGEMENT ere NY i Date: Octover 3%, 2025 Dear Vice President for Research and Developrnant Connie Sporks, Ths letter serves to formally acknowledge and canfian our insittin s soneptance ef the Portnersiup Agroercert wi ico! Univeaty fr the irpdementation ofthe “Student Exclienge an Motinty ‘eltiative” initiative ‘Wa ne honores to celiaborate with yous esteemed institution in this inportart endeavor, The partnership pgroemert, which shail be ettective for a peti of 2 years, ostaitshes 4 comprerensive framemerk for cooperation in curicutun development, faculty exchang, research ccpaceration, ond community extension progrems. Ou institution fuly endorses the abjectives and terms outed In the ogruament ard coanmits to fultihing aif cbtigations In good faith. Both parties agree to the follaaing key responsiiiities provieien of qualified faculty and stew for roqjam impiemontation, allocation of necessary resources aru fncities, Joie planning and coordination of activities, vequiar communicalion at progress reporting, and compliance with of apglicable laws, rexulations, and institutional poticisn Thus partnership stigns with our institution s strategie prcrtios and veiniorces uw commitment to providing quality educetion and promcting acaduric excalience We anticipate that this collaboration wit yield signéicant henefite for ou students, faculty, and the broader academic commninty. We express aut sincere appreciation for the opportunity fe partner wnt Bicol University and took fonwd to 4 successful and encuing cotiaboration. ‘Ou teen is prepared to commence work on the agived activibes immediately upon finalization of ai administrative requirements, Should you have ary questions ot concems, please do not inesitata 12 contact ous elice at your eartiest convenience. Respecthily yours, TIFFANY DANIELS Fathorized Signature TIFFANY DAMELS Dean, Gratuste Schoo! Print Name and Tite Movember 02, 2025 Date Sven nn eer re RECEIVED AND CONFIRMED: Page 7 of 1"
    },
    {
        "image": "acknowform2_synth_15_aug5.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY 389; Tan Avenue, Mania OO, Seto wants PARTMERSHIP AGREEMENT ACKNOWLEDGEMENT “eesenereenenmmrercctrtet niente mrueannage lets: Octoter 34, 2028 Dear Vice President for Research and Ouvelopmant Connie Sparks, This letter serves to fornaty ackrovisdge and cantinn our institution Sccuplance of the Partnership Agrammert vith Bicol Lniverelly for the imelamertalion of the “Student Bxchaee and Mobility Ieititive’ bitietive are Konored 40 calaborate with you esteemed instzaion in this impertant andeaver The parinershia agreement. whlch hal be effctive for 8 period of 2 yaars, establishes a comprebansiva feanewnck for cocperetion in cu er, faculty skchange, eacarch ‘Solboratinn, ane community extension programs, Our ietiuithin fully endoises the sbjectivas and termn oustined in the sgreatnent and ing 3H obligations in good faith Both parties agies to the ietlowing key re inigiementalion, atlocatinn of necessary resources and factities, joint planning avd coordinatinn of activi rd compxloncs wath ali apphicatde lows, reguiations, and institationsl policies. This pat es end reinforces out commiting lified faculty end staff for Tegulgr commurieation aret wsship algo with cnr ‘9 provising quality education ane premuing academic exceitence We ant ‘soitaboration wil yieid significant benefits for our studants, faculty. and the broader avedacnic Yor the opportunity te parties sth Bicol University and icok fonuard to ounces: ornitence wask or: thee agro ac? concerns, pas community. We express our sincere appreciation acd sneiuting collaboration. Gur team ie prepared to ios iromadietely upan finsiteation of off exminiatative raquecments, Shwuld you have any questions oF do nok hesitate to contact cur tice at yaw eadiest convenience. Respsctiutiy yours, TIPFANY DANIELS authorized Signature TIFFANY DAMELS Dean, Grakiste Schoo! Brint Name and Tile VED AND OOM IRME age 1 of 4"
    },
    {
        "image": "acknowform2_synth_16_aug1.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espafia Boulevard, Mania 1015, Metro Manila MEMORANDUM OF UNDERSTANDING CONFIRMATION Date: November 04, 2025 Dear Vice President for Research and Development Sheila Thompson, This letter serves to formally acknowledge and confirm our institution s acceptance of the Partnership Agreement with Central Luzon State University for the implementation of the \"Library and Resource Sharing Agreement\" initiative. We are honored to collaborate with your esteemed institution in this important endeavor. The partnership agreement, which shall be effective for a period of 5 years, establishes a comprehensive framework for cooperation in curriculum development, faculty exchange, research collaboration, and community extension programs. Our institution fully endorses the objectives and terms outlined in the agreement and commits to fuffiling all obligations in good faith. Both parties agree to the following key responsibilties: provision of qualified faculty and staff for program implementation, allocation of necessary resources and facilites, joint planning and coordination of activities, regular communication and progress reporting, and compliance with all applicable laws, regulations, and institutional policies. This partnership aligns with our institution s strategic priorities and reinforces our commitment to providing quality education and promoting academic excellence. We anticipate that this collaboration will yield significant benefits for our students, faculty, and the broader academic community. We express our sincere appreciation for the opportunity to partner with Central Luzon State University and look forward to a successful and enduring collaboration. Our team is prepared to commence work on the agreed activities immediately upon finalization of all administrative requirements. Should you have any questions or concems, please do not hesitate to contact our office at your earliest convenience. Respectfully yours, MICHAEL BROWN Authorized Signature MICHAEL BROWN Director, International Affairs Office Print Name and Title November 04, 2025 Date ACKNOWLEDGED AND ACCEPTED Page 1 of 1"
    },
    {
        "image": "acknowform2_synth_16_aug2.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS epatle Boutevard, Manta 1015, Set Maras MEMORANDUM OF UNDERSTANDING C ONFIRMATION MICHAEL BROWN Authorized Signature ~~~ MICHAEL BROWN, Director, Intemational Affaire Ohiice Print Name and Tite Novemnes 04, 2025 St ASOOOREDSED MD ACCENT ACKNOWLEDGED AND ACCEPTED Page Tort"
    },
    {
        "image": "acknowform2_synth_16_aug3.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espa Roulevard Monta 1018, Metro Manin MEMORANDUM OF UNDERSTANDING CONFIRMATION ener eae Date: Novereber 04, 2025 ‘Agreomert ilitive. We are honeved to collaborate with your estawroed tntision in this ingronart shat be effective for a pertad of 5 years, estatiishes a mswarch colloboraticn, and commursty extension programs ‘and commits to filing alt obligations in good faith. Both parties aoe to the following key stall for prograra tniplamerdation, slocation of necessary vesources and feciities, joint paoding rot cour nebhan s coetegic parties and reinforces cur commitment to oviding quay education anc prmucting academic excefioncs. We vriclpete that tis colteraton wl yield egacat Senefits for ow students, fry, end the boaderarasionic Community We express ow cincare appreciation fr the apport to partner with Conta! zon State Universi and cok forward toa auceaashd and ening cotaboretion ‘ur team fs prepared to commence work on the ag activities mediately upon tnaizaion of ail admicisrative eseesnerts ‘Should you hava any questions ce concems, plense do nck hesktate to contact our office at your earliest convenience, Respacttuly yours ‘Gur institution fully endorses the chjectives and tens outlived in the agreement rasponsibitities: provision of qualified faciity and coontination of activities, regdar MICHAEL BROW Rmhatsod Siguaine Tn MICHAEL BROWN Dieector, intemationat Affairs Office Pint Name and Tite Date ACKNOWLEDGED AND ACCEPTED Page 1 of?"
    },
    {
        "image": "acknowform2_synth_16_aug4.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS 5, Metro Mae ONFIRMATION apahe Bostevard, Manis 101 MEMORANDUM OF UNDERSTANDING Cc"
    },
    {
        "image": "acknowform2_synth_16_aug5.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espafa Boulevard, Mania 1015, Metro Mania MEMORANDUM OF UNDERSTANDING CONFIRMATION Date: November 04, 2025 Dear Vice President for Research and Development Sheila Thompson, This letter serves to formally acknowledge and confirm ‘our institution s: acceptance of the Partnership Agreement with Central Luzon State University for the implementation of the “Library and Resource Sharing Agreement” initiative. We are honored to collaborate with your ‘esteemed institution in this important endeavor. The partnership agreement, which shall be effective for a period of 5 years, establishes a comprehensive framework for cooperation in curriculum development, faculty exchange, research collaboration, and community extension programs. Our institution fully endorses the objectives and terms outlined in the agreement ‘and commits to fulfiling all obligations in good faith. Both parties agree to the following key responsibilities: provision of qualified faculty and staff for program implementation, allocation of necessary resources and facilities, joint planning and coordination of activities, regular communication and progress reporting, and compliance with all applicable laws, regulations, and institutional policies. This partnership aligns with our institution s strategic priorities and reinforces our commitment to providing quality education and promoting academic excellence. We anticipate that this collaboration will yield significant benefits for our students, faculty, and the broader academic community. We express our ‘sincere appreciation for the opportunity to partner with Central Luzon State University and look forward to a successful and enduring collaboration. Our team is prepared to commence work on the agreed activities immediately upon finalization of all administrative requirements, ‘Should you have any questions or concems, please do not hesitate to contact our office at your earliest convenience. Respectfully yours, MICHAEL BROWN Rathorized Signature MICHAEL BROWN Director, International Affairs Office Print Name and Title November 04 2025 Date oa ese ttt ACKNOWLEDGED AND ACCEPTED"
    },
    {
        "image": "acknowform2_synth_17_aug1.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY pat Tat Dwersze, Main 1008, Mateo Maer RESEARCH COLLABORATION ACKNOWLEDGEMENT RR Date: Hovember 03, 2025 cua Vice Preset or Acari Mia James Esta, Wi ao fsmaly acknowiede aceite azcetence one enswaniam ae ae (OU) exerted bata DE UA SALLE UNNERSITY and Bical Univerty garg \"Gracunto Foveation Caltantsin Program Be cement woreverts a sipiicat sup lon tetang inatsina otnbntin aed adsancng 0. shared cso misske. Tra aces eetabianen he tama eve condor fur cooperation in various acafanic ad vesaarch acts ove he peti fre Decemnber 20, 025 to May 22, 2027. ‘Our insitadion affirms (commitment to the péheiplos und cbjectives outined i his agreeriont and Principal aces of cofisboration include’ joint cusricutum develnpmerd se program Philippine higher education ie oppeociate the apnt of cooperetion domenatzated tecughaut the negotiation prceess and look forwars o ling ‘a strong and praauctive partnarsip. ‘Our iestitlon stands ready to begin implementation of the agrued progarns and activities, Thank you hs ‘your continued support and covtebecatlon. Vary thay yours, Authorized Signature PATRICK JACKSON Dean, Gewiuats Schoo! Print Name and Tile ee Nowember 06, 2025 Bate nt ACKNOWLEDGED AND ACCESTED Page 1 of 1"
    },
    {
        "image": "acknowform2_synth_17_aug2.png",
        "label": "acknowform",
        "ocr_text": "OE LA SALLE UNIVERSITY “Tat Aoremse, Marin 1666, states Marka AGH COLLABORATION ACKNOWLEDGEMENT Detter: Noveriber 33, 2025 Dea View President for Acsuiemic Aituirs Jamas Esteada, We write to loreal acki Undaratanding (MOU executed bat Progam\", This ayresmant rey mission. Phe MOU establishes 1 Gscatniver 20, 2025 to May 22, 2027. Gur institation afftems ite ccramlimant the peincinies and cblectives eutlinad in this agooamere and ledges fo work digontiy iavard thei achievement, Piiacigal seas of eottaboration inckide: joint cuniculuen developement and peg ojects and acholatly publications, sharing of Bray ural laboratory facilities, joint cecfarencos aad acadwrnic symp J community extension and outreach activities, Both institutlons agus to provide necessity stupor and rscutses for ouncasaful implementailon, This partnership offers teamvendous opportunities fur enhancing ths quatily of siiication, expanding resnarch capablities, and cresting valyaide izaming experiences for war studan s. We ere confident thet through mutuat conpwvation and shared consnilment, this collaboration wil yickd pasitive autcomnvs for bath inatiitions and contiuie to the advancement of Pidippine higher education. We sperecinte the sphit of coceration dernanstvated dxoughord the negotiation process and kak forward to bedktingg 2 strong art proxtuctive pertmerahig, Our instiadion stands nuady to bagis iomlementstion of the agroed arograma ansé activites. Thaith yee for your continued supra and collahoration, Very tuly yours wincge receipt ard acceptance of the Mesvemnam of OE LA SALLE UNIVERSITY end Bicol University regarding \"Graduate Education Collaboration aigraficent step foward in fostering instltutionel collaboration and advancing Gur shared educations! PAYRICH JACKSON Authorized Signature BATRICK JACKSON Dean, Gieduete Schoo! Pont Name and Tits ber Gb, 2025 Page 14"
    },
    {
        "image": "acknowform2_synth_17_aug3.png",
        "label": "acknowform",
        "ocr_text": "trada, We write to formally ana sine ropesennan OE LA SALLE UMVERSITY won, tMebe recep Program’. This agreement ‘acceptance tem “Graduate Education forward in fostering ins regarding MOU establishes the and December 20, 2025 Conditions titutional collaboration both institutions through mutual your Partnership. Our inst trated th Contribute to the adv of ery t he Process and look forward to build ‘yous, \"297 bein implementation e the woe Continued support and ve negotiation ACKNOWLEDGED AND ACCEPTED Page 1 of 7"
    },
    {
        "image": "acknowform2_synth_17_aug4.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY ‘2401 Taft Avenue, Manda 1004, Metro Mania RESEARCH COLLABORATION ACKNOWLEDGEMENT as Date: November 03, 2025 ear Vice President for Academic Affairs James Estrada, We write 10 formally acknowledge receipt and acceptance of the Memorandum of Understanding (MOU) executed between DE LA SALLE SNIVERSITY and Bicol University regarding “Graduate Education Collaboration Program’. This agreement represents a significant forward in fostering institutional collaboration and advancing our shared educational mission, The MOU establishes the terms and condi for cooperation in various academic and research activities ‘over the period from December 20, 2025 to May 22, 2027. Our institution affirms its cerrvmitnent to the principles and objectives outined inthis agreement and pledges to work diligently toward their achievement Principal areas of c curriculum development and program .llaboration include: joint articulation, student and faculty publications, sharing of library and laboratory arademic symposia, and community extension and outreach activities. Both ins necessary support and resources for successful implementation “This partnership offers tremendous opportunities for enhancing the quality of education, expanding research capabil thie collaboration wl yield positive outcomes for both institutions ‘and contribute to the advancement of Philippine higher education. We appreciate the spit ofc Less and look forward to building a strong and productive partnership. Our institution stands ready fo begin implementation of the agreed programs a ‘mobility programs, collaborative researc facilities, joint conferences and titutions agree to provide ities, and creating valuable leaming experiences for our students We are confident that through mutual ‘cooperation and shared commitment, operation demonstrated throughout the negotiation Proc ind activities. Thank you for your continued support and collaboration. Very truly yours, PATRICK JACKSON Authorized Signature PATRICK JACKSON Dean, Graduate School Print Name and Title November 06, 2025 Date Page 1 of 1 ACKNOWLEDGED AND ACCEPTED"
    },
    {
        "image": "acknowform2_synth_17_aug5.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY F907 08 heat $4808 OK Sao earns 1 RESEARCH COLLABORATION ACKHOWLEDGEMENT i i mission The Moy Cecemitin 20. 2325 to iday 22 2597 Gor tvatin Badges to work Sigeetly toma thee achievement aitbudetion, shxsent and teculty (POWOICN Orctects and scholarty antic ai ‘R08, firt conteconces 903 ecaderie srr Sevwioginant act peg ons. sharing Nay and inboeeiory 2 $0019 and presketne parreesiae) Dur hate YOO! contre suppeet and collspornaran PATRICK JACKSON Authotiaad Signaisse PATRICK JACKSGN Dos, Graduate Serort tne ee ere een ACKNOWLEDGED AND ACCEPTED a Page tot t"
    },
    {
        "image": "acknowform2_synth_18_aug1.png",
        "label": "acknowform",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES sta. Mesa, Manila 1016, Metro Manila MEMORANDUM OF UNDERSTANDING CONFIRMATION Date: November 11, 2025 receipt and acceptance of the ‘Memorandum theastem Philippines ‘Academic Affairs tan Marsh, We write to formally acknowledge YTECHNIC UNIVERSITY OF THE PHILIPPINES and University of Sout i fostering institutional collaboration Dear Vice President for ‘Understanding (MOU) executed belwestt POL regarding \"Student Exchange and ‘Mobility Initiative”. This t represents a significant steP forward in and advancing our shared ‘educational mission. The MOU eSrablishes the terms and conditions for ‘cooperation in various academic and sesearch activities over the period from '49, 2025 to October 06, 2027. ‘Our institution aims its commitment to the principles and rseetvesoufned inthis agreement and ead ‘vork dligently toward their achilevernent \"sancipal areas of collaboration include: it ‘curficulum development and Program ‘articulation, student and faculty ‘mobility programs, collaborative piojects and scholarly publications, sharing of library end laboratory facilites, joint conference® ‘and academic symposia, and ‘community extension and outreach vctivties. Both institutions agree to provide necessary SuPPO and resources for successful I “Tis partnership offers tremendous oe for enhancing the quality of education, expanding research capabilities, cee eating vauabe fearing experiences (At ‘students. We are confident that through mutual cooperation and shared commitment, this “allaboration wil yield positive oulcom et for both institutions and contribute to the advancement of Philippine higher ‘education. We appreciate the spit vy cooperation demonstrated throughout ee ew oc jt Pon atancs rent begmmplemanttion the agreed programs and activiies “Thank you for your continued SUPPOT ‘and collaboration. Very truly Yours JOHN HUFFMAN ized Signature ‘JOHN HUFFMAN Director, Intemational Affairs Office Print Name and Title November 11 2025 Date 1 TAND ACKNOWLEDGED Page 1 of RECEIVED"
    },
    {
        "image": "acknowform2_synth_18_aug2.png",
        "label": "acknowform",
        "ocr_text": "POLTTECHNIC S8 Mess, Mate tose, Set ae ME: MORANDUAY OF UNDERSTAND, Amen anes Date: November is ag: 2625 8 W9 write to formaty ‘teknovacga rp SACS OF the Merusrsntum oy CAC ONIVERSETY ge 7, Wn 8! Southsastsen Phiepines This agreement Peres 8 fostering institutenae Colsboratice ™. The MOY establishes z mn in Zor wesc ange Nite var the paces from December 19, ao9 z STH fo te pps an ORECtive6 cuttin if hig SSOOTINN ae pletizen to oy eellsboraton ing SUNIL develope nant ROAM aticcnstion, stuie Pies an Pebiicatons, sharing of itrary a5 tepseatary fae He, jo 'Yy E8tHe aon ap Activites Both institutions spreag Provide nen thea oer StPertiniies for athenciog the ny iy ol borer foe sur Btedeate Wis os content thay rou Iallasicns ant conttinice ta the advane te nesgtistion: process ange Fock Sonar the saree preg. ve out BOS Si activities. The ceInes for bath entation demande tecshoxe ‘8604 {9 tacin tnptementation of JOWN Hur ERA Aaa Bigtaeg —— ee JOHN RUFPARAN Ofna ‘nt ational Aisles Cites Print Name oid 3 November 14 Bate 25 PECENVED AND ackn VANLEDG ED"
    },
    {
        "image": "acknowform2_synth_18_aug3.png",
        "label": "acknowform",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Sta. Mesa, Manila 1016, Metro Manila MEMORANDUM OF UNDERSTANDING CONFIRMATION Date: November 11, 2025 Dear Vice President for Academic Affairs lan Marsh, We write to formally acknowledge receipt and acceptance of the Memorandum of Understanding (MOU) executed between POLYTECHNIC UNIVERSITY OF THE PHILIPPINES and University of Southeastem Philippines regarding \"Student Exchange and Mobility Initiative”. This agreement represents a significant step forward in fostering institutional collaboration and advancing our shared educational mission. The MOU establishes the terms and conditions for cooperation in various academic and research activities over the period from December 19, 2025 to October 06, 2027. Our institution affirms its commitment to the principles and objectives outlined in this agreement and pledges to work diligently toward their achievement. Principal areas of collaboration include: joint curriculum development and program articulation, student and faculty mobility programs, collaborative research projects and scholarly publications, sharing of library and laboratory facilities, joint conferences and academic symposia, and community extension and outreach activities. Both institutions agree to provide necessary support and resources for successful implementation. This partnership offers tremendous ‘opportunities for enhancing the quality of education, expanding research capabilities, and creating valuable leaming experiences for our students. We are confident that through mutual cooperation and shared commitment, this collaboration will yield positive outcomes for both institutions and contribute to the advancement of Philippine higher education. We appreciate the spirit of cooperation demonstrated throughout the negotiation process and look forward to building a strong and productive partnership. Our institution stands ready to begin implementation of the agreed programs and activities. Thank you for your continued support and collaboration. Very truly yours, JOHN HUFFMAN Authorized Signature JOHN HUFFMAN Director, International Affairs Office Print Name and Title November 11 2025 Date RECEIVED AND ACKNOWLEDGED Page 1 of 1"
    },
    {
        "image": "acknowform2_synth_18_aug4.png",
        "label": "acknowform",
        "ocr_text": "fi IPPANES POLYTECHNIC UNIVERSITY OF THE Sty Mase Man HAE MORATDUM OF UNDER TANDE! save of the Mensch BWVERSITY OF THE PHILIP teaqaeiirng “Stowe st Exchange and sengets a sega ant aancing ot sited porns ans eon peat nth arc their aches emnert Pr be and piagram etal canny pues sad tot mastic aq edhcation ext uta: covpsaation ard shoveat Cone advarcanant of Ps wading a stlony aw otc Ihe nequnaton wrocmes avai oe Towa tes neuen prong att athe jones"
    },
    {
        "image": "acknowform2_synth_18_aug5.png",
        "label": "acknowform",
        "ocr_text": "POLYTECHAIC UNIVERSITY OF THE PHILIPPINES: Sia, Mose, Sant aio Mata MEMORANDUM OF UNDERSTANDING CONFIRMATION nett On suena Gate: Movermber 14, 2025 cig and acceptance ofthe Mororanat of Southeastor Prinses ally aciernsalandge Linderstanding (MOU) executed betw JE PHELIPPINES ene Univers! resorting “Stadnnk Exchange and MOsbe clive’ This agreement represents 2 significant stop fonaandé in forte aed advancing ot shaves exkscatfonal MISSION “The MOU establishes te terns ane ronetions 1° ‘conparetion in vonnes ocedarnit GRE epoarch acting over ihe paves wom December 4, HilS te Deteber 96, 227. Cur nstiatie® ins ts censor th pencipees jects cuted is tis agen an ledges fo work cigertly toward fret Arh venanit, Principat awa ed cetinooraion include: FAP creeuturs hevetopement ane program aTcHT oon ane farsa space programs, COBH aeatch projects arat acholasty rblicatione, stating of Hix ane inorelint eco, joint conterorce ane seaornic SYeRPOSIS sas commsuuriag sisi ao csc resins, Tern antatons gene to Dewi AACEN TY ‘support ard oxvoutces for successitt spapiamentation, THs posers offers teomertoes mporioinis for ean the aualle vit edunation, expancling research CABUETES va craving watuabe warring anpnianes TF OF stndants, We ane conikdest that UCU vont sonperaien al haves comaietest WS satlaboraon wi yieet positive cuscomes Sot bath crttunns Sr core to the avancamnt of Prdippine rigor eccation, Ws appreciate tt of conparctin demented MOUS vs epgotintion przcess are Yok fone cuuiding a strong axes productive partaurs Gur nation stares cond to ein amoral? of she agiaed programs se fea. Thenk you for your cont yan Maris, We atte to for OLY TECHNICS EVE) foe Anacteric Affaire Bear vice President ne supe cnet coloration. ery ty YS, GOR HUPEMAN iihatined Signature “iy HUFFMAN Dieter, iniamationa Aa ortice Bact Fiame and Title suewerner 14 2028 eee AND ACHHOVLE"
    },
    {
        "image": "acknowform2_synth_19_aug1.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS ovievard, Mania 1015, Metro Manda Espa MEMORANDUM OF UNDERSTANDING CONFIRMATION ee acknowledge receipt and acceptance of the Memorandum of laborative project titled “Library and Date: November 01, 2025 1 White, We are pleased to formally ‘SANTO TOMAS and Visayas State University fot the coll is significant milestone in advancing academe ‘excellence and research innovation i +11, 2025 to July 09, 2028, outlines the ‘framework for cooperation in areas including Js, joint research projects, and resource sharing amangements. Both institutions F of mutual abjectives while maintaining the highest standards of academic integrity ment of joint steering committee t0 oversee implementation, 5 intellectual property rights, and provision For Dear Ditector International Affairs Office Rya UNIVERSITY OF ‘Agreement (MOA) between Resource Sharing Agreement”. This partnership mes Philippines. The agreement. effective from December student exchange programs, faculty development initiative Commit to working collaboratively toward the achievemen and professional conduct. Key provisions of this agreement include: establish nq and evaluation of partnership activites: equitable sharing of resources 2 fand amendment as necessary Our institution pledges full support and active participated in all agreed upon activities. We look nang mutually beneficial partnership that il e ontibute to the advancement of higher education in the Philippines and ur respective academic communities, THIS allaboration reflects our shared commitment to ‘excellence, innovation, and feel ree to contact our office should you require 2 Y \"arfcation or adstional information regarding this inthe regular monitori periodic review forward to a productive create opportunities for service to society Please acknowledgement. Sincerely, DR. PAUL DAWSON Ruthorized Signature DR PAUL DAWSON Dean. Graduate ‘School Print Name and Title November 02. 2025 Date Page 1 of 1 RECEIVED AND CONFIRMED"
    },
    {
        "image": "acknowform2_synth_19_aug2.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espafa Bovevard, Manta 1015, Metro Manta MEMORANDUM OF UNDERSTANDING CONFIRMATION Date: November 01, 2025 Dear Director, Intemational Affairs Office Ryan White, We are pleased to formally acknowledge receipt and acceptance of the Memorandum of ‘Agreement (MOA) between UNIVERSITY OF SANTO TOMAS and Visayas State University for the collaborative project titled \"Library and Resource Sharing Agreement”. This partnership marks a significant milestone in advancing academic excellence and research innovation in the Philippines. The agreement, effective from December 11, 2025 to July 09, 2028, outlines the framework for cooperation in areas including ‘commit to working collaboratively toward the achievement of mutual objectives while maintaining the highest standards of academic integrity ‘and professional conduct. Key provisions of this agreement include: establishment of joint steering committee to oversee implementation, regular monitoring and evaluation of partnership activities, equitable sharing of resources and intellectual property rights, and provision for periodic review and amendment as necessary. Our institution pledges full support and active participation in all agreed upon activities. We look forward to a productive and mutually beneficial partnership that wil contribute to the advancement of higher education in the Philippines and ‘create opportunities for our respective academic communities. This collaboration reflects our shared commitment to excellence, innovation, and service to society, Please feel free to contact ou office should you require any clarification or additional information regarding this ‘acknowledgement. Sincerely. DR. PAUL DAWSON Authorized DR. PAUL DAWSON Dean, Graduate School Print Name and Title November 02, 2025 Date RECEIVED AND CONFIRMED Page 1oft"
    },
    {
        "image": "acknowform2_synth_19_aug3.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS fa Boulevard, Manis 1038, Mes MEMORANDUM OF UNDERSTANDING CONF MATION seplance af the Memorandum oi J ion inthe tive project tities “Library: ar nde ni ilane coh inn rsework for cooperati angen shaving a nis. Both institutions wards of acadeniie integrity ana 9 fessi nal conduct. Key provis! oversee impleme regular monitoring and evaluation of part jectual propetty rights, arid provision for periodic review and emereiment as necessary. Our institution pladues full suppot end active particigation in ali agreed upon activities. We ionk forward! to a productive ar nership that wi Philipp service to soci frea to contact our office should you requ 2 eagarding this acknowiedy November 2 Page 1 of 4"
    },
    {
        "image": "acknowform2_synth_19_aug4.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS urevard, Mania 4045, Matis Karka MEMORANDUM OF UW! ADE NDING CONFIRMA “remem at trots up eens Date: Novemper as, 2625 ‘Guar Director, Intemational Al asad to formatiy Agreement (MOA) hebween UNIVERSITY OF SANTO TOMAS and Vis ‘esouce Sharing Agreement’, This partnership Phitpoines. The agreement, eHective for nomad to hersity tor ti lance of the Memarandun colistorstive prove iibrary ered fenit excellence and tesoarch innovation in the 8, outinos the famewark for cooperation ch prciec s, and rascuzoy fui objectives wt ning the hig areement Inciusie: establishment of joint staacing cf Nation of partnersnip activities, aquitabie sharing cf resources aa inteilactuel orosety fights, ard pesvision fox Bneientent a bacassary. Our sation pleogas fal support ane active porticipetion in al agreed upon activites. We look ve nd minal ial part nt of higher erlucation la the Philippines and cronies opportunities for ou respective academic ie collaboration reflects aur shared comvaiiment te excellence, innovation, and fouls you reqaie any clartication ar additional information maerding thes soak a si Secamber henge progtares, facuity development ini commit to working collaboratively toward provisions of this io July 08, lalives, joint res: ievomnent of ra ornmittes te aversee in forward inp that wail contribute to the advancem mumunities. 7 seivice te society. Please fee! fras te cnstact cur sckoowiedigement, Sincerely citice SR. PAUL DAWSON wihonzed Signature DR PAUL DAWSON Dean, Gradi Bent Name and Tite Novaniker 02, 2025 EIVED AND CONFIRMED. Page of 4"
    },
    {
        "image": "acknowform2_synth_19_aug5.png",
        "label": "acknowform",
        "ocr_text": "UNIVERSITY OF 5, NTO TOMAS Eapsiia Gouinead, Mania 1015, Metro Mande MEMORANDUM OF UNDE RSTANDING CONFIRMAT LON bert, 2025 Internationa: Ata ment (AGA: a Ryan White, Y OF SANTO This oar to formally acknowaiye ie 3 TOMAS and Visayas Si ship marks fective frovn ipl and accepiance of the i ty for the cottaherative ignificant milestone in advancing a “ember 41, 2025 (o July 09, faculty development iatiatives, taint ‘commit to working collaboratively toveaed and profess! rors of brary and vic excallence and research tnnewes cooperation in area i sharing errangements 2s of academic integrity we to ovemee propaity stitution pledges fut suppart and active participation authorship thal will conte respective academic communities, This coll leboration raft free te contact our cftlee shoul! you rarpuine an Tere hange programs, tar in the framewer fur and wsource research projects ‘evement of mutual objectives wi this agreement inclisde: establishment of rineinnip activities, equita! ing the highest stand Joint stocring commit hating of resources and intellactuat H conduct. Key provisions toring and evaluation of par Berladic review ans! amendment os ro a proactive and roun ale opportunities for our 1 ih al agreed upen aciivitios, We look uke to the advancement of higher education corami iv the Prilinpines and cetiance, innovs rember 02, 2025"
    },
    {
        "image": "acknowform2_synth_20_aug1.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY MOT Tam Avenve, Ktecmke 10, Mucrs Khana 1 MEMORANDUM OF AGREEMENT ACKNOWLEDGEMENT lanavetian in the Phitapines. The agreeinert, atfective from tober 3, arons inciasing student exchange progcams, fecutly sevelopment initiative, foint research JORDAN STRICKLAND Roe Authorized Signature JORDAN STRICKLANE: Vice Prosident bo Acagerrse Affairs Print Name ond Title Nowember 04, 2025 Dit nn ,ECENEO AD Le. RECEIVED AND CONFIRMED ard Visayas State Univarsity forte collaborative project ted Page 1 of f"
    },
    {
        "image": "acknowform2_synth_20_aug2.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSIT 2401 Tan Avera, Mar 204, Matio Monta MEMORANDUM OF AC [MENT ACKNOWLEDGEMENT Date: vow: Dear View President for Ree Monterondum of Agreement (MOA) between DE LA SALLE UNIVERSITY and Visayas State Unive yar RS ence ed reset tho frarnewerk tos cooperation ie s. Both of scasemic etiataining the highest standart ony of this agreemart include: establishment of joint staering comimiites to oversee ting are! evaluation of wartneaship ac ssl propery rights, and jew ard amendment as nec participation in al agreed upon conn of higher education in the inopinmertation, me provision for ery. Our intite innovation, and servic this acknowledgement, Sincensiy JORDAN S RICKLAND faihonzed Signature RUAN STR deni for Academic Affairs Bint Name and Tile November 04, 2028 Dale RECEIVED AND SONELRRA"
    },
    {
        "image": "acknowform2_synth_20_aug3.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avene, Marte YOO, Metro Mandy 7 MEMORANDUM OF AGREEMENT ACKNOWLEDGEMENT Date: tovemoar oe, 2025 JORDAN STRICKLAND. hin. Authorized Signature YORDAN STRICKLANG: Vice Presisent for Academic Attairy ihe Priet Name and Tale Wovemiber 06, 2025 Dat RECEIVED AND CONFIRMED Page tof?"
    },
    {
        "image": "acknowform2_synth_20_aug4.png",
        "label": "acknowform",
        "ocr_text": "DE LA SALLE UNIVERSITY aso Mania MEMORANDUM OF AGREEMENT ACKNOWLEDGEMENT RSHTY wid worshig marks rela of A uN between DE LA SALL ion Hub\", This \\areement (h iegy Transfer and tnniey nificant irl ch and es! 2, 2 te O i: for conperation in Betty scadiemnie itiatives, join for periodic review and 2 Ye took fanward 10 a meadment as necessary. ur institution pledges ctive pat greedaipon sdustive and avutually berefic conitibute to the adveacemsnt of higher education in the create oppoitunitie wx ve academic communities bors te society s our sh novation, and seivi ication or ad JORDAN STRICKLAND Author: JORDAN STR! Bint Name and Tile VED AND CONF:"
    },
    {
        "image": "acknowform2_synth_20_aug5.png",
        "label": "acknowform",
        "ocr_text": "DE LASALLE UNIVERSITY :88 101 Mato Sansa MEMORANDUM OF AGREEMENT ACKNOW GEMED nowiedge ty fo the Ht milestone advancing academic excellence atd ras te Det ipt and acceptance 2 abet Mecrovandurr of Agreement (Hi “Technology Tran nnewation in the Pit a3 Siste Unwe) project titled reer Foe ource sharing enang tandards of nt of joint steering committee to oversee faculty developers initiatives, joint resaarchs project omni +0 worlting collaboratively towaid the achiev sional rent of mutual objectives while mainte crduct. Kev prow sn tot portodio revi Wie took forward 2 opportuni agreement include: . ecjuitable sharing of ro hip antivitis 28 an inet tual property rights, and participation in eff sgreedaypo> cement cs fs ww and ain remem as necessary. Chir inslittie tictive and matually benef \"3 for QUE respective academic esi ely. Please feel ‘tee to contact our offic this acknowledgement. Sinceraiy, high ties, This coltaheea should on reflects cur shared commiument to excellence, innovation, and seivica to sx su require any ‘cation oF additional Infeamation regarding JORDAN STRICKLANE Authorized JORDAN ignature RICKLAND Vi 2 President for Acato: Print Name and Title Novemberag, 2625 s ate"
    }
]