[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "actionplan",
        "ocr_text": "Mp Saneetet of Cdicasiony Rapier 2 Bae oat evan Vaugin College USNS SCHON Phan Sears aie, OUT ee if “Awan: e 63 a i waa j}——. Heath anci mis reas wieetn a vT Eng Ras E oan in Cominitlos i Sse BeBe intone Use SANE an, antococere mes hag eset) j Phetenty lonment vuth 950 Guallty Standards, Cheekes ty Appscant ny Silvia bie fa Christine: Sitar Nts. Marie Pepez \"age Manager Frachazing men snot"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "actionplan",
        "ocr_text": "Department of Education Divison at cia, Donovan Vaughn College USNS Walker, FPO AE 28700 ACTION PLAN KEY RESULT —OmseCTIVES TIME] SOURCE OF REMARKS AREA |_rmame FUND’ Organize clean up Host eco itera ‘Wuironmental! \"Ghives ace ry \\wareness ss postermanng Prov telriaiiags Poeeneaeny Promote July Fovironmenta tem -ampaign okirgamental Science Club September pal \"alhae pons “tiara [eee oo 1 Septem Aqpyeistrative! Simply internal Deploy intranet ‘ommupicationd S P municati Peay) Secs spent aa BE Hoyer Ensure alignment Conduct Iso Quali with ISO quali ce Wance Pt Assurance ‘standaniaY review mecinge ret tat soy Olivia iu Chri Mer i Proofreader Stage manage,” Pecnaltie Perez Purchasing manager"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "actionplan",
        "ocr_text": "Bepactonent of Eacation Regiea 3 Divino =n) ize slean up | Host eco i Pomp fAftony oy tbl POCA lan Uo Ched cycle Otives Pay Procireeder Chiisting iiiter"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "actionplan",
        "ocr_text": "SR REUB ERE OF Etearcstiony Regios 5 iti Dorovar a Tama j i i j Mest ecatieracy Promote Corte sts ard Environmental Poser meding Lolimenrat® i | Organize ey *qeonmenta) ves ane i i i i Beploy intranet [se in anno Pore Mion! romps Condes iSO lAgpiy POCA conphencerpid so Din heck Lisview micetngs. cei Shrictina Milter Stage manager"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "actionplan",
        "ocr_text": "Depariaent of Yeucation Pinkert Oonovan Vaughn College USNS Walker, FPO AE 28700 ACTION FLAN ay wen OREN ES erin Sinirey Ae Saitama at Organize clean up {Host eco t L vegamentall “aes and ri ponies Sim internal ml conereaeaton processes. a c, BREE andar a aR a ‘Stes i |e) Check by Mpmed by ‘Ofivia tia Chvietine Miter Mrs. Marie Perez Proofreader Stage manager Penang manare"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "actionplan",
        "ocr_text": "Department of Education Dhtden att Sona Gillespie Ltd University 264 Tracy Orchard, Brannashire, AL 94145 ACTION PLAN ACTIVITY PERSON TIME INVOLVED FRAME inhance student Conduct DeStusent “Eaaees ghar leadership air mouse\" ghia x he Studgpt tars “i Ingtistional Sessions Fac eegremas Organize acting Pevsorien facuty \"9 Pedagogy workshops. Hold research Aare ftamenarense| \"essay meng sentations faculty members and colloquia ia 5 i Strengthen the Implement Pp, ith Communi stitution s palit Ext yjune| fktension involvement pall NP with outreach presets agnor oervices Sthce [APH rogram Checked by Approved by Ryan Jonnson Reherea Ro Geog wphica nformeton tng en Te Kimberly Cook ‘Clinical reseeo”"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "actionplan",
        "ocr_text": "Department of t duc Gillespie Li td University 264 Tracy Orchard Br namashire, AL $4145 ACTION PL ay AY RESULT omc SON SOUR OF] REARKS AREY HIND p __ Facittate endersatudent Cond peSident cs ershigsig\" Sopeu ib woth Student ftairs January evelopment communication training ary meitSting Ohice Marsh Seminars” mehtonng Facult EO, pGganze teaching Development P ess onal uty 9 Invite resour faculty real 823909) Workshops real 2025 pe Rieu Development Promote Innovative Hold resea ch ane esa ae Mss bresentations faculty members and colores Provide euncentives earch lortesearch Rgsearct eonigisat ee ASF Sbi5 Strengthen the Community st imiblement Panes nit institution s community Exteng f organations lsefxten hc Involvement cpt common, outreach Projects tor utrean® Services Hlce Chechen Rvan Johnson Ape Rehecea Ramer Seu sohca rlomaton atime Kimberly Cook"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "actionplan",
        "ocr_text": "Department of Education Region 2 Division af aruina Gillespie Ltd University 264 Tracy Orchard, Briannashire, AL 94145 ACTION PLAN TEV RESET OMIECTIVS SCNT] STRATEGY PERSON Int] SOURCE OF REMARKS ‘AREA iwworvep FRAME FUND. il hance student Conduct siydent,, Teadershie a iSeership wares Kets Studgpt fairs January ingliytional Development ip ane trainingand mentoring Nas Bkils ‘Seminars. ‘Sessions. Faculty Faculty February | Development <a ETE gemma, SE ondeigat site| tSpny watson [BREESE personne Apri 2085 |P Fehd Development dost Hold research Provide, te innovative reseal myhe ese |Pramtensaae| “Sasa gicaRse,| gzeash Mayas “eA Enhancement ffcaty members. Eracotoqua, ome Strengthen the Implement Pare, ith Community, aten s Sey) peat |_ extension. \\April; tune Fr tension organizations ‘ogram are eafietistan, |ouveach woes radeach Do 2035\" |\" Fund Prepare by Checked by Approved by Reherca Ramern Kimberly Cook Corggueee Ryan Johnson van oe Geographies nirmaten Sts"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "actionplan",
        "ocr_text": "saparvancet of Etuestien Regine 7 pivide ed CIMA Gillespie Lid University 984 Tracy Orchara, Bnanmastane, AL 8445 ae i vay tov sepa su d des j | | Regeae | i Provide incentive: tor resea mpe sat oreo Ss tha oo Lagatiatens 5 Lee ot Compra 331 ns pemment PSN ammuntes. cues a Appevo ty Etuhegra HOmene Hiqnberly Cook ae Ryan Jonnson aoe egecgapttan enrmah er PSE"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "actionplan",
        "ocr_text": "deparnnnt of Eeecution Region 2 Boake ae Gitespie Lid University 264 Tracy Crchard, anannashue, AL 9814 ecto AAAS AAA ASS ACTHO PLAN i iS TS RTT TT STRATES ao vs ate ah Sai, {stodgy aa fra \\ L _siysent RE Le pee Spiess Loweinngard wes NSemeais, sessers + Orgacize macina ne seaare Whe (ast e ‘poets \\ oid research 1 Peamete rquvauve yen yb _ Research ng Siropesal Reseach Marchs i apt, REE SHON presets igegast lsties MBREY \\ er gouty M2 H and cote a Setersion ea extension (Apel tune) BiSgran | _ (aegantzations \\cenites Ohics 2088 Prog | eonaeat Pe eee i nies looneact Ragan sopasen Rebacra Ramee, vornberly Sook"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "actionplan",
        "ocr_text": "ons College n Extension, East A75504 ACTION Bas STeraray Rewew and fevis€ existing ‘Awa’ August System (LM of 59 Phelps Financial agvise:"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "actionplan",
        "ocr_text": "Nopertment of Eduewtion Pasion ee ee ee ee ee AOTION PLAN Cec TES TRAE T EA May oly eae i 70% Fund | a c oeniphane OWT sure acre atiaey Pree y Checked by Approved Cameron Phelps va! sore) Financtal agviser asses Rishardaoy ather sage aaa"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "actionplan",
        "ocr_text": "Department of Education gion Divison af tees Nata Sanchez and Sons College 6160 Kristen Extension, East Timothy, PA75504 ACTION PLay OBECTINES ACINTN SRT] ao EAE. _ SOURCEOF -aemeRS iwvoiven pie FUND Establish a Curriculum Gurticulum || Update curriculum Relewand Sereuum Curriculum Man ty bevesulum Improveridht t0 alan ath near «eviee and evelope provement 10 alg Standards. course syllaby ssrraue Eomulee 2038 Fund Foster ey ronmental ‘Conduct campus wide Implement lune Vironmental et campy ro Envigonmental Avifonmental Wares] Sree NS SSR a [Em eppme Saust Eovionme Z Deploy new lUse blendeq Integrate digital \"8. July Digital ‘ear Learning ani ICT ICT Budget Tansformation| t0ols in academic Management systemeSor Department September get OF nope system hig), S2stems fo 2025 M; iintain. Hold internal Adopt i Qa Quality complana with ually assessment] standarazea Quality August ey Operations Assurance requrenatge meetings. ean\" Asgyance Speer Overatio Propared by Checked by Approved by Jessica Richardson Heather Castra erage marae’ Resear Cameron Phelps ‘scientist (physical sciences) Financial aan..."
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "actionplan",
        "ocr_text": "K Tuncthy, PA 75593 PiveD FRAME fEND PERRET Curieulumn lanprow commitse | forreview. 1 Digital Maintain wanes wih actreditation"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "actionplan",
        "ocr_text": "Ogportmnsot of Educate and Sons Caiieg on, East 503 Update curr nw Y Develdpment Fund © ally Use blende cat Resta e005"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "actionplan",
        "ocr_text": "nes nc en 1 Rese emanate bo Camoben Ma shalt ty24 Astuey Vato ys, ce sent a i nme fae Drow ale §25€ members i SOS Fieme eee hgquinze stuor sat shaves! masini Bt eat Du Reaenier PAY eames Rare adiicy ome at jeroath on i) Cgordnete, nah sans proamzator of oh sg 168% Mm Steer Bons Curator"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "actionplan",
        "ocr_text": "Department of Education Region 7 Divides af thay Campbell, Marshall and Duran School 024 Ashley Valleys, New ‘Alexander, PA 76954 ACTION PLAN KEY RESULT OBJECTIVES ACTIVITY STRATEGY PERSO SOURCE OF REMARKS \"AREA INVOLVED FUND Launch campus Engage Si Hygatinane Promearelstc |'Ahinessand' [professional] «Heath, Feptember Health and jellness ee eco wellness health | Services Unit |Noysmber YEU} students and staff. programs. consuitants. Improve administrative Integrate etc Administrative Digitize document ts Admigistrative Per Admjnistrative| \"umargung a for isi os vpn IcIency request forms. ele Encourage active Student. student Organize student Coordin ite, ‘tuder January tudent ticipation in fol d with student i} peiepiten pens 2MAReDS geuetont| SSinat Ma facil activities. _ ‘Support facutty Provide research |Assign research th |February- Research cARSSCEEE ry punlaNPEafemic |. mentornd ”\" Peasmaissper) Research. Renae Tinie Barbara Butler David Cumminas Teresa Davis tam comasoe Special effects artist Curator"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "actionplan",
        "ocr_text": "2 Valleys, Tew ‘nevandet, PA T6054 _ensanasnvoctaianasanioonnsssananininuncisnrTenaaTinostaains SRE aT ee SaaS ongie halistic health among students ane siatt gro: as Slat” Eneaurage 3 shader Uiganiastons s iat i Sessions"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "actionplan",
        "ocr_text": "Department of Education Region 7 Division af Atha ‘Campbell, Marshall and Duran School 024 Ashley Naleys, New ‘Alexander, ACTION PLAN KEY RESULT OBJECTIVES ACTIVITY] STRATEGY PERSON TIME] SOURCE OF REMARKS AREA, isvoLven FRAME FUND Launch campus Engage ‘September and Frompte holistic ““htness and” |proieesional| Healt ri “pln fellness Seria wellness, health | Services Unit Noysmber students and staff. programs. corti. Administrative| \"reason imeat’® Digitize document fa ney our i request forms. atamatin in [Amgisyatve Sacer fcmpstrative Encourage active Organize student Ggordiny St crane tudent =| Yanuary- ctudent ‘icipation in rut nd st Ui fent Developitent Sxracumicus 2umeend pumas) Sessa Mah lacing activities. Suppartiacuty provide le research [Assign research h for per| Res Februat researc Enna nt puoltitg Seemic mentoring” foadraioper| Research | february ieaive Prepared by Checked by Approved by Barbara Butler David Cumminas Teresa Davis Special effects artist Curator"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "actionplan",
        "ocr_text": "Depservorent of Petecation Reyion 7 Rivigaw or Alay Canipbell, Marshal and Ouran School 024 Ashley Vellous, New Alexander, PA 78064 ERLE BSH ROK ESSE EASON Dna ACHION PLAN fama L AREA. r | September | Noyegppber AEDT etal wnistraive! eeNCy suugent 1 Sts j evelopment ¥ pit Tones acta tind | gad with sc udent Cooe ifinate \\ Researc! ihre pul ang i iifaeatemic Si pootwinaiors Apri 2! Barbara Butler Bavii Cumn nines Special etfects artist Teresa Davis Curator"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "actionplan",
        "ocr_text": "Beparsisces of Edecation Region Russel, Secker and Ghent Acade 2198 Derek Grescen Stephanwian! So 4475: <A teenernenaitenninnninenmn SE HTT oe AE BON DEAN STRATEN POORER TT aE We guiricpkam (a elevance improvement industry demands, i ae T Botan fon ly Curse March j May ats i Facuity Tiamig and [Beveiopines Bavelaimer i aborate Engage students in |p ee Community Gommranity, service easnin 1 barangay Extension Uinvalvernent SONS gay yen otis woke. ae sstah St omous [Host planting! prachoes BCtvites, ODE Teresa Rousss Shannon Whitehead ee Marketing executive"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "actionplan",
        "ocr_text": "Depaercnont wf Hdecnan Region soo al Seine tre ket and Giert Academy rei Crescent Apt O69, Sophaieand Se vet ‘BSCS ERAGE RIES SEAS ATA ACRE ARR a ESA ROLRENOR ACTION PLAN ETERS i men ind “avis Seqarts a on Taunhy laiting aia opine Facitgte student vounteer | pregrans Community valvemant Oc L Promote Rai sustainabie Eqongre mrs felost ree wee aches afin, Appin by 3 Rowers Shannon Whitehead Gritesny Zhang Therapist meme Marketing executive ecretary, company"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "actionplan",
        "ocr_text": "Department of Education Region 6 Divicon af ace ceere Russell, Becker and Gilbert Academy 2158 Derek Crescent Apt. 069, Stephanieland, C 44761 ACTION PLAN OBIECTIVES CENT] STRATEGY PERSON INE] SOURCE OF REMARKS ryvorven _ FRAME FUND. E jum Host curriculu feadback ic Curriculum | Ensure, Sy jost ch im mic arch aise Improvernent Erevan as conteWstons. employers Beans Mis Gldoet and alumni. Build faculty expertise Tnvite experts for |Condyet je| Training and lapril June Training and Devel vent Devel roto euryranes rating errs ‘va Hage OReet Colla olabprate Community |nay July CSrearh o08 OP iS students in ngage students in Faciiigte stugen\"| parangay ,| Exjenson Community, |“ service learniny Involvement projects. s programs. an —\\Ercauas er yironmertal ustansdle E mpus |Host tree, planting facuty and enigenes Asie 4 \"pao Wwareniess practices. activities. paige rT a Prepared by Checked by Approved’ Shannon Whitehead Brittany Zhana ‘Secretary, company Teresa Roaers feresa SS Marketing executive"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "actionplan",
        "ocr_text": "Degartenat sf Education crescent Apt O69, hanieland, SC 44784 ste Se RR EN TERRORS IERIE EAL MOTORRAD ASTER ACTION PLAS. rie aoe ReL OF REA i i a toot curricuk foo Academic i Leiprovement fe! conten jay 2026 Guage | i is Aprit- June 4, 2028 Engage s Psenice teain projects fury Community i ae } Puna} Eqeronene ee ‘enypopreental yy IWsines Saver, Agee August { i practice: participation Wit 2026 i Prepare by Cexedlty Approved by annon Whitehead ecuiive: Teresa Ra Therap ris Marketing &"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "actionplan",
        "ocr_text": "Department of Education Distina f Bome menere Russel, Becker and Giert Acaseeny 2158 Derek Crescent Apt. 069, Stephanieland, SC 44761 ACTION PLAN a Curriculum. Ensyre curriculum Hos gut eee Lea ——— a TT ae ep May uly == Ast Approved by Shannon Whitehead Brittany Zhana Teresa Rogers Marketing executive Secretary company Checked by:"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "actionplan",
        "ocr_text": "Department of Fducation Reson Dininent Taeln= Thompson PLC College 74653 Tristan Way Apt 182 Thomashaven Br Borat ACTION PLAS RIV REST ORIECTIVES Tony] STRATIGY FEROS TP SOURCE OFT RENTARRS ARES WvorveD RAM VND nhance online Adopt ‘tal frangtomaton sear 9 stems essen and cloud based MIS Office sepietnber Leaning intretacture connecimty pratforms forms 2026 Grant 4 Heal and Improve mental health Comet co rvere s¢ PRiShe Gi oa pial} Health eee Steno services nest ons ice rund Use poet September credit ioe Quality |Ensureynsttuponal Faciitate monk po Accagtavion cecal Teaginess for sae fiavon assurance accredhavon vists acct anon Noxgmper |\" “Budget t | Te internal Implement |integrate aot ff prstraive| AME etinent ceignature \"snare Recgeds Bagi AugttSfion ney processing approval systems atoms aH Jared Jonnson Charles Calling Mey Jute Msray MO Develooment worker comm Y Social worker Lawyer"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "actionplan",
        "ocr_text": "Department of Education Region Division af Tartan Thompson PLC College 74653 Tristan Way Apt. 182, 1H 50194 Thomashaven ACTION PLAN KEY RESULT OMIECTIVES ACTIVITY STRATEGY PERSON TIME] SOURCE OF REMARKS AREA isvorven FRAME FUND Enhance online Upgrade IT Adopt July Digital Digital leaming systems cloud based equipment and |cloud based is Office [September Learning ransformation) ing adttucture connectivity. platforms. 2026 Grant st- |Mental Health lth and |!mprove mental health Conduct counseing and Sane Guidance Ne hess management oie ES Program Ine \"Siero seriees Ttonshebe wane Sites he Fund Use pet Quality |Ensure institusional Feu eck evaluation Accreditation |SePtember Accreditation Teadiness (01 accreditation credita reparation Assurance accreditation Visits. au i accrediation eam Noygbe \"|\" Budget “rubrics ‘Automate internal Implement [integrate digital Administrative AM Qpatient ectgnature —|\"'Sgaatte™ Records Sis aufon processing. approval systems. _piatfarms. ection 56 \"puna Jared Johnson Charles Collins (Mrs, Julie Murray MD Cawyer Development worker, communty Social worker"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "actionplan",
        "ocr_text": "Deparment of Education Region 9 Division af Tartan Thompson PLC College 74653 Tristan Way Apt. 182, Thomashaven, OH 80 191” ACTION PLAN KEY RESULT —onECTVES T ACTIVITY STRATEGY TIME] SOURCE OF REMARK AREA WED FRAME FUND Die Enhance online Upgrade IT Adopt July Digital ranstofna ston learning ses equipment and aug ed MIS Office [September] Learning if infraStuclure Connectivity. plata Grant Improve mental health Conduct counseling and Hfalthane Euppert services. Swiaagereat eRe Guidance one Mental Hearth 5 tutional Facilita k Use per barns ional Faci ake, mess “ae vendo? Ac September aca daton ean” geste Neygmper P eaitrative Automate internal Implement Integrate digital e signature ignature Records Oe Aula fon _procesaing, approval systems. platforms ection 55} Prepare by Checked by. Approved by Jared Johnson Charles Calling Lawyer Development (Mrs. Julie Murray MD SHES Social worker"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "actionplan",
        "ocr_text": "24683 Trstan We 182, Phemashaven O1s 0181 ACTION PLAN vay we Prepared hs Ceeched by Agger by Jared Johnson: Charies Cotins es. sulle Rauorny S60 Lawyer Dovotogrnent worn, comrazity Social worker"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "actionplan",
        "ocr_text": "Department of Education Region Dividan af Tretia Thompson PLC College 74053 Tristan Way feat 182, Thomashaven, 19 KEY RESULT OmIECTIVES ACTA PERSON TIME] SOURCE OF REMARKS AREA wvouven _rRaMe FUND e online. Upgrade IT Adopt July Digital Digital searing Betis _parade and |cloud based Wis Office tember Learning Jransformaton) “\"Tanatr. egupment a platorms Se Stan August Mental Health Improve mental health Condit counsaing and Guidance \"Welness* \"Stppotsewien “Se” edie Suess Onher [Ruth September |Accredi Quality Enea stpone nal Falta meek wae faion on Accyedation ASS gaan Assurance ation Visits. patie SER Implement —_ integrate digital Offi essere ere internal ecclonature \"donate Recprds Sseiibe Aufpmafion _processing. approval systems. _ Platforms. Prepared by: Checked by Approved by. Jonn Charles Collins Mes. Jule Murray MD at “on Development worker, community Social worker"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "actionplan",
        "ocr_text": "Deparimens ot tection a sen0% peas oe PS RR aa RTT pres fo Re 7 obey vi SR aa a S ee a ac ee [ct | i { Deveio, bic ude joe Stunt, I aes, ae 1 student Officers” Aig Sly Proges peach te OR) Arpgram 1 outcome: with ide di Heads. Onyanize j ay riety, cat coll $3 h pa [lesearen si summits. Chnsshed by AEA y Bana eery Hortcutarist: commercsai A2t0n Graham Systems ananver"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "actionplan",
        "ocr_text": "Department of Education Region 6 Diviian @Danmacinan Combs Lopez School Unit 5172 Box 8882, DPO AE 39882 ACTION PLAN Ri REStET, OMCTINES ReINTY Swarr PERSON SOURCE OF NIARKS ARES INVOLVED UND Otter ESSER nt responsible oth SF eNRE Ship pENental Seager leadership among tearnu LENS, \\t student officers camps portunities Fung Faculty tran tacuty n advances Offer faculty Engage tacuty Facull Febuary Facul Development imrrnases retresher fama Tay Apnil 20: 7 rata na Align Cumculum |Evaluate and refine Review program P \\ rovement Course learning Ing ments rogram lar nage Irnpr ‘outcomes outcomes wih dese Heads ahy ‘S037 ch Encour Organze E Research cross disciplinary menu gapacary mui ee Apni June Research, len ry mult -disca caferaiton ancement |\" fepeatGh, |researcn summstohapsceena Eseeatice M6 o z pou estos Arressedty Rayrand Thomas syrah Dana Berry Aaron Graham Horticultunst, commercial Systems analyst"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "actionplan",
        "ocr_text": "Departernt of Cdscation Region Divine aisannacinen Combs Lope2 School ACTION PLAN [Deveropiie lerenip atnong (He! Weacersnig officers [ee beuaey | Facui Baoage face selres in Cunt [ApH 2027 Training F Program Heads Organize Encourage reutiaiptiiary muli cisciphnat sMMS. Collaborations} Research Ages. June REgeSTSh | Reseach lentancerent) socket Appnest by Raymood Thonnias na Bi kiss 130 tiuitunst, comme’"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "actionplan",
        "ocr_text": "Etepiriawn? of Eadveation Bisieinn aBancaniene $172 Box £382, DFO AE 3G882 cs a OSA EV HOM EES PSO AS RESTOR ORISSA TSTES OST TA SIROTA BREN TF Soe RSS IMSL VED Develop iteid sturent ie aay officer Badership Jal leadership among mp. ip i Mat Yesin facaty in savancer Yeachany raetiertolopes Program Heads pacesrets ae che ml age Research [oReReeit «| OS sCMIaN metalCptray nut accoinal REE,"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "actionplan",
        "ocr_text": "Combs Loper Schoo! Unit 5172 Box 8882, DPO AE 3ag82 TION BEAN PRES RESET {ARES et amg portuntiies. Rayrnoind Troms ana Berry Smadar, ase Horliculturist, commer"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "actionplan",
        "ocr_text": "Deparment of vention tise, Jsian af Do peeves, Stanton and ortiz Academy Unit 6842 Box 9600, DPO AP 11345 ACTION PLAN Time SO FRAME, FUND PERSON ACTIVITY INVOLVED. OBJECTIVES. KEY RESULT AREA Creeding” ak cpm May. Jy Sea Community Extend ois an Involvement underpriie progam iderPrnitcs, communities. agencies fastic use Initiate solid waste, the 3. W; anes Campus, Fase i Rn he campus. management system. <5 eee gana rs Ast sustanabity Adopt cloud based {Implement onine Implement sy ota ‘ates and IT Support |september igi a Sup\" |Senissp [envnd™ Digital Iranstormati “Syemstor data derganee ‘Strengthen internal Conduct: al Quality on ust | astrre auat and monitoring 288 au teal, Saner allt Pana Prepared by Checked by Approved by Kevin Looez Kevin Wona Hydrgrapie surveyor Nicole Torres [teal Engineer, technical sales"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "actionplan",
        "ocr_text": "Ppartapoat af Ea Region 19, Rivkimat Babes ves, Stanton and C Unit 6242 Box 9690, PO AP 1r3a8 LOTION PLA Cr yOULED Tie nf KAME lavoivement, loovernt kugison [goverment MBSR agent OP Saka Suslanab o Warriors RIEAWOR enplement online 4 grading and Managemen. altendal 1 Digzat { moro i Oigtal franstormation. Consuct annuat goatly Sua review, Nicole Torres Kevin Wong Hydograte soreyer Enginee:"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "actionplan",
        "ocr_text": "Dopeertocowe ot Kalucation Regios: 7 Bhdeiaw ed Bechet Reeves, Stantun and Ortiz Academy Unit 6842 Box 8506, OPO ACTION PLAN trp ese ene SRT TET SRT TR 4 j oudinate Community i Exmog guliegen a [involvement under leged eogran Jgoveltahent geen communsies. hears f agencies. j riots aon rpfronmmentall Reduce plastic Awareness, writin the ca [Adopt cloud based nplement a implement ems for aata i Sean ember mei i Bz i i Bit igemat i ute Find Feepard by Cees yy Nicole Torres Kevin Lonez Satmeseesiee Engiewer, wetecat sales"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "actionplan",
        "ocr_text": "eegartoncnt of Exton Haghoes 101 Diskin Daten Reeves, Sinton and Griz Acatemy Unat 664. 42 Bax nae, D BPO VSS ee ACTION EAN Tahmteay 7” SEsON oon ee TP RE OFT SEES) sQeOUSEB [SRAM | ' i { i 1 cpowdate 1, Bees | Community 1 S S| eee pares She Community May invavement waderpavieged ene goudinnent 1 “Communties. coehaunite ren Rates Plastic use sate cat wants, [whic the ampus. pee Anant Sy HE eer) 7 NG mplementonine Wapleznert 1 pigitai Adee loughased EC ig and mpg 1 Sepport Frans ratornation, 1 digstat Siae ganization wtendance aS systenss, i eorthtoue BEEN internat Autor siggnived by Kevin Wong biyaren apt env ieevin Lave: Nicole Tomes jncer, fechmsal Sales"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "actionplan",
        "ocr_text": "| Adopt cloud based systems for data mation! Strengthen internal plow 1 internal Inte neement A i meme Auait Kevin Wona sales Ietogranio su"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "actionplan",
        "ocr_text": "Deparinrcat of Edieention Region 8 Divine a Coin Brown West Institute 934 Sims Crest, Dot Michele, MN 29772 ACTION PLAN erent Encour: | eta! Seg aH TES es ae |sexgar rae.) Regards eho} Tasso Facuty _ [Establish mentonrg Hotd fas tent reagan for ew ongntapog and oj senor |\" Mempers ograms pment agar aes He dent ing pebion based Debate Club — ponemaanan Pasian wet OTT ‘Checht y Rinwe Sanehey TEFL teacher"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "actionplan",
        "ocr_text": "Pepavimens of Siieoation Region Riividam nf Ponts Brow we Ins B34 Sins: Hichelie, inter HRT TT Sora aE TE VNB 1 Encourage i 1 | healthy i [September i ia i compenton Beagpe i H t i ipartcipation ‘ Gigiize recuras raster Sain ist Beveatent MOUSE eS LES [6 mae 3 i meres. February Apnt2c2e Wiungand problen seiving in| Wen Morgan Chinian Benjamin &"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "actionplan",
        "ocr_text": "Brown West inginete 4 Sims Crest. Post Michelle, M138 779° Sacra pasar implement fitness H programs f staif [ae stu Organize fuss Tons and i welhess fy Ss. Sigiize tee Stel document Hasler aun eee soon Program Fung Stucent velopment Sisco j iDevetaprient| i Fund Brien Rete Moroan Ounias"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "actionplan",
        "ocr_text": "Appaved by Prepared by (Checked by. Beryamin Rocha Aimee Sanche7 Morgan Dunlap see TEFL teacher Soeeemeineee"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "actionplan",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "actionplan",
        "ocr_text": "Dopormaat af Edccation Parnsh PLC Academy S260 Derrick Ways, Bust Rathieenvilie, A 38908 icresaRees mes TENET AT Srargey Tee ero POUT TWEETY SRAue ut! j Messe i | Publioh cose aren Jjounals asndall? researen “| Modemize te: | Surticutem secbing| Rrmcite medern Proie finnovdinent nd \"| labeguineent dias Fong EQCerement May sup i et Bae tory Commas i Boag fre sytiersecin [lure rans tS ion! agree ge ts at sectity AGgE Sonennenennern ein: es sis! Wedam Lambert Bontic vt iy \"atric Vlada Galty snentist eel ACTION Pas"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "actionplan",
        "ocr_text": "Parrish PLC Academy 9366 Derrick Ways, Port Kathleenville, AL 88908 ACTION PLAN KEY RESULT OBJECTIVES NCTNITY STRATEGY PERSON TIME] SOURCE OF REMARKS AREA ryvouve _ FRAME FUND. Set up h faculty searc Research rome og [Publish research Research Marsh. psearct eviden research jay 2028 ppa [Enhancement exesrrcunure ual cay Support ‘Gfice v Fund funds. Community Encourage fecuty Parner win yes, |Congnate wth] Gutreach [April June Community ‘Volunteerism in |ror community era Ser Involvement community projects. programs. et fe ts. Coordinators — 2028 Service Curriculum, |Modemize teaching] Procure modem FARHSE procurement May July Facil improve feclics are Ghat aerais eaming,,| Commies. [2 “page infrastructure. un Provide IConduct regular june. _ |Cybersecurity| Digital cybersecurity Copdyet IT policy IT Security Wags PCyPersecur Transformation] awareness to all sectnty training Feam awareness 10 brigtings 2028 un Prepared by Checked by Approved by Wiliam Lambert Patrick Velez Terry Howard cateenremanager Water quality scientist Heath and safety advser"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "actionplan",
        "ocr_text": "inion af Nueva Fea Parrish PLC Academy 9366 Derrick Ways, Port Kathleenville, AL 88908 ACTION PLAN KEY RESULT ORJECTIVES NCTINTTY STRATEGY PERSON TIME] SOURCE OF REMARKS AREA ryvotven _ FRAME FUND. setup cul earc| Research idee Publish researy Research arch a bef evidence based research DI [Enhancement evidence based pease eset esearch ‘Ghee wy S38 upper funds. ‘Community Encourage facuity” Partner wih NGOs [Coordnal wth lApril- June Community unteerism in, |t Involvement |_coleifetanut, [orcemmunty Meraey| el Coordnalors PSoa8 Service Curriculum, |Modemize teaching] Rrocure modem Fyeuge Facil Procurement May July ity. Improvement facil equipment earn Committ 2o28\"” Upar mater and materials. rsctructore. und Digital cyber Se SGiity Conduct IT Fe eau ITSecurity punes [Pybersecurity franstormation awareness 19 all inty training. {pole Saeed waust “Inglative Prepared by: Checked by Approved by etm Lambert Patrick Vele7 Terry Howard Water quality scientist Heath and att aaiser"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "actionplan",
        "ocr_text": "Bepurtment of E Regios fag af fivevs Fri LG Academy Port AL BBOUS Derrick} thleenvil TION PLAN STRATEGY [PERSON TEM TRES | _envenves _ PREV RESORT 7\" GenECTNES 1 AREA ol cvidehige Gased ure made Pre fab equipment ‘hee Vitam Lambert Patrick Veler Terry Howard ‘corsets Wess usth nat sfy anor"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "actionplan",
        "ocr_text": "Division af Nicta Fen Parrish PLO Academy 9366 Derrick Ways, Port Kathleenville, al’ aboos ACTION PLaN KEY RESULT OBJECTIVES] ACTIVITY STRATEGY PERSON TIME SOURCE OF REMARKS ARER woven peel. FUND Set up T earc| Research idea Publish research _ facul Research F SB59 \"Regearch Evidence based researc UP Por nhancement research cofised Journals annual SUppor i e MoFSbz6 Fund funds Encourage facut women vung ty rok 2finer with IN in _SoMmunity poe Cs, r iy irae epee O April June Community Spogane 5 rolous. Coodnets 2028 i Senge A Curriculum |Moderniz, Provide ef 2aching/ Procure modern ight May J Facil faci lab equipeder Ey Fagcurement May July Upac provement “nator and materain intrcctning Commntee 2028 Pond Provide [conductrean Digital cyber egg CemetT, [Poet reauar] Security une feybersecuniy i ransformation NEHGS 020 sePRSHET g ogpiey eau e' Iptatve Prepared by Cocke ty Approved by Wattam Lambert Patrick Valay carmen Water Terry Howard quality scientist He"
    }
]