[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "actionplan",
        "ocr_text": "‘Ropulslic of the Phibppines Capestnent of Eason Reger Peteruon, Taylor ard Meyer Acaclemny ‘cooper remanence tm i NE A EA PN ACTION BLAN Yor9s3 1582 angers, i Mesicet [Higher number of Se eatone Apnt Seta eo Suggies, [GPS meatier o: Famong stsients i eelgting | Binong stufents i ORES scale, (ents ann “Po equip students i 1 1 7 a8G personne! Ru disaster i Digaster Risk (Ropes. fast” nip bi se preparedness dis with May Fesudon ad kas, manenetent nei responders, nae ‘eit: H | improved vrepedness scares (ry 1 postded eveluetoans meraen Sigtin ney |"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "actionplan",
        "ocr_text": "“Bepuidlic of the Priiines Depaamiest at istuaatan agen 2 ‘Chesson nt Garete Be ACTION PLAN B Pegag 1982 Busomes indicator i _| Medical (Hotes nuraber of suppaes, denis jwegiseg a iscalé, tents annua Te promote, heath improved preparedness | somes ge eqyaiuations (\"and gersonn! up dso vghnese preparedinss Sis with | tay i mangetinent Seal responds"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "actionplan",
        "ocr_text": "Repubie of the Pippin. serroant ch Esha 0 3 joghon A Gacou te eal ACTION PLAN S Yi1gg8 1982 y i sume frame Parvon invatve Resource Saccasa indiesiee Activites nge 2 \\ sesical [Higher number of | amenge ann Mesiat Higher umber check PY ae students Se Tents |annival checkups regular te monitoring: nang siuier H and stat, H APE Bie ‘Dipagt ain | wid xi, Mey Maigemeat emergency Commities \"=i!"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "actionplan",
        "ocr_text": "ACTION PLAN 1982 Timeframe Porvorinvate Aesaures Seecaes laceator Ns Meebany gion i udents undercarng, rival aster preparedness urls wih May ment cal ri ‘skills. i"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines Department of Education 4 a Nay. Division of Saacoa se Peterson, Taylor and Mayer Academy Ta S4993 1982 7 Objectives Activities Time Frame Person Involve Resource ‘Success Indicator Needed \"erceang Bema Rae e_ Hoher numberof regular health Arrange annual health 1Glinic Medical Hig! um ‘montana kups and medical April (Sa ie us among students Screenings eae teas [an eet ie Disaster Preparedness Trahing equip students ersonnel Improved Run dis: cikie”*| preparedness sic cdness drs with wastes scores from tate prefocal responders ay Management Jemergency Somes |"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "actionplan",
        "ocr_text": "-Beyutle of ane Peilppncs iepmtroent ot Eat Rage Prank AIR Rese Lid Aca _S3 ACTION PLAN 82095 1987 incre. Se participate: \\fositve fezaak strengthen ie shits de Sound Faculty ser a handouts, weepment ee Aker Ingato Mn? Of 2 eee aaa Organize a vee: Zanaitey cevelonn \\"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "actionplan",
        "ocr_text": "ACTION PLAN SY. 025 1881 i i Activitiog Yhne Brame Parson involve Ros x8 Snieator To sivengti [leadership sidis Conduct ane! teamwork, none student pa ieipeney ind back vate om student To enhance improwed tea pertorn acuity faculty Senuhar"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines Department of Edveaton Reson Division ot “Albay Rose Ltd Academy ACTION PLAN S Y 2025 1981 Objectives Activities Time Frame Person involve Resource Success Indicator Needed ‘Student Leadership ‘Training Program To strengthen Studs Training _ Increased leadership skils Conduct leadership une to Rete Stee manuals, participation and and teamwork seminars at soun sitive feedbac among Suudeiht team building workshops. August ludent system, Pofrom student officers, ‘ouncil certificates \"leaders: Faculty Development Workshop Series Toenhance |g, three d Pi Improved teachi faculty teaching rganize a three day Faculty rojector, Impr ng faculty development handouts, performance and methodologies “Seminar with guest [APM to May Development \"sea ker’ faculty satisfaction “engagement speakers Committee jonoraria Survey results."
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines Deparment of Eaveston Regen Division of Albay Rose Ltd Acaderny ACTION PLAN S2025 1981 Objectives Aetivities Time Frame Person Involve Resource Success Indicator Needed Student Leadership ‘Traning Program To strengthen o Training Increased leadership skis Conduct leadership une to Rete ‘Sitice manuals, partiipaton and and teamwork mynars and ugust reme| sound |positive feedback among suden team bulding workshops tudent system, |\"\"trom student oticers ouncl certificates |\" leaders ____ Faculty Development Workshop Series | To enhan fe) three d Projector, Improved teaching faculty teachin reat develocrert, Faculty ‘ojector, Impr metNodotogies, faculty development lapvistg May Development handouts, performance and seminar with guest speaker faculty satisfaction and classroom engagement speakers Committee honoraria Survey results"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "actionplan",
        "ocr_text": "Renuide of the Prifippines ovat oh Bacto Coie oF Abe ACTIONS PLAN source Soeceas Mcwior | time Brame Berton ire0ls Coe Asti tes i j i Te srengtt i tt Gonduct eaderst i H par H ipositive feedback waders Shes 4 cranes Aric Bn eee an aan Bokaing WOTRERORS. Miran stugent [ienpeoved tezcting [ pedormance ano seutty satatacticn arvey e503. Organize 9 tues day paar development laprt to May acly guest pntta May Devcon Speaker’. nities |"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines Onoonrann of Eee “Sires Pacasean Anderson. oper ancl Owen Academy AGTION PLAN S 4s92- 1970 Activitins Timo Frame Person tnvotve Resource Success tnaisator Needed Campus Clearing Cizaner cangus wilde campus wide Senay of “Un faye (toc Wosh ander ast fr Planting Soturttay i 8 activity Memon Siidant ge. fatal Votiteers gloves compliance rete ——— apareice and Host mental health talks | Flyers aasiees, gwareigss and Host mental health ta {rama 3 SRSA TS, RUDRA RE? Oconer 3, ta eee mental heaith sessions, Bepariment yp; Meoneerr i students."
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines eal Dvn cannasinan ‘Anderson, Cooper and Owen Academy ACTION PLAN S1992 1970 Objectives Activities Time Frame Person involve Resource Success Indicator SRnatiay Base | To promote SPONSE ahd Hold a campus wide Every first sdertae, Cleaner campus “ioe clean up and tree planting satrday of Meh tare |e and higher waste practices cemy eon ti a doves coseqegaton Mental Health Awareness Campaign T Greater ana, “eupemratiats oe, Ee wie sues, Counseling services ai méoneeina” Deparmey among"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "actionplan",
        "ocr_text": "adnan ‘sree mene monensin mr enone Anne fintenmnnnoncmnneee ACTION PLAN S tgse 976 siviniee Thoe Frome Person mysine Renourse Success ndiostur a [_Naades Ovjectivee Cleaner puswide Every fi and Heh e planting Satur |e mor vai heaith talks ercounseltid October mental nealih Concenns"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "actionplan",
        "ocr_text": "“Repaicle of vine Pallippines Dasewtrannt of Eaueation Ree 2 Genie Parmesan Andersen, Cavpw and Qeen Academy gemma AAR AEM AEN AN TOLD A TET IO, ACTION PLAN SY 4992 970 ‘tone Freme Rasoaree Suesnos tndiestor L Maaed Cases Creare art SRRSa eee Fopromete ampus Cleaner Tole, cide campuswiie Every fist mantener edie At ise is tee ahd [cleanup an tee planiing Saturday ot ante Pape 8° Pe i actneity fae month sade i icon ance rate. Vekmntoe i a Suicance Flyers gyal h@ ong Host mental hesith tats Syeors, sara, j SARS Signa sn and PeEPLOsheinG October PaversIO counseling 1 a Departinent maven al memal health SGNCeS."
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "actionplan",
        "ocr_text": "EEX Republic of the Philippines >) Department of Education Regen ig ‘Anderson, Cooper and Owen Academy ACTION PLAN S1992 1970 Objectives Activities Time Frame Person Involve Resource Success Indicator Needed Campus CleanUp and SoRamnasy Bove _ _ i i To promote c. cl environmental Hold a campus wide Every first yg arePUs. leaning Cleaner campus responsiblity 2nd clean up and tee planting |Gxudan et Meaieatee tools, trash and higher waste sustainable bags, segregation wraps aeniy themonth —Siudent gloves complane rate __ Mental Health Awareness Campaign To raise Greater awareness and Host mental health talks Cs I arpielnis, awareness gf reduce stigma on and peer counseling October sychology faypaulns. mental healt mental eatn sessions Department J senvices among con materials. ~~ students"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "actionplan",
        "ocr_text": "Rewiolic of tha Phtippines ACTION PLAN S.¥. 1974 2010 Tiros Frame Pomeninvelve Resource Success incicater ——— [__ Mawaeer oo H [Natebooks, ly tutoring} fog | NOLEOORKS, oy SHEE) suv ts Vcerting| pencis, \"| fh SNS\" pecember yd Siident Wansporialion improved gtades ii ORIN et budget ‘of tutees: i i a Fo mapa ~~ ny i ions Sudents Facliiate computer y,, semana prowess yf acitate computer Mychto ‘mores Kis i en s, ing’ conyputer tutorials. i"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "actionplan",
        "ocr_text": "“Republic of the Plippes Beycomonof Eetenn Tension of Coeaean Grown, Caterman and Moore College neces aN RSNA Ot AN MEAN ACTION PLAN S YAg74 RNG Astivities Vine frame Perecn lives Resour Suomeas iniectoy nent weekly lutoring i fy “Hotabenks.| a fs fat elementary 6 SM repeat wives at, CF Depatinent (Computers S Facittate Vsciware der Ce eee ered” |e es ineacy wees UNpeneng, pompuler skis ie ON oF agegemic Moon! usbessmens."
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "actionplan",
        "ocr_text": "“Repuicie of tre Philippines, Brown, Coleman and Moore College ACTION FLAS SYig7a 2018 ‘ine Brame Resource Success indicator Nispoedt Notebooks, eS. ansportatios budge iaplemert weekly tu Moving July | uidiprivieged Se9si0ns “or aleraentary” p28 jents in ihe: Ups. | sees improve students’ proherency in ig digital tools Faalitate computer titeracy workshops an utorials"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "actionplan",
        "ocr_text": "Kapuishe of tye Prilppines heparan ot seat Region Eeveion ot Casta Brown Coleman act Moor College area ncncrscencee ee ACTON PLaa S974 ang Pare Sarexchs i j ! i 1 Jp emens i SS 'mpiement weekly tutoring oe Extension [Notescoke j see, | B3ssar Ses8i0nS far elementary’ July to fe Unt] pencis Dee aay undene SESSIONS Fey ekementary December i tke Gaal tanccortaticn ion NO ane Pu i pelea Bal i oti Facitate computes Computers, gid} actware |} di lusing digital ols cy workshops Computer foenses. i te Ragenic tutorials i 30 tra Computer siete ig |"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines Deparment of Eaveaton Regon Dreason of Cagavan Brown, Coleman and Moore College ACTION PLAN S Y 1974 2010 Objectives Activitios ‘Communty Outreach T if | Tenn vee Tp extend edueatoral, Implement weekly tutors Extension, Notebooks pT ee apsistance July to nt pencis, enters at BsaRaNEds sessions forsiementary December services dnt aAsportabon WOUNtsy grades s v wnproved gra Sere be pupil olunteer’ Tpudget of tutees (Dagtal Lteracy Enhancement Progam 7 oe To improve WoT nent |C Student: pean Facitate computer March to Department cotware cmoraiate Reense: eer cois Meracy workshops and Kee Sie Beene computer skils 4 “ao? assessments tn? ac ade rnc"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "actionplan",
        "ocr_text": "“Reputslic of the Millippines pretest oS Rouse Miler and Siimraons insttute ACTION PLAN Sq9aR 1985 Frame Personiswelee Rexouree Sucotsy indiewtor [Messed lo provide career oxees ouldance an Ob Coordinate with Guidance i feadiness. experts fer mock Sees ase upper for nlerviews anda. een i SShudente” i 1 i i _ To develop | Research |. seettl faculty skiisin Conduct training on Peegachand| Me sata edt | condudting ard rch wang and Aus igen\" aplops, esearch ote i publishing cal standards. an"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "actionplan",
        "ocr_text": "t ii i Actes Tome Frame Foissninowe Roseuroe Sucesne ingieator Needed (guidance Coordinate with in ea ines experts for mock sbppart fe interviews and fais. ' a) Peggerch Conducttainngen Research Tis. 1 research witngand August “Pubieatsn laptods reveaich i"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines Dupacmeet of Econ ACTION PLAN S1988 1985 Tone Frame Parsoninwotes Resources Sueceee indicator bean i ——|_ 1 mi “Ty i | ‘To promde career Cu chures, Highor Sumance ard jOD Coordinate with indusry sudance pe employment rate stecnres: experts for rock, danuary cegod papers, and internat aGuating een featons pment Satgefachon Sicene wr Reeons 4 4 __t | facut Condsct raining on ard) PREP mcreased tnexdty Condixtny and research witng and August PPeiade iaprops research aviput Pubkshing ethical Standards © etemet and pubtwatons. researc access |"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "actionplan",
        "ocr_text": "Departmen Pogo 5 Digion af “Leste AGTION PLAS 288 1985 Revowree Suecenstadteater To provide career i sures, High guidance and Jo8 Coordinate with industry ' ‘eiest employ Deans: experts for mock January ais, aadintemshio | SESok inter andtakks. : ‘atidic” ci aduating FMT || Relations equines: ‘Studer | _ Te develop faculty skiliSin Conduct tranny on conducting ond research walling and |” publishing ethical standards __seseareh Uncreased faculty research ouput ‘and publeations, |"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "actionplan",
        "ocr_text": "To provide career rndurstsy pare and job Coordinate wath nee for mock and talks"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "actionplan",
        "ocr_text": "“Republic of the Philippines Department of Education Regen ‘Dwsion of \"Mile Richardson Johnson University ACTION PLAN ‘$.¥.1972 2007 Objectives: Activities Time Frame Person involve Resource Success Indicator, Needed RRL Juries Printing Improved quality urna tucept, Hold writing dlinics and as arcs any “loumalsim contesis February ae canes gubcaten snd nee yeaa ‘Gender and Development Seminar To educate the ‘Tarpaulins, it community on Organize a gender jer and 7 gender equality Sensitivity and ‘September Season ab WtSicy Pat aon om Saino empowerment seminar. e shirts (gender sensitivity."
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "actionplan",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines ‘Department of Education Region 4 Division of Neil Improved quality {hestion and Hold writing clinics and mely releases. journalism contests. tarpaulins, Roan trom sepuener (SEER aREBey TARE Sesion adisiscy ofa zenstiviy. Toeducate the Organize a gender ‘community On| genie ay and"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines poem eae Reson Division of “Ine Richardson Johnson University ACTION PLAN S1972 2007 Objectives Activities Time Frame Person involve Resource Success Indicator Needed ee Hee Printing Improved quality journalistic ident rintin: improved quality standards and Hold writing clinics and) February pasicaton, materials, pfstudent writing quality of journalism contests. dyisers and Cameras, publication and fide ditors notebooks timely releases. mult Sis ‘Gender and Development Seminar Toeducate the oy, Tarpaulins, ost rganize a gender sender and Gas sensitivity and September [Development 4PE S y Gartapsns on ‘and inclusivity. €mpowerment seminar. Office shirts |gender sensitivity"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "actionplan",
        "ocr_text": "Dapartwest Regen Richardson Johnaun University ACTION PLAN SY 1972 2007 Oboes cities ime Frame Percontmotve Rewouroe Gusenas indiestos i vedo Toieaprove i i joumatstic Printing Improved quatity standards and, Hold writing cl fing qually of jowrnalsm con Pease Rigation and elease: smel ‘sitive evaluation From parbcpaats on loenider densitivty ine a gender Serger and, iy ard Development 8 nerk seminar Otce OSS"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines Department of Education Regon 40 Division of Laguna ‘Ss Mclaughlin, Diaz and Kelly Institute ACTION PLAN S2017 2006 T Objectives Activities ‘Time Frame Person Involve Resource | Nooded Success Indicator Academic integrity | Promotion Week. 4— | Reduced cases ‘To foster honesty | Academic ueed cate Posters, cemmcacient, [Rowan GREE \"hes Sareea and ethical integ! res and A ee integnty Biochures and the school Bascole gannets \"itegmty academic work. | awareness. Cc Parent Teacher Partnership Forum To strengthen ‘Sound Stronger Pare eer Hold gene aesere. la serene y Alaton sete, galamorsien., development and for parents and te: \\ers. lof semester ers: dl a BENE earns. | fables and teachers"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "actionplan",
        "ocr_text": "and 52P0et programs Republic of 4 Philippines Oepartment of Rataestin Devston oF Leenins “ren sneer ACTION PLAN $2017 306 Person fnveive | Tie Brame Resource Nowder cau inlay Semple Eiggeemic, pune an conduct ine: Commitive # general assem Tor parents and teadt cas F of semester."
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "actionplan",
        "ocr_text": "opubitic of THe TH noes “6 Peacon et CAnUna ing atat Rely ac fewtion tune Frame Porwon cwotve Rasoietoe Success lesicwor Nwodor Reguesc ber ecene: 2nranene Foner tronge! cusholaon between Ne grid teachers Hold a genera asserts Eve fo parents andteacher of serces"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "actionplan",
        "ocr_text": "| : : i 7 Fotate preety | j I Reduced cases rn eh Posters, ease [tenga cee i. me | acAdSERS8,. conduct mtegnty talks yor Commie oa Manes student | awareness rye ay [ey ce Sea semester |"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "actionplan",
        "ocr_text": "‘Objectives Republic of the Philippines Department of Edenton Region yon of Lacuna gad To foster ponesty pendistitstong i in egy bree BRANES and NSt among ‘Conduct ntegnty talks. mea (Eromation Week) PSE. corsa a iron bests SEM. aaa parent Hold a genera, assembly Every end 5 Ps d teachers Rist fables and teachers Kana for parents"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "actionplan",
        "ocr_text": "“Republic of the Philippines Department of Education ‘Drvaen cB idnnn Mcbride, Garrett and Johnson Schoo! ACTION PLAN S2006 1996 ‘Objectives: Activities Time Frame Person involve Resource Success Indicator, Needed oe sa Te environmental ,_ Launch eco fien Fogger oe Soh, inprovernent in sFonsciopsness drives and poster making June “aes Med aciatics contests. onages ces to Campus Safety and Emergency Onl Feserat and Espre Toen: Saft Whistles, reaginess and quicl neeoaeel eat aks Ta an November ‘ang Local Megaphones, departments. Dep emergerties Trent [MRIS reson Bilng"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "actionplan",
        "ocr_text": "“Republic of the Philippines aiearenant of Ecavan gees 4 Divaion afasurirtnes Ganet and untosor: Schoo! AQTION PLAH 32008 1996 Time Frama Penton imonive Stespuree Aopromse 5 i j |. Noticeable seuorene ai igunch eco. triendy Eranarte Plerting impravemeat in a drives and nostersnaking June oe \"andectiviies. i Sandyst i iis ios, Faster and pre jones rg ant ha _osanhgoate ats ganized apartments"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "actionplan",
        "ocr_text": "PUvLC of the Phil, Sian ORR diet ean He. Garett and Joba ppines sation ACTION LAN ©. ¥2006 1996 Time Frame Parsan te Suncens invticator Launch ecuir ny Planting dives and pasta ID une. F Seng (20K, paint, echires, contests j CSPSAMent sichages eb srisure featiness ang RTE SpRSe Suong sthergencie i Novernber aii yocar Mecaphane: i Depattien: (RS igency"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "actionplan",
        "ocr_text": "| Fadi a ss james. winatles, Se f 7 renhe ngat ; oe3 are, sal November or 1 a QSE TARE an et | ie response depariments."
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "actionplan",
        "ocr_text": "Bepuicie of 16 Peiippnes Sagan ct Encte Regent risen oh dere sebsido, Garmt, and Johnsan Schoo! eel ACTION PLAN S2005 1906 Noticeable 2 i i fo promote i i gavionmental |, daunch eck! andy Emyonmertal Plarting amproveniet t Bae ane Poser manna dune gap trimer ‘tools, part, enaronmental poe ires poles paparinen: \"Sgnages || Mahe ‘gid activ i OM campus. oncict f ed H eo AS a alt Novesnber depariments, i"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "actionplan",
        "ocr_text": "Republic of THe Pyikppnes Dasara of Eco egos Divsion of San ie Ferd, Mastines and fleisen ACTION PLAN B2017 OG Se i i <. rm i oo i Sepong, Beeston ers. x SOM, EYEE earners ch elusive aining. [Soimputers meena special needs. ) Curural i an Af abe sel partiepation and jeoeca si Stu Bp pes sopnones) ‘apprecianon for costumes arte. ' EE agence a xi ‘and cwiurs in) cuttural perform Wie ASHBY be 1"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines Department of Education Region 7 ‘Division of Numa Esta Ford, Martinez and Nelson University ACTION PLAN S Y 2017 2010 T ‘Objectives Activities Time Frame Person involve Resource Success Indicator Needed [eas An | fo improve Modul Implement differentiated aon inclusive i RSC Tor teaching sessions fot Secon 2 mbes, Ate in earns eceds meg aaa eee apheau HS of Organize art exhibits and ie seu, participavon and ae anjculre P| rganize aetfermanees,” {December ARTERY pene appreciation fr Cauitural Appreciation and Ants Festival T"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "actionplan",
        "ocr_text": "Repulblic of the Thitppines Ongectment et Eeaa once, Tree ot hee ee Foard, Martine and Notson University ACTION PLAN S 2017 2016 | Torre | aeprecmbon of art Lid H fsesaatege CST ME centr"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "actionplan",
        "ocr_text": "Republic of *he Philippines: Depart ot Eaveaton Region isin of hue 2 Ford, Martinez and Nelson University ACTION PLAN $S Y 2017 2010 Objectives eet | Modules, hers ar ve pee us Tyayoon, | implement aterentited second ane |\\\"Gaceme oan |e. | ceamereaah | computers cass’ | tr carer appreciation and ats Festival ——— Tonu Sta‘ okie apprecial ute of Organize art exhibits and December | Rae eens Pac ee costumes arts and culture, in| in| cultural performat"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Priippines Ford, Mattinaz ann! Halzon University eeanesnscneunes nen nea HARPER ATELIER ES I AGTION PLAN B Y 2017 2040 Success indicator OBjactives Aetivitios | Toimprove j Teachers: Modules, “aopiving meusive le. anethocs | Hop Second cries Se maleate, eG BEtNey is | feamers with i j jeomputers OPS | especial needs. . “enti 238 microphones) \"app i “oostures PP gp TODBH BE og | niaton of Oiganize art exhibits and December aE 3 Sey Cultural performances, Decemier fhe stusent BODY."
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "actionplan",
        "ocr_text": "“Expabils of the Philippines Moron, Cruz snd Domit ACTION PLAN S.¥ 3008 Activities Herwon ineuive Ronquree Susces tnaiestor - Needs Te gnhance the i Server Chowne oF Upgrade computer iabs yoke 1 ateiver Toh peed Sepa brows (CP aioe. equipment ISEbased ‘ap provide ICT acadense ties amps ottentahon year canies, operabion momitors Ingreased recognize ams olurtes? sthoul i"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "actionplan",
        "ocr_text": "fand provide ICT ac a oreriaion | t “Student Vouunieeram Reecognibon 08) | \"es sa Upgrade computer tabs Whe, Depatiment jean see et BS ge TE. eae Communty Certificates, To recognize and Hold recognition ch Croggement tokens, Mar reshments, engouage active caaeaeee eqggenreadmest nate . impact reports. ‘schol inate =p -"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines Department of Education Region Division of Levte Moran, Cruz and Dominguez College ACTION PLAN S2000 2002 Objectives Activities Time Frame Person Involve ‘Success Indicator Imprsvemnen roject Toenhance the efencyof® Upgrade computerlabs Whole pepMlSent Jequeitent, seuss Ila, ICT based and provide ICT academic ‘radmin cables, ~administraiive ‘Campus, orientation year idAdmin canes. processing time. ‘operations. “Student Volunteerism Recognition Day To recognize and Increased neourage Hold recognition Community, |Certficates, ,, Volunteer volunteer ceremonies for active March Engagement tokens, €ngagement ani participation in “Student volunteers. Office fefreshménts _ _ community school initiatives. impact reports."
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines Department of Education Regon 7 Owsion of Levte Moran, Cruz and Dominguez College ACTION PLAN S2000 2002 ] Time Frame Person involve Resource Success Indicator LL _ Needed ICT System Objectives Activities Improvement Project Tognhance the iclency of Upgrade computer labs wi MIS Server Reduced JCT. ietbaced and pronde CT!” acadatiic Deparment ledger, issues Sh (ler ‘campus orientation year” andfdmin cables, agmnistrative. operations. tal Monitors PI Ing I Student Volunteeram Recognition Day 7 To recognize and ] Increased a eu le Hold recognition 1 Community (Certificates, engagement and unteér ceremonies for active March ment tokens, Participation in student volunteers. SR ‘school initiatives, e fefreshi Community fefreshments community"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "actionplan",
        "ocr_text": "Republic of the Philippines Department of Education Region 7 Division af “Levte Moran, Cruz and Dominguez College ACTION PLAN S2000 2002 Objectives Activities Time Frame Person involve Resource Success Indicator Needed ICT System Improvement Project To enhance the BUEN a? Upgrade computeriads whole pedMlent leatipieem, isfeeUSed Ie, ICT based and provide ICT academic DrPcmcn cables, administrative campus orientation year admin |e ctltors processing time. operations. Sludent Volunteerism Recognition Day To recognize and Increased encourage Hold recognition Community [Certfcates, |. volunteer 4 ‘volunteer ceremonies for active March Engagement “tokens, engagement ani participation in “student volunteers. Office fefreshments, ,_ community school initiatives. impact reports."
    }
]