[
    {
        "image": "administrative2_synth_11_aug1.png",
        "label": "administrative",
        "ocr_text": "Chambersm MANE AL OF ADMINISTR. n inettule of Technology LICTES ANG PROCEDERES. SECTION: pdmi Number: apaeorose AREA: Campus Operations. SUBJECT Policy on Incident Reporting PURPOSE AND SCOPL Establish clear responsibilities, timelines, and documeniation standards for policy on incident reporting across ai! units. This poficy applies to full time employes: contractual personnel, and authorized service providers working within covered offices. Ih POLICY STATEMENT 41. Compliance: Ail offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators moniter adherence and alate exceptions. Documentation: Requests and approvals must use the prescribed forms and digital tracking system 4. Timetines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Div metiics quarteny and recomimencds revisions. jon reviews"
    },
    {
        "image": "administrative2_synth_11_aug2.png",
        "label": "administrative",
        "ocr_text": "Chambersmouth Institute of Technology MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Administrative Policies Number: aowzri064 AREA: Campus Operations SUBJECT: Policy on Incident Reporting I PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on incident reporting across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. M. POLICY STATEMENT 1. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. “May 11, 2025 Page 11 of 20"
    },
    {
        "image": "administrative2_synth_11_aug3.png",
        "label": "administrative",
        "ocr_text": "Chambersmouth institu MANUAL OF ADMINISTRATIVE p te of Technology POLICIES, AND PROG EDURES SECTION: Administrative Policies AREA: Number: ampus Operations ADM 2710 64 Susecr: Policy on Incident Reporting Establish clear responsibilities, timelines, and documentation Standards for Policy on incident reporting 's. Th 'S policy applies to full time employees, Fsonnel, and authorized service Providers Covered offices. across all unit: contractual pel Working within He POLICY SPATE MENT 1. Compliance: Al maintain auditable records for thre 2. Roles: Department heads ensure Coordinators Monitor adherence and escalate exceptions, 3. Documentation: Requests and approvals must use the Prescribed forms and digital tracking system. 4. Timelines: Standard Processing time is five (5) Working days unless higher authorization is required, 5. Monitoring: The Administrative Affairs D, metrics quarterly and recommends revisio, Il offices Shall follow this Policy and e fiscal years. e dissemination: unit ivision reviews ns. “May 11, 2025 Page 11 of 20"
    },
    {
        "image": "administrative2_synth_11_aug4.png",
        "label": "administrative",
        "ocr_text": "uth Institute of Technology Chambers E POLICIES AND PROCEDURES MANUAL OF ADMINISTRATIV SECTION: Administrative Policies Number: ADM 2710 64 AREA: Campus Operations su8 eT Policy on Incid ent Reporting PURPOSE AND SCOPE ities, timelines, and on incident reporting to full time employees, roviders Establish clear responsibil documentation standards for policy across all units. This policy applies contractual personnel, and authorized service PI working within covered offices. i, POLICY STATEMENT ices shall follow this policy and ree fiscal years. e dissemination; unit d escalate exceptions. provals must use the 4. Compliance: All offi maintain auditable records for th 2. Roles: Department heads ensur' coordinators monitor adherence ani 3. Documentation: Requests and apt prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. Page 11 of 20 “May 11, 2025"
    },
    {
        "image": "administrative2_synth_11_aug5.png",
        "label": "administrative",
        "ocr_text": "| a 1 PURPOSE AND SCoPE Chambersmoutn instiute of Technology MANUAL OF ADMINISTRATIVE POLICES AND PROCEDURES SECTION: Aciministrative Policies Number: pox 2710 64 AREA: ‘ampus Operations ~—Polley on Incident Reporting Establish Clear responsibilities, timelines, ang Standards for policy on incident t reporting This pclicy applies to futi- time employees, rvice providers working within covered offices, POLICY STATEMENT 1. Compliance: All offices shail follow this Policy and Maintain auditabie rec. 2. Roles: Deparinen e Administrative Affairs Division reviews and recommends revisit Oris."
    },
    {
        "image": "administrative2_synth_12_aug1.png",
        "label": "administrative",
        "ocr_text": "MANUAL OF ADSHNESTy SECTION: Administrat AREA: General Ad, Pe Mministratic —— Number: anys csog 47 fablish clear respi documentation Stan @cross all units, This contractual per: Onsibilities, tmetin and dards for policy on Slaff development S policy apoties fo full tim, sennel, and authorized servic ing within Covered offices. iG anployaas, broviders POLICY STATESMEN? 1. Comptiang: saintain aug) @8 shall follow this Heble records for thres Department head. coordinators monite 3. Documentation: policy and ensure dissemir TF adherence and es, Requests ang app: forms and Gital tra, dard Processing time j ‘er authorization ig rovals must y em, five (5) working uired,"
    },
    {
        "image": "administrative2_synth_12_aug2.png",
        "label": "administrative",
        "ocr_text": "West Kevin Institute of Technology MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Administrative Policies Number: apM 4129 47 (8 General Administration SUBJECT: Policy on Staff Development I PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on staff development across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. I, POLICY STATEMENT 1. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. “May 21, 2024 ENECED"
    },
    {
        "image": "administrative2_synth_12_aug3.png",
        "label": "administrative",
        "ocr_text": "West Kevin Institute of Technology MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES: SECTION: Administrative Policies Number: apM4129 47 AREA General Administration SUBJECT. Policy on Staff Development I PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on staff development across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. I POLICY STATEMENT 1. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. May 21, 2024 Page 120120"
    },
    {
        "image": "administrative2_synth_12_aug4.png",
        "label": "administrative",
        "ocr_text": "Technology POLICIES AND ppg alive Policies, Generat Adminis Estabiish clear re: pon documentation sia across all. contract working with “bite 28, timelin for BOkey on ang Ff ff devetonment S to fulltime empl 2d Service provick Senne, and authos in coverad ON. loyaes, POLICY Staten, 1 0 “plence, Al 7 ofiees sha Tal follow t iS main cor ds for three Seordinator escalaig exes: 3. Document, OHS, Ss and approvals must use the G forms al tracking System. S. Standard process sing ume is five 5) lion is requirsa The Administratiy /@ Affairs 2 rerly ang recommends re working MiSION reviewa ‘May 21, 399a7 7"
    },
    {
        "image": "administrative2_synth_12_aug5.png",
        "label": "administrative",
        "ocr_text": "tule of T Kevin in’ MANUAL OF SBME ology ISTRAPIYE POLICIES AXdd PROD EDL RES ies Rumbor: Policy on Staff Development A PURPOSE Establish clear responsibs ,and documentation standards f Hf development across ail u his policy applies to fulltime employees, contractual personnel, i service providers ng within covered offices, fiscal y Sure dissemination; unit and a ‘ords for ihre ent heads tor adheren umentalion: Requests and approvais bed forms and digital backing systern, 4. Timeli ndard process days uniess 3. Monite FICS A SATS. artery and recor"
    },
    {
        "image": "administrative2_synth_13_aug1.png",
        "label": "administrative",
        "ocr_text": "7 North Alfredstad College MANUAL OF ADMINISTRATIVE POL ACIES AND PROCEDURES. SECTION: Operational Guidelines Number: AREA: ADM S788 85 EA Human Resources SUBJECT: Policy on Procurement Approval 1 PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on procurement approval across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. I. POLICY STATEMENT 1. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. “January 24, 2025 age 130120"
    },
    {
        "image": "administrative2_synth_13_aug2.png",
        "label": "administrative",
        "ocr_text": "North Alfredsiad College MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES seerion: Operationat Guidelines Number 40K 5768 85. Human Resources suessey: Policy on Procurement Approval ' PURPOSE AND SCOPE Establish clear responsibilities, timetines, and documentation standards for policy on procurement approval across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. N. POLICY STATEMENT 1, Compliance: Ali offices shali jollow this policy and rnaintain auditable records for three fiscal years. 2. Roles. Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions 3. Documentation: Requests and approvais must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarierly and recommends revisions. “January 24 2025 Tage 020"
    },
    {
        "image": "administrative2_synth_13_aug3.png",
        "label": "administrative",
        "ocr_text": "North Alfredstad College MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Operational Guidelines Number: apw57e9 5 AREA: Human Resources SUBJECT: Policy on Procurement Approval PURPOSE AND scope Establish clear responsibilities, timelines, and documentation Standar i u ces shall follow this Policy and ‘Cords for three fiscal years. Affairs Division reviews metrics quarterly and recommends revisions. “January 24, 2025 Page 13 of20"
    },
    {
        "image": "administrative2_synth_13_aug4.png",
        "label": "administrative",
        "ocr_text": "North Alfredstad College MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Operational Guidelines Number: apM 5788 85 mit Human Resources SUBJECT: Policy on Procurement Approval 1 PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for Policy on procurement approval across all units. This policy applies to full time employees, contractual personnel, and authorized service Providers working within covered offices. I, POLICY STATEMENT 1. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the Prescribed forms and digital tracking system. 4. Timelines: Standard Processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. “January 24, 2025 Page 13 of 20"
    },
    {
        "image": "administrative2_synth_13_aug5.png",
        "label": "administrative",
        "ocr_text": "North Alfredstad College MANUAL OF ADMINISTR. ATIVE POLIC IES AND PROCEDL RES SECTION: Operational Guidelines Number: AREA: uman Resources SUBJECT: ADM 5788 85 Policy on Procurement Approval PURPOSE AND scopy Establish clear responsibilities, timelines, and documentation Standards for Policy on Procurement approval across all units. This Policy applies to full time employees, Contract ictual Personnel, and authorized service Providers working within Covered offices. HPOLICY STATEMENT 1. Compliance: Al low this Policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination: unit Coordinators Monitor adherence and escalate exceptions, Documentation: Requests and approvals must use the Prescribed forms and digital tracking system. 4. Timelines: Standard Processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Divis, metrics quarterly and recommends revisions. offices shai foll ion reviews January 24, 2025 Page 13 of20"
    },
    {
        "image": "administrative2_synth_14_aug1.png",
        "label": "administrative",
        "ocr_text": "Danielburgh Institute of Technology MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Operational Guidelines Number: pM 7636 49 aah Finance and Procurement s 8 c: Bolicy on Records Management f PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on records management across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. I. POLICY STATEMENT 4. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. “March 24, 2025 Pave 140120"
    },
    {
        "image": "administrative2_synth_14_aug2.png",
        "label": "administrative",
        "ocr_text": "Dametourgh i MANUAL OF ADMINISTRAT SECTION: Operational nes jnance and Procurement and -ords managemant me employees, i lines, for policy on re y applies to fai across ail units. This pe! contractual arsonnal, working within covered cifices. YATEMEN? 4. Compliance: All offices she follow this policy and auditable records for three fiscal years. maintain 2. Roles: Deparim: nt heads sure disseminal unit renee and 6 calate exceplinns coordinators monitor adh 3, Doount niation! Reau orescr dforms and dig fal ie 4, Timelines Standard processitg tiene must use the sts and approval coking sysier is five (Ep working days urdess higher authorization is require’ e pffairs Division reviews 5, Monitonng: The Sdministraty metrics au rterty and recommends ravis “saaroh 24, 2025"
    },
    {
        "image": "administrative2_synth_14_aug3.png",
        "label": "administrative",
        "ocr_text": "Danielburgh Institut MANUAL OF ADMINISTRATIVE fe of Technology POLICIES AND PROCEDURES SECTION: Oberational Guidelines Number: aou 763649 AREA: Finance and Procurement SUBJECT: Policy on Records Management PURPOSE AND scopy rds for Policy on re ‘cords Management Icy applies to full time employees, Contractual Personnel, and authorized Service providers working within Covered offices, M POLICY STATEMENT 1. Compliance: All o ices shall follow this Policy and maintain auditable r €cords for three fiscal years, 2. Roles: Department heads ensure dissemination; unit Coordinators Monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the d digital tracking system. Administrat ive Affairs Division reviews nd recomm metrics quarterly a ends revisions, “March 24, 2025 Page 14 of 20"
    },
    {
        "image": "administrative2_synth_14_aug4.png",
        "label": "administrative",
        "ocr_text": "§ ANE PROCEDURES feamber: 1e5, 2nd rg rearagem® Mies. at laar TeSpOr Establish gocumemiaion aiandards for policy nm re ee ali units. This policy app! jes to full ime ernployess, ice providers aor contractual per ped Seiy oor) working within cover i and author ed offices. POLICY STATEMENT spas snail follow this palicy for three fise? A years. sure disgernination, cephons 4. Compliance é aut auditable rece ni heads 2) roe 2. Rel Deparime! conrainators rbot adyerence and escalate in, Requests and approvals zuse the 3. Documental ioed forms and digital gacking syst aC _ Timelines: standard proce days umses nigher aquihort etioey 16 FO 5, Monited The Aart trative Afi amends 1 yy and pace"
    },
    {
        "image": "administrative2_synth_14_aug5.png",
        "label": "administrative",
        "ocr_text": "Danieiburgh institut [OIE AND PROCEBL RES, Number: apy PURPOSE AND sCOPL Establish clears responsib documentation ACTOSS oa ur ties, timelines, and policy on records management time employees oviders POLICY STA policy and 2 cal years. ensur semination: unit ence and escalate exceptions, 3, Doc Sums sation: F Requests and approvals must use the d digital tracking sys Sta card proce authori. n reviews March 24, 2625"
    },
    {
        "image": "administrative2_synth_15_aug1.png",
        "label": "administrative",
        "ocr_text": "North Sandrastad University MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Administrative Policies Number: apw 3474 28 AREA: ‘ampus Operations SUBJECT: Policy on Facility Access Control PURPOSE AND scopE Establish Clear responsibilities, timelines, and documentation standards for Policy on facility access control across all units. This Policy applies to full time employees, contractual Personnel, and authorized Service providers working within covered offices. MH. POLICY STATEMENT 1. Compliance: All offices shall follow thi maintain auditable r cords for three fisc, 2. Roles: Department heads ensure dis: Coordinators monitor adherence and escalate exceptions, 3. Documentation: Requests and approvals must use the id digital tracking system. IS policy and al years. 'Semination; unit by Monitoring: The Administrat metrics quarterly a ive Affairs Division reviews ind recomm lends revisions, “October 08, 2025 Page 15 0f20"
    },
    {
        "image": "administrative2_synth_15_aug2.png",
        "label": "administrative",
        "ocr_text": "North Sai MANDAL OF ADMINISTRA TP tad University 2 POLICIES AND FAGCERURES Humber: pow SECTION: AREA: Eotablish clear responsibilities, imelines, and documentation standards for policy on facility access contrat acress ail units. This policy applies to full time empioyees, contractual parsonnel, and authorized service provid sin covered offices working wi i. SMLICY SPATEMENT All offices shail follow this policy and maintain audi ie records for three fiscal years. 2. Roles: Department heads ensure digsemination; unit coordinatars monitor adherence and escalate exceptions. 3, Documentation: Requests ar orovals must use the prescribed forms and digital tracking sys! 4, Timetines: Standard processing tim her author: o (8) working days unless hi 5. Moniiorir metrics quarterly end recom The Adininistrative AXeirs Division reviews nEnds revisions. “October 08, 2025"
    },
    {
        "image": "administrative2_synth_15_aug3.png",
        "label": "administrative",
        "ocr_text": "North Sandrastad University MANUAL OF ADMINISTRATIVE. POLICIES AND PROCEDURES SECTION: Administrative Policies Number: apw 3474 28 AR Campus Operations SUBJECT: Policy on Facility Access Control I PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on facility access control across all units. This Policy applies to full time employees, contractual personnel, and authorized service providers working within covered Offices. I. POLICY STATEMENT 1. Compliance: All offices shall maintain auditable records for t 2. Roles: Department heads en coordinators monitor adherenc: 3. Documentation: Requests a prescribed forms and digital tr: 4. Timelines: Standard proces: days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. follow this policy and hree fiscal years. sure dissemination; unit e and escalate exceptions. ind approvals must use the acking system. sing time is five (5) working “October 08, 2025 Page 15 of 20"
    },
    {
        "image": "administrative2_synth_15_aug4.png",
        "label": "administrative",
        "ocr_text": "ity SAND PROC EBT RES North Sandra MANUAL OF APMENISTRA yyy POLICIE Humber: AOMU474 25 facil geross all uri tractual person a covered offices. mel, tow this policy and ae fiscal year auditable rec Gepartme siheads ensure dissemi alate in: Requests anc ital tracking sing time 3s 3. Documental! joed forms and did! tandard pr October 08, 2025"
    },
    {
        "image": "administrative2_synth_15_aug5.png",
        "label": "administrative",
        "ocr_text": "North Sandrastad University MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Administrative Policies Number: apM 3474 28 AREA: Campus Operations SUBYECT: Policy on Facility Access Control I PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on facility access control across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. I, POLICY STATEMENT 1. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. October 08, 2025 Page 15 of20"
    },
    {
        "image": "administrative2_synth_16_aug1.png",
        "label": "administrative",
        "ocr_text": "port College TRATIVE POLES. A. fish clear responsibilities, imelines ard eniauon standards for pol 8Cfoss all units. This policy applies to fy contractual persc lity access con ime employees, BOLIC 1. Compliance: il offices shail foil maimain audi ble recor cal years issemingtion: unit Calale except POVaIS Must use the S and digital backing syster Standard precess Ag Ume ig fi her author ds ense *S Morior adherence and ation: Requests and Brescribed fo: 2 (3) working nl Teviews"
    },
    {
        "image": "administrative2_synth_16_aug2.png",
        "label": "administrative",
        "ocr_text": "port College AND PROCEDURES MANUAL OF AD) Number vy Access Control _ ut WS"
    },
    {
        "image": "administrative2_synth_16_aug3.png",
        "label": "administrative",
        "ocr_text": "rt College OLICIES AND PROCEDURES SECTION: Govamance Manual Rumbar: 5 fREA: Finance and Procurame H PURPOSE AN CORE Estabi documents ear responsibilities, timelines, and n standards for policy on facility access control aoross all uni me emplc contractual onael, and authorized service providers working withirt covered offices, POLICY STATE cy and 1. Compliance: All offices shall follow this pall maintain auditabie records for three fiscal y 2, Roles: Department heads ensure di coordinators monitor adhere: 3. Documentation: Reque: ibed forms ard dig izalion is required Affaire Dh. avis sion reviews"
    },
    {
        "image": "administrative2_synth_16_aug4.png",
        "label": "administrative",
        "ocr_text": "Cunninghamport College MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Governance Manual Number: pm 3606 79 AREA: Finance and Procurement s 84ECT: Policy on Facility Access Control 1 PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on facility access control across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. I. POLICY STATEMENT 1. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. “April 02, 2025 Page 180120"
    },
    {
        "image": "administrative2_synth_16_aug5.png",
        "label": "administrative",
        "ocr_text": "Cu ininghamport Col MANUAL OF ASE AINISTRATIVE pe Number: ADM 2608. slablish clear Faspor cumentation st, Scross ail onsibilities, nelinas, and andards for Policy on faci} ts. This PSHCY apnties to full. contractual Persennel, and auth: 1orized ser working with: vered offices, aSC8ss control 8 employees, CS providers BR poLicy 1. Compliance: All offices Shall follow thig maintain auditable re ards for three fiscal 2. Roles: Department heads ensure coordinators monitor adherence ang 3. Documents fon: Requests and Prescribed forms an a digital 4. Timelines: Standard process, days unless ficher authorization j 5. Monitoring: The Administ, metrics guari ery and rec Oming Ssemination: unit ‘0 escalate excantions, approvals us se the ing syster time is ie (8) working S required, tive Affairs Divisio ends revisions. 1 reviews April 02, 3038"
    },
    {
        "image": "administrative2_synth_17_aug1.png",
        "label": "administrative",
        "ocr_text": "Jamosview institute of Tech MANUAL OF ADRHIMISTRA TIVE POLICIES AND PROCEDURES umber. apna? Po SECTION: Administrati @REM Finance and Procurement SUBJECT rting PURPOSE ANB SC Establish clear responsibilities, timelines, and document Across This policy applies to full fime employees, contractual personnel, and authorized service providers un working with y this policy and ae fiscal years. Roles: Depariment heads ensure dissemination; unit erdinaters monitor adherence and escalate exceptions. S MUS L prescribed iT 4. Timatines: Standard proce: t 5. Monitoring: 7 metrics Quarterly August 13, 2024"
    },
    {
        "image": "administrative2_synth_17_aug2.png",
        "label": "administrative",
        "ocr_text": "Jamesview institute of MANUAL OF ADMINISTRATIVE POLICE SECTION: Administrative Policies Finance and Procurement ——— 1 PURPOSE AND SCOPE Establish clear responsi documentation Standards for potic e** Policy on Incident Reporting J bilities, timelines, and on incident reporting icy applies to full time employees, Nd authorized service providers working within covered Offices. He POLICY STATEMENT 1. Compliance: Ali offices: maintain auditable record: 2. Roles: Department hea coordinators monitor adiy: 3. Documentation: Requ prescribed forms and di 4. Timetines: Standard py days unless higher aut: 5. Monitoring: The Adi metrics quarteriy and reo “August 13, 3034 Shall foliow this policy and is for three fiscal years. ids ensure dissemination; unit erence and escalate exceptions. ests and approvais musi use the igital tracking system rocessing time is five (5) working norization is required. ministrative Affairs Division reviews ommends revisions. Page 17 020"
    },
    {
        "image": "administrative2_synth_17_aug3.png",
        "label": "administrative",
        "ocr_text": "vamesview Institute of Technology MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES Seco: Administrative Poticies Murer: apnt 9422 03 Finance and Procurement ™ wet Policy on Incident nt Reporting t PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on incident reporting across ail units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. ff, POLICY STATEMENT 1. Comptiance: Al! offices shall follow this policy and maintain auditabie records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Docurnentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days uniess higher authorization is required. 5. Monitoring. The Administrative Affairs Division reviews metrics quarterly and recommends revisions. “August 13 2024 ~~ coeur"
    },
    {
        "image": "administrative2_synth_17_aug4.png",
        "label": "administrative",
        "ocr_text": "Jamesview Institute of Tec! MANUAL OF ADMINISTRA TIV F POLICIES AND PROCEDURES SECTION: Administrative Policies Number: Apw s422 03 AREA: inance and Procurement suevecr: Policy on Incident Reporting L PURPOSE AND scopE Establish clear responsibilities, timelines, and documentation stan dards for Policy on incident reporting across all units. This Policy applies to full time employees, nel, and authorized service Providers working within covered offices. ffices shall follow this Policy and records for three fiscal years. ent heads ensure dissemination; unit Coordinators monitor adherence and 3. Documentation: Requests and approvals must use the ind digital tracking system. August 13, 2024 Page 17 of 20"
    },
    {
        "image": "administrative2_synth_17_aug5.png",
        "label": "administrative",
        "ocr_text": "Jamesview Institute of Technology POLICIES AND PROCEDURES MANUAL OF ADMINISTRATIVE SECTION: Administrative Policies Number: —ADM 9422 03 (te Finance and Procurement susie\": Policy on Incident Reporting 1 PURPOSE AND SCOPE lities, timelines, and olicy on incident reporting lies to full time employees, rvice providers Establish clear responsibil documentation standards for p across all units. This policy app! contractual personnel, and authorized set working within covered offices. I, POLICY STATEMENT es shall follow this policy and rds for three fiscal years. e dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. 4. Compliance: All offic maintain auditable reco! 2. Roles: Department heads ensur' August 13, 2024 Page 17 020"
    },
    {
        "image": "administrative2_synth_18_aug1.png",
        "label": "administrative",
        "ocr_text": "Freernan! aye ADSESES POL tabs ariel pp pHOC TBE RES Miata Humber: ADN3S! n Incident Re porti ag SECTION. OD AREA Campus op ations ar respot andards ior poli cy on 5 to full time di serving D' ovidle wnanon, u heads ensure and esc alae herence st us £5) work fion is required ye Ailairs Divi 4 7 days unie 5, Monitoring: mevics quarieny 1 reviews:"
    },
    {
        "image": "administrative2_synth_18_aug2.png",
        "label": "administrative",
        "ocr_text": "Freemanburgh Institute of Technology L OF ADMINISTRATIVE POLICIES AND PROCEDURES MANUAI SECTION: Operational Guidelines Number: ADM 3900 55 AREA: Campus Operations suc’ Policy on Incident Reporting i PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on incident reporting across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. I. POLICY STATEMENT ffices shall follow this policy and cords for three fiscal years. heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. 4. Compliance: All o' maintain auditable re! 2. Roles: Department (5) working Page 18 of 20 “April 16, 2025"
    },
    {
        "image": "administrative2_synth_18_aug3.png",
        "label": "administrative",
        "ocr_text": "sardouagit Institute of Technology 1 ADMINISTRATIVE MOLICHES AND PROCEDURES MANUAL umber: abo Operational Gish 7 Campus Gperations Establish documentation standards for p across all units. This policy appl contractual personnel, and su! orized working within covered offices. H. POLICY STATE offices shell foltow this policy and maintain auditable records fer three fiscal years. 2. Roles: Department ds ensure dissemination, unit coordinators monitor adherence and fate exceptions. 3, Documentation: Requests and approvals must use ihe prescribed forms and digital racking system. 4. Timelines: Standard processing ime A days unless higher auihorization is required. 5, Monitoring: The Administrative Affairs Di metres quarterly and recommends revisiahs- 4, Compiiance: Ab 6 (5) working sion reviews “April 16, 2025"
    },
    {
        "image": "administrative2_synth_18_aug4.png",
        "label": "administrative",
        "ocr_text": "‘ burgh institute of Technotogy MANUAL OF ADMINISTRATIVE POLICE: AND PROOE! RES umber: 400 29 SECTION: COperalional Guide BL Campus Operations S85 Doficy on incident Reporting i PURPOSE AND St 5, and end reporting andard contractual personnel, and eulhorized service pre working within covered offices. i, POLICY STATEMENT 4. Compliance: All offices shall follow this policy and maintain auditable recards for three fiscal years. Department heads ensure dissemination, unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and appro raust use the prescribed forms and digital tracking system. 4, Timelines: Standard processing time is five (&} working mis required."
    },
    {
        "image": "administrative2_synth_18_aug5.png",
        "label": "administrative",
        "ocr_text": "Freemanburgh Institute of Technology MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Operational Guidelines Number: apM 3900 55 REA: ~~ Campus Operations SUBJECT: Policy on Incident Reporting I PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on incident reporting across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. I, POLICY STATEMENT 1. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. April 16, 2025 Page 180f20"
    },
    {
        "image": "administrative2_synth_19_aug1.png",
        "label": "administrative",
        "ocr_text": "Christopherborough Institute of Technology MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Operational Guidelines Number: apM 3661 95 a Human Resources SUE: Bolicy on Records Management I PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on records management across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. I, POLICY STATEMENT 1. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. October 13, 2024 Page 19 of20"
    },
    {
        "image": "administrative2_synth_19_aug2.png",
        "label": "administrative",
        "ocr_text": "Chis institute of Technology MANUAL OF ADMINISTRATIVE POLICIES [AND PROCEDURES SECTION: Operational Guidelines Number: ADM 3661 95 AREA: Human Resources susie: Policy on Records Management PURPOSE AND SCOPE s, timelines, and policy on records management lies to full time employees, ‘orized service providers ar responsibilities n standards for This policy aPP! ‘onnel, and auth ered offices. Establish cle documentatio! across all units. contractual pers' working within cov ,— POLICY ‘STATEMENT shall follow this policy and ditable records for three fiscal years. issemination, unit nd escalate exceptions. 3 nd approvals must use the rms and digital tracking system. 4. Timelines: Sta ing time is five (5) working days unless higher al 5. Monitoring: The Administra’ metrics quarterly and recomm Page 19 0f 20 “October 13, 2024 uthorization is required. ive Affairs Division reviews ends revisions."
    },
    {
        "image": "administrative2_synth_19_aug3.png",
        "label": "administrative",
        "ocr_text": "MANUAL OF ADA RES SENTION: AREAS Mumber apse 3651 98 1 on Records Managemen * Policy LPL Establish clear responsibilil f documentation standard: or ords management acress all u This poile plies io full time employees, contractual personnel, and authorized service providers: working within covered a ard 0 PGLICY STATEMENT +, Compliance: All offices shail follow this policy and raintain auditable records for three fiscai years. 2. Roles: Department heads ensure dissemination; unit coordinators moniter adherence and escalate exceptions. vais must use the metrics quarterly and recommends revisions. “Ovtober 13, 202"
    },
    {
        "image": "administrative2_synth_19_aug4.png",
        "label": "administrative",
        "ocr_text": "Christopherborough Institute of Technology MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Operational Guidelines Number: ADM 3661 95 AREA: ~~ Human Resources SUBYECT: Bolicy on Records Management 1 PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on records management across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. I, POLICY STATEMENT 4. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. “October 13, 2024 Pave 190120"
    },
    {
        "image": "administrative2_synth_19_aug5.png",
        "label": "administrative",
        "ocr_text": "Christopherborough Institute of Technology MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Operational Guidelines Number: apiv 3661 95 Ns Human Resources sux: Policy on Records Management I PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on records management across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. I, POLICY STATEMENT 1. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. October 13, 2024 Page 19 of20"
    },
    {
        "image": "administrative2_synth_20_aug1.png",
        "label": "administrative",
        "ocr_text": "Jessicachester College MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Operational Guidelines AREA Number: apw so6 s7 General Administration “ee Bolicy on Records Management PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for Policy on records management across all units. This Policy applies to full time employees, contractual Personnel, and authorized service providers working within covered Offices. HW POLICY STATEMENT 1. Compliance: All Offices sh maintain auditable records 2. Roles: Department head: all follow this Policy and for three fiscal years Prescribed forms and digit 4. Timelines Standard pri days unless higher author 5. Monitoring: The Admin metrics quarterly and rec: cessing time is five (5) working rization is required. istrative Affairs Division reviews ‘ommends revisions. “May 31, 2024 Page 20 of 20"
    },
    {
        "image": "administrative2_synth_20_aug2.png",
        "label": "administrative",
        "ocr_text": "6 icachester College S POLICIES AND PROCKOURES SECTION: Operaiionai AREA! General A iear responsib’ documenta ftendards across all units. This pol contractual personnel, and autho! working within covered offices rds management ne employees, providers TEMENT Ho POLICYS anal follow this policy and 4, Compliance: Al CLUES e fiscal years oe inators mm cmt adher 3. Documentation: ne and appro\" vais must use e the prescribed forms rack system. 4. Timelines: Standard prise time is five (5) working days unless higher aut Elise B TORIES, 5, Monitor May 31, 2024"
    },
    {
        "image": "administrative2_synth_20_aug3.png",
        "label": "administrative",
        "ocr_text": "Jessicachester College MANUAL OF ADMIN! ISTRATIVE POLICIES: AND PROCEDURES: seen Operational Guidelines Number: ADM 8068 87 General Administration svB ECT: Bolicy on Records Management 1 PURPOSE AND SCOPE sibilities, timelines, and ‘ds for policy on records management lies to full time employees, ized service providers Establish clear respon: documentation standar across all units. This policy app! contractual personnel, and authori: working within covered offices. 1. POLICY STATEMENT 4. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. Page 20 of 20 “May 31, 2024"
    },
    {
        "image": "administrative2_synth_20_aug4.png",
        "label": "administrative",
        "ocr_text": "Jessicachester College MANUAL OF ADMINISTRATIVE POLICIES AND PROCEDURES SECTION: Operational Guidelines Number: apm seer uid ‘ADM 8068 87 General Administration ‘SUBJ! 4 *°T Bolicy on Records Management 1 PURPOSE AND SCOPE Establish clear responsibilities, timelines, and documentation standards for policy on records management across all units. This policy applies to full time employees, contractual personnel, and authorized service providers working within covered offices. I, POLICY STATEMENT 4. Compliance: All offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure dissemination; unit coordinators monitor adherence and escalate exceptions. 3. Documentation: Requests and approvals must use the prescribed forms and digital tracking system. 4. Timelines: Standard processing time is five (5) working days unless higher authorization is required. 5. Monitoring: The Administrative Affairs Division reviews metrics quarterly and recommends revisions. Page 20 of 20 “May 31, 2024"
    },
    {
        "image": "administrative2_synth_20_aug5.png",
        "label": "administrative",
        "ocr_text": "Jessicachester Col MANUAL OF ADMEMSTRATIVE POLICIES AND PROCEDURES Noriber: apysise8? #®FT Doticy on Records Management PURPOSE ANG SCOPE stabtish clear responsibilities, timelines, and documentation standards for policy on records management across al un y applies to full ti fractual per inevized sarvice providers working within covered offices POLICY STA 4. Compliance: Al offices shall follow this policy and maintain auditable records for three fiscal years. 2. Roles: Department heads ensure disserination, unit eoordinainrs monitor adherence and escalate excaptions. 3, Documentation: Requests and approvals must use the tal tracking system, ing time is five (5) workine higher authorization is required Monitoring: The Administrative Affairs Division reviews met y and recom de revisi"
    },
    {
        "image": "administrative_synth_10_aug1.png",
        "label": "administrative",
        "ocr_text": "Pravedure 4. initiating employee completes required forms and attaches supporting documents. 2. immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Facilities Management reviews submission for completeness and recerds the request in the tracking log. 4. App ng authority evaluates. issues decision, and notes conditions if applicable. 5, Office notifies initiator of the decision and archives documents in the central repository."
    },
    {
        "image": "administrative_synth_10_aug2.png",
        "label": "administrative",
        "ocr_text": "| ADMINISTRATIVE PROCEDURE MANUAL [EcHON TLE ——— 2 NuMBER] PAGE Facilities Management Procedure Performance Evaluation ADW SSI1 page a3 [BASED ON BOARD OF TRUSTEES’ RULE AND TITLE [_ DATE REVISE: Based on Board Resolution No. 906 2019 __Dec 30, 2022) Purpose Provide a standardized process for performance evaluation within the facilities management, ensuring compliance with institutional policies, timely approval, and accurate documentation Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Facilities Management reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository."
    },
    {
        "image": "administrative_synth_10_aug3.png",
        "label": "administrative",
        "ocr_text": "4, initiating employee completes required forms and aitaches gupporling documents. 2. immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 2 Faciities Manage for completeness ang records the tracking log. 4, Approving authority evaluates, issues decision, and notes conditions if applicable. 5 Office notifies initiator of the decision and archives doc iments in the central repost! ment reviews subrnission the request in"
    },
    {
        "image": "administrative_synth_10_aug4.png",
        "label": "administrative",
        "ocr_text": "I ADMINISTRATIVE PROCEDURE MANUAL [SECTION TITLE [LNOmmen 7 Pace Faciities Management Procedure Performance Evaluation romsots Trae [BASED ON BOARD OF TRUSTEES RULE AND TITLE [DATE REVISED: Based on Board Resolution No. 906 2019 Dec 30, 2022 Purpose Provide a standardized process for performance evaluation within the faciities management, ensuring compliance with institutonal policies, timely approval, and accurate documentation Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Facilities Management reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository."
    },
    {
        "image": "administrative_synth_10_aug5.png",
        "label": "administrative",
        "ocr_text": "Parpne 4. initialing employee competes required forms ang attaches supporting documents. 9. immediate supervisor yerfies accuracy, signs ancorsement, and forwards fe the office in charge- 3. Facilities Mar for completeness the tracking log. 4, Approving autnorty evaluates, ISSUES decision, and notes conditions if applicable 5, Office notifies initiator of the decision and archives documents in the central repository. reviews supmissian and records the request mh agement"
    },
    {
        "image": "administrative_synth_1_aug1.png",
        "label": "administrative",
        "ocr_text": "Procedure 7. Initiating employee completes required forms and atlaches supporting documents, 2. immediate supervisor verifies accurac signs endorsement, and forwarde to the in charge. office i 3. Facilities Management reviews submission for completeness and records the request in the tracking tog. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repasitory."
    },
    {
        "image": "administrative_synth_1_aug2.png",
        "label": "administrative",
        "ocr_text": "TRATIVE PROG EDURE Mai ~~ PROCEDURE MAD ® Pace Facilities Manag) ment Procedure Budget Requisition [somos es [BASED ONnoA D OF TRUSTEES RULE AND TTL —___]| —atemevises iB ased on Board Resolution No. 3 bene Resolution No. 397 21 Purpose Provide a standardized process for budget requisition within Compliance with institutional policies, timely Procedure —|onrnevsn— 97 2023 Sep 14, 2034 the facilities ma inagement, ensuring aPProval, and accurate documentaton Twards to the Office in charge. 3. Facilities Mana for completeness the tracking log. 4. Approving autho. and records gement reviews submission the request in rity evaluates, issues"
    },
    {
        "image": "administrative_synth_1_aug3.png",
        "label": "administrative",
        "ocr_text": "ADMINISTRATS) PRO ve Parpase 1. Initia and at 2 fing employee Completes require: laches Supporting cecuments. immediate Supervisor verifies accuracy, Signs endorse: Went, and forwards to the Offic n charge. 3. Facilities Management a forms FSViEWS submi ion for completeness and recoras the request in the facking tog, 4. Approving authority evaluates, is decision, and Notes condi 5. Office Notifies inj archives docy tions if applicable, lator of the decision ang Ments in the central repository,"
    },
    {
        "image": "administrative_synth_1_aug4.png",
        "label": "administrative",
        "ocr_text": "leies required forms 4. initiating employee comp and atlaches supporting documents. 2. tramediate supervisor verifies acouracy. signs endorsement. and forwards to the office in charge. 4. Facilities Manag for completeness and the tracking log 4. Approving 8U decision, and notes co 5, Office notifies initiator oF archives documents in the reviews submissicn ement request in records the thority evaluates, issues aditions 1 applicabie. the decision and central repository."
    },
    {
        "image": "administrative_synth_1_aug5.png",
        "label": "administrative",
        "ocr_text": "ADMENISTRATIVE PROCEDURE MANUAL SECTION TiTE NORER 4. Initiating employee completes required forms and attaches supporting documents. 2. immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Facilities Management reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, decision, and notes conditions a 5. Office notifies initiator of the decision and archives documents in the central repository."
    },
    {
        "image": "administrative_synth_2_aug1.png",
        "label": "administrative",
        "ocr_text": "a Based on Board Re: Paepeve Prucsduse 1. Initiating employee completes required forms and attaches Supporting documents. 2. Immediate Supervisor verifies accuracy, signs endorsement, and forwards to the 3. Procurement Office revi compicteness and rec tracking log. 4. Approving authority eva decision, and notes conditions if applicable. 5. Office notifies initiator of the decis f ator sion and archives documents in the central repository, ews submission for ords the request in the luates, issuas"
    },
    {
        "image": "administrative_synth_2_aug2.png",
        "label": "administrative",
        "ocr_text": "ADMINISTRATIVE PROCEDURE MANUAL —__ NUMBER PAGE Procurement Office Procedure Leave Application 0510 ray ras BASED ON BOARD OF TRUSTEES RULE AND TITLE [oar RevisED Based on Board Resolution No. 652 2021 May 27, 2025 [SECTION TITLE Purpose Provide a standardized process for leave aj pplication within the procurement office, ensuring compliance with institutional policies, timel ly approval, and accurate documentation. Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Procurement Office reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository."
    },
    {
        "image": "administrative_synth_2_aug3.png",
        "label": "administrative",
        "ocr_text": "Porpme Prov Procedure yee compieies required forms and attaches supporting decumenis. 2. immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Procurement Office reviews submission for cornpieteness and records the request in the tracking log. 4. Approving authority evalu decision, and notes conditions if applicable. 5, Office notifies initiator of the decision and archives documents In the central repository. 4. initiating emplo gates, issues"
    },
    {
        "image": "administrative_synth_2_aug4.png",
        "label": "administrative",
        "ocr_text": "ADMINISTRATIVE PROCEDURE MANUAL SECTION TITLE [NUMBER PAGE Procurement Office Procedure Leave Application ADW4510 exe srs BASED ON BOARD OF TRUSTEES’ RULE AND TITLE [DATE REVISED Based on Board Resolution No. 652 2021 May 27, 2025 Purpose Provide a standardized process for leave application within the procurement office, ensuring compliance with institutional policies, timely approval, and accurate documentation Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Procurement Office reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository."
    },
    {
        "image": "administrative_synth_2_aug5.png",
        "label": "administrative",
        "ocr_text": "PROCEDURE MANUA! —Txummem PAGE —T__— “ADMINISTRATIV! L (SECTION TITLE Procurement Office Procedure eave Application “sre ries exci ON BOARD OF TRUSTEES RULE AND Tie —— [Dar REVISED Based on Board Resolution No. 52 2021 _ May 27, 2025 Purpose Provide a standardized proc ‘complance with institutional Procedure 4. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Procurement Office reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. the decision and 5. Office notifies initiator of archives documents in the central repository."
    },
    {
        "image": "administrative_synth_3_aug1.png",
        "label": "administrative",
        "ocr_text": "ADSEMISTRATIVE PROCEDURE MANUAL Purpase {. Initiating employee compistes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. leieness and records the request i ng log. 3, Issues s F applicable. r of the decision and"
    },
    {
        "image": "administrative_synth_3_aug2.png",
        "label": "administrative",
        "ocr_text": "ADMINISTRATIVE PROCEDURE MANUAL Purpose s required forms employee cor supporting docun 2. lmmeciate supervisor vervies accuracy, signs endorsement, and forwards to the completeness ion for vest in the 4. decisic 5. Off archin Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure."
    },
    {
        "image": "administrative_synth_3_aug3.png",
        "label": "administrative",
        "ocr_text": "Purpose Procedure 1. Initlating employee compietes required forms and attaches supporting documents. 2. Invnediate supervisor verifies accuracy, signs endorsement, and forwards to the f n charge. 3. Student Affairs reviews suomission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions applicable. 5. Office notifies initiator of the decision and archives documents in the central repository. 6. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure."
    },
    {
        "image": "administrative_synth_3_aug4.png",
        "label": "administrative",
        "ocr_text": "Procedure 1. initiating employee completes reduired forms and atlaches supporting documents. 2. immediate supervisor veri signs endorsement, and forwards to the office in charge. 3. Student Aff. comple 4, Approving authority evaluates, issues nitlator of the decision and archives documents in the central repository. 6. Continuous improve ni lead reviews quarterly metrics and recommends updates to this pracedure. flas ;"
    },
    {
        "image": "administrative_synth_3_aug5.png",
        "label": "administrative",
        "ocr_text": "Purpese Procedure 4. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3 Student Affairs reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository. 8. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure."
    },
    {
        "image": "administrative_synth_4_aug1.png",
        "label": "administrative",
        "ocr_text": "loyes completes required forms documents. yarifies accuracy, forwards to the 4. jnitiating emp: and attaches supporting 3. Immediate supervisor signs endorsement, and office in charge. 3. Human Resources review completeness and records tracking led. s submission for ,e request in ihe 4. Approving authority evaluates, issues decision, and notes conditions f applicable. the decision and 5, Office notifies initiator 3 archives documents in the central repository."
    },
    {
        "image": "administrative_synth_4_aug2.png",
        "label": "administrative",
        "ocr_text": "AUMINISTRATIVE PROCEDURE M ANUAL SECTION TEE. - oe H Human Resources Procedure te; BASED ON BOARD GF TATRT EES Based on Board Resclut ave Applicat RoW No. 748 2028 Reo\" 2024 Purpose Provide a siarcardzed process f COmMphARCE wrth msttutonal p Prcegare 1. initiating em ployee completes required forms and attaches 5 Upporting documents. 2. immediate supervisor verifies accuracy, signs endorsement, and forwards to the Office in charge. 3. Human Resources revi completeness and record tracking log. 4 Approving authority evaluates, issues decision, and notes Conditions if applicable. Office notifies initiator of the decision and archives documents in the central repository. @ws submission for S the request in the"
    },
    {
        "image": "administrative_synth_4_aug3.png",
        "label": "administrative",
        "ocr_text": "OCEDURE MANUAL ApMEMSERSTIVE FR 2. team river signs end semen, and forwards to ine office in charge 3. Human Res! urces revi yission for compietenes and records the request in the 4, Approving authority evalua chives documents it cision, and ne"
    },
    {
        "image": "administrative_synth_4_aug4.png",
        "label": "administrative",
        "ocr_text": "Purpose Frovide a standardized Process for feawe appication witin the num, Compliance with instiiienal Policies, ti ‘On Fescurces, ensuring PRCA and accurate documentater Procedure Twards to the Office in charge. 3. Human Resources reviews submission for compieteness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes Conditions if applicabie, 5. Office Notifies initiator Of the decision and archives documents in the central repository."
    },
    {
        "image": "administrative_synth_4_aug5.png",
        "label": "administrative",
        "ocr_text": "ADMINISTRATIV E PROCEDU RE MANU AL SECTION Titte Human Resources p; BASED ON BOARD OF TRUS Based on Board Ri [Sesimeny ‘ave Application Aomers: TEES’ RULE AND THTLE [oar REVISED ‘eSolution No. 748 2025 |__ Jun 02, 2024 PAGE Paw ter and forwards to the Office in charge. Human Resources Completeness and tracking log. 4. Approving authorit decision, and 5. Office notifi archives docy reviews Submission for records the request in the Y evaluates, issues notes conditions if applicable. es initiator of the decision and Ments in the central repository."
    },
    {
        "image": "administrative_synth_5_aug1.png",
        "label": "administrative",
        "ocr_text": "Purpose iz Proveduce 4 1. initiating amplo completes required forms and atlaches supporting docurnenis. 2, immediate supervisor verifies accuracy, signs endorsement, and forwards to the 3. Finance Services reviews completeness and records the tracking log. 4. Approving autho decision, and notes conditi 5. Office notifies initiat archives document ission for equest in the uates, issues ons if applicable. the decision and"
    },
    {
        "image": "administrative_synth_5_aug2.png",
        "label": "administrative",
        "ocr_text": "| ADMINISTRATIVE PROCEDURE MANUAL _] [SECTION Trt Nomen race Incident Reporting 401 2971 peas ND THLE —| one Revisep Based on Board Resolution No. 51 2021 Sep 20, 2023 Finance Services Procedure [BASED ON BOARD OF TRUST EES’ RULE A’ Purpose Provide a standardized process for inci ident reporting within the finance services, ensuring Compliance with institutional policies, ti imely approval, and accurate documentation Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate Supervisor verifies accuracy, Signs endorsement, and forwards to the office in charge. 3. Finance Services reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository."
    },
    {
        "image": "administrative_synth_5_aug3.png",
        "label": "administrative",
        "ocr_text": "Procedure 1. Initlating employee completes required forms and attaches supporting documents. 2. immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Finance Services reviews subrnission for completeness and records the request in the tracking log. 4, Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository."
    },
    {
        "image": "administrative_synth_5_aug4.png",
        "label": "administrative",
        "ocr_text": "ADMINISTRATIVE PROCEDURE MEAN7 OHO TEE Procedure incident Repe ting BASED ON BOARD OF TRISTEDS BLED AND THT Based on Board Resolution No. 5412 2021 Porpore Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. immediate supervisor verifies accuracy, SI9NS endorsement, and forwards to the office in charge. 3. Finance Services reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates. issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository."
    },
    {
        "image": "administrative_synth_5_aug5.png",
        "label": "administrative",
        "ocr_text": "[ ADMINISTRATIVE PROCEDURE MANUAL [SECTION TITLE LNoBER Pace Finance Services Procedure Incident Reporting ADM B971 Page 10f2 [BASED ON BOARD OF TRUSTEES’ RULE AND TITLE. |__DATE REVISED Based on Board Resolution No. 512 2021___| _ Sep 20, 2023 Purpose Provide a standardized process for incident reporting within the finance services, ensuring ‘compliance with institutional policies, timely approval, and accurate documentation. Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Finance Services reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository."
    },
    {
        "image": "administrative_synth_6_aug1.png",
        "label": "administrative",
        "ocr_text": "PROCEDURE MANUS 1. iniflating empicyee compietes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Student Affairs reviews submission for completeness and records the request in the tracking log 4. Approving authority evaluates, issues decision, and notes conditions if applicable. &. Office notifies initiator of the decision and archives docurnents in the central repository. 5, Continuous improvement lead reviews quarterly metrics and recommends updaies to this procedure."
    },
    {
        "image": "administrative_synth_6_aug2.png",
        "label": "administrative",
        "ocr_text": ">= SECTION TitLe ADMINISTRATIVE PROCEDURE MANUAL Student Affairs [NUMBER Trace Procedure Budget Requisition -oustes Pama | Based on Boa BASED ON BOARD OF TRE STEES RULE AND TITLE ONTEREViseD rd Resolution No. 552 2019 Jan 02, 2025) Purpose Provide a standardized process for budget compliance with institutional polic Procedure 1. Initiating empl and attaches s Signs endorsem Office in charge. 3. Student Affairs reviews completeness and records tracking log. 4. Approving auth decision, and not equisiton within the student affairs, ensuring “es, timely approval, and accurate documentation oyee completes required forms Upporting documents. 2. Immediate supervisor verifi ls accuracy, ent, and forwards to the submission for the request in the jority evaluates, issues €S conditions if applicable."
    },
    {
        "image": "administrative_synth_6_aug3.png",
        "label": "administrative",
        "ocr_text": "ADMINISTRATIVE PROCEDURE MANUAL SECTION TITLE NUMBER [PAGE Student Affairs Procedure Budget Requisition Au 5805 page ver BASED ON BOARD OF TRUSTEES RULE AND TITLE DATE REVISED Based on Board Resolution No. 552 2019 Jan 02, 2025 Purpose Provide a standardized process for budget requisition within the student affairs, ensuring ‘complance with institubonal policies, timely approval, and accurate documentation Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Student Affairs reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository. 6. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure."
    },
    {
        "image": "administrative_synth_6_aug4.png",
        "label": "administrative",
        "ocr_text": "Purpose Provedore 4. in ilating employee completes required forms and atlaches supporting da 2. immediate supervisor ve SCUTACY signs endorsement, and forwards to the office in charge. 3. Student Affairs reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions Vf applicable. 5. Gffice notifies initiator of the decision and archives documenis in the central sitory 6. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure."
    },
    {
        "image": "administrative_synth_6_aug5.png",
        "label": "administrative",
        "ocr_text": "lL _ADMINISTRATIV! [SECTION Tine Student Affairs Procedure | BASED ON BOARD OF TRUSTEES RUT E PROCEDURE MANUAL ~LNOwnee J Pace Budget Requisition sousaos AND TITLE DATE REVISED Based on Board Resolution No. 552 2019 Jan 02, 2025 Page tet Provide a standardized process for budget requisition within the student affairs, ensuring compliance with institutional policies, timely approval, and. accurate documentation. Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the Office in charge. 3. Student Affairs revie completeness and rec. tracking log. 4. Approving authority evaluates, issues decision, and notes Conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository. 6. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure. Ws submission for ords the request in the"
    },
    {
        "image": "administrative_synth_7_aug1.png",
        "label": "administrative",
        "ocr_text": "[ ADMINISTRATIVE PROCEDURE MANUAL [SECTION TITLE [LSUMBER J PAGE Facilities Management Procedure Incident Reporting ADM 7537 Page 1f2 [BASED ON BOARD OF TRUSTEES RULE AND TITLE paTe REVISED Based on Board Resolution No. 254 2019 _ __ Aug 22, 2025 Purpose Provide a standardized process for incident reporting within the facilities management, ensuring compliance with institutional policies, timely approval, and accurate documentation. Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Facilities Management reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository. 6. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure."
    },
    {
        "image": "administrative_synth_7_aug2.png",
        "label": "administrative",
        "ocr_text": "ADMINISTRATIVE PROCEDURE MANUAL SECTION TITLE [NUMBER PAGE Facilities Management Procedure Incident Reporting ADWTS97 page 1of2 BASED ON BOARD OF TRUSTEES RULE AND TITLE [DATE REVISED Based on Board Resolution No. 254 2019 Aug 22, 2025 Purpose Provide a standardized process for incident reporting within the facilities management, ensuring compliance with institutional policies, timely approval, and accurate documentation. Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Facilities Management reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository. 6. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure."
    },
    {
        "image": "administrative_synth_7_aug3.png",
        "label": "administrative",
        "ocr_text": "Porpace Prscedure 1. Inillating 2 and attaches oD 2. immediate Supervisor Verifies accuracy, Signs endorsement and forwards to the Office in Charge, 3. Facilitias Management reviews submission for completeness and records the request in the tracking log. 4, Approving authority ®Valuates, iSSues decision, and Notes conditions if applicable. 5. Office nog 188 initiator Of the decision ang archives dor iMents in the central repository, 6 Continuous improvement Mployse compl Supporting docu estes required forms ead reviews Guarterly metrics and recommends UBdales to this Procedure,"
    },
    {
        "image": "administrative_synth_7_aug4.png",
        "label": "administrative",
        "ocr_text": "ADMINISTRATIVE PROCEDURE MANUAL SECTION TITLE NUMBER PAGE Facilities Management Procedure Incident Reporting ADM 7537 BASED ON BOARD OF TRUSTEES: RULE AND THLE Based on Board Resolution No. 254 2019 DATE REVISED Aug 22, 2025 Purpose Provide a standardized Process for incident rey compliance with instituti Porting within the facilities management, ensuring ional policies, timely aj pproval, and accurate documentation Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the Office in charge. 3. Facilities Management reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, decision, and notes conditions if applicable. 5. Office notifies initiator of the d f lecision and archives documents in the central repository. 6. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure. issues"
    },
    {
        "image": "administrative_synth_7_aug5.png",
        "label": "administrative",
        "ocr_text": "Purpsse p 1. Iniiating and attaci 2. Immediate super rifles accuracy, i dorsement, and forwaras fo the 3. Fachit for campieteness and records the request in the tracking log 4. Approving authority evaluates, issues decision, and netes conditions f applicable. 5. Office notifies initiator of the decision and archis ocuments in the central r itory. 6, Continuous improvement lead reviews quarterly metrics and recornmends updat this procedure,"
    },
    {
        "image": "administrative_synth_8_aug1.png",
        "label": "administrative",
        "ocr_text": "Al aimee FS Procedace 1. Initiating ernployee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards fo the office in charge. 3. Procurement Office reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository. 6, Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure."
    },
    {
        "image": "administrative_synth_8_aug2.png",
        "label": "administrative",
        "ocr_text": "ns ADMINISTRATIVE PROCEDURE MA [NuMBER SECTION TITTE Procurement Office Procedure Budget Requisition 0 5200 ragerers DATE REVISED Jul 30, 2023 _ BASED ON BOARD OF TRUSTEES’ RULE AND TITLE Based on Board Resolution No. 749 2019 L Purpose Provide a standardized process for budget requisition within the procurement office, ensuring compliance with institutional policies, timely approval, and accurate documentation. Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Procurement Office reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository. 6. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure."
    },
    {
        "image": "administrative_synth_8_aug3.png",
        "label": "administrative",
        "ocr_text": "a ADMINISTRATIVE PROCEDURE MANUAL 7] [Secon Tine — —— Lunn Pace Procurement Office Procedure Budget Requisition ‘ADM 5200 BASED ON BOARD OF TRUSTEES’ RULE AND TITLE |__ DATE REVISED Based on Board Resolution No. 749 2019 Jul 30, 2023 Purpose Provide a standardized process for budget requisition within the procurement office, ensuring compliance with institutional policies, timely approval, and accurate documentation, Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Procurement Office reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository. 6. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure."
    },
    {
        "image": "administrative_synth_8_aug4.png",
        "label": "administrative",
        "ocr_text": ")CEDURE MANUAL. ADMINISTRATIVE PRC SECTION TITLE NUMBER PAGE Procurement Office Procedure Budget Requisition AOMS200 Page ASD ONBOARD OF TRUSTEES RULE AND TITLE DATE REVISED Jul 30, 2023 Based on Board Resolution No. 749 2019 Purpose son within the procurement office, ensunng provide a standardized process for budget requis al, and accurate documentation. compliance with institutional POnCIes. tumely approv: Procedure 4. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3, Procurement completeness an tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository. 6. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure. Office reviews submission for d records the request in the"
    },
    {
        "image": "administrative_synth_8_aug5.png",
        "label": "administrative",
        "ocr_text": "is) Purp 1. Initiating employee co anc attaches 2. Immediate GOS @ndor. ement, 28 in charge, 3. Procy ement Office FSVieWS submit GNO records the Mpletes raquired forms SUPPOring documents. SUDErVisor yerifi IC and forwards to tne Mm for request in the 4. Approvi 1g authority evaluates, decision. and totes cory 5. Office notifies ir archives, documen 6. Continuous improvernent ad reviews quarteriy metrics ang recommends updalas to this procedure. issues ditions if apolicable. itor Of the q Isice and sin the central repasitory,"
    },
    {
        "image": "administrative_synth_9_aug1.png",
        "label": "administrative",
        "ocr_text": "ADMINISTRATIVE PROCEDURE MANUAL [SECTION TITLE [NUMBER J PAGE Student Affairs Procedure Performance Evaluation sour Page tot BASED ON BOARD OF TRUSTEES’ RULE AND TITLE [DATE REVISED. Based on Board Resolution No. 416 2025 __ Dec 07, 2023 Purpose Provide a standardized process for performance evaluation within the student affairs, ensuring compliance with institutional policies, timely approval, and accurate documentation. Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Student Affairs reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository. 6. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure."
    },
    {
        "image": "administrative_synth_9_aug2.png",
        "label": "administrative",
        "ocr_text": "4, initiating employee completes required forms and attaches supporting documents. 2. immediate supervisor verifies accuracy. signs andorsement, and forwards to the office in charge. 3, Student Affairs reviews submission tor completeness and records the request in the tracking fog. 4. Approving authority eva decision, and notes conditions i applicable. Office notifies inibator of the decision and archives documents in the central repository. §, Continuous improvement lead reviews quarterly metrics and recommends updates to thig procedure. luates, issues"
    },
    {
        "image": "administrative_synth_9_aug3.png",
        "label": "administrative",
        "ocr_text": "ADSHNISTRATIVE PROCEDURE SIAN 1. Initiating employee completes required forms and attaches suppo iocuments, 2. immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Student Affairs reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, is decision, ar 5. Office no tor of tr i archives documents in the central reposifon, 6. Continuous improvement lead reviews Fe] ly metrics and recommends updates to this proc"
    },
    {
        "image": "administrative_synth_9_aug4.png",
        "label": "administrative",
        "ocr_text": "ADMINISTRATIVE PROCEDURE MANUAL _ ___L Nomen Trace Student Affairs Procedure Performance Evaluation aoveress [raters [BASED ON BOARD OF TRUSTEES’ RULE AND THTLE [Secnion TintE DATE REVISED Based on Board Resolution No. 416 2025 Dec 07, 2023 Purpose Provide a standardized process for Performance evaluation within the student affairs, ensuring compliance with institutional policie: S, timely approval, and accurate documentation. Procedure 1. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge. 3. Student Affairs reviews submission for completeness and records the request in the tracking log. 4. Approving authority evaluates, issues decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository. 6. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure."
    },
    {
        "image": "administrative_synth_9_aug5.png",
        "label": "administrative",
        "ocr_text": "“ADMINISTRATIVE PROCEDURE MANUAL [seeTioN THTLE TP NUMBER [PAGE Student Affairs Procedure Performance Evaluation ADM 7663 Page tof [BASED ON BOARD OF TRU TEES RULE AND TITLE [DATE REVISED _ Based on Boar fo. 16 2025 __ __Dee 07, 2023 d Resolution N Purpose performance evaluation within the student affairs, ensuring nd accurate documentation. provide a standardized process for timely approval, af compliance with institutional policies, Procedure 4. Initiating employee completes required forms and attaches supporting documents. 2. Immediate supervisor verifies accuracy, signs endorsement, and forwards to the office in charge- 3, Student Affairs reviews submission for completeness and records the request In the tracking log. thority evaluates, issues 4. Approving au decision, and notes conditions if applicable. 5. Office notifies initiator of the decision and archives documents in the central repository. 6. Continuous improvement lead reviews quarterly metrics and recommends updates to this procedure."
    }
]