[
    {
        "image": "agreement1_synth_10_aug1.png",
        "label": "agreement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF BUSINESS Office of the Dean Sta. Mesa, Manila office of the dean universy edu ph (03) 8516 1865 PRACTICUM AGREEMENT FOR TEACHER EDUCATION PROGRAM. Date: February 20, 2025 TO WHOM IT MAY CONCERN: ‘This Practicum Agreementis entered into between POLYTECHNIC UNIVERSITY OF THE PHILIPPINES, COLLEGE OF BUSINESS, hereinafter referred to as the \"UNIVERSITY,\" and the cooperating school nstitution, hereinafter referred to as the \"PRACTICUM VENUE.” WHEREAS, the UNIVERSITY requires student teachers to complete supervised teaching practice as part of their professional education requirements, WHEREAS, the PRACTICUM VENUE agrees to provide opportunities for student teachers to observe, assist, and conduct actual classroom instruction; NOW, THEREFORE, the parties mutually agree as follows: PURPOSE AND OBJECTIVES 1. Provide student teachers with authentic classroom experience 2. Develop teaching competencies and professional skills 3. Apply educational theories and methodologies in actual settings 4. Foster professional relationships between pre service and in service teachers UNIVERSITY RESPONSIBILITIES 1. Assign qualified student teachers who have completed prerequisite courses 2. Provide orientation on practicum policies, procedures, and expectations 3. Assign university supervisor to conduct regular observation and evaluation 4. Ensure student teachers are covered by accident insurance 5. Coordinate schedules and requirements with the PRACTICUM VENUE 6. Address concerns and issues that may arise during practicum period lll PRACTICUM VENUE RESPONSIBILITIES 1. Assign cooperating teacher to guide and mentor student teachers 2 Allow student teachers to observe classes and teaching methodologies 3. Provide opportunities for student teachers to conduct demonstration teaching 4. Evaluate student teacher performance using university evaluation forms 5. Provide feedback and recommendations for improvement 6. Issue certificate of completion after successful practicum period IV. STUDENT TEACHER RESPONSIBILITIES 1. Observe professional conduct and dress code at all times 2. Comply with PRACTICUM VENUE policies and regulations 3. Prepare comprehensive lesson plans and instructional materials 4. Demonstrate teaching competencies across various learning areas 5. Maintain confidentiality of student records and information 6. Participate in school activities and professional development programs \\V. DURATION AND SCHEDULE The practicum period shall run for 7 weeks during Second Semester of Academic Year 2025 2025. Schedule shall be coordinated between both parties. VI EVALUATION AND GRADING Student teachers shall be evaluated based on lesson planning, instructional delivery, classroom management, assessment skills, and professional qualities. Final grades shall be determined by the university ‘supervisor in consultation with the cooperating teacher. Prepared by: Office of the Dean POLYTECHNIC UNIVERSITY OF THE PHILIPPINES"
    },
    {
        "image": "agreement1_synth_10_aug2.png",
        "label": "agreement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPRIES (COURGE OF BUSHES Oice ott Daan Stn. as, Wanita ton at cemntguonnety 064 0% oannanesees PRACTICUM AGREEMENT FOR TEACHER EDUCATION PROGRAM Daw. Feprunry 29, 2025 TOWHOR IT HAY CONCERN Poe ecmaia race evn FOLYTEOINE UVES OF ME TWAT GY, gr and Fe conparaing schocinseunon, neous reread 28 aaearcr re uavensty egues sre nacersncangne ering sang fae PASS pritessionai education requirearts, ncn VENUE agrees in provide coponuraes fr side machas i oRser® stint, ane concutt clesscor experiance 2. Oevetop teaching vend mamosoiugns in acta! 20mg8 FORter STUDENT TEACHER RESPONSE TES Onserve conduct and drese code at #8 trees 7 Comey with MAC ICUM VENUE poses 908 Prepare compsenersive AN DTS ATS soatec a Demonstrate BACWNG gastrn 3 Fenestra am SNS antormahon 6. ‘Partecpate in ochond actvibe 8n2 dialled cnn awareness oS 202d 2025. Me anak be cooranana vebewsn DOR PTS ORAL eon nen eo ee tl eae porioonen esta res guar nae commen 4 acagermc Year"
    },
    {
        "image": "agreement1_synth_10_aug3.png",
        "label": "agreement",
        "ocr_text": "po ie 2S1TY OF THE PHILIPPINES ssi LYTECHNIC UF ome sega, Mania cite ubina deanglunneray eduoh pep naro t38 Date: Fepruary 29, TO WHOM IT MAY CONCERN: 1 POLYTECHNIC. FY.\" ana the coopsraling schootting AUVERSHTY OF THE PI nlc 9 Agraemeni s entered inte bate hereinafter gto as te “UNIVE “PRACTICUM VENUE” paitot ised teaching practes ER EA chers ip observe, assist, and conduct ORE the lows PURPOSE AND UAJECTIVES 1§ and pratessionat oxi ships batwaen 01 ‘ovids stationt teachers with aulhuntic classro 3. Apply edhicanonai thoortes and metho: seine ang in service teachers RESPONGIB: Pepuide ctientation on practicum paticie valuation 4. Eosus uk VE) TIES 4. Assige RESPONSIBILITIES 1 Assign cnogerating te adaiogins 2, Provide opportu using university evaluat I PRACTICUM YENU Allow shadent laachiars to observe os conduct cemonstration teaching 4. Evaluate tendvack ancl recomimandabane tor improves cress, 268 ans aad insinscsio rontity w st i PREC oe TPYEAGHER RESPONS# UM VENUS 11d Semester of Academe Year be evaluated pased on tesson planning, memuctonal detivary, management 4 opt kis, and professional qualities, Fina! granas chal be detwomined By the unis ty ngullation with the cxoperatng teacher,"
    },
    {
        "image": "agreement1_synth_10_aug4.png",
        "label": "agreement",
        "ocr_text": "UNIVERSITY of THE PHL PPAR couese OF BUSINESS ‘tice of ie Dee: ‘sta, bias, ue anangereveents 2c oh POLYTECHNIC ose st faa a netee Oats CUM AGRE EDUCATION PROGRAN aie Foon aay COHCERN suis anlar inte beara POLYTES susvERSITY” ast ANIC UNIVERSITY OF THE pHyPPINES, COLLEGE OF a sara AR, MEER ignted 12 a8 FORO ps Pract Agroast 5, narninatas cetera 26 28 Be ENE! “WHEREAS, tre UNIVERSETY cose sheet seacherota compiese supervises Sac gracticn a past ot th soist, and soncect syoation requirement pt waacners b oDeerve, 3 protssiona 83 acy tteaed VENUE eggs Bronte saseaniti for staciel RAS, ths FI san, actu iasseoert spsaity agree 85 ». Daveaiog teacktina Now), THEREFORE the padiea me PURPOSE AND OBJECTIVES t prea shatenteaenar? wi aartemte dassrom Sxpemnees ‘ropotencias and pratassiona’ is 2 ‘apnty educational macnn aT re cracegres in arkeai sata 4. Foster ene pra servios ang snsorees wachess wie courses nave completed orate2 sige widvarsity SURV 5, Comidinals schedules uring oracticum pao professonat zelatonanlps to conduct Quist cj statent eachers wo _ and eectasons 3 Tcovecie by accel SURG ag and igsuss tat may at {LuNNAERSTTY RESPONSIBEITIES t saaign uccitie provide cremation oe racic PACE seovation and 2viust nenits ith ae PRACTICUM 2pEPONSML sas 28 sqenoe siucant ieaenare 2 tbe tr stent teachers uation fone PrOe cling machor guise ans span remrsci ie? 3 PROVE OPO peat semaireson wacting &. VARS neta etn asoesaree Un UNSEEN A fpectvack and cecoramerdsations 7 improvement. mee corencate 2 erp tet ahen Succ! weaCR DEE pen TEACHER RES shane arees coda ataitimes 2 oney #4 4. Ascign camper my PRACTRIUM VENUE ago secant teachers #9 otRS fv. STUDENT mqngiBiLiTIES 1. Gusane poviasstone comgiit Se nec HeUM VENUE patios and regula prepare corrorehersive #ess0n Brats ‘and wnsinvctoral matesiats 4. Demanairaie teaching onmpernnces reas vastous weanrung seas 5 Rat ‘convigentiaity cf snscent rics 2 reraemation 6. Participate in chant AcOH dine esetessional developement POMS 4 DURATION AND SCHEDURE The PERSIE poried stvatt run fot Pe 2008, Scnaduie sal ws coortenaled pater bot gates. UL EVALUATION AND GRADING: shssoattenchers shal ue ovaivrieg DSS aspen planning. i Gaseroom ssanageinens aesaasneent sks, and professional cates Final igranias stank bo Starman BY TBE uneceesitaes jpervigcr in conan: oi Ee -caparitinng teach seks during Sncared Semester Of ACOGETS Yost giruatonat dalvay, Be Prepared DY oftcs ofthe Dean POLYTECHNIC UNIV RGiTY OF THE PHILIPPINES:"
    },
    {
        "image": "agreement1_synth_10_aug5.png",
        "label": "agreement",
        "ocr_text": "ECHNIC UNIVERSITY OF THE PHILIPPINES: COLLEGE OF BUSINESS Office of the Dean sta. Mesa, Manila office ofthe deang universtyedu ph (03) 8516 1805, PRACTICUM AGREEMENT FOR TEACHER EDUCATION POLYTI Date: February 20, 2025 TOWHOM IT MAY CONCERN: ‘This Practicum Agreementis ent BUSINESS, hereinafter referred the \"PRACTICUM VENUE.” WHEREAS, the UNIVERSITY requires student teachers o complete supervised teaching practi professional education requirements; WHEREAS, the PRACTICUM VENUE ag! actual classroom instruction; NOW, THEREFORE, the parties mutually agree as PURPOSE AND OBJECTIVES 1. Provide student teachers with authentic classroor ‘experience 2. Develop teaching ‘competencies and professional sls 3, Apply educational eories and methodologies in actual settings 4. Foster professional relationships between pre service and in service teachers IL UNIVERSITY RESPONSIBILTIES 1. Assign qualified student leachers who have completed prerequisite courses 2 's 3. Assign university supervisor to conduct regular Provide orientation on practicum policies, procedures, and expectations rrneaton and evaluation 4. Ensure student eachers are covered by accident insurance 5 Coordinate schedules and fequitements with he PRACTICUM VENUE 6. Address concerns and issues that may arise ‘during practicum period IIL PRACTICUM VENUE RESPONSIBILITIES 1. Assign cooperating teacher to guide and mentor student teachers 2 inion student teachers i observe classes and teaching methodologies 3. Provide opportunites fo student teachers to eeduct demonstration leaching 4. Evaluate student teacher performance using university evaluation forms 5. Provide feedback and recommendations for improvement 6. ssue certificate of completion afer successt practicum period IV. STUDENT TEACHER RESPONSIBILITIES 1, Observe professional conduct and dress code at ll imes 2 Comply with PRACTICUM VENUE policies and regulations 3. Prepare comprehensive lesson plans and instuctiona} materials 4. Homonstate teaching competencies across various leaming areas 5, Maintain confidentiality of student records and information 6. Participate in school activities and professional development programs \\V DURATION AND SCHEDULE The practicum period shall run for 7 weeks during Second Semester of 2025 2025. Schedule shall be coordinated between both parties, ‘evaluated based on lesson planning, instructional delivery, wualities, Final grades shall be determined by the university OF THE PHILIPPINES, COLLEGE OF fered into between POLYTECHNIC UNIVERSITY stitution, hereinafter referred to as 10 as the “UNIVERSITY,” and the cooperating schoolin ice as partof their ees o provide opportunites for student teachers to observe, assist, and conduct follows: ‘Academic Year \\VLEVALUATION AND GRADING Student teachers shall De: classroom management, assessment skills, and professional q supervisor in consultation with the cooperating teacher. Prepared by: Office of the Dean POLYTECHNIC UNIVERSITY OF THE PHILIPPINES"
    },
    {
        "image": "agreement1_synth_1_aug1.png",
        "label": "agreement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY SCHOOL OF MANAGEMENT Office of the Dean Loyola Heights, Quezon City office. the dean universy edu ph (63) 4 161 5300 PAYMENT AGREEMENT FOR TUITION AND FEES Date: October 06, 2025 TO WHOM IT MAY CONCERN: This Payment Agreement is executed between ATENEO DE MANILA UNIVERSITY, SCHOOL OF MANAGEMENT, hereinafter referred to as the \"UNIVERSITY,\" and the undersigned student parent guardian, hereinafter referred to as the \"DEBTOR.\" WHEREAS, the DEBTOR has incurred financial obligations to the UNIVERSITY for tuition fees, laboratory fees, and other school charges for the Academic Year 2025 2025; WHEREAS, the DEBTOR acknowledges the outstanding balance and commits to settle said obligation according to terms specified herein; NOW, THEREFORE, the parties agree to the following payment terms and conditions: AMOUNT OWED The DEBTOR acknowledges an outstanding balance of PHP 25 095 00 representing tuition and other fees for the current academic period. Il PAYMENT SCHEDULE The DEBTOR agrees to settle the outstanding balance according to the following installment plan: Initial payment: 30% of total balance due upon signing Second installment: 35% of total balance due on or before midterm period Final installment: 35% of total balance due on or before final examination period Ill. LATE PAYMENT PENALTY Failure to remit payment on scheduled dates shall incur a penalty charge of 2% per month on the unpaid balance. The UNIVERSITY reserves the right to impose additional sanctions as stated in the Student Handbook IV. CONSEQUENCES OF NON PAYMENT Non compliance with this payment agreement may result in: 1 Withholding of grades and academic records 2. Non issuance of certificate of enrollment for succeeding terms 3, Exclusion from examination privileges 4. Non release of diploma and Transcript of Records 5. Legal action to recover outstanding amounts V. ACADEMIC PRIVILEGES Subject to compliance with this agreement, the DEBTOR shall retain the following privileges: Attendance in enrolled classes Access to university facilities and services Participation in academic activities and examinations Library and laboratory privileges VI. GENERAL PROVISIONS The DEBTOR agrees to promptly notify the University Accounting Office of any change in contact information or financial circumstances. This agreement shall be governed by university policies and Philippine laws. Issued by: Office of the Dean ATENEO DE MANILA UNIVERSITY"
    },
    {
        "image": "agreement1_synth_1_aug2.png",
        "label": "agreement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY oyeta Hekjnts, C20 sve demrigginevarty 298 0% 3) tat SWS PAYMENT AGRI FOR ION AND FEES Oetner 06 FY, SCHOOL OF pareneguardian, ywHOM #7 MAY CONCERN: executed bebvee? a HELA UHIVERST Bera a3 he “UNIVERSITY,” aca the ants caged sian! he UNIVERSE TY for ty |, labararory 1ee3. 70 This Bay MANAGEMEN porelvectter refered WHEREAS, the DEBTOR and other school charges at Agreement FE, berainalte te ao the\" gation soconting commits to settle aid obtt Hiont 26 ard con ca of BHP 25 005 00 representing Hatin HOW, THEREFORE, the parties agree the following payment 1 AMQUNTE O NED The DEBTOR astnonlongye #2 nd offer fees For the cumront acdenrie PENS of SCHEDULE The HEBTOR agiues «0 SARE DS 3M of tial balance due upon siagh ng ~ipitiat auyroent: 364% 1 Final installmens 36% of total catsiending bik ing to the fatowing 35% of total seeding babnice accor Sacer pret, ‘paiance due on or before fire! PAYEE instaliment pier palance due on or hefore midteren Pet examination period th LATE PAYMENT PENALTY month on the uopeid belanc the Student Handoouic OF NOHFAYMENT Hore s ‘end acadeanic records 2, Hanis ment for succeading fers 3 sa privileges Non eiease of dsfoma Fraser cords 5 Laged actiais 10 wsied dates shall tncut onal re so remit payment UNIVERSITY reserves ly, CONSEQUENCE ‘aathiwiing of giaies the DEBTOR shail otain the follow nd services Participation it compliance wit ints agreement, ss to university facillies 8” na _ Library and laboratory pavileges DEBTOR agrees to premetly cotly (mE University Accounting vepestances. This agreement shall BE ‘governed DY ERAL PROWSION igormatior Vi. GEN change ip contr ATENEO DE MANILA Oftice of the Dean"
    },
    {
        "image": "agreement1_synth_1_aug3.png",
        "label": "agreement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY ‘SCHOOL OF MANAGEMENT Office of the Dean Loyola Hemghts, Quezon Cy oftee of me dean universty 004 9M (o03 4 101 5300 PAYMENT AGREEMENT FOR TUITION AND FEES Date: October 06, 2025 ‘TO WHOM IT MAY CONCERN: This Payment Agreement is executed between ATENEO DE MANILA UNIVERSITY, SCHOOL OF MANAGEMENT, hereinafter referred to as the “UNIVERSITY,” and the undersigned hereinafter referred to as the “DEBTOR” WHEREAS, the DEBTOR has incurred financial obligations to the UNIVERSITY for tuition fees, laboratory fees, ‘and other school charges for the Academic Year 2025 2025; WHEREAS, the DEBTOR acknowledges the outstanding balance and commits to settle said obligation according NOW, THEREFORE, the parties agree to the following payment terms and conditions: AMOUNT OWED The DEBTOR acknowledges an outstanding balance of PHP 25 095 00 representing tuition ‘and other fees for the current academic period. I PAYMENT SCHEDULE The DEBTOR agrees to settle the outstanding balance according to the following installment plan: Initial payment: 30% of total balance due upon signing Second installment 36% of total balance due on or before midterm period Final installment: 35% of total balance due on or before final ‘examination period IIL LATE PAYMENT PENALTY Failure to remit payment on scheduled dates shall incur a penalty charge of 2% per month on the unpaid balance. ‘The UNIVERSITY reserves the right to impose additional sanctions as stated in the Student Handbook. IV. CONSEQUENCES OF NON PAYMENT Non compliance with this payment agreement may result in: 1 Withholding of grades and academic records 2. Non issuance of certificate of enrollment for succeeding terms 3. Exclusion from examination privileges 4. Non release of diploma and Transcript of Records 5. Legal action to recover outstanding amounts \\V. ACADEMIC PRIVILEGES Subject to compliance with this agreement, the DEBTOR shall retain the following privileges: Attendance in enrlled classes Access to university facilities and services Participation in ‘academic activities and examinations Library and laboratory privileges VI. GENERAL PROVISIONS The DEBTOR agrees to promptly natty the University Accounting Office of any change in contact information or financial circumstances. ‘This agreement shall be govemed by university policies and Philippine laws, Issued by: Office of the Dean ATENEO DE MANILA UNIVERSITY"
    },
    {
        "image": "agreement1_synth_1_aug4.png",
        "label": "agreement",
        "ocr_text": "ENEO DE MAN AUN SCHOOL OF nunageas Oftne oF the Dean, Heinite, Suerue Cay er of tne 0) 4 164, PAYMENT AGREEMENT FOR TUITION AND F; Gate: October 06, 2005, ‘ited between 47} Nereinaiter esfemed t teferred to 25 the ‘DEAT OR MANILA UNIVERSITY, SCHOOL OF FY.\" and the undersigned! studentiga, pti guardian, incurred teecist cbligions tothe \"eres for the Academic Year 20) 6 fess, Into tory fees, WHEREAS, the DESTOR acknantedges the cut nits ic settle sai¢ obligation according “G fOrNS suecifiod here NOW, THER FORE, the pas aviment terms and cor LAMOUNT OWED The roto an outstanding Balance a} PHD 25, £98 00 resvesenting ty ‘2m otber fees toy 1 mS poring, PAYMENT ss he DEBTOR agrees to x: ‘an: intial payment: 30% i the outers Final instalment. 25% of tol balance a of total: ot 19 the fatoning 25% of total om cr before Firat exaringtion priced ML LATE PAYMENT PEMeLTY Fa Per month on th fr the Student lars te tent payrond on schevksod dates shill incur peal The UNIVERSITY eserves tho night to impose additional hy charge of savictions ae stated ES OF Withholding of oracles and MENT Non compliance with thie Payment egremen: ee teh eBtrC of centticate of enrctng Beivilogos 4. 5 Esctusion tro thay result ine 4 nt For succesding i of Recoids Lega! ‘examitnation ienns 3. GES Subject 12 compan ce in enmiled classes 108 heey 8 vith HY Sid Iaborater NERAL PROVISIONS The DE RTO Sharge in contact Intcernstion or fr ad Phiipoine igus fanoe, Tae ally the University Accounting Ofice of an tances, This age he govemed by univ: losusd by Office of the Bean MANE"
    },
    {
        "image": "agreement1_synth_1_aug5.png",
        "label": "agreement",
        "ocr_text": "EO DE MANILA. UNIVERSITY SCHOOL OF MANAGEMENT ow Loyola rigepen, Duets OY dsangurmenvede oe tcp of te Bean 253 488 4890 iT AGREEMENT {TION AND FEES PAY FOR TY Bete: Ociober 8, 2075 TO WHOM (T MAY CONCER? his Payment Agreement is executed MANAGEMENT, herinafter seieernd fer retores to 35 the “OEBTOR” potaeen ATENEO DE MANKLA URIVERSITY, SCHOO: OF AJERSITY,” and the undersignee student aerentiguacian gations to the UNIVERSITY for tation fous, abenatory fees 25 20: nding balance and convents to sasile said obigation seconde conditions 25 098 00 representing tation HOW) THEREFORE, the parties ognen to th foing parymect ts 29 AMQUNT OWED Tre DEBTOR achnowisdgns en outstanding PHERSe of PRE nel other fees for the cunant academic period DEBTOR agrees to settle {3% of tote! balance due upon sign! _ Final installment 36% of tot ste curetandny balance according to Ge Second isstatinent 25% o ‘balance due on of hetom Bina ih PAYMENT SCHEDIAE T instatimant piare inital payment balance due on or before midterm period exanination patiot HL LATE PAYMENT PENALT: pis rnonth ar the unprid balances, ‘Te UNIVE jn the Stadart Hondbook LY. CONSEQUENCES OF NON PAYMENT Mor cemplfance wih a 95 007 agement may result int khiolding of grades ard aciedemic record 2, Nareissuance vd ceificate of enralirent for suncenag tems 3 lesion fest axarination rbvSagee 4. Hoseetoast of vison ant Trarocrint of Reconls 8. Lege! action to secover coustandting are J ACADEMIC PRIVILEGES Subject te compliance wit this agreement, 2 prviagen. Attencanoe in eclea classes Access to Om versity facities and 58 redone activtlon ond examinations -Lieasy and laboratory privilege> Ri, PROVISIONS Thw DEBTOR agioas to promptty rity the 1 rivarsity Recourting Otfice of any reenact information t Tinancist circumstances, This agemement sa Ps ‘qoveired by university pudicies ang Pritippine iow en scheduled dates snell incur a penaity charge of Ze the right to lnpoze sddticnal sanctions 9s elated ATOR onal! retain the following aivices Perticination in isqund by: Lofflew of the Dean ATENEO DF MANILA USVERSHTY"
    },
    {
        "image": "agreement1_synth_2_aug1.png",
        "label": "agreement",
        "ocr_text": "MINDANAO STATE UNIVERSITY COLLEGE OF EDUCATION Office of the Dean Marawi City, Lanao del Sur offer ofthe dean universty edu ph (03) 4800 4382 PAYMENT AGREEMENT Date: April 25, 2025 TO WHOM IT MAY CONCERN. WHEREAS, the DEBTOR has incurred financial obligations to the UNIVE and other school charges for the Academ: +-2025, WHEREAS, the DEBTOR ack Towledges the outstanding balance and commits to to terms specified herein; \\l, PAYMENT SCHEDULE The DEBTOR ‘agrees to settle the outstandi installment plan: initial payment: 30% of {otal balance due upon signing balance due on or before midterm period Final installment: 35% of total examination period Issued by: Office of the Dean MINDANAO STATE UNIVERSITY tanding balance accor FOR TUITION AND FEES ing to the following Second installment: 35% of total balance due on or before final"
    },
    {
        "image": "agreement1_synth_2_aug2.png",
        "label": "agreement",
        "ocr_text": "MINANAOG S* ATE UNIVERSITY uecE OF EDUTATON oontcs oe Dear taararn Cab, Lona de! St cima cennturnsernty nou citer 54 8uoane PAYMENT AGREEMENT FOR TUITION AND FEES Gato, Apt 26. 2025 To WHOM IT MAY CONCERN This Bayrrnest Agresrant C48 tes beta nareinaticr referiat io 02 UNIVERSITY ug the “OEETOR” ne DEBTOR nos never ges for tho Ac ensic Yeo ‘Meh 2025, ediyas the cursing olen? and een MINDANAO STATE UNIVER py, SOLLESE OF EQUCATION Navi tre uncasi fied Stuiest aacortuarcia’. tareinatict relertad tees, porary I Rave RSITY for tulle WHEREAS. sand other shook che WiMRREAS, too GEBTOR acknowt on e009) qo teres specifies bevels THEREFORE. the ts DESTOR acknowledges 2 outs\" ink ac aderric patie! omens to sitio $800 ab0g\" reek voor arvd CORSTIONS ecties sycoe to the 1030009 PAY sance of PHP 65 0 arb F 9 00 vepmesenting tation not L AMOUNT OWED Te ‘gad giher foes Foe the oUF a PAYMENT 9Ct ostabment star’ «fetal 3 mance due Ue SGD patance dit 2° Tras nsec 33% of tal alee examivation pected tet PENALTY Faniure 10 potance, The UNIVERSITY rg batonce aecoeing 2 te FOP Second insistent, 2% of ioha ven dim on cx verre sentie the oatstar wnat paymrest on arnackuen! dates anat incr a pena change 2 Teaesy 0 Fight £0 PERE ttional sacar wy stash i LATE, PAYHE: es enon 66 the eS re the Sturtert HeasDUS Gv, CONSEQUENCES OF NON pAYMENT Koco Jrehniidirg 2b rears 38 II rods? oniesuance ot Prctaan fram axamnaaion See nL Ncoaokesse of capers a9 Lance qth this oye\" rosult in te ne of anatzenk fr sorceetnd tems 3 Hf Transenpt of Recor 3 be DEBTOR shal et poceyrer curslansng SHOUTS Yy_ ACADEMIC PRIVILEGES Subject to comprare ws SS eyoorent the gaositeges Artensianeo oe ang cusses» NECMSS 10 FENRIS yas ane serves aricipace 1 ret gxnenioaticns «Liber o08 Jatoratany pivilens rivarsity Recounting Onis of a cadens actos Vi GENERAL PROVISIONS Ts oe BTOR agraes 8 ero etity the cnange in eceraet tearnaran iqanciat Hecumstances, Ths Ae! sent sha Be MeN ‘ars Philippine 1s cpad by vnitceraity pOMCIa® can INDABA STAVE UNIVERSITY"
    },
    {
        "image": "agreement1_synth_2_aug3.png",
        "label": "agreement",
        "ocr_text": "MINDANAO STATE UNIVERSITY COLLEGE OF EDUCATION Office of the Dean ‘Marawi City, Lanao del Sur offce of the deanguniversty 23 0 (203) 4 800 8382 PAYMENT AGREEMENT FOR TUITION AND FEES Date: April 25, 2025 To WHOM IT MAY CONCERN: ‘This Payment Agreement is executed Donwsse MINDANAO STATE UNIVERSITY, hereinafter referred to as the CUNIVERSITY.” and the undersigned ‘student parent g as the \"DEBTOR™ WHEREAS, the DEBTOR has incurred financial obligations to the ore xher school charges forthe Academic Year 2024 2025, WHEREAS, the DEBTOR acknowledges the outstanding balance and commits to settle said obligation according to terms specified herein; NOW, THEREFORE, the patties agree to the following payment terms and AMOUNT OWED The DEBTOR acknowledges an outstanding balance of ra other fees for the current academic period II PAYMENT SCHEDULE The DEBTOR agrees 10 settle the outstanding balance according 1 the following thstaliment plan: Initial payment: 30% of total Talance due upon signing Second installment 36% of total inoue on or before midterm period Final installment Eee of total balance due on or before final examination period Ii LATE PAYMENT PENALTY Failure to remit payment on scheduled dates shall incur penalty charge of 2% per month on the unpaid balance. The UNIVERSITY reserves the right to impose sanctions as stated in the Student Handbook IV. CONSEQUENCES OF NOI Withholding of grades and academic rec ettusion from examination privileges 4, Noneleas recover outstanding amounts \\V, ACADEMIC PRIVILEGES Subject to compliance vith this agreement, the DEBTOR shall retain the following privileges: Attendance in enrolled classes Acco \"university facities and services Participation in Seed examinations Library and laboratory privileges ‘academic activi VI. GENERAL PROVISIONS The DEBTOR agrees to promptly notify the Change in contact information oF financial circumstances “This agreement shall be governed COLLEGE OF EDUCATION, wardian, hereinafter referred to UNIVERSITY for tuition fees, laboratory fees, conditions: PHP 65 869 00 representing tuition ‘ance with this payment agreement may result In 1 iment for succeeding terms 3. ‘ords 2. Nomissuance of certificate of enrol of diploma and Transcript of Records 5. Legal action to University Accounting Office of any by university policies Issued by Office of the Dean MINDANAO STATE UNIVERSITY"
    },
    {
        "image": "agreement1_synth_2_aug4.png",
        "label": "agreement",
        "ocr_text": "MNDANAG Stare UNIVERSITY ERSITY, COLLEGE of pas Eoucanion KetSigned student, 208, laboratory toxs knowledges the cxtstancing balance and commits to ya Said obligation acne 9 tha following i AMOUNT an6 other D The DEBTOR 2 Tor the scknowiadg, CUBED Academic peri PAYMENT scr oy E fof OR agines to s SHI Payment 20° of total balan: before Besoin insta Seaninaition total balance dtu LATE PAYMErT pen Per ments on a unpaid bata e The ut tident Handitaote in the QUENCES OF on Withholding of or PAY MENT pe grades and seg ors plivileges dy oUNtS Exeiusion tom examinan PADEMIC PRIVILEGES Subject 1p COMpHANCE With this agroems BY and laboratory prvitns geSS tO pomp of finanela ty ntiy the fal owcumstances University 4 ting Otfice of any This aqrenmons by Y Unive ley policies"
    },
    {
        "image": "agreement1_synth_2_aug5.png",
        "label": "agreement",
        "ocr_text": "fINDANAG STATE UNIVERSITY POLLEGE OF EDUCATION ifice oe Caan, taarzes City, Lanna Gel Su tia atte doandienseraty aa e pag nau are PAYMENT AGREEMENT FOR TUITION AND FEES Pate: Apai 28, 2025 YO WHOM IT MAY CONCERN. ‘This Payinant Agreenunt fs evecuts sarelvatver referred to a6 the “RAVERSITY” es the “DEBTOR” WHE: end ote WHEREAS, the DEGTOR acknoaiedges the a te temess epeciied frerein ROA, THE ORE, the partion. agres to tse follow: 5 AAIGLIST OWED The DEBTOR ocknowdediges an outstanding balaces f PHP ES rut othar fees tor the current scadaric period. OL PAYMENT SCHEDINLE The OZBTOR agra te gntia the auteianding balance eT 20 the following installment plar initial payment: 1% of totat balance dat open signing Senos instatenent: 36% of total Naa nertus x oy batera miesn psi Piva instaliinent, 365 of fot elence de 0 teeter fot aecaevisistion pied TL LATE PAYMER ‘gat month 09 the unpaid balance. in the Student Hantbook. fy. CONSEQUENCES OF NOR PAYBI |yWithhaldiag of grades end axscbemic (eco Exclusion from exartination pririeges 4. Ne recover outstanding aMcals 4. ACADEMIC PRALEGES Subject ts ieges. Atandance ': entailed claawes AEGGSe (D utrieatait Desdomis activities and exeminations GURY .jighoretory privileges: ATE UNIVERSITY, COLLEGE OF EDUCATION, netwieen MIHOANAO 8 parent guardian, hereinalter referred to and the undersigned stucien’ oR has incurred financial cbtigations to the UNIVERSIPY for ution feat, Iaboralor Fees ‘school chargers for the Acoderic Year 2004 2055; standing balance and carmmtis te she: DE selle seid chiigation accu Joonitisns: payment terns (00 representing tution 98 shall incur 9 panalty charge of 2% Impose addionak senciions ao ota! HALTY Failure to zarnll payment on scheduled ds UNIVERSITY 12 fhe eight mmoy result te: 4 EAST fien comptiance with this gaymant agement nis 2 Handesuuriee of cartifvate of anialimen vrcretomse of Sigioma and Framactipt of Fncoeds Lagat seston (© TOR stall eatain tha follor counphance with this ogosement, the DEB jcag Paiticipation in ty tachities end se FOR agress to promptly potty the tinivessity Accounting Cie of any ‘This 99 al be yovarned by universiiy policies Vi GENERAL PROVISIGNS The DE change in contact infesruaion oF fnanc and Phitigpine laws iesunel by pftice of the Daan MINDANAO STATE DRIVERS! vy"
    },
    {
        "image": "agreement1_synth_3_aug1.png",
        "label": "agreement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF BUSINESS Office of the Dean ‘Sta. Mesa, Manila office of the dean universty edu eh (+83) 3 225 1248, PAYMENT AGREEMENT FOR TUITION AND FEES Date: October 11, 2025 TO WHOM IT MAY CONCERN: executed between POLYTECHNIC UNIVERSITY OF THE PHILIPPINES, COLLEGE This Payment Agreement is OF BUSINESS, hereinafter referred to as the “UNIVERSITY,” and the ‘undersigned student parent guardian, hereinafter referred to as the “DEBTOR.” WHEREAS, the DEBTOR has incurred financial obligations to the UNIVERSITY for ‘and other school charges for the Academic Year 2025 2025; WHEREAS, the DEBTOR acknowledges the outstanding balance and commits to settle said obli to terms specified herein; NOW, THEREFORE, the parties agree to the following payment terms and conditions: AMOUNT OWED The DEBTOR acknowledges an outstanding balance of PHP 29 158, 00 ‘and other fees for the current academic period. Il, PAYMENT SCHEDULE The DEBTOR agrees to s installment plan: Initial payment: 30% of total balance balance due on or before midterm period Final installmer examination period III, LATE PAYMENT PENALTY Fallure to remit payment on scl per month on the unpaid balance. ‘The UNIVERSITY reserves the right to im in the Student Handbook. IV. CONSEQUENCES OF NON PAYMENT Non compliance with this payment agreement may result in: 1. Withholding of grades and academic records 2. Non ssuance of certificate of ervelrner for succeeding terms 3. eaerveion vom examination privileges 4. Non elease of diploma and Transcript of Records 5. Legal action to recover outstanding amounts V. ACADEMIC PRIVILEGES ‘Subject to compliance with this agreement, the DEBTOR shall retain the following privileges: Attendance in enrolled classes ‘Access to university facilities and services Participation in eerademi¢ activities and examinations Library and laboratory privileges VI. GENERAL PROVISIONS The DEBTOR agrees to promptly notify the change in contact information or financial circumstances. This agreement and Philippine laws. Issued by Office of the Dean POLYTECHNIC UNIVERSITY OF THE PHILIPPINES tuition fees, laboratory fees, ligation according representing tution ettle the outstanding balance according to the following ‘due upon signing Second installment: 35% of total nit: 35% of total balance due on or before final Jheduled dates shall incur a penalty charge of 2% 1pose additional sanctions as stated University Accounting Office of any shall be governed by university policies"
    },
    {
        "image": "agreement1_synth_3_aug2.png",
        "label": "agreement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF BUSINESS Office of the Dean sta. Mesa, Manila coffee of the dean universty 2du Ph (903) 3225 1245 PAYMENT AGREEMENT FOR TUITION AND FEES Date: October 11, 2025 TO WHOM IT MAY CONCERN: This Payment Agreement is executed Det hereinafter referred to as the \"UNIVERSITY,\" and the ur OF BUSINESS, hereinafter referred to as the “DEBTOR” WHEREAS, the DEBTOR has incurred financial obligations to the UNIV! ‘and other school charges for the ‘Academic Year 2025 2025; WHEREAS, the DEBTOR ‘acknowedges the outstanding balance and comt to terms specified herein: NOW, THEREFORE, the partes agree 10 he following payment terms and conditions: |, AMOUNT OWED The DEBTOR ‘acknowedges an outstanding balance of PHP 29 158 00 representing tition 1d other fees forthe current academic petiod. II PAYMENT SCHEDULE The DEBTOR 2370 Thetaliment plan Initial payment: 309% of total balance Fesanee due on or before midterm period Final installment: 35° examination I, LATE PAYMENT PENALTY Failure remit payment on si ‘ronth on the unpaid balance. The UNIVERSITY reserves in the Student Handbook. IV. CONSEQUENCES OF NON PAYM Watling of grades and academic TecOres clusion from examination privileges 4 Non eleas recover outstanding amounts \\. ACADEMIC PRIVILEGES Subject 0 com jendancé S, COLLEGE VERSITY OF THE PHILIPPINE: ian, tween POLYTECHNIC UNF indersigned student! ERSITY for tition fees, laboratory fees, mits to settle said obligation according according to the following iment: 35% of total fore final to settle the outstanding balance ‘due upon signing Second instal ef of total balance due on or bef tharge of 2% iI incur a penalty cl tated .cheduled dates shal ‘additional sanctions as $I the right to impose ENT Non compliance with this payment agreement may result in: 1 2 Nomissuance of certificate of venoiment for succeeding terms 3 Ff aiploma and Transcript of Records 5. Legal action to Jpall retain the following reement, the DEBTOR s! pation in pliance with this 29 ies and services Partici E Promoted classes Access to university facil ‘and examinations Library ‘and laboratory privileges ‘VI. GENERAL PROVISIONS The DEBTOR agrees ‘to promptly notify the University Accour ‘change in contact information Tipancial circumstances. This agreement shall be governed and Philippine laws. ting Office of any by university policies Issued by: Office of the Dean POLYTECHNIC UNIVERSITY OF THE PHILIPPINES"
    },
    {
        "image": "agreement1_synth_3_aug3.png",
        "label": "agreement",
        "ocr_text": "POLYTECHNIC. UNIVERSITY OF THE Prilippines COLLEGE OF suamess Oftes of re Dean PAYMENT AGREEMENT FOR TUITION AND FEES Date, October 11, 2025 YO WHOM IT MAY CONCERN: ‘This Payment Agreement is camcutad batenen BOL TECHRNG UNIVERSITY OF THE PHILIPPINES COLLEGE RE BUSINESS, hereinater mfared to as tbe “UNIVERSITY “ann the uncersigns studers parent quandian, hereinafter rtased t0 as the “DEBTOR” WHEREAS, the DEBTOR hos incurred fcancial obligations to the UNIVERSITY for tute foes, laboratory fees, ‘ne other school charges for the Acadaric Ywor 2005 2005, WHEREAS, tre DEBTOR ackiwtedyes the cusanding balance and comeniy {0 satile said abgation according 10 terms specifies heroin, nd Tranecript of Records Legat action to fecuver outstanding amounts v e em Sea eh Comanche wpe DEBTOR a nn tw oi viv Alterdetice in ersoted classes Access to un\\ fssund by Oiice oF the Dawn POLYTECHNIC UNIVERSITY OF THE PHUPPINES"
    },
    {
        "image": "agreement1_synth_3_aug4.png",
        "label": "agreement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF BUSINESS Office ofthe Dean Sta. Mesa, Manila coffee of the deanGuniversty edu ph (103 3 225 1248, PAYMENT AGREEMENT FOR TUITION AND FEES Date: October 11, 2025 ‘TO WHOM IT MAY CONCERN: This Payment Agreement is executed between POLYTECHNIC UNIVERSITY OF THE PHILIPPINES, COLLEGE OF BUSINESS, hereinafter referred to as the \"UNIVERSITY,\" and the undersigned student parent guardian, hereinafter referred to as the \"DEBTOR\" WHEREAS, the DEBTOR has incurred financial obligations ‘and other school charges for the Academic Year 2025 2025; WHEREAS, the DEBTOR acknowl to terms specified herein; to the UNIVERSITY for tuition fees, laboratory fees, ledges the outstanding balance and commits to settle said obligation according NOW, THEREFORE, the parties agree to the following payment terms and conditions |. AMOUNT OWED The DEBTOR acknowledges ‘and other fees for the current academic period. Il. PAYMENT SCHEDULE The DEBTOR agrees to settle the outstanding balance according to the following installment plan: Initial payment: 30% of total balance due upon signing Second installment: 35% of total balance due on or before midterm period Final installment: 35% of total balance due on or before final ‘examination period IIL LATE PAYMENT PENALTY Failure to remit payment on scheduled dates shall incur a Penalty charge of 2% Prine ote, Re unpaid balance. The UNIVERSITY reserves the right to impose addtional sanclons eo states in the Student Handbook. an outstanding balance of PHP 29 158 00 representing tuition V. ACADEMIC PRIVILEGES Subject to compliance with this agreement, the DEBTOR shall retain the following privileges: Attendance in ‘enrolled classes Access to university facilities and services Participation in academic activities and examinations Library and laboratory privileges and Philippine laws. Issued by: Office ofthe Dean POLYTECHNIC UNIVERSITY OF THE PHILIPPINES"
    },
    {
        "image": "agreement1_synth_3_aug5.png",
        "label": "agreement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF BUSINESS Office of the Dean ‘Sta. Mesa, Manila offce of the. deanGunwersty edu ph (003) 3228 1248 PAYMENT AGREEMENT FOR TUITION AND FEES Date: October 11, 2025 ‘TO WHOM IT MAY CONCERN: This Payment Agreement is executed between POLYTECHNIC UNIVERSITY OF THE PHILIPPINES, COLLEGE OF BUSINESS, hereinafter referred to as the “UNIVERSITY,” and the undersigned student parent quardian, hereinafter referred to as the “DEBTOR” WHEREAS, the DEBTOR has incurred financial obligations to the UNIVERSITY for tuition fees, laboratory fees, and other school charges for the Academic Year 2025 2025; WHEREAS, the DEBTOR acknowledges the outstanding balance and commits to settle said obligation according to terms specified herein; NOW, THEREFORE, the parties agree to the following payment terms and conditions. |. AMOUNT OWED The DEBTOR acknowledges an outstanding balance of PHP 29 158 00 representing tuition and other fees for the current academic period. IIL PAYMENT SCHEDULE The DEBTOR agrees to settle the outstanding balance according to the following installment plan: Initial payment: 30% of total balance due upon signing Second installment: 35% of total balance due on or before midterm period Final installment: 35% of total balance due on or before final ‘examination period Il, LATE PAYMENT PENALTY Failure to remit payment on scheduled dates shall incur a penalty charge of 2% per month on the unpaid balance. The UNIVERSITY reserves the right to impose additional sanctions as stated in the Student Handbook IV. CONSEQUENCES OF NON PAYMENT Non compliance with this payment agreement may result in: 1. Withholding of grades and academic records 2. Non issuance of certificate of enrollment for succeeding terms 3 Exclusion from examination privileges 4. Non release of diploma and Transcript of Records 5. Legal action to recover outstanding amounts V. ACADEMIC PRIVILEGES Subject to compliance with this agreement, the DEBTOR shall retain the following Privileges: Attendance in enrolled classes Access to university facilities and services Participation in ‘academic activities and examinations Library and laboratory privileges VI. GENERAL PROVISIONS The DEBTOR agrees to promptly notify the University Accounting Office of any change in contact information or financial circumstances. This agreement shall be governed by university policies ‘and Philippine laws Issued by: Office of the Dean POLYTECHNIC UNIVERSITY OF THE PHILIPPINES"
    },
    {
        "image": "agreement1_synth_4_aug1.png",
        "label": "agreement",
        "ocr_text": "Wow, THEREFORE, in conideraton of the mail agree as follows: 1 OBJECTIVES 1. To ‘students’ technical relevant to their field of study 2. TO academe linkages for ‘and industry partners T provide students with practical wo Ms and professional competencies 9 To establish industry se arater between acai ttn qualified students tothe HOS! endorse pecessary academic guidance equipment 4 Issue certificate university supervisor to comply with all rom the date of signing and may P gical, des, and equations, A vac his agreement with sixty (60)"
    },
    {
        "image": "agreement1_synth_4_aug2.png",
        "label": "agreement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS ‘Wii. oF hw denn gaestonesiy adoh 382 8676 MEMORANDUM OF NT FOR INTERNSHIP PROGRAM Date: February 0 TO WHOM IY BAY CORCERN: eriered into on this day between UNIVE 9S, herwinater referred to as the “UNV ITY OF SANTO TOMAS, SIV.\" and the participating industry WHEREAS, the UNIVE on the job expatience as part of thelr dagree requiremants: WHEREAS, the un require students to under OST COMPANY agrees to previde intemehip epnarty france thelr professional ekil and compatencies: to qualified students of the HOO, THEREFORE, in consideration of the mutux! covenants end agrouments agree os fallow ained haven, the parties OBJECTIVES 1. To provide students with 7 ‘enhance students’ iech al work experience relevant to theit af skils and piofesslonal competenciss 3. vol benefit 4 To faciltale knowlesge transizr batwenn acadamic institutions and Industry pas 3. RESPONSIBILITIES OF THE UNIVERSITY 1. Soreen an us COMPANY 2. Assign faculty euperisor to moniter stosont progtess 3. Pravide necessary ac: nd supped! iuddents comply wilt HOBT COMPANY pol 85 raquliad surenne coverage for studurt Interns andr HL RESHONS! ILINES OF THE HOST COMPANY 1. Provide meaningful work avsignmen ke oragiams 2 Assign workplace supanisor fo guide and ovaluate stan working envitcament and necessary equipment 4, tsaue ca intemahip period 5 Provide fsedtack on student performance to university perionnance 3, ‘cate of completion upan succasstut pervs fV. DURATION This agesment shall be effective renewed upon mutual agreement of both gattios Wa. period of one [1} year fiom the date of signing and may b Al, PROVISIONS Both paci be resolved though ar days por written nutice laws, rules, and 72 Prepared by. Oifice ef the Dean UNIVERSITY OF SANTO TOMAS"
    },
    {
        "image": "agreement1_synth_4_aug3.png",
        "label": "agreement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS FACULTY OF ARTS AHO LETTERS Often of me Dean, Espana, Mant cHtew ot oe. desnaunie sty ney a Gen 2 senesie MEMORANDUM OF AGREEMENT FOR INTERNSHIP PROGRAM Date: Febrary 01, 2025 TO WHOM IT MAY CONCERN ‘This Memorandum of Agreement is entered into on this day batween UNIVERSITY OF SANTO TOMAS, FACULTY OF ARTS AND LETTERS, inereinaiter refered to a8 the “UNIVERSITY.” anc the participating industry partnar, nersinafter refered to as the \"HOST COMPANY.” WHEREAS, the UNIVERSITY offers academic programs that require students to underge practical training and cnthejob experience ac part of thalt degree requirements; WHEREAS, the HOST COMPANY agroes to provide Intomship opecriunitios to quaified students ot the UNIVERSITY to enhance thait professicnai skills and competencies; NOW, THEREFORE, in censidention of the mutual covensats and agreements contained hotein, the parties seme as flows 1 OBJECTIVES 1. To provide students with proctical work experlence relevant to their field ot stuxty 2 To Ochence students’ technical skis ad professional competencies 3. To extattisi industry academe tnkages for mmtuai benefit 4. To faciitate krowsedga trinster deiwenn acadsmic institutions and industry ponners TL RESPONSIBILITIES OF THE UtAVERSITY 1, Screnn and endorse qualified students to the HOST COMPANY 2. Assign tacuity supervisor to menor student pmaross 3. Provide necessary acadamic guidance ‘nd suppeet to student intems 4. Ensure students comply with HOST COMPANY poticies and regutations 5. Process required documentation and insurance covernge for student interns: IL, RESPONSIBILITIES OF THE HOST COMPANY 1. Provide mesninghd work ecsignments aligned with ‘students’ sceclernic programs 2. Assign wurkplace supervisor 1o guide and evaluste student performance 3 Provide sate working erwironment and necessaty equipment 4. issue certificate of camsleticn upon succeastil internship period 5. Provide ieedoeck on studant pertonnance to umvereity supervisor £V. DURATION This agrewmont shai be uftfactive tor period of one (1) yenr from the date of signing andi may be ‘renewnd upon mutual egroamont of both parties V. GENERAL PROVISIONS Gath parties aqme to comply with ali applicable laws, rules, and reguistions Any Esputes shall be nssolves ttrough anicabie settismeni. Either party may terminate this agreement with suaty (0) ays price yaitien natice. Prepare by. ‘Office of the Dean UNIVERSITY OF SANTO TOMAS"
    },
    {
        "image": "agreement1_synth_4_aug4.png",
        "label": "agreement",
        "ocr_text": "LINVERSIDYS OF SANTO TOM 3 FACULTY OF oftee ot gis, Manis FART Esai seangunoie yeou9h MEMORANDUM OF AGRE EMENT FOR INTERNSAIE PROGRAM pate: February 04, 20: CONCERN: patueun UNIVERSE ERSHTY, and the pe FO WHORE TT MAY sg ini on tis day served to as tho “UNE nlis am hagainafter 4 This FACULTY partner, hersnattel WHEREAS, the Ul xaining acd quire students to undande practical AVERSITY offers acat of their de® to qualified atudents of 182 caved experience as Pe COMPANY agrees 19 movie intemship opportunities ockee, ee tre: professional skits #08 COmSPS ion of the mutes ovenants and agrennienis camainet in cons! cir field of study 2. 78 goademe firkages 16¢ nh practical wore experienc’ mmpatencies 3 cegan aoe) 4. Te provide saudents wl professtonel <= igchnizal oktlis end saben ns utind benefit 4. To faclitete inewtexige transter pagrTy 1. Screen and endorses qualifies euuder ide necessary se guidances HE UNIV HOMBRES OFT rT or ghsiont progress st and regutations RE PU PANY 2. Assign faculty supp ST spat to sfucent interns 4 ENS’ eluents corny saith HOS or anion Soconnetaine 2F8 SN “roverage for stusient iter searingil wok assigntion s OMPANY 1. Provide to guido and evaluate oad P Aion upon suncesal 1e8 OF THE HOST C ign workgaace SUDETVSO! SPONSIBIT ct stud canic uy 2 Sida sate working evironiert rei necoseary equipment &, IS8U ari Prenahap ratio’ 5. Provide fests Seadant portorrance xo eTkeecsty SN te a oid ct ee (1) year ror The date of sigring and may BE iy, DURATION This agree enenwers pers mutual At NERAL PRO nae shell bs reecived fo written notices crapiy with al applicable ati, pealles 29 sarly may tenn WRSIOHS B Firough emioa! disp days pr propared! by VER Office of the Bean UA"
    },
    {
        "image": "agreement1_synth_4_aug5.png",
        "label": "agreement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS. FACULTY OF ARTS aNO LETTERS (Oo ot ne Orne, Eepata Manis OPC tre wnarciunive sty nou 5% cen 2008 ser MEMORANOUM OF AGREEMENT FOR INTERNSHIP PROGRAM Dats: February 01, 2025 YO WHOM IT MAY CONCERN: [ee Hernerenaun of Karwemart is seerad lo on ths doy beeawen UNIVERSITY CF SANTO TOMAS, FACULTY OF ARTS AND LETTERS, hevainefter refered to as the “UNIVERSITY” and the participating industry Partner, herainatter relened 10 98 thw “HOST COMPANY.\" CORR LAS, the URVERSITY oft acaenic programs that are students to undergo praca! trang ord ‘on the job expurionce as part of their degree sequirements WHEREAS, ine HOST COMPANY agrees to provide intornstip opporturities to quaied stuents ofthe UNIVERSITY to enhance their arotassional ski s and «: Cepetenciey, now, THEREFORE. in consideration of te mutual covenants and agreements contained hersin, the patios opto ae follows: 1 OJecTIves 1 To provide stustnts with practical weak exparience relavant to thal eld cf sity 2. To eobonce studeoty techricat shits and prolessional competencies 3. To exteish intustry acedons linkages for mutual benatt 4 To facitate koosedge transfer hatween aca iatittions and indy entre B BESPONSIBILITIES OF THE UNIVERSITY 1. Scraun and endorse qualified studonts to the HOST COMPANY 2. Assign faculty supervisor to maniior studers progress Wi. RESPONSIBILITIES OF THE HOST COMPANY 4. Provide mesningl assignmonts aligned Presnats aariaric rogrems 2. Assign workplace supervisa to Guide ant evshaste dere perierranee 3 Provide sate wesking sewircemnert and necessary aquipmant 4 issue certticaie of completion upon succesehd imtenstip pecind 5. Provide fandback on student psdfomance to university suervisce 'V DURATION ids agrenment shail be ettective renened upon mutual agrecment of both parties V. GENERAL PROVISIONS Beth parties age to comply with ait applicable laws, cules ard rogiations Any Bsputes shait be rosoived tivough amicable setilemart Either purty may terminate this uspoement with sty (C0) days pric writien aatice Propared by Office of the Dean UNIVERSITY OF SANTG TOMAS. {or a period of ane (1} year om the dute of signing and mey be"
    },
    {
        "image": "agreement1_synth_5_aug1.png",
        "label": "agreement",
        "ocr_text": "MINDANAO STATE UNIVERSITY COWLEDE OF EDUCAT nas det Sur athe. of tne daanpurivenssy 26 2 2 2982 sane PAYMENT AGREEME! TUITION AND FEE: Date: Apel 22, 2 TO WHOM IT MAY CONCERN: js axenuted betwaen MINDANAG STA gre! the undersigned studeni oar This Payment Agmement red to as the “UNIVERSITY.” ntiquaidian, hereinatior rfewed te WHEREAS, the DEBTOR has incured 7 aod olher schoo! charges tor the Academic Yew 202 into dodges the outstanding balance and Cor payment terms and conditions parties agree to th iW, THEREFORE, th 0 926 09 representing tuition and other tees for the cures ULE The DEBTOR agrees to sete the balance aus upon signing See fg ta the following ailment: 35% of toiat yeni: 30% of total instalitnam pian’ balance due oo ot before examination 7 ATE SAYMENT er month on the unpakt balance jn the Stustant Handbook FF Non compliance with this payment ogreement mey ws 2. Norvissuance of certificate of envedtment for succeeding terns 3 of dipioms and nsctipt of Records 5 2i action te Iv, CONSEQUENCES OF NON PAYME ‘withholding of grades and scadeste r amination privileges 4. Nongieas ing amounts ject to compliance with this agreement, the DEBTOR shot nisin the folowing dt classes Acces ies and sersicas Participation ieary and laboratory privileges: afty the University Accounting Office of any agreemant shall be govemed by university poll V7. ACADEMES PRIVILEGES privileges: Attends ‘vitios and Vi. GENE chenge and Phitippina taws. sued by ice of the Dean MINDANAO STATE IEVERSITY"
    },
    {
        "image": "agreement1_synth_5_aug2.png",
        "label": "agreement",
        "ocr_text": "MINDANAO: STATE URIVERSITY 98 EDUCATION otcg 24 9 eoneret Diy, aan 66 SUE crovary ode BA PAYMENT AGREEMENT £OR TUITION AND FEES: spate: Apt 22, 2025 jo WHOM IF MAY CORDERS sent Paros 2 ongcaten DENIES Manpannd STATE UNIVERSITY COLLEGE OF EDUCATION, rep asthe “WRAVERSHTY,” art YS Me ccgnd ster otcel ged PES satice eee ‘This Pav to the UNIVERSITY for aE fees, joborstory fers. ng AS, de DEBTOR has dias schnot charges FOF RS WHEREAS, the DEBTOR cacntadges the cutarding BAERS cere eorits to wate sae obgtion secerding te tons spectied herele ow, THEREFORE, the patie 476° sete: fstontng payenest terns and conditions: rowsaceges a mstaniing of PHP 20 928. copresanting tition Vie SEBTOR na queens area DEWTOR egress to set tata belene dus open sight yal balance 1 AMOUNT Men and other fone OF ib PAYMENT SCHEDULE the shiak payment: 30% so tvs cutsanding balan onco7 tre folowing i Secor jnstalimert. 25° of toil dus on ox DEtoe final rarqants 25% oF 08 ingiatimert plat palance Gud a0 Lefore midters period Fiat pst exacinaton pert sanity Fakes to vet paves chee dates shah inet S PONT easge f B ig to igs ational SHAS ye stated ay LATE PATENT FE: seunih on te unpaid eager reserve te nt Hebe eisnce The UN ig paymen 4 agiaenant sage raault in rotinnent for a4 coming 1h ve Rarcerds 9. Lagat SoHo eth ce OE sgetificate of Si a aces TearacPk in the St fy, CONBERUENCES OF ‘Nagihalding of arases se Exclusion frat recat catstandng §y ACADEMIC PRI aenination 9 genau’: the fotiwadog sence wit is vaseenent eS BTOR shell ss unwritten SE garsicas Pat cd taenatory eevee Joject a xr an erwatied cinesas AC pibviegas: Atanas sei tos sd exaecieaRoP Library sp meron 30 pray Ay PS Uedvernity Accounting OFFIes yas bo govansed &Y YONG The DEE agin of faeces creumae “This agroomient sees Vi, GENERAL BROW! hange in nontact fee Praipgiee sgsisat by: a MINDANAO STATE URVERSITY oifica of the D"
    },
    {
        "image": "agreement1_synth_5_aug3.png",
        "label": "agreement",
        "ocr_text": "180 STATE UNIVERSHY OF EOMICAT MINE Our ce of the Daas Marayei Oy, Lnao det $i we stsnnpuntesaty acy (esa) 8 708 2002 iT AGREE! TION AND FE Data: April 22, 2028 TO WHOM (fF MAY CONCERN: LLEGE OF EDUCATION, 1, feneinaitor mefare This Payment Agmement is ou hewninatter «farmed to as the \"UNIERSITY,” aad the undersigned student/ parent gaat as the DEBTOR WHEREAS, the DEBTO aral other hss incurred fins cademin Year 22%: for ths AS. TOR neknowledges the outstanding Sstanne and com fo terms spacified aeretn; 8: HOW, THEREFORE, the paities agioe to the following payment tenis ano cond £26 08 representing tution Wing bsianoe of PHE AMOUNT OWED The DEBTOR gekncatadges an outst arid thor fees for tive cument academic pe 2 accerdiny {6 the follows stallment: 25% of tok elore feat ing bat aye upon signing Seca in ait: 35% of total balance due on or ih PAYMENT SCHEDULE The DEBTOR sgmes te setlie tre ou payment: 3% of total balane Final ies inslaiment gan: be balance due on or betore mH exarninatineg period Jon achesiuied dates shai incur a penalty chirge of 27% the right to irapese aditions! sa LL LATE PAY per movit on the unpaid balance. The UNIVERS tuciant Randionk, ith IV, CONSEQUENCES OF NON PAYMENT Nion complisnes wt Wokioiding of grades and aca corde 2. Nonissuance of (clusion fratn examination pivileg recover outstanding amounts may result iat 3 for succeeding terms 3. te iy this payment agroee Y. ACADEMIC PRIVILEGES Subject to comny tendance it entailed ¢lesses ities and examinations Littayy and inboratary gaiviiog Hg Office of any ersity poficies i GENERAL PROV JONS The DEBTOR wyre faformation oF ancial cleurmstances. This agrestert shall be governs fesuad by: Office of the Dean MINDANAO STATE UNIVERSITY"
    },
    {
        "image": "agreement1_synth_5_aug4.png",
        "label": "agreement",
        "ocr_text": "MINDANAO STATE UNIVERSITY COLLEGE OF EDUCATION fice of the Dean ‘Marawi City, Lanao del Sur office of the dean universty edu ph (903) 5 748 2082 PAYMENT AGREEMENT FOR TUITION AND FEES Date: April 22, 2025 TO WHOM IT MAY CONCERN: ‘This Payment Agreement is executed between MINDANAO STATE UNIVERSITY, COLLEGE OF EDUCATION, hereinafter referred to as the \"UNIVERSITY,\" and the undersigned student parent guardian, hereinafter referred to as the “DEBTOR” WHEREAS, the DEBTOR has incurred financial obligations to the UNIVERSITY for tuition fees, laboratory fees, and other school charges for the Academic Year 2025 2026; WHEREAS, the DEBTOR acknowledges the outstanding balance and commits to settle said obligation according to terms specified herein; NOW, THEREFORE, the parties agree to the following payment terms and conditions: AMOUNT OWED The DEBTOR acknowledges an outstanding balance of PHP 20 826 00 representing tuition and other fees for the current academic period, Il, PAYMENT SCHEDULE The DEBTOR agrees to settle the outstanding balance according to the following installment plan: Initial payment: 30% of total balance due upon signing Second installment: 35% of total balance due on or before midterm period Final installment: 35% of total balance due on or before final ‘examination period Ill, LATE PAYMENT PENALTY Failure to remit payment on scheduled dates shall incur a penalty charge of 2% per month on the unpaid balance. The UNIVERSITY reserves the right to impose additional sanctions as stated in the Student Handbook IV. CONSEQUENCES OF NON PAYMENT Non compliance with this payment agreement may result in: 1 Withholding of grades and academic records 2. Non issuance of certificate of enrollment for succeeding terms 3. Exclusion from examination privileges 4. Non telease of diploma and Transcript of Records 5. Legal action to recover outstanding amounts V. ACADEMIC PRIVILEGES Subject to compliance with this agreement, the DEBTOR shall retain the following privileges: Attendance in enrolled classes Access to university facilities and services Participation in academic activities and examinations Library and laboratory privileges VI. GENERAL PROVISIONS The DEBTOR agrees to promptly notify the University Accounting Office of any change in contact information or financial circumstances. This agreement shall be governed by university policies and Philippine laws, Issued by: Office of the Dean MINDANAO STATE UNIVERSITY"
    },
    {
        "image": "agreement1_synth_5_aug5.png",
        "label": "agreement",
        "ocr_text": "MINDANAO STATE UNIVERSITY COLLEGE OF EDUCATION Offce of the Dean Marawi City, Lanao del Sur office of the dean universty edu ph (+09 5 748 2082 PAYMENT AGREEMENT FOR TUITION AND FEES Date: April 22, 2025 TO WHOM IT MAY CONCERN: WHEREAS, the DEBTOR has incurred fi inancial obligations to the and other school charges for the Ac UNIVERSITY for tuition fees, laboratory fees, ‘ademic Year 2025 2026; nowledges the outstanding balance and commits to settle said obligation according to terms specified herein; NOW, THEREFORE, the parties agree tothe following Payment terms and conditions: AMOUNT OWED The DEBTOR acknowledges an Outstanding balance of PHP 20 826 00 representing tuition ‘and other fees for the current academic period |l. PAYMENT SCHEDULE The DEBTOR agrees to settle the Outstanding balance according to the following installment plan: Initial payment: 30% of total balance due Uupon signing Second installment: 35% of total balance due on or before midterm period Final instalment. 35% of total balance due on or before final examination petiod 'yment on scheduled dates shall incur a penalty charge of 2% Per month on the unpaid balance. The UNIVERSITY. in the Student Handbook agreement, the DEBTOR shall retain the following led classes Access to university facilities and services Patticipation in academic activites and examinations Library and laboratory privileges Issued by: Office of the Dean MINDANAO STATE UNIVERSITY"
    },
    {
        "image": "agreement1_synth_6_aug1.png",
        "label": "agreement",
        "ocr_text": "ALDARA STATE UTIVEDS PAYNE ror Hate a tees ey pNDANAG STATE URIERDITE COLE seoearcuen qardan here toy av TR ST n eaieuted bower gens the pentarsiannt MaVE RS! Aateee ont (hes Bayer pes atin to Bs 0 fees jaorainy et ae th sigetees Wo the UE! sew Aids 2M. ye (OR has ine uited Meanctid “= WHEREAS the saages For ies Aca are ether sche ava AMEREAS tne DEBTOR acemsatecigs 6 8 a Fohioweeg greens ance ow THEREFORE Soya 5a 5 OD egvecsintog fee sor catston 196 opt aca ewe pens YR ac nnewe TCH areas te yeitio the fag toh EE alee BINED ee ihaimert obs of al ean 6% NT GCAEAL PAY tanance dun ay arti ation P48 arent 3 cnagen peat ow telone, does shah net a past seuss jose akitionat va the non tee nr peel st pagmart oo nue thee arya Baan Ce Ty eared Mee oo lof OPE PAYMEDT 1 wre ot Bote tess Late BAYME Teter Sonnet ne ord acon: paveoges too: ea stray arene eaten Eastin reece out 08 grat tale she tome es Patcigwon tt ACADEME PRIVIES Prengwce oe peg Oftice tae c atiteten and re age oY an ceivevined By reat fg Vive RB TOP arene 4) GENERAL CROWS! Noseaed De LNDATIRD STATE caro of tw wen"
    },
    {
        "image": "agreement1_synth_6_aug2.png",
        "label": "agreement",
        "ocr_text": "MINDANAO STATE UNIVERSITY COLLEGE OF EDUCATION Office of ‘Marawi City, the Dean Lanao del sur Ofte ofthe dean universty edu ph (03) 89) 785138 PAYMENT. AGREEMENT Date: November 22, 2024 TO WHOM IT MAY CONCERN: This Payment Agreement is executed hereinafter referred WHEREAS, the DEBTOR ‘acknowledges the outstanding balance and c to terms specified herein: V. ACADEMIC PRIVILEGES Subject to compliance with this Privileges: Attendanc: academic activities and examinations Ubrary and ta iploma and Transcript of FOR TUITION AND FEES between MINDANAO STATE UNIVERSITY, 10 as the “UNIVERSITY,” and the undersigned student) ‘agreement, the DEBTOR in enrolled classes Access to Universi ity facilities and servici COLLEGE OF EDUCATION, Parent quardian, hereinafter referred to Iment for succeeding terms 3 Records 5. Legal action to hall retain the following '€5 Participation in boratory privileges VI. GENERAL PROVISIONS The DEBTOR 29r2e8 to promptly notify the University Accounting Office of any in contact information or financial Gicumstances. This agreement shall be governed by university policies and Philippine laws, Issued by: Office of the Dean MINDANAO STATE UNIVERSITY"
    },
    {
        "image": "agreement1_synth_6_aug3.png",
        "label": "agreement",
        "ocr_text": "MINDANAO STATE UNIVERSITY ee 03) PAYMENT AGREEMENT FOR TLATION AND FEES Date: November 22, TO WHOM IT MAY CONCERN: Ths perwinalicr ayment Agreement is exeat 196 10 as the “URIVERSHT the DEBIOR has i charges for the Academic Year to terms specified hereli, FORE, the parties agnes to the fallewing payment terms an cond MGW, THER! outstanding balance of PHP 58 245 00 representing tuitlon D The DEBTOR acknowledge academic petiot AMOUR and other tees far the lance according 1 PAYMENT SCHEDULE The DES instelinent plan: intial payment nent: 351 balance due on or netore rlvtorn petiod Final in examination period ALTY Falluve ta remit payment on scheduled dates ens incur penaliy a to impose additonal sanctions as stated hi LATE PAYMENT on the wnpaid balance. The UNE per men ip the Student Har NON PAYHENT Now compllance ath cademic iecords 2. Nerissuance of corti recover culstanding amourts V. ACADEMIC PRIVILEGES Subj ‘Attendance in enrolled clseses Access to university faci zy and laboratory priviieges zetzin ihe following ion in to compliance with this agreoment, the DEBTOR ah ies and services Patti ing ered examinations Ub ot any ity Accounting Ci poiicios by univ be gower E n contact information and Philippine laws Issued by: Oifice of the Dean MINDANAO STATE UNIVERSITY"
    },
    {
        "image": "agreement1_synth_6_aug4.png",
        "label": "agreement",
        "ocr_text": "MINDA Maruwi City, Lanao det ttica atthe doar (98) 29785198 SREEMENT FOR TUITION AND FEES Date: Noveniber 22, 204 36 the unde; NIVERS OLLEGE OF identibarentiquardian, herein igned ter referred to 22 has incurred fieancis! obligations 2 Academic Year 2024 2025, fort the oute andi other fe PAYMENT SCHE! plan: tn sstallmer th on the unpaid sdont Handbook OF NON. vd acadtemic st may result ins 1 nt for succendin sangliance with this payment ds 2. Nor issuan tifioate of enrolirn vith this agree DEBTOR to university Library and laboratory privileges ail ralalt: the following Aitendance xi services Participation in ies and examinations ing Of NERAL PROVISIONS The DEBTOR attnation or fina sity policies"
    },
    {
        "image": "agreement1_synth_6_aug5.png",
        "label": "agreement",
        "ocr_text": "MINDANAO STATE UNIVERSITY ‘COLLEGE OF EDUCATION Office of the Dean ‘Marawi City, Lanao del Sur offce of the. deanGunwersty edu ph (003) 0 970 5138 PAYMENT AGREEMENT FOR TUITION AND FEES Date: November 22, 2024 ‘TO WHOM IT MAY CONCERN: This Payment Agreement is executed between MINDANAO STATE UNIVERSITY, COLLEGE OF EDUCATION, hereinafter referred to as the “UNIVERSITY,” and the undersigned student parent guardian, hereinafter referred to as the “DEBTOR” WHEREAS, the DEBTOR has incurred financial obligations to the UNIVERSITY for tuition fees, laboratory fees, ‘and other school charges for the Academic Year 2024 2026; WHEREAS, the DEBTOR acknowledges the outstanding balance and commits to settle said obligation according to terms specified herein; NOW, THEREFORE, the parties agree to the following payment terms and conditions. |. AMOUNT OWED The DEBTOR acknowledges an outstanding balance of PHP 58 245 00 representing tuition and other fees for the current academic period. IIL PAYMENT SCHEDULE The DEBTOR agrees to settle the outstanding balance according to the following installment plan: Initial payment: 30% of total balance due upon signing Second installment: 35% of total balance due on or before midterm period Final installment: 35% of total balance due on or before final ‘examination period Il, LATE PAYMENT PENALTY Failure to remit payment on scheduled dates shall incur a penalty charge of 2% per month on the unpaid balance. The UNIVERSITY reserves the right to impose additional sanctions as stated in the Student Handbook IV. CONSEQUENCES OF NON PAYMENT Non compliance with this payment agreement may result in: 1. Withholding of grades and academic records 2. Non issuance of certificate of enrollment for succeeding terms 3 Exclusion from examination privileges 4. Non release of diploma and Transcript of Records 5. Legal action to recover outstanding amounts V. ACADEMIC PRIVILEGES Subject to compliance with this agreement, the DEBTOR shall retain the following Privileges: Attendance in enrolled classes Access to university facilities and services Participation in ‘academic activities and examinations Library and laboratory privileges VI. GENERAL PROVISIONS The DEBTOR agrees to promptly notify the University Accounting Office of any change in contact information or financial circumstances. This agreement shall be governed by university policies ‘and Philippine laws Issued by: Office of the Dean MINDANAO STATE UNIVERSITY"
    },
    {
        "image": "agreement1_synth_7_aug1.png",
        "label": "agreement",
        "ocr_text": "POLYTE: THE PHILIppy Otfce oF the Gan Sia. Mesa, fita fox of wersiy ats ph raze JORANDUM OF AGK POR INTERUSHip pine OGRAR) ter August 23, 200 TO WHOM 7 Mal CONCERN Beckum of Agreament is etad into on this day baton BUSINESS, hereinafter rei Ste ft refered to a5 the \"HOST COMPANY POLVTECHIHE the “UNIV ERS: UNVERSIY OF THE a the participatin ae EEREAS, She UMIVERSE Y otters academe prog Mejob experince as part of thelr se WHEREAS, the HOST UMIVERSITY fo eohance ti me that requirements equite students to undergo pracic, al training ant PANY agrees to provide profes mshi opsedunities te gu ed competencies nal skills ROW, THEREFO} fens withs practical ve cork exper 808 profes students\" tachni ie iSlevant to their fleid ‘al benglit 6. To establish culty eunenvise® to mn radent intems 4. #33 Provide nec ns comply with HOST OMP any otic vd insurance coverage for student intery Hegiul werk assignments aligned with ‘vide 2nd evaluate student perturmanes ‘Isoue cercate of compen to univers feedback on stademt peslomnay NERAL. PROVISIONS Both parties agree 16 coun spy wh a apps bo tesolved though amicable sottlomenn, Es pilor written notice abie laws, niles tect ithor party nay E PHILIPPINE"
    },
    {
        "image": "agreement1_synth_7_aug2.png",
        "label": "agreement",
        "ocr_text": "YTECHMIC UNIVER: SOLLEGE OF BUSINE: Office ot ie Sta. Mesa, Mani Bate: August 2 Memorendu JPPINES, CO! entered into on this day between WNESS, hersinafiar refered F referad to az the HOST COMPANY IVERSITY offers ac: fence as part of thelr degies at require st al training snd s of the hip oppertunities to quaiifi and wens contained hhenwin, the pa relevant te t dy 2. To establish industy academe linkage: institutions and industry partner RST scully suservisor te COMPANY 2 and support to studer 's rexquir Provide safe sship pstiod formate visor cctive for a period of one (1) nt of both parties, to comply with ai peat ECHNIC UNIVERSITY OF THE PHIL"
    },
    {
        "image": "agreement1_synth_7_aug3.png",
        "label": "agreement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF BUSINESS. Office ofthe Dean Sta. Mesa, Manila offceof the dean universiy edu ph (93 7 2762612 MEMORANDUM OF AGREEMENT. FOR INTERNSHIP PROGRAM Date: August 23, 2025 TO WHOM IT MAY CONCERN: This Memorandum of Agreement is entered into on this day between POLYTECHNIC UNIVERSITY OF THE PHILIPPINES, COLLEGE OF BUSINESS, hereinafter referred to as the \"UNIVERSITY,\" and the participating industry partner, hereinafter referred to as the \"HOST COMPANY.” WHEREAS, the UNIVERSITY offers academic programs that require students to undergo practical training and on the job experience as part of their degree requirements: WHEREAS, the HOST COMPANY agrees to provide intemship opportunities to qualified students of the UNIVERSITY to enhance their professional skills and competencies NOW, THEREFORE, in consideration of the mutual covenants and agreements contained herein, the parties agree as follows: |. OBJECTIVES 1. To provide students with practical work experience relevant to their field of study 2. To enhance students’ technical skills and professional competencies 3. To establish industry academe linkages for mutual benefit 4. To facilitate knowledge transfer between academic institutions and industry partners Il RESPONSIBILITIES OF THE UNIVERSITY 1. Screen and endorse qualified students to the HOST COMPANY 2. Assign faculty supervisor to monitor student progress 3. Provide necessary academic guidance and support to student interns 4. Ensure students comply with HOST COMPANY policies and regulations 5, Process required documentation and insurance coverage for student intems Ill. RESPONSIBILITIES OF THE HOST COMPANY 1. Provide meaningful work assignments aligned with students’ academic programs 2. Assign workplace supervisor to guide and evaluate student performance 3. Provide safe working environment and necessary equipment 4. Issue certificate of completion upon successful intemship period 5. Provide feedback on student performance to university supervisor IV. DURATION This agreement shall be effective for a period of one (1) year from the date of signing and may be renewed upon mutual agreement of both parties. \\V. GENERAL PROVISIONS Both parties agree to comply with all applicable laws, rules, and regulations. Any disputes shall be resolved through amicable settlement. Either party may terminate this agreement with sixty (60) days prior written notice. Prepared by: Office of the Dean POLYTECHNIC UNIVERSITY OF THE PHILIPPINES"
    },
    {
        "image": "agreement1_synth_7_aug4.png",
        "label": "agreement",
        "ocr_text": "IE PHILIPPINES COLLEGE oF /BUSINE (Office of the Dean ‘Sta. Mesa, Manila fence deanery, (83 72782012 MEMORANDUM oF AGREEMENT FOR INTERNSHIP PROGRAM Date: August 23, 2025 TO WHOM IT May CONCERN: This Memorandum of Agreement is entered into on this day between POLYTECHNIC UNIVERSITY OF THE PHILIPPINES, COLLEGE oF BUSINESS, hereinafter referred to as the IIVERSITY,* and the Participating ‘industry Partner, hereinafter feferred to as the “HOST COMPANY .* WHEREAS, the UNIVERSITY offers Rye, ic programs that “*Perience as part oftheir degree 8; WHEREAS, the HOST COMPANY agrees to provide intership opportunities to Qualified students of the UNIVERSITY to enhance thei, Professional skills and. competencies; V. GENERAL PROVISIONS Both parties agree to comply with all applicable laws, rules, and regulations. Any disputes shall be resolved through amicable settlement Either party days prior written notice. regui may terminate this agreement with sixty (60) Prepared by: Office of the Dean POLYTECHNIC UNIVERSITY oF THE PHILIPPINES"
    },
    {
        "image": "agreement1_synth_7_aug5.png",
        "label": "agreement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES: Office of the Dean ia, Mesa, Mania oftee at the dean Gpariversiy adu oh MEMORANDUM OF AGREEMES RNSHIP PROGRAM 23, 2025 Gate: Aus TQ WHOM IF MAY CONCERN: This i PHILIPPINE 9 UNIVERSOY offers academic pingra nig to undergo practical training and Serree requirements WHEREAS. cn the job exparience as part of the! NY agiees to provide i ed students of the OW, THEREFORE, ation of the sautyal covenants and agreements contained herein, the patios ith preciica’ work eievert ta their field of ompotancies 3, To estabvish industry acaten soadomie Insitutions and industry nd endorse qualified students te the HOST TIVES 4. To provide studar enhance skidents’ technical skis and professional 9 4, To facilitate knowledge transfer between 169 OF THE WUBVERSITY 1. Steen 6 OY 2. Assign faculy suparviear fo monitor student progress 3. Provide nev eSisy scale ae ee Ensure students compy with HOST COMPANY palicioe ord requteions 5 station and coverage for studant interes vidance Process renin RESPONSIBILITIES OF THE HOST COMPANY 1 Procido meaningfl work assignments @! academic programs 2 Agsign workplace super vale student performance 3. ng environment and necessary eh pketOn ON ide faodbacis on student perfcemance to university supenisor rear from tha date of sigainy and may be Provide safe workin intosnahip pediod 5. Prev nant shall be effective for a porics of one (1) 1 of bath parties. 1¥. DURATICN This renewed Uso: Hohe tas, rules, and regulations, Any inate this agreement vith shety (60) Both patties agree to comply with aft spp disputes shall ugh amicabie setttement. Either pevty may tert paicr anitten notice"
    },
    {
        "image": "agreement1_synth_8_aug1.png",
        "label": "agreement",
        "ocr_text": "UNIVERSITY OF THI PHILIPPINES MERRIE Otiew ofthe Dean LEST O. Diliman, Quezon cay etnies 9214 200 5087 sredu gh VANDUM OF AGRE: FOR INTERNSHip PROGRA FG WHOM IT May Concerts This Me COLES this day between UNIVERS sited to as the “UNIVERS Ty IST COMPANY,” WHEREAS, the UNIVERSITY offers scatiemiy On thajeb ax; ENOTES Dett ef their 6 the HOST UNIVERSITY to enh, Drogtarres that (ot reauircmante. pice te nS to eneerge practices rising and SOMPANY aaiees to provide items! i CPpetintiss to qualities students of the onal skis and compstenciess E Soe 8 consideration of the mutual covaane agree as Follows, and uareorrsats containd ersin, the Patties OBJECTIVES 1. Te provide 9 enhance suxfents’ tect ‘Mutual beretit 4 To fac tixients with pre ‘iis ane orate te knowledges al Work experience reevant :2! compsisnct itanster betwen acd fold of study 2 Te 3. Teens academe linkages for BILINES OF VERSITY i COMPANY 2. Assign faculty sunorvinor te rent en ‘9 Student interns 4. Ensure students rentation and in Sen and endorse lor Shudent progress 3 comply with HOST COMPA, sursave covers, Stuilliod stutemts to the HOST IY Bcadermic cuiclane 18 and reguiations Process required secur Saningt work assiany $0 guide sng 4. Is2u0 cxstii 8 fey me igned witn, ident performance 3. -ai@ of completisn upon success \"iverstiy suoersiso, nd NeCeSRaTy equivme: feedback on student nerfouman SPOS of ae} year fa he se of signing td me wy be ERAL PROVISICy Sisputes shall be re: ay8 orto writien notica, 4 apptcsble laws, nites. ancl Fegulations Any 'y May temninale thig SPCC with sinty (62)"
    },
    {
        "image": "agreement1_synth_8_aug2.png",
        "label": "agreement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES COLLEGE OF ENCINEERING Oftion of the Coen Ditiman, Guezon City Pn ot te dean Qarevornny acu om en ae83 s007 MEMORANDUM OF AGREEMENT FOR INTERNSHIP PROGRAM Data: Noweinber 10, 2024 TO VIHOM IT MAY CONCERN: Thie Memorandum of Agresrnent is entered into un this day between UNIVERSITY OF THE PHILIPPINES, COLLEGE OF ENGINEERING, hareinalter referred to as the “UNIVERSITY,” and the participating industry cartrer, harvinaites ceferrad to as tho “HOST COMPANY.” WHEREAS, the UNIVERSITY offers academic programs that require students to urdoryo practical ieining and onthe jb experecce as pat of their dogree requirements. YRHEREAS. the HOST COMPANY agrees to provide intemship opperiunitins to qualified students of the URIVERS TY to eniunca their protessicnai skilis and competencion, NOW, THEREFORE, In considerstion of the mutusi covenants and agreements cantained hernia, the parties agree a2 foliows: 1 OBJECTIVES 1. To provide students with practical work expesience relevant to thelt field of sundy 2. To enhance studens’ technical skits and orofessional competencies 3 To eatablish industry academe linkages for rtuat Lenetit To fecititate knowledge transiuc betwaen academic institutions ad industry geetnars tl RESPONSIBILITIES OF THE UNIVERSITY 1. Screen and endorse unified students to the HOST COMPANY 2. Assign tacully supervisor to monitor student pregress 3. Provide nectssary academic guidance ‘and support to student intemss 4. Ensure students comply with HOST COMPANY palicies and regulations 6 ‘Process required documentation and insurance coverage for student inteins: Ii RESPONSISILITIES OF THE HOST COMPANY 4. Provide mosringld werk assignments aiigned with students’ seademic programs 2. Assign workplace supervisor to gue and evaluate stuaam performance 3 Provide sole working environment and necessary cauipmurt 4, issue certificate of completion upon successtul Intemship perlad 5. Provide teedback on student performance to university superviser 1V. DURATION This agmamont shalt bs effective for a period of one (1) year from the date of signing and may ba reevawed upon triAisal agreement of both pasties V. GENERAL PROVISIONS Both parties agree to comply with ail spplicabie imws, rutes, and regulations. Any dispules shut! be recived though amicable settioment. Either pariy may terminate this agreement with sixty (60) days prior writter, notice Prepared ty. Office of the Dean UNIVERSITY OF THE PHILIPPINES"
    },
    {
        "image": "agreement1_synth_8_aug3.png",
        "label": "agreement",
        "ocr_text": "UNIVERSITY OF THE PHRIPPINES COLLEGE OF ROMERO one te Oran Diliman, Quezon City tea ch in canteens #8 (oan e zese087 MEMORANDUM OF AGREEMENT TOR INTERNSHIP PROGRAM Date: Newember 10, 2024 TO WHOM IT MAY CONCERN, roe near cetoe iste dy btn EVERY OF Te PST COLLEGE OF TAME ERING, tarenalet refered to 08 the “UNIVERSITY” ‘ond the pasticinating incaastry parti, never cofered to me the “HOST COMPANY undergo practical training and WHEREAS, the UMIVERSITY otters academic programs that require studarss 19 ontve pb eapotence at part cf tel degree requremerts, cna, wa Host COMPA aos evs raat oppure oak wes Me TREVERSITY to erence thei professions skits and comeetenc e8; HOW, INEREFORE, in ceneinrten of the et covenants ad agrnmasts contain Pea. Me FOS gree as foltows 1 OBJECTIVES t rope eusans ah paca ork expasenca relevant to th sid of 34 to cones students’ tachnical sis and pctesicral competencies 2 To establish indusiry acarten frkagas for anual benefit ‘riccanate hnewteige transfer ites acai insteions wn Wusiy pains ft. RESPONSIBILITIES OF THE UNIVERSITY 1 Screen and endurse qualified students to the HOST COMPANY 2. Assign faculty supervisar to moni student progress 3 Provide nacasaary ond support to student interns 4, eeon stagenas comely with HOST COMPANY policies and regulations 5 Pacers requred documentaion ze insurers coverage for studert inter intemsbip pastod 5. Srovide femdbock an student performance Vv. DURATION This green sai be etective fo apart of co (1) you rom the dat of siging arc may Be tonewed upon tutual agpeemant of toth perias, phy with ot aggticable laws, niles, ane V. GENERAL PROVISIONS Both parties agree to corr regulations. Any dioputes hell be resolved through reatiiorvont. Either porty may terminate this agreement with sixty (60) ays pier weitton nelle Prepared by: Office of the Dean UOVERSITY OF THE PHILIPPINES:"
    },
    {
        "image": "agreement1_synth_8_aug4.png",
        "label": "agreement",
        "ocr_text": "INES Stiman, Quezon city MEMORARDi ing OF 4GR FOR INTERNSHID PROGRAM November 19, 2024 To wHons ry HAY CONCERN, This Memorandums of Acreemont COLLEGE OF ENG} ween UNIVERSE! UNIVERSITY,~ AS the HOST Ce 38 IPANY agtees t0 pra thet: profess: i opportuni 18S qualified stucen of the J compote NOW, THERE EE agree as fol sideration of tha mutual ven; lows. eotents contalsad her the parties pactical work experience relevant ta hel eid of ox ¥2 To knowledge irasst for S OF y THE UNIVERSITY Screar Faculty supervisor to monitor am i intems 4 Ey ure students \"ation and msurance cover YY 1. Provide mean place supenis ‘rontrest apy necessary eauipmnen ide feecitack cn student pes gful work ass te guide and ‘ate working anv of signing and may bs CYISIONS Bath paities Fah all epetinoble ws. rules. and regulations Any Solved thiauah amicable batty may terminate 1 agreement with sixty Ofte of the Ui EBS: HILPRINES"
    },
    {
        "image": "agreement1_synth_8_aug5.png",
        "label": "agreement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES COLLEGE OF ENGINEERING Office ofthe Dean Diliman, Quezon city office. of the dean @unwversty edu ph (+03) 4203 5007 MEMORANDUM OF AGREEMENT FOR INTERNSHIP PROGRAM Date: November 10, 2024 TO WHOM IT MAY CONCERN: This Memorandum of Agreement is entered into on this day between UNIVERSITY OF THE PHILIPPINES, COLLEGE OF ENGINEERING, hereinafter referred to as the \"UNIVERSITY,\" and the participating industry Partner, hereinafter referred to as the \"HOST COMPANY.\" WHEREAS, the UNIVERSITY offers academic programs that require students to undergo practical training and on the job experience as part of their degree requirements; WHEREAS, the HOST COMPANY agrees to provide internship opportunities to qualified students of the UNIVERSITY to enhance their professional skills and competencies; NOW, THEREFORE, in consideration of the mutual covenants and agreements contained herein, the parties agree as follows: |. OBJECTIVES 1. To provide students with practical work experience relevant to their field of study 2. To enhance students’ technical skills and professional competencies 3. To establish industry academe linkages for mutual benefit 4. To facilitate knowledge transfer between academic institutions and industry partners |. RESPONSIBILITIES OF THE UNIVERSITY 1, Screen and endorse qualified students to the HOST COMPANY 2. Assign faculty supervisor to monitor student progress 3. Provide necessary academic guidance and support to student interns 4. Ensure students comply with HOST COMPANY policies and regulations 5. Process required documentation and insurance coverage for student intems Ill. RESPONSIBILITIES OF THE HOST COMPANY 1. Provide meaningful work assignments aligned with students’ academic programs 2. Assign workplace supervisor to guide and evaluate student performance 3. Provide safe working environment and necessary equipment 4. Issue certificate of completion upon successful internship period 5. Provide feedback on student performance to university supervisor IV. DURATION This agreement shall be effective for a period of one (1) year from the date of signing and may be renewed upon mutual agreement of both parties. V. GENERAL PROVISIONS Both parties agree to comply with all applicable laws, rules, and regulations. Any disputes shall be resolved through amicable settlement. Either party may terminate this agreement with sixty (60) days prior written notice. Prepared by: Office of the Dean UNIVERSITY OF THE PHILIPPINES"
    },
    {
        "image": "agreement1_synth_9_aug1.png",
        "label": "agreement",
        "ocr_text": "DE LA SALLE UNIVERSITY COWLEGE OF COMPUTER STUDES Offs of he Caan Tait Avenue, Manis offen ote soanewarsty ets 9h coed Seep o732 MEMORANDUM OF AGREEMENT “FOR INTERNSHIP PROGRAM Dete: December 19, 2028 TO WHOM IT MAY CONCERN: “This Metnocanaum of Agreeerint is entered into on this dey between DE LA SALLE UNIVERSITY, COLLEGE OF COMPUTER STUDIES, hereinafter ralerrad to 33 the \"UNIVERSITY,\" ond the participating indusiry pastnor, hersinstier ssferred to a the \"HOST COMPANY.” WHEREAS, the UNIVERSITY offers ecadomic programs that recite students to undarge practical taining and onthe job experience as part of their degree roruiromens; WHEREAS, the HOST COMPANY agrens lo provide intemship opportunities to qualified sludents of ths UNIVERSITY to enhance thelr professionai skills and competencies, NOW, THEREFORE, in consiceralicn of the mutual covenants and agrsemants containud herein, the parties agree as follows: 1. OBJECTIVES 1. To provide students with oractical wack experiance relevait tu their fiekd of study 2. To enhance studunts’ techiical skilis and professions! competencies 3. To establish incustry scademe Enkages for niutual benefit 4, To facilitate knowledge transter between scadenic institutions and industry partners: 1, RESPONSIBILITIES OF THE UNIVERSITY 1 Scien and andorse qualified students to the HOST COMPANY 2. Assign fscutty supervisor to moniter stuart progress 3. Provide necsssary academic guidance acd support to student intems 4. Ensure students comply with HOST COMPANY poticies and reguitions Process required documentation and insurance coverage for student interns iil, RESPONSIBILITIES OF THE HOST COMPANY 1. Provide mescingtu! work assignments aligned with students’ academic programs 2. Assign workplace superviser to guide and evaluate student performance 3. Provide sie working environment and necessary eouiprant 4, Issue certificate of competion upon successful Internship period 5. Provide feedteck on student performance to university supervisor iV. DURATION This agreement shall be effective for a partod of one (13 year from the date of signing and may be received upon mutual agreement of both parties. V_CENERAL PROVISIONS Both parties agres to comply with all applicable iaws, rules, and reguistions. Any diepxtes shall be resolved thrcugh amiceblo settiement. Either party may terminate thas agreument wih sixty (€0) days peor written notics Prapared by Office of the Dasa DE LA SALLE UNIVERSITY."
    },
    {
        "image": "agreement1_synth_9_aug2.png",
        "label": "agreement",
        "ocr_text": "DE LA SALLE UNIVERSIT Yom Averwa, anita ‘foe ot ts. damn EMORANDUM OF AGE FOR INTERNSHIP PROG December 10, 2024 YO WHOM IT MAY CONCERN This Wamoranduin of Agreement is entered into ort tp COMPUTER STUDIES, hevoinalter referad io aa the hereinafter refered te os the \"HOST COMPANY.” WHEREAS, the UNIVERSITY offors arademte forthe ob experiance a part of their degy UNIVERSITY, COLLEGE oF ‘paling ieetuaty parton, Pronrems that require siudente ta unchavg pr reguiements WHEREAS, the HOST COMPANY sagreas to provide intern: NIVERSITY to anhance their professional 4k: NOW, THEREFORE, ractica! training erat Sppertunities to quatitieed etudonts of tha cles. ite and compat Sonsiertion of tie mulual covererts en agreements contained heewin, the partion agtss as follows ORJECTIVES ants with practicad wack experience relevant to thet fivid ef study 2. To and protestionsl competencies 3 To entabligh ine vate knowledge transfer betwesa acaiemtc inetitulicns and H. RESPONSISILITIES OF THE UNeVEE COMPANY 2, Assign faculty cuparvisar to morites studert progress and support io aiudent inteme 4. Ensure students comply wi Process required dozuinentation ard insurance Provide necessary sradem! HOST Cone Sovstege for stu v intearss {i RESPONSIBRITHE students! Provide safe ‘sinatp period Prowl f 1 Provide Wms 2 Assign workplace supervisor to guide onimet and necessary eeuipns spon SurceSsfut esback ‘siudtent performance to university suparsisor WV. DURATION This agement shal be effee: tive for a period renewed upon mutual eguse nl of beth parties and nay he nations age L PROVISIONS Beth ps cable laws, mikes. and seguiations Any resolv ‘went. Elthor party eiay ternsnate this agraement vith sivty (60)"
    },
    {
        "image": "agreement1_synth_9_aug3.png",
        "label": "agreement",
        "ocr_text": "DE LA SALLE UNIVERSITY ‘COLLEGE OF COMPUTER STUDIES. Office of he Dean Taft Avenue, Manila ‘oftce of he deangunwersty ou om (+03) 5208 0732 MEMORANDUM OF AGREEMENT FOR INTERNSHIP PROGRAM Date: December 10, 2024 TO WHOM IT MAY CONCERN: This Memorandum of Agreement is entered into on this day between DE LA SALLE UNIVERSITY, COLLEGE OF COMPUTER STUDIES, hereinafter referred to as the “UNIVERSITY.” and the participating industry partner, hereinafter referred to as the HOST COMPANY WHEREAS, the UNIVERSITY offers academic programs that require students to undergo practical training and on the job experience as part of their degree requirements; WHEREAS, the HOST COMPANY agrees to provide intership opportunities to qualified students of the UNIVERSITY to enhance their professional skills and competencies; NOW, THEREFORE, in consideration of the mutual covenants and agreements contained herein, the parties agree as follows |. OBJECTIVES 1. To provide students with practical work experience relevant to their field of study 2. To enhance students’ technical skills and professional competencies 3. To establish industry academe linkages for ‘mutual benefit 4. To facilitate knowledge transfer between academic institutions and industry partners Il, RESPONSIBILITIES OF THE UNIVERSITY 1. Screen and endorse qualified students to the HOST COMPANY 2. Assign faculty supervisor to monitor student progress 3. Provide necessary academic guidance ‘and support to student intems 4. Ensure students comply with HOST COMPANY policies and regulations 5. Process required documentation and insurance coverage for student intems Ml, RESPONSIBILITIES OF THE HOST COMPANY 1. Provide meaningful work assignments aligned with internship period 5. Provide feedback on student performance to university supervisor IV. DURATION This agreement shall be effective for a period of one (1) year from the date of signing and may be renewed upon mutual agreement of both parties. V. GENERAL PROVISIONS Both parties agree to comply with all applicable laws, rules, and reguiations. Any disputes shall be resolved through amicable settlement. Either party may terminate this agreement with sixty (60) days prior written notice. Prepared by: Office of the Dean DE LA SALLE UNIVERSITY"
    },
    {
        "image": "agreement1_synth_9_aug4.png",
        "label": "agreement",
        "ocr_text": "DE LA SALLE UNIVERSITY COLLEGE OF COMPUTER STUDIES Office ofthe Dean Taft Avenue, Manila office ofthe dean universiy edu ph (+03) 8 008 0732 MEMORANDUM OF AGREEMENT. FOR INTERNSHIP PROGRAM Date: December 10, 2024 TO WHOM IT MAY CONCERN: This Memorandum of Agreement is entered into on this day between DE LA SALLE UNIVERSITY, COLLEGE OF COMPUTER STUDIES, hereinafter referred to as the \"UNIVERSITY,\" and the participating industry partner, hereinafter referred to as the \"HOST COMPANY.” WHEREAS, the UNIVERSITY offers academic programs that require students to undergo practical training and ‘on the job experience as part of their degree requirements: WHEREAS, the HOST COMPANY agrees to provide intemship opportunities to qualified students of the UNIVERSITY to enhance their professional skills and competencies NOW, THEREFORE, in consideration of the mutual covenants and agreements contained herein, the parties agree as follows: |. OBJECTIVES 1. To provide students with practical work experience relevant to their field of study 2. To enhance students’ technical skills and professional competencies 3. To establish industry academe linkages for mutual benefit 4. To facilitate knowledge transfer between academic institutions and industry partners Il RESPONSIBILITIES OF THE UNIVERSITY 1. Screen and endorse qualified students to the HOST COMPANY 2. Assign faculty supervisor to monitor student progress 3. Provide necessary academic guidance and support to student interns 4. Ensure students comply with HOST COMPANY policies and regulations 5. Process required documentation and insurance coverage for student intems Ill. RESPONSIBILITIES OF THE HOST COMPANY 1. Provide meaningful work assignments aligned with students’ academic programs 2. Assign workplace supervisor to guide and evaluate student performance 3. Provide safe working environment and necessary equipment 4. Issue certificate of completion upon successful intemship period 5. Provide feedback on student performance to university supervisor IV. DURATION This agreement shall be effective for a period of one (1) year from the date of signing and may be renewed upon mutual agreement of both parties. V. GENERAL PROVISIONS Both parties agree to comply with all applicable laws, rules, and regulations. Any disputes shall be resolved through amicable settlement. Either party may terminate this agreement with sixty (60) days prior written notice. Prepared by: Office of the Dean DE LA SALLE UNIVERSITY"
    },
    {
        "image": "agreement1_synth_9_aug5.png",
        "label": "agreement",
        "ocr_text": "DE LA SALLE UNIVERSITY OF COMMUTE SIMI hi MORANOUR OF AGRE CME POR UTERESHP PROG December 10 2024 TO WHOKS T May CONCERI sity coue Incasstey vartnes ie fas PUTER STE on tested t ereinattes /eterrd to ANY iC Re onthe job evpivtas wre bes raring ae SAT cfons aeadenic grocrarss “hal veauite starr part of there deg: on students WHERE RS. the HOST COMPANY agnas te pune Intanistir cepts to quan us UY 20 er are 9 then proses eid Comparer ret NOs THERE cosigeration of tha mutuci covenants ang agremants Contamed Pergas tp agres iis foitoas anes reisean’ to they field of stad onipeiercies 3 Fevestabhsn nalustty academe link ages tor inet Screen are enderse quiified stuatenite t2 the MOST MORIN policies ope regulate 5 gtirdent interns 4 Ensae Proc ans requeod dacurneriainn ane nsuranece Coe tage 16) dite meamingghad work POPSIBILITIE S OF THE HOST COMBAT 5 Asien vacwohar@ suome sce 20 juice ai Ssun cet! oyerety Wupeneow stalents academic programs 2 wextugta stucert peaicern a “anno Ata se teedinn: og Studer perierTi ay ate of RDN en ucatt succes or ary ER! Piovige sate working #7 nS Pre ae agreamart shee ioe a pat of obs {1 yest itor tho abs of signing ast may be v uN Lowe pdes anc reg S Froth pares agree to comps V GENERAL PROV cube settiament Edie” parly cisnuies shalt pe esuived oo day s 28ro\" ween HOLT seal Office of the Test"
    },
    {
        "image": "agreement2_synth_11_aug1.png",
        "label": "agreement",
        "ocr_text": "Ateneo de Manila University Office of Guidance and Counseling INTERNSHIP. katpunan Avenue AGREEMENT Loyola Heights, Quezon City 1108 AY. 2025 2026 TERM ist Sem Signed this November 05, 2025 Katherine Silva os"
    },
    {
        "image": "agreement2_synth_11_aug2.png",
        "label": "agreement",
        "ocr_text": "4 NTERNSHIP AGREEMENT 202 TERM ist ode Manila University, hereby wiles into ths inter fessor a! standards dati ent to To the University iggovwilh iy prograsy of ame. and angus 2 wi! be evaluate: aining period t coment inreughout ey inde ss: on competen: the univeisity a adhere to atl company poliees, vias nllally of propaetary msormaton ano ship petion. anree is fotlow workntay nay DE uncompensated oF provide a age atc adem cradit. aats. a fours ana s hacwasary for {lease both fe tin 2 regula 8 eptin cases"
    },
    {
        "image": "agreement2_synth_11_aug3.png",
        "label": "agreement",
        "ocr_text": "Ateneo de Manila University Office of Guidance and Counseling INTERNSHIP Katipunan Avenue AGREEMENT Loyola Heights, Quezon City 1108 AY, 2025 2026 TERM 1st Sem |: Katherine Siva, a student of Ateneo de Manila University, hereby enter into this intemship Agreement to undertake on the job training as partial fulfillment of my degree requirements. acknowledge my responsibilities and commit to uphold professional standards during my internship period. To the University: agree to comply with all academic re quirements and guidelines set forth by the university regarding my internship. will maintain regular com munication with my faculty supervisor, submit required reports and Gecumentation on time, and ensure that my intemship activites align with my program of study. understand {hat my performance will be evaluated based on competencies demonstrated and outputs produced during the traning period. |committo represent the university professionally and maintain academic integrity throughout my internship. To the Host Company: committo adhere to all company policies, rules, and regulations during my internship period. will maintain confidentiality of proprietary information and trade secrets. agree to follow workplace safety protocols and ress code requirements. will conduct myself professionally and respectilly toward supervisors, Co workers, and clients. understand that my internship may be terminated if violate company policies or fal {0 meet performance standards. will notty both the company and university immediately of any ‘circumstances that may affect my internship. l acknowledge that lam not entitled to regular employee benefits unless explicity provided by the company, understand that this internship is primarily for educational purposes and may be uncompensated or provide a training allowance at the company s discretion. acknowledge that completion of required hours and satisfactory performance evaluation are necessary for academic credit. agree that this intemship does not ‘guarantee regular employment. release both the university and host company ftom liability for accidents or Injuries except in cases of gross negligence. Ihave read and understood all terms of this agreement. Signed this November 05 2025 Katherine"
    },
    {
        "image": "agreement2_synth_11_aug4.png",
        "label": "agreement",
        "ocr_text": "Alanes de Manta University ‘Othoa ot Guntante ane Coutts INTERNSHIP Kekpunan Auwrse AGREEMENT Loyola Heights, Cosass Gay 1198 AY, Domsgue TERR ist Syn Katherine Silva, a stusentaf Abe ds Manita University, hereby eres inte this inleseship Agreoment ty ‘ondarinks onthe job taining 22 Parti Autihnent of my degree requirements, ‘Aacknowiadge my responsibivtien and comet to uphold professional standands dunny my intornsnip parent Te the University 2 ages te conmpay arth 29 scamernic eequiromants 3nd quuidolines sat fut by the university sagansing my internship, {wil maintain requtor communication with ry teully superciese, gubani required reports and cumentation on fone, and ensue that my inicinghre aceite align wk my program of eady. (understand pty pertomiance wil be ssaiuetad based on competencies demansirand ard outputs produces aurieg the taleing pene. comme ts represent the unawerny prokestionaty are eaniniain academic intagrey aaroaghoul ay sain Too the Hast Company: camfidenttaaty 0 chase code raquirares rrsil te adore to alt company patici s, rules, and raguka senog. Hl maintain prnpnetary infarination and trade sects, f agree to toitow warkptace solely prokorols and {ef consucl myself prcteseronstly and resaecttlly arses supervisors, coneurkers, and clients, Condentand that my mmemnship may be terminated if victale company po 0 meot performance sisnters tH niofy Both me company and univecwity immadiataly of any Sroumratanices tat may affech my intarnstup, [acknawiedge that Las: not ented te equine emipiayes benelts unless exphiclly proved by tia company, 8s oF 8 tusdersiaed diel this inlernahip i primatily for educations! purposes and onay be uncompensated or prowde fraining altoarance at he companys discretion, Jackaowiedge that cnepiation of eaquitad nouis and Sanslacnyy pariaemange evaivabon are necesniay for acanemic credit. sqre9 that this inemanap dows te guszanive eaguist emplay vem, reinase bath the university ana hist company from Nabilly for accidents ar Ingres excent is cases of giowy nagiiyance. {fave tad and ungerstscd aff tertns ofthis agraarnent Signed this Hevember 15, B26 Katharine Silva"
    },
    {
        "image": "agreement2_synth_11_aug5.png",
        "label": "agreement",
        "ocr_text": "poones de Mania unre sy INTERNSHIP warpunse baer AGREEMENT erty sy 2s sp ancoag ce Manda it Pcp angren youre Te RS namerne Sve 6 stU0e nse teniane OFT FAN EUOTT 6 ree ed COnPATH! WOMB TOME 2 panei te Jencnuna! SaretarZ OLN ce unwvanty tegatdi 5M arate by? a reqated obs ae mye mequremerita and qe cons oth wt ae end eseure rainy wHMNE ATT? Meagan oahu NaS owes fag eras moet er De eee V repasantitee Lnteernty ses ras set muir sound TE Sryree 101d wR ae TY arts aggonte He as COMO TH tase Seem amas Mae opraetans ameren gta Seas: coor img emanity bat 8S wet rye Obese: Te wernt BNE HRMS TUNE Eteriae 79 met pertarmance Sat born mes omeae ee aba ees Fe internat RRnON MATE Fi eraoes marty Ny Bie ORIN ctaty pward 6 joeeser ah rea afock prowat euavors eerne edge Det wea serene we Teese prance evant rent ie gates tony oe race raga aT uaa’ cr unes exces"
    },
    {
        "image": "agreement2_synth_12_aug1.png",
        "label": "agreement",
        "ocr_text": "y of Santo Tomas Cates Reveiooment Centar PRACTICUM AGREEMENT 2 Bou ae i TERP yy 3. Joahua Ray, rolled ine Teackor Education ‘commit to tutti at requirennents arid responsibilities asac importance ef mis expece eons. agian at Uni F8ity Of Bann Tamas, heres ath miy teaching practicum, jurdiersta Wee in my professional devsiop nent anu pledge to manta he highest stangards of To the Sagroe to allend al! required practicum orientaions and seminars, wit ai vith thy aniversity supersisct and promptly vspast any conc commit ty suber ait requited dacumerteten Incudiag essen plans. aatly reftection journdis accardiag io spated seas ove miy teaching compaiencies. |understand t Faliog feachar and university supervisor n eeguiar communicates 9 oT Issues at ariss during my practicum. To the Cooperating Schoo! Seotinitte obs regular ad regula eamnpreh fecutty meatings. ans cooperating teach cellvery, dassroom fessional condhict and anpearance at alt mes. bwill anive punctuelly and maintain conding the agioed schedule. anree 'o follow al schoo! policiws, emeatures, 0 iniain confidentiality af siadestintormaton ane rexords, pare vs essen pigns and instructional mak ely participate in cineersom acivives, hoo! programs as appingviate. (ages to sez guidance ard me: tram my tungarstand inst , Weatruatonat nageniont, ae ass adenutand that traching macticum is 2 erscial compan her preperation program! and requires canpmiment ana dedicstion. Lacwowiedge tal my performance will siunificantly Hngact my professional ne aliyibility for aching ficensurn. ages that unwaties er vistation of Riofensional ethics may result wr failure and delay of giaduaton, (understand that! am axpecied ty Hemonsbate prot 3 bes Sigeed this November Joshua Ray"
    },
    {
        "image": "agreement2_synth_12_aug2.png",
        "label": "agreement",
        "ocr_text": "Univer Sly Of Sanig Tomas Career Devaispment Center PRACTICUM Fspaha Boutevare AGREEN Sampaioc, Manda 1615 AY. 2b 2005 {sshus Ray, a stuaent an: Commit to fait a poze edt the Teacher H guiremeni OF this experience Sescaton Prograz: at nnarsity of Sante Yom: 8 ane saponsbiltes aesociatas it ny feaching practicum 1 MY BrOteSSianst ce vetooment ang Peg ts estat festand the 18 highest a Yo the University PER 19 ators 2 ewe nts my ws on stactour orentatons ‘ivensty superasar o semnirass Fy, i mawrisin regular communication ind Brompty repset any concerns ng SSu0s that atise during my prackcurn committe siti mentation iocivaing iesaon plans, a RE caReton, jour ng impres Pry Compersting teacher 19 he SOSciHes death Pe reCOds, absen, 88 sill sect fee thc eonstructy Wa that my tek grade wii Ds nasa on ANCE Fei oly ana wrark to relations fom bed: ict university sapere the Cooperating Beto BS appearanes af a) itanssance are i tes ‘el sesive punctuaity snc maintain Mf 29r089 echedule agree in tute af Schoo! policies, oraterturas ati aioe twit maintain cantitonbante Studtunt ntermation and recaes, te comoremensive tens SN DANS aa Kast @8, and exis eg teaches. Funde: Slassroem marci HOPI msteriats typ a prowtams as apseoonate acess oy at0eB Guidance an 2 {ond thati must demonstete compeeine te lessor Ment and assessment eehiaiy lunderstand that teachina gractesin i full commibaerst ane dedicat 8 4 chicial conan Sho ty teacher orepacsben program ane recuies eaiton. acknowieage tat my pertorman til sianincanty inn set Feasiness ang etigiy ‘aching ticensire, jagres thal BrOfessicnsi ethics rc eta ‘watakon of pected ty Wheactier at MSALSACIOTY partemrance y 2! Ba9u81105, Leesorstana Mat Lam oy ocensod tracers aesnite bang a singe telus ana sassy BVIOT BPR Cted of demanstate ry eSaio0e! beh"
    },
    {
        "image": "agreement2_synth_12_aug3.png",
        "label": "agreement",
        "ocr_text": "coms cba pratestona! cOnGuCl a Mey aaceae. (age w OSC a contagraaty oF apoarance atop tones. tet naoematon ind recone. VOT eaterats. «wil acesy gartonate 2 Square and mocietship OM My Teempeience i vesson panning, nstchon a crociat compatient of iy wach ‘rat my partormance wt serve punctusty ar moi school pouicses Teagan as prepare precudures. od"
    },
    {
        "image": "agreement2_synth_12_aug4.png",
        "label": "agreement",
        "ocr_text": "university of Sants Tomas PRACTICUM 1 Development Gants oar Egpala Bovievate! AGREEMENT Sampaion. Manila 4048 AY, 2026 2025 TERM Ihsan sn Program at University of Santo Temas, Neneh sa wih eng weaching practicum. (underside “age to maintain te hughestsianda rolled in the T ‘ang responsi cofessional daveiorment ang 7 of goshua Ray, a stidea! er egnunt to fat al sengutrem importance oi thin experience condita. wii snaintain ceguiar communicalion veagaens or issues tnatarise dung my practicum es plane, deity te recto, ODATNaTIN FePOTS ceil sroaptieentace coneinacarely and Werk raged on exaiuations froma bath agree ts attra all roquied prackzum ovens semrinart ersity Supenea! &! 4 dead understand Evat my finat grade wal pervs jection jour aching compete Ene university ang improve my my 070 Fo the Coops ai ties. wil ative pane vr foto al genoa poigies, procedures, 8h draconds 17am nceerve professional consiet and appearance at rording to tha agreed vehedule. 'agree .grtialty of suutent (gona! materials. 199 jate, 1agree rate eaenpanenet Fournanilta wi esainitein contin nai jensen plans and instr vrbeting®, ated Schoo DFOgraThs 98 aypropTt ‘understand that muat dem gement, and asssssmet doiivery, aration program and requsas stony professional ching practicum 8 3 2 acknawredsie te senmure. pagtae Hat was tunaerstand thal fistatory 0 renainess and stigibi professional ainics may rektt in ait y demanatrata professions! expered of gygned this November 06, 2025"
    },
    {
        "image": "agreement2_synth_12_aug5.png",
        "label": "agreement",
        "ocr_text": "University of Sante Toms Gareer Di felowmnant 0% PRACTICUM or, Banta 1015 Sany 2 hai alt veauiremments and responsibii rat pation Pragrars 8! University of Santo Torias, nereby 1 with my teaching ov lunderstand de To the University Tagree to alfend alt required practioum eneniatons aca eet my sar and jromplly report any voroonit to suibrag alt required sacumentabon and rote Ing fo specifi prove my 78 ning Teacher 2 6 the Couperating Schoo! agus slaps that understand that 9 ictal oom full comimiimentsind decheation. tacknowledge that reagines prote flue and delay of graduation. etnon jpensed leachors desuite caing a"
    },
    {
        "image": "agreement2_synth_13_aug1.png",
        "label": "agreement",
        "ocr_text": "University of Santo Tomas Carser Devetopineni Cer PRACTICUM Espatia Boulevars AGREEMENT AN, 2oze20ar TERM Asidey Lucas, 2 stunent enrolled ia the Teacher ‘ooanit to full att requirements ane respor mportance ofthis experiance in conduct Education Program at University of Sante sibiiiew associated with my iarhing pragticwn dun *y piotessianar development anc pedge to maint, 2aS, hocohy deruand ihe 81 standards 9 To the Us versity 126 to attend ait required pra wath ny uateaisity suparsi commit fo susan alt seal and reRsction jour otientations ane seminars, Fait cr anki promptly report ary fegular coromtceation thatanies duieg my prachcum. 4 documentation including lesson plans, daly time wcacs, cassia ais accucding fo specifiag daadtines, init accept feedback constructs poles. Cunderstand that sty tal grads wit be based on 6 ing leacher anc university super aveports, work Ons Yam beth Yo the Cooperating Scheck i suinnutte observa professional conduct and any regular 19 1 the gions schedule 1 all fegulations. will inaintain conlidenhalty of stader saiuprehensive tessen pats and inebuctional mat acuity meetings, ecogarating te: eel 20! policies, procedvies, az ‘information and records, Leonie ie prepay a s. bail aclively perticipats in Lunaeesta it tat teaching practicu, moonent of my teacher preparation pragrem and requires niiment and dedicat isiige that my pertormance will skgnficarily inpact ny professional eaciness and eligibity eure 1 aqtee thal unsaNstacory perfomance oF viviabin of broiessional ethics may rasuit in faliure and delay of graduation |ungarste nat lam expected to omanstrate orofessional bet Wing 2 student lensher vor expected officen: 9 eachers des ner 05, 2025"
    },
    {
        "image": "agreement2_synth_13_aug2.png",
        "label": "agreement",
        "ocr_text": "owiedge hernat fy teacher pepsraton program and requires {ull commitment and dedication. /my performance significant impact my professional feadiness and eligibility for licensure agree that, 0 Violation of Gomoneenel eiics may result in falure and delay of preaecae ‘understand that am expected to demonstrate, ‘[7Pectod ofticensed teachers despie being a sudent inser”"
    },
    {
        "image": "agreement2_synth_13_aug3.png",
        "label": "agreement",
        "ocr_text": "sity of Santo Tomas PRACTICUM univer Career Development Center Espafa Boulevard AGREEMENT ‘Sampaloc, Manila 1015, Ay, 2026 2027 TERM Summ! 1, Ashley Lucas, a student enrolled in the Teacher Education Program at university: ‘of Santo Tomas, hereby ‘commit to fulfil all requirements and ‘responsibilities ‘associated with my ‘teaching practicum. understand the importance: of this ‘in my’ professional ‘development: ‘and pledge to ‘maintain the highest standards of conduct. To the University: practicum orientations and seminars. will maintain regular communication ‘or issues that arise during my practicum. 1 n reports, {agree to attend all required with my university SU Pina promptty report any COnCENTS Yommitto submitall required Socumentation including lesson) plans, daily ime records, Obs ‘and reftection reals according w spected deatorr will ‘structively and work 10 Tonderstand that my final jations from both improve my teaching my cooperating teacher and ‘university Supervisor\" To the Cooperating Schoo! professional conduct and appearance atall imes.| wil amr punctually a tagular attendance according conoreed schedule. agree 12 (100 ‘all school policies, P regulations. will maintain Mn edentiaity of student information \"and records. commit 0 Prepare eorprenensive lesson plans and ayetonal materials. wil actively ‘participate in classroom faculty meetings, and schoo! programe as appropriate, aare8 wcinecept guidance and mentorshiP from my raraperating teacher. understand arnt must demonstrate competence esson planning, n Sgeroom management, and assessment. ind maintain and delivery, J understand tat teaching practary isacrucial full co! ‘and dedication. that my performance Manes and eligibility for teaching licer professional ethics may esd ‘allure and delay of Bromonstrate professional behavior ‘expected of licensed tea signed this November 05, 2025 Ashley Lucas"
    },
    {
        "image": "agreement2_synth_13_aug4.png",
        "label": "agreement",
        "ocr_text": "University of Santo Tomas Career Development Center PRACTICUM Espaia Boulevard AGREEMENT Sampaice, Mani 1045 AY, 2026 2027 TERM guemer ‘eather Extucetion Program at University of Santo Tomas, heresy bilties associatad win my iezching practicum. turideratans the iid piosige to maintain the highest ris of |, Ashley Lucas, a student enrotiad int “Gonenit to full il regieemsnts and respons impartance of this exponen in any nH To tha University tations and somin ii} maintain seguiar com por! any concerns 01 Issues thal arise during my practic n, dally ime records, absetvatien reports back consichvely end work jatuahons from Hoth Tageae to attend all roquired practicut o1 wih my university supervisor and ecomatly omrimel tn cube al required docurm and sslection journals acnording spectig re finpeve my teething competencign tundsratsnt that my my cooperating teacher 2 Cooperating Szhoc! Loommitis abyene professional ou cagular attendance eapordiny 10 4 regulation raintain conidontstiy of t ppeatarice at ali mes. fwitl arcs punckaaily and maintal ‘to fobow att school golicies, stecedures, and jaatintecmation and racords, ioummat to prepare ompretvensive iesson bi nustorials. tyr actively paiticinate m clasaraom activites, faculty meeings, and schoo! programs as spaTopaate. lagree to accepl gudianoe and mardorship tom my aratng teacher lunclerstand that (must demansitaie competence is ‘essen pining, mastructional delivery, classroom management, an ausbesment. 2 presticun 1s a crucist conspaneal of muy Yeachar preparation program ant requires and dealicators. Fackauwledge hal my pertormence wil sigaticanity mngact my pesiassiona: sibility reaching Weensine, Lagres fiat uuseustactory perfomance or viataton of ‘rofsssional ethics may result in faliure ane dslay of gradu: stand that Fara expected demncratials professional benavict axpacted of heensed teachers sent teacher. oven Ashisy Lices"
    },
    {
        "image": "agreement2_synth_13_aug5.png",
        "label": "agreement",
        "ocr_text": "University of Santo Tomas Career Development Center Espafa Boulevard ‘Sampaloc, Manila 1015 PRACTICUM AGREEMENT AY, 2026 2027 TERM Sunes ‘commit to submit all required pected deadlines. wil accept feedback ‘evaluations from bot Pecderstand that my fnal grade willbe based On"
    },
    {
        "image": "agreement2_synth_14_aug1.png",
        "label": "agreement",
        "ocr_text": "University of Santo Tomas Career Development Center THESIS CAPSTONE Espafia Boulevard AGREEMENT Sampaioc, Manila 1015 AY. 2024 2025 TERM 200 Sem 8 and avo plagiarism. ¥y fesearch. understand my findings appropriately and that faiure to complete i pened tal my project wilbe evaluated perce qualty of research, based are fesegs, wrt quay, and presentsnen ee based on feedback. agree to present Signed this November os, 2025 Andrew Long ee"
    },
    {
        "image": "agreement2_synth_14_aug2.png",
        "label": "agreement",
        "ocr_text": "CAPSTONE AGREEMENT eR ond Sen paine, Mania 1045 y Longa graduenng ok ct accorting 1 th of University ornas, hereby coment te \\dards and tonetine set by the held arademic mingiity thi coder 2 quence of my eoviser, ait man y s esearch ‘socurreniaticn i it ays bo graduation. agree ring arate, He roto i rater ayy research ethicatly and resnonsibly. my research invel and protect Heit privacy and coniidentialty. fill ens and does not cause har lo participants, oom Ethics Commit andi reporting, tackno! lo properly acknowledge caminbutons of particigants, ungerstang my responsibility fa disveminaie research vas human catlicigan re tratiny 1 nvircnment. isares to arcs 6 with ethical standard submit my research proposal to parency i: data collection, anal les 8 acter mi advisers, and olhers who assistin my rings appropriately derevenet that ese jon is 2 mayer v0 ‘salglaciocly wil detay aoksromledye that sinc 3909 on feedback, ages to 228, azknowedge that Signed this nove Ancirew Lo"
    },
    {
        "image": "agreement2_synth_14_aug3.png",
        "label": "agreement",
        "ocr_text": "| Andgiey Lo thsstelea Fequitersent ior grag, ‘puideines, fa Sanna to eee amy, sat To Research £4 conn to vn inborme: i ata submit my 8 Coramites faq) ‘son, analy, ax know vonsttstes seriou Sate i29208 posperiy acanee, fedtae co Advisers. ata others who assis CIR. Fundorsicng Sidings approgiaicty. wndersinse! tat thas eaetactonay shoacee of ate bases on feediney eta thesis my Renan rats net se) ted this Nove: Peceaicn prop, fansparency in dats cnc 1a Oe pubsened my teats my researen University of Sante Career Development c a Boulevars Saopaiog, Hania 1215 0. a grartvat big shasiset ef Us 12 Bla tact tthe: fom ant nega tp e008 and soba py i recparernerts, ge State eeacw fy rapt she Py aking hati, oe he omy re98arch etic 2 O0Nr eet sraect ihe Garis ana does nst cause p, i the Re: este OY Beast. 9 8. srg Goat, ang Re to eros isy we retin iy ay Unteeraty re er 05, 262K aptione gees Sap iy and re; WE Nu Duh Tomas ‘ene vers uhols acedsny ati to pathic Of Sante Te tantaids asd time Sretct ater the oui {8 accom tw setecta cet Slaresords £29 Rivne” a0} say Drtecrbbed twine i ayeid dolar os SM oerusernt ant other supe iy. a Sty and confeans, ‘aline sai ny. 1 responses ity hroughion by wet enaute th omen, oF OME. Fl reat hy tecge Pat sittin ori 7 HESISICAPS TONE AGREEMENT 8 Universi. eK the eaviconmant hitbutions of tytn the research prac al ny rezeare) lodge thisas a si bw complies bricalion of dey Baricipants, Hesetoinme meearnis woconsiets uty oFresearen, Y QOS te Carise my cre mis ne aaa ti Ea owtersan Hat ey wrheaty een diaiaces. soko estes ty alias"
    },
    {
        "image": "agreement2_synth_14_aug4.png",
        "label": "agreement",
        "ocr_text": "University of Santo Tomas THESIS CAPSTONE Career Development Center Espafia Boulevard AGREEMENT ‘sampaloc, Manila 1015 AY, 2024 2025 TERM2nd Sem |, andrew Long, a graduating student of University of Santo Tomas. hereby commit to complete my tyativeapstone project according tothe standards and timeline set by the university. acknowledge this as 2 eguitement for graduation and pledge to uphold academic integrity throughout the research process. To the University: como work igen on my tesslapstone pret unde he guidance of Sy wal maintain regular cor to we onan br progress repr accorng 0 sciedie, (208 folow the university s research ree ca standard, 1 property ackrowiedge al sources and me ST tonstructwely. understand the importance of ee ic avoid delays in graduation. agree to surat al requred jal, To Research Ethics: committo conduct my research ethically and responsibly. my research involves human participants, will oom nformed consent and protect their privacy and confidentarty T will ensure that my research complies or etncal standards and does not cause harm to participants ‘communities, of the environment. agree to uired, Iwill maintain honesty and wiiprat my research proposal tothe Research Ethics Commitee 160 Jysis, and reporting. acknowledge that falsifcation oF fabrication of data transparency in data collection, analysis, raettutes eerious academic misconduct. agree to property \"acknowledge contributions of participants, \\d my responsibility to disseminate research SGuisers, and others who assistin my research. understan findings appropriately. aptone completions aaj requrementor graduation a a Ae Goma fat ny propet wil be evalated based on qualty ofresesich san understand that may need to revise my work mute nes format. understand that my nef academic databases. acknowledge that nfetectual understand that thesisic Signed this November 05, 2025 Andrew Long"
    },
    {
        "image": "agreement2_synth_14_aug5.png",
        "label": "agreement",
        "ocr_text": "University of Santo Tomas, Career Development Center THESIS CAPSTONE Espafa Boulevard AGREEMENT ‘Sampaloc, Manila 1015 AY. 2024 2025 TERM2no Sem Andrew Long, a graduatng student of University of Santo Tomas, hereby comm compe Ty Heat stone project according to Be standards and bmeine set by he unvversity acanoweage fis a8 2 integnity Byoughout the research process requirement for graduaton and pledge to uphold acadermc (members conatructvely understand the moortance of Ce tet wenn he prescrbed wetne t avon! cours n gacuan aan warms a reaure ‘Grafs, trai manvacret, and oiher supporting materi"
    },
    {
        "image": "agreement2_synth_15_aug1.png",
        "label": "agreement",
        "ocr_text": "Student Piacemant Often PRACTICUM a9 Tait Avenue AGREEMENT talate, Mania 100 AX. 2026 2007 PERO aot J Apat Rass 12 Progam st De La Sal full ait equirements and respansiniiies assoc uted wits ny teaching practic deveioonient and pleage tu maintain the University, nerety comet ie tundersiand the imenrtar est standaeas of conduct wired oF tations and seminars. bel maintal jar colnnunicadion yURIweISy Supervisor and poomatly \"enor any concerns Gr sees Inat unse Suiving any practeum f eater ig submit alt regi including lessen ptans, dally time records, obeanaton reports, and reflection sour s9hj aNd WOK bo np ations tram Bos nate the a regulations. 1 wil mamniair confident ‘cuingrabensive tesson pians anc fac 93, 8g SLAOO PLOY courerating te golivery, classroom managermant, ar! ausessrnent derstand thatiescting 6 full commiment and ded eatios seaciness and ilgibibty for tee professional ethics a chicial compengnt ot my teacher creparalion pragnars ang requires cknowledge that my performance wil sigmacenly impact ny professionel thing liceonure {agree thal unsaiisfactory pertermance Gs viola! iiailure and delay ot gratiuaton. fungerstond that am exaects expected of icensed teachers despre deing 3 slusent teach"
    },
    {
        "image": "agreement2_synth_15_aug2.png",
        "label": "agreement",
        "ocr_text": "De La Save University Stason’ Placement Of PRACTICUM Mot Tet Avenue AGREEMENT vee AY 2906 2027 TERR sgh Sem Apel Ross, a student anrotied in ta Teacret Ericaton Program ai Da La Sia Universy, hereny comet to Susi xi magy ements and sesponsininas associa’ with my waching pracdeunt understand bre inwariaiice drive experonce mn my professional cevelopiment ano pladoe ty maintain me haghest standaccs of conduct To the University agren to ationg all required practicum onenlatons ana seminars I wnt marntain regular comenunicaton wes yy unwetsity SuDervisar and uromety tarot any cancerns OF WsSUAS that anise Guitng My Pracacee comet: submit raquirwa documentation inuvting leBLon Dians. daly ime rwcores abserveron report, and ratectun journals according 10 speotied deadines 1 wi accept Peeoback Consinuctyely end work trexeve my teaching competoncins. undersians that my Shai grade wit be based on evetuadans tram toth ny cooperating teacr sr ard university Sper xa Fe the Cooperating Schoo! teomnitio cbeone professiunal conduct and appearanen at alt wes Lust acre Du regular adenriance accoriay (0 he agreed Wehoduly agree te folio ali =cho7k volcies, pucecures, and ‘agulatons ati mainiain confcantaity of sbaaant ntormador and records. tconynit in prepare comprenensive lesson sians and matructonal matorisis \"ait achve?) parkopate in Gassinom activites tacuty meatings. und 3choo: BIagIAMS 4s aNDTUpTO e luge Io ACoA Guance nd Mentorship RE My coopetaing achat unierstand Hal) MUNt demonsbaks CoMpEdENCE IF WIsEON BURNING, memUCton a Aetvery. classroom management, and assessment Junserstand trai teaching pracboum ss 2 Cutie’ component of my teacher Breparatan progranl and requvss fai Commirrant ang decieation iacknomedse al my detlormance whi signiicanty wnpact iy profeesonal roagmess and mugioiity for wechuny censure agroe nat uneatsiactoyy parhormance ot aotaton of professtonay etnies may result m wilure and Célay of graduation. t urderstend thal am exwectac t9 dorer strele proiersiona! behavior expected of HoENGeC teachers Cespity baing a udert acter Signed ihis iNovemder 25, 2025 Ane! Ross"
    },
    {
        "image": "agreement2_synth_15_aug3.png",
        "label": "agreement",
        "ocr_text": "De La Salle Unwersity Suusent Pacoment Opie PRACTICUM 2407 Taf Ayvsnue AGREEMENT ‘atte, tanita 1008 AY Dom 2tF 3 Ast Seen Patty, Nereby coments ry Seachiniy prachicum. tundenstang te importa pment ard pledge ta maintain te Nhe sinndards of conane §, att Fas, stasent ene! full al requizements this experience ted in the: Teacher Eetucation Sreapr ant tesponsibitties associated sat Stray prekessanei devel To the University agree io atiend ait mained practicum Reh my university supercar aes orananty pad ony concome seu cer age Subir ak foqaised documeriatin ticking lense She ellaction kaurnats aecaeting t seemed deadlines toi Sccepl feedback conzinictively and wore to my Soot aeNG competencies (underetand al my Bhai gear te my ehcperaing teacher wns uaiversiy supe sor afentabons ara seminars, i wil mati in Fegular communication, Bat arise during my practeum, Fras, daily time records, ctservatien reports, To the Connerating Schoot feomenlt ie observe profissicnst conduct Taglar otlanganes eon irs Sppseranice at i tees. eit ative punctusty and maintain 12 ie agte0d schoo, agree to leary af achat odio procednes, 21g iktentialty of student mionvasion sig records Soorométi prepare Se nikon plans aredmishuctonal materia. wi actnely Bardeipals in ciassrum aciuties, seam eeat lames fo accept quctanice and maniavship Sum my ust domonietrate compatence acuity meaings, ang schecl arograns ag ‘Snoperating leacher. understand mat ts 'n fesson panning, arstuet Sblivery, Ustsroom managoren, and asseesmnont Lumiorsiand tustteechiog practicum is crucial component of Ret commbtniant ang daxdicatien. Fackti FES Band eligiatkty for each Denttessiona! 'y char Araparation pcogram and requires wiodge Fst ry performance wil sigitcanty irpaaty aoteenare Pe Ranse. agr68 thal unaatsteciory aarturmanes cr vidtakon ar of leie and detay of yragusiton tundasstaa tha am suerte Shanon expeciog officented teachers caspite being a shedent messes Sigeed this Novembarss, 2025 Apel aes"
    },
    {
        "image": "agreement2_synth_15_aug4.png",
        "label": "agreement",
        "ocr_text": "‘De La Satie University Student Pracoment Ofice PRACTICUM. 2401 Ta Avenue AGREEMENT Matate, Manis 1008 AY. 2026 2027 TERM tat Sem 1, Abt Ross, 8 sludent enrotiea tn the Teacher Eucoton Prograra at De La Sate University, haredy committe ‘uit at requirements and resporsibilitas associaiec wih my Wweaching procicum undersiand tho importance ofthis experiance in my orofessiona! evelopment and pledge to maintain tne hygnest standards of eonduct Yo the University Tagres b attend a! required practicum orientatons and seminars! wik maintain weguiar ComMOUNCAION «with My University SuperviSeT and prUumplly fepOr any ConceINs or issuRE Hat arse Gung my practicum i Conor to submit el enuived aarun entstion inciueing WeaSon pions, datty Eme records, voservaton tepors, und refoctor journals accoding i specites deaciines. wit occrp: teeGLeck constuctvely and work to Yriptove my teaching Compeiencias understand Mai my tne! grade wil Ge Dated on evaluations fom bath ‘My Cooperating teacher and university supernsor To the Cooperating Schoo! Icommitts observe nrofesstonal conduct and appeaiance at all tmsea. jwill urtivs punctvatty and maintain reguiar attendance accoraing to the agread schedule. agtes to follow sil school poticias, procedures, and teguiations {wit Tintern confventielty of student mtormation and recevls commits prepare ‘comprehensive lesson piane ens instuctional matertais. i wil actvely parcipate in classroom activites, faculty meetings, and schvc! programs as appropriate. egree i> aacept guidance arxi manorsixp from my cooperating teacher uscerstand that} must demonzirats compatenice in lesson planning, instreconat Gelivary, classroom management, an! assessment Jundersians trat teaching practicum is a crucial crmpone t of my teaches preparation program an reuiws full comenitment and dedication. scknowtguge tat my perfomance -i sajniteaniy impaci my crofessional raudiiess and stigibitty for teaching licensure. agree that unsststactory performance of viotalon ot piotessionai ethics may result in feura and oelay of crudualon understsnd that lam expectud to demonstrate prolenciana! betawior expected of scensed teachars desuite being a student wacher Signed this ioventrey 05, 2025 Apa Ross"
    },
    {
        "image": "agreement2_synth_15_aug5.png",
        "label": "agreement",
        "ocr_text": "De La Satie University Stren Pacemant Ones PRACTICUM 2408 Tae AGREEMENT SY BNR62027 TERA ist See HgaTIROSS, a shidont anroted in he Teacner Education Prog fat6H al reqiiremenss ang senponspnines Of Gis experience my prviessiong! mat De La Satis Unwersi sasccisted with my teach “eveloginae! and pieisge te inal ty, Hoteby commit in Wy bracticonn. {understand tha importance intain the highest Sanus =f conduct Fo the University age stond 2t raquiced practicum seentanee ans seminars, htt mat tain reguiar commuricaien So my university aunerviax aed prommply repovt any euncusms oe enue that asiae curing my sracticnen. Gorenit ip submit ak required documentation mtudg eseen plane Oaiiy Kine Facorde, abeervaiion cogenss, ‘ane raflecban ioumals socsraing ty snecitied Saviciines i accept teeisback conetuctivaly and work ie AEiSAe iy earthing eomactoncies. i wrderstari that my Sa prage eel he Dawed co euniuztions bom noth my cooperating te2cher and university supenisar. 9 the Cooperating Schoo! [ShiNti 2 Cheeive professional conduct and appearance atal ie Feaalaheratitance according te ie agreed scheduto t agree ty oli at schon elcies, procedures, ang ‘Soulations iwi maintgin contentality ofataaent eformation ane resaran oman te: prepare Samy nemaive ieason sians and instruchonal materials, wil actively pasteapen Ce sisssoom actvites, Sasuly meetings, and wihext pragrains as azprnorale. tages Aereoi guidance and mentoeshie am ray Galea ge Bacher bundereland teat eset demonstrate competence i omen Panning, nstuctonat ‘Sotvery, classroom management and asseesirent nes {val arive punctisaly ancy mesintebs juidarstans tat teaching practiourn 3 crucial component my wachar reparation program ang require Tel Somitrenl and daskestion. acknowledge that my performance wil ‘Significarity impact my professional Pa ReaaS 8h chat tr teachin Tuensurs. Legros test unsatetartoy ‘perfomance or visigon or croressionas sca may remit tare and delay of gruchinsom, tunvcorcene thatieen enueciog ty Semonstate prokexionsi heheviet oxpected of icensed iachers deceite Doing a shiaent teacher, SHRRRG this: Nevernber a6, 2025 Apeit Ross"
    },
    {
        "image": "agreement2_synth_16_aug1.png",
        "label": "agreement",
        "ocr_text": "Universtiy of the Ph Office of Student Afiairs PRACTICUM CP. Garcia Avenue AGREEMENT Ditmar, Queso City 1404 AY 2006 2026 TERM: opines Biman Seen Kamina Dunlap, a student enrolieg in the Teacher Ditiovan, hereby commit fe understinc puhent Education Program a requiremmrds ang responsi: Tnportance of this experience in my professions’ 3 stanwlardts af conduct Gnivensity otine Shino Serciiod wit: my teaching practicum, eni and nisziza to caintain the riversity {20 Ge uiterd al reavire aracicum orientations and semanas. wip nai nication vith ry Sily AuberviSOT aud promptly ceScH aoy coi itatatise during sy practicum, Seo rae Subnt at required dccumantation incuding lesenn mone ally tine records, observation rapons, sracakecton iournais scometing i apeerieg deudtines twit acces ence ck consituctivety and work to Su competencies. tani Ty ia! grate wil be based on evaluations $um noth toacher and university super regular 60 To the Ceoperaling Schoet ral cans abendance secerdiag ws the ey Fegikations, twit mainiain confeientiality of six enmprehensive tuscan ptane and actly mn epearaiice at aii times. iwi arrive punetualiy and maintain Tedule, {gee t fallow al sctiva policies, arecedures, ard ‘dent intormation and records, tcommitta plepare matoriais 'wll actvaly partespate in ciassrooi activites saree accopt quidance aid mamecrsmis Rom iy Inust demonstrate competence in essen planning, instructions: Hoo maneGemeni, ana assessraant jsunderstand that waching practicuntis crucia) vent ant dedication, !acenowiasy eomponent af my to eparation sugrara and requires Momence wil significanty impact my prafessianal that unsatisiectury performance or viotaton of lay Of graduation. tuscerstand that ap expected be 4 otlicenged teachers despite being a student te"
    },
    {
        "image": "agreement2_synth_16_aug2.png",
        "label": "agreement",
        "ocr_text": "University of the Phil lippines Diliman OMice of Student Aftairs PRACTICUM CP. Garcia Avenue AGREEMENT Diliman, Quezon city 1104 AY. 2025 2026 | Katrina Dunlap, a student enroteg in the Teacher Education SOGraM at University of he Py Diliman, hereby committe {ull ll requirements ang ropeensiblies associated wrt, my nigretsl d te importance of ha &*Penience in my professional development a highest standards of congce TERM 2nd Sem hilippines \"aching practicum, Nd bledge to maintain the co nd that my final ‘Grade will be ba aNd university supenveer To the Cooperating Schoo Commit o obse ‘regular attenday regulations, ne Professional co nce a"
    },
    {
        "image": "agreement2_synth_16_aug3.png",
        "label": "agreement",
        "ocr_text": "University of tips Office of Student affoies PRACTICUM CP Garcia Avenue AGREEMENT Ditmar on Gity 44104 289, Diliman AY, 2028 0026 1 TERRant geo Jo the Urdversi agree to atlend atl required pie wits my utes 18, dally me records, cis ani tefleciun journa s according t spewtied deadly i tasctback conistrucavely as improve my waching competencies. understand that ayy canparsting teacher and university 2 Yo the Coopatating Sehuot commit to cuserve professional conduct and appearance at ali imes. Ewa ariez regquias aterdanice accoming to the agieett schedule. agree to (oiow all schoo! put eaguiations, Cai maintain coniwentaily of sda and recorts, loommit ie prepare comprehensive lessan pians and insisuctoral mate ‘actively parSeiuate in cinssrourt actives, Faouity meetings, ang schoo! pregran cooperating teacher. (undorsiand thal must demo Solivery, cessican managennint, and assessrasnt. Lunderstena {hal taaching prectioum i a crucial combs my teacher peaparat rain an racine fat commitment and dedication, taeknowleege Tet my pentormance wh sigaificanty impact my prefossions? readings and algiotily for ieaching ieensure. Tagnee tat vnsansfactory srt or vioiabon of pratusgione! ethics may resus in faslute ane diay of graduation. uadorsiang that am eenected penetrate fH ponavior avpected ot asspite being 2 skwtont leacter fovernber 03, 2025, Signed ahs Keanna"
    },
    {
        "image": "agreement2_synth_16_aug4.png",
        "label": "agreement",
        "ocr_text": "University ofthe Phitpp Office ‘of Student Affairs. ines Diliman PRACTICUM CP. Garcia Avenue AGREEMENT Diliman, Quezon city 4103 AY, 2025 2026 TERM2nd Sem |, Katrina Dunlap, a student ‘enrolled in the Teacher Educ Diliman, hereby Signed this November 05, 2025 Katrina Dunlap SS aching practicum. to maintain the"
    },
    {
        "image": "agreement2_synth_16_aug5.png",
        "label": "agreement",
        "ocr_text": "rsity of the Philippines Dim Oifice of Student atairs PRACTICUM CP. Garcia Avenue AGREEMENT Duin, y1904 SY, 2025 2026 | Kainna Dunlap. sistent enroited in the Teacher Ext Progiain at Diliman, hereby commis hf! all requirements ans recponsibilties assaciated w oni uncersiand the imgera highest stardards of cond ‘petience in ny professional Gevelooment ara ‘of igsue: re pr cairn orieniat ervienr ana promuly ed documents carding t spscifiea c urs vation reports ‘om Path during my pose ans mi requigiions fait mainisin confite conta. scanmit te arepare comprenarisive less ctyely particin t facitty me wat leaching practicum 8 nt ang dedication. Lacknowieage thai my performan 14 eligibiliy tov aching tlcensure, tagnee that unsatistacte eles may resi in failure ance op. Huncersiand yoregsional pehavior expec! hers despite ceing or preparation picarant and signticantly impact my professional ite 1 08"
    },
    {
        "image": "agreement2_synth_17_aug1.png",
        "label": "agreement",
        "ocr_text": "University of Santo Tomas Career Development Centor PRACTICUM Espafia Boutevarg AGREEMENT Sampatoc, Manita 1015 AY. 2025 2026 TERM 181 Sem {tle Wood, a student enroteg and a e2her Education Program At University imperat® ull a requirements an Tesponsibiive i Of his \"perience in my professional ‘my professional INCE OF violation of ‘Performa “aY Of Graduation. understand thay ‘am expected to ‘SPected of licensed teachers despiie being a ‘student teacher."
    },
    {
        "image": "agreement2_synth_17_aug2.png",
        "label": "agreement",
        "ocr_text": "University of Sante Tomas PRACTICUM Career Devetopmnent Center Espata Sovievard AGREEMENT Sangare Marea 1695 AY, 2025 2006 TERM in Se sonra smectite ag at te iam fui a requwernents Mas ociated nih my teBCENG DHAEST vungarstand eperiance of is e penence 1 FY as 8 gga in eH conduct To the University’ agree to attend al required a sacrare twe maintain Ine tet oer aa Commit to suet a8 feqUNS re gay wo rea, coAeTzAO) NPS oe pi tek ex Coma UCRCY 27 SN ‘evaivations 1010 Dot my ev0be “To the Cooperating Sehook, vcore dose potest ORME 200 AUST aged at at inns. tw aitoe puna sy ane aii polkies, prooxcutes, ona ered. agree to saiow a schoe! Aeon snd records. 1m Pep ©”"
    },
    {
        "image": "agreement2_synth_17_aug3.png",
        "label": "agreement",
        "ocr_text": "i can Ep, Sampaion Mania 1915 |, suite Wong. a atuder SOR to Ruist an rey iaRorance of tus expenery conduct To the University Fagres to atleng st ‘with mov university g Soin fs subentt ath 2 PORE CICS j ing ex My cooperating wacher and ating She regula attonitance ae ETUIAHONS. wil ma comme feu! uoperat y ca ra fehensive igen Funderstars iat uit coomaingeat teadinens ang ptblessional ethic demoustints pr: ni 0 dedic fessional be Signed this Nevo 18 asceicing professional coneuct ‘certiing to the 3g VMBZAPGS, ane sche. ng teacher.‘ understana th SHOOT management, tion acknowledne t3t pre fi for teaching may rest in tah Wwerstty of Sante Tomas 961 Develonmant Cena aa Bo man tated tt ne Teacher Education LiTeMeNS MHS FeRDUNRiEEES 2 Y DICImBSIORAl doves vo su Mentaton imetucin pected seanines, 8S uPdenstane that my ty ty sunsrisir meter die oh And appearance greed scher 'R configontauty of stasent ing i883 Bad insuchonat mat roi Brourey asa 8 OS appropiate at PUSI demnar strate con He aSseSEmem FaclCum is esuctat componst af om per bee and dates of gr anor aepected GF ic 08 2028 8nd seminars. tw Prompty report any concmne lesson oi ull at ait ores. He aare3 By fil agF98 to a Progracs at tate with mn cE nal giade wa) wi actively pat mpatence tie ta pile bes niversity of weacning Blodye to maintain te i maintsan regu ‘sues that arise aur ODS, Baily He rene ot feedback cor Om all scm oh and records ty ticipate 9 her prspacaion pry oT REMC wi Woonsure, Vagrne that ursaneme Oty pestoraanc 9TeSuARON, Huncersiay enged leactsts PRACTICUM AGREEMENT AY 20H 26 TERI ret sen, \"Wo Tomas, nershy cure. understand the highest stangenss of luloe CommunIestion observation repects, actively ang works be hesed 20 eval #amnive ounctuatty DIAS, Aad maintain, rOcwAITeS, an cone wenare Stassrcom acanes, iGaiee and manteustip trom y y S80n planning, iastuesonal ugiami ang eseuires ‘yimoact my protowsional oF violation ot 2 Mat iam espectag 9 a student encter"
    },
    {
        "image": "agreement2_synth_17_aug4.png",
        "label": "agreement",
        "ocr_text": "University of Sante Temas Career Development Centar PRACTICUM Expafia Boulevard AGREEMENT Eriscation Program at University of Sane Tomas, esehy ald vit my tachingpracieum. londersiand the is the haghest standacds of Jute Wood, Connon ta flat ou requlremarta ane igaranes of fv experience my Te the Unk squint coninuinication will mainte that afise during ayy practicum. 1 tagies to attend 2 win my universiy suervisor andl arompily report any conicarns ori oan to seb niadon iclusing lueson plans, daly ime records, obsarvauen reports, ane refactor jeumais acne: es, tw accent feednack consmuatvely and work fo ‘povove my teaching co mpetencios. l understand that tay fies grade: wilt be based on aveswaons trom Goth ni cooperaning teacher snd university supervisor o the Cooperating Schoo! ay and maintain sneerve professions! conduct and appsaran’ parsing 41 red vehecute ant gin confinantality of student infor commanensive lasson glans anc tnsiructianai materials. j vill actively part Taasly meelegs, and schon! programs 2 accent guidance and mentors poring teacher uncatstrd a rsacher ptepataiion program and reabires nent and nesticaton, acknewiedge tha! ve wil signaticandy impect my profesnonat ‘anc augitility lor teaching ficsneue agree that unsatisfactory vert or volagon of ay resulin alu and dely of gratuston J undarstans that am expected io suwent eacher suns 9 practzum is 2 entcial component of fil come reasines: professional a semonatiate protens ne that wach Signed this Movember 95, 2028 Jue Weod"
    },
    {
        "image": "agreement2_synth_17_aug5.png",
        "label": "agreement",
        "ocr_text": "University of Sante T Gar nC 2 Develop Expat Boutevars Sainpatng, i045 ‘Nod, 5 stident onrofied in tne mnt to ft at cen mpUHANeE Cf Tis exper conduct. Sages io atend aif requires exact With my university supa viser ana pr cei io subir all cogulned documenta nd cefisction jour inotave my teaching competence My cooperating teacher and un To the Con Schoo! ‘commit observe professional con reguist attendance according the reguiations. Twit maintain eon oomgrehanel pans anf ins fachity mentags, ang schoo! pears cooperating wacher tune av ai conduct an aie a. it tat Em Y, Ciasstoom management, a: Sunderstend tat teaching practicum ie a cru Commisnent and cegiea: FWadiness ane etigDlity to professionat eth demonstra tnaching licensure jona! behavior expected Signed this November 95, dutta Wer ce in may professianat nate sccorsing io specified Fuencerstenc thal my tinal grade we versity supervi agreed seheciee Lagres foenuailty of stusen chong materials, ryiti nd Aasesotnont on. Lacknowiscge th 8 may tesutt in testa and delay of graduat PRACTICUM AGREEMENT Wy of Santo Tomes, my teaching ever i developinent ang plaags eraby tt. Fengbestend the to maintain ine highest sianaarce of vist commuricaban 8 Gur ny pests, ally tins records, ubservation tenors, ieaulines. twill accept feaitaack conswunteely ancl work to bs based on svalisnons fon nes bs3u88 that ay tien inciuding lesson plas eppeara at att tne. Lust arrive p inctually and mal favlow ail schoo! uslicies, nrocedn ‘on and records. jaoicmity prepare Gassroum 2 app Be is acco guidance and menionship in ay si demenstiate competence i lesson planting, instrvctonel sal comport ntot my teaches Hy Berformmarioe Wits 8. tapree thal unigatista Prenstation program and requires vaniteanty impact ny rictasuional perfor: oi hoensed teante"
    },
    {
        "image": "agreement2_synth_18_aug1.png",
        "label": "agreement",
        "ocr_text": "University of San Carlos, Student Services Office PRACTICUM P del Rosario Steet AGREEMENT Cebu City, Cebu 6000 AY, 2026 2027 TERM tstSem \\/cmistopher Mendez, student enalledin the Teacher Edueaton Program al UTA of San Carlos, 1 Chistoe e i al requirements and responsibies associated wit! my acting OT 1 hereby coment Wytance otis experience in my professina evelopment and Piedde maintain the highest standards of conduct To the University: minars. will maintain regular communication 1s that arise during my practicum. daily time records, observation reports, feedback constructively and work to il be based on evaluations from both agree to attend alll rea with my university supervisor and prompt vain it to submit all required documentation including lesson plans, coi reflection journals according o specified deadlines. wll accep! antyove my teaching competencies. understand that my final grade wi my cooperating teacher and university supervisor. To the Cooperating Schoo! sional conduct and appearance ata imes. will rive punctually and mala greed schedule. agree to follow all schoo! policies, procedures, nd regulations. wll maintain confidentiality of student information 2° records. commit to prepare Ganprehensive lesson plans and instructional materials. |i @cWvely participate in classroom activites, faculty meetings, and school programs as appropriate. agree Wo ‘accept guidance and mentorship from my PXSperating teacher. lunderstand that must demonstrate competence in lesson planning, instructional Gelivery, classroom management, and assessment, commit to observe profes regular attendance according to the at fal component of my teacher preparation program and requires, that my performance will significantly impact my professional istactory performance or violation of stand that |am expected to te being a student teacher. understand that teaching practicum is a cruci full commitment and dedication. acknowledge Gives and eligibliy for teaching licensure. agree that unsa Professional ethics may resultin failure and delay of graduation lunder aiohensiate professional behavior expected oficensed teachers desp Signed this November 05, 2025 Christopher Mendez"
    },
    {
        "image": "agreement2_synth_18_aug2.png",
        "label": "agreement",
        "ocr_text": "orice PRACTIOUN atie Street AGREEMENT 15088 SY, 2028 2027 TERM lax Sem vine Teache: jusaton Program at Un associates i all requirements a tan highest standards of conduct Yo the Unive tions and seminars, Lwitl ular comniunication during my practicum. ration 16 ty allend atl required g ‘wid ey university st penvisar and and reflect iy coaperath the Conners Heommitta obs atiencanes ve professionat conduct and app thing to I arive punctusliy and meintain tures, and 2 tp accent guidance and mentorsnp fom my lesson planning, inatrarkona, sion management, and assessment ‘that teaching prac tment aid dasiestinn prewaration prog it signticansty impact ny ackrowtest aginass are etgiblity for teachin licens: professianai eihi asutia and deiay of ginaua Aeuonstate protesncnal o"
    },
    {
        "image": "agreement2_synth_18_aug3.png",
        "label": "agreement",
        "ocr_text": "University of San Castes Student Services Ofine PRACTICUM def Rosarie Seat AGREEMENT Gabe City, Cade 000 AY, 26 E2077 TERM yet Sem 68, 1, Craistnpher Menger, stu hereby coment te hut all ea en 2 importa highest standards of condvet mation Program at University of San. parisindies associat rotesstonal developin: 20 with any teaching eractcum. ge to maintale Fo the University fagree to attend alt reeuired practicum orientations ant iowa en F commnanioaton with my university supervisor 2g promptiy «epost any concems or :ssuae fat arine during ayy practourn. ‘coramit ts submni all required Uocumeniation including fessor plans, daly time records, observation reports ana feflection journais accoraing to species deadlines. ively and work to improve my teaching competencies, understand that my fina! grade will be Based am ny conporating leache! snd university supervisor A conslruct To the Cooperating School commit to observe professional andance sccordie to the agreed schedule. Fagrea tok Iwi wzintaln confidentiatty of student inormation and records. loom to prepare lesson pans and insinctonal matenals, wil acy (cipata in ckassroom activities and sche! 5 agree th accent guidance and mentorenia fio jerctand that! rate competence in lesson planning, instuctionat mei, ane ass that teaching practicum 's 2 crucial component of my teacher preg nd cost schnowledse that my performance wil sign ity for teaching tcensure. i agres that unsatisfactory per result in fait sation pragram and requires caniy impact my rotessionat riormance oF vioiation of tat? an expected 1g a Suadent learner Signed this November 95, 2025 Chetstepier Menez"
    },
    {
        "image": "agreement2_synth_18_aug4.png",
        "label": "agreement",
        "ocr_text": "University of San Carlos ‘student Services Office PRACTICUM AGREEMENT P. del Rosario Street TERM 1st Sem Cebu City, Cebu 6000 Ay, 2026 2027 ram at University of San Carlos, ith my teaching practicum. scher Education Prog ‘pledge to maintain the ndez a student enrolled in the Tea fulfil all requirements and responsibilies associated wt 1, christopher Mer ice of this experience in MY professional development and hereby commit to understand the importan highest standards of conduct. aintain reguiar communication unas. jgsues that arise during My Prachce 1 means, dally time records, ODServaNch reports, veaback constructively and work oie pased on evaluations from both To the University Jagree to attend all required practicum orientations and ‘seminars. will m ‘agree juniversity supervisor and Prom report any concer wi to submit all required documen ave including lessor ‘and reflection journal ‘spectted deadlines. will accept atprove my Yeaching compelencies. ecgorstand that my final grade Wl my cooperating teacher and university supervisor. and maintain will arive punctually and To the Cooperating Schoo! 11 school policies, procedures, commit to observe professio ince according to the agrt nal conduct and appearance at all te schedule. |agree to follow a sudent information and records. committo prepare Mina instructional materials. Will avy participate in classroom acter. oe Lagree to accept guidance and mentorship from my eroperating teacher. understand rat must demonstrate competence I Tesson planning, instructional corery, classroom management, and assessment jon program and requires ry impact my professional component of my teacher prepara jolation of to performance will significant at unsatisfactory performance OF ‘uation. |understand that am ayers despite being a student teacher understand that teaching practicum 's© crucial full commitment and dedication. ‘acknowledge that my Teadiness and eligibility for teaching licensure. agree professional ethics may result failure and delay of 0a Uiomonstrate professional behavior oflicensed signed this November 05 2025 Christopher Mendez"
    },
    {
        "image": "agreement2_synth_18_aug5.png",
        "label": "agreement",
        "ocr_text": "San, Carlos F981 Rosario Street AGREEMENT Ay, 206 20. TERI tat Sa slonner Rlenagz, 9 stucent eniotiag in the Taacher Education Programm st University of San Caray nereby comin ty full al requirements and resgerisibiitvs associated with my teaching practicum understand use imsorlance ofthis experignce in my professtanel development ane pledge ts maintain highest slangaids of eanaiet To the University agree te attend all vequtred prackoum onentations ano seavinars. wh! maintain regular communication with my university superviger and prsmutly recort any concems of Kesues thal ange dining iny practiour, committe submit it enkired socumentstion including lesen plans, anti lime records, ciservation ieaors, ane feflection journals according to spectied deasiines iwik acoagl feadback constructively and weTk io improve my gaching comperzre es. understand that my final grade will be based on evaluaiions fare my cooperating teacher a sci id untversity supe comnml o observe professionel conduct and appearance at il times {will arrive puncivally and maint regular attendance acroiding to ihe agreed schedule, agice to fosiow all schoal po! regulations i! mginiain conmenialty of student informaton and 'ecoras !ecrmitto prepare comorenensive leeson plane and instruct aia! matenals, \"will actveiy parveipale in classreart racully meatings, aad seneol progiams a6 annvopiale, lagree ke accent guivence ana memurship fiers my escperating feacner !uncerstang thal must cemonstaate compelenne in jason planning, instuctions classroom manegonent, and assessment undersized thai teaching practioun is cruciat companent of my weacher preparation program and requites ‘uil commitiaert anc dedication, acanewledge that my performance wi my arotessional readiness and sligibiity for teaching heaasure Lagiee that unsatstactory performance or violadon of derstana that ani exp slonificantly impact professional ethics may result in falure ana delay of graduation. demansiraiz professional hahavior expevled of hcensed iaachers Caspite being student feache! ected ta igned this November 05, 2025 Christopher Monde"
    },
    {
        "image": "agreement2_synth_19_aug1.png",
        "label": "agreement",
        "ocr_text": "Central Philippine University Ottice of Career Services THESIS CAPSTONE Lopez Jaena Street AGREEMENT Jaro, lollo City 5000 AY, 2024 2025 TERM 1stSem |, Cynthia Nolan, a graduating student of Central Philippine University, hereby commit to complete my thesisicapstone project according to the standards and timeline set by the university. acknowledge this as a requirement for graduation and pledge to uphold academic integrity throughout the research process. To the University: commit to work dligenty on my thesisicapstone project under the guidance of my adviser. wil maintain regular ‘consultation sessions and submit progress reports according to schedule. agree to folow the university s research ‘Guidelines, formatting requirements, and ethical standards. wil properly acknowledge all sources and avoid plagiarism. ‘comma to incorporate feedback from my adviser and panel members constructively. understand the importance of Completing my project witin the prescribed timeline to avoid delays in graduation. agree to submt al requred documentation including drafts, fnal manuscript, and other supporting materials, To Research Ethics: commit to conduct my research ethically and responsibly. f my research involves human participants, will ‘obtain informed consent and protect their privacy and confidentiality. wll ensure that my research complies with ethical standards and does not cause harm to participants, communities, or the environment. !agree to ‘submit my research proposal to the Research Ethics Committee if required. will maintain honesty and ‘transparency in data collection, analysis, and reporting. acknowledge that falsification or fabrication of data ‘constitutes serious academic misconduct. lagree to properly acknowledge contributions of participants, advisers, and others who assist in my research. understand my responsibility to disseminate research findings appropriately understand that thesis capstone completion is a major requirement for graduation and that falure to complete Satistactorty wal delay my graduation. acknowledge that my project wil be evaluated based on quaity of research, Signficance of frdings, wring qualty, and presentation. understand that may need to revise my work muito tes based on feedback. agree to present my work in a thesis defense or simlar evaluation format. derstand that my completed thesis may be publshed n universty repositories and academic databases. acknowledge that intellectual Property rights related to my research are subject to universty polcies. Signed this November 05, 2025 Cynthia Nolan"
    },
    {
        "image": "agreement2_synth_19_aug2.png",
        "label": "agreement",
        "ocr_text": "THES! SiCAPSTONE AGREEMENT TERM peters cenit 9 complete \"TF a graduating Suter of fy, naaaby co\" ri fea anwaraty Facamoieage (I 352 rout the, 7eS20eP POSSE 1 Gyorma Neves. aig 4 ane St thiausl thesisicansions aroject acc ve gravruatian ard psec 6 UPR seuirerTent wt rnntan roma tys search pagers? 2 ob ny aavest Sr te ow th ts rae aR HERES. BG A sised the arpartasie of the University sy seenscapatons peeinee tht DIS peaing ip 2ofiede reearena regexts 5072 evissds. wie ene mi ‘nv tent tp oomene io wor ronsubatse Se330 Ses, trating teammate, 08 wea i ae enaanak FO ty 20H TE Menbers construcevasy nt Fo ng tome 1 vt days 0 Fae Teqree to sabes an veovses “ger supa ong TICES soising 7 prope aR Org arate, bra aA solver burnan pacezioants, Hil aan Wah rey esearch IMACS av ine @rveronvmen. agree to ast mains NEARLY AAG raprcatior of da esponsibty sf my rasearce in canhgeataiiy, wil Piapirn to parbexpants, connenunita coh Ethics Comeniting #requled. Dering, tacknosindue tat talsiteahon ige soamibatons ot narierbarts iy an their preacy and tain inserted consen rts exracal stanarts ae dows a0 CRS arch propos the RESeAt ays, and £20 in eata cotietion, a wansparens wanes seniods acactemic eseciondgck A006 fo property arknowied etpy research snouts] mH resensDUy 19 disseminate researc advigers, and atners WhO range approgiately arg that taewe v coonesete of e508\" one comuiesan 2 ROP CGT OF SERRE, on age ta hy prone wee ws ianteg LAST T quatty SStpeiaion. arse wane tal ay ne 2 eR week ratigle BT ett nas ov sand wushunton em Unis ane catrnages ekadtnage Ee MEARE sb unesstsi tint mesinieae gry wv dey ox OE Srnaance of traangs, wg Oa 3S ay ieecoack. gree 1 pwn! NY WON penn way be eames #1 ZeMPY TOFCBRN ES et 0) FARRER EF NAKAI TO NES pores"
    },
    {
        "image": "agreement2_synth_19_aug3.png",
        "label": "agreement",
        "ocr_text": "Centrat Pritpgine University ice of Career Somvices THESISICAPS TONE Leper J at SGREEMENT dita, Keita City S600 AY, 70282075 TERM tot ctipoine Universit at by the universiy. Facunowiedge inven ‘ener ve wask dsgeetly on any teainfeagatone project under te guitance of ny nevis wet ensitain reguos conmuitator erase end suit ca ees repeats accorting te echedle agree to inow the umiersy s roseareh Gisteimes, toma quirements, and ethics! xterra, (wikproracly sckmaiede at sources at avo pagiariom. ceynae te cervorate feeshack fos. sy adver anc panel embers eonamurtvely, junderstand te snoortac of rroieing my areal actin ihe pias hes tanline 12 avcid dela i graduation. {agree fo sun a8 rected docioentazon eckskony Gratis, at mataasrpt and alter To Research Ethies: Yo conduct my research att wotves buntan participants, aft normed egnsent ane price! thaw privacy and conidentiatly iwil ensure iat my reavarch comptes ah ethical slancards and dave not cause hain to carieisants, communities, of fee envisonment Lagiee fa ‘submit my tesearch propasal to the Research Ethics Comm! wit miaintsin homes and reporting. 2 ion or feovication of data 13 academie misconduct agTee advaers, and others whe asstal in my ressatsh. tundersiencd ny responsibitay fo disseminate re indings oppenpriately A 1 ourcpleion 2 2 major requrerient for gadueton and tat fare avaksied busea on quay 0 /eeeatth project rome fat riay Tee ree my Work one NTE ncersiare hat my uniersigns thi thesrescagata Satafectcedy wang ry gradation. sgpiteance of Fediogs wing quaity, and presentation. fa bocad ca fowcback, i agres tp arozent my werk Ba Deas ‘completed thesis may Se pubdabed in anivaruly feponierios ams 2 property rignts seine wo ry research are subject Ie university pokes 028 Signed this Hovember Goprthia Nota?"
    },
    {
        "image": "agreement2_synth_19_aug4.png",
        "label": "agreement",
        "ocr_text": "Central Philippine University Office of Career Services THESIS CAPSTONE Lopez Jaena Street AGREEMENT Jaro, lloilo City $000 AY, 2024 2025 TERM st Sem |, Cynthia Nolan, a graduating student of Central Philippine University. nereby commit to complete my thesisicapstone project according to the standards and timeline set by the university. l acknowledge this as a requirement for graduation and pledge to uphold academic integnty throughout the research process. To the University: comm to work diigently on my thesis capstone project under the guidance of my adviser. wal mantan regular Consuttaton sessions and sum progress reports according to schedule. agree to folow the unwversty s research ‘uideines, formatting requrements, and ethical standards. wll properly acknowledge all sources and avo plagiarism. Commi to incorporate feedback trom my adviser and panel members constructively. understand the importance of completing my project within the prescribed tmeine to avord delays in graduation. agree to suomi al required documentaton neluding drafts, fal manuscript, and other supporting materials, To Research Ethics: commit to conduct my research ethically and responsibly. my research involves human participants, will ‘obtain informed consent and protect their privacy and confidentiality. will ensure that my research complies with ethical standards and does not cause harm to participants, communities, or the environment. agree to submit my research proposal to the Research Ethics Committee if required. will maintain honesty and transparency in data collection, analysis, and reporting. acknowledge that falsification or fabrication of data constitutes serious academic misconduct agree fo properly acknowledge contributions of participants, advisers, and others who assistin my research understand my responsibility to disseminate research findings appropriately understand that thesisicapstone completion is a major requrement for graduation and that faiure to complete t satisfactoriy wil delay my graduation. acknowledge that my project will be evaluated based on qualty of research signficance of findings, wrting qualty, an presentation. understand that may need to revise my work mutiple tmes, based on feedback. agree to present my work in a thesis defense of simiar evaluation format. understand that my completed thesis may be published n unlversty repesttones and academic databases. acknowledge that intelectual property ights related to my research are subject to university potcies, Signed this November 05, 2025 Cynthia Nolan"
    },
    {
        "image": "agreement2_synth_19_aug5.png",
        "label": "agreement",
        "ocr_text": "Central Philippine University Mice orcareer Services THESIS CAPSTONE Lopez Jasna Steet AGREEMENT Jaro, lloilo: City 5000 AY. 2024 2025 TERM 1st Sem thozaitia Nolan, a graduating student of Cental Philippine [Unlversity, hereby committo complete my Ihesisicapstone project according tothe standards ory Smelting Set by te university. lacknowledge this as a ‘equlrement for graduation and pledge to uphold academe ‘integrity thoughout the research process, ‘my research complies ‘and does not cause harm to partici lagree to ‘submit my research proposal to the Research 'frequired. will maintain honesty and Mansparency in data collection, analysis, and fabrication of data Constitutes serious academic misconduct, Contributions of participants, advisers, and others who assist in my resez /onsillty to disseminate research findings appropriately. Signed this November 05 2025 Cynthia Nolan _ ___"
    },
    {
        "image": "agreement2_synth_20_aug1.png",
        "label": "agreement",
        "ocr_text": "Oe La Salle Universit ity Student Placement Ofice THESIS CAPSTONE 2401 Taft Avenue AGREEMENT Malate, Manila 1004 sty tesearch ethically and responsibly. 4 2 fesearch involves human participants, will obtain informed consentand p Privacy and confidential with ethical standards and doe: Constitutes serious academic advisers, and oth misconduct a lets WhO assist in my research. under findings appropriately, Signed this November 05, 2025 Mitchell Johnson Porting. acknowledge that falsification gree to properly acknowledge contribution sland my responsibilty to disser or fabrication of data 8 of participants, minate research"
    },
    {
        "image": "agreement2_synth_20_aug2.png",
        "label": "agreement",
        "ocr_text": "La Sale Univer Placement Office THESISYCAPSTON 2401 Tat Avent AGREEMENT {TERM g AY, 26% ng student cont gevording lo the sanders stiuation and pledas to rete core 2 iy and fimeline set by Iie univarsty. facknawledge this as a the research s ie integnity throughs Fo the University: ny project with frion iwding ails, foal manus, and einer suppening {helt pivecy an consent ause haar panicigants subot my recy in data ‘ection, it 5 serious academic andathers who as ameri for giankaton and thar fasire to cormplens sig may be publsnsd in un Mitcivel Johnsen"
    },
    {
        "image": "agreement2_synth_20_aug3.png",
        "label": "agreement",
        "ocr_text": "De La Salle University Student Placement Office THESIS CAPSTONE 2401 Taft Avenue AGREEMENT Malate, Manila 1004 AY, 2026 2027 TERM Summer |, Mitchell Johnson, a graduating student of De La Salle University, hereby commit to complete my thesis capstone project according to the standards and timeline set by the university. acknowledge this as a requirement for graduation and pledge to uphold academic integrity throughout the research process. To the University: commit to work dligently on my thesis capstone project under the guidance of my adviser. wil maintain regular consultation sessions and submit progress reports according to schedule. agree to folow the university s research ‘uidelnes, formatting requirements, and ethical standards. will properly acknowiedge all sources and avoid plagiarism. ‘commit o incorporate feedback from my adviser and panel members constructively. understand the importance of ‘completing my project within the prescribed timeline to avoid delays in graduation. agree to submit al required ‘documentation including drafts, final manuscript, and other supporting materials To Research Ethics: commit to conduct my research ethically and responsibly. my research involves human participants, will ‘obtain informed consent and protect their privacy and confidentiality. will ensure that my research complies, with ethical standards and does not cause harm to participants, communities, or the environment. agree to ‘submit my research proposal to the Research Ethics Committee ifrequired. wll maintain honesty and transparency in data collection, analysis, and reporting. acknowledge that falsification or fabrication of data constitutes serious academic misconduct agree to properly acknowledge contributions of participants, advisers, and others who assist in my research. l understand my responsibility to disseminate research findings appropriately. understand that thesis capstone completion is a major requirement for graduation and that failure to complete it ‘salisfactoriy wil delay my graduation. acknowledge that my project willbe evaluated based on qualty of research, signifcance of findings, writing qualty, and presentation, understand that may need to revise my work muttipe times based on feedback. agree to present my work in a thesis defense or similar evaluation format. understand that my ‘completed thesis may be published in university repostories and academic databases. acknowiedge that intelectual property rights related to my research are subject to university poles, Signed this November 05, 2025 Mitchell Johnson"
    },
    {
        "image": "agreement2_synth_20_aug4.png",
        "label": "agreement",
        "ocr_text": "To the University comma o work gant on my enascapstone propel unde Pe DANO ry sovwer. wi malta ree ry on ogress reper aceong 1 sehaaAe,| AF A uneversty s formating and ethical stances: Nw property. ‘sources and avo plague ate crporae feecack trom my save’ and Pare anes cnerstand the mmporiance of Cera ent ee pens tate ms nara Pama ven Mote, ta manner, and oer SYEPOTING To Research Ethics: ‘committe conduct my research ethically and responsibly my research human participants, will \\commaormea consent and protect ew pvacy and consden toe, will ensure that my research complies ‘communities, of the environment. agree 1"
    },
    {
        "image": "agreement2_synth_20_aug5.png",
        "label": "agreement",
        "ocr_text": "De La Satie University -Shadant Placement Cos THESIS CAPSTONE 2401 Tat Avenue AGREEMENT Haste, Mania 1S BY 2026 2007 TERA daroee sonal De La Salle Univesity, Gereky comunet ts complete ty faands ana tmeline set by he onivevsily. iecknowiadye 8 a8 onvie exaighity feouagiisnat the Research BCH 4, itenest Zshnson, 2 graduate stich dhosisicanatons project gccocma Wo te stay requirement for greduaton and siadga to phone meat To the University i cesnwel to wav elageediy on ay Hesse aR Lersumaton ensigns Aad subrat prarprs eepors west Ghiuines, rmnating vequtonvents, ste eis a sianarde. a prehesty Heer bs caveur nce foeabaek 2m ny acvecer ant Case TOMMY CORSLUTSI Serraog my ervjec! whine gwd trae ts gaz yg m gion eR 19 Ser mernnn mencine ate, ak weawaneren, 3 oer aupeor ita Paneesse ecject ender the quiterce of any actor, i wi raenings Aart Genesis agos ty tal ucmreruty' reenarch ncrincevnies BATON Be OS BRANT. F Tasndaratane Soe emporio panes Deepest To Research seam ts curuct ny repesicn wonieaiy aad esponsibts. fiy foxaarah meas Hunan DBRT, tet aera None conant an pied wn pavacy an costeensay. (wei entre fk fay eet vompios Soe et gansart and dogs nok onusa narra to parcarania, comrasnites, ote Aaviernrne agree ts Jubeut ay rancerch praposal the Resnaron Ethics Comnvtina eeqiind at a0 9 nonesty and ERR Licney sate colacton, anavsis, ae epsting tacknodesgs tat aiikcatay of eaprication of tata 2 cere minconduel agree properly auanoalasge commun of psceinane, a every an eutietin nny research, \\ungaralent my eesponsiity f aigostranase reseach fedings anpropiatany ver ce rvs aot Ost tare to coenpine ect we be me asvalan Based i qu oF HeRO ph {nat 0 erase Ty work Rae ech “era, Hustee a7) DE erage St MAROC orviersione der hosiateneetone compte 2 ape ra ‘paarinctonty ais ag nly graselaten. guknulodge Be rPY 7 Cipteames of toes attig aay, 276 prescott. vodesetand Seer on inedmgre, Lagroe te peasect ny ask Ee a these Getense STH 10S pete ck bras We pubaanied were FapORhctee ad Beason A sBoaeN SN pecan sigs reales toy Fesoarch as sunect to university Dose Signed this tovember 4, lechelt Jo"
    }
]