[
    {
        "image": "announcement1_synth_10_aug1.png",
        "label": "announcement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Mesa, Manila 1016 Anonas Str MEMORANDUM Tor: Facutt clencas Frowr Kas Date: Subje ctivities for Secu! This memorandum p ation regarding the implementation of enhanced health and safety protocols effective immediately across all university facilities. in compliance with Depariment Health (DOK) and Commission on Higher Education (CHED) guidelines, aii students, faculty, staff, and visitors must observe the follawing: proper wearing of face masks in enclosed spaces, regular hand ation, maintenance of physical distancing, and cor pletion of daily health Temperature screening will be conducted at ail entry points. indivi will be denied entry and advised to seek medical consultation, Faculty members must incorporate ihese protocols inte management procedures. Students who fall to comply may face disciplinary action juding suspension of class privileges. Alt offices must designate health and safety contact the University Health Services Office at extension ry edu ph. Thank you for your cooperation. 5 official not declaration forms. uals presenting symptor offic: for concerns, 2345 or eral healthservices universi KAITLYN ARNOLD 2 of Arts and Se"
    },
    {
        "image": "announcement1_synth_10_aug2.png",
        "label": "announcement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF HE PHILIPPINES Street, St MEMORANDUM To: Fa From Ka 96 Of Aifs an: Bate: nec Subj ies for Second Semes This memorandum provides official notification regarding the implementation oF enhanced health and Safety protocols effective immediately across all university ies. In compliance with Deparment of Health (DOH) and Comm Education (CHED) guidelines, al student, faculty, staff, and visitors m the following: proper wearing of face masks in enclosed spaces, reguiar hand Sanitization, maintenance of physical distancing, and completion of dally health ceclaration forms. Temperature screening will be conducted at all entry points, individuais pr 9 denied entry and advised te K medical consultation, Facully members must incorporate these protocols into class management procedures. Stuc enis who fail to comply may face disciplinary action including suspension of class Privileges. Alf offices must designate heaith safety Officers. For concems, contact the University Health Services Office at extension 2345 or ermal healthservices university edu ph Thank you for Your cooperation. ion on Higher ust Observe séening symptoms will 1G KAITLYN ARNOLD Bean, F Arts and S Offic. University"
    },
    {
        "image": "announcement1_synth_10_aug3.png",
        "label": "announcement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Anonas Street, Sta. Mesa, Manila 1016 MEMORANDUM To: Faculty and Staff From: KAITLYN ARNOLD, Dean, College of Arts and Sciences Date: November 03, 2025 Subject: Schedule of Academic Activities for Second Semester This memorandum provides official notification regarding the implementation of enhanced health and safety protocols effective immediately across all university facilities. In compliance with Department of Health (DOH) and Commission on Higher Education (CHED) guidelines, all students, faculty, staff, and visitors must observe the following: proper wearing of face masks in enclosed spaces, regular hand sanitization, maintenance of physical distancing, and completion of daily health declaration forms. Temperature screening will be conducted at all entry points. Individuals presenting symptoms will be denied entry and advised to seek medical consultation. Faculty members must incorporate these protocols into class management procedures. Students who fail to comply may face disciplinary action including suspension of class privileges. All offices must designate health and safety officers. For concerns, contact the University Health Services Office at extension 2345 or email healthservices university edu ph. Thank you for your cooperation. KAITLYN ARNOLD. Dean, College of Arts and Sciences Office of the University President"
    },
    {
        "image": "announcement1_synth_10_aug4.png",
        "label": "announcement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Anonas Street, Sta Mesa, Manila 1016 MEMORANDUM To: Faculty and Start From: KAITLYN ARNOLD, Dean, College of Arts and Sciences Date: November 03, 2025 Subject: Schedule of Academic Activities for Second Semester This memorandum Provides official Nnotifi KAITLYN ARNOLD Dean, College of Arts and Sciences Office of the University President"
    },
    {
        "image": "announcement1_synth_10_aug5.png",
        "label": "announcement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Anonas Street, Sta. Mesa, Manila 1016 MEMORANDUM To: Faculty and Staff From: KAITLYN ARNOLD, Dean, College of Arts and Sciences Bate: November 03, 2025 Subject: Schedule of Academic Activities for Second Sernester This memorandum provides official notification regarding the implementation of enhanced health and safety protocols effective immediately across ali university facilities. In compliance with Department of Health (DOH) and Commission on Higher Education (CHED) guidelines, all students, faculty, staff, and visitors must observe the following: proper wearing of face masks in enclosed spaces, regular hand sanitization, maintenance of physical distancing, and completion of daily health declaration forms. Temperature screening will be conducted at all entry points. Individuals presenting symptoms will be denied entry and advised to seek medical consultation. Faculty members must incorporate these protocois into class management procedures. Students who fail to comply may face disciplinary action including suspension of class privileges. All offices must designate health and safety officers. For concerns, contact the University Health Services Office at extension 2345 or email healthservices university edu ph. Thank you for your cooperation. KAITLYN ARNOLD Dean, College of Arts and Sciences Office of the University President"
    },
    {
        "image": "announcement1_synth_1_aug1.png",
        "label": "announcement",
        "ocr_text": "De LA SALLE UNIVERSITY i Avenue, Me ADMINISTRATIVE MEMORANDUM Jd Se: This serves as off na guidelines for the Final 5, Second S ter. The final 5. Al nust tion of the sched ic Year 2024 2 examination pe duled from June 3 14, 202 submit examination schedules to the Office 2025, Students must present vaild identification cards during examinations. Calculators and electronic devices are crohibited unless authorized. Any violation will be subject to disci grades within five (5) working days a last examination. Grade encoding will be done through the online faculty portal ely. Make up examinations must be scheduled within two weeks afler the requiar period with proper documentation. For questions, contact the Office of the Uni iy Registrer at registrar university edu ph or visit 7 204, Administration B CHRISTINE GLAS Mi nic Affairs Jent"
    },
    {
        "image": "announcement1_synth_1_aug2.png",
        "label": "announcement",
        "ocr_text": "DE LASALLE UNIVERSITy 2404 Tart Avenue, Manila ADMINISTRATIVE MEMORANDUM Date: Nove Sublect: Schedule o nd Seme: °S as Official notific, Examination Per ation of the schedule and Guidelines for the Final for Academic Y ear 025, Second Semester, The final examination period is scheduled from dk 025. Ali faculty Members must submit examination schedules to the Oo 2025, Students must p University Registrar py Calculators and as durin prohibited unte Faculty must subm re. onic ch to d ciplinary Proceedin cully Doral e it final grades within five Jing will be done through the Minations must St be scheduled within with proper d¢ OF questio ocumentation, C ‘star university edu ph OF visit Ro iod contact om"
    },
    {
        "image": "announcement1_synth_1_aug3.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avenue, Mania 1004 ADMINISTRATIVE MEMORANDUM 2 and guidelines for the F xamination P. amination pet examin Students mu _ All faculty Reg ation cards during bited u fon will five cough dd withiy ons, contac om online facul acuity p"
    },
    {
        "image": "announcement1_synth_1_aug4.png",
        "label": "announcement",
        "ocr_text": "DE LASALLE UNIVERSITY 2401 Tart Avenue, Manila i004 ADMINIST RATIVE MEMORANDUM This serves aS Officiai NOUfication of the sche Examination Period for cademic Year 3 examination Period is scheduled from June SUDMIt exam ion Schedules ig the On cule and inal 024 2025, Second Semesier, TRe final 3 14, 2095, All faculty guidelinas for the F Members must of the University Registrar by May 75. 2025, Students MUSE present valid identifi iO” cared Calculators and e] during 25: ecironic devices are Prohigited uny nary proceedings, Faculty must (5) working days after the last examination, Grade encoding wit b online faculty portal exclusively, Make up ©xaminations mus SKS ater the Feguiar period with Broper documentatio ily Registrar at registrar univers examinations, S authorized, be subject to dis. Any violation will Submit final Graces within five done through the two tbe scheduled within mi \"questions, contact iy edu ph OF Visit Room i STINE GLASS VA ce President for Academie Affairs"
    },
    {
        "image": "announcement1_synth_1_aug5.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avenue, Manila 1004 ADMINISTRATIVE MEMORANDUM To: All Faculty Members From: CHRISTINE GLASS, Vice President for Academic Affairs Date: November 15, 2025 Subject: Schedule of Academic Activities for Second Semester This serves as official notification of the schedule and guidelines for the Final Examination Period for Academic Year 2024 2025, Second Semester. The final examination period is scheduled from June 3 14, 2025. All faculty members must submit examination schedules to the Office of the University Registrar by May 15, 2025. Students must present valid identification cards during examinations. Calculators and electronic devices are prohibited unless authorized. Any violation will be subject to disciplinary proceedings. Faculty must submit final grades within five (5) working days after the last examination. Grade encoding will be done through the online faculty portal exclusively. Make up examinations must be scheduled within two weeks after the regular period with proper documentation. For questions, contact the Office of the University Registrar at registrar university edu ph or visit Room 204, Administration Building. CHRISTINE GLASS Vice President for Academic Affairs Office of the University President"
    },
    {
        "image": "announcement1_synth_2_aug1.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espafia Boulevard, Manila 1015 ADMINISTRATIVE MEMORANDUM To: Academic Community From: JOHN NICHOLSON, Dean, College of Arts and Sciences Date: November 04, 2025 Subject: Guidelines for Final Examination Period AY 2024 2025 This memorandum provides official notification regarding the implementation of enhanced health and safety protocols effective immediately across all university facilities. In compliance with Department of Health (DOH) and Commission on Higher Education (CHED) guidelines, all students, faculty, staff, and visitors must observe the following: proper wearing of face masks in enclosed spaces, regular hand sanitization, maintenance of physical distancing, and completion of daily health declaration forms. Temperature screening will be conducted at all entry points. Individuals presenting symptoms will be denied entry and advised to seek medical consultation. Faculty members must incorporate these protocols into class management procedures. Students who fail to comply may face disciplinary action including suspension of class privileges. All offices must designate health and safety officers. For concerns, contact the University Health Services Office at extension 2345 or email healthservices university edu ph. Thank you for your cooperation. JOHN NICHOLSON Dean, College of Arts and Sciences College of Arts and Sciences"
    },
    {
        "image": "announcement1_synth_2_aug2.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espafia Boulevard, Manila 1015 ADMINISTRATIVE MEMORANDUM To: Academic Community From: JOHN NICHOLSON Dean, College of Arts and Sciences Date: November 04, 2025 JOHN NICHOLSON Dean, College of Arts and Sciences College of Arts and Sciences"
    },
    {
        "image": "announcement1_synth_2_aug3.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espafia Boulevard, Manila 1015 ADMINISTRATIVE MEMORANDUM To: Academic Community Frorm: JOHN NICHOLSON, Dean, College of Arts and Sciences Date: November 04, 2025 Subject: Guidelines for Final Examination Period AY 2024 2025 This memorandum provides official notification regarding the implementation of enhanced health and safety protocois effective immediately across all university facilities. In compliance with Department of Health (DOH) and Commission on Higher Education (CHED) guidelines, all students, faculty, staff, and visitors musi observe the following: proper wearing of face masks in enclosed spaces, regular hand sanitization, maintenance of physical distancing, and completion of daily health declaration forms. Temperature screening will be conducted at ail entry points. individuals presenting symptoms will be denied entry and advised to seek medical consultation. Faculty members must incorporate these protocols into class management procedures. Students who fail to comply may face disciplinary action including suspension of class privileges. All offices must designate health and safety officers. For concerns, contact the University Health Services Office at extension 2345 or email healthservices university edu ph. Thank you for your cooperation. JOHN NICHOLSON Dean, College of Arts and Sciences College of Arts and Sciences"
    },
    {
        "image": "announcement1_synth_2_aug4.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espafia Boulevard, Manila 1015 ADMINISTRATIVE MEMORANDUM To: Academic Community Fromm: JOHN NICHOLSON, Dean, College of Aits and Sciences Bate: November 04, 2025 Subject: Guidelinss for Final Examination Period AY 2024 2025 This memorandum provides official notification regarding the implementation of enhanced health and safety protocols effective immediately across all university facilities. In compliance with Department of Health (DOH) and Commission on Higher Education (CHED) guidelines, all students, faculty, staff, and visitors must observe the following: proper wearing of face masks in enclosed spaces, regular hand sanitization, maintenance of physical distancing, and completion of daily health declaration forms. Temperature screening will be conducted at ali entry points. individuals presenting symptoms will be denied entry and advised to seek medical consuitation. Faculty members must incorporate these protocols into class management procedures. Students who fail to comply may face disciptinary action including suspension of class privileges. All offices must designate heaith and safety officers. For concerns, contact the University Health Services Office at extension 2345 or email healihservices university edu ph. Thank you for your cooperation. JOHN NICHOLSON Dean, Coliege of Arts and Sciences College of Aits and Sciences"
    },
    {
        "image": "announcement1_synth_2_aug5.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espana Boulevard, Manila 1015 ADMINISTRATIVE MEMORANDUM To: Academic Community From: JOHN NICHOLSON, Dean, College of Arts and Sciences Date: November 04, 2025 t: Guidelines for Final Examination Period AY 2024 2025 cial notification regarding the implementation of tocols effective immediately across all university t of Health (DOH) and Commission on Higher Education (CHED) guidelines, all students, faculty, staff, and visitors must observe the following: proper wearing of face masks in enclosed spaces, regular hand sanitization, maintenance of physical distancing, and completion of daily health declaration forms. Temperature screening will be conducted at all entry points. Individuals presenting symptoms will be denied entry and advised to seek medical consultation. Faculty members must incorporate these protocols into class management procedures. Students who fail to comply may face disciplinary action including suspension of class privileges. All offices must designate health and safety officers. For concerns, contact the University Health Services Office at extension 2345 or email healthservices university edu ph. Thank you for your cooperation. Subjec This memorandum provides offi enhanced health and safety pro facilities. In compliance with Departmen JOHN NICHOLSON Dean, College of Arts and Sciences College of Arts and Sciences"
    },
    {
        "image": "announcement1_synth_3_aug1.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avenue, Manila 1004 ACADEMIC MEMORANDUM To: Academic Community From: JENNIFER WATSON, University President Date: October 29, 2025 Subject: Guidelines for Final Examination Period AY 2024 2025 This serves as official notification of the schedule and guidelines for the Final Examination Period for Academic Year 2024 2025, Second Semester. The final examination period is scheduled from June 3 14, 2025. All faculty members must submit examination schedules to the Office of the University Registrar by May 15, 2025. Students must present valid identification cards during examinations. Calculators and electronic devices are prohibited unless authorized. Any violation will be subject to disciplinary proceedings. Faculty must submit final grades within five (5) working days after the last examination. Grade encoding will be done through the online faculty portal exclusively. Make up examinations must be scheduled within two weeks after the regular period with proper documentation. For questions, contact the Office of the University Registrar at registrar university edu ph or visit Room 204, Administration Building. JENNIFER WATSON University President Office of the Vice President for Academic Affairs"
    },
    {
        "image": "announcement1_synth_3_aug2.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avenue, Manila 1004 ACADEMIC MEMORANDUM To: Academic Community From: JENNIFER WATSON, University President Date: october 29, 2025 Subject: Guidelines for Final Examination Period AY 2024 2025 This serves as Official notification of the schedule a Examination Period for Academ examination period is schedule: nd guidelines for the Final ic Year 2024 2025, Second Semester. The final d from June 3 14, 2025. All faculty members must submit examination Schedules to the Office of the University Registrar by May 15, 2025. Students must present valid identification cards during examinations. Calculators and electronic devices are prohibited unless authorized. Any violation will be subject to disciplinary Proceedings. Faculty must submit final grades within five (5) working days after the last examination. Grade encoding will be done through the online faculty Portal exclusively. Make up examinations must be Scheduled within two weeks after the regular period with Proper documentation. For questions, contact niversity edu ph Or visit Room JENNIFER WATSON University President Office of the Vice President for Academic Affairs"
    },
    {
        "image": "announcement1_synth_3_aug3.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Tatt Avenue, Manila 1004 ACADEMIC MEMORANDUM Te: Academic Community From: JENNIFER WATSON, University President Date: October 29, 2025 Subject: Guidelines for Final Examination Period AY 2024 2025 This serves as official notification of the schedule and guidelines for the Final Examination Period for Academic Year 2024 2025, Second Semesier. The final examination period is scheduled from June 3 14, 2025. Ail faculty members must submit examination schedules to the Office of the University Registrar by May 15, 2025. Students must present valid identification cards during examinations. Calculators and electronic devices are prohibited unless authorized. Any violation will be subject to disciplinary proceedings. Faculty must submit final grades within five (8) working days after the jast examination. Grade enceding will be done through the online faculty portal exclusively. Make up examinations must be scheduled within two weeks after the regular period with proper documentation. For questions, contact the Office of the University Registrar at registrar university edu ph or visit Room 204, Administration Building. JENNIFER WATSON University President Office of the Vice President for Academic Affairs"
    },
    {
        "image": "announcement1_synth_3_aug4.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSIT 2401 Tatt Avenue, Manila 1004 ACADEMIC MEMORANDUM Fo: Acadersic Community From: JENNIFER WATSON, Uni Gat TAY 25 “ination Fi ielines for Final Ex: Subject: Gu This serves as official notification of ihe schedule and guidelines for the Final Examination Period for Academic Year 2024 2025, Second Semester. The fina! examination period is scheduied from June 3 14, 2025. All faculty members must submit examination scnedules to the Office of the University Registrar by May 15. 2025. Students must present valid identification cards during examinations. Calculators and electronic devices are prohibited unless authorized. Any violation will subject to disciplinary proceedings. Faculty must submit final grades within five (5) working days after the last examination. Grade encoding will be done through the online faculty portal exciu y. Make up examinations must be scheduled within two weeks after the regular peried with proper documentation. Fr estions, contact the Offi f the University Registrar at registrar university edu ph or visit Room 204, Administration Building. be JENNIFER WATSON University President Office ce President for Acari"
    },
    {
        "image": "announcement1_synth_3_aug5.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avenue, Manila 1004 ACADEMIC MEMORANDUM To: Academic Community From: JENNIFER WATSON, University President Date: October 29, 2025 Subject: Guidelines for Final Examination Period AY 2024 2025 This serves as Official Notification of the schedule Examination Period for Aca demic Year 2024 202 €xamination Period is scheduled from June 3 14 and guidelines for the Final 5, Second Semester. The final st submit mination. Grade encodin online faculty portal exclusively, Make up examinations mu two weeks after the regular Period with Proper documentati the Office of the University Registrar at registrar universit 204, Administration Building. final grades within five 9 will be done through the st be scheduled within ion. For questions, contact 'Yy du ph or visit Room JENNIFER WATSON University President Office of the Vice President for Academic Affairs"
    },
    {
        "image": "announcement1_synth_4_aug1.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMaty Manila ADMINISTRATIVE MEMORANI uM Fro Date Sublect delines on Penod AY 202 This serves as Official notification of the Examina n Parlod for Aca examination period j submit exa 2025. Students schedule and guid demic Year 2 2025, S scheduled from June 3 44. auion schedules to ihe Office of the University Reg MUST present valid identification cards during exary iculators and electronic be subject Ines for the Fing! d Semester, The final 2025. AL faculty members must trar by May 75, t yest nations, horized. 4 AY Violation will Faculty must submit final grades within five y g ation. Grade enoadinc will be done through the ke up examinations must he scheduled wy two weeks after the regular period with proper docume: entation. For qu ihe Office of the University Registrar at registrar university edu p 204, Administration Building, device to disciplinary procee (5) working days afler the last exa oniine faculty portal excti Ma are prohibited unless aut hin ons, contact nor visit Room BRIDGET Univ"
    },
    {
        "image": "announcement1_synth_4_aug2.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Diliman, Quezon City 1101, Metro Manila ADMINISTRATIVE MEMORANDUM To: University Community From: BRIDGET SMITH, University Registrar Date: October 31, 2025 Subject: Guidelines for Final Examination Period AY 2024 2025 This serves as official notification of the schedule and guidelines for the Final Examination Period for Academic Year 2024 2025, Second Semester. The final examination period is scheduled from June 3 14, 2025. All faculty members must submit examination schedules to the Office of the University Registrar by May 15, 2025. Students must present valid identification cards during examinations. Calculators and electronic devices are prohibited unless authorized. Any violation will be subject to disciplinary proceedings. Faculty must submit final grades within five (5) working days after the last examination. Grade encoding will be done through the online faculty portal exclusively. Make up examinations must be scheduled within two weeks after the regular period with proper documentation. For questions, contact the Office of the University Registrar at registrar university edu ph or visit Room 204, Administration Building. BRIDGET SMITH University Registrar Office of Student Affairs and Services"
    },
    {
        "image": "announcement1_synth_4_aug3.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Miiman, Quezon Gity 7101, Metre ADMINISTRATIVE MEMORANDUM Fo: University Community Subject: Guidetines for Final Examination Period AY 2024 2025 This serves as official notification of the schedule and guidelines for the Final Examination Period for Academic Year 2024 2025, Second Semester. The final examination period is scheduled frorn June 3 44, 2025. All faculty members must submit examination schedules to the Office of the University Registrar by May 15, 2025. S cation cards during examinations. Caloulators and electronic devices are prohibited unless authorized. Any violation will be sublect to disciplinary proceedings. Faculty must submit finai grades within fi (5) working days after the last examination. Grade encoding will be done through the online faculty portal exclusively. Make up examinations must be scheduled within two weeks after the regular period with proper documentation. For tions, coniact the Office of the University Registrar at regisirar university edu ph or visil Room 204, Administration Building. tudents must present valid identifi fh BRIDGET SMITH ity Registrar Office of Student Alters and S"
    },
    {
        "image": "announcement1_synth_4_aug4.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Diliman, Quezon City 1101, Metro Manila IMINISTRATIVE fEMORANDUM pomimunity: slines for the econd Semester. The final ne 3 474, 2025. All facully members must of the University Registrar by May 15, 1 identification cards during examinations. re prohibited unless autho 5. Students must present va (S} working days after the last examination. Grade encoding will be done through the onine faculty portal exclusively. Make up examinations must be sc led within two weeks after the regular period with proper documentation. For questions, contact the Office of the University Registrar at registrar university edu_oh or visif Room 204, Administration Building. Student Affai"
    },
    {
        "image": "announcement1_synth_4_aug5.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN ADMINISTRATIVE MEMORANDUM riod AY 202. nes for Final E This serves as official notification of the schedule and guidelines for the Final Examination Period for Academic Year 2024 2025, Second Semester. The final examination period is scheduled from June 3 14, 2025. All facuity members must submit examination schedules to the Office of the University Registrar by May 15, 2025. Students must present valid ider Calculators and electroni ty must submil final grades wilhin five mination. done through the jake up examinations must be scheduled within d with proper documentation. For questions, contact rar university edu ph or visit Room gq days after the sulty portai exciusively two weeks after the regular pe the Office of the University Registrar at regis 204, Administration Building. Olfice of Student 4"
    },
    {
        "image": "announcement1_synth_5_aug1.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avenue, Manila 1004 ADMINISTRATIVE MEMORANDUM To: Ai Sepanment Heads From: HAILEY RUBIO, Vice Chancetlor for Administration Date: november 06, 2025 Subject: Mandatory Training Program for Faculty Development This serves as official notification of th Examination Period for Academic Yea 2025. All faculty members must ce of the University Registrar by May 15, fication cards during examinations. rohibited unless authorized. Any violation will submit examination schedules to the Offi 2025. Students must present valid identi Calculators and electronic devices are p HAILEY RUBIO Vice Chanceitor for Administration Graduate School Office"
    },
    {
        "image": "announcement1_synth_5_aug2.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avenue, Manila 1004 ADMINISTRATIVE MEMORANDUM To: All Department Heads From: HAILEY RUBIO, Vice Chancellor for Administration Date: November 06, 2025 Subject: Mandatory Training Program for Faculty Development This serves as official notification of the schedule and guidelines for the Final Examination Period for Academic Year 2024 2025, Second Semester. The final examination period is scheduled from June 3 14, 2025. All faculty members must submit examination schedules to the Office of the University Registrar by May 15, 2025. Students must present valid identification cards during examinations. Calculators and electronic devices are prohibited unless authorized. Any violation will be subject to disciplinary proceedings. Faculty must submit final grades within five (5) working days after the last examination. Grade encoding will be done through the online faculty portal exclusively. Make up examinations must be scheduled within two weeks after the regular period with proper documentation. For questions, contact the Office of the University Registrar at registrar university edu ph or visit Room 204, Administration Building. HAILEY RUBIO Vice Chancellor for Administration Graduate School Office"
    },
    {
        "image": "announcement1_synth_5_aug3.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSITY 24 Talt Avenue, Manila 1004 ADMINISTRATIVE MEMORANDUM ment Hea mer 06, This serves as official notification of the schedule and guidelines for the Fina! Examination Period for Academic Year 2024 2025, Second Seamaster. The final examination period is scheduled from dune 3 14, 2025. Al faculty members must submit examination schedules to the Office of the University Registrar by May 15, 2625. Students must present valid identification cards during examinations, Caicuiafors and electronic devi are prohibited unless authorized. Any violation wil be subject to disciplinary proceedings. Facuity rust submit final grades within five (5) working days alter the last examination. Grade encoding will be done th igh the online faculty portal exclusively. Make up examinations must be scheduled within iwo weeks after the reguiar period with proper doc! the Office o umentation, For questions, contact the University Registrar at registrar @university edu ph or y 204, Administration Building. sit Room HALEY RUBIO"
    },
    {
        "image": "announcement1_synth_5_aug4.png",
        "label": "announcement",
        "ocr_text": "DELA SALLE UNIVERSITY 2401 Taft Avenue, Manila 1004 ADMINISTRATIVE MEMORANDUM To: All Department Heads From: HAILEY RUBIO, Vice Chancellor for Administration Date: November 06, 2025 Subject: Mandatory Training Program for Faculty Development al notification of the schedule and guidelines for the Final This serves as Offici Examination Period for Academic Year 2024 2025, Second Semester. The final examination period is scheduled from June 3 14, 2025. All faculty members must submit examination schedules to the Office of the University Registrar by May 15, 2025. Students must present valid identification cards during examinations. Calculators and electronic devices are prohibited unless authorized. Any violation will must submit final grades within five be subject to disciplinary proceedings. Faculty (5) working days after the last examination. Grade encoding will be done through the online faculty portal exclusively. Make up examinations must be scheduled within two weeks after the regular period with proper documentation. For questions, contact the Office of the University Registrar at registrar university edu ph or visit Room 204, Administration Building. HAILEY RUBIO Vice Chancellor for Administration Graduate School Office"
    },
    {
        "image": "announcement1_synth_5_aug5.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Avenue, Manila 1004 ADMINISTRATIVE MEMORANDUM To: All Department Heads From: HAILEY RUBIO, Vice Chancellor for Administration Date: November 06, 2025 Subject: Mandatory Training Program for Faculty Development This serves as Official notification of the schedule and guidelines for the Final Examination Period for Academic Year 2024 2025, Second Semester. The final examination period is scheduled from June 3 14, 2025. All faculty members must submit examination schedules to the Office of the University Registrar by May 15, g examinations. 2025. Students must present valid identification cards durin Calculators and electronic devices are prohibited unless authorized. Any violation will be subject to disciplinary proceedings. Faculty must submit final grades within five (5) working days after the last examination. Grade encoding will be done through the online faculty portal exclusively. Make up examinations must be scheduled within two weeks after the regular period with proper documentation. For questions, contact the Office of the University Registrar at registrar university edu ph or visit Room 204, Administration Building. HAILEY RUBIO Vice Chancellor for Administration Graduate School Office"
    },
    {
        "image": "announcement1_synth_6_aug1.png",
        "label": "announcement",
        "ocr_text": "SHNIC UNIVE IE PHILIPPIN Manila 7046 MEMORANDUM and Staff BIANCA SHIELDS, Dir Participation Y sation of the schedule and guid Academic Year 2024 2025, Seco examination period cheduled from June 3 1 submit examination schedules to the Office of 2025. Studenis musi present valid vices are prohibted un sedings. Faculty must submit fin (S) working days after the last ex on. Grade encoding will be dene through the online faculty portal exclusiv M uD exert must be scheduled within two weeks after the regular period with prox focumentation, For questions, contact the Office of the University Registrar at registrar university edu oh or visit Room 204, Administration Bullding. or the Final ne final rust 45, Mes BIANCA urce"
    },
    {
        "image": "announcement1_synth_6_aug2.png",
        "label": "announcement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Anonas Street, Sta. Mesa, Manila 1016 MEMORANDUM To: Faculty and Staff From: BIANCA SHIELDS, Director, Human Resource Development Office Date: October 19, 2025 Subject: New Policy on Student Attendance and Participation This serves as official notification of the schedule and guidelines for the Final Examination Period for Academic Year 2024 2025, Second Semester. The final examination period is scheduled from June 3 14, 2025. All faculty members must submit examination schedules to the Office of the University Registrar by May 15, 2025. Students must present valid identification cards during examinations. Calculators and electronic devices are prohibited unless authorized. Any violation will be subject to disciplinary proceedings. Faculty must submit final grades within five (5) working days after the last examination. Grade encoding will be done through the online faculty portal exclusively. Make up examinations must be scheduled within two weeks after the regular period with proper documentation. For questions, contact the Office of the University Registrar at registrar university edu ph or visit Room 204, Administration Building. BIANCA SHIELDS Director, Human Resource Development Office Office of the University President"
    },
    {
        "image": "announcement1_synth_6_aug3.png",
        "label": "announcement",
        "ocr_text": "POLYT ECHNIC UNIVERSITY of E PHIL] IPPINES Anonas Stree} Mesa, Manila TOS MEMORANDUM BCE: Ney f On Student Attend This Serves ag Official notifies AROe and Parties ation of the Schedule and QUidalines fp the Finaj Examinati (OP Period tor Acadamic Year 2024. 2025, Second Sem fester, The fing! examination Period ig \"Sched led from June 3 44, 2025. All fa aculty men, iDErs must Mation s: chedules to the Offlee of u University Registrar by ents must Present valid identifica OM Cards during &xaminatio: S and electronic devices are Prohibiteg unless auth be subject [0 discips Daly broceeding aS. Facute YY Must submit HW {3} Working cays after the allon, G de enc Online faculty Poral exch Make. “UB exami: lwo weeks after the regular periog with prope {he Office of the Unive ty Registrar at re a SUDInit exanyi 2025. Sty Calculator May 15, ns. Zed. Any y Violation will Nal grades WERIN five SOdiNG will be done through the nations mast 08 sche duled with] is) T documents: fon. For questi ONS, Contact egistrar u; niversity edu. DR or visit Room fast examin USively. BLANCA SHIELDS o, Human R, UNe8OUICe Development ty President"
    },
    {
        "image": "announcement1_synth_6_aug4.png",
        "label": "announcement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES et, Sta. Mesa, Ma An MEMORANDUM Particl Policy on Student Aitendar the schedule ines for the Final 1 2024 202 ond Semester. The fina! 3 44, 2025. All facuity members must strar by May 15, xaminations. ed, Any violation will sg within five as official notification of Pariod fOr Academic Yea ‘ued from June yifice of the Unive! niification cards durin jlavices are prohibited unes i i somit final grade ibe done gnrough the scheduled within ns, contact Ong! be subject to fs) (6) working da online faculty por two weeks alter the regui of the Unive the Off 204, Administration Building. ast examinaucn. Grade iy. Make Up examinailions must b t documentation. For gu _ph or visit Room"
    },
    {
        "image": "announcement1_synth_6_aug5.png",
        "label": "announcement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES a, Mesa, Manila 4016 From: BANG! Date: Octeh New Policy on official notification Student Attensa eg for the Final schedule and quik ademic Year 2024 2025, Second Semester. 1 3 44, 2025. Aj faculty ambers must of the Universily Ragistrar by May 15, uning examinations. sed. Any violation ww This serves a of the Examination Period for Ac The examination period is scheduled from June gubrmil exe ation schedules to the Office 2025. Students musi present yalid identifi Calculators and electronic devices are prom pe subject to disciplinary proceed s. Facul (By worRING days after the iast examination. Grad ity portal exclusively Make up examin after the reguiar per doo! period with prof the University Regi n cards d ed uniess authori ny must submit final grades within five e encoding will be done through the ations must be scheduled within umentation. For qui ions, contact y edu ph of VIB Room online facu two weeks the Office aod, Admin sirar at registrar univers ation Building. Office Resource Develupr"
    },
    {
        "image": "announcement1_synth_7_aug1.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Diliman, Quezon City 1101, Metro Manila ACADEMIC MEMORANDUM To: All Department Heads From: AaRON FRANK, Dean, Graduate School Date: November 11, 2025 Subject: Implementation of Enhanced Health and Safety Protocols This memorandum announc Program scheduled for the intersession period to enhance 3456 or hrdo university edu ph. AARON FRANK Dean, Graduate School Office of Student Affairs and Services es the mandatory Faculty Development Training teaching competencies"
    },
    {
        "image": "announcement1_synth_7_aug2.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Oilman, Quezon City 1701, Metro Manila ACADEMIC MEMORANDUM To: Al Department Heads Front: AARON FRANK, Dean, Graduate Date: november 14 Subject: impiomantation of Ahanced Health ang Safety Protocols This memorandum announces the mandatory Faculty Development Training Program scheduled for the intersession period to enhance teaching competencies and pedagogical skills. The training program will run from May 20 24, 2025, at the University Conference Center. All full time faculty members are required to attend Topics inciude innovative teaching methodologies, educational technology integration, outcomes b assessment, and research writing. Registration is required through the online faculty portal by May 10, 2025. Certificate of participation will be issued and credited toward faculty development requirements. Resource persons include distinguished educators from leading universities, CHED technical committee members, and published scholars. Interactive workshops and collaborative activities are integrated throughout. The university will provide meals and training materials. Travel reimbursements will follow standard policies. For program details, contact the Human Resource Development Office at extension 3456 oF hrdo university edu ph AARON FRANK Dean. Graduate Schoot Office of Student Affans anc Services"
    },
    {
        "image": "announcement1_synth_7_aug3.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Diliman, Quezon City 1101, Metro Manila ACADEMIC MEMORANDUM To: All Department Heads From: AARON FRANK, Dean, Graduate School Date: November 11, 2025 Subject: Implementation of Enhanced Health and Safety Protocols This memorandum announces the mandatory Faculty Development Training Program scheduled for the intersession period to enhance teaching competencies and pedagogical skills. The training program will run from May 20 24, 2025, at the University Conference Center. All full time faculty members are required to attend. Topics include innovative teaching methodologies, educational technology integration, outcomes based assessment, and research writing. Registration is required through the online faculty portal by May 10, 2025. Certificate of participation will be issued and credited toward faculty development requirements. Resource persons include distinguished educators from leading universities, CHED technical committee members, and published scholars. Interactive workshops and collaborative activities are integrated throughout. The university will provide meals and training materials. Travel reimbursements will follow standard policies. For program details, contact the Human Resource Development Office at extension 3456 or hrdo university edu ph. AARON FRANK Dean, Graduate School Office of Student Affairs and Services"
    },
    {
        "image": "announcement1_synth_7_aug4.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Diliman, Quezon City 1101, Metro Manila ACADEMIC MEMORANDUM To: Al) Department Heads Fromm: AARON FRANK, Dean, Graduzte Schoot Date: November 11, 2025 Subject: implementation of Enhanced Health and Safety Protocols This memorandum announces the mandatory Faculty Development Training Program scheduled for the intersession period to enhance teaching competencies and pedagogical skills. The training program will run from May 20 24, 2025, at the University Conference Center. Ail full time faculty members are required to attend. Topics include innovative teaching methodologies, educational technology integration, outcomes based assessment, and research writing. Registration is required through the online faculty portai by May 10, 2025. Certificate of participation will be issued and credited toward faculty development requirements. Resource persons include distinguished educaiors from leading universities, CHED technica! committee members, and published scholars. Interactive workshops and collaborative activities are integrated throughout. The university will provide meals and training materials. Travel reimbursements will follow standard policies. For program detalis, contact the Human Resource Development Office at extension 3456 or hrdo university edu ph. AARON FRANK Bean, Graduate Schoo! Office of Student Affairs and Services"
    },
    {
        "image": "announcement1_synth_7_aug5.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN 101, Metro Manita ACADEMIC MEMORANDUM Te: hanced Health and Safety Proto ining announces ihe mandatory Facully D lod te ent s. The training program wil run ime facully membe This m petencies y 20 24, 2025, at the te attend red to attend. e nee Center. All full iclude Innovative teaching outcomes based assessment, anc h ihe online f. redited integratic uired tt ured a ude distinguished educat ers, and published scholars. i integrated throughout. 1 Travel reimbursemen iact the Human F urce Dey ersity edu ph,"
    },
    {
        "image": "announcement1_synth_8_aug1.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY oe, Quezon CHY 4408 tor, H1 for Final Examination Pe on of the sc Year 20 for the Final er, The final re must May 15, idalines neduie and guidelines 24 2925, Second Seme This serves Academic m june 3 14, 2025. Ali facuity me versity Regisirar by as official notificati exarnination Period fc examination period 1s scheduled [ror submit 2) mination schedules to the office of the U 3025, Students rnust present valid identification cards duiing examinations. Calcuiators and electronic devices ted unless authorized. Any vi be subject to disciplinary proceedings. Facu ybmit final grades within five (5) working days afte! the last exary will pe done through the 2 faculty portal exclusively. Make u a scheduled within after the regular period with proper documentation, For questions, contact f the University Registrar at registrar unwersity edu Pn or visit Room ation will are pronibl Foy must St jination, Grace encoding examinations rust b two weeks the Office 204, AGRANUS! dion Bulsing."
    },
    {
        "image": "announcement1_synth_8_aug2.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Katipunan Avenue, Quezon City 1108 MEMORANDUM To: All College Deans From: ROBERT JACKSON, Director, Human Resource Development Office Date: November 06, 2025 Subject: Guidelines for Final Examination Period AY 2024 2025 This serves as Official notification of the schedule and guidelines for the Final Examination Period for Academic Year 2024 2025, Second Semester. The final examination period is scheduled from June 3 14, 2025. All faculty members must submit examination schedules to the Office of the University Registrar by May 15, 2025. Students must present valid identification cards during examinations. Calculators and electronic devices are prohibited unless authorized. Any violation will be subject to disciplinary proceedings. Faculty must submit final grades within five (5) working days after the last examination. Grade encoding will be done through the online faculty portal exclusively. Make up examinations must be scheduled within two weeks after the regular period with proper documentation. For questions, contact the Office of the University Registrar at registrar university edu ph or visit Room 204, Administration Building. ROBERT JACKSON Director, Human Resource Development Office Graduate School Office"
    },
    {
        "image": "announcement1_synth_8_aug3.png",
        "label": "announcement",
        "ocr_text": "Date: Nover dalines f Subject: Guide This serves 4 tion Period for Al Examing examination period submit examinato 2025. Students must P Caiculators 5} working oniine faculty Po avo weeks the Office 204, Admi ROBERT JA LACKSON, Dirac ect to disciplinary ATEN U Katipunan EO DE MANILA NIVERSITY Avenue, Cul MEMORANDUM Deans tor, Human Re pat 08, 2025 aj Examination P as official notificati ig schedul ton schedules and electronic dev days after the last rial exclusive after ihe reguik of the Univers nistraten Building. cademic Year ed from June resent Va proceedings. ity Registra od AY 2024 2025 eri on of the schedule 2024 2025, Secent 2025. Att faculiy memoe ity Registrar by May 15, ations. 3 14, to the Off fd Kentifice ices are prohibited Faculty yy. Make Up examir with proper docu rat registrar Sreduat Hoel OFC of the Univers! dion gon, Grade encod ezon City 1408 delines for the and gui Semester. ards during examin unless quthorized. AY ust submit nations MUS mentation. For que @university edu. Ph ory grades wih ing will be done {be scheduled within The final sers must violation wil in five through the mg, comtact isi Room"
    },
    {
        "image": "announcement1_synth_8_aug4.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Katipunan Avenue, Quezon City 7108 MEMORANDUM This serves as official notification of the schedule and guidelines for the Finai Examination Period for Academic Year 2024 125, Second Semesier. The final examination period is scheduled from June 3 14, 2025. All faculty members must submit examination schedules to the Office of the University Registrar by May 15, 2925. Students must present valid identification cards during examinations. Calculators and electronic devices are prohi thorized. Any violation wil be subject fo disciplinary proceedings. Facully must sub nal grades within five (S) working days after the last examination. Grade encoding will be don through the online faculty portal exclusively. Make up examinations must be scheduled within two weeks after the regular period with proper documentation. For questions, contact University Registrar at registrar university edu ph or visit Room n Building. the Office of the 204, Administra ERT JACKSON RO! 2 Develop Director, Hurnan Res"
    },
    {
        "image": "announcement1_synth_8_aug5.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Katipunan Avenue, Quezon City 1108 MEMORANDUM To: All College Deans From: ROBERT JACKSON, Director, Human Resource Development Office Date: November 06, 2025 Subject: Guidelines for Final Examination Period AY 2024 2025 This serves as official notification of the schedule and guidelines for the Final Examination Period for Academic Year 2024 2025, Second Semester. The final examination period is scheduled from June 3 14, 2025. All faculty members must submit examination schedules to the Office of the University Registrar by May 15, 2025. Students must present valid identification cards during examinations. Calculators and electronic devices are prohibited unless authorized. Any violation will be subject to disciplinary proceedings. Faculty must submit final grades within five (5) working days after the last examination. Grade encoding will be done through the online faculty portal exclusively. Make up examinations must be scheduled within two weeks after the regular period with proper documentation. For questions, contact the Office of the University Registrar at registrar university edu ph or visit Room 204, Administration Building. ROBERT JACKSON Director, Human Resource Development Office Graduate School Office"
    },
    {
        "image": "announcement1_synth_9_aug1.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espafia Boulevard, Manila 1015 UNIVERSITY MEMORANDUM Community From: AMANDA RAY. Sean Bate: Nover 028 FOO? Schedule of Aca vitles for Second This serves as official Netifleation Examination Period for Academi examination Sriod is Schedu Submit examination 2028, Studenis must Calculators and eleo be subject to disc of the Schedule a ic Year 2024 “2025 trom June S44, shedules to the Office of Sent valid ide; co device nd guidelines for the Fing! ond Semesier, The final 2025. Ail faculty mey bers must ersity Registrar by May 75, iCalion cards during examinations, are prohibited unie toni &sS authorized Any violation wil Dlinary 3 dings. Faculty must Submit final Stades within five (5) working days after the last examinatio onlin: faculty iwo weeks afler the regular period ihe Office of the University Regisir, 204, Administration Building. ion. Grade encodin ake up examination, with proper docum ar at registrar@ 9 Will be done through the Portal Exclusively, M S must be Scheduled within entation. For guestions, contact versity edu ph OF Visit Room AMANDA Ray Dean, Gi Wale Schoo"
    },
    {
        "image": "announcement1_synth_9_aug2.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS ES 1a Boulevard, Manila 1015 UNIVERSITY MEMORANDUM From: an, ADA RAY, Dean, Gr Schoo Bate: November 12, 2025 Subject: Schedule o nademic eS for Second Semester This serves as Official notification of the Sct Examination Period fi Acaden examination period iS Schedule. submit examination schedy} 2025. Students Must prese Calculators q be subject to discip} work ledule and guidelines for tha Final WG Year 2024 2025, Second Semester. The final d from June 3 14, 2025, All faculty members must 8 to the Office of the University Registrar by May 15, Ag examinations, sation cards duri hibited uni Orc devices are pro! SS authorized, Any violation will Mary proce dings. Faculty m Submit final Glades within five Ng days after the fast examination, Grade er ding will be done through the online facully portai exclusively, Make up &xaminations must be scheduled within two weeks aiter the Feguiar period with proper documentation, For questions, contact the Office of the University Registrar at ‘egistrar university edu ph OF visit Room 204, Adminis ation Building, AMANDA Ray Graduate Senoy) Graduate Schost Office"
    },
    {
        "image": "announcement1_synth_9_aug3.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espafia Boulevard, Manila 1045 UNIVERSITY MEMORANDUM From: AMANDA Ray. Bea {@. November 12, 2026 of Second Semester notification of the schedule and guidelines for the Final “Xamination Period for Academic Year 2024 2025, Second Se period is scheduled from June 3 14, 2025. All faculty membe. submit examination schedules to the Office of the University Registrar by May 15, 2025. Students must present valid identification cards during examinations. Caiculators and electronic devices are prohibited unless authorized. Any be subject to disciplinary proceedings Faculty must submit final grades within five (5) working days after the last examination, Grade encoding will be done thro gn the Online faculty porta! exciusively, Make up examinations must be scheduled within iwo weeks alter the ar period with proper aocumentation. For questions, contact the Office of the Univ sity Registrar at registrar university edu ph or visit Room 204, Administration Building, @r. The final Violation wil"
    },
    {
        "image": "announcement1_synth_9_aug4.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espafia Boulevard, Manila 1015 UNIVERSITY MEMORANDUM Tes u oity Community Fron: AMANDA RAY, Dean, Graduate School Date: November 12, 2925 ities for Sacond Semesier ademic Acti Subject: Schedule This serves as official notification of the schedule and guidelines for the Final Examination Period for Academic Year 2024 2025, Second Semester. The final examination period is scheduled from June 3 14, 2025. All faculty members must submit examination schedules to the Office of the University Registrar by May 75, 2025. Students rust present valid identification cards during examinations. Calculators and electronic devices are prohibited unless authorized. Any violation will be subject to disciplinary proceedings. Faculty must submit final grades within five (5) working days after the last examination. Grade encoding will be done through the online faculty portal exclusively. Make up exarninations must be scheduled within two weeks afier the regular period with proper documentation. For questions, contact the Office of the University Registrar at regist i .edu pn or visit Room 204, Administration Building. AMANDA RAY Dean, uate School Graduate Schoo! Office"
    },
    {
        "image": "announcement1_synth_9_aug5.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espan Spe Boulevard, Me OVS O18 UNIVERSITY MEM RANDUM tor Second Semester iciai notification of the schadul 025, Second Semester. The final 14, 2025. All faculty members must frar by May 15, mina’: ized. Any violation will “acuity must submit final grades within five be subjeci to disci (5) working days after the last ation. Grade encading will be done throu the Office of the University Registrar at registrar® 204, Administration Building. AMAR Dean, Gr Graduate"
    },
    {
        "image": "announcement2_synth_11_aug1.png",
        "label": "announcement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Manila, Metro Manila Office of the President Telephone: (02) 8426 6001 loc. 5100 Email: registrar university edu ph Web: www university edu ph November 15, 2025 UNIVERSITY ANNOUNCEMENT RE: Campus Facilities Maintenance Schedule Greetings! The university administration announces the implementation of flexible learning modality for the upcoming semester to provide quality education while ensuring the health and safety of our academic community. LEARNING MODALITIES AVAILABLE: Face to face classes: For laboratory subjects and specialized courses requiring physical presence Online synchronous: Real time virtual classes via approved learning management platforms Online asynchronous: Self paced learning through recorded lectures and modules Hybrid format: Combination of face to face and online delivery methods Students will be informed of their class modalities through official email and the student portal. Faculty members will provide course syllabi indicating the learning format, schedule, and assessment methods. GUIDELINES AND REQUIREMENTS: All students must maintain reliable internet connection for online classes. Technical requirements include computer or mobile device with camera and microphone. Face to face participants must comply with health protocols. The university commits to providing technical support and learning resources through the Information Technology Services Office and the University Library. For assistance, contact your respective college offices or the Office of Student Affairs. KAYLA STEVENS University Registrar"
    },
    {
        "image": "announcement2_synth_11_aug2.png",
        "label": "announcement",
        "ocr_text": "POLYTECHNIC UNIVERSITY GF THE PHILIPPINES Manila, Metro Manila Office of the Pi (02) 8426 6001 foc. 5100 Emaii: re November 15, 2025 UNIVERSITY ANNOUNCEMENT RE: Campus Facilities Maintenance Schedule Greetings! The university administration announces the implementation of flexible learning modaiity for the upcoming semester to provide quality education while ensuring the health and safety of our academic community. LEARNING MODALITIES AVAILABLE: Face to face classes: For laboratory subjects and specialized courses requiring physical presence Online synchronous: Real time virtual classes via approved learning management platforms Online asynchronous: Self paced jearning through recorded lectures and modules Hybrid format: Combination of face to face and online delivery methods Students will be informed of their class modalities through official email and the student portal. Faculty members will provide course syilabi indicating the learning format, schedule, and assessment methods. GUIDELINES AND REQUIREMENTS: Ail students must maintain reliabie internet connection for online classes. Technical requiremenis include computer or mobile device with camera and microphone. Face to face participants must comply with healih protocols. The university commits to providing technical support and learning resources through the information Technology Services Office and the University Library. For assistance, contact your respective college offices or the Office of Student Affairs. KAYLA STEVENS University Registrar"
    },
    {
        "image": "announcement2_synth_11_aug3.png",
        "label": "announcement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES ila, Metro Manila Telephone: (02) 8426 6004 joc. £100 Ema. reqistval sity edu oh I November 15, 2025 UNIVERSITY ANNOUNCEMENT 5 Maintenance Schedule RE. Campus Fac jementation of flexible learning modality for the upcoming ation announces the imp acemic community LEARNING Greetings! The university administra semester to provide quality education while ensuring the heaith and safety of our ac MODALITIES AVAILABLE: Face to face classes: For laboratory subjects and specialized courses requinng physical presence Oniine synchroncus: Real time virtual classes via approved learning management platforms Ontine asynchronous. Self paced iearning through recorded lectures and modules Hybrid format: Combination of face to face and online delivery methods Students wil] be informed of their dent portal. Faculty members class modalities through official email and the stu will provide course syliabi indicating the learning format, schedule, and assessment methods. GUIDELINES AND REQUIREMENTS: Ail students must maintain reliable internet connection for online classes. Technical requirements include mobile device with camera and microphone. Face to face participants must comply with health protocols. The and learning resources through the Information Technology Services Office viding technical support q ontact your respective college offices or the Office of Student Affairs. cornputer oF university commits to pro and the University Library. For assistance, C KAYLA STEVENS Unwersily Registrar"
    },
    {
        "image": "announcement2_synth_11_aug4.png",
        "label": "announcement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Manila, Metro Manila Office of the President Telephone: (02) 8426 6001 loc. 5100 Email registrar university edu ph Web: WWW university edu ph November 15, 2025 UNIVERSITY ANNOUNCEMENT RE: Campus Facilities Maintenance Schedule Greetings! The university administration an semester to provide quality education while KAYLA STEVENS University Registrar"
    },
    {
        "image": "announcement2_synth_11_aug5.png",
        "label": "announcement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Metro Manila Manila, edu ph November 4 52025 UNIVERSITY ANNOUNCEMENT RE: Campus Eacilities Maintenance Schedule ihe implementation of flexible learning modality for the upcoml ihe health and gafety of our acad munity. LEAR plects anc specializes co tration announces ity education while ensuring emic com urses requiring physical Greetings! The university admint MODALITIES AVAILABLE: rae s to face ClASSES. For laboratory SUB Realtime yirtual classes via approved learning management platforms pination of face to face and online delivery Online synchronous. arning through recorded lectures and modules Hybrid format, Com med of their class modailties through official email and t acsessinent methocs. he student portal. Faculty members OUIDELINES AND aced le methods Studenis will be ir course syllabi indi ating the learning for i, scheduis, and ass iabie internet connection for onfine classes. Technical requir moly with health protocols The will provide REQUIRE! computer OF raobile nis must co e information Tec the Office of student Affairs. AENTS: All students must maintain reliable university commits to providing technical and the University Liorary. For assistance, come Face to face participa nicropho! a raspective colle ci your ge offices 6 KAYLA STEVENS"
    },
    {
        "image": "announcement2_synth_12_aug1.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS jetro Manila Office of th 4 4644 Emaik admissions unive: Contact: (02) UNIVERSITY ANNOUNCEMENT RE: Student Organization Re recitation Dear Students and Parents Guardians: The university is pleased to announce the opening of applications for the University Wide Scholarship Program for deserving and qualified students for Academic Year 2025 2026. SCHOLARSHIP : Academic Excellence Scholarship: For students with outstanding academic ormance Financial ‘ance Grant: For students with demonstrated financial need Athletic Scholarship: For varsity athletes with excel performance Cultural Arts Grant: For students with exceptional talent in arts and culture Leadership Award: For stucent AENTS: Must be enrolled full time in an undergraduate leaders with exemplary service record ELIGIBILITY REQUIRE program. Must have completed at least one semester with satisfactory academic standing. Must meet specific criteria jor each scholarship category. Must submit complete documentary requirements. APPLICATION PROCEDURE: Application i are available at the Scholarship Office and the university website. Submit completed forms with required documents to the Office of Student Financial Assistance. Application deadline is December 29, 2025. Scholarships cover tuition and other school fees. Selected scholars must maintain required grade point average anc ply with scholarship terms and conditions. For inguiries, visit the Scholarship Office at the Student Services Building or call extension 3456. 1S. Pa PAUL BURNS {rar y Regis"
    },
    {
        "image": "announcement2_synth_12_aug2.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Manila, Metro Manil Contact: (02) 8524 4611 ik acimissi ty edu ph Website: www university edu ph November 15, 2025 UNIVERSITY ANNOUNCEMENT RE: Student Organization Registration and Accrecitation ‘A Dear Students and Parenis Guarcians: The university is pleased to announce the opening of applications for University Wide Scholarship Program for deserving and qualified students for Academic Year 2025 2026. SCHOLARSHIP CATEGORIES: Academic Excellence Scholarship: For students with outstanding academic performance Financial Assistance Grant: For students with demonstrated financial need Athietic Scholarship: For varsity athletes with excellent performance Cultural Arts Grant: For students with exceptional talent in arts and culture Leadership Award: For siucent leaders with exemplary service record ELIGIBILITY REQUIREMENTS: Must be enrolled full time in an undergraduate program. Musi have completed at least one semester with satisfactory academic standing. Must meet specific criteria for each scholarship category. Must submit complete documentary requirements. APPLICATION PROCEDURE: Application forms are available at the Scholarship Office and the university website. Submit completed forms with required documents to the Office of Student Financial Assistance. Application deadline is December 29, 2025. Scholarships cover tuition and other s. Selected scholars must maintain uired grade point average and comply with scholarship terms and conditions. For inquiries, visit the Scholarship Office at the Student Services Building or call exiension 3456. PAUL BURNS University"
    },
    {
        "image": "announcement2_synth_12_aug3.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Manila, Metro Manila Office of the Rector Contact: (02) 8524 4611 Email: admissions @university edu ph Website: Www university edu ph November 15, 2025 UNIVERSITY ANNOUNCEMENT RE: Student Organization Registration and Accreditation Dear Students and Parents Guardians: The univ University Wide Scholarship Program for deserv: CATEGORIES: Academic Excellence Scholarshi Assistance Grant: For students with demonstrat ersity is pleased to announce the opening of applications for the ing and qualified students for Academic Year 2025 2026. SCHOLARSHIP p: For students with outstanding academic performance Financial ed financial need Athletic Scholarship: For varsity athletes with excellent PAUL BURNS University Registrar"
    },
    {
        "image": "announcement2_synth_12_aug4.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Ma Ollice of ila, Metro Maniia Contact: (02) 85244617 November 15, 2025 UNIVERSITY ANNOUNCEMENT RE: Student Organization Registration and Accreditation Dear Students and Parents Guardians: The university is pleased to announce the opening of applications for the University: Wide Scholarship Program for deserving and quaiified students for Academic Year 2025 2026. SCHOLARSHIP CATEGORIES: Academic Excelience Scholarship: For students with outstanding academic performance Financial 33 cE ts with demonstrated financial need Athietic Scholarship: For varsity athietes with excellent nd culture Leadership Award: For student Assistance Grant: For student performance Cultural Arts Grant: For students with exceptional talent in arts and cu ieaders with exemplary service record El IGIBILITY REQUIREMENTS: Musi be enrolled full time in an undergraduate program. Must have cornpleted at least one semester with satisfactory academic standing. Must meet specific criteria for each scholarship category. Must submit complete documentary requiremenis. APPLICATION PROCEDURE: Application fine and the university website. Submit completed forms with required documents to 2025. Scholarships cover tuition and other ply with scholarship terms and forms are available ai the Scholarship Off ihe Office of Student Financial Assistance. Application deadiine is December 29 school fees. Selected scholars must maintain required grade point average and comme conditions. For inquiries, visit the Scholarship Office at the Student Services Building or call extension 3456. PAUL BURNS University Registrar"
    },
    {
        "image": "announcement2_synth_12_aug5.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Manila, Metro Manila UNIVERSITY ANNOUNCEMENT nation tation ation and Acc RE: Student Organization Registr unce the opening of applications for the ic Year 2025 2026. SCHOLARSHIP tic performance Financial cellent niversity is pleased to anno and qualified students for Academ or students with outstanding ace ed Athletic Scholar nance Cullural Arts Grant: For students with exceptional talent in aris and leaders with exemplary service record ELIGIBILITY REQUIREMENTS e enrolied fullime in an undergrad at least one semester with salisfactory ac ademic standing. Musi m specific crit cumentary fr amenis. APPLICATION PRi URE: Applic Scholarship Office and the university w _ Submit complet 2. Application deadlin acember 2 University Wide Scholarship Program for deser Academic Excellence Scholars “or varsity athle tin ar Mus PUSE DO +, é olarship category. Must submit con é schoo! fees. S conditions. F: inquiries, visit the Scholarship Office at the Student Services Building or call extension 3456. PAUL BURNS"
    },
    {
        "image": "announcement2_synth_13_aug1.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila Office of the Chancellor Contact: (02) 8524 4611 Email: admissions university edu ph Website: www university edu ph November 06, 2025 OFFICIAL ANNOUNCEMENT RE: Library Services and Resource Access Guidelines Good day! This serves as official announcement regarding the extension of the enrollment period for the Second Semester, Academic Year 2024 2025. The enrollment deadline has been extended to accommodate students who were unable to complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until December 03, 2025 Late enrollment (with surcharge): December 04, 2025 to December 09, 2025 Adding and dropping of subjects: December 06, 2025 to December 13, 2025 All students are required to complete online pre enrollment through the student portal before proceeding to payment. Walk in enrollment is available at the Registrar s Office during office hours (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tuition fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will result in forfeiture of slot and may affect scholarship grants. Students with unpaid balances from previous semesters must settle obligations before enrollment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation. CARRIE STEIN University President"
    },
    {
        "image": "announcement2_synth_13_aug2.png",
        "label": "announcement",
        "ocr_text": "JNIVERSITY OF THE PHILIPPINES pit Quezon City IMAN Metro Manila Contact: {02} age. 32 WWW. University edu ph ee aero tien a rnecnreneaecnreicshnmmaray November 06, 2025 OFFICIAL ANNOUNCEMENT RE: Library Services and Resource Access Guidelines Good day! This SErVves as officie complete their re December 03, 20 announcement ii tension of the enrol 2025. The enrollment deadiine has Deer istration withi ond Semes 1 @xtended to accommodate Students who w inable to n the original Schedule. EXTE IDED ENROLLMENT SCHEDULE: Regular 25 Late enroliment (with Surcharge) subjects: Decemb VDE students: Unit }} December 04, 2025 to December 09, 2025 Add er 06, 2025 io December 13, 2025 Student portal before Proceedin ding and cropping of S All students are required to complete online Pre enraliment through the g to payment, Walk in enrollment is available at the Registrar s Office duri 1g Office hours (8 00 AM 5 00 PM, Monday to Friday), PAYMENT OPTIONS: Students May settle tuition fees th channels: university Cashier s office, autho, cd payment centers, Official receipts must be Secured and uploaded to extended period Will result in forfeiture of si 1WoUugh the following Online banking fac itles, and accredited payment apps, the student portal. previous semesters must settle obligatio Thank you for yo ®garding the ax iment psriod for the Seo MPORTANT REMINDERS: Failure to enroll within the ot and May affect scholarship Grants. Students with unpaid balan ns before enrolment. For concems, contact the Office ces from UF Cooperation, of the University Registrar. CARRIE STEIN University Presi"
    },
    {
        "image": "announcement2_synth_13_aug3.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila Office of the Chancellor Contact: (02) 8524 4611 Email: admissions university edu ph Website: www university edu ph November 06, 2025 OFFICIAL ANNOUNCEMENT RE: Library Services and Resource Access Guidelines Good day! This serves as official announcement regarding the extension of the enrollment period for the Second Semester, Academic Year 2024 2025. The enrollment deadline has been extended to accommodate students who were unable to complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until December 03, 2025 Late enrollment (with surcharge): December 04, 2025 to December 09, 2025 Adding and dropping of subjects: December 06, 2025 to December 13, 2025 All students are required to complete online pre enrollment through the student portal before proceeding to payment. Walk in enrollment is available at the Registrar s Office during office hours (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tuition fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will result in forfeiture of slot and may affect scholarship grants. Students with unpaid balances from previous semesters must settle obligations before enrollment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation. CARRIE STEIN University President"
    },
    {
        "image": "announcement2_synth_13_aug4.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila tact: (02) 8524 4641 Email admissions university edu ph Website: www university edu ph November 06, 2025 OFFICIAL ANNOUNCEMENT RE: Library Services and Resource Access Guidelines Goad day! This serves as official announcement regarding the extension of the enrollment period for the Second Semester, Academic Year 2024 2025. The enrollment deadline has been extended to accommodate students who were unabie to complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Reguiar students: Until December 03, 2025 Late enroliment (with surcharge): December 04, 2025 to December 09, 2025 Adding and dropping of subjects: December 06, 2625 to December 13, 2025 All students are required to complete online pre enrollment through the student portal before proceeding to payment. Walk in enrollment is available at the Registrar s Office during office hours (8 06 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settie tuition fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will resuit in forfeiture of slot and may affect scholarship granis. Students with unpaid baiances from previous semesters must seftle obligations before enrollment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation. CARRIE STEIN University President"
    },
    {
        "image": "announcement2_synth_13_aug5.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, y Manila tenner eg 4614 Email ©. WWW. university edi Seman eAmcenconeeemnem Someonemeneeenenan tt een nr eree renin an etree, November 06, 2025 OFFICIAL ANNOUNCEMENT RE: Library Services and Resource Acc. vu Good day! This Serves Academic Year 2024 20 complete their re. December 03 2 S Official announcement regard ing the extension of the enroliment period for the Second Semester, 25. The enrolment deadline has been exiended to accory modale students who were unable to gistration within the origina! schedule, EXTENDED ENROLLMENT SCHEDULE: gular students: Until 025 Lafe énroliment (with Surcharge): December 04, 2025 ta December O09, 2025 Adai subdlects- December 06, 2025 to December 13, 2025 Al s TUS are required to complete online Pre enroliment through the Student portal Defore Proceeding to payment. Walk in enrallment is available at the Registrar s Office during office hours (8 00 AM 5 00 PM Monday to F tiday). PAYMENT OPTIONS: Studenis May Settle tuition fees through the iollowing channels: orized payment centers, online Danking facilities, and accredited payment apps. St be secured and uploaded to the Student portal, IMPORTANT REMINDERS. Failure to enrol! within the extended period Will result in forfeiture of siot and may affeot scholarship grants. Students with Unpaid balances from Previous semesters MUST Settle obligations before enrolment, For concerns, contact the Office of the University Registrar. Thank you for YOUF Cooperation. ng and cropping of university cashier s office, auth Official receipts mu CARRIE STEIN Univer Sily President"
    },
    {
        "image": "announcement2_synth_14_aug1.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MA Que NILA UNIVERSITY <on City, Metro Marita WETSity edu: phy | November 07, 2025 COMMUNITY ANNOUNCEMENT RE: Univ ty Wide Scholarship Program Application Good day! This serves a3 official announce ent regarding the Academic Year 2024. me &xtension of ond Semester, who were unable to ‘equiar students: Until 17, 2025 Adding and droppi online pre en roliment through the office hours 1 tuition fees through ffe the enrollment benod for the Secc (025. The enrollment deadtine has bean extended to accommodate students complete ther registration within the onigina} schedule, EXTENDED ENROLLMENT SCHEDULE: fecember 14, 2025 Late enroilment (with Surcharge): December 12, 2025 ta Decernber bjects: December 08, 2025 to December 13, 2025 Ati Students are required to complet Student portal defore PFOC8Eding to Payment. Walk in enrollment je avaliable at the Regist: (8 00 AM 5 00 PM, A onday to Friday). PAYMENT OPTIONS, Students May Settle he following channels: University cashier s office, authorized Payment centers, online banking fa Nites, and acer fed payment apps. Of; receipts must be Secured and upload to the student portal, IMPORTANT REMINDERS. Fallure to enrolj within the ded period witi resull in forfeiture of slo a may Ct scholarship Gans. Students with Unpaid balances from previous s TS Must settie Obigations betore enrciiment. For CORnCEMNS, contact the Office of the University Registrar, Thank you tor YOUr cooperation vii PAMELA SMITH"
    },
    {
        "image": "announcement2_synth_14_aug2.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIV ERSITY Quezon Cy, Metro Mania Office of the Pr é 1 Website vagy university Cen enent nn accent N E Movember OF, 2025 TY ANNOUNCEMENT COMMUN RE: University Wide Scholarship Program Applicaton announcement regarding me extension of the enrollment period for the Second Seamesier, diine has beer extended to accommodate students who were unabie to edule. EXTENDED ENROLLMENT SCHEDULE: Reguiar students: Unt ber 12, 2025 to December 17, 9025 Adding and dropping of December 4 4, 2025 Laie enrolment (vi subjects: December 08, 2095 to December 43, 2025 All students are required te complete online pre enraliment through the student portal before proceeding to payment. Walk in enrollment is available at ihe Registrars Office during office hours (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Studenis may geile tuition fees through ihe following ity cashiers office, authorized payment centers, online panking fac dited payment apps. to the student portal. IMPORTANT REMIND Good day! This serves as official Academic Year 2024 2025, The enrolment dea complete their registration within ihe original sci ith surcharge). Decem ities, and accret ERS: Failure to enroll within the lances from channels: univers Official receipts musi be secured and uploaded extended period will resuli in forfeiture of slot and may affect scholarship grants. Students with unpaid ba ns before enrolment. For conce ms. contact the Office of the University Reqisirar. musi sete obligato cooperation. previous semesiers Thank you for your PAMELA SMITH"
    },
    {
        "image": "announcement2_synth_14_aug3.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Quezon City, Metro Manila Thank you for your cooperation. November 07, 2025 COMMUNITY ANNOUNCEMENT RE: University Wide Scholarship Program Application PAMELA SMITH Chancellor"
    },
    {
        "image": "announcement2_synth_14_aug4.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Quezon City, Metro Manila Office of the President _ y edu ph Website: www university edu ph 8920 5301 to 8920 5320 Email: info universit Tel: (02) November 07, 2025 COMMUNITY ANNOUNCEMENT RE: University Wide Scholarship Program Application Good day! This serves as Official announcement regarding the extension of the enrollment period for the Second Semester, extended to accommodate students who were unable to Academic Year 2024 2025. The enrollment deadline has been complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until December 11, 2025 Late enrollment (with surcharge): December 12, 2025 to December 147, 2025 Adding and dropping of subjects: December 06, 2025 to December 43, 2025 All students are required to complete online pre enrollment through the student portal before proceeding to payment. Walk in enrollment is available at the Registrar s Office during office hours (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tuition fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will result in forfeiture of slot and may affect scholars nts with unpaid balances from previous semesters must settle obligations before enrollment. For concern e University Registrar. Thank you for your cooperation. hip grants. Stude' s, contact the Office of th PAMELA SMITH Chancellor"
    },
    {
        "image": "announcement2_synth_14_aug5.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Me Quezon City, Metro Manila November 07, 2025 COMMUNITY ANNOUNCEMENT RE: University Wide Scholarship Program Application Good day! This serves as official announcement regarding the extension of the enrollment period for the Second Semester, Academic Year 2024 2025. The enrollment deadline has been extended to accommodate students who were unable to complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until December 11, 2025 Late enrollment (with surcharge): December 12, 2025 to December 17, 2025 Adding and dropping of subjects: December 06, 2025 to December 13, 2025 All students are required to complete online pre enroliment through the student portal before proceeding fo payment. Walk in enrollment is available at the Registrar s Office during office hours (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may seitle tuition fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroll withi extended period will resulf in forfeiture of slot and may affect scholarship grants. Students with unpaid balances from previous semesters musi settle obligations before enrollment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation. he PAMELA SMITH Chancellor"
    },
    {
        "image": "announcement2_synth_15_aug1.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila Office of the Cha: Phone: (02) 8731 4031 ta 8731 4050 j Emait: os: “erence oem nnn tare heater tocanensns serene a university edu ph www. university edu. ph Se eeenearereerarentene it rant ere eee eine arena nerneee November 05, 2025 PUBLIC ANNOUNCEMENT RE: Library Services and Resource Access Guidelines Good day! This serves as official announcement regarding the extension of the enroliment period for the Second Semester, Academic Year 2024 2025. The enroliment deadline has been extended to accommodate students who were unable to complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until December 16, 2025 Laie enroliment (with surcharge): December 17, 2025 to December 22, 2025 Adding and dropping of subjects: November 18, 2025 to November 25, 2025 All students are required to complete online pre enroliment through the student portai before proceeding to payment. Walk in enroliment is available at the Registrar s Office during office hours (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students May settle tuition fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will result in forfeiture of slot and may affect scholarship grants. Students with unpaid balances from previous semesters must sattle obligations before enrollment. For concems, contact the Office of the University Registrar. Thank you for your cooperation. MARY MADDOX University Registrar"
    },
    {
        "image": "announcement2_synth_15_aug2.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila Office of the Chancellor niversity edu ph www university edu ph Phone: (02) 8731 4031 to 8731 4050 Email: osa u' November 05, 2025 PUBLIC ANNOUNCEMENT RE: Library Services and Resource Access Guidelines n of the enrollment period for the Second Semester, g the extensio students who were unable to Good day! This serves aS official announcement regardin Academic Year 2024 2025. The enrollment deadline has been extended to accommodate complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until December 16, 2025 Late enrollment (with surcharge): December 17, 2025 to December 22, 2025 Adding and dropping of subjects: November 18, 2025 to November 25, 2025 All students are required to complete online pre enrollment through the s available at the Registrar s Office during office hours student portal before proceeding to payment. Walk in enrollment i (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tuition fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will result in forfeiture of slot and may affect scholarship grants. Students with unpaid balances from previous semesters must settle obligations before enrollment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation. MARY MADDOX University Registrar"
    },
    {
        "image": "announcement2_synth_15_aug3.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila Office of the Chancellor Phone: (02) 8731 4031 to 8731 4050 Email: osa university edu ph www university edu ph November 05, 2025 PUBLIC ANNOUNCEMENT RE: Library Services and Resource Access Guidelines Good day! This serves as official announcement regarding the extension of the enrollment period for the Second Semester, Academic Year 2024 2025. The enrollment deadline has been extended to accommodate students who were unable to complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until December 16, 2025 Late enrollment (with surcharge): December 17, 2025 to December 22, 2025 Adding and dropping of subjects: November 18, 2025 to November 25, 2025 All students are required to complete online pre enrollment through the student portal before proceeding to payment. Walk in enrollment is available at the Registrar s Office during office hours (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tuition fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will result in forfeiture of slot and may affect scholarship grants. Students with unpaid balances from previous semesters must settle obligations before enrollment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation. MARY MADDOX University Registrar"
    },
    {
        "image": "announcement2_synth_15_aug4.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY oF THE PHIL} PPINES DILIMAN Quezen City, Metro Manila Phone: (02) 8734 “eetementtrenenareney, 031 to 8731 4050} November 05, 2025 PUBLIC ANNOUNCEMENT RE: Library Services and Resource Access Guidelines Good day! This Serves as official announcement regarding the a Academic Year 2024 2025, The enrollment deadline he Complete their registration within the original sched December 16, 2025 Late Enrolment (with sure! November 78 student port une xtension of the e nroliment period for the Sec nd Semester, tended to accommodate Students who were Unable to ule. EXTENDED ENROLLMENT SCHEDULE: Regular Students: Until harge): December 17, 2025 to December 22, 2025 Adding ang dropping of 3, 2025 to November 25, 2025 All Students are required to complete online Pre enroliment through the ral before Proceeding to Payment. Walk in enrolment is aye strar s Office during office hours (8 00 AM 5 09 PM, Monday channels: universi Sar, been sublects ailable at the Regi io Friday). PAYMENT OPTIONS: Student Cashier’ S May settle tuition fees through the following 8 office, authorized Payment centers, ontine banking facilities, and accredited Payment apps. Official receipts must be ured and uploaded io the student portal, IMPORTANT REMINDERS: Failure to enroll within the extended period will resul forfeiture of slot and May affect Scholarship granis. Students wi previous semesters must ¢. ttle obligations before e Thank you for your coc Aroliment, For 2Deration. th unpaid ba concerns lances from 3, contact the Office of the University Registrar. MARY MADDOX University Regi"
    },
    {
        "image": "announcement2_synth_15_aug5.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila Office of the Chancellor Phone: (02) 8731 4031 to 8731 4050 Email: osa university edu ph www university edu ph November 05, 2025 PUBLIC ANNOUNCEMENT RE: Library Services and Resource Access Guidelines Good day! This serves as official announcement regarding the extension of the enrollment period for the Second Semester, Academic Year 2024 2025. The enrollment deadline has been extended to accommodate students who were unable to complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until December 16, 2025 Late enrollment (with surcharge): December 17, 2025 to December 22, 2025 Adding and dropping of subjects: November 18, 2025 to November 25, 2025 All students are required to complete online pre enrollment through the student portal before proceeding to payment. Walk in enrollment is available at the Registrar s Office during office hours (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tuition fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will result in forfeiture of slot and may affect scholarship grants. Students with unpaid balances from previous semesters must settle obligations before enrollment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation. MARY MADDOX University Registrar"
    },
    {
        "image": "announcement2_synth_16_aug1.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Quezon City, Metro Manila Office of the President | Website: www university edu ph Contact: (02) 8524 4611 Email: admissions university edu ph November 10, 2025 PUBLIC ANNOUNCEMENT RE: Schedule of Classes and Academic Calendar Updates s the implementation of flexible learning modality for the upcoming afety of our academic community. LEARNING cts and specialized courses requiring physical agement platforms Online asynchronous: ation of face to face and online delivery d the student portal. Faculty members thods. GUIDELINES AND Technical requirements include ply with health protocols. The tion Technology Services Office of Student Affairs. ministration announce ation while ensuring the health and s to face classes: For laboratory subje' -time virtual classes via approved learning man s Hybrid format: Combin through official email an dule, and assessment me connection for online classes. Greetings! The university ad semester to provide quality educ: MODALITIES AVAILABLE: Face- presence Online synchronous: Real Self paced learning through recorded lectures and module: methods Students will be informed of their class modalities will provide course syllabi indicating the learning format, sche REQUIREMENTS: All students must maintain reliable internet computer or mobile device with camera and microphone. Face to face participants must com university commits to providing technical support and learning resources through the Informa and the University Library. For assistance, contact your respective college offices or the Office JAMES LEWIS Director, Student Affairs"
    },
    {
        "image": "announcement2_synth_16_aug2.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY ite. Www. ty edu ph November 10, 2025 PUBLIC ANNOUNCEMENT Schedule of Classes and Academic Calendar Updates Greetings! The university administration announces the implementation of flexible learning modality for the upcoming semester to provide quality education while ensuring the health and safety of our academic community. LEARNING MODALITIES AVAILABLE: Face to face classes: For laboratory subjects and specialized courses requiring physice presence Online synchronous: Real time virtual c @S Via approved iearning management platforms Online asynchronous: Seli paced learning through recorded lectures and modules Hybrid format: Combination of face to face and ontine delivery methods Students wil be informed of their class modalities through official email and the student portal. Faculty members will provice course syllabi indicating the learning forrnal, schedule, and assessment methods. GUIDELINES AND REQUIREMENTS: All students must maintain reliable internet connection for online classes. Technical requirements include computer or mobile device with camera and microphone. Face to face participants must comply with health protocols. The university commits to providing technical support and learning resources through the Information Technology Services Office and the University Library. For assistance, contact your respective college offices or the Office of Student Affairs. i fa JAMES LEWIS Director, Student Affairs"
    },
    {
        "image": "announcement2_synth_16_aug3.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Quezon City, Metro Manila Contact: (02) 8524 4611 Email: admissions university edu ph Website: www university edu ph Office of the President November 10, 2025 PUBLIC ANNOUNCEMENT RE: Schedule of Classes and Academic Calendar Updates inistration announces the implementation of flexible learning modality for the upcoming ucation while ensuring the health and safety of our academic community. LEARNING face classes: For laboratory subjects and specialized courses requiring physical presence Online synchronous: Real time virtual classes via approved learning management platforms Online asynchronous: Self paced learning through recorded lectures and modules Hybrid format: Combination of face to face and online delivery methods Students will be informed of their class modalities through official email and the student portal. Faculty members will provide course syllabi indicating the learning format, schedule, and assessment methods. GUIDELINES AND REQUIREMENTS: All students must maintain reliable internet connection for online classes. Technical requirements include computer or mobile device with camera and microphone. Face to face participants must comply with health protocols. The university commits to providing technical support and learning resources through the Information Technology Services Office and the University Library. For assistance, contact your respective college offices or the Office of Student Affairs. Greetings! The university adm semester to provide quality ed MODALITIES AVAILABLE: Face to JAMES LEWIS Director, Student Affairs"
    },
    {
        "image": "announcement2_synth_16_aug4.png",
        "label": "announcement",
        "ocr_text": "nounces the im, Provide quality education while MODALITIES A Presence Onlin Self paceq lear methods Studen will provide cou Face to face Classes: For labo: synchronoy ning through ATENEO DE MANILA UNIVERSITY Quezon City, Metro Manila Office of the President Contact: (02) 8524 4614 Email: admissi ons university edu ph Website: WWW University. edu. ph November 10, 2025 PUBLIC ANNOUNCEMENT RE: Schedule of Classes and Academic Calendar Updates Niversity administration an ensuring the health and Safety of our academic community, LEARNING VAILABLE F ratory Subjects and Spe cializeq Courses requiring Physical S: Real time Virtual Classes vig approved learning management Platforms Online asynchronous: recorded lectures and modul ts will be inform €s Hybrid format: Combination of face to face and online delivery €d of their Class Modalitie. TSE syllabi indicat, i S through Official] email and the st udent portal. Faculty members Sessment methods. GUIDELINES ND ts must maintain reliable internet co Obile device with i JAMES LEWIs Director, Student Affairs"
    },
    {
        "image": "announcement2_synth_16_aug5.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY www university. edu. pn November 10, 2025 PUBLIC ANNOUNCEMENT Le lar Updates and Academic Cai versity administration announces the implementation of flexible learning modality for ihe upcoming fy education while ensuring the health and safety of our academic coramunity. LEARNING face classes! FO jects and specialized courses requiring physical e asynchronous: ine delivery semesier fo provide quali rlaboratory sub ime virtual classes via approved je ah recorded lectures and modules MODALITIES AVAILAB presence Online synchro ning management olatforras Ont Combination of face to face and student portal. Facully nembe rs Self paced learning throug methods Students will be informed of their class modalities through official email and the stu J assessment methods. GUIDELIS AND will provide Cours fing the learning format, schedule, anc REQUIREMENTS: All students must mainiain reliable internet connection for online classes. computer or mobile device with camera and microphone. Fe ce to face pariicipants must comply with heal university commits to providing technical support and learning resources through the information Technology Services Office and the University Library. Eor assistance, coniact your respective college offices or the Office of Student Affairs. Technical requirements include e syllabi indica Hh protocols. The JAMES LEWIS al Affairs"
    },
    {
        "image": "announcement2_synth_17_aug1.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSITY Manila, Metro Manila Telephone: (02) 8426 6001 loc. 5100 Email: registrar university edu ph Web: www university edu ph NN — Office of the President November 17, 2025 UNIVERSITY ANNOUNCEMENT RE: Commencement Exercises and Graduation Requirements Good day! This serves as official announcement regarding the extension of the enrollment period for the Second Semester, Academic Year 2024 2025. The enrollment deadline has been extended to accommodate students who were unable to complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until November 21, 2025 Late enrollment (with surcharge): November 22, 2025 to November 27, 2025 Adding and dropping of subjects: November 20, 2025 to November 27, 2025 All students are required to complete online pre enrollment through the student portal before proceeding to payment. Walk in enrollment is available at the Registrar s Office during office hours (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tuition fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will result in forfeiture of slot and may affect scholarship grants. Students with unpaid balances from previous semesters must settle obligations before enrollment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation. THOMAS ROY Chancellor"
    },
    {
        "image": "announcement2_synth_17_aug2.png",
        "label": "announcement",
        "ocr_text": "DE LASALLE UNIVERSITy a, Metro Manila of the President November 17, 2OZS UNIVERSITY ANNOUNCEMENT RE: Commencement Exercises and Graduation Requirements Good day! This Serves as officia! ennouncement regarding the extension of econd Semester, Academic Year 2024 2025, The enrolment deadii has been extended to accommodate students whe were unable fo complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEOULE: Regular students: Until November 21, 2025 Late enrollment (with Surcharge): November 22, 2025 ty November 27, 2025 Adding and drepping oF subjects: November 20, 2025 to November 27, 2025 All Studenis are required to complete online prée enroliment through the Student portal before Proceeding to payment, Walk in enralf nL iS available at the Registrar s Office during office hours {3 00 AM. 5 00 PM, Monday to Friday), PAYMENT OPTIONS: Students May seitie tuition fees through the following nneis: university cashier s office, authorized Payment centers, online banking facilities, ang accredited paymen ADDS. Official receipts must be secured and uploa NDERS: Failure to enroll within the the enrollment penod for the S aded to the Student portal, IMPORTANT REMI extended period will result in forfeiture of siot and may aff &ct scholarship grants, PPEVIOUS seme asters must setile ob} tudents with unpaid balances from igations before enrollment. Far Concerns, coniact the Office of the University Registrar, Thank you for YOur Cooperation, THOMAS ROY Chancellor"
    },
    {
        "image": "announcement2_synth_17_aug3.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSITY Manila, Metro Manila sity edu ph Web November 17, 2025 UNIVERSITY ANNOUNCEMENT RE: Commencement Exercises and Graduation Requirements Good day! This serves as official announcement regarding the extension of the enroliment period for the Second Semester, Academic Year 2024 2025. The enrollment deadline has been extended to accornmodate students who were unabie to complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Requilar siudents: Until November 21, 2025 Late enroilment (with surcharge}: Novernber 22, 2025 to November 27, 2025 Adding and dropping of subjects: November 20, 2025 to November 27, 2025 All students are required to complete online pre enroliment through the student portal before proceeding fo payment. Walk in enroliment is available at the Registrar s Office during office hours (8 00 AM 5 00 PM, Monday to Friday}. PAYMENT OPTIONS: Students may seitie tuitlon fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipis must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure fo enroil within the extended period will result in forfeiture of siot and may affect scholarship grants. Students with unpaid baiances from previous semesters must settle obligations before enrollment. Fer concerns, contact the Office of the Universily Registrar, Thank you for your cooperation. vy THOMAS ROY Chancellor"
    },
    {
        "image": "announcement2_synth_17_aug4.png",
        "label": "announcement",
        "ocr_text": "DE LA SALLE UNIVERSITY Manila, Metro Manita Office of the President Telephone: (02) 842; 6 600 1 loc. 5100 Emaii: re @university edy phj Toren nearer Web: www university edu ph Dy November 17 2025 UNIVERSITY ANNOUNCEMENT RE: Commencement Exercises and Graduation Requirements Good day! This SEIVEs as official announcement regarding the extension of the en Academic Year 2024 2025. The enrollment deadline has been extended complete their registration within the original schedule EXTENDED November 21, 2025 Late enrollment (with Surcharge): November subjects: Novernber 20, 2025 to November 27, 2025 Alt Student portal before Proceeding to pa (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTION etlle tuition fees through the following channels: university cashier s Office, authorized Payment centers, ontine banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroj} within the extended period will result in forfeiture of slot and may affect Scholarship grants. Students with unpaid balances from Previous semesters Must settle obligations before enrollment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation. rollment period for the Second Semester, udents who were unable to ULE: Regular students: Until ovember 27, 2025 Adding and dropping of duired to complete onfine pre enrolimeni through the ent is available at the Registrar s Office during office hours S: Students mays to accommodate st ENROLLMENT SCHED 22, 2025 toN Students are ra yment. Walk in enrolim THOMAS ROY Chancellor"
    },
    {
        "image": "announcement2_synth_17_aug5.png",
        "label": "announcement",
        "ocr_text": "De LA SALLE UNIVERSITY Manila, Metro Mania Telephone: (02) 8426 6001 tac. 5700 Email ity edu ph Web: waw u mere aemeeememenemeenccennee rani nnn senna annem November 17, 2025 UNIVERSITY ANNOUNCEMENT RE: Commencement Exercises and Graduation Requirements Good day! This serves as official announcement regarding the extensi Academic Year 2024 2025. The enroliment deadline has been exte 2 complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until November 21, 2025 Late enrallment (with surcharge}: November 22, 2025 io November 27, 2025 Adding and dropping of subjects: November 20, 2025 to November 27, 2025 All students are required to complete online pre enroliment through the student portal before proceeding to payment. Walk in enrollment is avaliable at the Registrar s Office during office hours (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tuition fees through the following channels: university cashier s office. authorized payment centers, online banking fac Official receipts must be secured and uploaded to the student portal. IMPORTANT i extended period will result in forfeiture of siot and may affect scholarship granis previous semesters must settle obligations before enrollment, F Thank you for your cooperation. on of the enrollment period for the Second Semester, ded to accommodate students who were unable to €8, and accredited payment apps. MINDERS: Failure to enroll within the Students with unpaid balances from or concerns, contact the Office of the University Registrar. THOMAS ROY Chancellor"
    },
    {
        "image": "announcement2_synth_18_aug1.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY o Maniia i7 7 Ernal PUBLIC ANNOUNCEMENT Library Services and Resource Access Guidelines Academic Year 2024 2025, The enrollment deadline has been extended to accommodate students who were unable to mpiete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until December 16, 2 iment (with surcharge}: December 17, 2025 to December 22, 2025 Adding and dropping of sublects: November 26, 2025 to December 02, 2025 All students are required to complete online pre enrollment through the student porial before proceeding to payment. Walk in enrollmer available at the ars Office during office hours (8 06 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle s through the following channels: university cashier s office, authorized payment centers, orline ban and accredited pay i S. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: ure to enroll within the extendec period will result in forfeiture of slot and may affect scholarship grants. Students with unpaid balances from previous semesters must settle obligations before enrollment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation ANTHONY BERRY"
    },
    {
        "image": "announcement2_synth_18_aug2.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY fe etro Manila ident y edu ph www. university ed November 12, 2025 PUBLIC ANNOUNCEMENT RE: Library Services and Resource Access Guidelines Good day! This serves as official announcement regarding the extension of the enrollment period for the Second Semesier, Academic Year 2024 2025. The enroliment deadline has been extended to accommodate students who were unable to compiete their registration within the original schedule. EX? Nee ENROL LMENT SCHEDULE: Regular students: Unit December 16, 2025 Late enrollment (with surcharge}: December 17, 2025 ta December 22, 2025 Adding and dropping of subjects: November 26, 2025 to December 03, 2025 All students are 2 required fo cornplete online pre enrollment through the student portal before proceeding to payrnent. Walk in enrollment is available ai the Registrars Office during office hours (8 60 AM 5 00 PM, Monday te Friday). PAYMENT OPTIONS: Students may settle tuition fees through the foliowing channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded fo the student portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will result in ferfeiture of slot and may affect scholarship grants. Students with unpaid balances from previous semesters must settle obligations before enrollment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation. ANTHONY BERRY Jeni for Academic Affairs Vie"
    },
    {
        "image": "announcement2_synth_18_aug3.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNI Quezon City, M VERSITY tro Manila ei Pemeuanasinesssena Srsity Sou. way Unive oceania eran, November 12, 2025 PUBLIC ANNOUNCEMENT RE: Library Services ang Resource Accass Guidelines Good day! This Serves as official announcement Academic Year 2024 2025, The enrollment de dling has complete their registration within the original schedul December 18, 2025 Late Enroliment (with su ecember 22, Subjects: November 26, 2025 to December 0: O25 All students are required to e Student Portal before Proceeding to Payment, Walk in enroliment j (8 00 AM 5 09 PAA Monday to Friday). PAYMENT OPTION channels: university cashier s office, authorized payment c Official Feceipis must be Secured ang uploaded to the &xtended Pernod wil Pesult in forfeiture of Slot and m Previous Semesters must Settle ob regarding the extension of the enrollment Period for the Second Semester, i been extended to accommodate students who were un ©. EXTENDED ENROLLMENT SCHEDULE: R earge). December 17, 2025 tab gular students: Until 2025 Adding and dropping of omplete ontine Pre enroliment through the S available at the Registrar s Office luring office Nours S: Students May Settle tuition fees through the following enters, ontina banking facilities, and accredited paym Student portaj. IMPORTANT REMINDERS: F ay affect schol len apps. Failura tg enroll within the arship grants. Students with unpaid balances from ligations before enrolment, For concerns, contact the Off; Thank YOu for vour Cocperation, ce Of the University Registrar. ANTHONY BERRY Vice Presiden"
    },
    {
        "image": "announcement2_synth_18_aug4.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Quezon City, Metro Manila Office of the President Tel: (02) 8335 1787 Email: president office university edu ph www university edu ph November 12, 2025 PUBLIC ANNOUNCEMENT RE: Library Services and Resource Access Guidelines Good day! This serves as official announcement regarding the extension of the enrollment period for the Second Semester, Academic Year 2024 2025. The enrollment deadline has been extended to accommodate students who were unable to complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until December 16, 2025 Late enrollment (with surcharge): December 17, 2025 to December 22, 2025 Adding and dropping of subjects: November 26, 2025 to December 03, 2025 All students are required to complete online pre enrollment through the student portal before proceeding to payment. Walk in enrollment is available at the Registrar s Office during office hours (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tuition fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will result in forfeiture of slot and may affect scholarship grants. Students with unpaid balances from previous semesters must settle obligations before enrollment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation. ANTHONY BERRY Vice President for Academic Affairs"
    },
    {
        "image": "announcement2_synth_18_aug5.png",
        "label": "announcement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Tel: (02) 8335 4787 November 72, 2025 PUBLIC ANNOUNCEMENT c Suidelines Library Services and Resource Acces Good day! This serves as official announcement regarding the extension of the enrollment period for the Second Semester, Academic Year 2024 2025. The enroliment deadline has been extended to accommodate students who were unable to complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Uniil December 16, 2025 Late enroliment (with surcharge): December 17, 2025 to December 22, 2025 Adding and dropping of subjects: November 26, 2025 to December 03, 2025 All students are required to complete online pre enroliment through the student portal before proceeding to payment. Walk in enrollment is available al the Registrar s Office during office hours 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tultion fees through the follo channels: university cashier s office, authorized payment centers, online banking facilities, and accr Official receipis must be secured and upioaded fo the siucent portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will resull in forfeiture of slot and may affect scholarship grants. Students with unpaid balances fram previous semesters must settle obligations before enroliment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation ANTHONY BERRY ent for Acad"
    },
    {
        "image": "announcement2_synth_19_aug1.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila Office of the Chancellor versity edu ph Website: www university edu ph Tel: (02) 8920 5301 to 8920 5320 Email: info uni November 08, 2025 UNIVERSITY ANNOUNCEMENT nd Academic Calendar Updates RE: Schedule of Classes a! ollment period for the Second Semester, students who were unable to Regular students: Until 2025 Adding and dropping of nline pre enroliment through the Office during office hours hrough the following cial announcemen ent deadline has ithin the original schedule. EX t (with surcharge): November 29, 30, 2025 to December 07, 2025 All students are required to complete 0! student portal before proceeding to payment. Walk in enrollment is available at the Registrar s (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tuition fees t channels: university cashier s O' ent centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will result in forfeiture of slot and may affect scholarship grants. Students with unpaid balances from liment. For concerns, contact the Office of the University Registrar. previous semesters must settle obligations before enro Thank you es as Offi ar 2024 2025. The enrollm Good day! This serv! Academic Ye complete their November 22, subjects: November registration W 2025 Late enrollmen for your cooperation. MONIQUE CARROLL University President"
    },
    {
        "image": "announcement2_synth_19_aug2.png",
        "label": "announcement",
        "ocr_text": "SITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila UNIVER Office of the Chancellor _ niversity edu ph Tel: (02) 8920 5301 to 8920 5320 Email: info university edu ph Website: www u November 08, 2025 UNIVERSITY ANNOUNCEMENT RE: Schedule of Classes and Academic Calendar Updates he enrollment period for the Second Semester, Good day! This serves aS official announcement regarding the extension of t deadline has been extended to accommodate students who were unable to Academic Year 2024 2025. The enrollment complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until November 22, 2025 Late enrollment (with surcharge): November 23, 2025 to November 28, 2025 Adding and dropping of subjects: November 30, 2025 to December 07, 2025 All students are required to complete online pre enrollment through the trar s Office during office hours student portal before proceeding to payment. Walk in enrollment is available at the Regis (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tuition fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secure tal. IMPORTANT REMINDERS: Failure to enroll within the d and uploaded to the student por extended period will result in forfeiture of slot and may affect scholarship grants. Students with unpaid balances from previous semesters must settle obligations before enrollment. e of the University Registrar. For concerns, contact the Offic Thank you for your cooperation. MONIQUE CARROLL University President"
    },
    {
        "image": "announcement2_synth_19_aug3.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City. Metro Manila OF hancellor oo 4 to 8920 5420 Email: ersity edu ph Wensite: www universtt anne eee Tal: (02) 8920- ee November 08, 2025 UNIVERSITY ANNOUNCEMENT RE: Schedule of Classes and Academic Calendar Updates sf the enroliment period for the Second Semester, e date students who were unable io dule. EXTENDED ENROLLMENT SCHEDULE: Requiar students: Uni 25 to November 28, 2025 Adding and dropping of plete online pre enrolimert through the fee during office Hours regarding the exiension e has been extended to accomime Good day! T fficial announcement Acadernic Year 9924 2025. The enrollment dead complete their registration within the original sch November 22, 2025 Late enrollment Owih surcharge). Now subjects: November ceeding fo pay ember 23, 20 30, 2025 to December O07, 9025 All students are required to cor student portal before proc! ment. Walk in enrollment is available at the Registrars Of (8 00 AM &-96 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tuition fees through the following y cashiers office, authorized payment centers, online banking facilities, and accredited payment apps. be secured and uploaded te the student portal. IMPORTANT REMINDERS: Failure to enroll within ihe e of slot anc may affect scholarship grants. Students with unpaid balances from ns before enrolment. For concerns, contact the Office of the University Registrar channels: universit al receipts mu extended period will result in forfeltur previous sernesiers MUSE gattie obligatio Thank you for your cooperation. Ll MONIQUE CARROL. University President"
    },
    {
        "image": "announcement2_synth_19_aug4.png",
        "label": "announcement",
        "ocr_text": "Good day! This SEs as offici Academic Year 2024 2025 The Thank you for y UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila Office of the Chancellor Tek: (02) 8920 5307 to 8920 5320 Emai Ht: info university edu ph Wensite: WWW university edu ph November 08, 2025 UNIVERSITY ANNOUNCEMENT RE: Schedule of Classes and Academic Calendar Updates OUr cooperation. MONIQUE CARROLL University President"
    },
    {
        "image": "announcement2_synth_19_aug5.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila Office of the Chancellor Tel: (02) 8920 5301 to 8920 5320 Email: info university edu ph Website: www university edu ph November 08, 2025 UNIVERSITY ANNOUNCEMENT RE: Schedule of Classes and Academic Calendar Updates Good day! This serves as official announcement regarding the extension of the enrollment period for the Second Semester, Academic Year 2024 2025. The enrollment deadline has been extended to accommodate students who were unable to complete their registration within the original schedule. EXTENDED ENROLLMENT SCHEDULE: Regular students: Until November 22, 2025 Late enrollment (with surcharge): November 23, 2025 to November 28, 2025 Adding and dropping of subjects: November 30, 2025 to December 07, 2025 All students are required to complete online pre enrollment through the student portal before proceeding to payment. Walk in enrollment is available at the Registrar s Office during office hours (8 00 AM 5 00 PM, Monday to Friday). PAYMENT OPTIONS: Students may settle tuition fees through the following channels: university cashier s office, authorized payment centers, online banking facilities, and accredited payment apps. Official receipts must be secured and uploaded to the student portal. IMPORTANT REMINDERS: Failure to enroll within the extended period will result in forfeiture of slot and may affect scholarship grants. Students with unpaid balances from previous semesters must settle obligations before enrollment. For concerns, contact the Office of the University Registrar. Thank you for your cooperation. MONIQUE CARROLL University President"
    },
    {
        "image": "announcement2_synth_20_aug1.png",
        "label": "announcement",
        "ocr_text": "SITY OF THE PHILIPPINES DILIMAN Manila UNIVER Quezon City, Metro Office of the Chancellor ph Website: ywww university edu ph Tel: (02) 8920 5301 to 8920 5320 Email: info university edu. November 03, 2025 PUBLIC ANNOUNCEMENT nd Semester AY 2024 2025 RE: Extension of Enrollment Period for Seco dality for the upcoming EARNING g physical mplementation of flexible learning mo our academic community. LU tration announces the i health and safety 0 e university adminis Greetings! Th semester to provide quality education while ensuring the -face classes: For laboratory subjects and specialized courses requirin management platforms Online asynchronous: ace and online delivery via approved learning les Hybrid format: Combination of face to f i tudent portal. Faculty members ds. GUIDELINES AND ments include MODALITIES AVAILABLE: Face to: presence Online synchronous: Real time virtual classes Self paced learning through recorded lectures and modu d of their class modalities methods Students will be informe’ will provide course syllabi indicating the learning format, ts must maintain reliable internet connection for online classes. -to face participants must comply with health protocols. The Services Office ation Technology REQUIREMENTS: All studen’ e of Student Affairs. computer or mobile device with camera and microphone. Face university commits to providing technical support and learning res! and the University Library. For assistance, contact your respective the Inform ources through the Offic college offices or DEBORAH MERRITT Chancellor"
    },
    {
        "image": "announcement2_synth_20_aug2.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila Office of the Chancellor Tel: (02) 8920 5301 to 8920 5320 Email: info university edu ph Website: www university edu ph November 03, 2025 PUBLIC ANNOUNCEMENT RE: Extension of Enrollment Period for Second Semester AY 2024 2025 Greetings! The university administration announces the implementation of flexible learning modality for the upcoming semester to provide quality education while ensuring the health and safety of our academic community. LEARNING MODALITIES AVAILABLE: Face to face classes: For laboratory subjects and specialized courses requiring physical presence Online synchronous: Real time virtual classes via approved learning management platforms Online asynchronous: Self paced learning through recorded lectures and modules Hybrid format: Combination of face to face and online delivery methods Students will be informed of their class modalities through official email and the student portal. Faculty members will provide course syllabi indicating the learning format, schedule, and assessment methods. GUIDELINES AND REQUIREMENTS: All students must maintain reliable internet connection for online classes. Technical requirements include computer or mobile device with camera and microphone. Face to face participants must comply with health protocols. The university commits to providing technical support and learning resources through the Information Technology Services Office and the University Library. For assistance, contact your respective college offices or the Office of Student Affairs. DEBORAH MERRITT Chancellor"
    },
    {
        "image": "announcement2_synth_20_aug3.png",
        "label": "announcement",
        "ocr_text": "rod UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila Office of he Chance! 8920 5301 to 8920 5320 mo university edu PUBLIC ANNOUNCEMENT RE: Extension of Enrollment Period for Second Semester AY 2024 2025 Greetings! The university administration announces the implementation of flexible learning modality for the upcoming semesier to provide quality education while ensuring the health and safety of our academic community. LEARNING MODALITIES AVAILABLE: Face to face classes: For laboratory subjects and specialized courses requiring phy presence Online synchronous: Real time virtual classes via approved learning management platforms methods Stucents will be informed of their class modalit wil provide course syllabi indicating the REQUIREMENTS: All students must main cal nline asynchronous: nat: Combination of face to face and online delivery through official email and the student portal. Faculty members HES AND arming format, schedule, and assessment methods. GUIDE n reliable internet connection for online classes. Technical requirements include computer or mobile device with camera and microphone. Face to face participanis must comply with health protocols. The university commits to providing technical support and learning res and the University Library, For assistance, contact your re urces through the information Technology Servicas Office pective college offices or the Office of Student Affairs. DEBORAH MERRITT Chancelior"
    },
    {
        "image": "announcement2_synth_20_aug4.png",
        "label": "announcement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Quezon City, Metro Manila Tel: (02) 8920 5301 to 8920 5320 Emaii: info university edu ph Website: www university edu pn Office of the Chenceitor November 03, 2025 PUBLIC ANNOUNCEMENT RE: Extension of Enroliment Period for Second Semester AY 2024 2025 The university administration announces the impiementation of flexible learning modality for the upcoming Greetings! semester to provide quality education while ensuring the health and safety of our academic community. LEARNING MODALITIES AVAILABLE: Face to face classes: For laboratory subjects and specialized courses requiring physical presence Online synchronous: Real time virtual classes via approved learning management platforms Online asynchronous: Self paced jearning through recorded lectures and modules Hybrid forrnat: Combination of face to face and online delivery methods Students will be informed of their class modalities through official email and the student portal. Faculty members will provide course syllabi indicating the learning format, schedule, and assessment methods. GUIDELINES AND REQUIREMENTS: All students must maintain reliable internet connection for online classes. Technical requirements include computer or mobile device with camera and microphone. Face to face participants must comply with health protocols. The university commits to providing technical support and learning resources through the Information Technology Services Office and the University Library. For assistance, contact your respective college offices or the Office of Student Affairs. DEBORAH MERRITT Chancellor"
    },
    {
        "image": "announcement2_synth_20_aug5.png",
        "label": "announcement",
        "ocr_text": "OF THE PHILIPPINES DILIMAN UNIVERSITY Quezon City, Metro Manila Office of the Chancellor _ i: info university edu pn Website: www university edu ph Tel: (02) 8920 5301 to 8920 5320 Email November 03, 2025 PUBLIC ANNOUNCEMENT ond Semester AY 2024 2025 RE: Extension of Enrollment Period for Sec odality for the upcoming academic community. LEARNING ialized courses requiring physical ent platforms Online asynchronous: face and online delivery rtal. Faculty members ELINES AND cal requirements include Ith protocols. The logy Services Office on announces the implementation of flexible learning m while ensuring the health and safety of our ABLE: Face to face classes: For \\aboratory subjects and spec! ous: Real time virtual classes via approved learning managem h recorded lectures and modules Hybrid format: Combination of face to rmed of their class modalities through official email and the student po g the learning format, schedule, and assessment methods. GUID st maintain reliable internet connection for online classes. Techni a and microphone. Face to face participants must comply with heal support and learni hrough the Information Techno! ntact your resp ffices or the Office of Student Affairs. niversity administrati Greetings! The U de quality education semester to provi MODALITIES AVAIL ce Online synchron presen ing throug Self paced learn methods Students will be info will provide course syllabi indicatin REQUIREMENTS: All students mu computer OF mobile device with camer university commits to providing technica and the University Library. For assistance, CO ective college DEBORAH MERRITT Chancellor"
    }
]