[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "appletter",
        "ocr_text": "Cook, Jones and VWails tei vknight amail com Approval Letter Format Teresa Holt He Manager Emaijamichael gmail com May to inform you thet proved 1a valuable tated his Shepher d Ry g"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "appletter",
        "ocr_text": "bg Cook, Jones and Walls vknight gmail com Approval Letter Format Teresa Holt Human Resources Manager Emaitlemichael gmail. com May 23, 2050 Katherine Hunt Chief Executive Officer taylotestrada gmail com Dear Michael eanson hope this email finds you well. am writing consideration, to inform you that after Careful the management at Harris and Sons Lid, has Spproved the internat application of one of our exceptional employees, Alexander for a new Dosition within ins our company. meal hitio has been a vaivabie member of our team for several years an jon, skills, and commitment to the gro: ving bis internal apptiesting on. in. demonstrated his dedicat; id has consistently Smith, Shepherd By appre th and success of"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "appletter",
        "ocr_text": "Cook, Jones and Walls vknight gmail com Approval Letter Format Teresa Holt Human Resoure Manager Emaitlemichasl gmail com May 23, cose ta ylbtestradaa @gmail com Michael rarisori fell are writing to inform you ment at has _ PPE ap of one of our Our company,"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "appletter",
        "ocr_text": "* Cook, Jones and Walls vknight gmail com Approval Letter Format Teresa Holt Human Resources Manager Email emichael gmail com May 23, 2050 Katherine Hunt Chief Executive Officer taylétestrada gmail com Dear Michael anson hope this email finds you well. am writing to inform you that after careful consideration, the management at Harris and Sons Ltd. has approved the internal application of one of our exceptional employees, Alexander for a new position within our company. awkins hil has been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of Smith, Shepherd By approving his internal annlicatinn «sn knit... ale! __"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "appletter",
        "ocr_text": "* Cook, Jones and Walls vknight gmail com Approval Letter Format Teresa Holt Human Resources Manager Emailjemichael gmail com May 23, 2050 Katherine Hunt Chief Executive Officer tayltestrada gmail com Dear Michael anson hope this email finds you well. 1 am writing to inform you that after careful consideration, the management at Harris and Sons Ltd. has approved the internal application of one of our exceptional employees, Alexand nder for a new position within aw! Ins our company. hilo has. been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of emith Shenherd By annrovina his internal application, we believe thaSamanthaexpertise"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "appletter",
        "ocr_text": "* Mvers Ltd Ltd. johnson gmail com Approval Letter Format Theresa Allen Human Resources Manager ‘mafanuelsmith gmail com May 23, 2050 Nicholas Cole Chief Executive Officer uthomas gmail com Dear i iment hope this email finds you well. consideration, the Management application of one of our exception our company. am writing to inform you at Perry, Lester and Norman h Ltd. al employees, that after careful aS approved the internal Crystal for a new Position within Fisher pxiig has been a valuable member of our team for several years and has demonstrated his consistently dedication, skills, and commitment to the growth and success of fain rn By approving his internal application wa here. a"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "appletter",
        "ocr_text": "bg Myers Ltd Ltd. ijohnson gmail com Approval Letter Format Theresa Allen Human Resources Manager Emshanuelsmith gmail com May 23, 2050 Nicholas Cole Chief Executive Officer ithbmas gmail com Dear Ri a NS ID i am writing to inform you that after careful ry, Lasiet and Norman fas approved the internal for a new position within i hope this email finds you well. consideration, the management at Pe application of one of our exceptional employees, a ystai isher cur company. pete? has been a valuable member of our team for several years and has consistently skills, and commitment to the growth and success of demonstrated his dedication, ; By apnrayving his intemal application, we believe th ragPatricia expert tise"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "appletter",
        "ocr_text": "Myers Ltd Ltd. johnson gmail com Approval Letter Format sans urces Manager Em hanuelsmith gmail com May is email finds you well. am writing to inform you that after careful man fig ideration, the manage application of our company. approved the internal of our exceptional employ for a new position wi"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "appletter",
        "ocr_text": "% Myers Ltd Ltd. ijohnson gmail com Approval Letter Format Theresa Allen Human Resources Manager *mhanuelsmith gmail com May 23, 2050 Nicholas Cole Chief Executive Officer utHomas gmail com Dear i Jim ee Ri hope this email finds you well. am writing to inform you that after careful consideration, the management at Pemy, Lester and Norman has approved the internal application of one of our exceptional employees, Crystal our company, i for a new Position within Fisher D Faro, has been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of fiairia Tain By approving his internal applicatinn «... 4... eo"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "appletter",
        "ocr_text": "ey se Mvers Lid Ltd. iohns son gmail com Approval Letter Format neresa Allen H tuman Reso Em hanuelsm th gmail. Re om SA Law oe ginal com Oear icharg fected Moy fer careful inform you that weil tam weithng 7 at Penyb apes ved ya new pos nis ernail finds you al employ of our —— aT! the growth and success exper i"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "appletter",
        "ocr_text": "* Clark, King and Jones Sans kliu gmatcom Approval Letter Format Kristen Morgan Human Resources Manager Emgitarezdenise gmail com May 23, 2050 Jennings Ubs Chief Executive Officer mattittezbrad gmail com Dear Debra tone hope this email finds you well. am writing to inform you that after careful consideration, the management at Gutigrrez, Mereado and has approved the internal application of one of our exceptional employees, pPavid for a new position within almer our company. 7g, has been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of 11) Di annroving his internal application, we believe thaStephaniesxpertise"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "appletter",
        "ocr_text": "Clark, King and Jones and Sans ku gmail com Approval Letter Format is Manager fmtharezdenise gmail com ive Officer martihezbrad gmail com Hoof am vtiue excoplonal en member hor sia"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "appletter",
        "ocr_text": "* Clark, King and Jones and Sans kliu gmail com Approval Letter Format Kristen Morgan Human Resources Manager Emgiarezdenise gmail com May 23, 2050 senate Bbs Chief Executive Officer madftittiezbrad gmail com Dear Debra tone hope this email finds you well. am writing to inform you that after careful consideration, the management at ere Mere atelead has approved the internal application of one of our exceptional employees, David for a new position within aimer our company. 7fyle,, has been a valuable member of our team for several years and has consistently iemonetrated his dedication, skills, and commitment to the growth and success of Rw aeemaase td Ry approving his internal application, we believe thaStephanieexpertise"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "appletter",
        "ocr_text": "Clark, King and Jones and Sans klu gmail com Approval Letter Format Kristen Morgan cer maitihezby ad gmail com Dear febra email finds you wel, foam wr fa you that the man and figs approved vid for 3 new position within pe wser Member of our team fo ation, Antireaws I fel By aopraving"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "appletter",
        "ocr_text": "* Clark, King and Jones and Sons kliu gmail com Approval Letter Format Kristen Morgan Human Resources Manager Emgliarezdenise gmall com May 23, 2050 yestaings Ubs Chief Executive Officer maitthezbrad gmail com Dear bra: Qfne u that after careful 1 hope this email finds you well. am writing to inform yo consideration, the management at Gutigrror Mercado and has approved the internal ison and Sons application of one of our exceptional employees, bavig fora new position within almer our company- everal years and has consistently t to the growth and success of thaStephanieexpertise ember of our team for s ommitmen oe we believe m Hoe has been a valuable tion, skills, and amas Sea hig dedica"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "appletter",
        "ocr_text": "* Holloway, ions and Haley orvoration jichaelwilkerson gmail com Approval Letter Format Kevin Smith Human Resources Manager Ema tephanieO6 gmail com May 23, 2050 Patricia Morris Chief Executive Officer syfvabooker gmail com vor i hope this email finds you well. am writing to inform you that after careful consideration, the management at Garcia LLC Ltd, has approved the internal application of one of our exceptional employees, Tho. oe, MD for a new position within our company. Amber has been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of ee ee ee ee a"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "appletter",
        "ocr_text": "okt Holloway, Torres and Haley _ arooration ichaelwilkerson gmail com Approval Letter Format Kevin Smith Human Resc Manager EmaitephanicO6 gmail com syfJRibooker gmai ilcom Dear isa isen email finds you well, am writing 9 inform you i hope n, the manegeam has consha 5 cia LLC Lt. application of one of our s es, thon oS in MD our Company."
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "appletter",
        "ocr_text": "Holioway, Torres and Haley Corporation uchaelwilkerson gmail com Approval Letter Format Kevin Smith Human Res Manager PmateshanieQ6 gmail com Chief a Office syWbooker gmail com Dear is3 this email finds fleer ation, the application of"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "appletter",
        "ocr_text": "* Holloway, Torres and Haley orporation michaelwilkerson gmail com Approval Letter Format Kevin Smith Human Resources Manager Emajtephanie0O6 gmail com May 23, 2050 Patricia Morris Chief Executive Officer syhiabooker gmail com Dear isa sen | hope this email finds you well. am writing to inform you that after careful consideration, the management at Garcia LLC Ltd, as approved the internal application of one of our excepti cd iti ithi pplication of one of our exceptional employees, 7, Todd, MD for a new position within our company. ‘Mnber has been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of HaIn Rainneey approving his internal annlinatinn co. kn - ohn ww"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "appletter",
        "ocr_text": "* Holloway, Torres and Haley orvoration haelwilkerson gmail com Approval Letter Format Kevin Smith Human Resources Manager Emadtephanied6 gmail .com May 23, 2050 Patricia Morris Chief Executive Officer syfyribooker gmail com Dear isa issn 1 hope this email finds you well. am writing to inform you that after careful consideration, the management at Garcia LLC Ltd. has approved the internal application of one of 0! xception joyee AC f i Pp! ion of one of our exceptlo al employe’ S, tromoesn MD or a new position within our company. for several years and has consistently tment to the growth and success of Amber has been a valuable member of our team believe that Zachary expertise demonstrated his dedication, skills, and comm' bnamuing his Imerne! application, we"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "appletter",
        "ocr_text": "* Rodriguez Grant Group Zlong gmail com Approval Letter Format Laura Peterson uman Resources Manager Email: yharris gmail com May 23, 2050 Jamie Rivers Chief Executive Officer jéfittifert 8 gmail com Pear ERS? I hope this email consideration, the management at application of one of our exe: our company. finds you well, am Lee- eptional emplo writing to inform you that after careful Carter Inc. has approved the internal Yees, Alicia for a new Position within Underwood"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "appletter",
        "ocr_text": "Rodriguez Grant Group zlong gmail com Approval Letter Format Man Email: yharris gmail com xy BE iMay 23, ie Rivers Ch Rive r jéani ifer 83 gmail. com DB veresa Puller you well. am writing to inform you 1 f one of our Carter Inc. has of our t and comynit ban"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "appletter",
        "ocr_text": "Rodriguez Grant Group ziong gmail corm Approval Letter Format OM id rif er18 @gmail com uller this email finds you well, am writ L ee- Carter in ion, we be"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "appletter",
        "ocr_text": "* Rodriguez Grant Group zlong gmail com Approval Letter Format Laura Peterson Human Resources Manager Email: yharris gmail com May 23, 2050 Jamie Rivers Chief Executive Officer jéfittifer1 83 gmail com Pear Wifier hope this email finds you well. am writing to inform you that after careful consideration, the management at |ee Carter Inc. has approved the internal application of one of our exceptional employees, Ul Alicia for a new position within ni lerwood our company. AUG, has been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of Walker Rahersan approving his internal application, we believe that Nicolas expertise"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "appletter",
        "ocr_text": "in a ae Vi Rodriguez Grant Group Ziong gmail com Approval Letter Format 8 Manager yharris agmail corn May 23, 2030 Jamie Rivers jefitifer1 8 gmail com (ler his deration, i Pog n of one our Company. approved the j for a new 4 i Undenvaod"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "appletter",
        "ocr_text": "Brewer and Sons Inc. chrown gmail com Approval Letter Format iney Anthony s Manager Emait toni9S5 gqmail com May 23, 2050 Dalton Fox Chief Executive Of geiscot amal com Dear Jason Christense hope » arm writing to inform you after Bowen Lid Group has approved the internal nal ernply 2e8, position within FECS,+ aura Wall for new 4 pOSTHOn WHIRIN"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "appletter",
        "ocr_text": "* Brewer and Sons Inc. cbrown gmail com Approval Letter Format Courtney Anthony Human Resources Manager Email: toni95 gmail com May 23, 2050 Dalton Fox Chief Executive Officer gétitryscott gmail com Dear, Jason Christensen hope this email finds you well. am writing to inform you that after careful consideration, the management at Bowen Ltd Group has approved the internal application of one of our exceptional employees, for a new position within Laura Wall our company. Michael has been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of Vasniiez and By appreving his internal application. we believe that David avmartien."
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "appletter",
        "ocr_text": "* Brewer and Sons Inc. cbrown gmail com Approval Letter Format Courtney Anthony Human Resources Manager Email: tonig5 gmail com May 23, 2050 Dalton Fox Chief Executive Officer géfitryscott gmail com Dear, Jason Christensen e this email finds you well. la the management at Bowen Ltd Group h tional employees, aura Wal m writing to inform you that after careful as approved the internal hop: for a new position within consideration, application of one of our excep our company. and has consistently wth and success of id expertise y of our team for several years mitment to the gro ichael has been a valuable membe lication, We believe that Dav dedication, skills, and com raham demonstrated his a ee. intarnal aDD!"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "appletter",
        "ocr_text": "* Brewer and Sons Inc. cbrown gmail. com Approval Letter Format Courtney Anthony Human Resources Manager Email: toni95 gmail com May 23, 2050 Dalton Fox Chief E xecutive Officer gehittyscott gmail com Dear Jason Chiisterise) hope this email find consideration, Michael has been a y demonstrate his and has Consistently » and commitment to the growth and success of Yannitir an B approving his internal applicatian ... ck"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "appletter",
        "ocr_text": "Brewer and Sons Inc. chrowne @aqrnail. com Approval Letter Format Courtney Anthony Human Resources Manager Emaik ton 5 amail com Fox xecutive Officer gétittyscott@ gmail com bear, Jason. Christensen Ca! ig email finds you well, om writing ta inform you that afte i d the intemal management at Bowen Lid Group has appr for a new position within applicattc *) ey 229, application dona! eraploye Laura Wail Our COMPS a valuable member of our team for sev kis, and commitment to |"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "appletter",
        "ocr_text": "te Clayton LLC Ltd. gutierrezanita gmail com Approval Letter Format ee BUEN, Saunders Human Resources Manager Embannanyoung omail com Mary Krai Chief Executive Officer HOoKe49 amall com Bear Christopher Rangel email finds you well. am writh to inform you has the oman ak ey yee gement at app our company. ceplianal employee 1eW POS position w PUPAE has b and has consi wih and suce"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "appletter",
        "ocr_text": "* Clayton LLC Ltd. gutierrezanita gmail com Approval Letter Format Lauren Saunders Human Resources Manager Embiannahyoung gmail com May 23, 2050 Mary Kramer Chief Executive Officer brébke40 gmail com Dear Christopher Rangel hope this email finds you well. am writing to inform you that after careful consideration, the management at Gates, Arias and Wagner has approved the internal application of one of our exceptional employees, Suran e fora new position within i ey our company. Rodiigued as been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of Reltran Tayiney approving his internal application we haliaua +hatns..: ee"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "appletter",
        "ocr_text": "Clayton LLC Ltd. gullerrezanita gmail com Approval Letter Format Lauren Saunders Human Resources Manager EmWannahyoung gmail com Mary Kramer Chief Executive Officer brébke40 gmail com ta inform you Wagner has appre Raltran Tayin y app"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "appletter",
        "ocr_text": "eaelavton LLC Ltd. gutierrezanit fa gmail com Approval Letter Format Lauren _, Saunde Human E pannahyoung gmail com May 23, 2¢ ry Kramer bRaked0 gmail c Christer email finds you well fam writing to inform you that afte at 6 nd Wagner s approved nne fora new i? PA applc Lof on our company."
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "appletter",
        "ocr_text": "Clavton LLC Ltd. jutierrezanita gmail com Approval Letter Format in Hume ss Manager stepher Dear Ch Rangel iam writ f hope thi consideration, the internal Suzanne on within rai nD ication, sklils"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "appletter",
        "ocr_text": "* Gould and Sons Ltd. gregory18 gmail com Approval Letter Format Jamie Park Human Resources Manager Emeiilliamslaurie gmail com May 23, 2050 OE dneS Chief Executive Officer johri onneil gmail com Dear Jessica oleman hope this email finds you well. am writing to inform you that after careful consideration, the management at Crug, Watson and has approved the internal application of one of our exceptional employees, Michael for a new position within arter our company. Randy has been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of a) A Ry approving his internal application, we believe that David expertise"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "appletter",
        "ocr_text": "Gould ang Sons ‘Ltd. gregor ¥18 amail, com Approval Letter Format Jamie Park Mang E \"willlamstaurie gmail com May 2 3, iohtiSonneil@ I@ @gmail com YOu well f iif"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "appletter",
        "ocr_text": "* Gould and Sons Ltd. gregory18 gmail com Approval Letter Format Jamie Park Human Resources Manager Emwiilliamslaurie gmail com May 23, 2050 Gardwelt® Chief Executive Officer joftiSonneil gmail com Dear Jessica oleman hope this email finds you well. am writing to inform you that after careful consideration, the management at Cruz Watson and has approved the internal application of one of our exceptional employees, Michael for a new position within arter our company. Rendy has been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of Bamnn |! BY appreving his internal application, we believe that David expertise"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "appletter",
        "ocr_text": "* Gould and Sons Ltd. gregory 8 gmail com Approval Letter Format Jamie Park Human Resources Manager Em iilliamslaurie gmail .com May 23, 2050 Dr, Charles aldwe! Chief Executive Officer jofti onneil gmail com Dear assis oleman 1 hope this email finds you well. am writing to inform you that after careful Cruz, Watson and has approved the internal consideration, the management at 1z Walser for a new position within application of one of our exceptional employees, Michael e our company. ber of our team for several years and has consistently kills, and commitment to the growth and success of Randy has been 4 valuable mem believe that Pavid expertise e demonstrated his dedication, S! hic intemal application, we"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "appletter",
        "ocr_text": "Gould and Sons Ltd. gregory18 gmail com Approval Letter Format Jamie Park Human Resourcas Manager E \"Williamsiaurie gmail com May 23, 2050 sen Chief Executive Officer joftiSonneil gmail com Dear clgssica oleman hope this email finds you well, fam writing consideration, the Management at application of one of our company. to inform you Cruz, Watson and Russell itd Our exceptional employees that after careful has approved the internat Michae! for a new position within arner itd Randy Read has been a valuable OF several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success oF R NMan tC By approving his internat appearing OM 4 member of our team ¢"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "appletter",
        "ocr_text": "* Carter Inc Inc. benitezsherry gmail com Approval Letter Format pelinda rancis Human Resources Manager Email: yicki98 gmail com May 23, 2050 Whitney Patel Chief Executive Officer willfa hsjames gmail com Dear mes oses hope this email finds you well. am writing to inform you that after careful consideration, the management at Cea ale nesiand has approved the internal application of one of our exceptional employees, casey Lyons for a new position within our company. passiga has been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of Evane Rarry By approving his internal application, we believe that Tiffany expertise"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "appletter",
        "ocr_text": "* Carter Inc Inc. benitezsherry gmail com Approval Letter Format Belinda francis Human Resources Manager Email: vicki988 gmail com May 23, 2050 Whitney Patel Chief Executive Officer willfa hsjames gmail com Dear mes oses hope this email finds you well. am writing to inform you that after careful consideration, the management at Mitchell, Hu Ines and has approved the internal application of one of our exceptional employees, casey Lyons for a new position within our company. yessis2 has been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of Evane Rarry, By approving his internal application. we believe that Tiffany exnertise"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "appletter",
        "ocr_text": "Carter Inc Inc. benitezsherry agmail com Approval Letter Format Hur fader May 5 willl hsjames gmail com w James Oses Four exceptio 'G inform you that a Careful and has approved ral years nitinent to th: been a valuable me strated his dedi ane Rar Bs his internal ary"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "appletter",
        "ocr_text": "Carter Inc Inc. Loam benitezsherry amai willla hsja mes gmail com ar Kpmes me OSES ey team for ge"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "appletter",
        "ocr_text": "Carter Inc Inc. senitezsherry gmail com Approval Letter Format Belinda “ray ve OM cer wil lifaths| comes gmall com Dear mes, te Ses you that after careful you well bam wri to inform aber of our team 7 ahas heen valuable mem"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "appletter",
        "ocr_text": "* Johnson Gallagher Ltd. lewislaura gmail com Approval Letter Format Kim Jackson Human Resources Manager Enebrideelizabeth gmail com May 23, 2050 Frank Williams Chief Executive Officer ntsbinson gmail com Dear Eric Kim’ hope this email finds you well. am writing to inform you that after careful consideration, the management at acostaandSons inc, has approved the internal application of one of our exceptional employees, FiMichagts for a new position within our company. Patricia has been a valuable member of our team for several years and has consistently demonstrated his dedication, skills, and commitment to the growth and success of Henderson Grouyn BY approving his internal application. we believe thatKennethexpertise"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "appletter",
        "ocr_text": "Johnson Gallagher Ltd. lewisiaura gmail com Approval Letter Format Kim Jackson Human Resor 3 Manager imebrideelizabeth gmail com May 23, 2050 nfé inson gmail com Pest Ere Kien s you well i am wiiting to inform you"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "appletter",
        "ocr_text": "* Johnson Gallagher Ltd. lewislaura gmail com Approval Letter Format Kim Jackson Human Resources Manager Fmaibrideelizabeth gmail com May 23, 2050 Frank Williams Chief Executive Officer nrsbinson gmail com Deat Eric Kim’ hope this email finds you well. the management at Acosta and Sons Inc. ceptional employees, ich pional employees AES am writing to inform you that after careful consideration, has approved the internal application of one of our ex for a new position within our company. s years and has consistently he growth and success of hexpertise le member of our team for several commitment to t application, we believe thaKennet atricia has been a valuab uentes ated his dedication, skills, and demonstr envine hic interna nn"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "appletter",
        "ocr_text": "Jonnson Gallagher itd. lewislaura gmail com Approval Letter Format Kim Jackson Human Resources Manager ipebridectizabeth( @gmait com May Chief E a CF afubincon gmail c com hope ibis email to inform you appre finds you well. 4 an F has 8 INE managemen"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "appletter",
        "ocr_text": "* Johnson Gallagher Ltd. lewislaura gmail com Approval Letter Format Kim Jackson Human Resources Manager Em brideelizabeth @gmail com May 23, 2050 Frank Williams Chief Executive Officer nrsbinson gmail com Dearc,; Eric Kim’ hope this email finds you well. am writing to inform you that after careful consideration, the management at Acosta and Sons Inc. has approved the internal application of one of our exceptional employees, Michag! for a new position within Fisher DDS our company. 2 member of our team for several years and has consistently ation, skills, and commitment to the growth and success Of atriciahas been a valuabl ‘uentes et annlication, we believe thaKennethexpertise demonstrated his dedic"
    }
]