[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "appletter",
        "ocr_text": "Strickland PLC and Sons Approval Letter Mr. Andrew pep SAAhat aad Em olden amail com February 07, 2024 My lan BESS Operations Manager zachatylewis gmail com Deal Barbara Johnson We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date: March 10, 2024 Time: 3 24} PM 34? PM Location: 386 Chase Forest Suite 444, New Katie, DC 91080"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "appletter",
        "ocr_text": "Strickland PLC and Approval Letter a ndrew Depanae Mead EmHolden amail com February 07, 2024 orden BR Operations Manager zachatylewis gmail com Deal Barbara Johnson We are pleased to Inform you approved. We value your commit and we betiaye that your request for Mert and input as this meeting wilt business meetin, an empioyse 9 has been of Soiag Corporation, ontribute to tha growth and SUCCESS of our organization, Meeting Details: Date: Mare, Merch 10, 2024 Time: S84 PM 345 pag Location: 226 chase Forest Sutte 444, New Koti DC 916a0"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "appletter",
        "ocr_text": "Strickland PLC and Approval Letter A ndrew Depatiners ead Emtioldan amail com February 07, 2024 seed Bes Operations Manager zachatylewis gmail com Dear Barbara Johnson We are pleased to inform you that your reque: approved, We value your commit and we believe this meetin organization. st for a business meeting has been ment and input as an employee of Solas Corporation, g will contribute to the growth and success of our Mecting Details: Date: Marnh 10, 2024 Time: 35 4 pi Shky PM Location; 346 Chass Forest Sute 444, New Katie, DC 91080"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "appletter",
        "ocr_text": "Strickland PLC and Approval Letter rew bas i Mead Entlolden amail com February 07, 2024 Sera BasL Operations Manager Zachatylewis gmail com pear bara Johnson We are pleased to inform approved. We value your col and we believe this meet! organization. you that your request for mmitment and input as an ing will contribute to th business meeting has been employee of Solas Corporation, growth and success of our Meeting Details: Date: March 10, 2024 Time: SR PM 33 PM Location; 386 Chase Forest Suite 444, New Katie, DC 91080"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "appletter",
        "ocr_text": "Strickland PLC and sons Approval Letter Meiahany Depaainent Head Em Holden amail com February 07, 2024 Serdar BBS Operations Manager zachatylewis gmail com Dear garbara Johnson We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date: March 10, 2024 Time: 5 9 PM 3 48 PM Location: 386 Chase Forest Suite 444, New Katie, DC 91080"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "appletter",
        "ocr_text": "Robbi eee Approval Letter Elizabeth Ortiz Department Head ieholson gqmail com September 03, 2024 Daniel Lewis Operations Manager schritmichael gmail com D2 Debbie Barber ting has been We are pleased to inform you that your requesi for a business m approved, We value your commitment and input as an employee of Solas Corporation, and we believe this measting will contribute to the growth and success of our organization. Meeting Details: Date Inky 44, 2025 Time lgS4em 347 PM PY\" 2484 Chi Bre Gna, puaruileS ors vms"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "appletter",
        "ocr_text": "Robbins- efferson and ns Approval Letter Elzape tii Ortiz Department invhoison gmail. com Sepigmber 03, Daniel Lewis Operations Manager schimitimichaei gmail com Dear -, Debbie Barber meeting has been for bush 3ut as an employ mite ig the growth and suc and w organization. Mesting Detalis: Date hit 44, 2025 a mantle:"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "appletter",
        "ocr_text": "Robbin s defferson Approval Letter Elizabeth Ortiz Department He ad inwholson gmail com September 03, Daniel Lewis Sperations Manager schrnitmichael gmail. com Deal nepbie Barber usinegs meeting has been We ave pleased to inform you thal your request for a b a value your commitment and input a8 an employ this meeting wil contibute te the growih and succe of Salas Corparation, s of oUF approved. and we believe organization. Meoting Details: pate flv 11, 2025 Finna 2DADRA ©. 2 49 PM"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "appletter",
        "ocr_text": "Robbin bins “gefferson i Approval Letter Elizabeth Ortiz Department Head fehholson gmail. com September 03, Daniel Lewis Operations Manager schmittmichael gmail com Dear Debbie Barber We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date: tnilv 44, 2025 Time: item 249 PM 6 2464 \\- iP Ph ‘Suite 633, North Michelle, MT Location; a e otf"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "appletter",
        "ocr_text": "> Robbins- obaingesieree\" fi Approval Letter Elizabeth Ortiz Department Head foriholson gmail com September 03, Daniel Lewis Operations Manager schrnittmichael gmail com Dear Debbie Barber as been st for a business meeting h s an employee of Solas Corporation, d success of our We are pleased to inform you that your reque: approved. We value your commitment and input a and we believe this meeting will contribute to the growth an organization. Meeting Details: Date: ily 11, 2025 eM 349 PM Time:! air 2464 Christine Branch Suite 633, North Michelle, MT"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "appletter",
        "ocr_text": "Hail LLC Group Approval Letter Janet Bauer Department Head Sorticlean aqmail com November 30, 2024 Jennifer Quinn Operations Manager barimara79 gmail com we pleased to inform you that your request for a business meeting been your comnit input as an employee of Solas Corporation ese anivibute 4 approved, We value io the growth and success of ou organization. Meeting Getealis: DateFebrary 23, 2025 Tienes Ten Pe 230 BM"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "appletter",
        "ocr_text": "Approval Letter Janet B Departmen 8wWeitcleaan amait com November 30, 2024 Jennifer Quinn Operations Manager barara79 gmail com Dear Jaime Hernandez We are pleased aporoy and we f commiment a Meeting Getaite: Location:"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "appletter",
        "ocr_text": "Hall LLC Group Approval Letter Janet Bauer Department Head Ewrticlean qmail com November 30, Jennifer Quinn Operations Manager batsara79 gmail com Dear Jai Hernandez We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date February 23, 2025 Time: 7gR{ PM 333) PM Lanatian: 305 Mitchell Pass Suite 805, East Toddview, NY 20403"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "appletter",
        "ocr_text": "Approval Letter Janet Bauer Department Head Sweliclean qmail com November 36, Jennifer Quinn Operations Manager batisara79 gmail com Dear Jaime Hernandez We are pleased to in OUF request for approved, We value YOur Commitment and input a and we believe thig meet organization, FORM you thet & business meeting has been S af employce of Solas Corporation, 9g wil contribute te the growth and Success of our Meeting Getaile: pate February 23, 2025 n 7 3 DMA. 2 39 Time: ‘ANA PM 230 Pha Location; 205 stcien"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "appletter",
        "ocr_text": "Approval Letter Janet Bauer Department Head Bageticl jean admail com Novernber 39, 2024 Jennifer Quinn Operations Manage? parbara7g gmall. com meeting has t F Solas Corpo! Near aun pHelfandez a busine g inform you that your request for ag an employee OF coramiinnent and input ating will contribute 1 the growth and su We are pleased 7 approved We value you and we believe this me organization. Meeting Details: Date Fehriary 23, 2025 vime: (ea) PM~ 3a9 PM"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "appletter",
        "ocr_text": "Anderson Frank Approval Letter Alyssa Skinner Department Head latfetthomoson gmail com November 01, Nancy Reed Operations Manager gldve gmail com Dear alan Simpson s been We are pleased to inform you that your request for a business meeting ha: approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date: lily 18, Time: 80 A ead ev ose Brian Extension Apt. 083, Williamsport, TN 23323"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "appletter",
        "ocr_text": "Anderson- -Frank Approval Letter Alyssa Skinner Department Head lauiretihomoson gmail com November 01, Nancy Reed Operations Manager &ldve gmail com Dear Alan Simpson We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date: ily 18, 2024 Time: 8 50 PM 6% PM Location: 45 Brian Extension Apt. 083, Williamsport, TN 23323"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "appletter",
        "ocr_text": "Anderson- -Frank Approval Letter Alyssa Skinner Department Head lqurethompson gmail com November ot, Nancy Reed Operations Manager give @gmail com Deer alan Simpson uy request for a business meeting has been We are pleased to inform you that you value your commitment and input as an employee of Sola wilh contribute to the growth and 3 wae approved. and we be organization, wees Derails:"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "appletter",
        "ocr_text": "AMOS rank he Approval Letter Alyssa Skinner Department Head lauke homoson gmail com Metant ss 01, Nancy Reed Operations Manager 'slve gmail com Dear Alan Simpson We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date: Iiily 18, 2024 Time: 8589 PM 6 23 PM Location; 945 Brian Extension apt. 083, Williamsport, TN 23323"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "appletter",
        "ocr_text": "Anderson Frank Approval Letter Alyssa Skinner Department Head lauiefhomoson gmail. com Novas Ot Nancy Reed Operations Manager sldve gmail com Dear Alan Simpson We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date: 1111 8, 4 Time: 8338 ty 2 Z024 Location: 5 8rian Extension Apt. 083, Williamsport, TN 23323"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "appletter",
        "ocr_text": "Approval Letter Nicole Oliver partment Head Soran85 amail com October 15, 2902 Chery Blankenshig Operations Manager jaokduke gmail com Beaty anielle Porter We are Pleased to int Onm you that your request approved, We vale YOUr Commltment and we believe this m organization, for businass meeting has bean and input as an employee of So! aS Corporation, eting will comrbute fo the growth and sticceas of our Meeting Betaiie: Date Atinust 13, 2024 Location; 7 White Steel Apt 924, Pisten"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "appletter",
        "ocr_text": "Gross Burns Ltd. Approval Letter Nicole Oliver Department Head Enrvan85 amail com October 15, 2023 Chery! Blankenship Operations Manager jeoxtiuke gmail com Dear Danielle Porter We are picased to inform you that your request for a busines approved, We value your S$ mesting has been commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization, Meeting Details: Date Aucust 13, 2024 Time: BRP PM £43 PM Location; 2812 White Steet Apt 931, Pimanmouth, DE 53417"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "appletter",
        "ocr_text": "Gross Burns Ltd. Approval Letter Nicole Oliver Department Head Enaian85 amail com October 15, 2023 Cheryl Blankenship Operations Manager jJaokduke gmail com Dear Danielle Porter We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date Auoust 13, 2024 Time: sre PM £43 PM Location: 12 White Street Apt. 931, Pittmanmouth, DE 93417"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "appletter",
        "ocr_text": "Gross Burns Ltd. Approval Letter Nicole Oliver Department Head EnjlanSs amail com October 15, 2023 Cheryl S rip Op 3 Manag jgokedu ike gmail. com Dest p anielle Porter est for a Dus tas an erapto io the growth Meeting Details Date: pen gt 3, 2024 Patmanmouts"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "appletter",
        "ocr_text": "Gross Burns Lid. Approval Letter Nicole Oliver c tirnent Head Suan’ 5 amail com October 16, 2023 jefokduke gmail Lcom Peat Danielle Porter that your i for a busin SB organiz Meeting Details: Date Auisust 1 43, 2024 Tirne: nH er) PM"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "appletter",
        "ocr_text": "Sparks Ellis Ltd. Approval Letter Ronnie Tapia Department Head Fetsibcca34 gmail com February 24, 2024 Benjamin Gates Operations Manager jerisenjane gmail com eat Dana Gilbert We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date: Anvil 30, 2025 Time: Ki PM xf PM 7764 Mary Avenue Apt 066, East Jacob. AZ 13146 agatign f"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "appletter",
        "ocr_text": "Sparks Ellis Ltd. Approval Letter Ronnie Tapia Department Head Felcca34 gmail com February 24, 2024 Benjamin Gates Operations Manager jerisenjane gmail com P88 Dana Gilbert pleased to infor You that approved. We yalue ¥YOUr OG and we believe thie meet organization, YOUr request far g by minltment and IPpe ig wil contriby SS Meeting has bean 8 an employee of Slag Corporation, to the growth and Success of our Meeting Betaits: Date: Anrij 30, 2025 Tire: Gee Ph S37 pat Looution: P7684 Mary Avenue Apt O68, E AZ 18166"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "appletter",
        "ocr_text": "Sparks Ellis Ltd. Approval Letter Ronnie Tapia Department Head Fatsécca34 gmail com February 24, 2024 Benjamin Gates Operations Manager jerfsehjane gmail com Dear Dana Gilbert We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Pate Anril 30, 2025 Time: (5R¢ PM 9337 PM Location: 7754 Mary Avenue Apt. 066, East Jacob, AZ 13146"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "appletter",
        "ocr_text": "Sparks Ellis Ltd. Approval Letter Ronnie Tapia Department Head faisecca a4 @omail com February 24, 2924 Benjamin Gates Operations Manager jerfeenjane gmail com Pet Dana Gilbert to inform you that your reat inpul 2 e ig the gro your commitment employ Bi La a of our organization. Meeting Oetails: ianatvian: 7"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "appletter",
        "ocr_text": "Sparks Ellis Ltd. Approval Letter Ronnie Tapia Depariment Head FabaccaS4 @gmail com February 24, 2024 Beniamin Gates Operations Manager jerigehiane gmaii com Deal bana Gilbert We are pleased io inform you that your request for a business meeting has been approved, We value your commitment and input as an employee of Solas Corporation, and we belleve this meeting will contribute to the growth and success of our organization, Magting Details: Date: aon 30, 2025 Time: nastbinanw: TF"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "appletter",
        "ocr_text": "Sanders, Kaiser and Collins Inc. Approval Letter Anthony Espinoza Department Head raneblashiev gmail com March 28, 2025 Christina Fields Operations Managet iprown gmail com Seal Susan Miller hat your request for e business meeting has been and input as an employee of Solas Corporation, growth and success of our We are pleased to inform you U approved. We vaiue your commitment and we believe this meeting will contribute to the organization. Meeting Datalis: Date December 11, 2024 Time: 99 PM 53f PM >) oat eat zo Sane akes Johnghire, DE 50684"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "appletter",
        "ocr_text": "Sanders, Kaiser and Collins Inc. Approval Letter Anthony Espinoza Department Head rapeblashlev gmail com March 28, 2625 Christina Fields Operations Manager isprown gmail com Dea Susan Miller business meeting has thet your request fer Dus! nd input as an employee of Solas Ce the growth and success you We are pleased to inform approved. We value your commitrien will contribute to oaion, of sur and we believe this meeung organization. hooting Details: Date December 14 2024 Time: G89 PM Sigs PM py aOR BA"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "appletter",
        "ocr_text": "Sanders, Kaiser and Collins Inc. Approval Letter Anthony Espinoza Department Head réeaélashlev gmail com March 28, 2025 Christina Fields Operations Manager ber6wn gmail com Dear Susan Miller We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date December 11, 2024 Time: §570 PM 5 3] PM Location: 796 Robert Lakes. Johnshire. DE 50684"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "appletter",
        "ocr_text": "Sanders, Kaiser and Collins Inc. Approval Letter Anthony Espinoza Department Head réehélashlev gmail com March 28, 2025 Christina Fields Operations Manager br6wn gmail com Dear Susan Miller We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date December 11, 2024 Time: $58) PM 531 PM Location: 796 Robert Lakes, Johnshire, DE 50684"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "appletter",
        "ocr_text": "Sanders, Kaiser and Collins Inc. Approval Letter Anthony Espinoza Department Head réehiblashlev gmail com March 28, 2025 Christina Fields Operations Manager brown @gmail com °°? Susan Miller Ng will contribute to th organization, Meeting Details: Date De, Time: 8; Location: 7: ‘cember 11, 2024 PM 53) PM ‘96 Robert Lakes, Johnshire, DE 50684"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "appletter",
        "ocr_text": "Gates Lid Group Approval Letter Jeremy Casire Department Head c aahndradad grall com April 18, 2025 Joshua King Operations Manager noqéekimberly gmail com Dear Mrg, Susan r i g meeting has pb We are pleased to inform you thet your requeat for s approved. We value your commitment and input as an emp and we believe this mesting will contribute to the growth organization. Solas Corpora ecess Of our Meeting Details: Date Anril 16, 2025 Tiree! TaNEeM Gap PRA Noriit Henry"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "appletter",
        "ocr_text": "a Gates Ltd Group hi Approval Letter Jeremy Castro Department Head céassandra33 gmail com April 18, 2025 Joshua King Operations Manager mcgéekimberly gmail com Dear Mrs. Susan We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date: Anril 16, 2025 Time:! 24 8PM $345 PM Location: 9265 Jason Canyon Suite 068, North Henry, GU 12599"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "appletter",
        "ocr_text": "a Gates Ltd Group ii Approval Letter Jeremy Castro Department Head céssandra33 gmail com April 18, 2025 Joshua King Operations Manager megéekimberly gmail .com Dear Mrs. Susan est for a business meeting has been ee of Solas Corporation, s of our that your requ tment and input as an employ will contribute to the growth and succes: We are pleased to inform you approved. We value your comm and we believe this meeting organization. Meeting Details: Date: Anril 16, 2025 Times! G5PM 845 PM nn Gite O68, North Henry, GU 12599"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "appletter",
        "ocr_text": "Approval Letter Jeremy Castro Department Head c 8shndra33@ gmail com April 18, 2025 Joshua Kin Operations Manager megéekimberly gmail com Pear MB. Suen organization, Meeting Details: Date: Anri 16, 2025 Time! 2 48pyy &4P PM Location: 00265 Jason Canyon Suite 068, North Henry, GU 12599 soa STON Suite 068, No pe"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "appletter",
        "ocr_text": "a Gates Ltd Group hy Approval Letter Jeremy Castro Department Head céss ndra33 gmail com April 18, 2025 Joshua King Operations Manager mcgéekimberly gmail com Dear Mrs. Susan organization. Meeting Details: Date Anril 16, 2025 Time: 2 48PM -' 625 PM Location; 265 Jason Canyon Suite 068, North Henry, GU 12599 eS anyon Sulte 068, North Henry, Gt"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "appletter",
        "ocr_text": "Pena Morris \\nc. hs Approval Letter Edward West Department Head Eneitellev amail com February 16, 2024 Tammy Harris Operations Manager edward56 gmail com Dear Destiny Bailey your request for a business meeting has been input as an employee of Solas Corporation, ute to the growth and success of our ‘orm you that ur commitment and i 1 contrib We are pleased to inf approved. We value yo! and we believe this meeting wil organization. Meeting Details: Date February 07, 2025 Times! gy Or & 5 91 PM Ms Hiichestar, GU 44365"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "appletter",
        "ocr_text": "Pena Morris Inc. Approval Letter Edward West Department Head Entkellev amail com February 16, 2024 Tammy Harris Operations Manager edward56 gmail com Dear Destiny Bailey We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date February 07, 2025 Time:| ByOrM &Q1 PM Location: 3201 Oliver Points, Jillchester, GU 44365"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "appletter",
        "ocr_text": "Pena Morris Inc. Approval Letter Edward West Department Head Enetkellev amail com February 16, 2024 Tammy Harris Operations Manager edward56 gmail com DearDestiny Bailey We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date February 07, 2025 Times! By 0rm 69) PM lLaratian: 3201 Oliver Points .lilichecter GI] 4432RS"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "appletter",
        "ocr_text": "Pena Morris Inc. Approval Letter Edward West Department Head Setellav amail com i lary 16, 2024 fa mirny Harris ns Manager edwards 58 gmail com Dea Destiny Bailey We are pleas approve i to inform you t Your request for a be Gur commitment and inp an ernpic will contribute to the grow and organization, Meeting Details:"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "appletter",
        "ocr_text": "Pena Morris Inc. Approval Letter Edward West Department Head Enetitellev amail com February 16, 2024 Tammy Harris Operations Manager edward56 gmail com Dear Destiny Bailey has been ness meeting e of Solas Corporation, rm you that your request for a busi cess of our r commitment and input as an employe We are pleased to info eeting will contribute to the growth and suc! approved. We value you and we believe this m organization. Meeting Details: Date February 07, 2025 M sme 1 Gx }OPM 6 01 Pi Time Sy} x 1 diongainr Ge 4436"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "appletter",
        "ocr_text": "Wise Castillo and ckee Group Approval Letter Ruth Murphy Department Head *eeltvrvan qmail com October 31, 2023 James Mercado Operations Manager eble gmail com Dear Tammy Dixon We are Pleased to inform equest for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and Success of our organization, you that your r: Meeting Details: Date: Time: a8 eee 2024 Location: 08244 Jonathan Junction, West Laura, CA 47510 |"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "appletter",
        "ocr_text": "Wise, Castillo and Mckee Group Approval Letter Ruth Murphy Department Head Beallvrvan amail com October 31, 2022 James Mer Operations Manager Sebie amail com ch sed to inform you t your request Tor business meeting has been approved, We value your commitn and input as an ample of Solas Corporation, and we believe this meeting wii contribute to the growth and ir Meeting Details: Date Mav 16, 2024 Tima: $538 PM Z3B PM Looatlon: 08244 Jonatha"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "appletter",
        "ocr_text": "Wise, Castillo and Mckee Group Approval Letter Ruth Murphy Department Head Eeelivrvan amail com October 31, 2023 Jarmes Mercado Operations Manac eeble gmail com Seartammy Dixon for a business meeting has bean nm employee We are pleased to inform you thet your reavest approved. We value your commitment and input and we believe this meetin Solas Gorparation, of our G will contribute te the growth and succ organization. Meeting Details: Date: May 19, 2024 Time: Ppp PM Gp PM Leeation: APS."
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "appletter",
        "ocr_text": "Wise, Castillo and Mickee Group Approval Letter Ruth Murphy Department Hagd Rallvrvan amail com October 34, 20p3 vames Mercado Ns Manager 'meble gmail com 8 Tammy Dixon We are pleagac approved, and we believe 7 to inform you thet your Fequest Tor a business meeting waraiinent and input as an employee of Solas Corporation, ag wil contribute to ihe growth and SLC aS be a OFganization, S$ Of our Meeting Detaiis: Date: Maw 16, 2904 Thre: 9588 Pe 7 36 pag Location: 05244 Jonat"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "appletter",
        "ocr_text": "Wise, Castillo and Mckee Group Approval Letter Ruth Murphy Department Head Eealtvrvan qmail com October 31, 2023 James Mercado Operations Manager xeble gmail com Dea Tammy Dixon We are pleased to inform you that your request for a business meeting has been approved. We value your commitment and input as an employee of Solas Corporation, and we believe this meeting will contribute to the growth and success of our organization. Meeting Details: Date Mav 16, 2024 Time: $589 PM 733? PM L naatinw. 08244 Jonathan Junction. West Laura, CA 47510"
    }
]