[
    {
        "image": "approval1_synth_10_aug1.png",
        "label": "approval",
        "ocr_text": "Anthonyport institute Office of Practcum Affairs 070 Caster Qvenvass Suite 660, Karechaven, Oklahoena £5475 ANE POET INEZ eccrine oD APPROVAL SHEET Thes completion entitied cemTincaTe OF PRACTICNCOMMLENON prepared by Maurice B. Rie: sf partial tutfiiment of the requirements in Stxdent Teaching hes been examined and ifs recommended for acceptance and approval Hophins, Reyooids and Baker Regional Hub Superviver: Nechaat Saker, Site Coordinator Practicum Supervnor Accepted and approved in Parttat Fufilinent for the degrae of Bacheior ot Soence in Sociotogy ‘NS August 22, 2025 Clarissa L_ Moreno, Ed D. Director, intemship Programs Anthonyport Institute"
    },
    {
        "image": "approval1_synth_10_aug2.png",
        "label": "approval",
        "ocr_text": "Anthonyport tp 2 Of Pmeticum A nsitute is homa éea7e 8L Morena, Ea ry Director, intern Programs Anthonyport institute"
    },
    {
        "image": "approval1_synth_10_aug3.png",
        "label": "approval",
        "ocr_text": "Anthonyport Institute Office of Practicum Affairs 070 Carter Overpass Suite 660, Karenhaven, Oklahoma 45475 (254 788 0570 8820 coopercisneros org APPROVAL SHEET This completion entitled CERTIFICATE OF PRACTICUM COMPLETION prepared by Maurice B. Riley in partial fulfillment of the requirements in Student Teaching has been examined and it s recommended for acceptance and approval Hopkins, Reynolds and Baker Regional Hub ‘Supervisor: Michael Baker, Site Coordinator Practicum Supervisor Accepted and approved in Partial Fulfillment for the degree of _Bachelor of Science in Sociology this August 22, 2025 Clarissa L. Moreno, Ed D. Director, Internship Programs Anthonyport Institute"
    },
    {
        "image": "approval1_synth_10_aug4.png",
        "label": "approval",
        "ocr_text": "970 Canes APPROVAL SHEET Ontitled cenrmicate oF pacer the requirements in accepiame ay Supervisor WHat Fuliiment for the de 530 1. Moreno, qf Director, internship. Programs Anthonyport institute cMigurice \"Shas bean Prepared by"
    },
    {
        "image": "approval1_synth_10_aug5.png",
        "label": "approval",
        "ocr_text": "Anthonyport Institute Office of Practicum Affairs 070 Carter Overpass Suite 660, Karenhaven, Oklahoma 45475 (984 788 0570x8820 coopercsneros org APPROVAL SHEET This completion entitled CERTIFICATE OF PRACTICUM COMPLETION prepared by Maurice B. Riley in partial fulfillment of the requirements in Student Teaching has been ‘examined and it s recommended for acceptance and approval Hopkins, Reynolds and Baker Regional Hub ‘Supervisor: Michael Baker, Site Coordinator Practicum Supervisor ‘Accepted and approved in Partial Fulfillment for the degree of Bachelor of Science in Sociology this August 22, 2025 Clarissa L. Moreno, Ed D. Director, Internship Programs Anthonyport Institute"
    },
    {
        "image": "approval1_synth_1_aug1.png",
        "label": "approval",
        "ocr_text": "shin Prograrr 2 Melissa, Cakfomia 86154 118 comgdonmontes om APPROVAL SHEET an Plete d approval aed by Bonnie sion has Sean Anceph and approved in Patricia G. Salazar, Ph D. Dean, Collage of Arts Scinnces North Victorside College"
    },
    {
        "image": "approval1_synth_1_aug2.png",
        "label": "approval",
        "ocr_text": "Dean, College of Arts North Victorside College"
    },
    {
        "image": "approval1_synth_1_aug3.png",
        "label": "approval",
        "ocr_text": "North Victors Ce of Intemship hore, Lake Melis, ide College Offic Programs 59905 Diaz s} Patricia G. Salazar, Php Dean, College of arts Sciences North Victorside College"
    },
    {
        "image": "approval1_synth_1_aug4.png",
        "label": "approval",
        "ocr_text": "North Victor: ide Colisge ia 64154 RTIFIGATE OF PRACTICUM OD enioN prepared by Bonnie. q v has been of the reqy a Quens ine Supervisor Jamie Mes 1g Manager Acnepte this June 12, 2025 and approved in Partia Pairicia G. Salazar Pht). Dean, College of Aris Sciences: North Victorside Collage"
    },
    {
        "image": "approval1_synth_1_aug5.png",
        "label": "approval",
        "ocr_text": "North Victorside College ship Programs. California 64184, 59005 Diaz Shore, Lake Met by Bonnia. an hes been this Paincia G. Salazar, PhO Dean, College of Mis Sciences: North Victorside College"
    },
    {
        "image": "approval1_synth_2_aug1.png",
        "label": "approval",
        "ocr_text": "Etiottoury institute 71 ED ISTS f haley biz APPROVAL SHEET mt ef the esq proparad by a n has been Bach Eltiottbury Institute"
    },
    {
        "image": "approval1_synth_2_aug2.png",
        "label": "approval",
        "ocr_text": "LrsiOn has been ip Bartel Fuliilmert lor ti aricy ogres of Clarissa i. Mereno, Ed D."
    },
    {
        "image": "approval1_synth_2_aug3.png",
        "label": "approval",
        "ocr_text": "Motibury Insitute ts is are) ey DIZ at. Moreno, Ed D. n, Academic At Elliottbury Institute"
    },
    {
        "image": "approval1_synth_2_aug4.png",
        "label": "approval",
        "ocr_text": "Elliottbury Institute Center for Experiential Learning 7508 Terry Glens, Randallland, North Dakota 73963 +1 380 991 7579 haley biz APPROVAL SHEET This completion entitled ‘CERTIFICATE OF PRACTICUM COMPLETION Prepared by Todd P_ Kelley in partial fulfillment of the requirements i in Field Immersion has been ‘examined and its recommended for acceptance and approval ‘Butler, Black and Nichols Field Unt Supervisor: Alexander Chavez, Training Manager Practicum Supervisor Accepted and approved in Partial Fulfilment for the degree of Bachelor of Science in Accountancy er of Science in Ac this June 14, 2025 Clarissa L. Moreno, Ed D. Associate Dean, Academic Affairs Elliottbury Institute"
    },
    {
        "image": "approval1_synth_2_aug5.png",
        "label": "approval",
        "ocr_text": "Elliottbury Institute Center for Experiential Learning 'y Glens, Randallland, North Dakota 73963 +*1 380 991 7579 haley biz 7508 Ten APPROVAL SHEET This completion entitled CERTIFICATE OF PRACTICUM COMPLETION Prepared by Todd P_ Kelley in Partial fulfillment of the requirements in Field I Immersion has been ®xamined and its recommended for acceptance and approval Buter, Black and Nichols Field Unt Supervisor: Alexander Chaves, raining Manager Practicum Supervisor Accepted and aj 'PProved in Partial Fullilment for the degree of Bachelor or: {his June 14, 2025 Clarissa L. Moreno, Ed D. Associate Dean, Academic Affairs Elliottbury Institute"
    },
    {
        "image": "approval1_synth_3_aug1.png",
        "label": "approval",
        "ocr_text": "New Jose Institute Office of Practicum Affaits 535 Aten Islands, South Craighaven, Florida 92248 369 413 4497 002626 rley com APPROVAL SHEET Ine completion entitled ceenmcarc ueanacnaarcowenon prepared by Chatles. J Thomas sn parliat fuifiiment of the requirements in Student Teaching nas been ‘eramined and i s recemimended for acceptance and approval Canes Lic Regional Hub Supersisor Thoreve Garner, Training Managar Practicum Supervisor Accepted and approved in Partial Fultiimert for the degree of Bachelor of rience in Chemisty this may 26 2025 Emmanuot R. Oe! Rosato, MBA Associate Dean, Academic Affairs New Jose Institute"
    },
    {
        "image": "approval1_synth_3_aug2.png",
        "label": "approval",
        "ocr_text": "New Jose Institute eof Practicum Affairs S88 Alien Isianls, Sot Fiorida $2248 EQS TRADE 60 APPROVAL SHEE i tras completion eniiad O ATRESTE oF PRACTICA COMPLETION. Charles. Schemes partias fuitsiment of the reqaramants in Student Ls nas beer aqpeplence aul appre Gramines and #3 recerunendes Prackoum Supervsor -copied and approeed in Faniat yitntenent tor the cegrae of Mus May 26, 2028 Exner BC Reset, BA Associate Dea, Avatars Fite New Jose institute"
    },
    {
        "image": "approval1_synth_3_aug3.png",
        "label": "approval",
        "ocr_text": "New Jose Institute Office of Practicum Affairs 585 Allen Islands, South Craighaven, Florida 92248 369 413 4497x02526 iley com APPROVAL SHEET This completion entitled CERTIFICATE OF PRACTICUM COMPLETION prepared by Charles _ J. Thomas_ in partial fulfillment of the requirements in Student Teaching has been ‘examined and it s recommended for acceptance and approval. Davies LLC Regional Hub ‘Supervisor: Theresa Garn raining Manager Practicum Supervisor Accepted and approved in Partial Fulfillment for the degree of Bachelor of Science in Chemistry this May 26, 2025 Emmanuel R. Del Rosario, MBA Associate Dean, Academic Affairs New Jose Institute"
    },
    {
        "image": "approval1_synth_3_aug4.png",
        "label": "approval",
        "ocr_text": "New Jose institite Oifice of Prackoum Affairs 585 Allen Isiands, South Craighaven, Flovida 97248 AB AA97 892526 ley non APPROVAL SHEE ‘This completion ontitied veene J. Thomas in parisi tuitaiment Knined and i s recommended fer acces OF PRACT coMPLET eparedhy Charles. Teaching has phunce and approver Davies LLG Regional Hut: Supervisor: Theresa Gamer, Tra Practicum Supe: Accepted and approved in this May 26, 2028 teal Path wior of moni for the dagrae of Be ual R, Del Rus: Associate Dean, Acadstnic New Jose institute"
    },
    {
        "image": "approval1_synth_3_aug5.png",
        "label": "approval",
        "ocr_text": "New Jose Institute Office of Practicum Aff islands, South Graghaven, Para 32248, BSB A1D MAGI REZ BAG Alter APPROVAL SHEET ompietion entied cervincaTe oremacncmcommenon pmyaredby Charles. J. Thomas im parial fulillment of the requirements in Stalent Teaching nay boen gxamminad and it s recommended for esceplance and sapreval Practicum Supersor ulitarend fot the dagres of Bach Asnopted and approved in Pi MS hay 28, 2028 Emmanuel R, Del Rosato, MEA New Jose institute ociata Dean, Academic Alfaws"
    },
    {
        "image": "approval1_synth_4_aug1.png",
        "label": "approval",
        "ocr_text": "West wetuaretchesier Institute Practicum Affai Office of 261 Elzabeth Pass, East La, Nov Carina 7806 *9 681 766 4906143487 gomez com APPROVAL SHEET This completion entitied cernincaTe oF pracncus courenon Prepared by Kimberly Barker in paral tatiiment ot te requromeris in Field Imemoreion eee ‘examined and its recommended for acceptance and approval Blackbum and Sons Regional Hub ‘Supervisor: Mark Rivas, Training Practicum Supervisor Accepted and approved in Partial Fulfilment for the degree of Bachelor of Science in Chemistry this September 14, 2025 Patricia G. Salazar, Ph D. Director, Internship Programs West Margaretchester Institute"
    },
    {
        "image": "approval1_synth_4_aug2.png",
        "label": "approval",
        "ocr_text": "West Margaretchester Institute Office of Practicum Affairs 261 Elizabeth Pass, East Lisa, North Carolina 76565 +#1 681 766 4906x43497 gomez com APPROVAL SHEET This completion entitled CERTIFICATE OF PRACTICUM COMPLETION prepared by Kimberly C. Barker_ in partial fulfillment of the requirements in Field Immersion has been examined and i s recommended for acceptance and approval Blackburn and Sons Regional Hub Supervisor: Mark Rivas, Training Manager Practicum Supervisor Accepted and approved in Partial Fulfillment for the degree of Bachelor of Science in Chemistry this September 14, 2025 Patricia G. Salazar, Ph D. Director, Internship Programs West Margaretchester Institute"
    },
    {
        "image": "approval1_synth_4_aug3.png",
        "label": "approval",
        "ocr_text": "Wast Margsretchester Insutule cum Adtalts North Carolina 76508 261 il gemma cen Harbeity rsion has been C. Barker in partiat fuitvtmert of and i s recommended fer anceptante and approval pene egional Hub s Manga Blackbur and Sons um Supervisor Accented and approved in Partial Puitdiment for the degrea of Us September 14, 2028 ar, PED Painoia GS: Director, imemshie Programs West Margareichester institute"
    },
    {
        "image": "approval1_synth_4_aug4.png",
        "label": "approval",
        "ocr_text": "West Margaretchester Institute 261 Elizabet Office of Practicum Affairs th Pass, East Lisa, North Carolina 76565 +1 681 766 4986443497 gomez com APPROVAL SHEET This completion entitled cerriricare oF C. Barker 'n partial fulfillment of the req examined and it s recommended for acceptanc PRACTICUM COMPLETION prepared by -Kimberly ‘Guirements in Field Immersion has been and approval Blackburn and Sons Regional Hub Supervisor: Mark Rivas, Training Manager Practicum Supervisor this September 14, 2025 Patricia G. Salazar, Ph D. Director, Internshi ip Programs West Margaretchester Institute"
    },
    {
        "image": "approval1_synth_4_aug5.png",
        "label": "approval",
        "ocr_text": "West Margaretchester Institute Office of Prachcum Affairs 261 Elizabeth Pass, East Lisa, North Carotna 76565 114881. 768 4926K HOT gomses comm APPROVAL SHEET Theccompistion entitled ceRnacaTe of PRAcnoarcmmenicN propared by Kimberly, GC. Barker in parties futttiment of the requrements in Field Immersion has been ‘camined and ifs recommanded for acceplance and approvat Blackbur and Sons Ragone! Hub Supervisor, Mack Rivas, Training Hanager Practicum Superesor Accopted and approved n Partial Fusitiment for the degree of _Sachotor of Sctonce ix Chemisty IS September 14, 2025 Patricia G. Seiazar, Ph D. Director, Intemship Programs West Margaretchester Institute"
    },
    {
        "image": "approval1_synth_5_aug1.png",
        "label": "approval",
        "ocr_text": "‘sity Jameston Unie prapared by ales inaMersion 1 resuurer lance and appr Gd and approved his July 21, 2025 Emmanuel R hairparson, Prac Jameston University"
    },
    {
        "image": "approval1_synth_5_aug2.png",
        "label": "approval",
        "ocr_text": "Jameston University Office of Internship Programs 247 Alvarado Throughway Castillobury, Arizona 07762 1620 271 6993x296 hayden aWvarez com APPROVAL SHEE T ‘This completion entitled cERTFICATE OF practioumcomeLeTion prepared Dy Tracy Q. Lopez in partial fulfillment of the requirements in Field Immersion has been for acceptance and approval Gxamined and its recommended Practicum Supervisor ‘Accepted and approved in Partial Fulfilment for the degree of Bachelor of Science in Finance this July 21, 2025 Emmanuel R. Del Rosario, MBA Chairperson, Practicum Committee Jameston University"
    },
    {
        "image": "approval1_synth_5_aug3.png",
        "label": "approval",
        "ocr_text": "brceplad and ai Dal Rosario, MBA Chai um Committee Jameston University"
    },
    {
        "image": "approval1_synth_5_aug4.png",
        "label": "approval",
        "ocr_text": "Jameston University Office of Intemship Programs 247 Alvarado Throughway, Castillobury, Arizona 07762 1620 271 6983 296 hayden alvarez com APPROVAL SHEET cneumcoweuenion prepared by Tracy Q. This completion entitled CERTIFICATE OF PRA has been Lopez in partial fulfilment of the requirements in Field Immersion ‘examined and it s recommended for acceptance and approval. ‘Ross Frederick Regional Hub Supervisor: Carla Guerrero, Practicum Supervisor Practicum Supervisor ‘Accepted and approved in Partial Fulfillment for the degree of Bachelor of Science in Finance this July 21, 2025 Emmanuel R. Del Rosario, MBA Chairperson, Practicum Committee Jameston University"
    },
    {
        "image": "approval1_synth_5_aug5.png",
        "label": "approval",
        "ocr_text": "Offic 247 Alvaraci pareve i mperson, Practicum Commitee Jameston University"
    },
    {
        "image": "approval1_synth_6_aug1.png",
        "label": "approval",
        "ocr_text": "Weilsborough Cotiege Office of Prac Affairs ‘Shore, Joshuaton Kentucky 9 oy ne NCATE UF HRACT COA COL prepared ov Richard ements an !semship Program as been, 2 Octobe Alicia M, Santos, Ph D. Dean, Weallsborough College “attege of Arts Sciences"
    },
    {
        "image": "approval1_synth_6_aug2.png",
        "label": "approval",
        "ocr_text": "Wellsborough College Office of Practicum Affairs 1421 Carpenter Shore, Joshuaton, Kentucky 09475 1452 596 8563x456 contreras roy info APPROVAL SHEET This completion entitled CERTIFICATE OF PRACTICUM COMPLETION prepared by Richard K. Brown _ in partial fulfillment of the requirements in Intemship Program has been examined and it s recommended for acceptance and approval. Kemp and Sons Regional Hub ‘Supervisor: Dominic Nguyen, Site Coordinator Practicum Supervisor Accepted and approved in Partial Fulfillment for the degree of Bachelor of Science in Anthropology this October 07, 2025 Alicia M. Santos, Ph D. Dean, College of Arts Sciences Wellsborough College"
    },
    {
        "image": "approval1_synth_6_aug3.png",
        "label": "approval",
        "ocr_text": "‘examined and Wellsborough College Practicum Affai Office of irs 1421 Carpenter Shore, Joshuaton, Kentucky 09475 452 596 8561456 contreras r0y info by Richard i Partial fulfillment of the requirements in Intemship Program has been its recommended for acceptance and approval Alicia M. Santos, Ph D. Dean, College of Arts Sciences Wellsborough College"
    },
    {
        "image": "approval1_synth_6_aug4.png",
        "label": "approval",
        "ocr_text": "Wellsborough College Office of Practicum Affairs rpenter Shore, Joshuaton, Kentucky 09475 452 596 85631456 contreras ry info 1421 Ca APPROVAL SHEET Kemp and Sons Regional Hub Supervisor: Dominic Nguyen, Site Coordinator Practicum Supervisor Accepted and ay Proved in Partial Futtilment for the degree of Bachelor of Science epctony rr this October 07, 2025 Alicia M. Santos, Ph D. Dean, College of Arts Sciences Wellsborough College"
    },
    {
        "image": "approval1_synth_6_aug5.png",
        "label": "approval",
        "ocr_text": "Wellsborough College Office of Practicum Affairs 1421 Carpenter Shore, Joshuaton, Kentucky 09475 452 596 8563x456 contreras roy info APPROVAL SHEET This completion entitled CERTIFICATE oF PRACTICUMCOMPLETION prepared by Richard. K. Brown _ in partial fulfillment of the requirements in !ntemship Program has been ‘examined and it s recommended for acceptance and approval Kemp and Sons Regional Hub ‘Supervisor: Dominic Nguyen, Site Coordinator Practicum Supervisor Accepted and approved in Partial Fulfillment for the degree of Bachelor of Science in Anthropology this October 07, 2025 Alicia M. Santos, Ph D. Dean, College of Arts Sciences Wellsborough College"
    },
    {
        "image": "approval1_synth_7_aug1.png",
        "label": "approval",
        "ocr_text": "borough University of iatemsiva P, pletion er Bern patist fy at sonics Jonas P. vill Director, inter Flemin erough University"
    },
    {
        "image": "approval1_synth_7_aug2.png",
        "label": "approval",
        "ocr_text": "Fisraingborough University Office of int 5 Suerte: 6 coated and approved in 188 Septerntme 29, 2095 nen for the degree of _& Eoonomves Jonas P Villanueva, MA. B vector, Interiship Programs Flemingborough University"
    },
    {
        "image": "approval1_synth_7_aug3.png",
        "label": "approval",
        "ocr_text": "Flemingborough University Office of Internship Programs 74688 Katrina Fords Apt. 973, Sarahstad, North Carolina 71140 7038512223 perry com APPROVAL SHEET This completion entitled cerTiFICATE oF PRACTICUM COMPLETION prepared by Stacy S_ Burns in partial fulfillment of the requirements in Practicum Training has been examined and it s recommended for acceptance and approval. ‘King, Russo and Perez Field Unit ‘Supervisor: Catherine Gomez, Practicum Supervisor Practicum Supervisor Accepted and approved in Partial Fulfillment for the degree of Bachelor of Science in Economics this September 23, 2025 Jonas P. Villanueva, M A. Director, Internship Programs Flemingborough University"
    },
    {
        "image": "approval1_synth_7_aug4.png",
        "label": "approval",
        "ocr_text": "Flemingborough University Office of Internship Programs 74688 Katrina Fords Apt 973 Sarahstad North Caroling 71140 7038512223 perry com APPROVAL SHEET The completion entitied cern Burns N partial fultllment ums__ examined and #5 FICATE OF PRACTICUAN COMPLETION Prepared by Stacy S t of the requirements in Practicum Training has been recommended for acceptance and approval ing, Russo and Perez Super Frets Une WeO Caterne Gomez, Practeum Supervacr Practicum Supervisor Accepted and approved in Paral F tli ment for September 23. 2025 the degree of Bacheior of Scence m Economics the Jonas P Villanueva. MA Director, Internship Programs Flemingborough University"
    },
    {
        "image": "approval1_synth_7_aug5.png",
        "label": "approval",
        "ocr_text": "Fi temingborough University ip Pragratas Moath Cemiina 71 nentiied cerns sea by Sissy S. ant of tha sequrements in Practicure Training has been conenies wucve, WAL Jones Oiractor, intermship Programs Flemingborough University"
    },
    {
        "image": "approval1_synth_8_aug1.png",
        "label": "approval",
        "ocr_text": "Thomasmouth College Office of Internship Programs 323 Rachel Views, Hollandbury, North Dakota 02170 (237 903 2823 sullivan nelson net APPROVAL SHEET This completion entitled ceRniricate oF PRACTICUMCOMPLETION prepared by Kelly H Freeman _ in partial fulfillment of the requirements in !ntemship Program has been examined and i s recommended for acceptance and approval West and Sons Main Office Supervisor: Laura Miller, Site Coordinator Practicum Supervisor Accepted and approved in Partial Fulfillment for the degree of _8achelor of Science in Marketing this June 01, 2025 Alicia M. Santos, Ph D. Dean, College of Arts Sciences Thomasmouth College"
    },
    {
        "image": "approval1_synth_8_aug2.png",
        "label": "approval",
        "ocr_text": "Thomasmouth College Office of Intemship Programs 323 Rachel Views, Hollandbury, North Dakota 02170 (237 903 2623 sulivan nelson net APPROVAL SHEET in partial fulfillment of the require: examined and its recommended for acceptance West and Sons Main office ‘Supervisor: Laura Miller, Site Coordinator a orrcinaton Practicum Supervisor Accepted and approved in Partial Fulfillment for the degree of Bachelor of Science in Marketing this June 01, 2025 Alicia M. Santos, Ph D. Dean, College of Arts Sciences Thomasmouth College"
    },
    {
        "image": "approval1_synth_8_aug3.png",
        "label": "approval",
        "ocr_text": "Thomasmouth College Office of Intemstip Programs 4323 Rachel Views, Hokandbury, Nox Dawota 12170 (Q77OR2873 suilivan nelson net APPROVAL SHEET ron prepared by Kolly Hh anttied CERTACATE OF PRACTICUM COMME! Intemship Progas™ has bean raiment of the requirements i captance and ayoraval. This completion Freeman in partiat ‘Sxamined and t s recommended foF a West and Sons Main OFe ‘Supervisor. wiler, Site Coordinator Accopted ard approved in Paria! Futiient tor the degree of _ Bachelor of Seioney in ManeND this june 01, 2025 Alicia M. Santos, Pn D. Dean, College of Arts Sciences Thomasmouth College"
    },
    {
        "image": "approval1_synth_8_aug4.png",
        "label": "approval",
        "ocr_text": "Thomasmouth College Office of Intemship Programs 323 Rachel Views, Hollandbury, North Dakota 02170 (237 903 2823 sullivan nelson net APPROVAL SHEET This completion entitled ceRTiFicaTE OF PRACTICUM COMPLETION prepared by Kelly H Freeman _ in partial futfllment of the requirements in Intemship Program has been examined and it s recommended for acceptance and approval West and Sons Main Office Supervisor: Laura Miller, Site Coordinator =a Mier, Site Coordinator Practicum Supervisor Accepted and approved in Partial Fulfillment for the degree of _Bachelor of Science in Marketing this June 01, 2025 Alicia M. Santos, Ph D. Dean, College of Arts Sciences Thomasmouth College"
    },
    {
        "image": "approval1_synth_8_aug5.png",
        "label": "approval",
        "ocr_text": "Yhomasmouth Cotlece Office of Iniernship Programs s Hotandbury, forth Bateota 02470 .siver nelson ost 923 Rachel View: orecacrianscomuenon prepared BS stoensiy Yen cernplotion entities cRRTH Exeqman _ on patial (ut! Gaaminad and W s resommendad for a= cements in aiment of the recy vet Practicum Supewser accopied and epprowed in Partial Ful this une 64, 2028 Alicia M. Santns, Ph. pean, Covlege of Arts Sciences Thomasmouth College"
    },
    {
        "image": "approval1_synth_9_aug1.png",
        "label": "approval",
        "ocr_text": "South Amy College 5, i 4764 bailey com APPROVAL SHEET P. Villanuev of Arts South Amy College"
    },
    {
        "image": "approval1_synth_9_aug2.png",
        "label": "approval",
        "ocr_text": "South Amy College Office of Intemship Programs ga vans nds Sut TOK, Catt MON miasour 64432 5087684764 bailey com APPROVAL SHEE T enon prepared by Brandon led cERTINCATE OF PRACTION COMP ‘of the requirements in Student Teaching has been .e and approval This completion entitle P. Lewis _ in partial fulfillment Scamined and ifs recommended for acceptanc' ,on Main Office Quetrisor Gabriel Hall, Training Meneget Practicum Supervisor oree of Bachelor ot science in Biology ‘Accepted and approved in Partial Fulfillment for the de this May 11, 2025 Jonas P. Villanueva, M A Dean, College of Arts Sciences South Amy College"
    },
    {
        "image": "approval1_synth_9_aug3.png",
        "label": "approval",
        "ocr_text": "South Amy College fice of intemshie Programs ‘$2 Matin fants Sate 736, Ese Sovéqucetiaie, Minsoud Be S08768a764 j bailey. com APPROVAL SHEET ed DY Brandon Parlist ft dem Teaching hay peen i recomme: DwanDedeon Supervise Accepied ang sopreved in Fastin {2 Maya of Aris Sciences South Amy College"
    },
    {
        "image": "approval1_synth_9_aug4.png",
        "label": "approval",
        "ocr_text": "South Amy College Office of Intemship Programs 402 Katherine Islands Sute 794, East Moniquechester, Missouri 64432 5087684764 bailey com APPROVAL SHEET This completion entitled cernicaTe oF pRacricum courte P. Lewis iN partial fulfillment of the requirements in examined and its recommended for acceptance and approval 'oN prepared by Brandon Student Teaching has been Duran Dodson Main Office Supervisor: Gabriel Hall, ing Manager Practicum Supervisor Accepted and approved in Partial Fulfillment for the degree of Bachelor of Science in Biology meer of Science in Bio this May 11, 2025 Jonas P. Villanueva, M A Dean, College of Arts Sciences South Amy College"
    },
    {
        "image": "approval1_synth_9_aug5.png",
        "label": "approval",
        "ocr_text": "P Vil ge of Arts Scier Bean South Amy College"
    },
    {
        "image": "approval2_synth_11_aug1.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines South Tony College College of Business and Accountancy West Lawrence, CA I CERTIFICATION This is to certify that Felicia Blankenship has satisfactorily completed the oral defense for the thesis titled “Role those property gun new break strategy push” in partial fulfillment of the requirements for the Master of Education program. Sue Woods, Ph D Adviser APPROVAL SHEET Approved by the Thesis Committee on May 04, 2025 after due deliberation of results. Russell Lindsey, Member Rachel Wong, Panel Chair Panelist Panelist Accepted and endorsed for final revision by the College on October 26, 2025. Rhonda Maxwell, College Dean College Dean"
    },
    {
        "image": "approval2_synth_11_aug2.png",
        "label": "approval",
        "ocr_text": "Aepubiic of the Phtippines South Tony College College of Business and Accountancy West Lawrence, CA CERTIFICATION This is to certify that Felicia Blankenship has satisfactorily completed the oral defense for the thesis titled “Role those property gun new break strategy push” in partial fulfillment of the requirements for the Master of Education program. Sue Woods, Ph D. Adviser APPROVAL SHEET Approved by the Thests Committee on May 04, 2026 after due detiberation of resutts, acne! wong, Pane! Chalr usseli Lindsey, Member Panelist Panekst Accepted and ondorsed for final revision by the College on October 26, Rhonda Maxwell, College Dean Coltege Dean"
    },
    {
        "image": "approval2_synth_11_aug3.png",
        "label": "approval",
        "ocr_text": "This is to certify that Felicia Blankenship has satisfactorily completed the oral defense for the thesis titled “Roie those property gun new break strategy push” In partial fulfillment of the requirements for the Master of Education program. i@ Woods, Ph 6. Actviser ue daliberation of vanel Chair Accepied ani endorsed for final revisi 2025."
    },
    {
        "image": "approval2_synth_11_aug4.png",
        "label": "approval",
        "ocr_text": "fapublic of the South Tony College College of Busin CERTIFICATION uMeNey nat Felicia Blankenship has satisfactorily completed the oral defense for the thesis titted “Role those property gun new break in partial fulfliment of the strategy push” requirements for the Masier of Education p This ig to certify ty Approved by col"
    },
    {
        "image": "approval2_synth_11_aug5.png",
        "label": "approval",
        "ocr_text": "Repnbitc of te Prilyppea ns South Tony College College of Business and Accountancy West Lewomes CA, a nen rane eee ene CERTIFICATION a ae This is to certify that Felicia Blankenship has Satisfactorily completed the oral defense for the thesis titled “Role those Property gun new break strategy push’ in partial fulfillment of the requirements for the Master of Education program. ‘Sue Woods, PhD. Adviser a re APPROVAL SHEET Approved by the Thesis Committes on May 64, 2625 after due deliberation of results Rachei Wong, Pane! Chair Russell Lindsey, Member Panett Penaee! Accepted and endorsed for final revision by the Collage on October 26, 2025, Rhonda Maxweli, College Dean Coftege Cean"
    },
    {
        "image": "approval2_synth_12_aug1.png",
        "label": "approval",
        "ocr_text": "public of the Phdippaes. West Raymonedfurt University College of Business and coouMancy Ri MN SERTIFICATION This is to certify that Nicholas Wilson has satisfactorily completed the oral defense for the thesis tied “Traditional fast system between build wesierm thus current his away\" in partial fulffiment of the requirements for the Bachelor of Arts program. Rebecca Shelton, Ed D. Adviser SHEET mn Octobs 2025 alter due deliberation Paul Hughes, Panel Gnair Panett Accepted anda 2025. ithe C"
    },
    {
        "image": "approval2_synth_12_aug2.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines West Raymondfurt University College of Business and Accountancy Russelifort, MN CERTIFICATION This is to certify that Nicholas Wilson has satisfactorily completed the oral defense for the thesis titled “Traditional fast system between build western thus current his away” in partial fulfillment of the requirements for the Bachelor of Arts program. Rebecca Shelton, Ed D. Adviser APPROVAL SHEET Approved by the Thesis Committee on October 09, 2025 after due deliberation of results. Paul Hughes, Panel Chair Robert Mcgee, Member Panelist Panelist Accepted and endorsed for final revision by the College on October 26, 2025. William Frazier, College Dean College Dean"
    },
    {
        "image": "approval2_synth_12_aug3.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines West Raymondfurt University College of Business and Accountancy Russelifort, MN. CERTIFICATION This is to certify that Nicholas Wilson has Satisfactorily completed the oral defense for the thesis titled “Traditional fast system between build western thus current his away” in partial fulfillment of the requirements for the Bachelor of Arts program. Rebecca Shelton, Ed D. Adviser ee APPROVAL SHEET Approved by the Thesis Committee on October 09, 2025 after due deliberation of results. Paul Hughes, Panel Chair Robert Mcgee, Member Panelist Panelist Accepted and endorsed for final revision by the College on October 26, 2025. William Frazier, College Dean College Dean"
    },
    {
        "image": "approval2_synth_12_aug4.png",
        "label": "approval",
        "ocr_text": "Aepublic of the Pailiygaes West Raymoncfurt University Business and Accountaney CERTIFICATION This is to certify that Nicholas Wilson has satisfactorily completed the oral defense for the ig titted “Traditional fast systers between build western thus current his away” in partial fulfliment of or of Arts program. seca Shaiton, EdD. y the Thesis Commitiee o1 Jober 0G, 2025 after due deliberation: Catiege Daan"
    },
    {
        "image": "approval2_synth_12_aug5.png",
        "label": "approval",
        "ocr_text": "Repablic af the Phikpganes: West Raymondfurt University Coltege of Business and Accountancy ort Rte CERTIFIG ATION This is fo certily that Nicholas Wilson has satigiactorily completed the oral defense for the thesis tiled “Traditional fast system between build western thus current his away” in partial fulfillment of the requirements for the Bachelor of Arts program. Rebeca Shwtton, £4. Advisar APPHOYAL BSNEET Approved by the Thesis Cormi of tes after due deliberation Panet Chair Robert ogee. Member"
    },
    {
        "image": "approval2_synth_13_aug1.png",
        "label": "approval",
        "ocr_text": "Hepubic of the Phidippines North Briar: Coileg: Aris and Se! This is to certify that Jason Martinez has satisfacior npleted the ora! defense for the inesis tiled “BH cut anything draw already must hope local” in partial fulfillment of the requirements for the Master of Science program. 2 Jum deliberation oi Stephanie Munay, Pant and endorsed {"
    },
    {
        "image": "approval2_synth_13_aug2.png",
        "label": "approval",
        "ocr_text": "Republic Of the Philippines North Brian College College of Arts and Sciences ‘South Nancy, GA CERTIFICATION hope local” in pa tial fulfillment of the requirements for the Master of Science Program. Richard Pope, M A Adviser a APPROVAL SHEET Approved by the Thesis, Committee on June 21, 2025 after due deliberation of results. ‘Stephanie Murr fay, Panel Chair Shane Perez, Member Panelist Panelist Accepted and endorsed for final fevision by the College on October 26, 2025. James Mueller, College Dean College Dean"
    },
    {
        "image": "approval2_synth_13_aug3.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines North Brian College College of Arts and Sciences ‘South Nancy, GA CERTIFICATION This is to certify that Jason Martinez has satisfactorily completed the oral defense for the thesis titled “Bit cut anything draw already must hope local” in partial fulfillment of the requirements for the Master of Science program. Richard Pope, M A. Adviser APPROVAL SHEET Approved by the Thesis Committee on June 21, 2025 after due deliberation of results. Shane Perez, Member Stephanie Murray, Panel Chair Pi Panolist anelist ‘Accepted and endorsed for final revision by the College on October 26, 2025 James Mueller, College Dean College Dean"
    },
    {
        "image": "approval2_synth_13_aug4.png",
        "label": "approval",
        "ocr_text": "Regubritc of the Phibippine: North Brian College College of Arts and Sciences Seuith Nancy, GA ee ee GEARTIFIGATION his is to certify that Jason Martinez hes satisfactorily completed the oral defense for the thesis titled “Bit cut anything draw already must hope loca!” in partial fulfillment of the requirements for the Master of Science program. Richard Pope, MA. Adviser i APPROVAL SHEET fier due deliberation of Approved by the Thesis Commitee on June 21, 2025 a! resuills. shane Perez, Member Siephanie Murtay, Panel Chair Paneist Paratet Accepted and eriorsed tor fina! revision by the College on October 26, 2025. James Mueller, Cottege Dean College Dean"
    },
    {
        "image": "approval2_synth_13_aug5.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines North Brian College College of Arts and Sciences South Nancy, GA CERTIFICATION This is to certify that Jason Martinez has satisfactorily completed the oral defense for the thesis titled “Bit cut anything draw already must hope local” in partial fulfillment of the requirements for the Master of Science program. Richard Pope, MA. Adviser ee APPROVAL SHEET Approved by the Thesis Committee on June 21, 2025 after due deliberation of results. ‘Stephanie Murray, Panel Chair shane Perez. Member Panelist Panelist accepted and endorsed fr final revision by the College on October 29, 2025. James Mueller, College Dean College Dean"
    },
    {
        "image": "approval2_synth_14_aug1.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines South Kimberly Institute College of Arts and Sciences Michelleshire, MA CERTIFICATION This is to certify that Antonio Baker has Satisfactorily completed the oral defense for the thesis titled “Remain seek finish onto they south Care show bill” in partial fulfillment of the requirements for the Master of Science program. Vanessa Knight, M A Adviser ee APPROVAL SHEET Approved by the Thesis Committee on Juni 1e 06, 2025 after due deliberation of results. Brian Thompson, Panel Chair Stephanie Johnson, Member Panelist Panelist Accepted and endorsed for final revision by the College on October 26, 2025. Robert Green, College Dean College Dean"
    },
    {
        "image": "approval2_synth_14_aug2.png",
        "label": "approval",
        "ocr_text": "epablic of the PhilppInES South Kimberly Ine College of Arts Sciences wichelieshire, MA CERTIFICATION that Antonio Baker has satisfactorily completed the oral defense for the in seek finish onto they south thesis titled “Remail in partial fulfillment of the for the Master of Science program. requirements Vanessa Knight, MA Adviser appROVAL SHEET Committee on June 06, 2025 after due deliberation of Approved by the Thesis rian Thompson, Panel Chale stephanie Johnson, Member Panetst Panelist vena snesresrsrvsenyecanm nN 2025. Robert Green, College Dean College Dean"
    },
    {
        "image": "approval2_synth_14_aug3.png",
        "label": "approval",
        "ocr_text": "South Kimberly CEN TIFICaTION This is to certify that Antonio Baker has satisfactorily completed the orai defense for the thesis titled “Remain seek finish onto they south care show bill\" In partial fulfillment of the requirements for the Master of Science program. cosa Kivght, MA the Th after due det on, Member Panel Chat ver 20. on ¢"
    },
    {
        "image": "approval2_synth_14_aug4.png",
        "label": "approval",
        "ocr_text": "patie et the vans South Kimberly ingtitute Colt of Arts and Seiances nio Baker Nas This is 10 certiy that Aric’ satisfactorily compleied the or thesis titted “Remain seek fi care show nin” in partial ful requirements for the Master yy onto they south Atiment of The f Science program. Approved by te Thess eesults Colles a and endoised for tinal es8S 9P hy the"
    },
    {
        "image": "approval2_synth_14_aug5.png",
        "label": "approval",
        "ocr_text": "Care show bill” in Parti fequiremenis for the Bran Accepted 2025 This is to certify that An Repoulee of the Paden me South Kimberly institute College of Aris and Sciences Wienamertare. me CERTIFICATION tonio Baker has al fulfillment of the Master of Science Program, Vanessa Knight, MA Advice: Thompscn, Panet Chay Stephanie Johnson, Member Prretist Pacwter aK endorsed for fnat Fewision by the Cotlege on October 26, Robert Green, College Dean College Dean"
    },
    {
        "image": "approval2_synth_15_aug1.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines South Danielle Institute College of Education Graybury, PA CERTIFICATION This is to certify that Joshua Murphy has satisfactorily completed the oral defense for the thesis titled “Baby key treat design range friend hundred space pull” in partial fulfillment of the requirements for the Master of Education program. Justin Robinson, Ph D. Adviser APPROVAL SHEET Approved by the Thesis Committee on June 02, 2025 after due deliberation of results. Abigail Delacruz, Panel Chair Carmen Weiss, Member Panelist Panelist Accepted and endorsed for final revision by the College on October 26, 2025. Christopher Davis, College Dean College Dean"
    },
    {
        "image": "approval2_synth_15_aug2.png",
        "label": "approval",
        "ocr_text": "Republic of the Phil South Danielle Institute College of Education CERTIFICATION This is to certify thet Joshua Murphy has satistactor y completed the oral defense for the thesis titled “Baby key treat design range friend hundred apace pull” in parhal fulfillment of the requirements for the Master of Education program. APPROVAL SHEET 02, 2026 after due deliberation of Approved by the Thesis Cammittas or Jur pbigad z. Pane’ Chait ptad and endorsed for final revision by the je Dean"
    },
    {
        "image": "approval2_synth_15_aug3.png",
        "label": "approval",
        "ocr_text": "Bombe of tin Potions South Danielle institute College of Education CERTIFICATION This is to certify that Joshua Murphy has satisfactorily completed the oral Gefense for the thesis titled “Baby key treat design fange friend hundred space pull” in partial fulfiiment of the requirements for the Master of Education program. b Robinsee, PhD. Advisar APPROVAL SHEET Approved by the Thesis Commit mm dune OF ster due deliberation of Abigail Deiactuz, Pane! Chae Panetet"
    },
    {
        "image": "approval2_synth_15_aug4.png",
        "label": "approval",
        "ocr_text": "Republic of the Phikppines South Danielle Institute College of Education Graybury, PA CERTIFICATION This is to certify that Joshua Murphy has satisfactorily completed the oral defense for the thesis titled “Baby key treat design range friend hundred space pull” in partial fulfillment of the requirements for the Master of Education program. Justin Robinson, Ph D. Adviser APPROVAL SHEET Approved by the Thesis Committee on June 02, 2025 after due deliberation of results. Abigail Delacruz, Panel Chair Carmen Weiss, Member Panelist Accepted and endorsed for final revision by the College on October 26, 2025, Christopher Davis, College Dean College Dean"
    },
    {
        "image": "approval2_synth_15_aug5.png",
        "label": "approval",
        "ocr_text": "RYIPICATION This is to certify that Joshua Mur satisfactorily comple thesis titled phy has d the oral defense for ‘Baby key treat design range friend hundred space pull” in partial fulfillment of the requirements for the Master of Education program dustin Robi APPROVAL SHEET is Commi a0 June 02, 2 fawn oF Abigall Membe st lege on Getober oltege Bean"
    },
    {
        "image": "approval2_synth_16_aug1.png",
        "label": "approval",
        "ocr_text": "apa ofthe Phippénes Jefferyview College RViFIC ATION This ig to certify that Michael Rivers has satistactorlly completed the oral defense for the thesis titled “Sense section usually between gun month always until where” in partial fulfilment of the requiremenis for the Master of Arts program Anthony Torer, PaO) APPAGY AL SHEET Approved by the Thes af rosults fier due detibor depaiter J"
    },
    {
        "image": "approval2_synth_16_aug2.png",
        "label": "approval",
        "ocr_text": "Republic of the! Philippines Jefferyview College College of Education Hudsonmouth, NM CERTIFICATION This is to certify that Michael Rivers has satisfactorily completed the oral defense for the thesis titled “Sense section usually between gun month always until where” in partial fulfill ment of the requirements for the Master of Arts program. ‘Anthony Turner, Ph D. Adviser appROVAL SHEET Approved by the Thesis Committee on August 05, 2025 after due deliberation of results. Jennifer Jimenez, Member Tom Ward, Panel Chair Panelist Panelist Accepted and endorsed for final revision by the College on October 26, 2025. Thomas Lewis, College Dean College Dean"
    },
    {
        "image": "approval2_synth_16_aug3.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines Jefferyview College College of Education Hudsonmouth, NM CERTIFICATION This is to certify that Michael Rivers has satisfactorily completed the oral defense for the thesis titled “Sense section usually between gun month always until where” in partial fulfillment of the requirements for the Master of Arts program. Anthony Turner, Ph D. Adviser APPROVAL SHEET Approved by the Thesis Committee on August 05, 2025 after due deliberation of results. Tom Ward, Panel Chair Jennifer Jimenez, Member Panelist Panelist Accepted and endorsed for final revision by the College on October 26, 2025. Thomas Lewis, College Dean College Dean"
    },
    {
        "image": "approval2_synth_16_aug4.png",
        "label": "approval",
        "ocr_text": "CEATIFVC ATION This is to certify that Michael Rivers has satisfactorily completed the oral defense for the thesis titled “Sense section usually between gun month always until where” in partial fulfilimen APPROVAL SHEET Thesis oh AB accel Chiat lenower Jenenez Mens nd endrsend"
    },
    {
        "image": "approval2_synth_16_aug5.png",
        "label": "approval",
        "ocr_text": "Pepatiec of the Phiapees Jefferyview College College of Education Peano, Ml ere natn renee CERTIFICATION er This is to certify that Michael Rivers has satisfactorily compieted the oral defense for the thesis titied “Sense section usually between gun month always untit where” in partial fulfiliment of the requirernents for the Master of Arts program. Anthony Tuer, PhD. Adveer nen APPROVAL SHEET Approved by the Thasis Committee on August 05, 2025 after due deliberaton of results. Tom Ward, Panel Chai Jeondter Jimenez, Member Panic: Pareist Accepted and endorsed for final revision by the College on October 26, 2025. Thomas Lewis, Cotiege Dean"
    },
    {
        "image": "approval2_synth_17_aug1.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines Christopherport College College of Arts and Sciences West Daniel, OK CERTIFICATION at Rachael Chase has This is to certify th oral defense for the satisfactorily completed the thesis titled “Participant board decade idea fish according local soon” in partial fulfillment of the requirements for the Bachelor of Science program. Christopher Bush, Ph D Adviser APPROVAL SHEET ‘Approved by the Thesis Committee on September 22, 2025 after due deliberation of results Sherri Bryant, Panel Chait ‘Amy Wilson, Member Panelist Panelist Accepted and endorsed for final revision by the College on October 26, 2025 Theresa Erickson, College Dean College Dean"
    },
    {
        "image": "approval2_synth_17_aug2.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines Christopherport College College of Arts and Sciences West Daniel, OK CERTIFICATION This is to certify that Rachael Chase has satisfactorily completed the oral defense for the thesis titled “Participant board decade idea fish according local soon” in partial fulfillment of the requirements for the Bachelor of Science program. Christopher Bush, Ph D Adviser APPROVAL SHEET Approved by the Thesis Committee on September 22, 2025 after due deliberation of results Amy Wilson, Member Sherri Bryant. Panel Chair Panelist Panelist Accepted and endorsed for final revision by the College on October 26. 2025. Theresa Erickson, College Dean College Dean"
    },
    {
        "image": "approval2_synth_17_aug3.png",
        "label": "approval",
        "ocr_text": "apes Christoph College of Arts and Scien ce This i requirements for the iS {6 certify that R; chael Ch; satisfactorily completed the or. thesis titted “Participant accerding local soon” in pari the Pitipyinen port College RViFicarion ase has ai defense for the board decade idea figh fulfliment of the Sachelor of Science prograrn. Shristopher Bush, Pi p, Adviser final revi Army Wise Fi on by the 2 On Octon: Rickson, College College Dean"
    },
    {
        "image": "approval2_synth_17_aug4.png",
        "label": "approval",
        "ocr_text": "ines istopherport Cy liege of Arts and Scie This fs to cently that Rachael Chase has satisfactorily completed the oral defense for the thesis Btled “Particigant board decade idea fish According iecal scan” in Partai fulfillment of the requirements for the Bache f"
    },
    {
        "image": "approval2_synth_17_aug5.png",
        "label": "approval",
        "ocr_text": "Repablic oF the Miiiooines Cheistophempor 'egea a ial, ie t College Ans and Sciences eee SEAT Ec Arig nt non nn This is to certify that Ra, satisfactorily completed thesis titted “Part according fog, chael Chase has Ne Oral defense fay ihe iipant board decade ideg Rsh @i Soon” in Bartal fun requirements for the Bai cheior af S ence program. b PHD. Adviser APPROVarL Shey besis Committes on Sepismber 2025 afler dus Alsy Wilson, Mderaber"
    },
    {
        "image": "approval2_synth_18_aug1.png",
        "label": "approval",
        "ocr_text": "Papublic of the Phisppines: New Matthew University Colisge of Education Germnbecoag, OH ne EE ee CERTIFICATION This is to certify that William Biake has satisfactorily completed the oral defense for the thesis titled “Significant right early note budget behind reality around sing” in partial fulfillment of the requirements for the Bachelor of Arts program. Gary Acosta, Ed D. Adviser APPROVAL SHEET Approved by the Thesis Commitiee on April 28, 2025 after due delivorabon of resuits. Gary Grittn, Pane! Chair Josi Johnson, Memoer Penetet Ponetst Accepted and endorsed for final revision by the Coltege on October 26, 2025. Laura Conner, Coliege Dean Cotiege Dean"
    },
    {
        "image": "approval2_synth_18_aug2.png",
        "label": "approval",
        "ocr_text": "Repubie of the Philippines New Matthew University College of Education CRARTIFICATION This is te certily that Wiliam Blake has satisfactorily completed the oral defense for the thesis tilled APPROVAL SHEET Approved by the Thes results. pil 28, 2026 after due deliberati son, Member an October 26, Laura Dean"
    },
    {
        "image": "approval2_synth_18_aug3.png",
        "label": "approval",
        "ocr_text": "papel Nt This is to certify thai Wiltal completed “Significant around for the Bact ge of Eduoation ing” wi partial julfiiey dhe Phtappees Matthew University ain Blake Has satisfactorily for the thesis ch daget penind reality tof the requiements he orai defense rignt early note bu helor of Arts progrars."
    },
    {
        "image": "approval2_synth_18_aug4.png",
        "label": "approval",
        "ocr_text": "coubite of the Philippines New Matthew Unive College of Education Goeneznorcug, CEATEFIGCATION for the Bachelor of Arts program. This is to certify that Wiliam Blake has satisfactorily Gary Acosta, Ed D. Adviser completed the oral defense for the thesis titled APPROVAL SHEET 4 by the s Comin fer due datibersdon of ati Apiil 25, vision by the Collage on October 26"
    },
    {
        "image": "approval2_synth_18_aug5.png",
        "label": "approval",
        "ocr_text": "Begubte of the thitipesens New Matihaw This is to cerity that Wittar, compiated “Significan around “Gilege of Education Sing” in partial fulfilment of ity for the Bache University Blake has Satis the oraj defense for the fhe: bright eany note budget be factorily iS titled id reality fequiremenis OF of Arts Program. Ap fSuRs. by the Thes SiS Comes dost onion, Member Pasay final revision by a, S20 OF Octoher 26, fours €"
    },
    {
        "image": "approval2_synth_19_aug1.png",
        "label": "approval",
        "ocr_text": "ip North Savannah C f Business an an This fs to certify that Brandy Lee has Satistactorily completed the ora! delense for the thesis titled “Example task general consumer neture” in partial fy: iment of for the ihe requirements program, Waster of Science Abigait Mi oved by th 2 deliberation of Caria"
    },
    {
        "image": "approval2_synth_19_aug2.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines North Savannah College College of Business and Accountancy East Daniel, MN CERTIFICATION This is to certify that Brandy Lee has satisfactorily completed the oral defense for the thesis titled “Example task general consumer nature” in partial fulfillment of the requirements for the Master of Science program. Abigail Maxwell, Ed D Adviser APPROVAL SHEET Approved by the Thesis Committee on May 27, 2025 after due deliberation of results. Jerry Cole, Panel Chair Jeffrey Vasquez, Member Panelist Panelist Accepted and endorsed for final revision by the College on October 26, 2025 Carrie Salazar, College Dean College Dean"
    },
    {
        "image": "approval2_synth_19_aug3.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines North Savannah College College of Business and Accountancy East Daniel, MN CERTIFICATION This is to certify that Brandy Lee has satisfactorily completed the oral defense for the thesis titled “Example task general consumer nature” in partial fulfillment of the requirements he Master of Science program. for tl Abigail Maxwell, Ed D Adviser SHEET APPROVAL Approved by the Thesis Committee on May 27, 2025 after due deliberation of results Jerry Cole, Panel Chair Jeftrey Vasquez, Member Panelist Panelist ‘Accepted and endorsed for final revision by the College on October 26, 2025. Carrie Salazar, College Dean College Dean"
    },
    {
        "image": "approval2_synth_19_aug4.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines: North Savannah College College of Business and Accountancy East Daniel, MN $$$ CERTIFICATION This is to certify that Brandy Lee has satisfactorily completed the oral defense for the thesis titled “Example task general consumer nature” in partial fulfillment of the requirements for the Master of Science program. Abigail Maxwell, Ed D. Adviser APPROVAL SHEET Approved by the Thesis Committee on May 27, 2025 after due deliberation of results. Jerry Cole, Panel Chair Jeffrey Vasquez, Member Panelist Panelist Accepted and endorsed for final revision by the College on October 26, 2025. Carrie Salazar, College Dean College Dean"
    },
    {
        "image": "approval2_synth_19_aug5.png",
        "label": "approval",
        "ocr_text": "Hy that Brandy Lee has y completed the oral defense for the fe task general consumer in partial fulfilment of the requirements ce program. nature for the Master of S Abigatt Max APPROVAL SHEET"
    },
    {
        "image": "approval2_synth_1_aug1.png",
        "label": "approval",
        "ocr_text": "Ropatlic of the Paitippines Mortonmo th University College of Education RERTIFICATION This is to certify that Barbara Castro has satisfactorily completed the oral defense for the thesis tied “Feeling memary government other popular claim r HWerence’ in partial fulfilment of the reguiremeny ts. for the Bachator of Arts program. APP ROYAL SHEET esis Committer on September 27, 2025 at due Angel Mercac and endorsed for finai revision hy the Colle n October 26, Dean"
    },
    {
        "image": "approval2_synth_1_aug2.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines Mortonmouth University College of Education North Christopherhaven, WV CERTIFICATION This is to certify that Barbara Castro has satisfactorily completed the oral defense for the thesis titled “Feeling memory government other popular claim might difference” in partial fulfillment of the requirements for the Bachelor of Arts program. Jose Brown, Ed D. Adviser APPROVAL SHEET Approved by the Thesis Commi ittee on September 27, 2025 after due deliberation of results, Amy Clark, Panel Chair lis A Flaehs ingel Mercado, Member Accepted and endorsed for final revision by the College on October 26, 2025. Eddie Bradshaw, College Dean College Dean"
    },
    {
        "image": "approval2_synth_1_aug3.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines Mortonmouth University College of Education North Christopherhaven, WV CERTIFICATION This is to certify that Barbara Castro has satisfactorily completed the oral defense for the thesis titled “Feeling memory government other popular claim might difference” in partial fulfillment of the requirements for the Bachelor of Arts program. Jose Brown, Ed D. Adviser APPROVAL SHEET Approved by the Thesis Committee on September 27, 2025 after due deliberation of results. Amy Clark, Panel Chair Angel Mercado, Member aneiist Panelist Accepted and endorsed for final revision by the College on October 26, 2025. Eddie Bradshaw, College Dean College Dean"
    },
    {
        "image": "approval2_synth_1_aug4.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines Mortonmouth University College of Education North Christopherhaven, WV CERTIFICATION This is to certify that Barbara Castro has satisfactorily completed the oral defense for the thesis titled “Feeling memory government other popular claim might difference” in partial fulfillment of the requirements for the Bachelor of Arts program. Jose Brown, Ed D. Adviser APPROVAL SHEET Approved by the Thesis Committee on September 27, 2025 after due deliberation of results Amy Clark, Panel Chair Angel Mercado, Member Panelist Panelist Accepted and endorsed for final revision by the College on October 26, 2025 Eddie Bradshaw, College Dean College Dean"
    },
    {
        "image": "approval2_synth_1_aug5.png",
        "label": "approval",
        "ocr_text": "Rapa Mo This is to c satisfactor thesis tt Lage of Edu ic af the Paioniees sfonmouth University CATION CHEATIFE ertify that Barbara Castro has iy completed the 0! ai defense for the ent otter Jing memory governny 4 fulfiliraent of ior of Arts program. Approved bY deliberation of APBROVAL SHEET 20 on September 27, 202 th"
    },
    {
        "image": "approval2_synth_20_aug1.png",
        "label": "approval",
        "ocr_text": "Republic of the Philippines Mortonmouth University College of Education ‘North Chestophemaven, WW CERTIFICATION This is to certify that Barbara Castro has Satisfactorily completed the oral defense for the thesis titled “Feeling memory government other popular claim might difference” in partial fulfillment of the requirements for the Bachelor of Arts program. Jose Brown, Ed D. Adviser a APPROVAL SHEET Approved by the Thesis Commit ittee on September 27, 2025 after. due deliberation of results, Amy Clark, Panel Chair Angel Mercado, Member Panelist Panelist Accepted and endorsed for final revision by the College on October 26, 2025. Eddie Bradshaw, College Dean College Dean"
    },
    {
        "image": "approval2_synth_20_aug2.png",
        "label": "approval",
        "ocr_text": "Regebhe Mortanmouth colle cur This is to certify that satisfactorily comple thesis tied “Feeling popular claim might the requirements for apeAOVAL Approved by She Thesis Gc deliberation of re and endorsed of the signe 3 of Educt university ation FLELGATION Barbara Castro has ied the oral defense for the memory government other difference” in partial fulfiftment of the Bachelor of Asis program. Jose Brown, EG 9. Adviser rnc eee SHEET tember 27, 2025 after due sranities ON 200 for final revision BY the Catiege an Oc"
    },
    {
        "image": "approval2_synth_20_aug3.png",
        "label": "approval",
        "ocr_text": "Ragu of the Mortonm This is to certify that Barbara Castro has Satisfactorily completed the ora! defense fo 's Wed “Feeling memory government other popular claim might difference” in nm partial fy 2 egquirements for the Bachelor of Arts progre IT]. Jose Brow"
    },
    {
        "image": "approval2_synth_20_aug4.png",
        "label": "approval",
        "ocr_text": "Republic of th Mortonmouth University Callege of Education os Fhitippines GERTIFICATIORN This is to certify that Barbara Casiro has cloriy completed the oral defense for the thesis tited “Feeling mem overnment other popular claim might difference” in partial fulfilment of the requirements for the Bachelor of Arts prograrn. APPROVAL SREET Approved by t is Co detibe: FON 0 Angel Mer d and endorsed for fin: re College on October Eddie Bra"
    },
    {
        "image": "approval2_synth_20_aug5.png",
        "label": "approval",
        "ocr_text": "SCERTiFiC4aT This is to ‘tify that Barbara Castro has satisfactorily completed the oral defense for the thesis titled “Feeling memory government other popular claim might difference” in partial fulfilment of the requirements for the Bachelor of Aris program. Jose Brows APPAGVAL Approvad by the Thi doimberation of results. is Com September 27, S alter due Amy An pied and endorsed for finat ra In October 26. 20285. w, Collage Daan Dean"
    }
]