[
    {
        "image": "assessmentprogram1_synth_10_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Dixon Jones Oniversity ASSESSMENT PLA Programm taformation Repurpose Scalabie E Busine: Page Deparment — Cottege of Educa 2024 2025 Cootact Perwun 24 685 B21 20h4 Program Mission Statement The mission of the Customer Program in the Six Department ts to prepare students for professionai practice, advanced study, and civic engagement bv providing rigorous curriculum that integrates theoretical foundations with applied skills. Student Leeraieny Outeomes appropriate 11 relevant to bio sproprats meibods and SEAMS 1 oO brologinad SowneeS address professions practice in bole ‘word problems in Bolsgical complete"
    },
    {
        "image": "assessmentprogram1_synth_10_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Dixon Jones University _ Repurpose Scalable E- Bus siness B S Page Department College of Educatior i 2024 20 Contact Person The mission Dei the Gustencs Program in the Six Department is to prepare students for professional @, advanced study, dis engagement by providing orous curriculum that integrates theoretical foun dations with Applied skills."
    },
    {
        "image": "assessmentprogram1_synth_10_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Dixon Jones Univer ESSMENT Plans Program bitcraaiion Repurpose Scalable E Business B S. Page Department ues of Education Adress Program Miustoa Salvmont The mission of the Customar Program in the Six “epariment is to Prepare students for professional practice, advanced Study. and civic engagement by Providing s rigorous curriculum that integrates theoretical foundations with abdiled skills. Stortent Cesining Guicumos Bioiogical ate appropriate Si fe Fethags. ‘OLY Seiting: to compteta ih Binlogiea:"
    },
    {
        "image": "assessmentprogram1_synth_10_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "OBrivershy® ASSESSMENT PLAN; sittued iar Repurpose Scalable E Business _ Page Department i The mission of the Customer Program in the Six Department is to prepare students for professionai practice, advanced study, and civic engagement by providing a@ rigorous curriculum that integrates heoretical foundations with applied skills. Student Learning Graduates will collaborate appropriate methods and experimental techniques to complote professional practice relevant tv biological sciences, demonstrate quaiitalive methods to address real world problems in biological sciences, evaluate appropriate methods and stalisticat analysis to complete laboratory Sattings retevant to biological sciences, evaluate software platforms to address professional practice in broiogical sciences. Cotaberate snpropriaie metnosts and experimental tachakees io compiete professional practice relevant io Biciowical Sciances, Demonstrate qualitative methods to address real world problems in Biological 1908S. Evaluate appropriate methods ari statistical anelysi: complete _ _ laboratory settings retevant to Bictogical Sci = Evaluete software piattounis to address professional practice in Biologicat"
    },
    {
        "image": "assessmentprogram1_synth_10_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Dixon Jo es niversi! ASSESSMENT PLAN: Ostbuted Exot a Program Information Name __ Repurpose Scalable E Business B S. Page Department College of Education Department or Program Division Academic Year (when the plan will begin. or “already in progress\") 2024 2025 Contact Person Name Chnstina Cartson Configurable Even Keeled Support Class Dept steelenancy example net +1 646 821 2661 Program Mission Statement The mission of the Customer Program in the Six Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied skills. ‘Student Learning Outcomes Graduates will collaborate appropnate methods and experimental techniques to complete professional practice relevant to biological sciences, demonstrate qualitative methods to address real world problems in biological sciences, evaluate appropnate methods and statistical analysis to complete laboratory settings relevant to biological sciences, evaluate software platforms to address professional practice in biological sciences 1 Collaborate appropriate methods and experimental techniques to complete professional practce relevant to Biological Sciences 2 Demonstrate qualitative methods tg address reel world problems in Biological CleNces. 3 Evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to Biological Sciences ‘Evaluate software platforms to address professional practice in Biological Sciences. Title Department Email Address"
    },
    {
        "image": "assessmentprogram1_synth_1_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Thomas Wagner University ASSESSMENT PLAN: gt Utilize innovative Action items oe Phd. oe Hundred Departmen Daniel Kramer 4d epartinest ion of the information Program in the L The miss 1 Close Department is to prepare stu ents for anced study, and civic ium that ofessional practice, > agement by providing rigorous CUITICH h integrates theoretical foundations with applied skills. riage methods end Sxperimertal techniques, ci demonstrate eins in viologcal ‘sc1ences, istical analysts te COMpie jaboraicry nes, ovaluate ‘sofmware platforms w ~peimonstvata qualitave methods 2 adarass cis 3S. fe Evaluate appropriate methods and statistical analysis 1 compete jaboratory settings reiavant to Bs ences. software patfor ns to address professional practice Biological Evaiusic"
    },
    {
        "image": "assessmentprogram1_synth_1_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Thomas Wagner University ASSESSMENT PLAN: Sameer Department or Program ~~ | Division lan wil Academic Year (when the beg “already in progress”) be fp __ [Name f [Title [Department a -! __] Email Address ‘summers example org [Phone i (782 320 2535x9003 ‘ment _ nced study, and civic gagement by Providing a rigo) 'Jorous curriculum that Oretical foundations with applied skills. ‘Out Graduates will collaborate Facto. ate methods and experimental techniques to complete professional practice {elevant to biological sciences, demonstrate qualitative methods to address real world problems in biological Sciences: evaluate appropriate method Ho Brora Sechniaues to complete professional practice relevant to Biological Sciences |"
    },
    {
        "image": "assessmentprogram1_synth_1_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Thomas Wagner University ASSESSMENT PLAN: BBxESegE° Program Information ‘Academic Program (Major, Degree Name) Utilize Innovative Action Items beers Ph D. Department or Program Hundred Department College of Science Division ‘Academic Year (when the plan will begin, or “already in progress”) 2020 2021 Contact Person Name Daniel Kramer Title Organized Directional Success Department Subject Dept. Email Address isummers example org Phone (782 320 2535x9003 Program Mission Statement The mission of the Information Program in the Close Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied skills. Student Learning Outcomes Graduates will collaborate appropriate methods and experimental techniques to complete professional practice relevant to biological sciences; demonstrate qualitative methods to address real world problems in biological sciences; evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to biological sciences; evaluate software platforms to address professional practice in biological sciences 1 Collaborate appropriate methods and experimental techniques to complete professional practice felevant to Biological Sciences. Demonstrate qualitative methods g address real world problems in Biological ciences Evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to Biological Sciences. Evaluate software platforms to address professional practice in Biological Sciences 2 i a"
    },
    {
        "image": "assessmentprogram1_synth_1_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Thomas Wagner University Roacced Zer0 ASSESSMENT PLAN: samnst3 — a ‘Academic Program (Major, Degree \"Utilize Innovative Action Items Name) Degree Ph D Department or Program Hundred Department Division College of Science (when the dy in progress\") 2020 2021 Contact Person Daniel Kramer i Organized Directional Success Subject Dept 7 Email Address isummers example org (782 320 2535x9003 Program Mission Statement Phone The mission of the Information Program in the Close Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied skills. ‘Student Learning Outcomes Graduates will collaborate appropriate methods and experimental techniques to complete professional practice relevant to biological sciences, demonstrate qualitative methods to address real world problems in biological sciences, @valuate appropriate methods and statistical analysis to complete laboratory Settings relevant to biological sciences, evaluate software platforms to address professional practice in biological sciences acres ibporate appropriate methods and experimental techniques to complete professional practice ‘alovant to Blological Sciences, 2 Demonstrate qualitative methods to address real world problems in Biological ciences 3 Evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to Biological Sciences. “+ Evaluate software platforms to address professional practice in Biological ____ Sciences."
    },
    {
        "image": "assessmentprogram1_synth_1_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Thomas Wagner University ASSESSMENT PLAN: BaRIREE ZB? Program Information amg) wan CBen Pees Utilize Innovative Action Items oe Ph D. Hundred Department College of Science Department or Program Division Academic Year (when the plan will begin, or “already in progress”) 2020 2021 Contact Person Name Daniel Kramer Title Organized Directional Success Department Subject Dept. Email Address isummers example org Phone (782 320 2535x9003 Program Mission Statement The mission of the Information Program in the Close Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied skills. Student Learning Outcomes Graduates will collaborate appropriate methods and experimental techniques to complete professional practice relevant to biological sciences, demonstrate qualitative methods to address real world problems in biological Sciences; evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to biological sciences; evaluate software platforms to address professional practice in biological sciences. 1 Collaborate appropriate methods and experimental techniques to complete professional practice relevantto Biological Sciences, Demonstrate qualitative methods tg address real world problems in Biological sciences: 3 Evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to Biological Sciences Evaluate software platforms to address professional practice in Biological Sciences. 4"
    },
    {
        "image": "assessmentprogram1_synth_2_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Beportment oF Prog Bivisian Vie The mission of the _Redefine Magnetic Interfa ae Production Program in the [ses Begnett Universily YT PLAN: Coaiae Persia te Mission Seite Husband Department is to prepare students for professional practi oo cs, advanced study, and ci MEG engagement by providing a rigorous curriculurn that polled skills. integrates theoretical foundations with a Loarsiog Hetsenios lechniques 3) te"
    },
    {
        "image": "assessmentprogram1_synth_2_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Tegesasteii t TIVEYSily SMEN T PLAN: UP Si Successful Department College of Edu Program Missian Stateane _ The mission of the Production Program in the Husband Depariment is fo prepare studeris for professional practice, advanced study, and civic engagement by providing a rigorous curricwlurn that integrates thearetical foundations with eppiled skills. Studenk Learilag Geteumies: Evatuate a habe"
    },
    {
        "image": "assessmentprogram1_synth_2_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Bennett Tell niverst MENT PLAN: UPSHES LINE Succes _ Prograst information oe Redefine Magnetic interfaces BA. Successiu! Gapartment Equoation solege ial iitevigenes imal Address sens Breagamn Mission Beate The mission of the Fr soduetion Program in the 2 students ‘for Deparment is to orepare Husband professional practice, advanced if study, and civic engagement oy Dp roviding figerous urriculum that integrates th heoretical foundations W ath applied ails. gesiing Cuacees Siadeas t gre phantom sattwa"
    },
    {
        "image": "assessmentprogram1_synth_2_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "|. Up Sized Holistic ASSESSMENT PLAN: UP Szed Ho Program Information ‘Academic Program (Major, Degree Redefine Magnetic Interfaces Name) Deas B A. Pepartment or Program Successful Department College of Education Division Academic Year (when the plan will 5 2018 2019 begin, or “already in progress”) a Contact Person Name Lauren Wheeler [Title Function Based Holistic Artificial Intelligence Department Where Dept. Email Address smalirobert example com Phone 001 542 451 3740x71013 Program Mission Statement The mission of the Production Program in the Husband Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied skills. Student Learning Outcomes Graduates will collaborate appropriate methods and experimental techniques to complete professional practice relevant to biological sciences; demonstrate qualitative methods to address real world problems in biological sciences; evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to biological sciences; evaluate Software platforms to address professional practice in biological sciences. Collaborate appropriate methods and experimental techniques to complete professional practice relevant to Biological Sciences, Demonstrate qualitative methods address real world problems in Biological ciences. Evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to Biological Sciences. _ ‘Evaluate software platforms to address professional practice in Biological clences. 2"
    },
    {
        "image": "assessmentprogram1_synth_2_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Tofres Bennett Wniversity PLAN: Ut Red fine Magnetic interfaces oe BAL Sucecessfig 7 ebarineny College o Education Fane The mission of the Production Prograrn in the usband Department is to prepare students for professional Practice, advanced Study, aind civie engagement by providing a Aigorous curriculum thet integrates theoretical foundations with applied skills. s OgicAl sciences, and expenmer san By te Qualiative mathods to ada Darecnats Sc Evaluate appropiate methexis ar laboratory se s Huade Sollware pa professions prac! tice in Biological"
    },
    {
        "image": "assessmentprogram1_synth_3_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "trada Bell niversi ASSESSMENT PLAN: Pesr nas ‘Workforce Program Information Academic Program (Major Degree Empower Leading Edge Markets Name) bese Ph D. Department or Program Foot Department Division College of Education ‘Academic Year (when the plan will begin, or “already in progress”) 2021 2022 Contact Person Name Andrew Mitchell Title Advanced Stable Productivity Department Ability Dept. Email Address jessica27 @example com Phone 001 781 237 1511x816 Program Mission Statement The mission of the Rest Program in the Them Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied skills. ‘Student Learning Outcomes Graduates will collaborate appropriate methods and experimental techniques to complete professional practice relevant to biological sciences, demonstrate qualitative methods to address real world problems in biological sciences; evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to biological sciences, evaluate software platforms to address professional practice in biological sciences. 1. Collaborate appropriate methods and experimental techniques to complete professional practice relevant to Biological Sciences. [2 Demonstrate qualitative methods to address real world problems in Biological clences. 3. Evaluate appropriate methods and statistical analysis to complete |__ laboratory settings relevant to Biological Sciences. Evaluate software platforms to address professional practice in Biological ‘Science"
    },
    {
        "image": "assessmentprogram1_synth_3_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Estrad. ‘Univers _ Empower Leading Edge Markets PRD. Foot Department College of Education 01 78% Phare Bon Sotemment _ The mission of the Rest Program in the Them. Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with aoplied skilis. practy qualitative methods to addre: opropiate metho oralry seit iware platforms t0 2 Seienice Evahiste sat"
    },
    {
        "image": "assessmentprogram1_synth_3_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Egttad: ell niversi ASSESSMENT PLAN: Peseta Montes Program Information [Raa own Gs Dass Empower Leading Edge Markets Jor CPD. ____— r= enable Foot Department Division College of Education eocvarwmntepeaw| ono «SL [egites tresy inprogeer) | 2021 2022 L Contact Person a] | Andrew Mitchell | Tele Advanced Stable Productivity sme ty Dept [Small Address jessica27 example com Phone 001 781 237 1511x816 Program Mission Statement The mission of the Rest Program in the Them Department is to prepare students for professional practice, advanced study, and civic engagement by ‘oviding a rigorous curriculum that integrates eoretical foundations with applied skills. L ‘Student Learning Outcomes hniques to complete professional practice relevant to biological sciences, demonstrate qualitative methods to address real world problems in biological sciences, ‘and statistical analysis to complete laboratory settings relevant to biological sciences; ‘evaluate software platforms to address professional practice in biological sciences. \\1 Ss sor orate appropriate methods and experimental techniques to complete professional practice ee aren Biciogical See =n biological |= Demonstrate qualitative methods to address Teal world problems in Biological ip Evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to Biological Sciences. 7 Evaluate software platforms to address professional practice in Biological UL ‘Sciences. a)"
    },
    {
        "image": "assessmentprogram1_synth_3_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "E Academic inners! ASSESSMENT PLAN: Prose treas Academic Year (when the plan begin. oF “aire: —___ _ Empower Leading Edge Markets Foot Department 2021 2022 ‘will | —— Advanced Stable Productivity = i ______ Program (Major, Degree] Jessica27 example com 001 781 237 1511x816 Program Mission Statement Andes Up _] Andrew Mitchell Evaluate appropriate methods ‘SiS to complete 7 laboratory settings Felevant to Biological Sciences 4 Evaluate software Platforms to address Professional practice in Biological ‘and statistical anal"
    },
    {
        "image": "assessmentprogram1_synth_3_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "| Foot Departnent College of 262) 2 See. amor Andrew Ni [Phone The mission of the Rest Program in the Them Department is te prepare students for professional practice, advanced Study, and civic engagement by breviding a rigorous curriculum thet integrates theoretical fouindations with applied skills, Stated Ueraing Bakcamey fice rei 8 adoESs re"
    },
    {
        "image": "assessmentprogram1_synth_4_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "fay Swanson and Richards Unwerstty ASSESSMENT PLAN! octane rogram Infarination woe E Enable Rich infrastructures a MA. Depactment or Pro ee Do Depariment Goilege of Sclence 2020 2024 Coninct Person date Wiiams Front Line Tangible Paradam i osivon Dept wvurgsionjosep enarnnic 078 a9. 945 9342 Staveenamt Program Bisewor The mission of the Anything Program in the Challenge Department js to prepare students for professional practice, advanced study, and civic engagement by providing rigorous curriculum that integrates thecretical foundations with applied skills. ‘sredent Lear aing Ovicomes pb exper ime: cai sciences, daria in Peological $' ntal techniques: strate Graduates wili colle to compiate proles sional prac! quattative mathods to addi wok sathods and StalrsttCB! analysis to ‘complete labor airy eratings rotevant to bwiogicel Sciences, evaiuate sofware platiorms to Sedross professional practice 1D pinlogical SC “comgperate approariata el i evaluate approoriate 1 to complete erotessionat pratoe paidress real world problems 1% Biclegical ences, ‘and statistical analysts 10 complete chagical SEIeNces. fessional practce In Biological ZF Deinonstrate qualitative methods Ms Evaluate aperopnate met jaboratory settings 1 1 evhuate software patterns to adhoc” oro Sciences. elevant to Bi"
    },
    {
        "image": "assessmentprogram1_synth_4_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Fry Swanson and Richards University ASSESSMENT PLAN: ree — “es E Enable Rich infrastructures Prpsrement or Prep Do Department i pion _College of Science Acaderniz Vear (when the plan wat oe already in progress”) an ___FrontLine Tangible Paradigm ___| Peston Dept - ininystonjoseona examipie org The mission of the Anything Program in the _ Challenge Department is to prepare students for professional ractice, advanced study, and civic engagement by providing a rigorous Curriculum that integrates theoretical foundations with applied skills, nt rit ‘al technigu to complete professional pectin Tefevant io riciopical eens demone vale quatilative methods to address. feal world problems in cal Sciences, evaluate appropriate methods &n0 statistical analysis to complete laboratory Settings relevent to biological sctences; evaiuate software plettorms to i address professional practice ta sciences. oe Demenstaio quaitiative methods: 2 addioss real world problems in Biological Saences. Evaiuate netnods and statistical ar; to complete Evaivate software platforms to Addiess professional practice in Biological"
    },
    {
        "image": "assessmentprogram1_synth_4_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "1 ren bntion a E Enable Rich Infrastructures MLA, Do Department College of The mission of the Anything Program in the Challenge Department is to prepare students for professionai practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied ski! Studexé Learning Gairorns niques fo complete professional practic: JERS, alworid problems in Biclogica! compiats: Sciene:"
    },
    {
        "image": "assessmentprogram1_synth_4_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Assess) Srograin ticemation E Enable Rich infra, MA “— Do Bepar, Cotlege of g, Structures iar Wadign The Mission of the Anything Pri rogram j in he Ct allenge Pepartment i 'S (© prec HS for Professianai practi ice, advanced study ann i Pgagement by pray, iding a rigor Integrates theo é Stotenmiang OUS Currleulum that ONS With applied &kilis, hateorres tical foundatio Stadent bowen Sf Biological"
    },
    {
        "image": "assessmentprogram1_synth_4_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Fry Swati and Richards University :NT _ Progressive MENT PLAN! incremental Portal ASSES program Information Reade Pogram (aN? E Enable Rich Infra Degree MA Do Department College of Science structures Department or Program Division Academie Year (when the plan will pepin or “already in progress 2020 2021 Contact Person Name Mark Williams Title Front Line Tangible Paradigm Department Position Dept. Email Address wingstonjosepn example org 878 995 9342 Phone Program Mission Statement The mission of the Anything Program in the Challenge Department is udents for professional practice, advance engagement by providing a 1d 3 J b integrates theoretical foundations with applied skills. Student Learning Outcomes ‘ods and experim biological scien’ eal world problems In biological sciences, statistical analysis to complete laboratory ftware platforms to t to biological sciences. evaluate Sof tice in biological sciences mental techniaues to complete professional practice Biological Sciences ‘ental techniques Graduates will collaborate appropriate meth to complete prot ce relevant to ‘ces, demonstrate qualitative m: evaluate appron' settings relevant Sddress professional prac 1 Collaborate appropriate metnods and exper ‘dlevantto address real world problems In Biological sciences. ode and statistical analysts to complete jogical Sciences apPtory settings relevant {0 Biol ‘aqaress professional practice Biological 4 Evaluate software platforms to Sciences. Demonstrate qualitative methods 1g 3 Evaluate appropriate meth"
    },
    {
        "image": "assessmentprogram1_synth_5_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Program ieformation Hon iMersrs erate Next Generation E Ma\\ ners Thousand Department segs of Aris and Letiers Prograte Mission Statement The missinn of the Bag Program in the Notice Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates tneoretical foundations with apclied skills."
    },
    {
        "image": "assessmentprogram1_synth_5_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Wy fatter on niversit ASSESSMENT PLAN: vais —eeE L “Program Information feet Progam aes Dow ‘iterate Next Generation E Markets Name) __— Degree T Department orPr ram +———_ __ B A ________ ae | Thousand Department | Division College of Arts and Letters | acacYearehentepanwil S S —] begin or “already in progress) — 2023 2024 ntact Person a a [Tide Reduced Demand Driven Focus Group [Department iz Something Dept | eholmes example com | 41 857 450 7257 27905, | Program Mission Statement | The mission of the Bag Program in the Notice | Department is to prepare students for professional |EmailAddress [Phone practice, advanced study, and civic engagement by | providing a rigorous curriculum that integrates | theoretical foundations with applied skills. | Student Learning Outcomes Graduates will collaborate appropriate methods and experimental techniques GB eomplete professional practice relevant to biological screnee demonstrate qualitative methods to address real world problems 'n biological Sciences, qualita appropriate methods and statistical analysis to complete laboratory Settings relevant to biological sciences; evaluate software platforms to address professional practice in biological sciences ues to complete professional practice \\1 ‘Collaborate appropriate methods and experimental technia relevant to Biological Sciences. [2 Demonstrate qualitative methods tg address real world problems in Biological _ ciences. [3 Evaluate appropriate methods and statistical analysis to complete ~ laboratory settings relevant to Biological Sciences. ______ ‘ddress professional practice in Biological {____ Evaluate software platforms to ai l op Sciences."
    },
    {
        "image": "assessmentprogram1_synth_5_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "rageaim takin eas Suse Hterate Next Generation E Markeis BAL. Thousand Deparrnent ge of Aris and Let pian it The mission of the Bag Program in the Notice Department is to prepare students for professional practice, advanced siudy, and civic engagement by providing a rigorous curriculum that integrates i theoretical foundations with applied skills. Shade’ Lares jate methods be oilaborate aporape signal practice reievel 5 to ad je meinods 2 biciagical sciences, aval sional prachee mn biolngical scene ods ond exp ‘0 roevantia 8 word problems in Srolagical a Evalwais appropriate methods ar jaboratory settings reevant fiware platfornis 16 a pate:"
    },
    {
        "image": "assessmentprogram1_synth_5_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Wu Patterson iniverst ASSESSMENT PLAN: RABY anal ——— a BA. OC [Deparment ee Thousand Department ae _Coliege of Arts an Leters | Reduced Demand Dnven Focus Group The mission of the Bag Program in the Notice Department is to prepare students for professional practice, advanced study, and civic engagement by _ providing a rigorous curriculum that integrates theoretical foundations with applied skills. ods and experimental tochriques, to complero professionst practice telavarit to biological sciences; Gemenstrate problenrs Ww 1 biological Sci evaluate appropnate methads and Statistical analysis 10 complete laboratory sciences, evaluate software platforms to cISACES. Evaluate appropriate methods and statistical analysts to complete b i faboralory settings relovant to Bioiogtcal eS, Evaluate software platforms to agaress professionel practice in Biologics!"
    },
    {
        "image": "assessmentprogram1_synth_5_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Waivers ASSESSMENT PLAN: eae icragamttown Oe\" Werate Next Generation &-Markels BA. Thousand Department Gollege of Arts and Letters 2023 2024 Dew bepartmens ar Progr Division pany Seot Reduced Demand Diven Focus Gioup ~~ Something Dest ‘Department Naress The mission of the Bag Program in the Notice Department !s to prepare students for professional practice, advanced study, and civic engagement by providing 4 rigorous curriculum that integrates theoretical foundations with applied skills. Trodend bearning Oxtcomes orate appropiate jnethods an grimental techniques jonal practice reievant to biological scrences. demonstrate eek id probiems i biological $c1ences, cal analysis to comptete taboratory Graduates wilt col to complete proress! qualitative method: evaluate appropriate ek\" settings relevant to brologica! Science syaitiate Software piatforms 1o address professional pF ectice chocgical scrences SS Phorate appropiate metas and Sanat a weenaves yan bo FDIOGIEA SENOS 15 to axkdress real wort t Scvences. z Eveluats appropriate methods dnd statistical analysis 10 complele jaboratory SOtings. relevant to. Biological Sciences: atforms to address professional pF Lice 1n Biological d problems in Biological Damonsnate qualtatve method 7 Evaluate software pl"
    },
    {
        "image": "assessmentprogram1_synth_6_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "PLAND of oe impiement E Busine MA. Return Dep iment gg E Marcels dor tonad The mission of the Cup Pro Department iS to prepare St practice advanced study. 2 providing rigorous cure theoreti eal foundaions with student be gram udents for profe"
    },
    {
        "image": "assessmentprogram1_synth_6_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Washington Hodges University ASSESSMENT PLAN: “RERTERH MA. The mission of the Cup Program inthe Magazine _ Department is to prepare students for Return Department 2021 2022 _ implement E Business E Markets —| professional practice, advanced study, and civic engagement by providing a rigorous curricull Earinaralng Ba Graduates vail collaborate appr opriate methods and to complete professional prachce retevant to biologics probiors in jum that integrates theoretical foundations with applied skills. expat ai sciences, demonstrate imental techniques cal sciences, qualitative methods to address reai world biologi nd statistical anatysis to compete laboratory evaluate appropriate methods ar evaluate softwar 1 Collaboratt appropiate mama: epee 4 12 Demonsivale qualitative matwoos ip adcress real wortd LL ci a Evaluate appropiate methods and statistic Maboralory setings relevent to Biological [a Evaluate software platforms to agtross er platforms to problems in Biologics ai analysis to compicte 1 Sciences, siessional practice in Biological |"
    },
    {
        "image": "assessmentprogram1_synth_6_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Washington Hodges University LAN: implement E Busih -Markets i 7 MA. 7 i Retum Department _ Pragean: The r nission of ihe Cus Program in the Magazine Dapariment is fo prepare siudents for professional practice, advanced study, and civic ic engagement by prov ding a rigorous curticulum that integrates i theoretical foundations with ‘applied Sails."
    },
    {
        "image": "assessmentprogram1_synth_6_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "renation 4 -Business E Markets MA ae lege of col Contact Person The mission of the Cup Program in the Magazine Department is to prepare students for professional practice, advanced study, and engagement by providing a Mg rriculum that integrates theoretical foundatl applied skills."
    },
    {
        "image": "assessmentprogram1_synth_6_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Washington Hodges University “Frogeana iatorsmatt “implement E Business E Markets eee A Return Department College of Science Resiact Breese The mission of the Cup Program in the Magazine Department is to prepare students far professional _ practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied skills."
    },
    {
        "image": "assessmentprogram1_synth_7_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Conrad Group University sale Extensible Networks _ MA Result Departrnent i a ae Syner rownghenareps vedere BER ABS 25299527620 Program Minion Setomant The mission of the Senior Program in the Pay Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied skills. wborale appropinie methods and experimental techniques anal prac! want 1 De als demonstrate in ACGIESS Feat 4s problems in bi CBS; methods and tical analysis te complete laboratory atforms to AVENE AT DIK professional pi tical analysis to comp cal Scienc Evahiate software piationns to ad"
    },
    {
        "image": "assessmentprogram1_synth_7_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Conrad Group University ASSESSMENT PLAN: 9 Siand Ale. [Sie OREN” Seale Extensible Networks _t Result Department __ College of Education The mission of the Senior Program in the Pay Department is to prepare students for professional practice, advanced study, and civic engagement by roviding a rigorous curriculum that integrates eoretical foundations with applied skills. l6s will collaborate appropnate methods and experimental techniques to complete professions! practice relevant to Diologica! sciences, demonstrate qualitative methods to address real world problems in biological sciences, evaluate appropriate methods and statistical analysis to comptete iaboratory seitings relevant to biological sciences, evaluate software platiorms to adktess professional practice in biological sciences, 1h ‘Cokaborate approprizis metnods and expenmontsl inchneaues 19 complete professional practice felevant ta Brovapical Sources |2 Demonstrate qualitative methods address real world problems in Biological {3 Evaluate appropriete methods and statistical analysis to compiete a laboratory settings relevant to Siologica’ Sciences. * Evaluate software plaitorms to address professional practice"
    },
    {
        "image": "assessmentprogram1_synth_7_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Conrad Group University ASSESSMENT Phan: owsetaaes. pn ewan Mei Dee Seale Extensiple Networks MAL Result Department College ot Education 2024 Camis Posi Danie? Kim Synerazed Full Range Encoding Nearly Dep: Irowo example net 223 454 2523017520 Peograsn Mission Statement The mission of the Senior Prog! Department is tap te laboratory ms to a8 9 compte: ciOceS i Drofestionat practi, Demonstrate qualitative methods HW A00PeSS foal word Problems in Biotogical Scienc Evaluaie appropriate methods and statistical ANALYSIS to completa f8ho atory settings icevant to Brologica; Scien Evaluate software platforms to address: Professional pr Sciences 7 C8 In Biological"
    },
    {
        "image": "assessmentprogram1_synth_7_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Conrad Group University ASSESSMENT PLAN: p StancAlene. Program Information ‘Academic Program (Major, Degree Name) Scale Extensible Networks Degree MA. Result Department College of Education Department or Program Division ‘Academic Year (when the plan will begin, or “already in progress”) 2024 2025 Contact Person Name __ Danie! Kim _ Title cL _Synergized Full Range Encoding Department Nearly Dept. Email Address brown example net I 223 454 2523x17620 Program Mission Statement The mission of the Senior Program in the Pay Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied skills. Phone ___ Student Learning Outcomes Graduates will collaborate appropriate methods and experimental techniques fo complete professional practice relevant to biological sciences. demonstrate qualitative methods to address real world problems in biological sciences: Cyaluate appropriate methods and statistical analysis to complete laboratory Settings relevant to biological sciences, evaluate software platforms to address professional practice in biological sciences Collaborate appropriate methods and experimental techniques to complete professional practice Televantto Biological Sciences. Demonstrate qualitative methods to address real world L Sciences 3 Evaluate appropriate methods and statistical analysis to complete Evaluate one tory Settings relevant to Biological Sciences. Evaluate software platforms to address professional practice in Biological “Science F P problems in Biological in"
    },
    {
        "image": "assessmentprogram1_synth_7_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Conrad Group University SMENT PLAN: 9, Se Gua ie Result Department Piveine i College of Education Pho The mission of the Senior Program in the Pay Department is lo prepare students for professional ractice, advanced study, ‘and civic engagement by providing rigorous curneuium that integrates theoretical foundations with applied skills. a ‘Ghecdond aaring ances"
    },
    {
        "image": "assessmentprogram1_synth_8_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Kaulman PLO University MLA. ‘Yes Depan mer Uollege of Aris and Letters ‘Contast Person fore Progicein Mission Ststewent gran in the Degr ee students for professional The mission of the Ten P Pea ty is to spare techoiques demonstrate"
    },
    {
        "image": "assessmentprogram1_synth_8_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "K Unversity” ASSESSMENT PLAN: _Fresn Treang Program Information [Name wens OES Re Intermediate 24 365 Technologies _ mes MA ‘mentor Programe Yes Department Deion College of Arts and Letters ‘Academic Year (when the plan will begin or “already n progres) 2018 2019 “me Lucas Arias Kula Cross Group 24Hour Forecast Department White Dept. Email Address gwitson example net oe Phone 6182052191 Program Mission Statement The mission of the Ten Program in the Degree Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates eoretical foundations with applied skills. ‘Student Learning Outcomes Graduates will collaborate appropriate methods and experimental techniques to complete professional practice relevant to biological sciences; demonstrate qualitative methods to address real world problems in biological sciences; evaluate appropriate methods and statistical analysis to complete laboratory ‘settings relevant to biological sciences; evaluate software platforms to address professional practice in biological sciences. 1 Collaborate appropnate methods and experimental techniques to complete professional practce relevant io Biological Sciences, [2 Demonstrate qualitative methods to address real world problems in Biological Evaluate appropriate methods and statistical is to complete 4 laboratory settings relevant to Biological Sciences. Evaluate software platforms to address professional practice in Biological 1"
    },
    {
        "image": "assessmentprogram1_synth_8_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Kaufman PLC IVEPSity ENT PLAN: Program information Preprann (Ma Re Iniermediate 24 365 Techriologies MLA Be portmeaton Progran Yes Department a lege of Arts and Letters a 2018 2019 Contact Ferien Aste Cross Group 2dHour Fo White D: qwussng 87182052191 LORIN. Mivsion Sutement The mission of the Ten Program in the Degree Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied skills. tvatuate software"
    },
    {
        "image": "assessmentprogram1_synth_8_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Kauinan PLC ASSESSMENT PLAN: Re intermediate 24 365 Tecty MAL Yes Department Gollege of Arts and Letters: log SB Eentket Berson naa Lo duces A Fae i ce SIBLOSZITT Pengran Hicion Statement The mission of the Ten Program in the Degree Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculurn that integrates _ theoretical foundations with applied skills. Rtadeut Learning Gutcases chaigues, manstiae svaluain appropriate method IS Pelevant to foal S Mevant io Biclagical S tins to address p tonal practice in Biological SLITS ~ a"
    },
    {
        "image": "assessmentprogram1_synth_8_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "LC Kaynivarstty ASSESSMENT PLAN: regen Program Information Academic Program (Major, Degree vos Re Intermediate 24 365 Technologies Degree MA. Yes Department College of Arts and Letters Department or Program Division ‘Acade' (when the plan will begin, ot n progress\") 2018 2019 Contact Person Name Lucas Arias Title Cross Group 24Hour Forecast Department White Dept Email Address gwilson example net Phone 6182052191 Program Mission Statement The mission of the Ten Program in the Degree Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied skills. Student Learning Outcomes Graduates will collaborate appropriate methods and experimental techniques to complete professional practice relevant to biological sciences; demonstrate qualitative methods to address real world problems in biological sciences, evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to biological sciences, evaluate Software platforms to address professional practice in biological sciences 1 Collaborate appropriate methods and experimental techniques to complete professional practice relevant to Biological Sciences Demonstrate qualitative methods 'g address real world problems in Biological ciences. Evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to Biological Sciences Evaluate software platforms to address professional practice in Biological Sciences 3"
    },
    {
        "image": "assessmentprogram1_synth_9_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Fremarsiy gest, ASSESSMENT PLAN: Begone (o_o Academic Program (Major, Degree ——| Program Information —___ Grow Front End Ini im OO Ph D a PhD. [Benariment or Prowram These Department [Division a College of Arts and Letters _| ee ‘Academic Year (when the plan will | begin. o area inprogress __| _ 2024 2022 _— -aneyTe example 9 (739 517 6958x215 —_ Program Mission Statement _ Freee a a The mission of the Surface Program in the Piece Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied skills. -— —__—— —_ __} _== Graduates will collaborate appropriate methods and ‘experimental techniques to complete professional practice relevant to biological sciences, demonstrate qualitative methods to address real world problems In biological sciences, evaluate appropriate methods and statistical analysis to complete laboratory jogical sciences, eval uate re platforms to settings relevant to biol ¢sional practice In biological sciences. ‘0 complete professional practice Student Learning Outcomes —_— address profe: \\h Collaborate appropriate methods and ‘experimental techniques sievanttoproiogical Soences, to address real world problems in Biological [a Demonstrate qualitative methods Sciences. Evaluate appropriate methods and statistical analysis to complete ~_ laboratory settings relevant to Biological Sciences. —___ [% Evaluate software platforms to agaress professional practice in Biological WL ="
    },
    {
        "image": "assessmentprogram1_synth_9_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Fi LC \"Givershty ASSESSMENT PLAN: icky Rierclrure Program Information Grow Front End Initiatives Ph D. These Department College of Arts and Letters ‘Academic Program (Major, Degree Name) Degree Department or Program Division ‘Academic Year (when the plan will begin, or “alre. 2021 2022 Contact Person Name I Samantha Mosley Title De Engineered Composite Synergy Department Foot Dept Email Address ashley78 example org Phone (739 517 6958x215 Program Mission Statement The mission of the Surface Program in the Piece Department is to prepare students for professional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrates theoretical foundations with applied skills. Student Learning Outcomes Graduates will collaborate appropriate methods and experimental techniques to complete professional practice relevant to biological sciences, demonstrate qualitative methods to address real world problems in biological sciences, evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to biological sciences, evaluate software platforms to address professional practice in biological sciences 1 Collaborate appropriate methods and experimental techniques to complete professional practice Televantto Biological Soences, 2 Demonstrate qualitative methods to address real world problems in Biological Sciences. 3 Evaluate appropriate methods and statistical analysis to complete laboratory settings relevant to Biological Sciences ‘Evaluate software platforms to address professional practice in Biological Sciences"
    },
    {
        "image": "assessmentprogram1_synth_9_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Fieet 9 PLO aiversity ASSESSMENT PLAN: ays Grow Front End initiatives. a pho. These Department calege of As and LORE _ 4 “The mission of Department Is to prepare practice, advanced study, providing a rigor Ous curriculu theoretical foundations with ap Graduats we quantalive 1 M cos evaiite vate sottings vat gadress protessione) practice in proiogtcal S jh ‘Copapoete Bette rca ane 1. eer ea Dew 2 Demonstrate quatitative methods [tng qeat word problems in Biclogicat ie Evaluate approptiat® mnatinods ond sistical aralysi® (© complete jeboratory sentings. relevant Io Rogie) Sciences. ofessione! practice if Biological Fao Evaluate software plesforms to address PF"
    },
    {
        "image": "assessmentprogram1_synth_9_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Fi pversite™ | Synergate ASSESSMENT PLAN: Segoe Program Information Acade' Program (Major, Deg: tee gs [Name \"BREE Grow Front End Initiatives [vere Ph D. Department or Program These Department Devston College of Arts and Letters begin or avedy inprogesr) 2021 2022 Contact Person [Name ‘Samantha Mosley [Tee _ _| __De Engineered Composite Synergy Department Foot Dept. [Ema Adres estieyTaQexample ory Phone (739 517 6958x215 Program Mission Statement The mission of the Surface Program in the Piece Department is to prepare students for professional practice, advanced study, and civic engagement by roviding a rigorous curriculum that integrates heoretical foundations with applied skills. _ _ — i 1 [2 i in Graduates will collaborate appropriate methods and experimental techniques to complete professional practice relevant to biological sciences; demonstrate qualitative methods to address real world problems in biological sciences; evaluate appropriate methods and statistical analysis to complete laboratory ‘settings relevant to biological sciences; evaluate software platforms to address professional practice in biological sciences. c 0 Collaborate appropriate metnods and experimental techniques o complete professional practice Demonstrate qualitative methods gaddress real world problems in Biological iences. Evaluate appropriate methods and statistical sis to complete laboratory settings relevant to Biological Sciences. Evaluate software platforms to address professional Practice in Biological |"
    },
    {
        "image": "assessmentprogram1_synth_9_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Freeman PLO Ghiversity SSMENT PLAN: 7 grim eatin Grow Front End init These Department of Ars and Letists ic Pragram (Major, C O22 Prarie Samantha Mosley 4 Composite ‘Bone (grim Mission Statement “The mission of the Surface Program in the Piece Department is io prepare students for orafessional practice, advanced study, and civic engagement by providing a rigorous curriculum that integrales theoretical foundations with applied ski ‘Siadent Learabug Dutzeins PS Evaluate appropriate methor laboratory soitings sologicn!"
    },
    {
        "image": "assessmentprogram2_synth_11_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Vincent Harrington and Hayes University Assessment Report for Academic Programs Department Schoal Collesa: Top Program People School of Customer Contact email address; Stefanie Walters lindaalvarez mcqguire com Program: Contact Percon: Program Information Who president Past church address more. Along they outside sing. Mission Statement Progra The Ge; m Description (Max. 7000 chars) neral Program in the Let Department Prepares students with a bal placed on experiential learning, industry coll readiness. r ‘anced curriculum combining fieory and applied practice, Emphasis is laboration, and development of critical thinking and professional communication skills to support career i Learning Outcomes Graduates will evaluate software platforms to address community engaged work in business analytics; analyze core business analytics concepts and statistical analysis when solving case Studies; collaborate Core business analytics Concepts and siatistical analysis when Solving research pro ects; communicate core business analytics concepts and echniques to address research projects in business analytics experimental techniques when solving laboratory Settings; apply experimental Program Learning Outcomes a Ss written in current Roepiauez Carter Catalog: Evaluate Software platforms to address community- €ngaged work in Business Analytics. SLO 2 Analyze core business as concepts and statistical analysis when Solving case studies. ytics concepts and statistical analysis when solving research Projects. SS analytics concepts and ex when solving laboratory settings techniques to address rese Analytics. Communicate core busine perimental techniques SLO 5- Apply experimental arch projects in Business (ADD MORE SLos AS NEEDED) “Success Outcomes” (Optional) Success Outcomes include measurable gains in retention an rates, increased student engagement, and en emonstrated through internshi S and capsto €ct outcomes. 1- Evaluate software platforms to address communit engaged work in Business Analytics. 2- Analyze core business anal tics concepts and statistical a if p d graduation hanced employability ne pro nalysis when Solving Case studies. 3- Collaborate core business analytics Concepts and statistical] analysis when solving research __ projects."
    },
    {
        "image": "assessmentprogram2_synth_11_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Vincent Harrington and Hayes University Assessment Report for Academic Programs Department School College: Top People School of Customer Stefanie Walters Program: Contact email address: Contact Person: lindaalvarez mcguire com Program Information Who president past church address more. Along they outside sing. Mission Statement Program Description (mex. 7000 chars) anced curriculum combining theory and applied practice. Emphasis is communication skills to support career ares students with a bal: C of critical thinking and professiona placed on experiential learning, industry collaboration, and development The General Program in the Let Department prep: readiness. ‘ce i Learning Outcomes Graduates will evaluate software platforms to address community engaged work in business analytics; analyze core business analytics concepts and statistical analysis when solving case studies; collaborate core business analytics concepts and statistical analysis when solving researc! rojects; communicate core business analytics concepts and experimental techniques when solving laboratory settings; apply experimental echniques to address research projects in business analytics. ‘odriguez Carter catal og: Program Learning Outcomes as written in current Poqjeiersi SLO1- Evaluate software platforms to address community engaged work in Business Analytics. SLO 2 Analyze core business analytics concepts and statistical analysis when solving case studies. SLO 3 Collaborate core business analytics concepts and statistical analysis when solving research projects. sLO 4- Communicate core business analytics concepts and experimental techniques when solving laboratory settings. Apply experimental techniques to address research projects in Business Analytics. SLO 5 (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in retention and graduation rates, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. 1- Evaluate software platforms to address community engaged work in Business A 2- Analyze core business analytics concepts and statistical analysis when solving case studies. re business analytics concepts and statistical analysis when solvin projects nalytics. 3- Collaborate co! g research"
    },
    {
        "image": "assessmentprogram2_synth_11_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Vincent Harrington and Hayes University Assessment Report for Academic Programs Program: Department School Collese: Top Program People School of Customer Contact Person: Contact email address: Stefanie Walters lindaalvarez mcguire com Program Information Who president past church address more. Along they outside sing. Mission Statement Program Description (max. 7000 chars) The General Program in the Let Department prepares students with a balanced curriculum combining theory and applied practice. Emphasis is placed ‘on experiential learning, industry collaboration, and development of critical thinking and professional communication skills to support career teadiness. “Learning Outcomes” Graduates will evaluate software platforms to address community engaged work in business analytics; analyze core business analytics concepts and statistical analysis when solving case studies; collaborate core business analytics concepts and statistical analysis when solving research ae ee communicate core business analytics concepts and experimental techniques when solving laboratory settings; apply experimental lechniques to address research projects in business analytics. Program Learning Outcomes as written in current Rodiiguersee _ catalog: SLO1- Evaluate software platforms to address community engaged work in Business Analytics. SLO2- Analyze core business analytics concepts and statistical analysis when solving case studies. Collaborate core business analytics concepts and statistical analysis when solving research projects. 1 Communicate core business analytics concepts and experimental techniques when solving laboratory settings. Apply experimental techniques to address research projects in Business Analytics. SLO 3 SLO 4 SLO 5 (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in retention and graduation rates, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. 1- Evaluate software platforms to address community engaged work in Business Analytics. 2- Analyze core business analytics concepts and statistical analysis when solving case studies. 3- Collaborate core business analytics concepts and statistical analysis when solving research projects."
    },
    {
        "image": "assessmentprogram2_synth_11_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Vincent Harrington and Hayes University Assessment Report for Academic Programs Top Program Stefanie Walters Program: Department School Collece: People School Contact email address: indaalvarez meqguire com Contact Percan: of Customer Program Information Who president past church address More. Alo ng they outside sing. Mission Statement p rogram Description (Max. 7000 chars) The General Program in the Let Department Prepares students with a balanced Curri placed on experiential learning industry Collaboration and develop readiness culum combining sheory and applied Practice Emphasis is ment of critical thinking and professiona’ commu: nication skills to support Career munity: €ngaged work !n business analytics. analyze core business analytics concepts s s ‘ollaborate Core business analytics concepts and Statistical anal 5 cate core business analytics concepts and experimental techniques when Solving laborat tec Niques to add eSs research Projects in business analyti Program Learning Outc: Nalytics concepts and Solving research projects. Communicate core busine utcomes” (Optional) lude Measurable gains in retention and g INCreased Student engagement, and enhan Monstrated through j and Capstone ced emplo abilit Mships roject cut Y"
    },
    {
        "image": "assessmentprogram2_synth_11_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Vincent Harrington and Hayes University i fa | Department /School Collese: Program: _ Top Program ____ People School of Customer Contact Parsan: Contact email address: i Program information Who president past church address more. Along they outside sing. catalog: as written in current Program Learning Outcom [sto1- ; Analyt software platforms i at SLO 2- siness analytics concepts and st solving case studies SLO 3- Collabore sig. 4- Communicate core business analytics concepts when solving laboratory {ADD MORE SLOs AS NEEDED) i “Success Outcomes” (Optional) Success outcomes include measurable gains in retention and graduation rates, increased student engagement, and enhanced emp loyabliity demonstrated through internships and capstone project outcomes. dress commun e core b 18s analytics concepts and statistical ana solving sti ;"
    },
    {
        "image": "assessmentprogram2_synth_12_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Sandoval Estrada University Assessment Report for Academic Programs a nna Program: Department School Cou age: __o Character Program ___i School of Activity Contact Percan: Contact email address: 7 Jeremiah Martin iimethy79 grant. org 1 Program Information Office current message standard. Mission Statement Program Description cueax 7000 chars) Program Learning Outcomes: as 5 written i in n current SLO 1- Appiy core softw SLO2- Demonstrate core software engine neering one septs and statistical analys when solving resea acts ects SLO 3 Synthesize appropriate methods and experimen ital techni iques to complete a capstone projects relevant to Sofiware Engineeri ing. Ex 4- Collaborate effectively in tearns and adnere to professional and ethical enn nine annie standards. SLO 5 Engage in continuous professional development and lifelong learning. [ni nto entertain none (ADD MORE 5LOs AS NEEDED) ce “Success Outcomes” (Optional Success outcomes include measurable gains in research participation, increased student engagement, and enhanced employabillty demonstrat ed through internships and capstone project outcomes. sflware: engineering concepts and q tative methods when oe qlaboratory tistical analysis Vil slving re i resear ods and exper menial te te niques o compiel nt io Softwar jineering. are ENGIN ee One projects"
    },
    {
        "image": "assessmentprogram2_synth_12_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Sandoval Estrada University Assessment Report for Academic Programs Department School College: Character Program School of Activity Program: Contact Person: Contact email address: Jeremiah Martin timothy79 grant org Program Information Office current message standard. Mission Statement Program Description (max. 7000 chars) The Responsibility Program in the Interview Department prepares students with a balanced curriculum combining theory and applied practice. Emphasis is placed on experiential learning, industry collaboration, and development of critical thinking and professional communication skills to support career readiness. “Learning Outcomes” Graduates will apply core software engineering concepts and quantitative methods when solving laboratory settings; demonstrate core software engineering concepts and statistical analysis when solving research projects; synthesize appropriate methods and experimental techniques to complete capstone projects relevant to software engineering. Program Learning Outcomes as written in current [ngs catalog: SLO 1- Apply core software engineering concepts and quantitative methods when solving aboratory settings. SLO2- Demonstrate core software engineering concepts and statistical analysis when solving research projects. SLO 3 Synthesize appropriate methods and experimental techniques to complete capstone projects relevant to Software Engineering. SLO4- Collaborate effectively in teams and adhere to professional and ethical standards. SLO 5 Engage in continuous professional development and lifelong learning. (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in research participation, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. 1- Apply core software engineering concepts and quantitative methods when solving laboratory settings. 2- Demonstrate core software engineering concepts and statistical analysis when solving research projects. 3- Synthesize appropriate methods and experimental techniques to complete capstone projects relevant to Software Engineering."
    },
    {
        "image": "assessmentprogram2_synth_12_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Sandoval Estrada University Assessment Report for Academic Programs Program: Department School Collese: School of Activity Contact email address: timothy79 grant org Character Program Contact Percsan: Jeremiah Martin Program Information Office current message standard. Mission Statement P The Responsibility Program in the Interview Department p Emphasis is placed on experiential learning, industry coll support career readiness. rogram Description (max. 7000 chars) Tepares students with a balanced curric! ulum combining theory and applied practice. aboration, and develop! i ment of critical thinking and professional communication skills to “Learning Outcomes” Graduates will apply core software engineering concepts and guantitative methods when Solving laboratory settings; demonstrate core software paineeting concepts and statistical analysis when solving research projects; synthesize appropriate methods and experimental t i ‘echniques to complete capstone projects relevant to software engineering. Program Learning Outcom és as written in current Cniveretty catalog: SLO 1- Apply core software engineering poncepts and quantitative methods when solving aboratory settings. Demonstrate core software engineering concepts and statistical analysis when solving research projects. SLO 3 Synthesize appropriate methods and experimental techniques to complete capstone projects relevant to Software Engineering. SLO4- Collaborate effectively in teams and adhere to professional and ethical standards. Engage in continuous professional develo (ADD MORE SLOs AS NEEDED) SLO 2 SLO 5 pment and lifelong learning. “Success Outcomes” (Optional) quantitative methods when Solving laboratory settings. 2- Demonstrate core software engineering concepts and statistical analysis when solving research projects. 3- Synthesize appropriate methods and experimental techniques to complete capstone Projects relevant to Software Engineering"
    },
    {
        "image": "assessmentprogram2_synth_12_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Sandoval Estrada University Assessment Report for Academic Programs Program: Department /School College: Character Program _ __| School of Activity ont apart i Contact email address: | Jeremiah Martin timothy79 grant org Program Information Office current message standard. OOF scep s ary S se Siallstice ti istic: ical analysis i SLO 2- Demonstrate ore software engi neering concepts and st Pee when solving research projects. sto 3- Synthesize appropriate methods and experimental techni iques fo complete — capstone projects relevant to Software rsd 4 SLO4- Collaborate effectively in teams and adhere to professional and ethical Dee nn ENG SS. \\— 3° Engage in continuous professional development and lifelong learning. aan Se Nanna nia alana nanan ena a nea (ADD MORE Sis AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in research participation, increased student engagement, and enhanced emplo yabi ility _demo nstrated through internships and dleapste one ne Project OL outcomes ems) ngir neering concepis ra Apply core sofiwa strate core software engineering concepis an when solving t esearch ae ie capstone pr"
    },
    {
        "image": "assessmentprogram2_synth_12_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Sandoval Estrada University Assessment Report for Academic Programs SS TO ay Program: Department Scheol Colleze: os\" Character Program |___I School of Activity Contact Parson: Contact email address: L Jeremiah Martin timothy 79¢ OE @grant. it org Program Information Office current message standard. 00 ci! Mission Statement Program BELT ui g SLO2- Demonstrate core software engineering concepts and statistical analysis ____when solving r resear rch projects. hesize appropriate methods and experimental techniques to complete . capstone projects relevant to Software Engineering. 4 St04- Collaborate effectively in teams and adhere to professional and ethical $ _ ar “Success Outcomes” (Optional) Success outcomes include measurable gains in research participation, increased student engagement, and enhanced aeeeia lity demonstrated srough in Jasons wes and ie Capstone ect cams S Apply core soft eri i |3- s L"
    },
    {
        "image": "assessmentprogram2_synth_13_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Jennings Sutton University Assessment Report for Academic roe _ _ \"Voice Schoo! of ‘Cultural _ i if Contact Percen: Contact email address: Arnanda Martinez bathbooth aross con Le oeeerentnten inten naineteenr etnies __ lizabethbooth gross com Program information Year strong be. Step seat we soldier either Mission Statement Program Description (max 700 Learning Outcomes” s fware p plation : mien Publi. ne te ‘methods and industry- orojects relevant to Pi isto3- Design apy propriate methods and exoerimenital techniques to como ase studies relevant to Public Health. 4 Synthesize approp pr late meth nds and statistical analysis to complete a ses Public Health Demonstrate industry standard tools to address professional pra i _ Public Health |(a00 MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success 0 outcomes include measurable gains in inte mship completion rates, increased student engagement, and enhanced employabil ity demons nstrated Jhrovgh Mele. ee and caps stone pri roject outcomes. stat ridard tools to Publi ic Health."
    },
    {
        "image": "assessmentprogram2_synth_13_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Jennings Sutton University Assessment Report for Academic Programs Program: Department School College: Voice School of Cultural Contact email address: elizabethbooth gross com Time Program Contact Percan: Amanda Martinez Program Information Year strong be. Step seat we soldier either. Mission Statement Pro The To Program in the East Department on experiential learning, indust teadiness. gram Description (max. 7000 chars) prepares students with a balanced curriculum combining theory and applied practice. Emphasis is placed ry collaboration, and development of critical thinking and professional communication skills to support career “Learning Outcomes” Graduates will collaborate a; t 2 appropriate methods and software platforms to complete Capstone projects relevant to public health; communicate appropriate methods and in lustry standard tools to complete research Projects relevant to public health; design appropriate methods and experimental techniques to complete case studies relevant to public health; synthesize Sp proPnEt methods and statistical analysis to complete case studies relevant to Public health; demonstrate industry standard tools to address professional practice in public health. Program Learning Outcomes as written in current Onebk Catalog: SLO 1- Collaborate appropriate methods and software platforms to complete capstone projects Communicate appropriate methods and industry standard tools to complete research projects relevant to Public Health. SLO3- Design appropriate methods and experimental techniques to complete case studies relevant to Public Health. SLO4- —Synthesize appropriate methods and Statistical analysis to complete case studies relevant to Public Health. SLO5- Demonstrate industry standard tools to address professional practice in SLO 2 (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in internship completion rates, increased student engagement, and e nhanced employability demonstrated throu h internships and ca Stone project outcomes. 1- Collaborate appropriate methods and software platforms to complete capstone projects relevant to Public Health. 2- Communicate appropriate methods and industry standard tools to complete research projects relevant to Public Health. 3- Design appropriate methods and experimental techniques to complete case studies relevant to Public Health."
    },
    {
        "image": "assessmentprogram2_synth_13_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Jennings Sutton University Assessment Report for Academic Programs Proeram: [Bepartment school Coltees _______Time Program __ __ ete School of Ci uitural Contact Paersan: Amanda Martinez Program Information Year strong be. Step seat we soldier either. a ik Mission Statement Program Description Program Learning Out tcomes as written in current Catalog: [sto i- ate appropriate methods and software ola atform ic complete capstone projects L fe ff levarit to Public Health enn Cornmunicate appropriate ir vethods and industry standard tools to compiete i projects relevant to Public Health. eee sto 3- Design appropriate methods and experimental techniques tocomplete tac case studies relevant to Public Heal Ith. | StO4- Synthesize appropriate methods and statistical analysis to cor mplete ee case Studies relevantto Public Health, $LO 5 Demonstrate industry standard tools to address professional practice in ee Public. Health | {ADD MORE 5LOs AS NEEDED) beeen emanating warner nn nana “Success Outcomes” (Optional) Success outcomes include measurable gains in i niernship completion rates, increased si Scot engagement, and enhanced employability demonstrated through internships and Capstone BIGSC! oulce 3- Collaborate appropriate methods and software pi i relevant fo Public He i2- Communicate appropriate methods and indusiny standard tools to i complete research projects rel ua 3- Design appropriate methods and experimental techniq ne elevant to Public Health,"
    },
    {
        "image": "assessmentprogram2_synth_13_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Jennings Sutton niversity €port for Academic Programs _ Depart ent Schooi Coliese: Time Program mays Voice School Of Cultural Contart Person: Contact email adidrass: eli Zabethbooth gross com Program Information Program: Amanda Martinez The To Program A %t Drepares Studenis wil On experiential learning, industry collaboratio; readiness, Ory and @ppiied Practice, Emphasis is placed sional communication Skills to Support career “ek i 33 Learning Outcomes Sraduates will Dropriate methods ang Software and ing ustry standard experimental techniques Collaborate a Sppropriate methods platforms to complete Capstone Projects relevant to public heaith: communicate tools to compiete fesearch projecis relevant to public heaith: design &Ppropriate methods and URS to completa Case studias televant to Public health: synthesize 2ppropriate methods ang Statistical analysis to complete Case studies relevant to Public health: demonstrate industry standard tools to address Professions} Practice in public health, Program Learning Outcomes aS Written in cy Trent Hills tu catalog Wn ni ers SLO1- Collaborate &ppropriate Methods and Software Diatforms to co) SLO 2 ; Mpiete capstone Projects eee f eee Communicate appropriate Methods ang industry standarg tools to complete research projects relevant to Public Health, ayn ods and experimental techniques to complete Case studies relevant to Public H Synthesize €ppropri €alth. rate methods and Statistical analysis to complete a fr alth. ne Demonstrate industry standard tools to address Professiona} Practice jn MORE SLos As webaay ——~Publc Hea °* Pessoal practice in {apa MORE SLOs AS NEEDED} “Success Outcomes” {Optional} outcomes include M asurable gains in internshi P Completion d tudent Engagement, and enhanced Employability Monstrated through internships and capstone roject Outcomes hods and software platforms to complete capstone Drojects a ommunicate appropiate Public Health °° Le Communicate appropriate ndustry standard tools to vant to Public Health. a ee"
    },
    {
        "image": "assessmentprogram2_synth_13_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Jennings Sutton University Assessment Report for Academic Programs mem cenmen oT Program: enpong | Department School Collese: Time Program _ ___ Voice School of Cultural nc SERRE Contact Persnn: Contact emall address: | Amanda Martinez 7 elizabethbooth gross com Program information Year strong be. Step seat we soidier either. Mission Statement Program Description aay. rocc chars) r SLO 1 Le Collaborate rate appropriate methods and software platforms to c a televantto Public he; alti. iSLOZ- Communicate appropriate methods a nd i ius indard tools to complete ; reh_prois |S 03- Design appropriate methods and exper imental tec nniques to complete semen case studies relevant to Public Health 4 SLO4- Synthesize appropriate methods and statistical analysis tocomplete i uot te {to F me ipl “Success Outcomes” {Optional) Success outcomes include measurable gains in internship completion rates, increased student erstips and and stone pro employability omes. 2 Communicaie aopropriate metho sds and i ry standard toois to oe _compiete research projects relevant io Public Health. i e studies ullic. Health I gn appropriate methods and exp 5 to complete co __relevant ta."
    },
    {
        "image": "assessmentprogram2_synth_14_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Park Pearson and Bentley University Assessment Report for Academic Programs Program: | Departmant School Collece: ____Experience Program |“ simple Schooi of Especially | Contact Parsan: Contact email address: Lo Seth Stewart _____jessica74 sutton sanders com Program information Sound place change necessary professional close. Mission Stat in the Av ement Program Description onax. 7000 chars) nt pr if a iu and Hed are platforms to complete relevant to Softwar re Engineering. $L03- Dernonstrate appropriate methods and simulation models to complete research ——— projects relevant to Software Engineering. i 4 i 4 pony te in CALF i SLO 4 Analyze qualitative methods to address capstone projects in Software = in andard tools “Success Outcornes” (Optional) Success outcomes include measurable gains in retention and graduation rates, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. _ 4.) flware engineering concepts and quantitative methods when solving real world problems. ods tO S 4- Communicate core sc i '2- Evaluate appropriate methods and s _internships |"
    },
    {
        "image": "assessmentprogram2_synth_14_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Park Pearson and Bentley University Assessment Report for Academic Programs Program: Department School College: Experience Program Simple School of Especially Contact Person: Contact email address: Seth Stewart jessica74 sutton sanders com ——____ Program Information Sound place change necessary professional close. Mission Statement Program Description (ax. 7000 chars) The Reach Program in the Available Department prepares students with a balanced curriculum combining theory and applied practice. Emphasis is placed on experiential learning, industry collaboration, and development of critical thinking and professional communication skills to support career readiness «ec 7 Learning Outcomes Graduates will communicate core software engineering concepts and quantitative methods when solving real world problems; evaluate appropriate methods and software platforms to complete internships relevant to software engineering; demonstrate appropriate methods and simulation models to complete research projects relevant to software engineering; analyze qualitative methods to address capstone projects in software engineering; demonstrate core software engineering concepts and industry standard tools when solving laboratory settings. Program Learning Outcomes as written in current \"pesurtssae? catalog: SLO 1- Communicate core software engineering concepts and quantitative methods when solving real world problems. SLO 2 Evaluate appropriate methods and software platforms to complete internships relevant to Software Engineering. Demonstrate appropriate methods and simulation models to complete research projects relevant to Software Engineering. Analyze qualitative methods to address capstone projects in Software Engineering. SLO 5 Demonstrate core software engineering concepts and industry standard tools when solving laboratory settings. SLO 3 SLO 4 (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in retention and graduation rates, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. 1- Communicate core software engineering concepts and quantitative methods when solving real world problems. 2- Evaluate appropriate methods and software platforms to complete internships relevant to Software Engineering. 3- Demonstrate appropriate methods and simulation models to complete research projects relevant to Software Engineering."
    },
    {
        "image": "assessmentprogram2_synth_14_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "ark Pearson and entley niversity Assessment Rep ort for Academic Programs hool Collese: School of Esp ecially Department/ Sc Simple Contact email address: jessica74 sutto Program: Experience Program n sanders com Contact Person: Seth Stewart Program Information Sound place ch ssional close. Mission Statement! repares stud ange necessary profe Program Description (ax. 7009 crars) practice. Emphasis is ents with a balanced curriculum combining theory and applied hinking and professional communication skills to support career The Reach Program in the Available Department P! placed on experiential learning, industry collaboration, and development of critical tl readiness. iy 1 Learning Outcomes ‘ore software engineering concepts and quanti methods when solving real world problems; evaluate are platforms to complete internships re! evant to software engineering; demonstrate appropriate methods and ‘ects relevant to software engineering, analyze qualitative methods to address capstone projects in eering concepts and industry standard tools when solving laboratory settings. software engineering; are engin Program Learning Outcomes as written in current ingore catalog: SLO 1 Communicate core software engineering concepts and quantitative methods when solving real world problems. Evaluate appropriate methods and software pl internships relevant to Software En iate methods and simulation models to Demonstrate appropr projects relevant to Software Engineering. thods to address capstone projects in Software communicate c thods and softw: Graduates will plete research proj appropriate mel simulation models. to com| plete atforms to com ineerin SLO 2 omplete research SLO 4- Analyze qualitative me Engineering. SLO 5 Demonstrate core software en ineering concepts and industry standard tools when so! ving laboratory settings. (ADD MORE SLOs AS NEEDED) 4 s” (Optional) “Success Outcome s in reten tion and graduation Success outcomes include measurable gain sed student engagement, and enhanced employability ips and capstone oiect outcomes. en solving rates, increa 1 demonstrated through internshi 1- Communicate core software engineering concepts and real world problems. 2. Evaluate appropriate methods and softwar internships relevant to Software Demonstrate appropriate methods and simulation models to complet relevant to Software Engineering. quantitative methods whi e platforms to complete Engineering. e research projects 3-"
    },
    {
        "image": "assessmentprogram2_synth_14_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Park Pearson and Bentley University ort for Academic Programs rtment School College: Program: Experience Program Simple School of Especially Contact email address: Contact Person: Seth Stewart jessica74 sutton sanders com Assessment Rep Depa Program Information Sound place change necessary professional close. Mission Statement Program Description (max. 7000 chars) ble Department prepares, students with a balanced curriculum combining theory and applied practice. Emphasis is i ment of critical thinking and professional communication skills to support career The Reach Program In the Availal industry collaboration, and develop laced on experiential learning, in readiness. 66 1 Learning Outcomes Graduates will communicate core software engineering concepts and Geen methods when solving real world problems; evaluate elevant to software engineering; demonstrate appropriate methods and__ ds to address capstone projects in appropriate methods and software platforms to complete internships I O 2eril cts relevant to software engineering; analyze qualitative metho C tandard tools when solving laboratory settings. simulation models to complete research proje C c ring; demonstrate core software engineering concepts and industry s' tcomes as written in Current \"pResrunverty® catalog: ering concepts and quantitative methods wh real world problems. SLO 2 Evaluate appropriate methods and software pl internships relevant to Software En s and simulation models to complete research Demonstrate appropriate method projects relevant to Software Engineering. Analyze qualitative methods to address capstone projects in Software software enginee! Program Learning Ou SLO 1- Communicate core software engin 4 en solving atforms to complete ineerin SLO 3 SLO 4 : Engineering. SLO 5 Demonstrate core software en ineering concepts and industry standard tools when solving laboratory settings. 4 _| (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) omes include measurable gains in retention and graduation ment, and enhanced employability d capstone project outcomes. methods when solving Success outc rates, increased student engage demonstrated throu h internships an re engineering concepts and quantitative Communicate core softwa real world problems. platforms to complete >. Evaluate appropriate methods and software pla relevant to Software Engineering. internships Demonstrate appropriate methods and simulation models to complete research projects relevant to Software Engineering. qa 3-"
    },
    {
        "image": "assessmentprogram2_synth_14_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Bark Pepyson and entley University Assessment Report for Academic Programs Program: | Department School Collese: __Experience Program “\"\"‘simpie School of Especially _ Contact Person: Contact email address: Seth Stewart jessica74 sutton sanders com a ee re ae en ninneenneeeestneneeeneateeearernteeeneeenrend Program information Sound piace change necessary professional close. Mission Statement Program Description (max. 7000 chars) The Reach Program in the Available Department prepares students with a balanced curriculum combining theory and applied practice. Emphasis is Piao on experiential learning, industry collaboration, and development of critical thinking and professional communication skills to support career readiness. 56 H Learning Outcomes Graduates will communicate core software engineering concepts and quantitative methods when solving real world problems; evaiuate appropriate methods and sofware platforms to complete internships re! evant to software engineering: demonstrate appropriate methods and simulation madets to complete research projects relevant to software engineering: analyze qualitative methods te address capstone projects in software engineering; demonstrate core software engineering concepts and indusiry siandard tools when solving laboratory settings. Program Learning Outcomes as written in current \"seus. catalog: SLO1- Communicate core software engineering concepts and quantitative methods when solving a 7 real world problems. SLO 2 Evaluate appropriate methods and software platforms to complete internships relevant to Software Engineering. Demonstrate appropriate methods and simulation models to complete research projects relevant to Software Engineering. i Analyze qualitative methods to address capstone projects in Software _ __ _ Engineering. _ _ 7 SLO 5 Demonstrate core software engineering concepts and industry standard tools when solving laboratory settings. _ _| {ADD MORE SLOs AS NEEDED) SLO 3 SLO 4- “Success Outcomes” (Optional) Success outcomes include measurable gains in retention and graduation rates, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. 1- Communicate core software engineering concepts and quantitative methods when solving _ real world problems. ee 4 2- Evaluate appropriate methods and software platforms to complete internships relevant to Software Engineering. _ 3 Dernonstrate appropriate methods and simuiation models to complete research projects relevant to Software Engineering."
    },
    {
        "image": "assessmentprogram2_synth_15_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Boyd Inc University Assessment Report for Academic Programs a ___Environmental Studies. ogee Engage in continuous professional development nn (ADD MORE 5LOs AS NEEDED) | eS re TN istha Seuiacene |_____ Coach Program “while School of Edge i Contact Persen: i Contact email eH EEeR John Kelly brownlinda mathews com ‘errr roncmenen annem renneteon unre iin orem cin emrnrnaneininiatecnehneenn rotons roman ee ntrnnnnnntnetunwstrecetnnemtesnrensamnan Program information General various deal great finish. Understand memory discuss lay information. Mission Statement Program Description oa “Learning Outcomes” SLO 2 Demonstrate qualitative methods to address real world ae ems in 1 SS Mieseeie Sa SLO 3 Synthesize appropriate methods and inc dustry standard tocis to complete oar real world filet ems relevant to Environmental Studies. 4 SLO4- Demonstrate simulation models to address professional practice in “Success Outcomes” (Optional) Success outcomes include measurable ga ins in capstone project quality, increased el eng jagement. aie e Hancee ee aly E Commu inicate software platforms to 0 address case studies i |2- Demonstrate qualitative methods to address real world problems ene in Eavironmenial. Studis ies. ee 3- Synthesize appro i"
    },
    {
        "image": "assessmentprogram2_synth_15_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Boyd inc University Assessment Report for Academic Programs Program: Department School C ollege: —_ Coach Program While School of Edge | Contact Percon: Contact email address: Le __brownlinda mathews com _| Program information General various deal great finish. Understand memory ciscuss lay information ms to addr SUEETI SEN VErDUpEUEINDToma ropri iate meth ‘ods and aucty. -standard tools to cornplete real world oroblems relevant to Environmental Studies. [sio4- Demonstrate simulation models to address professional practice in 2 ntal Studies. _ SLO 5 neeee in continuous profes |2- Demonstrate qual iitative methods to address real world prob lems _in Environmenial Studias a y standard toois to camplete real world “Success Quicomes” (Optional) Success outcomes include measurable gains in capstone project quality, increased student engagement, and enhanced employability demonstrated through BASEL 2 and He SAeSIENe BES. “outcomes. poems la."
    },
    {
        "image": "assessmentprogram2_synth_15_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "oyd Inc University r Academic Programs cence i Assessment Report fo a eee ool of __ While Schoo! of Edge _ Vp rogram: Pree Coach Program | a Contact Persan: contact ernail address: brown ming nda@ saeco rman eon ner ee mathews ct com Program information reat finish. Ur nderstand memory discuss lay General various deal g information. Max. 7000 chars) Mission Statement Program Description as students nd development of sin Environmental S 1 Studi nunice ate software pie platforms 1 Semonstrate qualitative 0 methods to address real- -wortd problems n a, Em nvironmental Studies —___— problems ~~ Synthesize appropriate methods and industry- _standard tools to complete iworld problems relevant fo Environmental Studies. pemonsti vate simulation models to address f professional pt ractic ae ronmental S Studies... -______—— development and i fifetiong 4 cein eeceernercrnc H rofess! ional eGuccess Outcomes” (Optional) outcomes incl jude measurabie gains in caps enhanced empioyal tone proje ect quality, bility Success increased student “engagement, and demonste ips and, capstone or rjeet ou ee ass through int interns e software pk latforms to address case studie ds to addr ess real ==monetrate qual es n Envir ironmental. ‘Studies. ete real- -world problett ns nid indusiTy- standard toals io compl ronmental Studies. 13 Synthesize appropriate rare"
    },
    {
        "image": "assessmentprogram2_synth_15_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Boyd Inc University rt for Academic Programs Assessment Repo ne Department School Callere: Program: i\" Coach Program ____While School of Ecge contact email address: prownlinda mathews com__| John Kelly ee Contact Porcnn Program information General various dea! great finish. Understand memory discuss lay information. Mission Statement Pro res students and development gram Description im ced curriculum combining theo and professional ax. 7000 chars) id Emphasis is pI aced ort caree! anphed ica Main Deparimeni prepa Lindustry collaporation Gu “| earning Outcomes” sate software platforms to address in environmental studies. demonstrate ital studies: S nd ind sta d te priate meth d ntal studies: demons professio yal ion modeis io address env 1e Program Learning Outcomes a5 written in current Core eyy catalog: Im Learning OU Oren ae University 7 to studies in Environmental Studies. SLO 1- Communicate software platforms to address case §L02- Dernonstrate qualitative methods to address real world problems in Shud es _. i tandard tools to complete amental Studies. fessional practice in 4 ee SLO 3 Synthesize appropriate methods and industry s real world problems relevant to Enviro trate simulation models to address pro SLO 4 Demons 1 a ee Environmental Studies o SLO 5 Engage in continuous professional development and lifelong jearning. | (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) iect quality, easurable gains in capstone pro} t, and enhanced employability and ca stone project outcomes. tai Studies. Success outcomes include m increased student engagemen demonstrated through internships 5 case studies in Environmen 1- Communicate software platforms te addres STOO Oe (2- Demonstrate qualitative methods to address real world problems fo __ jn Enviranmente dies) 3 Synthesize appropriate methods and industry standare tools to complete real world problems ne relevant fo Environmental Studies aa"
    },
    {
        "image": "assessmentprogram2_synth_15_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Assessm Program: i i fade i te 1 Lo ohn Kelly brownlinda mathews com Program Information General various deal great finish. Understand m information. Program Learning Outcomes as written in ci SLO 1- SLO 3 Synthesize jp GH FTO While School ofEdge Mission Statement Program Description € software SL02- Demonstrate qualitative methods to address real world problems in appropriate methods and ind Boyd Inc University ent Report for Academic Programs Contact email address: rename nt te titra ranmtarnsecennn memory discuss lay _Satalog: —_hviroomental Studies y sta foals to compiste ms relevant to Environmental Studies. learning. “Success Outcomes” (Optional) Success outcomes inc increased student er i Communi lttative lude measurable gains in capstone project quality, gagement, and enhanced employability demonstrated through internships and cap: tone project outcomes. onmental Stud in Environmental Studies_ nd nda"
    },
    {
        "image": "assessmentprogram2_synth_16_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Castillo Butler University Assessment Report for Academic Programs Department/ School Callege: Accept School of It Contact email address: john30 turner rogers com Program: Likely Program Contact Person: Lindsey Johnson Program Information Effect throw space property agree lead phone fast. Mission Statement Program Description (max. 7000 chars) ing theory and applied practice. Emphasis is ror ts with a balanced curriculum combini port career development of critical thinking and professional communication skills to sup} t prepares studen' The Door Program in the Stay Departmen ‘collaboration, and placed on experiential learning, industry c readiness. “Learning Outcomes” Is to address internships in mechanical systems, communicate appropriate methods and software platforms to complete case studies relevant to mec! anical systems; synthesize experimental techniques to address s; design simulation models to address research projects in mechanical systems. community engaged work in mechanical system Program Learning Outcomes as written in current steer guna? catalog: Graduates will design simulation model: models to address internships in Mechanical Systems. SLO 2- Communicate appropriate methods and software platfoe to complete case studies relevant to Mechanical Systems. SLO3- Synthesize experimental techniques to address community engaged work in Mechanical Systems. ulation models to address research projects in Mechanic SLO 1- Design simulation al Systems. SLO4- Design sim SLO 5 Engage in continuous professional development and lifelong learning. (ADD MORE SLOs AS NEEDED) J “Success Outcomes” (Optional) Success outcomes include measurable gains in internship completion rates, increased student engagement, and enhanced employability demonstrated through internships and capstone roject outcomes. 1- Design simulation models to address internships in Mechanical Systems. >. Communicate appropriate methods and software platforms to complete case studies relevant to Mechanical Systems. 3- Synthesize experimental techniques to address community engaged work in Mechanical Systems."
    },
    {
        "image": "assessmentprogram2_synth_16_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Castillo Butler University Assessment Report for Academic Programs Department School College: Likely Program Accept School of It Program: Contact Person: Contact email address: Lindsey Johnson john30 turner rogers com Program Information Effect throw space property agree lead phone fast. Mission Statement Program Description (max. 7000 chars) The Door Program in the Stay Department RIE pate students with a balanced curriculum combining theory and applied practice. Emphasis is placed on experiential learning, industry collaboration, and development of critical thinking and professional communication skills to support career Teadiness. “Learning Outcomes” Graduates will design simulation models to address internships in mechanical systems; communicate appropriate methods and software platforms to complete case studies relevant to mechanical systems; synthesize experimental techniques to address community engaged work in mechanical systems; design simulation models to address research projects in mechanical systems. Program Learning Outcomes as written in current eter Gursant catalog: SLO 1- Design simulation models to address internships in Mechanical Systems. SLO 2 Communicate appropriate methods and software platforms to complete case studies relevant to Mechanical Systems. SLO3- Synthesize experimental techniques to address community engaged work in Mechanical Systems. SLO 4 Design simulation models to address research projects in Mechanical Systems. SLO 5 Engage in continuous professional development and lifelong learning. (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in internship completion rates, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. 1- Design simulation models to address internships in Mechanical Systems. 2- Communicate appropriate methods and software platforms to complete case studies relevant to Mechanical Systems. 3- Synthesize experimental techniques to padices community engaged work in Mechanical ystems."
    },
    {
        "image": "assessmentprogram2_synth_16_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Castillo Butler niversity ment Report for Academic Programs Department School Collece: Accept School of It Contact email address: johng0 turner rogers cOm Assess Program: Li kel Contact Person: Lindsey Johnson Program Information perty agree lead phone fast. Effect throw space pro Mission Statement es students with a bal tion, and developmen’ ON (Max. 7000 chars) theory and applied practice. Emphasis is ills to support career sional communication ski /Program Descripti culum combinin anced curt 9 rofes: The Door Program in the Stay Department repar laced on experiential learning, industry collabora t of critical thinking and Pp! readiness. iy 1 Learning Outcomes Graduates will design simulation models to address internships in mechanical systems; communicate appropriate methods and software pate ‘o complete case studies relevant to mec! anical systems; synthesize experimental techniques to address engaged work in mechanical systems, design simulation models to address research projects in mechanical systems. current ‘ater Burns ane catalog: community~ Program Learning Outcomes as written in ternships in Mechanical S ropriate methods and software eres to complete studies relevant to Mechanical stems. e experimental techniques to address community engaged work in Mechanical Systems. ress research project n models to address in Communicate apP case Synthesiz sin Mechanical Systems. sLO4- Design simulation models to add “Success Outcomes” (Optional) nship completion Success outcomes include measurable gains in inter rates, increased student engage ent, and enhanced employability demonstrated through internships and capstone project outcomes: 1- Design simulation models t Communicate appropriate case studies dress CO! Systems. synthesize experimental techni"
    },
    {
        "image": "assessmentprogram2_synth_16_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Castillo Butler University Assessment Report for Academic Programs Department School College: Likely Program Accept School of It Program: Contact Persan: Contact email address: Lindsey Johnson john30 turner rogers com Program Information Effect throw space property agree lead phone fast. Mission Statement Program Description (max. 7000 chars) The Door Program in the Stay Department prepares students with a balanced curriculum combining theory and applied practice. Emphasis is placed on experiential learning, industry collaboration, and development of critical thinking and professional communication skills to support career readiness. “Learning Outcomes” Graduates will design simulation models to address internships in mechanical systems; communicate appropriate methods and software platforms to complete case studies relevant to mechanical systems; synthesize experimental techniques to address community engaged work in mechanical systems; design simulation models to address research projects in mechanical systems. Program Learning Outcomes as written in current Baten Gursant catalog: SLO 1- Design simulation models to address internships in Mechanical Systems. SLO 2 Communicate appropriate methods and software platforms to complete case studies relevant to Mechanical Systems. SLO3- Synthesize experimental techniques to address community engaged work in Mechanical Systems. SLO 4 Design simulation models to address research projects in Mechanical Systems. SLO 5 Engage in continuous professional development and lifelong learning. (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in internship completion rates, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. 1- Design simulation models to address internships in Mechanical Systems. 2- Communicate appropriate methods and software platforms to complete case studies relevant to Mechanical Systems. 3- Synthesize experimental techniques to address community engaged work in Mechanical ystems."
    },
    {
        "image": "assessmentprogram2_synth_16_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "—. nner ny —_ Department Schaot Collacs, i ae L ikely Program _ —Accept School of it. ae Contact Porenn. Contact email addrass: i L Lindsey Johnson TY PORN Program Information Effe ct throw space I 2 St i learn: Design iMulation Communica Property agree Mission Statement Pro “Learning Outcon S fi c i ni models e &Ppropriate Mméthods and €@ lead phone fast, o Software Platform Sona EaS82 Sludies felevar fie Mechanical 2ystems. SLO 3. Synthesize experimental techniques f0 address community enga a rechanical Systems, SLO 4. Design Simulation models to address research Projects in Me b S10 5- Engage in continuous gen eatch Peles n Mecha SLO 5 Gé in continuous professional development ang lifelong ADR tan (ne and lifelong I (ADD MORE stos as NEEDED) “Success Outcomes” (Optionan Success outc OMeES include m rates, increased Stude demonstrated thro fasurable gains nt Engagement, an Jn internsh furner rogers. corm Se S$ to complete wl 9d work in chanical Systeme. i ip completion d ennanced employal lity sated through internships anid capstone project outcomes. a i- Design sinuj On models to address internships in Mechanical Systems. i 2- Communic are platforms to complete ical Systems. TK in Mechanica} /"
    },
    {
        "image": "assessmentprogram2_synth_17_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Roman Horne University Assessment Report for Academic Programs Department School College: _ Figure Program Contain School of Space _ Contact Persan: Contact email address: Margaret Cohen danie 03 ochoa barnes net Program: Program information Your artist spend themselves. Third mouth soon rate. Mission Statement Program Description (max. 7000 chars) Ps The Give Program in the Notice Department prepares students with a balanced curriculum combining theory and applied practice Emphasis is i placed on experiential learning, industry collaboration, and development of critical thinking and professional communication skills to support career L readiness. “Learning Outcomes” Graduates will analyze software platforms te address community engaged work in software engineering; dem concepts and siatistical analysis when soiving professional practice; communicate core software engineering concepts and software piatforrns when solving real world problems; apply core software engineering concepts and quantitative rsethodcs when solving capstone projects; communicate core software engineering concepts and simulation models when solving reai worid problems. Program Learning Outcomes as written in current MiMi Catalog: _ onstrate core software engineering SLO2- Demonstrate core software engineering concepts and statistical analysis _____when solving professional practice. Communicate core software engineering concepts and software platforms when solving real world problems. SLO 1 Analyze software platforms to address community engaged work in Software Engineering. ~ ees SLO 3 SLO 4- Apply core software engineering concepts and quantitative methods when 7 _ solving capstone projects. _ _ sLOS- Communicate core software engineering concepts and simulation models when _ ee solving real worid probiems. __ _ {ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in placement in relevant careers, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. 1- Analyze software platforms to address community engaged work in Software Engineering. 3. Demonstrate core software engineering concepts and statistical analysis ee _when solving professional practice. 3- Communicate core software engineering concepts and software platforms when soiving real worid problems. 7 _ |"
    },
    {
        "image": "assessmentprogram2_synth_17_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "a niversity Assessment Report for Academic Pr. rennet tenet ecancetenrtnnineennertnenney Roman Horne ograms Program: Department Schaol Collann pe Figur e Pr ogram | : 7 f art +—-Gontain School of Space _ | Contact Parcan: i Contact email address: i Margaret Cohen f vohen ae Caniel03 ochoa barnes net _ Program information Your artist Spend themselves. Third mouth SOON rate, Mission Statement Program 3 Wi Max, 706 Description 0 chars) at flware platforn Demonsira t€ core Softw rn enters are engineering 3g CONnCepts and s ___ when Solving Drofessional ractice. SLO 2. Communicate Core software en (Shgineering concepts and when Solving real worl WONd Problems. are engine tring concepts and qua _. —— Solving Capstone project Core softy, Apply core Softw _ ec “Success Outcom DUCCess Guicomes include Measurabi Careers, increased Student engageme es” (Optional) gains in placement in relevant gar nt and enhanced employability ated through intemships and <abSione project outcomes (3 § fatformes tg addrag commu State core Software engi 6 g Concept lanalysis a solving professional pra Core software engineering"
    },
    {
        "image": "assessmentprogram2_synth_17_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Roman Horne University Assessment Report for Academic Programs Department School College: Figure Program ___ Contain School of Space _ Contact Parcan: Contact email address: Margaret Cohen danielO3 ochoa barnes net Program Information Your artist spend themselves. Third mouth soon rate. Mission Statement Program Description (ax 7000 chars) The Give Program in the Notice Department prepares students with a balanced curriculum combining theory and applied practice. Ernphasis is placed on experiential feaming, industry collaboration, and development of critical thinking and professional communication skills to support career readiness. “learning Outcomes” Graduaies will analyze software platforms to address community engaged work in software engineering; demonstrate core software engineering concepts and statistical analysis when soiving professionai practice; communicate core software engineering concepts and software platforms when solving real world problems; apply core softwai neering concepts and quantitative methods when solving capstone projects; communicate core software engineenng concepts and simulation models when solving real world problems. Program Learning Outcomes as written in current sditifitidy catalog: SLO 1- Analyze software platforms to address community engaged work in Software Engineering. SLO2- Demonstrate core software engineering concepts and statistical analysis _ when solving professional practice. SLO 3 Communicate core software engineering spa and software platforms =| when solving real world problems. SLO 4 Apply core software engineering concepts and quantitative methods when Sli Capstone projects. _ S L05- Communicate core software engineering concepts and simulation models when ___ solving real world probierns. _ (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in placement in relevant careers, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. i- Analyze software platforms to address community engaged work in Software Engineering. 2- Demonstrate core software engineering concepts and statistical analysis __ when solving professional practice. 3- Communicate core software engineering concepts and software platforms when solving ____teal world problems."
    },
    {
        "image": "assessmentprogram2_synth_17_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Roman Horne niversity Assessment Report for Academic Programs Department School College: Figure Program Contain School of Space Program: Contact Persan: Contact email address: Margaret Cohen daniel03 ochoa barnes net Program Information Your artist spend themselves. Third mouth soon rate. Mission Statement Program Description (max. 7000 chars) The Give Program in the Notice Department prepares students with a balanced curriculum combining theory and applied practice. Emphasis is placed on experiential learning, industry collaboration, and development of critical thinking and professional communication skills to support career readiness. “Learning Outcomes” Graduates will analyze software platforms to address community engaged work in software engineering; demonstrate core software engineering concepts and statistical analysis when solving professional practice; communicate core software engineering concepts and software platforms when solving real world problems; apply core software engineering concepts and quantitative methods when solving capstone projects; communicate core software engineering concepts and simulation models when solving real world problems. Program Learning Outcomes as written in current sohf ihmgiy Catalog: SLO 1- Analyze software platforms to address community engaged work in Software Engineering. SLO2- Demonstrate core software engineering concepts and statistical analysis when solving professional practice. SLO 3 Communicate core software engineering Cone and software platforms when solving real world problems. SLO 4 Apply core software engineering concepts and quantitative methods when solving capstone projects. SLO 5- Communicate core software engineering concepts and simulation models when solving real world problems. (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in placement in relevant careers, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. 1- Analyze software platforms to address community engaged work in Software Engineering. 2- Demonstrate core software engineering concepts and statistical analysis when solving professional practice. 3- Communicate core software engineering oe and software platforms when solving real world problems."
    },
    {
        "image": "assessmentprogram2_synth_17_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "ji- bh a Roman Horne iniversity Assessment Report for A cademic Programs nnerenereneorerearancrnnrtnnatnhanenennereer ne, accent Program: Denartment School Catees d | |__Fi Figure Program _ |__Contain School of Space _| | Contact Parcon: Contact email address: Margaret Coh L ___Margaret Cohen ___Saniei03 ochoa- a bames. net Program Information Your a ist spend themselves. Third mouth soon rate. Mission StatementProgram Description (Max. 7600 cha SLO 2 ~ Demonstrate c core software engin neering Serra and statistical analysis . oe WEN SOLVING brofessi One! practice, i SLO 3- Communicate core software engineering concepts and software platforms i pa when so! ving real world problems. i SLO 4. Apply core software engineering concepts and quantitative methods when Soli ing capstone projects ae ——— $LO5- Communicate core software gineering concepts Simulation models when I (ADD MORE SLOT AE NESE Boluina real world iproblems. [ (ADD MORE SLOs AS NEEDED} “Success Outcomes” {Optional} Success outcomes include measurable gains in placement in relevant careers, increased student engagement, and enhanced emp! oyability demonstrated .d through internshi eS. and capstone pr roject outcomes. Analyze software platforms to addres Ngaged work in Software Engineering. i gineering concepis and statistical analysis onal practice. —"
    },
    {
        "image": "assessmentprogram2_synth_18_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Stanley LLC University Assessment Report for Academic Programs Department School College: Education Program Decade School of Might Program: Contact Person: Contact email address: Michael Cobb swhite eaton gonzalez com Program Information Down same offer dark. Mission Statement Program Description (max. 7000 chars) The Research Program in the Wait Department prepares students with a balanced curriculum combining theory and applied practice. Emphasis is placed on experiential learning, industry collaboration, and development of critical thinking and professional communication skills to support career readiness. “Learning Outcomes” Graduates will design core public health concepts and quantitative methods when solving community engaged work; collaborate appropriate methods and simulation models to complete laboratory settings relevant to public health; collaborate appropriate methods and experimental techniques to complete capstone projects relevant to public health. Program Learning Outcomes as written in current Sesestansaxy catalog: SLO 1- Design core public health concepts and quantitative methods when solving community engaged work. SLO 2 Collaborate appropriate methods and simulation models to complete laboratory settings relevant to Public Health. SLO 3 Collaborate appropriate methods and experimental techniques to complete capstone projects relevant to Public Health. SLO4- Collaborate effectively in teams and adhere to professional and ethical standards. SLO 5 Engage in continuous professional development and lifelong learning. (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in research participation, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. 1- Design core public health concepts and quantitative methods when solving community engaged work. 2- Collaborate appropriate methods and simulation models to complete laboratory settings relevant to Public Health. 3- Collaborate appropriate methods and experimental techniques to complete capstone projects relevant to Public Health."
    },
    {
        "image": "assessmentprogram2_synth_18_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Assessment Report for Academic Programs [rogram — _ ~T Bepart ments school! College: _ =\": Equoation Program Pst Decade Schoo! of Might contae Berson Contact email address: i ichael CO _ _ ___swhite@ @eaton go gonzalez com Program information Down same offer dark. Mission statementProgram ing uteomes 2 as woritten iF OOS e meth 1S ign core public healt i ont |_ __ ae ged WORK. a $l 2- Collab porate are sropriate ds nulation models eo aboratory S& te rel ayant 19 o Public Health. §L05 ce Golaborate appropri ie methods and “experimental ‘2 echniques to compe p——— capstone projects valevant t to Public Health. SLO 4 oliaborate effectively in faams and adhere to professional and ethical ats a i ae _SiBd ndands.-—- i jopm rent an id i 5 professional deve $LO5 A AS S NEEDED) L {ADo MORE s Toe \"(optional “Success Outcot jude meas surabie 2 ga ins in research h parti gement, and enhanc d empioyabil lity ps_anc and capstone pm project outcomes. __— ative “methods when solving Leonean 4 ich ipation, Success guicomes inc increased gil deni engag demons nsirated t through. ni niernshl design core Our rotic Health rop nriate aiory 3 Lie s and XY ah) ues fo CONT elf nods"
    },
    {
        "image": "assessmentprogram2_synth_18_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "stanley LLC University Assessment Report for Academic Programs nn sans ernest ny Prom: Department /Schoal Collese: Educatio on Program Decade School of Might eee ES W WEGEUe SONOUI OT NGI munity engaged Work. __| |2. Collaborate appropriate methods and simulation models to complete iaboratery settings relevant to Public Health. experimental techniques to c aiie Public Health. I Contact email address: ael Cobb ite eaton gonzalez com | ___ Swnke eaton¢ Sromiersanmieninemne Program information Down same offer dark. Graciuates will design c borat n core pu eal ith cor BS __semp Wwe i | SLO 2 Collaborate appropriate methods and simulation models to complete a ___ eboratery settings relevant to Public Health SLO 3 Coll Haborate appropriate methods and experimenta techniques to complete ferns capstone projecis relev ant to Public Health. 4 SLO 4- Collaborate effectively in teams and adhere to professional and ethical Slandards. | SLO 5 age in continuous professional development and lifelong learning. | {ADD MORE SLOs AS NEEDED) t EE “Success Outcomes” (Optional Success outcomes include measurable gains in researcn participation, increased student engagement, and enhanced employ abit ity demonstrated through internships and capstone project outcomes. _ ae Design core public health concepts and quantitative methods 5de when solvin (e] G )3- Collaborate appropriate methods and L"
    },
    {
        "image": "assessmentprogram2_synth_18_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Stanley LLC University Assessment Report for Academic Programs Education Program Contact Percan: Program: Department School Collese: Decade School of Might Contact email address: Swhite eaton gonzalez com Michael Cobb Program Information Down same offer dark. Mission Statement Program Description (ax. 000 chars) The Research Program in the Wait Department prepares students with a balanced i ining theory and applied practice. Emphasis is placed on experiential learning, industry collaboration, and development of critical thinkii icati readiness, nin current eson4 nvesty Catalog: Design core public health concepts and quantitative community engaged work. Collaborate appropriate methods and simulation models to laboratory settings relevant to Public Health. Collaborate appropriate methods and experimental techniques to complete capstone projects relevant to Public Health. SLO4- Collaborate effectively in teams and adher standards. SLO 5 Engage in continuous professional deve (ADD MORE SLOs AS NEEDED) methods when solving complete SLO 3 lopment and lifelong learning. 2- Collaborate appropriate methods and simulation models to complete laboratory settings relevant to Public Health. Collaborate appropriate methods and experimental techniq relevant to Public Health. 3- ues to complete capstone projects"
    },
    {
        "image": "assessmentprogram2_synth_18_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Stanley LLC University Assessment Report for Academic Programs Program: Department School College: Decade School of Might Contact email address: swhite eaton gonzalez com Education Program Contact Person: Michael Cobb Program Information Down same offer dark. Mission Statement Program Description (max. 7000 chars) The Research Program in the Wait Department prepares students with a balanced curriculum combining theory and applied practice. Emphasis is Plsced on experiential learning, industry collaboration, and development of critical thinking and professional communication skills to support career iness. “Learning Outcomes” Graduates will design core wales health concepts and quantitative methods when solving community engaged work; collaborate appropriate methods and simulation models to complete laboratory settings relevant to public health; collaborate appropriate methods and experimental techniques to complete capstone projects relevant to public health. Program Learning Outcomes as written in current NesenAgensand catalog: rickson University SLO 1- Design core public health concepts and quantitative methods when solving community engaged work. SLO 2 Collaborate appropriate methods and simulation models to complete laboratory settings relevant to Public Health. Collaborate appropriate methods and experimental techniques to complete capstone projects relevant to Public Health. 4 Collaborate effectively in teams and adhere to professional and ethical standards. Engage in continuous professional development and lifelong learning. (ADD MORE SLOs AS NEEDED) SLO 3 SLO 4- SLO 5- “Success Outcomes” (Optional) Success outcomes include measurable gains in research participation, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. Design core public health concepts and quantitative methods when solving community engaged work. Collaborate appropriate methods and simulation models to complete laboratory settings relevant to Public Health. riate methods and experimental techniques to complete capstone projects 3 _ Collaborate approp it to Public Health. 2-"
    },
    {
        "image": "assessmentprogram2_synth_19_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Glover PLC University Assessment Report for Academic Programs Program: ms, Department Schoot College: Cc amera Program |____ Much School of Decision Contact Percon: Contact email address: ae _ nreed richards- son com a ce Program information Today age pay these turn box, Mission Statem entv Program Oe SCHOTON imax. 7000 chars) r Se and software platforms to complete software 2 engineering. Design appropriate methods $s and sim on models to ce practice releva ntto S software Engine SLO4- Collaborate effectively in teams and adhere ta professional and ethical Ln “es _ ngage in continuous pro (ADD Mi ORE SLOs AS NEEDED) L “Success Outcomes” (Optional) maccess outcomes include measurable gains in retention and graduati on rates, increased student engagement, and enhanced employability ugh _dem onstrated t ihro internships and capstone project outcomes. laborate ap Hd p real world |2- Collaborate appropriate metho _ internships relevar nd software platforms 3 to compl ete “| Softw"
    },
    {
        "image": "assessmentprogram2_synth_19_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "Glover PLC University Assessment Report for Academic Programs Department School College: Camera Program Much School of Decision Program: Contact Person: Contact email address: Garrett Adams hreed richards larson com Program Information Today age pay these turn box. Mission Statement Program Description (max. 7000 chars) The Lose Program in the Important Department prepares students with a balanced curriculum combining theory and applied practice. Emphasis is placed on experiential learning, industry collaboration, and development of critical thinking and professional communication skills to support career Teadiness. “Learning Outcomes” Graduates will collaborate appropriate methods and quantitative methods to complete real world problems relevant to software engineering; collaborate appropriate methods and software platforms to complete internships relevant to software engineering; design appropriate methods and simulation models to complete professional practice relevant to software engineering. Program Learning Outcomes as written in current \"gliGacner catalog: SLO 1- Collaborate appropriate methods and quantitative methods to complete real world problems relevant to Software Engineering. SLO 2 Collaborate appropriate methods and software platforms to complete internships relevant to Software Engineering. SLO 3- Design appropriate methods and simulation models to complete professional practice relevant to Software Engineering. SLO4- Collaborate effectively in teams and adhere to professional and ethical standards. SLO 5 Engage in continuous professional development and lifelong learning. (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in retention and graduation rates, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. 1- Collaborate appropriate methods and quantitative methods to complete real world problems relevant to Software Engineering. 2- Collaborate appropriate methods and software platforms to complete internships relevant to Software Engineering. 3- Design appropriate methods and simulation models to complete professional practice relevant to Software Engineering."
    },
    {
        "image": "assessmentprogram2_synth_19_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Gloyer PLC University Assessment Report for Academic Programs Department School Colleze: Much School of Decision Contact email address: hreed richards larson com Program: Camera Program Contact Person: Garrett Adams Program Information Today age pay these turn box. Mission Statement Program Description (max. 7000 chars) The Lose Program in the Important Department prepares students with a balanced curriculum combining theory and applied practice. Emphasis is placed on experiential learning, industry collaboration, and development of critical thinking and professional communication skills to support career readiness. “Learning Outcomes” Graduates will collaborate appropriate methods and quantitative methods to complete real world problems relevant to software __ engineering; collaborate appropriate methods and software platforms to complete internships relevant to software engineering; design appropriate methods and simulation models to complete professional practice relevant to software engineering. Program Learning Outcomes as written in current 'giGagper catalog: SLO 1- Collaborate appropriate methods and quantitative methods to complete real world problems relevant to Software Engineering. SLO 2 Collaborate appropriate methods and software platforms to complete internships relevant to Software Engineering. Design appropriate methods and simulation models to complete professional practice relevant to Software Engineering. Collaborate effectively in teams and adhere to professional and ethical standards. SLO 5 Engage in continuous professional development and lifelong learning. SLO 3 SLO 4 (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in retention and graduation rates, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. 1- Collaborate appropriate methods and quantitative methods to complete real world problems relevant to Software Engineering. Collaborate appropriate methods and software platforms to complete internships relevant to Software Engineering. Design appropriate methods and simulation models to complete professional practice relevant to Software Engineering. 2- 3-"
    },
    {
        "image": "assessmentprogram2_synth_19_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Glover PLC University Assessment Report for Academic Programs a seas Program: rt Department School Calleze: ie A ca ____Camera Program Much School of Decision __ Contact Person: Contact email address: hreed richards larson com Program information Today age pay these turn box. Mission Statement Program Description (Max. catal og: ate real world proplems e pla orms to complete s nships rele, rel leven to Software elendiner ineerina. and simulation models to complete ‘professional ctice relevant to Software Engineering. J SLO4- Collaborate effectively in tearr 1s and é achere to professional and ethica Success outcomes include measurable gains in retention and graduation {ADD MORE SLOs AS NEEDED) rates, increased student engagement, and enhanced employabili ty demo onstrated i through internships and capston Lema roject outcomes. 4- Collaborate appropriate methods and quantit complete real wo! ar probleme relev Ute =i SLO 3 “Success Qutcomes” (Optional n modeis to compet profes Sesional pr e Engin"
    },
    {
        "image": "assessmentprogram2_synth_19_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Glover PLC University ademic Programs Program: C p i Department /Schoot Cotlane. i Coe mera Program ____ Much Schoo! of Decision Contact Parcan- Contact email address: Garrett Adams ae ——___ tt _ nfeed richards larson com Program information Today age Pay these turn box. (Max. 7000 chars) f The t he important Department place @Srning, indy rea HNGS: n theory and applied practice Emphasis is Stry coligboration Communication Skills fo Support career 6 3 Learning Outcomes 3 will collaborate appropriate methads 8nd Quantitative methods to ENGI collaborate Abpreprate methods @PPropriaté method ompiete real world Problems relevant to software 4nd sottware Dlatforms to complete int. DS relevant to soft Ware engineeri: 19; design S$ aNd Simulation models to complete Professionat Practice relevant ‘9 software engineering Program Learning Outcomes as Written in current MgtiGardner Catalog: pS el oS eT CUT e methods to ean SLOi- Collaborate appropriate methods and quantitative methods to complete real worid problems i a -——felevant {9 Software Engineering Seeereeeee| SLO 2 Collaborate &ppropriate methods and software Piatforms to complete i internships relevant to Software En insering,. SLO 3- Design &ppropriate mett See i models to complete professional . Practice relevant to Software Engineering. SLO 4 Collaborate effectively in teams and adhere to si professional and ethical (nnn Standards SLO 5 Engage in continuous professional development and lifelong lear ing. ad ———___ ee ne {ADD MORE SLOs AS NEEDED) 6s Success Outcomes” (Optional) Success outcomes include measurable gains in retention and graduation rates, strated Student enshpe en and enhanced employability eMonstrated t fough internships and ca st ees JSONPs a One project Outcomes, 1- Collaborate appropriate methods and quantitative methods to complete real world probleme a _felevan thode ep cameerng NS ener robioms 2- Collaborate appropriate methods and software platforms to complete a internships relevant to Software Engineering. S| 3- Design appropriate methods and simulation models to compiete Professional Practice i nnn relevant to Software Engineering. :"
    },
    {
        "image": "assessmentprogram2_synth_20_aug1.png",
        "label": "assessmentprogram",
        "ocr_text": "Green Lid University Assessment Report for Academic Programs |Protam: _ Department Schocl Collage: __ Time Program _____ West School of Blood 2 Contact Parsney: Contact emall address: i Travis Cole ashiey20 r. ussell jones. com Program Information First training friend interview physicai. j chars} ‘SLO 2- Apply quantitati vem ethods £0 address labor atory sett 4 Evaluate core pt ubl cal analysis when solving unity engaged work i is and qua alitative methods to o cornplete nt to Public Hea ah. i SLO 4 Design a oe 5 En age in continuous professional development a and lifelong learning. di g c (ADD MORE SL Os AS sS NEEDED) i \"Success Ouicomes” foptone Success outcomes include measurable gains in placement in rel evant careers, increased student engagement, and enhanced ermployability demonstrated through internsh 1S. and ecapsiens a t outcomes. i- Analyze experime LE n Public Fl i ie Apply qu lantitative methods t to address laboratory settit ings in cal analysis wi"
    },
    {
        "image": "assessmentprogram2_synth_20_aug2.png",
        "label": "assessmentprogram",
        "ocr_text": "University Assessment Report for Academic Programs Pron LEP en eee a Program Department /School Coltove: }.____ Time Program ~temgagllest School of Blood | Contact Parsan: Contact ema address: Lo —_ashiey 220 russelljones com _| Program information First training friend interview physical, ‘Learning Outcome foa wo j SLO 2. “Apply quanti ative mat thods io address laboratory setti ings in Public ne a ——Health Sto 3 3- jiuale core PUDdIiC health concents and Stalistica! analysis when sol P eon com nity. engaged wo | SLO 4- Design @D propriate San i methods ta complete i [ne ant to Publi Health SLO 5. Er gage in contin: ous Professiona} i H | (abo MG ORE FSLOs SAS NEEDED) “Succ CeSs Gutco Succes mes” {Optional} 8S Ouicomes In clude Measurable Gains in placemen Careers, increased student engagement, and enhanced e ms tin rel evant ppomonstrated 1 thr Ugh I stipes and cap pst Mployabi ity tcom les fone Proj lect ou to address laboratory Ve met tho ods to He address la ro Buble C health conce boron Seitings -Heaith. _"
    },
    {
        "image": "assessmentprogram2_synth_20_aug3.png",
        "label": "assessmentprogram",
        "ocr_text": "Green Ltd University Assessment Report for Academic Programs Department School Colleze: West School of Blood Contact email address: ashley20 russell jon Program: Time Program Contact Person: Travis Cole es com Program Information First training friend interview physical. Mission Statement Program Description (max. 7000 chars) students with a balanced curriculum combining theory and applied practice. Emphasis The Support Program in the Thought Department prepares a placed o rie s fr Fratlo king and professional communication skills to support is placed on experiential learning, industry collaboration, and development of critical thin career readiness. “Learning Outcomes” Graduates will analyze experimental techniques to address laboratory settings in public health; apply quantitative methods to address en solving community engaged laboratory settings in public health; evaluate core public health concepts and statistical analysis w work; design appropriate methods and qualitative methods to complete community engaged work relevant to public health. Program Learning Outcomes as written in current Bylleck Lie catalog: SLO1- Analyze experimental techniques to address laboratory settings in Public Health. SLO2- Apply quantitative methods to address laboratory settings in Public Evaluate core public health concepts and statistical analysis when solving community engaged work. 1 Design appropriate methods and qualitative methods to complete community engaged work relevant to Public Health. SLO 3 SLO 4 SLO 5 Engage in continuous professional development and lifelong learning. (ADD MORE SLOs AS NEEDED) “Success Outcomes” (Optional) Success outcomes include measurable gains in placement in relevant careers, increased student engagement, and enhanced employability demonstrated through internships and capstone project outcomes. 1- Analyze experimental techniques to address laboratory settings in Public Health. 2- Apply quantitative methods to address laboratory settings in Public Health. 3- Evaluate core public health concepts and statistical analysis when solving community engaged work."
    },
    {
        "image": "assessmentprogram2_synth_20_aug4.png",
        "label": "assessmentprogram",
        "ocr_text": "Green Lid University Assessment Report for Acaclernic Programs en nnn einer | Program: Oepartment School Collece: |_____Time Program west School of Blood Contact Persar: Contact email address: Lo Tes Cole ______ashley20 russelljones com_ Program information First training friend interview physical. Mission Statement Program Description 7000 chars} Program Learning Outcomes as written in ycurrent a | SLO 1- aes exper SLOZ- Apply quantitative m nethods to address laboratory settings in Public eee Healt cee a Isto 3 3- Evaluate core public health concepts and statistical analysis when solving een commun ity engaged work, | SLO 4 Design 2 apt propriate methods and quali tative methods to complete ommunit work relevant to Public H SLO 5 Engage in continuous profes :sional development and lifelong learning. “Success Outcomes” (Optional Success oulcomes include measurable gains in placement in relevant careers, increased student engagement, and er nhanced employability demonstrated tf nreugh internships and capstone project outcomes. laboratory settings In Public Health, | 2. Apply quantitative methods to address laboratory settings in ~Public_ Health Td i when solving ce tennant enn mrt ennai ean _"
    },
    {
        "image": "assessmentprogram2_synth_20_aug5.png",
        "label": "assessmentprogram",
        "ocr_text": "Gr Ltd University Assessment Report for Academic Programs Program: Department Schaol Collage: ____Time Pro Fam West School of Blood Contact Percon: Contact email address: | Travis Cole a shley20 russell jones com _| Program information First training friend interview physical, Mission Statement Program Description gyax. The Support Program in the Thought Depariment Prepares students with a balanced curriculum combinin is placed on experiential learning, industry collaboration, and development cf critical i career readiness. 7000 chars) y theory and applisd practice Emphasis thinking and professional communication skilis to support “Learning Outcomes” ques to address laboratory settings in public health; apply quantitative methods to address uate core public health concepts and statistical analysis when solving comrunity engaged and qualitative methods to complete community engaged work relevant to public heaith Program Learning Outcomes as wiiiten in current Bullock LEC catalog: CLO nnn ente “University Graduates wit! analyze experimental techni laboratory settings in public health; eval work; design appropriate methods Analyze experimental techni ques to address laboratory Settings in Public Health. Apply quantitative methods to address laboratory settings in Public SLO 3- Evaluate core public health concepts arid statistical analysis when solving community engaged work. Design appropriate methods and qualitative methods to complete _ community engaged work relevant to Public Health, Engage in continuous professional developmen ns SLO 5 (ADD MORE SLOs AS NEEDED) ee t and lifelong learning. “Success Outcomes” (Optional) Success outcomes include measurable gains in placement in relevant careers, increased student engagement, and enhanced employability demonstrated through internships and capstone roject outcomes. Analyze experimental! techniques to address laboratory settings in Public Heaith. ~~ _ tana oo race lahneatan nas Apply quantitative methods to address laboratory settings in —Public Health Evaluate core public health concepts and statistical analysis when solving a _community engaged work."
    }
]