[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "award",
        "ocr_text": "i Adarns Tyier institute CERTIFICATE OF ACHIEVEMENT This Certificate is Awarded to Julie Bryan Thank you for your dedication ar id hard work for the company So that we crown you as the best employee of the month. Deanna Hall Savannah Floyd Manager Secretary"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "award",
        "ocr_text": "0; dams Tyler y Institute “*\" CERTIFICATE an OF ACHIEVEMENT Julie Bryant Thank you for your dedication and hard work for the company so that we crown you as the best employee of the month. Deanna Hall Savannah Floyd Manager Secretary"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "award",
        "ocr_text": "Adams Tyler y arcttute CERTIFICATE peest ie OF ACHIEVEMENT This Certificate is Awarded to Julie Bryant hard work for the company Thank you for your dedication and ployee of the month. so that we crown you as the best em Savannah Floyd Deanna Hall Manager Secretary"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "award",
        "ocr_text": "Adams Tyler 0, Institute CERTIFICAT OF ACHIEVEMENT This Certificate is Awarded to Julie Bryant Thank you for your dedication So that wec and hard work for the company rown you as the best employee of the month. eee Savannah Floyd Deanna Hall Secretary"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "award",
        "ocr_text": "is) Adams Tyler i institute C EMPLOVEE s OF ACHIEVEMENT ee” This Certificate is Awarded to jon and hard work for the company st employee of the month. Deanna Hall Savannah Floyd Manager Secretary"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "award",
        "ocr_text": "os Inwith LLC PSH le BEST \\\\ crore OF ACHIEVEMENT tiflcate is Awarded to Thank you for your a and hard work for the company so that we crown you a3 the best employee of the month. Joshua West Joy Brown _ Manager Secretary"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "award",
        "ocr_text": "Cy nstuate ERTIFICATE OF ACHIEVEMENT ertificate is Awarded to BEST EMPLOYEE h March ‘1999 Y “# Tanya Lozano This C onand hard work for the company he best employee of the month. our dedicati Thank you for y' wn you ast so that we cro Joy Brown ecretary Joshua West Manager"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "award",
        "ocr_text": "ep! irwin, LLC al Instiiute tion and hard work fort ne company POGaU pest armployee of t month. thank you for your de we crown you as whe Joy Brown Secr joshua West Manager"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "award",
        "ocr_text": "ws Invin LLC institute Thank yo. FOr your dedication and hard we ork for the company crown you as the best empi lOY e Of the J loshua West Manager"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "award",
        "ocr_text": "ipwin LEC inshtute OF ACHIEVEMENT This Certificate is Awarded te Thank you for your dedication and hard work for the company so that we crown you as the best ernployee of the month. Joshua West Joy Brown Manager etary"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "award",
        "ocr_text": "agrees” TIFICATE OF ACHIEVEMENT ificate is Awarded to This Cert ‘Emily Cameron rk for the company and hard wo e of the month. dedication best employe Thank you for your ou as the so that we crown y' a Michael Jacobs Robert Williams Manager Secretary"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "award",
        "ocr_text": "gresine RTIFICATE OF ACHIEVEMENT This Certificate is Awarded to Emily Cameron r your dedication and hard work for the company employee of the month. Thank you fo crown you as the bes so that we Robert Williams ecretary Michael Jacobs Manager"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "award",
        "ocr_text": "OPP ”edsizMedonaig Pa CERTIFICAT EMPLovea iE. OF ACHIEVEMENT ems This Certificate is Awarded to Emily Cameron Thank you for so that wec your dedication and hard work for the company Town you as the best employee of the Month. a Michael Jacobs Robert Williams Manager €cretary"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "award",
        "ocr_text": "& hneiger Medon naild c olle 2qe warded to This C dedication and hard work for the cor Thank you fo so that we own you as the best amployee of the mor ory ntn. Michael! Jacobs Rober t Will jams ‘Manag 3 Secretary"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "award",
        "ocr_text": "Gprreesigern RTIFICATE OF ACHIEVEMENT This Certificate is Awarded to ‘Emily Cameron Thank you for your dedication and hard work for the company wn you as the best employee of the month. so that we cro Michael Jacobs Robert Williams Manager Secretary"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "award",
        "ocr_text": "Op Pscke aa CERTIFICATE EMPLOYEE OF ACHIEVEMENT ptembé 73 This Certificate is Awarded to ‘Valerie Walker Thank you for your dedication and hard work for the company so that we crown you as the best employee of the month. Charles Fuentes Heather Martinez Manager Secretary"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "award",
        "ocr_text": "rf Brgoks Davis University OF A SHIEVEMENT Awarded to /EMPLOY EE Septembee73, y acer npany dedication and hard work for the s the best ernployee of the month. Thank you for y so that we crown you as Heather Martinez"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "award",
        "ocr_text": "Op Packs Davis an \\) ~CERTIFICATE ‘empLovee OF ACHIEVEMENT This Certificate is Awarded to Valerie Walker Thank you for your dedication and hard work for the company So that we crown you as the best employee of the month. Charles Fuentes Heather Martinez Manager Secretary"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "award",
        "ocr_text": "if Bis oks Davis Univer sily Thank you for your dedication a we crown you as the ificate is Awarded to and hard work for the cornpany best employee of the month. He Sens Marti Secretary"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "award",
        "ocr_text": "é® Brooks Davis enptoves ACHIEVEMENT PeptembsP73 ge This Certificate is Awarded to Thank you for your dedication and hard work for the company f the month. a. 8 os ryt art ~ Charles Fuentes Heather Martinez Manager Secretary"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "award",
        "ocr_text": "Oy bee CERTIFICATE ove OF ACHIEVEMENT This Certificate is Awarded to Kristy Callahan Thank you for your dedication and hard work for the company so that we crown you as the best employee of the month. Holly Morgan David Murray a nager Secretary"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "award",
        "ocr_text": "OF ACHIEVEMENT This Certificate is Awarded te Thank you for your dedication and hard work for the company at we crown you as the best employee of the month. Holly Morgan ‘David Murray Manager Secretary"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "award",
        "ocr_text": "Re i t Of One Lid vp nivers 31 ty i BEST | EMPLOYEE * Nez %& x ryourd Thank you twe crown you as the pest Lemp ‘David Murray cretary Holly Morgan Manager"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "award",
        "ocr_text": "Wig Borhatic OF ACHIEVEMENT MPLOVEE eptembeno1 is This Certificate is Awarded to your dedication and hard wo ork for th 3 that W® Crown you as the best 6 8amployee of the rr Wanegete"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "award",
        "ocr_text": "Rocha Lid University E Thank you for your dedication and hard work for the company so that we crown you as the best employee of the month. David Murray Secretary"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "award",
        "ocr_text": "VL. CERTIFICATE ee June +1988 This Certificate is Awarded to onna Thompson Thank you for So that w or the company dication and hard wort 5 of the month. Gas the o Debra Ortega Manager Arthur Wrig Secretary"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "award",
        "ocr_text": "(iy Ssiéee” RTIFICATE oft) OF ACHIEVEMEN' Donna Thompson ‘or the company of the month. nand hard work f ur dedicatio e best employee Thank you for yo wn you as th so that we cro ee Arthur Wright Secretary Debra Ortega Manager"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "award",
        "ocr_text": "iy wee CERTIFICATE iubtover OF ACHIEVEMENT June °1988 5 This Certificate is Awarded to Donna Thompson Thank you for your dedication and hard work for the company so that we crown you as the best employee of the month. Debra Ortega Arthur Wright Manager Secretary"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "award",
        "ocr_text": "g Srp ith Ross Bollege [Fl OF ACHIEVEMENT onna Thompson Thank you for your dedication and hard work for the company at we crown you as the best employee of the mont ate is Awarded to V Vrig rit stacy Debra Ortega Tr"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "award",
        "ocr_text": "A Smith Ross iy, College OF ACHIEVEMENT This Certificate is Awarded to Thank you Oo tnat i for your dedication and hard work for the company ve crown you as the best employee of the r ronth, Debra Ortega Arthur Wright Manager"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "award",
        "ocr_text": "4 Ef Jonnson, Mit yy CERTIFICATE (/emptovee |, OF ACHIEVEMENT June 2913 This Certificate is Awarded to Tamara Cook Thank you for your ded tion and hard work for the company that we crown you as the best emp! of the month. \"Hannah Spence _ Alyssa Brewer Manager Secretary"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "award",
        "ocr_text": "rf Johnson, Mitchell 9 and Adams School Te CERTIFICATE ce OF ACHIEVEMENT June °2013 This Certificate is Awarded to Va *e mt tee Tamara Cook Thank you for your dedication and hard work for the company so that we crown you as the best employee of the month. Hannah Spence Alyssa Brewer Manager Secretary"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "award",
        "ocr_text": "A Johnson, Mitchell ig and Adams Schoo! CERTIFICATE OF ACHIEVEMENT This Certificate is Awarded to Tamara Cook Thank you for your dedication and hard work for the company so that we crown you as the best employee of the month. Hannah Spence Alyssa Brewer Manager Secretary"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "award",
        "ocr_text": "12043 4 une This Certificate is A Thank you for your ded 80 that we cro tion and har eth d work for thee the best employee of the me ont company Hannah Spence Al lyssa Brewer Manager Secretary"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "award",
        "ocr_text": "EMPLOVEE OF ACHIEVEMENT This Certificate is Awarded to Thank you u for your dedication and i hard work for the company t we crown you as the best employee of the month. Hannah Spenco Al yss sa Bret wer Manager"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "award",
        "ocr_text": "Wij Green Lite vs institute “BEST \\ [EMPLOYEE March 1978. e icate is Awarded ta nk you for your dedication and hard work fort the company so that we crown you as the best empleo the month. Sheila White Robi in Ayers M cretary nager 8"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "award",
        "ocr_text": "Green Lid instituie // BEST EMPLOYEE This Certi Thank you for your dedication and hard work for the company at so that we crown you as the best employee of the month. Sheila White Robin Ayers Manager Secretary"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "award",
        "ocr_text": "Op sresnte y*< CERTIFICATE ae OF ACHIEVEMENT March’ This Certificate is Awarded to Linda Roman Thank you for your dedication and hard work for the company so that we crown you as the best employee of the month. Sheila White Robin Ayers Manager Secretary"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "award",
        "ocr_text": ") Green tt CERTIFICATE EMPLOYEE OF ACHIEVEMENT March 1978) This Certificate is Awarded to Linda Roman Thank you for your dedicati on and hard work for the company so that we crown you as the best employee of the month. Sheila White Robin Ayers anager Secretary"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "award",
        "ocr_text": "Green Lid institute March 1978 This Certificate is a Thank $0 tha Uwe Crow. e YOu for your dedication and hard work for the cornpany you 8s the best EMployee of the Month, Sheila Whi t Robin Ayers at dry Srat"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "award",
        "ocr_text": "Wp Brown Inc TF OF ACHI IEVEMENT Th s Cert sh Thank you for your dedicat on and nard wort So that we crown you as the best for the compeny Pioyee of th Joseph Lawrence Secretary"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "award",
        "ocr_text": "Brown inc institute OF ACHI IEVEMENT ertificate is Awarded to =M PLOYEE ovembe93 Thank you for your de tion and hard work for the compan 50 that we crown you as the best amp! a of the month. joseph L aw? ence Tiffany Gonzaie Manager"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "award",
        "ocr_text": "% Brown Inc Institute Vic \\. CERTIFICATE EMPLOYEE |, OF ACHIEVEMENT Ovembet993 FZ, This Certificate is Awarded to Ashley Copeland Thank you for your dedi cation and hard work for the company so that we crown you as the best employee of the month. Tiffany Gonzalez Joseph Lawrence Manager Secretary"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "award",
        "ocr_text": "7@ Brown Inc A Insti tute” '[/ BEST (| [EMPLOYEE Weve mbetees, ficate is Awarded to Thank you for your dedic cation and hard work for the compan ‘YOu as the best employee of the month SO that we crown Tiffany Gonzalez Manager"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "award",
        "ocr_text": "Cp Paiute’ RTIFICATE OF ACHIEVEMENT This Certificate is Awarded to Ashley Copeland he company and hard work for t e month. ur dedication best employee of th Thank you for yo you as the so that we crown Joseph Lawrence Secretary Tiffany Gonzalez Manager"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "award",
        "ocr_text": "i Seott Group i University OF ACHIEVEMENT Awarded to ation and hard work for the company Thank you for your dedication crown you as the best ernpioyee oft ‘Gabrielle Davis Secretary"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "award",
        "ocr_text": "fi Seott Group 3 University enbiovee a OF Aenea This Certi Thank you for your dedication and hard work for the company so that we crown you as the best empioyee of th Donne Parsons Gabrielle Davis a Manager Secretary"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "award",
        "ocr_text": "Op oss? CERTIFICATE EMPLOYEE. | OF ACHIEVEMENT Cobos This Certificate is Awarded to Janet Reed Thank you for your dedication and hard work for the company so that we crown you as the best employee of the month. Aah, Donna Parsons Gabrielle Davis Manager Secretary"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "award",
        "ocr_text": "@ Scott Group (| EMPLOYEE Nex clober2012 J) This Certif PMPLOVER|| OF ACHIEVEMENT cate is Awarde you for your dedicatio at we Crown you he month. Gabrielle Davis Donna Parsons Manager Secretary"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "award",
        "ocr_text": "University Thank you fo we Crown Donna Parsons ryour dedicat cation ofthe me Se shard work for the company qth Gabrielle Davis bs"
    }
]