[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "banktransac",
        "ocr_text": "> Yotain"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "banktransac",
        "ocr_text": "A Lewis, Morris and Reynold “4011 Holmes Plaza. Soule iehley, 1 24377 CHEQUING ACCOUNT STATEMENT 02807 12681 ach John Garci 1058 Angela lsang, ‘Jasonvile, rt Nay 02 4959 1660 1846 Description Loan onal loan Online a a ent Pemmerce platform x oP \"Bile Liye. electnaity 3 Cash A 14 Peet branch counter Mobile joad Pearehase anc Olgaa purchase 1 ine donation 10 chart Bank charge servi ranch ‘Santer \"Totals *** 42629 07 16065 45"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "banktransac",
        "ocr_text": "¢ Lewis, Morris and Reynolds al 4011 Holmes Plaza, South Ashley. Vi 24377 CHEQUING ACCOUNT STATEMENT 02807 12681 tort Statement period Account Ne John Garcia anual _ 1058 Angela Island, Jasonvile, January 0 Migyg 4882 1660 1846 ‘AZ 85434 Date ‘Description Ref. |Withdrawals _ Deposits Balance Loan payment Pe personal loan Online 96, Purchase via e commerce platform Pugals payment electnaty Cash Aq Bieditat branch counter Mobile 39) load purchase Mobile load purchase Online donation to chi charge service fee Cash a Spat at ‘branch counter Totals“ 42629 07' 16065 45"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "banktransac",
        "ocr_text": "1058 A 4982 Tots"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "banktransac",
        "ocr_text": "etoile\" 16005. 48"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "banktransac",
        "ocr_text": ". Haynes Huffman USS Diaz, FPO AP 19789 CHEQUING ACCOUNT STATEMENT. 0281809034 Page 1 of 1 Ashley Sina been Sitement narod account nen] aay to May 08. useoe Figueroa, FPO AE 18 202° 2012 4774 1270 6917 Insurance premium ayment Bank Charge service fee Online donation to charity Interest credited to account nline purchase via e commerce latform Service charge ATM balance inquiry Credit card payment Incomin, remittance from overseas Penalty charge for aie Payment Loan Payment auto loan Online purchace via e commerce platform Refund from merchant Incoming remittance om overseas POS purchase at grocery store Fund transfer to investment account Online Purchase via €-commerce platform Incoming transfer from payroll system Onling donation to charity Totals ***"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "banktransac",
        "ocr_text": ". Haynes Hufiman USS Diaz, FPO AP 19789 CHEQUING ACCOUNT STATEMENT Pi 0281809034 rage: 1 of 1 Ashley Silva _ Statement period ‘Account No. USCGC Figuerca, FPO AE 120 M2\" 4774 1270 6917 Insurance premium payment Bank charge service fee Online donation to charity Interest credited to account ‘Online purchase via e commerce latform Service charge ATM balance inquiry Credit card payment incoming Kenwtnee from overseas 3) Penalty charge for late payment Loan 5 payment auto loan Online purchase via e commerce platform Refund from merchant Incoming remittance from overseas POS purchase at grocery store Fund transfer to investment account Online purchase ‘via e commerce platform Incoming transfer from payroll system Online donation to charity Totals *** 36840 61 29403 19"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "banktransac",
        "ocr_text": "ayia sy donation to ct Stowe 20840 67"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "banktransac",
        "ocr_text": "JT STATEME Page aity miteres purchase 8403 49 36840 84"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "banktransac",
        "ocr_text": ": Haynes Hufiman USS Diaz, FPO AP 19789 CHEQUING ACCOUNT ‘STATEMENT 0281809034 Page: 1 oft Ashley Silva fanuar Mi UscGc Figueroa, FPOAE 18 2024 2012 4774 1270 691 7 Description Insurance premium ayment Bank charge service fee Online doncivn ‘o charity interest credited to acenon Online purchase via e commerce platform Service charge ATM balance inquiry Credit card payment Incoming remittance from oversees Penalty charge for aac Payment Loan Payment auto loan Online Via e commerce platform Via e commerce transfer from SP donal platform Incomin; ayroll system Onling on to charity “Totals ***"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "banktransac",
        "ocr_text": "f Staniey Otver S| 2311 Hunter Center Sele 000, East Kathryn, GU CHEGQUING ACCOUNT STATEMENT 0286824680 Page. tet Michael Benson rr —— 555 La ry a SS Trac Sue 375, Fe Oe OT 3 26 0961 700 incoming Systetn Transter to joint account infine fund transter to account Bank charge service fee Insurance premium payment Onlave purchase vio e commerce platform Loan payment autc loan Cash deposit af branch counter Sennce charge ATM balance inquiry 7\" Tous 2266 3 W267 43"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "banktransac",
        "ocr_text": "ranster fr ach epunter 5 palance ink aqereume ee"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "banktransac",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "banktransac",
        "ocr_text": "OUNT STATEMENT Page Toft athryn, GU CHEQUING. 666 40 4725 5061. 7693 Loan payment gege Peymert tor goveriune hon BERT ce a Ceanng ATM cas re coe if $2 fer fram payto# int Loar payinent depos at branch counter Serv dharge AIM balance inqui Toda 2223 17207 43"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "banktransac",
        "ocr_text": "a Staniey Olwer 9p 2311 Hunter Center Suite 000, East Katheyn, GU CHEQUING ACCOUNT STATEMENT Oe eoase24660 Page: tots a Meta Benson eae ep == \"SR en tag ua BOF EEE 5725 901 7083 Loan payment persons! aan Payment for government contribution Ioterest creritled to account os person tan Pena) Charge for ite payment incoming remfjance fram o 8 Loan payiient auto loan Cech depen iocal clearing ATM cash withdrawat Incoming transfer from payros system Transfer to joint account Inline fund transfer to savings ‘account Bunk charge service fee Insurance premium paymeit Online purchase wa e commerce pistiorm Loan payment auto joan Cash deposn at branch counter Service charge ATM balance inauiry Tots 222 3 -17257 43"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "banktransac",
        "ocr_text": "Harrison and Rubio Maithewroreuah, LA $92 Be ae Gees 36 via mobile 20F tee 7"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "banktransac",
        "ocr_text": "‘ Rogers, Harrison and Rubio 145 Mora Pass, West Matthewborough, LA CHEQUING ACCOUNT STATEMENT 0280436064 Page: 1 of 1 Tyler Collins 23392 Samuel Flats, West M3041 Januar Thomastown, AZ 50338 11 2028 3972 7769 6884 CAC Fupd transfer to investment account Penatty chargase ireent acco Insurance premium payment Service Charge ATM balance inquiry Salary credit from payroll Deposit via mobile app Check deposit local clearing inline purchase via e commerce platform Incoming remittance from Overseas Transfer to joint account Loan payment personal loan Credit card payment Interest credited to account Credit card payment Reversal of previous debit Deposit via mobile app Bank charge service fee Tuition fee payment Totals *** 46289 26 25449 42"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "banktransac",
        "ocr_text": "Rogers, Harnson and Rubio 145 Mora Pass. West Matthewborough LA 0280436064 Tyler Collins 23392 Samuel Flats, West Thomastown, AZ 50338 Description Fi th to mvestment accoynt WenaRy charge Vor ate payment Insurance premium payment Service charge ATM balance inquiry Salary credit from payroll Deposit via mobile app Check depost local clearing nline purchase via e commerce platform Incoming remittance from ‘overseas Transfer to joint account Loan payment personal loan Credit card payment interest credited to ‘account Credit card payment Reversal of previous debt Deposit via mobile app Bank charge service fee Tuition fee payment CHEQUING ACCOUNT STATEMENT Page ott Statement period ‘Account No. ust 27 to Janu. 11 11 2024 3972 7769 6884 Withdi a 46289 26 25449 42"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "banktransac",
        "ocr_text": "OUNT STATEMENT Page 108)"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "banktransac",
        "ocr_text": "Totals"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "banktransac",
        "ocr_text": ". Taylor Duncan BY 258 Acosta Crossing, Richardhaven, NM 40503 a CHEQUING AccouNT ‘STATEMENT 0288345749 loft Cesar Moore 97044 R Fall —— Joseph it eanai? Description Totals *-* 19986 36. 19644 34"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "banktransac",
        "ocr_text": "~ Fokas 386"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "banktransac",
        "ocr_text": "‘ Taylor Duncan JJ 258 Acosta Crossing, Richardhaven, NM 40503.“ CHEQUING ACCOUNT STATEMENT 0288345749 Page: 1 of 1 Cesar Moore to 1 srt pang 2001, 3650 1089 5517 boat] Description [withdrawals Deposits Balance “Totals *** 19986 36 19644 34"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "banktransac",
        "ocr_text": "sons 449598 29504 19 7742 29, 19684 54 ae Tota"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "banktransac",
        "ocr_text": "sylor Duncan 2 Crossing, Rie 1964434"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "banktransac",
        "ocr_text": "+ Robinson Douglas SY 5186 Gomez Points Apt. 781, South Kurtberg, CHEQUING ACCOUNT STATEMENT 0285434874 Page 1 of 1 Jacqueline Garner we aS Account No. 361 Ortiz Village Apt. 356, New Lisaport NC 84292 2012, 2 158 9300 7086 1087 Pate description Ref. [Withdrawals Deposits Balance Totals *** 48280 6 47881 53"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "banktransac",
        "ocr_text": "ie Bee a8 4788"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "banktransac",
        "ocr_text": "st STATEMENT tott a jacquelin _ abt Ore Vilage ADL, 3 paapos, NC BA: Rens or merchant one We ays re plattorm fos se2896 4788153"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "banktransac",
        "ocr_text": ". Robinson Douglas 2] 2186 Gomez Points Apt 787, South Kurtberg, CHEQUING ACCOUNT STATEMENT “0285434874 Page: 1 of t Jacqueline Gamer 351 Ortiz Village Apt. 356, New 301 Usaport, NC 84292 us 12\" 28 88 9300 7086 1087 Date Description Ret. |withdrawals Depo: Balance “* Totals *** 482806 47891 53"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "banktransac",
        "ocr_text": "\"i Robinson Douglas Py 9186 Gomez Points Apt, 781, South Kuriberg, CHEQUING ACCOUNT STATEMENT 6285434874 Page tot! Jacqueline Garner sedate: 51 Ortiz 5 351 Oe veneer 28 1895 9300 7086 1087 Refund from merchant incomng transte: from payroll system Onime purchase vie e commerce platform so Touad o* 482806 4768153"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "banktransac",
        "ocr_text": "Moore 5 Jettrey Ove CHEQUING ACCOUNT S Pa TEMENT oft Sarahside, FL 06969 from payrot 48998 67 to joint aacount eee to fort account ME SB 32979 48"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "banktransac",
        "ocr_text": "ting 5, Pbewek ACCOUNT STATEMENT Dennis Green SEROU EEE secon 4 1803 Sanias Cree wile SST ©5605 4889 7905 2004 2 payrolt 3504 45278 67 fo joint account Ys SpeghsS, Ses 21GE RE 783 885 89 32079 48"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "banktransac",
        "ocr_text": "6, Rhodestort CUNT STATEMENT off 1201876 Tata 69 8237948"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "banktransac",
        "ocr_text": "Carter and Rotins rpass Sint S25, Rhodestor 0283200878 Deonia Green Ae anes i Bet March te July reek Suite $54 ach Shoe eee. 7e68 2004 6562 3257048"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "banktransac",
        "ocr_text": ": Moore, Garter and Rotins Sy 28525 Jetirey Overpass Suite 925, Rhodestor, CHEQUING ACCOUNT STATEMENT Page: ttt O2A1201876 Dennis Green a Stateinent pound: Aecayai tho’. = 7 cy jaty V4 41803 Santos Crook as 551. Stig!\" “ods 4629 7885 2001 Wed SESS a OL SAS to joint account by Torte 20865 6¢ 32379 46"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "banktransac",
        "ocr_text": "wi5s4 6 W090"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "banktransac",
        "ocr_text": "CMEQUENI sage eee SOTA 786 17 27082 5a0t 3 38644. g8002 19"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "banktransac",
        "ocr_text": "$s 5 30846 Thomas senna ‘BRS, Adamtovn, OK “9280592454 Michael Paui MD 89846 Conway Meadows, Vargaston, CH 07246 Ytion fee paying Tei merchant le wad purchase ‘Onine donation to charty tay fl Online tund transfer to savings S088 4: 3, ‘eccount insurance premium paytent S330 tae Wisarsior aneusctmat d 2 Hes ro Totata -36002 19"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "banktransac",
        "ocr_text": "BS Adartown, OK CHEQUING ACCOUNT a4 Tocanten ho E onway Meadows, TEESE te nn fargaston, GH 07246 fund hansterto savings im payment tion fee gayment Return trom hart Mobile lead purchase dian to chorey"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "banktransac",
        "ocr_text": "CHEQUING ACCOUNT ‘STATEMENT 0280592454 Page: 1 of 1 Michael Paul MD mrayement period Taccoune mm tol a8 Sore i gagows, 3 BRE 1071 1756 174: Online fund transi account Insurance t ul ena fea Hover re fon fee Se Face 2 Tuition fee ieee Refund t rent merchant ad purchase Online donation charity Totals *** 38844 5 36002 19"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "banktransac",
        "ocr_text": "Robertson LL '$ 9875 Shannen TralAgt 1S7AI 36"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "banktransac",
        "ocr_text": "‘ Robertson LLC 0675 Shannon Trail Apt. 217, Silvafort, PR CHEQUING ACCOUNT STATEMENT “0287575412 Page 1 of 1 Joseph Clark oa 7283 Malik Ramp Apt. 822, 23 2019 OPPSOPE o396 9495 2447 Ponte |Description Ret |witharawals Deposits Balance Payment for government contribution Incoming transfer from payroll q system Loan payment personal joan Bills payment water utility Outgoing transfer to third party bank ervice charge ATM balance inquiry Transfer to joint account Salary credit from payroll Bills Ye payment water utility Totals *** 6046 66 40916 53"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "banktransac",
        "ocr_text": "S) 675 shannon aL ABE Ape 227, Savaiort, PR CHEQUING ACCOUNT STATEMENT on ne 75 754 12 Ls Joseph Cask ge TE Lr vidoey ead Ri wf a Ramp A SESE ©ORFSBS eageos8s 2447 Payment tor goverrenent onletasion it fF “en yom ey fem iy \" Dat ne ab Barbas sceett wleaay, v U ougoog warster to wa party Dor ee ot a t gay ‘Transfer to font eerout rAG 26 ‘Ged from payrot Bats é se overt water utéty aaa e046 66 40016 52"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "banktransac",
        "ocr_text": ": Rebertson LLC S| 0675 Shannon Trail Apt. 217, Sivafort, PR CHEQUING ACCOUNT STATEMENT er\" 0287575412 Page: tot Joseph Clark Tors 7283 Malik Rap At 822, 23 2019 OFF SORE\" 9396 0485 2447 Payment for government contribution Incoming trai aming warafer rom Pavol q 5 n payment Wan Bis to water utity uigong rater tard party bank Aaah jerk excourt ingury from Totals 6046 66 40916 53"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "banktransac",
        "ocr_text": ". Robertson LLC 0675 Shannon Trail Apt. 217, Sivafort, PR CHEQUING ACCOUNT STATEMENT “0287575412 Page: 1 ott Joseph Clark ‘Statement period ‘Account No. _ 7263 Malk Ramp Apt. £22, 23 201 °OFFSBRE o306 0485 2447 Date Description Ref. [Withdrawals _ Deposits Balance ment for government contribution incoming ransfer from payroll 761 system Loan payment personal loan Bills payment water ay Ouigong transfer to thirc: party bank \"ce chat lance ingurry Transfer to sont account Salary credit from payroll Bills payment water utility “Totals *** 6046 66 40916 53"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "banktransac",
        "ocr_text": ". Harper, Stone ard Campos “W270 Lisa Tunnel, Smahside MP 56255 97 2991 B181 ng tem rom owetseas Deposd via app Incommng transier f Sysiem Transfer to ort account of i 7. 2 bee B43 42724 BS Yotwie 4"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "banktransac",
        "ocr_text": "Lerrtl Account syae one ws ane Car side, MP a 58a85 cream Harper, St 3779 usa Tame, 5 anemones ‘Mary Guerrero >. 090, ascent Sah ~~ ot 4097 3901 8181 Bend nb chat ce pce qroce y ey aore Ch tached pean Wocal CAN premium partnenk sot ere mata Ganch counter tncomesd T° fom overseas JBepentvia ‘wanster fom pane yatern Transler to jount account yoo ee —_— aggre 43° 42724 85"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "banktransac",
        "ocr_text": "Harper, Stone and Campos 3770 Lisa Tunnel, Smithside, MP 58855 CHEQUING ACCOUNT STATEMENT 0284212313 Page: 1 0f1 Mary Guerrero ‘Statement period ember to July 06 otek pt Sten reba 2020 2023 1097 3991 8181 Date Bank charge service fee POS 15 12 ‘purchase at grocery store Check Geposit local clearing Insurance iN premium payment Cash deposi a Uanch counter incoming remittance 5 from overseas Deposit via mobile 4 8 app Incoming transfer from payroll ystem Transfer to joint account \"Totals *** 4987843 42724 85"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "banktransac",
        "ocr_text": "GA 85"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "banktransac",
        "ocr_text": "fi Harper, Stone and Campos 93770 Lisa Tunnel, Smithside, MP 58355 CHEQUING ACCOUNT STATEMENT P 0284212313 age tot Mary Guerrero 645 Koght Stau 0, East Joseph, 524 Bank charge service fee POS furctiase af grocery store Check deposi loca! clearing Insurance premium payment Cash depasit at branch counter incomung remittance from overseas Deposit via mobile app incoming transfer from paysoll Sysiem Transfer to joint account Se TORT 49278 43 42725 25"
    }
]