[
    {
        "image": "bulletininfomaterials1_synth_10_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines MUNOZBERG METROPOLITAN SERVICES OFFICE 108 Vitanueva Mountains Apt 528, Palmermouth, NC 84307 PUBLIC BULLETIN: Advisory on Seasonal Consumption Thresholds This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective February 15, 2026. BILL OF QUANTITIES CHANGE TO Institutional customers Proposed rate: P 20 89 per unit; includes Average usage: Above 50 units month Current rate: P 20 29 per unit Residential customers Proposed rate: P 9 64 per unit; Average usage: 0 15 units month early payment rebate retained. sustainability surcharge. ite: P 8 66 per unit Commercial customers Average usage: 16 50 units month Proposed rate: P 12 19 per unit; phased Current rate: P 11 64 per unit implementation over two billing cycles. ——— Stakeholders are invited to submit written comments within ten (10) working days of this publication. The Regulatory Compliance Board will consolidate feedback prior to final adoption. All adjustments aim to sustain infrastructure upgrades while keeping essential services affordable. Monica Reynolds Digitally signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_10_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Phiipomes RG METROPOLITAN SERVICES OFFICE 108 Vitanuses PUBLIC BULLETIN: Advisory on Seasonal Consumption Thresholds This bulletin cutlines the summarized consumption averages and p affecting residential, commercial, and institulional consumers effectiv ected adjusiments February 15, 26. BILL OF GUANTITIES CHANGE TO | institutional ox Average usage: Above 50 units month __ Surrent rate: P 20 29 Proposed rate: P $64 per unit: i merit rebate retained. i P 12 79 per unit; phased n over two billing cycles. ublication, The Ri sustain infrast jatory re upgrades: Invited fo submat wiliten comments wih ack prior to final ten £49) working Stakehoiders 4 Compliance Boar while keeping in. Al adj. Monica Reynolds Digitally signed on October 360, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_10_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philipp! OLTAN S OFFICE cled adiusiments ebruary 75, BILL OF QUANTITIES i CHANGE TO per uitil; includes Proposed rate: P 20 sustaina r Pa an aver t mments wi ack prior to final adopt onica Reynolds Digitally signed on October 36, 2025 Billing and Collections Manag"
    },
    {
        "image": "bulletininfomaterials1_synth_10_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Phiippines MUNOZBERS METR OLITAN SERVICES OFFICE PUBLIC BULLETIN: Advisory on Seasona! Consumption Thresholds This bulletin outiines the summar g Ag residential c imption averages and projecied adjustments tutional consumers effective February 45, zed const ai, and it BILL OF QUANTITIES CHANGE TO inshtutiona! ome s. ovate, 20 89 rt | Proposed tat 2 peruni: ing Average usage: Above 50 units month CROSEO tate: ey par unk} Cl rate: 20 sustainability surcharge c 3) Proposed rate: ¥.64 per unit éarly payment rebate 15 unitsmanity its MaimMh Proposed oF 12 49 per unit: pn ste P4164 per unit Mplementation ov 9 2 ailing keeping essent ts Wit ven (10) wor fNat adoptan Al adiust: days of Regulatory ation. The Monica Reynolds Digitally signed on Cetober 30, 2025 Billing anc Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_10_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines MUNOZBERG MET OPOLITAN SERVICES OFFICE OF 408 vikanwova Moot los Apt £28, Palmarncuin, NC BA30P PUBLIC BULLETIN: Advisory of Seasonal Consumption Thresholds e suremarized consumption averages and projected adjust }, and institutional consuny effective February 1 This bulletin outlines th affecting residential. commerct: 2028 i SILL OF QUANTITIES titutional custorness sage: Above 5G unitssmonth e: 9 64 per unit acl Proposed rat garly payme: rebale fat phased Mers 0 uniisfmonth a: 12 19 per ure url Proposed fat implementation over two billing Monica Reynolds Digitally signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_1_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines NEW KIRK PUBLIC UTILITY AUTHORITY 9172 Gordon Coves Suite 375, Vancestad, IN 13921 PUBLIC BULLETIN: Proposed Rate Realignment for Residential Consumers This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective January 14, 2026. BILL OF QUANTITIES CHANGE TO a esen dy a —J Avera eegustomers simonth Proposed rate: P 12 53 per unit; includes Current rate: P Fr 72 per unit sustainability surcharge. r = 1 Residential customers Proposed rate: P 9 76 per unit; Cueage usage: canis month early payment rebate retained. Institutional customers Average usage: Above 50 units month Proposed rate: P 22 98 per unit; phased Current rate: P 21 96 per unit implementation over two billing cycles. Stakeholders are invited to submit written comments within ten Compliance Board will consolidate feedback while keeping essential services affordable. (10) working days of this publication. The Regulatory Prior to final adoption. All adjustments aim to sustain infrastructure upgrades Brittany Terry Digitally signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_1_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philignines NEW KIRK PUBLIC UT PUBLIC BULLETIN: Proposed Rate Realignment for Residential Consumers This bute! affect 2026. 1 outlines the 3 1g residential, commer imarized consumption a d adjustments ciai, and institut BILL OF QUANTITIES i CHANGE TO th Proposed rate: F 42 53 t; Includes bHitY Surcharge. 2 O78 per unit; Institutl ' mit; phased oyeles. The Reg iatory aster Brittany jitally signed on October 30, 2025 Terry Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_1_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines NEW KIRK PUBLIC UTILITY AUTHORITY 9172 Gordon Coves Suite 375, Vancestad, IN 13921 PUBLIC BULLETIN: Proposed Rate Realignment for Residential Consumers This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective January 14, 2026. r BILL OF QUANTITIES CHANGE TO | a age. 660 units month Proposed rate: P 12 53 per unit; includes | Current rate: P 11 72 per unit sustainability surcharge. Residential customers Proposed rate: P 9 76 per unit; ae ee ao aa early payment rebate retained. LeU A n — 4 Institutional customers | Average usage: Above 50 units month Proposed rate: P 22 98 per unit; phased | Current rate: P 21 96 per unit implementation over two billing cycles. _ ders are invited to submit written comments within ten (10) working days of this publication. The Regulatory Stakehol le feedback prior to final adoption. All adjustments aim to sustain infrastructure upgrades Compliance Board will consolidat while keeping essential services affordable. Brittany Terry Digitally signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_1_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines NEW KIRK PUBLIC UTILITY AUTHORITY 9172 Gordon Coves Sule 275, Vancestad, It 13821 PUBLIC BULLETIN: Proposed Rate Realignment for Residential Consumers This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective January 14, 2026. ee SS H | BILL OF QUANTITIES CHANGE TO fr Commercial customers. 7 a -+ | Average usage: 16 50 unitetmonih sana ee hae per unit; includes it 1 cae Residential customers Average usage: 0 15 units month Pops Jae pee Lochs urrent rate: P 8 67 per unit _ Cuk ee | Institutional customers 4 Average usage: Above 50 units month Proposed rate: 22 98 per unit; phased Current rate: 21 96 per unit implementation over two billing cycies. bie ee eee ee Stakeholders are invited to submit written comments within ten (10) working days of this publication. The Reguiatory Compliance Board will consolidate feedback prior te final adoption. All adjustments aim to susiain infrastructure upgrades: while keeping essential services atfordabie. Brittany Terry Digitally signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_1_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philipsines NEW KIRK PUBLIC UTIUTY AUTHORITY Goren i PUBLIC BULLETIN: Proposed Rate Realignment for Residential Consumers This bulletin o: Consumption averages and projected adjustments affecting residental, and institutional consumers effective January 14, institutional cust 1 Average us. Proposed r implementation o muon. Al ad Brittany Terry Digitally signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_2_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines LAKE KIMBERLYHaVEN METROPOLITAN SERVI OFFICE 735, Narn Nenmettirt Wi Sante PUBLIC BULLETIN: Advisory cn Seasonal Cersumption Thresholds This bulletin outiines the sum marized consumption avers affecting residential, coramer cial, and institutional consume: 'S and projected adjustments 8 effective February 69, SILL OF QUANT TEs customers Average usage: 0 15 units manih : ae SaStoMers Proposed rate: 45 55 per uy H Average usage: Above 50 units month oan _ pei Lun 50 per unit i Commercial ca j Av Current rai storners j 18 89 units monihy Proposed rate: 18 58 per uni; phased :P 44 86 Ber unit Hl Nplementation over iwe ‘ 4S are inated Compliance Board yi cor Submit written com: 4S within ten feedback Por to final Services attordante (163 working adaption, aly 2YS of this oun! lication. adiustnentis airy Reguiatory VIO Sustain i astructure upgrades, Christopher Lopez Digitally signed on October 30, 2025 Rates and Tariffs Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_2_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines LAKE KIMBERLYHAVEN METROPOLITAN SERVICES OFFICE 648 Michelle Ville Suite 735, North Kennethfurt, MI 34519 PUBLIC BULLETIN: Advisory on Seasonal Consumption Thresholds This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective February 09, 2026. BILL OF QUANTITIES CHANGE TO | Residential customers a a Average usage: 0 15 units month Proposed rate: 10 90 per unit; includes Current rate: P 10 46 per unit sustainability surcharge. = oe Institutional customers Proposed rate: P 16 65 per unit; Average usage: Above 50 units month . | ly- it rebate retained. Current rate: 15 50 per unit garly payment rebate retaine’ _ Commercial customers | Average usage: 16 50 units month Proposed rate: P 15 56 per unit; phased | Current rate: P 14 86 per unit implementation over two billing cycles. Stakeholders are invited to submit written comments within ten (10) working days of this publication. The Regulatory Compliance Board will consolidate feedback prior to final adoption. All adjustments aim to sustain infrastructure upgrades while keeping essential services affordable. Christopher Lopez Digitally signed on October 30, 2025 Rates and Tariffs Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_2_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "of the Phitionines QPOLITAL Republic en MET KIMBER vr, saw aachelie 35, Foe PUBLIC BULLETIN: Advisory Of Seasonal Consumption Thresholds ymiption averages and projected adjustments Aective February 68, consumers e cans ang institutional Hines ihe summa’ ial commercial, This pullelin oul pil. OF QUANTITIES CHANGE TO nowides e: 10 90 per unl 8 propased rat charge. ustainadiity Residential customess Average USag ton P al customer Above 5° unieimonth grate: #45. 56¢ ation over WO b y 1 comme» Average uss Current rate 2 invited 1G akehoiders ai Christopher Lopez Digitally signed on October 39, 2025 Rates and Tariffs Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_2_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines LAKE KIMBERLYHAVEN METROPOLITAN SERVICES OFFICE 648 Michelle Ville Suite 735, North Kennethfurt, MI 34519 PUBLIC BULLETIN: Advisory on Seasonal Consumption Thresholds This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective February 09, 2026. T BILL OF QUANTITIES CHANGE TO | L ee Aierage usage, O15 units month Proposed rate: P 10 90 per unit; includes o>: P sustainability surcharge. Current rate: P 10 46 per unit | Institutional customers Proposed rate: P 16 65 per unit; ee ee or early payment rebate retained. Commercial customers Average usage: 16 50 units month Proposed rate: P 15 56 per unit; phased Current rate: P 14 86 per unit implementation over two billing cycles. Stakeholders are invited to submit written comments within ten (10) working days of this publication. The Regulatory Compliance Board will consolidate feedback prior to final adoption. All adjustments aim to sustain infrastructure upgrades while keeping essential services affordable. Christopher Lopez Digitally signed on October 30, 2025 Rates and Tariffs Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_2_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines LAKE KIMBERLYHAVEN METROPOLITAN SERVICES OFFICE 648 Michelle Ville Suite 735, North Kennethfurt, MI 34519 PUBLIC BULLETIN: Advisory on Seasonal Consumption Thresholds ummarized consumption averages and projected adjustments This bulletin outlines the s al consumers effective February 09, affecting residential, commercial, and institution 2026. BILL OF QUANTITIES CHANGE TO | Residential cust a ‘esidential customers a Average usage: 0 15 units month see iP nome per unit, includes Current rate: P 10 46 per unit sustainability surcharge. Institutional customers Proposed rate: P 16 65 per unit; Average usage: Above 50 units month ly- te Current rate: P 15 50 per unit early payment rebate retained. Commercial customers Average usage: 16 50 units month Proposed rate: P 15 56 per unit; phased Current rate: P 14 86 per unit implementation over two billing cycles. ten (10) working days of this publication. The Regulatory Stakeholders are invited to submit written comments within ents aim to sustain infrastructure upgrades Compliance Board will consolidate feedback prior to final adoption. All adjustm while keeping essential services affordable. Christopher Lopez Digitally signed on October 30, 2025 Rates and Tariffs Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_3_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines EDUARDOPORT WATER DISTRICT 0061 Kelley Valleys, South Johnhaven, LA 67461 PUBLIC BULLETIN: Advisory on Seasonal Consumption Thresholds ption averages and Projected adjustments onal consumers effective December 30, T | BILL OF QUANTITIES CHANGE To L Institutional customers . Average usage: Above 50 units month Proposed rate: P 18 92 per unit; includes L Current rate: P 18 23 per unit Sustainability Surcharge. Residential customers Proposed rate: P 10 81 Per unit; | Cument rate Sa sont early payment rebate retained. Commercial customers Average usage: 16 50 units month Proposed rate: P 17 17 per unit; phased Current rate: P 16 46 per unit implementation over two billing cycles. , commercial, and instituti Stakeholders are invited to submit written comments within ten (10) workit Compliance Board will consolidate feedback Prior to fin; ing days of this publication The Regulatory jal adoption. All adj while keeping essential services affordable. lustments aim to sustain infrastructure upgrades James Mitchell Digitally signed on October 30, 2025 Rates and Tariffs Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_3_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Phuippines EDUARDOPORT WATER DISTRICT ciwy Vateys, Sout Johnnaven, LA B74S* ETIN: Advisory ob Seasone PUBLIC BULL Thresholds Consumption adjust! jes: per 30, consumption averages and projected autional conmsumers effective Desem This pulletit outtines the summarized res ential, coramercial, and in CHANGE TO es @ 43 92 par unit includ sional customers gen ADOVE 80 une a Proposed rate: ent rebate fe 47 47 per unit phased Proposed rate: aver two billing Yo implementation atory a upgrades james Mitchel! 2029 Digitally signed on October 3 Rates and Tarifis Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_3_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines EDUARDOPORT WATER DISTRICT 0061 Ketley Valleys, South Johnhaven, LA 6746+ PUBLIC BULLETIN: Advisory on Seasonal Consumption Thresholds This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective December 30, 2025. a aa an BILL OF QUANTITIES CHANGE TO H i r institutional customers oe ~] Average usage: Above 50 units month ieee ee SoA SLB ELS Curent rate: P 18 23 per unit 0 __ i Residential customers Proposed rate: P 10 81 per unit; | Average usage: 0 15 units month early payment rebate 1 sess ed, i Current rete: P 9 89 perunit Commercial customers ; | Average usage: 16 50 units month Proposed rate: P 17 17 per unit; phased Current rai 16 46 per unit Implementation over two billing cycles. i aan By eae Stakeholders are invited to submit written comments within ten (10) working days of this publication. The Regulatory Compliance Board will consolidate feedback prior to final adoption. Ali adjustments air to sustain infrastructure upgrades while keeping essential services affordabie. James Mitcheli Digitally signed on October 30, 2025 Rates and Tariffs Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_3_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines EDUARDOPORT WATER DISTRICT 0061 Kelley Valleys, South Johnhaven, LA 67461 PUBLIC BULLETIN: Advisory on Seasonal Consumption Thresholds immarized consumption averages and Projected adjustments ential, commercial, and institutional consumers effective December 30 BILL OF QUANTITIES CHANGE To Average ascustomers 50 units, /month Proposed rate: P 18 92 Per unit; includes Current rate: P 1g. 23 per unit Sustainability Surcharge. Residential Customers \\verage Usage: 0~ Current rate: 9 8! Commercial Customers Verage usage: 16_59 units month Proposed rate: p Current rate: p 16 46 per unit 17 17 per unit; phased implementation Over two billing cycles. 15 units month Proposed rate: 9 per unit P 10 81 Per unit; €arly payment rebate retained, Stakeholders are invited to Submit written comments within ten (10) working days of this Publication. The Regulatory Compliance Board will consolidate feedback Prior to final adoption. All adjustments aim to sustain infrastructure upgrades while keeping ssential services affordable. James Mitchel! Digitally signed on October 30, 2025 Rates and Tariffs Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_3_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philipgmes EDUARDOPORT WATER DISTRICT 1 Kelay Valleys, South Johnhaver, LA 87481 PUBLIC BULLETIN: Advisory on Seasonal Consumption Thresholds rized consumption averages and projected adjusiments ional consumers effective December 30, suliines the summa sidential, commercial, and inst This bu affecting BILL OF QUANTITIES i CHANGE TO i institufional customers ge usage: Above 56 uniis month ® 48 92 per unit; includes i charge j ront rate: 18 25 anit i Residential cx ars xc i Residential ct stomers Proposed rate: P 10 84 per unit; | Average usage: 0 15 units monih enh : i H early pay rebate relained, LCurent ra —— _ _ i 46 50 units month Proposed rate: F 47 17 per unit; phased i unit impler nentation over two billing cycles. i (10) working da ‘inal adoption. Alt adjust dames Mitchell Digitally signed on October 36, 2025 Rates and Tariffs Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_4_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Repubtic o¢ the Phitiopines EAST JAMES WATER DISTRICT PUBLIC BULLETIN: Biling Sehedute Adiustmen for FY: 926 averages ANd pro 1b consum siments 'S effective January CHANGE Tg tty surch, St; phased ANS Cycles 5 Of thie HPEATS ain te suis David shapman Signed on October 30 2025 Chief Finance Officer"
    },
    {
        "image": "bulletininfomaterials1_synth_4_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines EAST JAMES WATER DISTRICT 73964 Swanson Mountain, Rhodeschester, NV 23168 PUBLIC BULLETIN: Billing Schedule Adjustments for FY 2026 This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective January 18, 2026. BILL OF QUANTITIES CHANGE TO f Cc ial te commercial customers a Average usage: 16 50 units month Proposed rate: P 14 03 per unit; includes Current rate: P 13 28 per unit sustainability surcharge. Residential customers Proposed rate: P 10 79 per unit: Average usage: 0 15 units month 7 - Current rate: P 9 70 per unit early payment rebate retained. Institutional customers Average usage: Above 50 units month Proposed rate: P 21 17 per unit; phased Current rate: P 19 73 per unit implementation over two billing cycles. Stakeholders are invited to submit written comments within ten Compliance Board will consolidate feedback Prior to final adopti while keeping essential services affordable. (10) working days of this publication. The Regulatory ion. All adjustments aim to sustain infrastructure upgrades David Chapman Digitally signed on October 30, 2025 Chief Finance Officer"
    },
    {
        "image": "bulletininfomaterials1_synth_4_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic af the Phiingines EAST JAMES WATER DISTRICT tr, BV 23188 73964 Swanson Mountain, Rhodes PUBLIC BULLETIN: Billing Schedule Adjustments for FY 2026 urmpiion averages and projected adjusiments This bulletin outlines the summarized cons is 5 scling residential, commercial, and institutional consumers effective January BILL OF QUANTITIES CHANGE TO e Commercial customers \\verage usage: 16 80 units month iInchiges P 14 03 pert 'y surcharge. Proposed BP 40 79 pear unit; ie retained ential Average us i Current rat ge: Above se units month i n. The Regu infrastructure vu iihin ter: (10) work adioption, All adj David Chapman Digitally signed on October 30, 2025 Chief Finance Officer"
    },
    {
        "image": "bulletininfomaterials1_synth_4_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines EAST JAMES WATER DISTRICT 73964 Swanson Mountain, Rhodeschester, NV 23168 PUBLIC BULLETIN: Billing Schedule Adjustments for FY 2026 This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective January 18, 2026. f T _ | BILL OF QUANTITIES CHANGE TO r Commercial customers 4 Average usage: 16 50 units month Proposed rate: P (40s per unit; includes |_Current rate: P 13 28 per unit Sustainabilily surenarge. | — —_ Residential customers | Average usage: 0 15 units month ly- it rebate retained. Current rate: P 9 70 per unit i early Payment re ate retaine’ _ | Institutional customers | | Average usage: Above 50 units month Proposed rate: P 21 17 per unit; phased | Current rate: P 19 73 per unit implementation over two billing cycles. Proposed rate: 10 79 per unit; Stakeholders are invited to submit written comments within ten (10) working days of this publication. The Regulatory Compliance Board will consolidate feedback prior to final adoption. All adjustments aim to sustain infrastructure upgrades while keeping essential services affordable. David Chapman Digitally signed on October 30, 2025 Chief Finance Officer"
    },
    {
        "image": "bulletininfomaterials1_synth_4_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines EAST JAMES WATER DISTRICT PUBLIC BULLETIN: Billing Schedule Adjustments for FY 2026 This buitetin outlines the summarized consumpiion averages and atiecting residential, commercial 2026. ojected adjustments effective January 18, and institutional consum BILL OF QUANTITIES CHANGE TO Commercial custom Proposed rate P 44 93 per unit lability surcharge. includes 8 per ustomers, Above 50 units month Proposed rate: P 21 17 irentiate P 19 73 pe ure impiementati Requiarary siricture upgrades David Ch. Digitally signed on October 30, 2625 man Chief Finance Officer"
    },
    {
        "image": "bulletininfomaterials1_synth_5_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines NEW KAITLINBERG ELECTRIC COOPERATIVE 225 Foster Villages Apt. 644, Simpsonside, Hi 65784 TIN: Public Hearing on Updated PUBLIC BULLE Utility Charges and projected adjustments tion averages effective January 06, This bulletin outlines the summarized consump! i and institutional consumers affecting residential, commercial, 2026. CHANGE TO 49 89 per unit; includes BILL OF QUANTITIES Proposed rate: P sustainability surcharge. Institutional customers Above 50 units month Average usage: P 19 10 per unit Proposed rate: p 9 75 per unit; Current rate: early payment rebate retained. Residential customers Average usage: 0 15 units month ant rate: P 8 71 per unit rate: P 17 12 per unit; phased rrent fate. yi Commercial customers Average usage: 46 50 units month Proposed t rt Current rate: P 45 68 per unit implementation over two billing cycles. within ten (10) working days of this publication. The Regulatory to sustain infrastructure UPG! Stakeholders are invited to submit written comments Compliance Board will consolidate feedback prior to final adoption. All adj while keeping essential services affordable. justments aim Megan Cooper Digitally signed on October 30, 2025 Assistant General Manager for Customer Services"
    },
    {
        "image": "bulletininfomaterials1_synth_5_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Reoublic of the Philinpines NEW KAITLINBERG ELECTRIC COOPERATIVE ier Viloges Apt. 848, Simpsonside, HI 65784 PUBLIC BULLETIN: Public Hearing on Updated Utility Charges This bulletin oudines the summarized consumption averages and projected adjustments and institutional consumers effective January 06, CHANGE TG institu P 19 89 per unit: includes: OMmers @. 16 80 u Proposed rate: P 17 412 per unit; phased implementation over two billing cycles. i submit written come onsolidate feedba: wordabie, n (10) working days cf t Al adi Megan Cooper Digitaily signed on October 30, 2025 Assistant General Ma Customer Services"
    },
    {
        "image": "bulletininfomaterials1_synth_5_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines NEW KAITUNBERG ELECTRIC COOPERATIVE de, HI 68 7a4 PUBLIC BULLETIN: Public Hearing on Updaied Utility Charges This Duiletin outlines the s ing residential, camry mMmarnzed consurr NUON averages and projected adjustments Ciai, and institutional consumers effectye January 06, CHANGE TO P49 8S per unit; includ: es Hl tainability surcharge, tesidential cust Average u: | Proposed rate: 9 75 per unit: 2 UnSfmonth Lper init Clai customers s | Average u: 1689 units month Proposed rate: P4742 per unil: phased 2B 16 88 per unit implementation ove two billing cycles. 8atly payment rebate eguiatry ingre Megan Cooper Digitally signed on October 30, 2095 As General Man: for Customer §"
    },
    {
        "image": "bulletininfomaterials1_synth_5_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines NEW KAITLINBERG ELECTRIC COOPE! 844, Simpsonside, HI 65784 RATIVE 285 Foster Villages Apt. PUBLIC BULLETIN: Public Hearing on Updated Utility Charges erages and projected adjustments nes the summarized consumption av umers effective January 06, This bulletin outli tial, commercial, and institutional cons! affecting residen 2026. BILL OF QUANTITIES CHANGE TO Institutional customers 5, a ‘Average usage: Above 50 units month riage P 19 89 per unit; includes Current rate: P 19 10 per unit sustainability surcharge. Residential customers Average usage: 0 15 units month early- Current rate: P 8 71 per unit Commercial customers Average usage: 46 50 units month Proposed rate: P 47 42 per unit; phased Current rate: P 45 68 per unit implementation over two billing cycles. Proposed rate: P 9 75 per unit; payment rebate retained. ication. The Regulatory ing days of this publi structure upgrades. ts within ten (10) workit justments aim to sustain infra’ Stakeholders are invited to submit written comment Compliance Board will consolidate feedback prior to final adoption. All ad while keeping essential services affordable. Megan Cooper Digitally signed on October 30, 2025 Assistant General Manager for Customer Services"
    },
    {
        "image": "bulletininfomaterials1_synth_5_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Reoublic of he Philippines W KAITLINBERG i COOPERATIVE PUBLIC BULL ages and projected adjustments rercial, ark years effective january 06, ine suramarized con This bulletin outlines affecting regidential, come 2025. BLL OF QUANTITIES formers eo: Above SO units 1 rate: 9 75 pF curt Avere urrend fa) te. to final ado; kK por Megan Cooper Digitally signed on October 40, 2025 ager for Customer Services"
    },
    {
        "image": "bulletininfomaterials1_synth_6_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philipsines DISTRICT 2, RES2S0S TIN: Propased Rate Realignment Residential Consurners affecting 2028 rized consumption averages and projected adjustments fai, commercial, and institulional consumers effective January 29, BILL OF QUANTITIES CHANGE TG Commercial cusior includes ed rate: F 12 68 per iainability surcharge. 3 per unit; Hhufional customers ge usage: Above S9 units monin wited to submit written: wit consol ial comments within ten (10) working days of this publica: lo final adi aim to sus! Steven Maynard Digitally signed on October 3G, 2025 Chief Finance Officer"
    },
    {
        "image": "bulletininfomaterials1_synth_6_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines ALEXTON WATER DISTRICT 906 Eduardo Stravenue, North Kristen, RI 32309 PUBLIC BULLETIN: Proposed Rate Realignment for Residential Consumers This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective January 29, 2026. BILL OF QUANTITIES CHANGE TO awe 1 Commercial customers op Average usage: 16 50 units month Proposed rate: P 12 68 per unit; includes sustainability surcharge. Current rate: P 11 89 per unit Residential customers Proposed rate: P 9 93 per unit; Average usage: 0 15 units month early payment rebate retained. Current rate: P 9 07 per unit Institutional customers Average usage: Above 50 units month Proposed rate: P 16 52 per unit; phased Current rate: P 15 86 per unit implementation over two billing cycles. Stakeholders are invited to submit written comments within ten (10) working days of this publication. The Regulatory Compliance Board will consolidate feedback prior to final adoption. All adjustments aim to sustain infrastructure upgrades while keeping essential services affordable. Steven Maynard Digitally signed on October 30, 2025 Chief Finance Officer"
    },
    {
        "image": "bulletininfomaterials1_synth_6_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Phiipoines ALEXTON WATER DISTRICT 908 Eduardo Stuvenze, 5 Fu a2a08 PUBLIC BULLETIN: Proposed Rate Realignment for Residential Consumers This builetin outlines the summarized consumplion averages and projected iusiments: affecting residentiai, cornmercial, and institutional consumers effective January 29, BILL OF QUANTITIES CHANGE TO Commercial customers unis mo: 14 89 per unit H early paymert rebate refa oa 1 Ave’ age usage: Above 50 units month Current rate: 15 86 per unit ior fo final ack Steven Maynard Digitally signed on October 30, 2025 g as) Chief Finance Officer"
    },
    {
        "image": "bulletininfomaterials1_synth_6_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic Of the Philippines ALEXTON WATER DISTRICT 906 Eduardo Stravenue, N PUBLIC BULLETIN: Pro for Reside This bulletin outlines the summarized consu affecting residential, commerci: 2026. lorth Kristen, RI 32309 posed Rate Realignment ntial Consumers mption averages and Projected adjustments al, and institutional consumers effective January 29, BILL OF QUANTITIES Commercial Customers Average Usage: 16 50 units month Current rate: P 11 89 per unit CHANGE To Proposed rate: P 12 68 ber unit; includes Sustainability surcharge. Residential customers Average usage: 0 15 units month Current Fate: P 9 07 per unit Institutional Customers Proposed rate: P 9 93 per unit; early payment rebate retained. Average usage: Above 50 units month Current rate: P 15 86 per unit Proposed rate: P 16 52 Per unit; phased Stakeholders are invit Compliance Board will while keeping essenti: led to submit written I consolidate feedba al services affordable. Steven Maynard Digitally Signed on October 30, 2025 Chief Finance Officer comments within ten (10 Ck prior to final adoption. implementation Over two billing cycles, ——______ J !) working days of this Publication. The Regulatory All adjustments aim to Sustain infrastructure upgrades"
    },
    {
        "image": "bulletininfomaterials1_synth_6_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines ALEXTON WATER DISTRICT 906 Eduardo Stravenue, North Kristen, RI 32309 PUBLIC BULLETIN: Proposed Rate Realignment for Residential Consumers This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective January 29, 2026. BILL OF QUANTITIES CHANGE TO b Commercial customers Average usage: 16 50 units month Current rate: P 11 89 per unit Proposed rate: P 12 68 per unit; includes sustainability surcharge. Residential cust 1 te: ‘esidenta! customers Proposed rate: P 9 93 per unit; Average usage: 0 15 units month ae it rebate retained. Current rate: P 9 07 per unit early payment rebate retain —- Institutional customers Average usage: Above 50 units month Proposed rate: P 16 52 per unit; phased Current rate: P 15 86 per unit implementation over two billing cycles. ———_____j Stakeholders are invited to submit written comments within ten (10) working days of this publication. The Regulatory Compliance Board will consolidate feedback prior to final adoption. All adjustments aim to sustain infrastructure upgrades while keeping essential services affordable. Steven Maynard Digitally signed on October 30, 2025 Chief Finance Officer"
    },
    {
        "image": "bulletininfomaterials1_synth_7_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "LAWRENCESHIRE ELECTRIC COOPERATIVE 039 Hannah Creek, Moralesbury, NH 11009 PUBLIC BULLETIN: Billing Schedule Adjustments for FY 2026 This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective December 29, 2025. BILL OF QUANTITIES CHANGE TO Residential customers . it: i Average usage: 0 15 units month Proposed rate: P 9 98 per unit; includes Current rate: P 9 52 per unit sustainability surcharge. Commercial customers Proposed rate: P 14 43 per unit; Average usage: 16 50 units month early payment rebate retained. rrent rate: P 13 96 per unit Institutional customers Average usage: Above 50 units month Proposed rate: P 21 29 per unit; phased Current rate: P 20 30 per unit implementation over two billing cycles. Stakeholders are invited to submit written comments within ten (10) working days of this publication. The Regulatory Compliance Board will consolidate feedback prior to final adoption. All adjustments aim to sustain infrastructure upgrades while keeping essential services affordable. Damon Garner Digitally signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_7_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Pollippines LAWRENCESHIRE ELECTRIC COOPER, Hannah Creek, ATIVE voralesbury, NH 71008 PUBLIC BULLETIN: Billing Schedule Adjustments for FY 2026 This bulletin outlines the summarized consumption ay p affecting residential, commercial, and institutional cor ges and projected adjustments 8 effective December 29, CHANGE TO ‘Gposed rate: P S 38 per unit: stainability sur osed rate: F 14 43 per unit: nents with prior fo Gral a: ten Thing A. AY adtuste Damon Garner Digitally signed on October 30, 2028 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_7_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines LAWRENCESHIRE ELECTRIC COOPERATIVE 039 Hannah Creek, Moralesbury, NH 11009 PUBLIC BULLETIN: Billing Schedule Adjustments for FY 2026 This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective December 29, 2025. BILL OF QUANTITIES CHANGE TO Proposed rate: P 9 98 per unit; includes sustainability surcharge. j r . Residential customers Average usage: 0 15 units month Current rate: P 9 52 per unit Commercial customers Proposed rate: P 14 43 per unit; Average usage: 16 50 units month , ‘i | it rebate retained. Current rate: P 13 96 per unit early payment rebate retaine’ Institutional customers | Average usage: Above 50 units month Proposed rate: P 21 29 per unit; phased Current rate: 20 30 per unit implementation over two billing cycles. es Stakeholders are invited to submit written comments within ten (10) working days of this publication. The Regulatory Compliance Board will consolidate feedback prior to final adoption. All adjustments aim to sustain infrastructure upgrades while keeping essential services affordable. Damon Garner Digitally signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_7_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines LAWRENCESHIRE ELECTRIC COOPERATIVE 039 Hannah Creek, Moralesbury, NH 11009 PUBLIC BULLETIN: Billing Schedule Adjustments for FY 2026 This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective December 29, 2025. a | BILL OF QUANTITIES CHANGE TO F Residential customers a ~| A Proposed rate: P 9 98 per unit; includes Average usage: 0 15 units month i Pr |Current rate: P 9 52 per unit sustainability surcharge. Commercial customers | Proposed rate: P 14 43 per unit; : Cure ease: ho pean early payment rebate retained. Institutional customers Average usage: Above 50 units month Current rate: 20 30 per unit Proposed rate: P 21 29 per unit; phased implementation over two billing cycles. Stakeholders are invited to submit written comments within ten (10) Compliance Board will consolidate feedback Prior to final adoption. while keeping essential services affordable. working days of this publication. The Regulatory All adjustments aim to sustain infrastructure upgrades Damon Garner Digitally signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_7_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Pipes CESHIRE ELECTRIC COOPERATV Moraiesbury, NH 14902 LAWREN 049 Hannah PUBLIC BULLETIN: Billing Schedule Adjustments for FY 2026 ss and projected adjustments 3 effective December 2S, motion aver rized CONS! snail CONSUiTt “in outlines the gumimanz! nis, commercial, and insti This 6 affecting restae BILL OF Quantities Residential custor Average usage: 44 45 peru ained. stomers 49 50 unis menth 21 28 per unit: phas repased fale. ig cycles. i implementation over two pil Average used Current rate: P 2! sit i ten (40) work! Ait adjustments 4! omments within adoption. sit woitten feodback prior 10 fines consol aries ato oo ‘Damon Gamer, Digitaliy signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_8_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines SCHNEIDERBURGH PUBLIC UTILITY AUTHORITY 9317 Johnson Islands Suite 651, South Brandishire, MA 67237 PUBLIC BULLETIN: Public Hearing on Updated Utility Charges This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective December 18, 2025. BILL OF QUANTITIES CHANGE TO Institutional customers Average usage: Above 50 units month Current rate: P 17 51 per unit Residential customers Average usage: 0 15 units month rrent rate: P 10 19 per unit Commercial customers Average usage: 16 50 units month Current rate: P 15 23 per unit Proposed rate: P 18 13 per unit; includes sustainability surcharge. Proposed rate: P 10 76 per unit; early payment rebate retained. Proposed rate: P 16 05 per unit; phased implementation over two billing cycles. Stakeholders are invited to submit written comments within ten (10) working days of this publication. The Regulatory Compliance Board will consolidate feedback prior to final adoption. All adjustments aim to sustain infrastructure upgrades while keeping essential services affordable. Cameron Jordan Digitally signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_8_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines SCHNEIDERBURGH PUBLIC UTILITY AUTHORITY 93 7 Johneon istsnds Sulla 65%, Soulh Srancienie, MA 67237 PUBLIC BULLETIN: Public Hearing on Updated Utility Charges This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective December 18, 2025. e _______________— i BILL OF QUANTITIES CHANGE TO i Proposed rate: 18 13 per unit: includes i sustainability surcharge. f institutional customers Average usage: Above 50 units month Curent rate: P 17 51 perunit Residential customers Proposed rate: P 40 76 per unit; Avarage usage: 0 15 units month 1 t te -etained | Conenttaeietiitiolentint eat payment rebate retained. i Commercial customers . | Average usage: 16 50 units month Proposed rate: P 16 05 per unit; phased H 45 23 per unit implementation over two billing cycles. en at cn re an en} Stakeholders are invited to submil written comments within ten (40) working days of this publication. The Regulatory Compliance Board will consolidate teedback prior to final adoption. Ail adjustments aim to sustain infrastructure upgrades while Keeping essential services atfordable. Cameron Jordan Digitally signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_8_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines SCHNEIDERBUR: UTILITY AUTHO ndishire, MA 7247 TY PUBLIC BULLETIN: Public Hearing on Updated Utility Charges This bulletin outlines the summarized affecting residential, commercial, ar onsumplion averages and projected adjustments nsitulional consume: clive December 18, BILL OF QUANTITIES i CHANGE TO Proposs B48 73 per unit: includes sustain charge. 80 units month umisimonth phased nycles. Current tate: 15 23 per unit re comments wi 40) working Joption. All ad: 1s aim to ucture upgrades Cameron Jordan Digitally signed on October 30, 2025 aos Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_8_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines SCHNEIDERBURGH PUBLIC UTILITY AUTHORITY 9317 Johnson Islands Suite 651, South Brandishire, MA 67237 PUBLIC BULLETIN: Public Hearing on Updated Utility Charges This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective December 18, 2025. BILL OF QUANTITIES CHANGE TO Institutional customers 7 Average usage: Above 50 units month Proposed rate: P ie 13 per unit; includes i Current rate: P 17 51 per unit Sustainability Surcharge. Residential customers Proposed rate: P 10 76 per unit; Average usage: 0 15 units month lye t reb: te tai | Current rate: P 10 19 per unit _ i early payment rebate retained. _ Commercial customers | Average usage: 16 50 units month Proposed rate: P 16 05 per unit; phased Current rate: P 15 23 per unit implementation over two billing cycles. Stakeholders are invited to submit written comments within ten Compliance Board will consolidate feedback prior to final ado while keeping essential services affordable. (10) working days of this publication. The Regulatory tion. All adjustments aim to sustain infrastructure upgrades Cameron Jordan Digitally signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_8_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines SCHNEIDERBURGH PUBLIC UTILITY AUTHORITY 9317 Johnson Islands Suite 651, South Brandishire, MA 67237 PUBLIC BULLETIN: Public Hearing on Updated Utility Charges This bulletin outlines the summarized consumption averages and projected adjustments affecting residential, commercial, and institutional consumers effective December 18, 2025. BILL OF QUANTITIES CHANGE TO Institutional customers Average usage: Above 50 units month Current rate: P 17 51 per unit Residential customers Proposed rate: P 10 76 per unit; Average usage: 0 15 units month 7 t bate tained Current rate: P 10 19 per unit CONST OC ral Commercial customers Average usage: 16 50 units month Proposed rate: P 16 05 per unit; phased Current rate: P 15 23 per unit implementation over two billing cycles. Proposed rate: P 18 13 per unit; includes sustainability surcharge. Stakeholders are invited to submit written comments within ten (10) working days of this publication. The Regulatory Compliance Board will consolidate feedback prior to final adoption. All adjustments aim to sustain infrastructure upgrades while keeping essential services affordable. Cameron Jordan Digitally signed on October 30, 2025 Billing and Collections Manager"
    },
    {
        "image": "bulletininfomaterials1_synth_9_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines WHITESHIRE WATER DISTRICT 780 Lisa fsiands Agt 908, Fert Barbara, NM PUBLIC BULLETIN: Proposed Raie Realignment for Residential Consumers guilines the summarized consumption averages and projected adjustments dential, commercial, and institutional consumers effective February 24, BILL OF QUANTITIES CHANGE TO i { onal cusiomers ou mon —- Uses ‘Above 50 units month Proposed rate: F 20 74 per unit; include i ni rate: F 19 80 0 susiainabili surcharge rf ip 50 uniis month mimercial custo: Proposed rate: 15 29 per i Average usage: 16- PO ip eatly payr MGS ge: 0 15 5 wine 1g days of this publication. The Ri siments aim to sustain infrastuclure upgrades t to tinal ack option. Aa au fordable. Anthony Lane igitally signed on October 30, 2025 Rates and Tariffs Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_9_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines WHITESHIRE WATER DISTRICT 786 Lisa tslands apt arbara, WM 94938 PUBLIC BULLETIN: Proposed Rate Realignment for Residential Consumers This bulletin outlines the summarized consumption ave: affecting residential, commerci 2 #, and insifut FAgeS anc projected adjusiments active February 24, CHANGE TO ed rate: 20 74 par unit, includes ity 15 28 per unit: ebate re ge: 0 15 units r trate. P $57 per un! rate: P 9 68 per uni entation ever b king days of this publics option. Ali adius' on. The Regulatory 1 Infras: i ate essetiial services affordable. togrades: Anthony Lane Digitally signed on October 30, 2025 Rates and Tariffs Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_9_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Phitigpines WHITESHIRE WATER CISTRICT 780 Lisa isiands Por Barbara, the aa tag PUBLIC BULLETIN: Proposed Rate Realignment for Residential Consumers This bulletin o nes the summarized consumy atfec commercial pion averages and Projected g 8nd institutional CONST cjustments ers effective February 24, BILL OF QUANTITIES CHANGE TO i institulional cus: Average uss NES ove SO unitsimonth nun! 20 74 per unit; inciudes i i ge, i ct i s Customers Average usage: 18 59 units month Current rate: 2 44 32 Residential custome Averaga usage: 0 45 Posed rate: 15 29 per unit; eath payment rebate retained, Hation over fer two billing cycles i ier are invited to submit writ Hoe Board wy S within ten £79) WOrkiNIg days of tf to final adoption, Aw adjustnent fory astructure upg Apthony Lane Digitaily signed on October 30, 2025 Rates and Tarit 3 Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_9_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Repubile WHITESHIRE he Phitipgines WATER DISTRICT Port Sarnara, NM PUBLIC BULLETIN: Proposed Rate Realignment for Residential Consumers s the summariz jes and projected adjustments commercial, and instiutional consumers effective February 24, BILL OF QUANTITIES CHANGE TO 2 B 20 74 per unit: includes: j O unitsimonih y¥ surcharge. raise: B G 88 per on over fwo b re upg er Anthony Lane digitally sic Rates and Tariffs Division Head"
    },
    {
        "image": "bulletininfomaterials1_synth_9_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "hilppines WHITESHIRE 4 /ATER DISTRICT PUBLIC BULLETIN: Proposed Rate Real ignment for Residential Consumers Surma MmMercia €d consumption averages and and institut Projected adju onal consumers e BILL OF QUANTITIES {tutional customers i 15 units month Proposed rate: 4 98 pe Current rate: 8 5 implem 8 are Board wit Anthony Lane Digitally signed an October 30, 2025 Rates and Tariffs Division Head"
    },
    {
        "image": "bulletininfomaterials2_synth_11_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "LAURAHAVEN PF Ye tenets Fors Sune 98 Rameinny NAY Bid Bulletin No, 2026 51 CATIONS WD REQUIREM READINESS SUPPUES ferand: Oct 28, 2625 NTS: DISASTER tow watete exrenys moysinor) wpcaten Har toe tna readies sete vs under ton Special Treat FNS wor 08 2029, a annem = Bebrey pod sree to 99 8 pyeeowet who eppeatie i 4 Neporsns Romaectore it ‘i + Coordinate schackle for site mnspaction throug? the Secretariat bottires 1 Ce bisks shat be automatically rajected pursuant to Sertion $5 i pe bid conference wil bo streamed via the agency s secured piettorm \" Richard Sea) Coxtrnenng ant Comsnnae Une Rengarnin Grant tt is set Anes Cements CODrvE U i"
    },
    {
        "image": "bulletininfomaterials2_synth_11_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": ""
    },
    {
        "image": "bulletininfomaterials2_synth_11_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Bid Bulletin No. 2025 51 CATIONS TO BID REQUIREMENTS READINESS SUPPLIES. iat hotline inspection thro dinate ate bids shall b omatically rejected purs be streamed via the agency s s+ 4 platform"
    },
    {
        "image": "bulletininfomaterials2_synth_11_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "EIIEESOS S'' Reputiic of the Philippines LAURAHAVEN PROCUREMENT SERVICE 7M Medora Forts Sute 38, Mencctnry Mid Bid Bulletin No. 2025 51 CLARIFICATIONS TO BID REQUIREMENTS: DISASTER READINESS SUPPLIES Issued: Oct 28, 2025 Tis butetn conveys equation updates fr te daaster medness suppies coverng Sue! masks and dagnoste hts, procured under te Specie! Trust Fund. The BAC sues ‘hese clantcatons punuant to GPPB Resoktion 09 2020 ‘Av sated ia the Bid Document Modification’ Amendmeats Prove proof of completed sender Detwery pesod shomened to sty (0) contacts when te ast vee years ender days ‘Attach notarced jon vente Evaluation erteron now nekides sarement where appicane, sttanadity score wegning inchude eudted tnanciel statements for * Technical specticaton tor core components he past two face! yours svaed per Annex C Important Reminders: Coordinate schedule for site inspection through the Secretariat hotline. Late bids shall be automatically rejected pursuant to Section 35. ‘re bid conference will be streamed via the agency s secured platform. +P Pease be guided accordingly Richard Smith Conmactng and Comptance Unt Benjamin Grant ‘Ss and Awards Committee Chaeperion"
    },
    {
        "image": "bulletininfomaterials2_synth_11_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Benjamin as and Asa"
    },
    {
        "image": "bulletininfomaterials2_synth_12_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Pony ovNTHIE PROX Bid Buteta No. SE OF Bin PARAGIE READIME: wee: Cet 25, “This puted convey mgutatoyuntatns for me doaaterienniness sappies cowsing cv wore for budding etruting, gronmess under tre Specie Tors Rung, TAR BAC Ses Mess vane eunuaet to Agency Peavurucrant Re saiae ie tae BS sore sie midter tranese starginent —“T |For the asi bre sea! yore Luiancbiy sme agony. [-Untte Section Vit chackist wit anamiy onverge sauetec to tao yeas ey leasance VBA. anata veces i ica sameitaation ter sare cemmpanaats fraparieat Reminders E Prebid conference will be streamed via the agency s secuted platy u Cocrdinate schedule for site inspection thimagh iis Secretariat hati ats bids shai! be automatically rejected pursuant te Section 34 Yolanda Caran SAC Sacrotanat Richard Lows"
    },
    {
        "image": "bulletininfomaterials2_synth_12_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines PORT CYNTHIA PROCUREMENT SERVICE 158883 Chaves Mission, Port Hecistad CT Bid Bulletin No. 2025 24 NOTICE OF BID PARAMETER UPDATES: DISASTER READINESS SUPPLIES Issued: Oct 25, 2025 coverng vi _Tns bubetn conveys regulatory updates for the disaster readiness supplies ‘eaves these rons for buiding revofiting, procured under the Special Trust Fund. The BAC “itrcetions pursuant to Agency Procurement Manual 2024. in the Bid Document ModificationTAmendim ae “pctae aed trancilsizements |= Eyauaton iteion now nckdes for the past two fiscal years. sustainability score dlanting ipdate Section Vl checktst wih * Warranty coverage acusted to two @) years current tax clearance vakity onate serie. Technical spectieaion for core components Secure manufacturers authorization revised per Annex C. ‘specific to the proposed brand, Important Reminders: Pre bid conference will be streamed via the agency s secured platform. Coordinate schedule for site inspection through the Secretariat hotline. Late bids shall be automatically rejected pursuant to Section 35. Please be guided accordingly. Yolanda Duran BAC Secretariat Richard Lewis Bids and Awards Commitee Chairperson"
    },
    {
        "image": "bulletininfomaterials2_synth_12_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": ""
    },
    {
        "image": "bulletininfomaterials2_synth_12_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": ""
    },
    {
        "image": "bulletininfomaterials2_synth_12_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "FORT CYNTHIA PROCL aaah Cmoves Mase Bid Bulletin No. 2025 24 NOTICE OF BID PARAMET ER UPDATES: :SASTER READINESS SUPPLIES issued Out 25, 2075 oe Special Vsti Pon ne busin serves mgeweny URS wots tor ahr meme nage 7 andi fe Bde T [pects nse trance sates T+ Regicanuy manne ne for he past inca yee sovimnatity sea wept Umrate Sectan Vi check a> Mpa nuvi 92 Mo 0 coarent tar cmaraees vateey STecressin te sow ceroorana Uamportan: Remindess cured patton Pra bid conference wil be streamed via the agency s rat rooiree Coordinate schedule for sie inspection throvagt the S Late bids shall be automatically rejected pursuant *"
    },
    {
        "image": "bulletininfomaterials2_synth_13_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": ""
    },
    {
        "image": "bulletininfomaterials2_synth_13_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic ofthe Philipines LEELAND PROCURFMENT SFRVICE os ns Estate, Soetaberg NJ Bid Bulletin No. 2025 50 GUIDANCE ON. TECHNICAL SPECIFICATIONS: FACILITY RENOVATION WORKS Issued: Oct 21, 2025 tos for the facity renovation works cove’ wy under the Development Assistance Gr Resokston 09 2020. sys regulator upda sing securty rant. The BAC ‘This bubetin conves Senices, procure! ‘guard augmentation aiies these carfeations pursuant 0 GPPS Fe ‘As stated in the Bid Document Modification Amendments _ secure manufacturer s authorzation ‘Submission portal remains open untl 5 00 {spect tothe proposes brand caearaoona date. Parent coverage adjusted to two (2) Yeas ipdate Section Vl checklist wih |Current tax clearance vaby nude audted franca statements [roche past two seal years. | onate sence oF Ston eaterion now nchades _| sustanabity score weaning _ Important Reminders: Coordinate schedule for site inspection through the Secretariat hotline Cate bids shall be automatically rejected pursuant to Section 36. \"Eure compliance with the latest health and safety protocols upon entry. Please be guided accordingly Deborah Whitehead Procurement Pissing Division ‘Matthew Smith BAC Technical Working Group Lead"
    },
    {
        "image": "bulletininfomaterials2_synth_13_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "GUIDANCE FACH"
    },
    {
        "image": "bulletininfomaterials2_synth_13_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": ""
    },
    {
        "image": "bulletininfomaterials2_synth_13_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republi ofthe Philippines LEELAND PROCURFMENT SFRVICE ‘24004 Isaiah Estate, Shesaberg NI Bid Bulletin No. 2025 50 GUIDANCE ON TECHNICAL SPECIFICATIONS: FACILITY RENOVATION WORKS Issued: Oct 21, 2025 ‘This bubetn conveys regulatory updates for the facity renovation works coverng securty ‘Quard augmentation services, procured under the Development Assistance Grant, The BAC lssves these clarflatons pursuant to GPPB Resolution 00 2020. TAs stated fa the Bid Document Modification Amendments Secure manufacturers authorization] submission portal remains open unti 5 00 ‘speci to the proposed brand. puleoaeangase Update Section Vil checklist with Warranty coverage adjusted to two (2) years ‘current tax clearance vali consis seren, Include audited financial statements |\" Evaluation criterion now nckides {or the past two fiscal years. sustanabity score weghting Important Reminders: Coordinate schedule for site inspection through the Secretariat hotline. Late bids shall be automatically rejected pursuant to Section 35, Ensure compliance with the latest health and safety protocols upon emmy. Please be gunted accordingly Deborah Whitehead Procurement Panning Division ‘Matthew Smith BAC Technical Working Group Lead"
    },
    {
        "image": "bulletininfomaterials2_synth_14_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "ALORS"
    },
    {
        "image": "bulletininfomaterials2_synth_14_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic ofthe Philipines TAYLORSTAD PROCUREMENT SERVICE 708 Shatier Views Sute 262, Francerburgh WA Bid Bulletin No. 2025 90 SUPPLEMENTAL NOTICE TO BIDDERS: CAMPUS SECURITY OUTSOURCING Issued: Oct 27, 2025 ‘This buletin conveys regulatory updates forthe campus secutty outsourcing covering ‘surgical masks and diagnostic kts, procured under the Special Trust Fund. The BAC issues these clarifications pursuant to GPPS Resolution 00 2020. ‘As stated inthe Bid Document ModificationVAmendments Update Section VIl checkist with lcurent tax clearance vad. Inckide audited financial statements for * Technical specication for core components the past two fiscal years. revised per Annex. ‘Attach notarized joint venture “Delvery period shortened to sty (60) [agreement where appkoable calendar days. Important Reminders: Pre bid conference will be streamed via the agency s secured platform. Mark outer envelopes with the procurement reference code. Ensure compliance with the latest health and safety protocols upon entry. Please be guided accordingly Tara Davis BAC Secretariat Donna Snyder ‘ids and Awards Commitee Chairperson"
    },
    {
        "image": "bulletininfomaterials2_synth_14_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic ofthe Philippines TAYLORSTAD PROCUREMENT SERVICE 706 Shatter Views Sute 288, Francesburgh WA Bid Bulletin No. 2025 90 SUPPLEMENTAL NOTICE TO BIDDERS: CAMPUS SECURITY OUTSOURCING Issued: Oct 27, 2025 ‘This buletin conveys regulatory updates for the campus securty outsourcing covering surgical masks and diagnostic kts, procured under the Special Trst Fund. The BAC waves these clatications pursuant to GPPB Resokition 09 2020. ‘As stated in the Bid Document MedificationvAmendac Update Section Vil checkist with Evaluation exteron now mnekdes ‘cument tax clearance vabty sustanabity score weighing Include audited francil statements for * Technical specifeaton for core components the past two fiscal years revised per Annex C. Attach notarzed joint venture \"Delvery period shortaned to sixty (60) agreement where applicable calendar days. Important Reminders: Pre bid conference will be streamed via the agency s secured platform Mark outer envelopes with the procurement reference code. Ensure compliance with the latest health and safety protocols upon entry. Please be guided accordingly Tara Davis BAC Secretariat Donna Snyder ‘ids and Awards Commitee Chairperson"
    },
    {
        "image": "bulletininfomaterials2_synth_14_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "a DIS sare"
    },
    {
        "image": "bulletininfomaterials2_synth_14_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "puiic of Be Prtiops PROCUREMENT SERVICE oe aes Date 298, Franson WA, TAYLORST/ Bid Builetin No. 2025 90 SUPPLEMENTAL NOTICE TO BIDDERS: CAMPUS SECURITY OUTSOURCING enue Oct 27, 2025 fee De canon mecwity eusoutng coves ‘Speaai Twat Fur, The BAC txwes pound shermrea t6 ety (20) ars rapertens Rovamngers: Procbid confercnce wil be sinsamed vis the sgancy s secured platicem. Mhurk cuter anvelopes wih the procsrement isiarence code Ensure crnpllance with the latesi hesith end safety protocols upon entry pilot accordingly Das BAC Socrutsriat Danes Syter ‘5s and Meaces Cortes Champerssn"
    },
    {
        "image": "bulletininfomaterials2_synth_15_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic ofthe Philippines WEST SUSAN PROCUREMENT SERVICE 300 Frzgeraé Stream Sute 702, Lake Krsineberg SD Bid Bulletin No. 2025 63 NOTICE OF BID PARAMETER UPDATES TRANSPORTATION FLEET LEASING Issued: Oct 19, 2025 This buletin conveys regulatory updates forthe tansportation feet leasing covering ‘emergency response equipment, procured under the Development Assistance Grant, The BAC issues these clarficatons pursuant to Republe Act 9184 Asstated inthe Bid Document] ModificationVAmendmeats Update Section Vil checklist with current tax clearance vaidty Include audited financial statements nty coverage adjusted to two (2) years {for the past two fiscal years. senvon Secure manufacturer s authorization |\" Delvery perod shortened to sixty (60) ‘Specific tothe proposed brand, calendar days Technical specification for core components revised per Annex C. Important Reminders: Late bids shall be automatically rejected pursuant to Section 35, Coordinate schedule for site inspection through the Secretariat hotline. Pre bid conference will be streamed via the agency s secured platform. Please be guided accordingly. Kelsey Morales Contracting and Comptance Unit Ariel Wiliams 8: and Awards Commitee Chavperson"
    },
    {
        "image": "bulletininfomaterials2_synth_15_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "WEST SUSAN PROCUREMENT SERVICE S00 Fzgerad Steam Sute 702, Late Krsineberg SD Bid Bulletin No. 2025 63 NOTICE OF BID PARAMETER UPDATES. TRANSPORTATION FLEET LEASING. Issued: Oct 19, 2025 ‘This bulletin conveys regulatory updates forthe transportation fleet leasing coverng ‘emergency response equioment, procured under the Development Assistance Grant, The BAC ssues these clarficatons pursuant to Republic Act 9184 As stated in the Bid Document Modification/ Amendments Update Section Vil checkist with ‘Technical specteation forcore components current tax clearance valisty revised per Annex C Include aucted financial statements Warranty coverage adjusted to two (2) years for the past two fiscal years. on site servos |- Secure manufacturer s authorization * Delvery penod shortened to srt (60) specific to the proposed brand. _| catendar days Important Reminders: Late bids shall be automatically rejected pursuant to Section 35. Coordinate schedule for site inspection through the Secretariat hotline Pre bid conference will be streamed via the agency s secured platform Please be gu Kelsey Morales Contracting and Comptance Unt Ariel Williams is ana Auards Commstee Charperson"
    },
    {
        "image": "bulletininfomaterials2_synth_15_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "BID PARAMETE UPDATES STATION FLEET LEAS NG Gaon and Annes Cemece CAHIR"
    },
    {
        "image": "bulletininfomaterials2_synth_15_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republi ofthe Philipps WEST SUSAN PROCUREMENT SERVICE 300 Faget Steam Sute 792. Lake Krsinaberg SO Bid Bulletin No. 2025 63 NOTICE OF BID PARAMETER UPDATES: TRANSPORTATION FLEET LEASING Issued: Oct 19, 2025 ‘Tha buletn conveys regulatory updates for he vansporaton fee! easng coverng ‘emergency maponse equemant. procured under the Development Assistance Grant. The BAC asues these clanficatons pursuant to Republe Act 9184 ‘As ated lathe Bid Document Wodificationy Amendments Update Secton Vil checktt wah Tecnnea! specteaton fo core components ‘current tax clearance vaicty revaed per Annex C Include audted francial statements Warranty coverage adjusted to two 2) years for the past two facal years on ate serve Secure manutacturers authorization |\" Delvery perod shortened to saty 0) ‘spectic to the proposed brand calendar days Important Reminders: Late bids shall be automatically rejected pursuant to Section 35, Coordinate schedule for site inspection through the Secretariat hotline. Pre bid conference will be streamed via the agency s secured platform. Pease be gunded accordingly Kelsey Morales Contacting ané Compliance Unt ‘Ariel Williams, ‘its and Awards Commitee Chairperson"
    },
    {
        "image": "bulletininfomaterials2_synth_15_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic ofthe Philipines WEST SUSAN PROCUREMENT SERVICE 1300 Fitzgerald Sveam Sue 702, Lake Kisineberg SD Bid Bulletin No. 2025 63 NOTICE OF BID PARAMETER UPDATES: TRANSPORTATION FLEET LEASING Issued: Oct 19, 2025 ‘This bulletin conveys regulatory updates forthe transportation feet leasing covering ‘emergency response equipment, procured under the Development Assistance Grant, The BAC issues these clarifications pursuant to Repubbe Act 0184 ‘As sated in the Bid Document ModificationAmendments Update Section Vl checklist with “Technical specication for core components current tax clearance vali. revised per Annex C. Include aucited financial statements _| waranty coverage adlusted to two (2) years forthe past two fiscal years. on ste service Secure manufacturer s authorization * Delvery period shortened to sixty (60) spectfc to the proposed brand, calendar days. Important Reminders: Late bids shall be automatically rejected pursuant to Section 35. Coordinate schedule for site inspection through the Secretariat hotline. Pre bid conference will be streamed via the agency s secured platform. Please be guided accordingly Kelsey Morales Contracting and Compliance Unt Ariel Williams Bids and Awards Commitee Chairperson"
    },
    {
        "image": "bulletininfomaterials2_synth_16_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Bid Bulletin"
    },
    {
        "image": "bulletininfomaterials2_synth_16_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": ""
    },
    {
        "image": "bulletininfomaterials2_synth_16_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": ""
    },
    {
        "image": "bulletininfomaterials2_synth_16_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic ofthe Philippines CONTRERASSHIRE PROCUREMENT SERVICE {3569 Douglas Por, Heringborough PA Bid Bulletin No. 2025 24 ADVISORY ON PROCUREMENT SCHEDULE: MEDICAL CONSUMABLES SUPPLY Issued: Oct 16, 2025 ‘This bulletin conveys regulatory updates forthe medical consumables supply covering ‘securty guard augmentation sences, procured under the General Appropriations Act. The BAC issues these clarifications pursuant to GPPB Resolution 09 2020, As sated in the Bid Document ModificationAmendments -Attach notarzed joint venture Evaluation erteron now ineudes [agreement where applicable sustainabity score weighting. inckide audited financial statements for * Bid securty amount recalbrated to two the past two fiscal years. percent (2%) of ABC. Provide proof of completed sma Warranty coverage adlusted to two (2) years contracts within the last thee years. lon ste service Important Reminders: Pre bid conference will be streamed via the agency s secured platform. Coordinate schedule for site inspection through the Secretariat hotline. Late bids shall be automatically rejected pursuant to Section 35, Please be guided accordingly Justin Phillips Procurement Planing Division Nicholas Knight BAC Technical Working Group Lead"
    },
    {
        "image": "bulletininfomaterials2_synth_16_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philipps CONTRERASSHIRE PROCUREMENT SERVICE 13800 Dougan Por, Hermgboragh PA. Bid Bulletin No. 2025 24 ADVISORY ON PROCUREMENT SCHEDULE: MEDICAL CONSUMABLES SUPPLY issued: Oct 16, 2025 ‘Tha Duletn conveys regulator ubdates for he mada! consumabias supp coverng securty quand augmentation senvees, procured under the General Appropaations Act. The BAC aves mee canfcatons punuant to GPPB Rasotston 09 2020 1s sated lathe Bid Document Mecificatioay Amendments Anach notarced pant ventow Evauaton ertenon now neudes nomement were appicade setanabany score wegning ncarde audited trance! statements for * Bd securty amount ealbrated to two ‘the past two fal years pereent 2%) of ABC. Provele poo! af complied tera Waranty coverge adjusted to two @2) years contacts wah the ast owe years on ste service Important Reminders: Pre bid conference will be streamed via the agency s secured platform. Coordinate schedule for site inspection through the Secretariat hotline. Late bids shall be automatically rejected pursuant to Section 35. Please be gunded sccordinghy Justin Phillips Procenert Parnng Dun Nicholas Knight BAC Technical Working Group Lead"
    },
    {
        "image": "bulletininfomaterials2_synth_17_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": ""
    },
    {
        "image": "bulletininfomaterials2_synth_17_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Regain of te Melippore OUTn CHeesT SENERUOROUTS PROCUNERAINT GAACE (iad ean Hay Date EDA, oat AB Rid Bultetin No. 2025 54 CLARIFICATIONS TO BID REQUIREMENTS: WASTE MANAGEMENT SERVICES insures. Oct 27, 2005 ‘Ths butane soovmys seguistory upsctar In: Ge wetie manegere” ceircmmagemert vabearphens, pomues uncer the Corvebamant Kenasence Gren rave tree ciactemtons purser to Raweite Act [2c venity amount wontbeates te poe | peners omrer AB reve pevet of eomeiien sinter |\" inwonnty crew adquted fo tro ([gomtncts wetvn tho mat Sure yoo ase gas an tnporat Rerindecr Pre bid conferunce wit be sirwamad vie the agency s secures platform {Ensure comgéiance with the latest tealth and sabety protocols upon ey ‘Coordinate schedule for site inapaction through the Secretsstst Yenase ne gotded sccoesieghy Nicholas Hays BAC Gecroianat Veronica Sultan fon an hate Comumaien Coaterten"
    },
    {
        "image": "bulletininfomaterials2_synth_17_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": ""
    },
    {
        "image": "bulletininfomaterials2_synth_17_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Bid Bulletin No. 2025 o_o"
    },
    {
        "image": "bulletininfomaterials2_synth_17_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic ofthe Philipines ‘SOUTH CHRISTOPHERSOROUGH PROCUREMENT SERVICE (08045 Michael Key Sute 538, Nehlsmouth AR Bid Bulletin No. 2025 54 CLARIFICATIONS TO BID REQUIREMENTS: WASTE MANAGEMENT SERVICES Issued: Oct 27, 2025 “This bulletin conveys regulatory updates forthe waste management sevces coveing leaming management subscriptions, procured under the Development Assistance Grant, ‘The BAC issues these clarfications pursuant to Repubic Act 9184, As stated in the Bid Document -Attach notarzed joint venture agreement where apphoabe |-Update Secton Vil checksst with coment tax clearance vaidty. Provide proof of completed similar [contracts within the las tree years Modifications Amendments Technical specification for core components revised per Annex. Bid securty amount recabrated to two percent 2%) of ABC. Warranty coverage adjusted to two (2) years Important Reminders: Pre bid conference will be streamed via the agency s secured platform, Ensure compliance with the latest health and safety protocols upon entry. Coordinate schedule for site inspection through the Secretariat hotline. Please be guided accordingly Nicholas Hays BAC Secretariat Veronica Sullivan ‘Bids and Awards Commitee Chaiperson"
    },
    {
        "image": "bulletininfomaterials2_synth_18_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philipines LAKE JOSHUA PROCUREMENT SERVICE “Err Buster Foxpe, Lane Cheyennefit FM Bid Bulletin No. 2025 110 NOTICE OF BID PARAMETER UPDATES: WASTE MANAGEMENT SERVICES Issued: Oct 24, 2025 1 updates forthe waste manai nt, procured under the SP ‘agency Procurement Man ModificationvAmendments “This buletin conveys regulato tmergency response equieme’ these dlarications pursuant 12 cevetetes Bid Document secure manufacturer s authoreation Jepecte toe proposed band \"Update Section Vil checkist with Submission portal remains open unt! 5 00 Mon closing date Pawanty coverage adjusted 1 two (2) years iment tox dearance vaby. eae see nach notaraea ont venture ee ers ecicaton fr core components yoement where apptcabi rwvond per Annex C. Important Reminders: Mark outer envelopes with the procurement reference code, pre bid conference will be streamed via the agency s secured platform. Eneure compliance with the latest health and safety protocols upon entry. Please be guided accordinaly Ronald Vasquez Contracting and Compliance Unt Howard Brown Head, Procurement Service Office"
    },
    {
        "image": "bulletininfomaterials2_synth_18_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Republic of the Philippines LAKE JOSHUA PROCUREMENT SERVICE ‘90773 Buses Forge, Lake Cheyennefct FM Bid Bulletin No. 2025 110 NOTICE OF BID PARAMETER UPDATES: WASTE MANAGEMENT SERVICES Issued: Oct 24, 2025 ‘This bulletin conveys regulatory updates for the waste ma ‘emergency response equipment, procured under the Sp ‘these clarifications pursuant to Agency Procurement Marval 2024. ‘As sated i the Bid Document Modificatioav Amendments Secure manufacturers authorzaton * Submission portal remains open ntl 5 00 specie to the proposed brand Phton cosng date Update Section VII checkist wih Waranty coverage adjusted to two (2) years curent tax clearance vaidty. on ate servoe, [Attach notaraed joint venture “Tecrineal specticaton for cove components agreement where appicabie. revised per Annex C. Important Reminders: Mark outer envelopes with the procurement reference code Pre bid conference will be streamed via the agency s secured platform. Ensure compliance with the latest health and safety protocols upon entry Please be guided accordingly Ronald Vasquez Contracting and Comptance Unt Howard Brown Head, Procurement Service Office"
    },
    {
        "image": "bulletininfomaterials2_synth_18_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Bid Bulletin No. 2025 110 NOTICE OF BID PARAMETER UPDATES: WASTE MANAGEMENT SERVICES lnsued: Oct 2, 2025 The buen conveys mp updetes tore waste meneaement servces emergency response equement, procured under the Specia! Trust Fund. The BAC anues ‘tess carfeatons punuant to Agency Procurement Manual 2024 ‘As stated te the Hid Docwmewt Masticatnoms (me edmeats eee menutectuers autoreaton Submision portal remains open unt! 8 00 Pilon cioung date Weranty coverage adjusted to two (2) ars ‘coment tas cwparance vaidty encte contee, Anach notarted pnt venture Technica! specticaton for com components agreement wre sppicate sevaed per Annex C Important Reminders: Mark outer envelopes with the procurement reference code. Pre bid conference will be streamed via the agency s secured platform. Ensure compliance with the latest health and safety protocols upon entry, Please be guided accordingly"
    },
    {
        "image": "bulletininfomaterials2_synth_18_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": ""
    },
    {
        "image": "bulletininfomaterials2_synth_18_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Head, Frocuremant"
    },
    {
        "image": "bulletininfomaterials2_synth_19_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "——— s wees"
    },
    {
        "image": "bulletininfomaterials2_synth_19_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "TO INVITATION TO RUCT UPGRADE \"y protacots upon iat otis Head, Prscuremont Sorvice Ofice"
    },
    {
        "image": "bulletininfomaterials2_synth_19_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "This buletin conveys regula uard augmentation rece, s these clarteations pure SO Republic of the LAKE KATRINA, \"MENT SERVICE 9904 Steven Summ. Hudsons oo Bid Bulletin No. 2025 77 ADDENDUM TO INVITATION TO BID: IT INFRASTRUCTURE UPGRADE 'ssued: Oct 26, 2025 in the Bid Docume, 20d jont venture 7 ° Bid secunty amount where applicable, Percent 2%) of Abe, satis manutacturers autnorcaton .D8her perod shortened to sty ¢0) Peet to the proposed gnena! calendar daye UPdate Section Vil checks wth Pease be guided ment tax clearan \"Submision accordingly Miranda Webp BAC Secretariat Barbara Sims Head, Procurem rent Service Office"
    },
    {
        "image": "bulletininfomaterials2_synth_19_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": "rogemnt Reinders raven with ite latest haat 20d 32FP8 paatoesls upon"
    },
    {
        "image": "bulletininfomaterials2_synth_19_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "—— Republic ofthe Philippines LAKE KATRINA PROCUREMENT. ‘SERVICE Hodsonside GU ‘9304 Steven Summit 5 17 NTO BID: IT GRADE Bid Bulletin No. 202! DENDUM TO INVITATION INFRASTRUCTURE UP' ssued: Oct 26, 2025 ey updates forthe tinfastuctre UPO Y erared under e Calamay Reserve vont to Republic Act 9184. NiodificationvAmendments pid seourty amount recalbrated 19 140 percent 238) of ABC: rereteny peso’ shortened 19 sty (20) calendar days cre rnasion portal remains open unt Phton ciosing date, this butetin conveys regula ade covering secutty ‘Afocation. The BAC Guard augmentation services. dates these casfcations Pur “Ax stated in the Bid Document ch notarzed joint venture ment where appicadie acturers authoreaton specie to the proposed brand, Update Section Vl checks wn coment tax clesrance val. asta ree\" Secure manu 5 00 Important Reminders: «ensure compliance wit the latest health and safety protocols upon entry eardinate schedule for site inspection through the Secretariat hotline Mark outer envelopes with the procurement reference code. please be guided accordingly. ‘Miranda Webd BAC Secretariat Barbara Sims rvice Office Head, Procurement Se"
    },
    {
        "image": "bulletininfomaterials2_synth_20_aug1.png",
        "label": "bulletininfomaterials",
        "ocr_text": "toapertens Reeser"
    },
    {
        "image": "bulletininfomaterials2_synth_20_aug2.png",
        "label": "bulletininfomaterials",
        "ocr_text": "etin No. 2025 83 GUIDANCE ON TEC NICAL SPECIFICA. TIONS: MEDICAL CO! ES SUPPLY Daze conteatane purwant to Rerpuble apartact Reaninders «Late bids shall bo automaticaly rejected pursuant to Section 6 1 Yuk outer anvatcges with the procurement reference ode ce snare sched for site lespracticn through tow Secretariat hotine, Keneagtn Howard"
    },
    {
        "image": "bulletininfomaterials2_synth_20_aug3.png",
        "label": "bulletininfomaterials",
        "ocr_text": "Renate of te Potinnes NEW ROONEY CHESTER PAOCURELIENT SENVICE Te As aod. Haycenee WY Bid Bulletin No, 2025 83 Gt OANGE ON TECHNICAL SPECIFICATIONS: ICAL CONSUMABLES SUP' ve. Oct 26, 2025, The buteen coneeyt iguini y wodieias torcne sweden conaurnabies sup covery yoni Tant Fund. The DAC moet T Wadi ww hacmimert {nay sevrge atid we tn 0 eee yan. eise antag ‘nanci! vatements fo: Line pa to ene Inapurtaas eaters Late bide shall be automaticaly rejected cursuant to Section 35. Mark outer enveiopes with the procurement i fermnce cody. Coordinate scheduls tor site inspection through the Secretariat ting. te gaided accondiney Kennet Howard Com acing at Cope Una Jessica mitchell AAC Techneal Working Crop Lead"
    },
    {
        "image": "bulletininfomaterials2_synth_20_aug4.png",
        "label": "bulletininfomaterials",
        "ocr_text": ""
    },
    {
        "image": "bulletininfomaterials2_synth_20_aug5.png",
        "label": "bulletininfomaterials",
        "ocr_text": "tp ead"
    }
]