[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "career",
        "ocr_text": "Career Counseling Understanding Career Counseling. it supports students in developing confidence nd direction toward acnieving their career dreams. Career counseling provides information about job trends and opportunities in various industries. Career counseling assists Studenis in preparing resumes, cover letters, anc interview skills. Key Con 1 a3;"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: Felicia Kennedy Roll num4 46 271 0676 Subject: Griffith, Gray and Lewis Work Ethics. —— Understanding Career Counseling- It supports students in developing confidence and direction toward achieving their career dreams. “Career eo ealle) provides information about job trends and opportunities in various industries. Career counseling assists students in preparing resumes, cover letters, and interview skills. Key Concepts- 1. Avocation: A chosen activity pursued for personal satisfaction, futfling an important aspect of a person s life, and may or may not be income generating 2. Career: The totality of work and life roles through which an individual expresses themselves, including work, leisure, and avocational activities. 3. Career awareness: One s consciousness about career related decisions, achieved through sel examination of values, abilives, preferences, knowledge of occupations, Me roles, and interests. ‘4, Career development: All psychological, sociological, educational, physical, economic, ‘and other factors that shape one s career over thei lifespan. 5. Career counseling: Individual or group counseling focused on increasing career awareness and fostering decision making regarding career goals. 6. Career guidance: A counselor designed program offering information on career development and facilitating career awareness for individuals. 7. Career path: The sequence of positions and or jobs that indicate potential advancement."
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "career",
        "ocr_text": "Careet Counseling underasanctiray CRT Sounselitge it supports students in developing confiden? and direction toward acnieving er career creams. Career counselin provides information about job trends and in various industries. ling assists nng resumes, serview skills. opportunitie ‘Career counse students in prepa cover letters, and in Key goncept- +. Avocation. A"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: Foie Kemeay Row MUP 812710676 E Gniffith, Gray and Lewis Work Ethics Understanding Career ¢, it supports students in confidence developin ac Nd direction towar leving their career dreams, _ career counseling provides information about jo trends and Sbportunities in various industries. Career counseling assists Students in Preparing resumes, cover letters, ang interview skills. “~ TA ts Ache: activity pursued for Berson Salistaction, nniing an ‘mportant 's We. and may or may not Se income 2 nt: Ad Bsychslowcal, secioxgicas Sdtucabonat, physical economic si chage one s cacees ever thew j factiating career amaceness toe ecransuais 7. Career Path The ‘Sequence OF postions andioy JOD tet incneute Doteritat aavarcemeni"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "career",
        "ocr_text": "Understanding Garses Counseling: H supports students in developing confidence and direction towara achieving thelr career dreams. Career counseling provides information about job trends and opportunities in various industries. Career counseling assists students in preparing resumes, cover letiers, and interview skills. key"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "career",
        "ocr_text": "Career Counseling Understanding Career Counseling: It assists individuals career goals bast aspirations. Career coun: learners to set develop strategies for It builds confidence an students to pursue aligned with their p Key Concepts- 1 Avocation: A chosen activity in setting realistic ed on their skills an seling encourages achievable goals an success. d motivates careers assions. pursued personal satistacton utiing an important ‘and may of may not be income generatng aspect of a person s ite, ara te oles through which an individual eXPTESSeS s 2. Career: The totality of development 7_ Career path: The sequence of positions: advancement. ‘and or jobs that indicate potential"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "career",
        "ocr_text": "Career counselin leamers to Set achi g encoura es eVvable goals and develop Strategies “It builds confidence an Stu en ts to aligned with Kay Concents. 1. AirOC8tION. A choses, ans may 2 Career. The intauty 10S, and mierests 4. Carer for success id motivates reers pursue ca their Passions, activity pursued Sor Dersongt sat SPECI Of a Darseen s in."
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: Richard Lewis Rott aoa Career Counseling- It assists individuals in Setting realistic career goals based on their skills and aspirations. Career counseling encourages learners to set achievable goals and develop strategies for success, “It builds Confidence and motivates Students to pursue Careers aligned with their Passions. Key Concepts- -designed program offering information on career and factitating career individuals. 7. Career path The sequence of positions and or jobs that indicate potential advancement"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "career",
        "ocr_text": "Career Counseling Understanding Garner Counseling. Hassisis individuais in setting realistic career goais based on thelr skills and aspirations. Career counseling encourages leamers to set achievabie goals and Gevelop strategies for success It builds confidence and motivates students to pursue careers aligned with thelr passions,"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: Richard Lewis Roit nuMbEIASSE7H0R Understanding Career Counseling: It assists individuals in setting realistic career goals based on their skills and aspirations. Career counseling encourages learners to set achievable goals and develop strategies for success. “it builds confidence and motivates students to pursue careers aligned with their passions. Key Concapts- 1 Avacation: A chosen activity pursued for personal satisfaction, tuling an important aspect of a person s ils, and may or may not be income genersting. 2 Career. The totality of work end ite Fores: through which an indiiual expresses: themseives, inckeding work Jeteue, and avocational activities 3. Career awareness: One s consciousness about career refated decisions, achieved though self examination of vakies, abies, preferences, Knowledge of cooupations, ile 4. Career cevelopment’ AB psychological, ecological, educational, physical, economy: and others tactors hat shape one s career over thet Mtespan. 5. Career counseling. Individual OF group Counsefing focused on increesing CBTeSt awareness and iesketing deosion making tegarding career gous 6. Career guidance” A counselsy designed program offering intormation on career evelopment and facdtating career awareness fot individuals. 7. Career patty: The sequence of positions axkvor sous that mdrcate yoxertiat advancemen:"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "career",
        "ocr_text": "C Name: ait, Roll numb9n3_ 755 6746 ‘alae sonst Hoods action Understanding Career Counseling- It assists individuals in settin career goals based on the aspirations, areer Counselin wareer Counseling See 9 realistic ir skills and ._ Career n abouts Provides information about jo Opportunities in Variou. trends and 'S industries. Career counseling helps students Slate their interests fe) and plan Key Concepts. ‘oles, and interests, 4. Career development: Ay Psychological, soci and other factors that shape one s career over 5. Career counseting: individuay oF grou 8S about HON Of values, abilities, prefer Personal satisfaction, may not be income generati through which an i activities. iological, their lite r future Careers. futfiling an important ing. individual expresses career related decisions, achieved ences, Knowledge of occupations, tte €ducational, Physical, economic, span IP Counselling focuse"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: sine n rene Roll numb943 755 6746 ‘Subject: Hood Ing Decision Making Understanding Career Counseling- It assists individuals in setting realistic career goals based on their skills and aspirations. __ Career counseling provides information about job trends and opportunities in various industries. Career counseling helps students explore their interests and plan for future careers. Key Concepts- 1. Avocation: A chosen activity pursued for personal satisfaction, fulfiing an important aspect of a person s life, and may or may not be income generating. 2. Career: The totality of work and life roles through which an individual expresses themselves, including work, leisure, and avocational activities. 3. Career awareness: One s consciousness about career telated decisions, achieved through seit examination of values, abilities, preferences, knowledge of occupations, ite roles, and interests. 4. Career development: All psychological, sociological, educational, physical, economic, and other factors that shape one s career over their lifespan 5. Career counseling: Individual or group counseling focused on increasing career awareness and fostering decision making regarding career goals. 6. Career guidance: A counselor designed program offering information on career development and facilitating career awareness for individuals. 7. Career path: The sequence of positions and or jobs that indicate potential advancement."
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "career",
        "ocr_text": "Career Counseling Roll numb9e 3 755 6746 Subject: Hood Ing Decision aking Understanding Career Counseling: It assists individuals in setting realistic career goals based on their skills and aspirations. Career counselin provides information about job trends and opportunities in various industries. Career counseling helps students explore their interests and plan for future careers. Key Concepts- awocation. A chosen activity pursued for personal satistaction, fuftiing an important aspect of a person s life, and may of may not be income generatng Career The totality of work and life roles through which an individual expresses themselves, including work, leisure, and avocational activives elated decisions, achieved 3. Career awareness. One s consciousness about career nowiedge of occupations, life through setf examination of values, abilives, preferences, W roles, and interests «t Coreer development. All psychological, sociological, educational, physical, economic and other factors that shape one s career over their tespan Career counseling, Individual or group counseling focused on increasing career awareness and fostering decision making regarding career goals 6 Career guidance A counselor designed program offering informaton on careet development and facilitating career awareness for individuals 7 Career path. The sequence of positons and or jobs that indicate potenbal advancement"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: ice Roll numb94 3 755 6746 Subject: Hood Ing Decision Making Understanding Career Counseling- It assists individuals in setting realistic career goals based on their skills and aspirations. ‘Career counseling provides information about jo trends and opportunities in various industries. Career counseling helps students explore their interests and plan for future careers. Key Concepts- 1. Avocation: A chosen activity pursued for personal satisfaction, fulfilling an important aspect of a person s life, and may or may not be income generating. Career: The totality of work and ife roles through which an individual expresses themselves, including work, leisure, and vocational activities. 3, Career awareness: One s consciousness about career related dec through self examination of values, abilities, preferences, knowledge roles, and interests. 4, Career development: All psy ‘and other factors that shape one s career over their lifespan. 5. Career counseling: Individual or group counseling focused on increasing career ‘wareness and fostering decision making regarding career goals, 6. Career guidance: A counselor designed program offering information on career development and facilitating career awareness for individuals. 7_ Career path: The sequence of positions and or jobs that indicate potential advancement. isions, achieved of occupations, life chological, sociological, educational, physical, economic,"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "career",
        "ocr_text": "Caree f Counselin “Bol OUNS ling Hame: a Unssretanting Conaee 6. Saunsekng. it Assists palviduals i students e and plan Kay Concenty. hen lin Xplore the Gr future 9 aust. iF inisrests Careers."
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: Kyle Bailey Roll num 77 812 9772 Sut 4 ibject: Charles Inc Job _ Understanding Career Counseling. Career counselin encourages self awareness and helps students 'scover their true Potential. “it allows Students to assess their Strengths, weaknesses, and personal Interests in choosing a Career. “It encourages Self reflection to better understand personal strengths and abilities. 1. Avocation: A chosen activity pursued for personal satisfaction, futfiing an important 3 rect Of a person s ite, and may or may not be income generating 2. Career: The totality of ‘ough which an individual expresses themselves, including tional activities, 3. Career awareness: One s Consciousness about career related decisions, achieveg {nrough self examination of values, abilities Preferences, knowledge of occupations, ite roles, and interests work, leisure, and avocat"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "career",
        "ocr_text": "Career Counseling Understanding Career COUNseinge Career counseling encourages self awareness an helps students discover their ue potential. ais allows students fo assess their strengt 15, WEAKNESSES, and personal interasts in choosing 6 Career. Ht encourages self reflection to better understand personal strengths and abilities."
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: Kyle Bailey Rot numne7 7 )812 2772 nao Copies Understanding Career Counseling: Career counseling encourages self awareness and helps students discover their true potential. It allows students to assess their strengths, weaknesses, and personal interests in choosing a career. it encourages self reflection to better understand personal strengths and abilities. Kay Concepts. 1. Avecation. A chosen activity pursued tur personal satistaction, hutiling an important aspect of a person s lie and nity oF may not be Income generating 2. Career: The totality of work and He robes though which ar: Indradual expresses themselves, IncudiNg Work, leisure, and amcational activites. 3. Career awareness. One s consciousness aboul caiwer retated decisions, achieved frrough sail examination ot vasues, abies, preferences, inowiedge of croupatiness, Me soe, andl interests, 4 Carer development: Ai psychological, socichogical, educational, piyysical, economic Sid othe factors that shape one s career over thew Wtespan §. Career counseting: Individual OF group counsetng focused on increasing caseer awareness and fasterng decision making reganing career goais 6. Career guidance A vounselor desigred progam offering information on career fieeetoprnent and fackiating career awareness for tivduals. 7 Career path: The sequence of positicns andlor jabs that indicale potentiat acvarcecnent"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "career",
        "ocr_text": "Unaerszanding Career Counseting. Career counse Self awareness and l discover their true potential. \"it allows Students to assess their Strenaths, weak ling encourages helps students i eaknesses, and personal interests in choosing a career, “it encourages Self reflection to better understand personal Strengths and abilities. Key Concspes Sonal satestachon, tuttiing an, enpostant RCOME generatin"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: Kyle Bailey Roll \"48877 )8 12 2772 Subject: Charles. Inc Job Readiness\" Understanding Career Counseling. Career nese ang interests in Choosin “It €ncourages self. better understand strengths and abilities, Key Concepts. 1. Avocation: A chosen activ aspect of a person s lite, an 2. Career: The totality of the 3. Career awareness: On, through sett examination ity pursued for persona) Satisf 1d may or may not be inco ''S consciousness about career el Of values, abilities, Preferences, kn roles, and interests, 4. Career development: ay ps; \"chological, sociological, edu that shape of ing: Individual or awareness and fostering decision. ice: A coun: ‘9roup counseling tocuse: ‘making regarding career 'selor designed program offering me generating. work and life roles through which a 'mselves, including wor rk, leisure, and avocational activiti e s career over their ltespan '€SS for individuals, Personal faction, fuling an important cational, physical, economic, ‘d on increasing career goals, information on career"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: Daniel Wolf Roll numbegy Subject: Gree Alvar: Understanding Career Counseling: Career counseling encourages self awareness and helps students discover their true potential. Career counseling gives individuals the confidence to pursue careers that align with their passions. Career counseling teaches students how to make informed and realistic career decisions. Key Concepts-"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "career",
        "ocr_text": "Career Counseling Uncerotanging Career Caunaeting: Career counseling encourages self awareness anc heips students discover their true potential. Career counseling gives individuals the confidence to pursue careers that alan with thelr passions. Career counseling teaches siudents how to make informed and realistic career decisions. Hay Concepts- *"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: Daniel Wolf Roll numbefn 1 2566661 Subject: Green, Holmes and Alvarado Work Ethics Understanding Career Counseling- Career counseling encourages self awareness and helps students discover their true potential. Career counseling gives individuals the confidence to pursue careers that align with their passions. Career counseling teaches students how to make informed and realistic career decisions. Key Concepts- 1. Avocation: A chosen activity pursued for personal satisfaction, fulfling an important aspect of a person s life, and may or may not be income generating. 2. Career: The totality of work and life roles through which an individual expresses themselves, including work, leisure, and avocational activities. 3. Career awareness: One s consciousness about career related decisions, achieved through self examination of values, abilities, preferences, knowledge of occupations, life roles, and interests. 4. Career development: All psychological, sociological, educational, physical, economic, and other factors that shape one s career over their lifespan. 5. Career counseling: Individual or group counseling focused on increasing career awareness and fostering decision making regarding career goals 6. Career guidance: A counselor designed program offering information on career development and facilitating career awareness for individuals, 7. Career path: The sequence of positions andior jobs that indicate potential advancement."
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "career",
        "ocr_text": "Career Counselin Name: Daniel Wolf Roll number 1 2566661 Subject: Green, Holmes and Alvarado Work Ethics Understanding Career Counseling- Career counselin encourages self awareness and helps students discover their true potential. Career counseling gives individuals the confidence to pursue careers that align with their passions. Career counseling teaches students how to ma informed and realistic career decisions. Key Concepts- 1 Avocation. A chosen acti aspect of a person s ite, d for personal satisfaction, fulfilling an important and may or may not be income generating 2 Career The totality of work and life roles through w themselves, including work. leisure, and avoc 3 Career ich an individual expresses ational activities awareness One s consciousness about career related decisions, achieved {hrough self examination of values, abilties. preferences, knowledge of occupations. ite Toles, and interests development: All psychological, sociological, educational, physic T factors that shape one s career over their Itesp. 5 Career counseling individual or grou awareness and fostering decision makin al, economic an ‘ounseling focused on increasing career regarding career goals 6 Career guidance: A counselor designed program offering int. development and facilitating career awareness f formation on career for individuals 7 Career path: The sequence of positions and or jobs that indicate potential advancement"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "career",
        "ocr_text": "self awarene nealing unseling encourages and helps students discover their true potential. Career counseling gives individuals the confidence to pursue careers that align with their passions. Career counseling teaches students how to make informed and realistic Career decisions."
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "career",
        "ocr_text": "Career Counseling Understanding Career Counseling. it supparis students in Geveloping confidence and direction toward achieving their career dreams. “ii helps individuals explore different career fields and understand the qualifications required for each. Career counseling helps students explore their interests and plan for future careers. Key Concept"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "career",
        "ocr_text": "Career Counseling Undarstunding Corser Counseling supports students in developing confidence and direction towara achieving ineir career dreams. tthelps individuals explore different career fields and understand the qualifications required for each. ‘Career counseling helps students explore thelr interests and plan for future careers. Hay Concepts: nipertant"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "career",
        "ocr_text": "Career Counseling naarsiansieg 3 G sing ie supports 8 students in developing confidence eand direction towar achieving tel career creams g explore different “it helps individual ar fieids and unders siand the sialt Woahons required 10) for eaci Career counseling helps students ex lore their r interests and plan 1or future careers."
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "career",
        "ocr_text": "Career Counseling Understanding Career Counseling. it supporis students in developing confidence and direction toward achieving thelr career dreams. it helps individuals explore differant career fields and understand the quaificalions required for each, Career counseling helos stucents explore their interests and plan for future careers."
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "career",
        "ocr_text": "Career Counseling us neerstanding Sarees Counseting. it (supports students in 1 developing confide ence Be iG direction toward ieving their career dreams. \"it helps individuals explore different career f fie| ds and under ‘stand pe quali folds required for aac Career counsel ling helps Students explore their r interests and pian for future careers."
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "career",
        "ocr_text": "Career Counseling Lindyratanding Sareer Counseling Career counselln encourages self awareness ant helps students discover {heir true potential. + allows students to assess their strengths, weaknesses, and personal inferests in choosing career. it gives learners tools to develop short ierm @) long term professional plans. ia"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "career",
        "ocr_text": "Career Counseling Understanding Caves: Couns Career counseling encourages Sel awareness and nelps students oiscover thelr true potential. jt allows students to assess their Sirengins, weaknesses, and personal interests in choosing a career. it gives learners tools to ___Gévelop short term and ‘ong term professional plans. Key Concepts"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: Gina Cook Rot mum9 95 831 6590 Subject: Conins wdy and Ferra ed Roadie Understanding Career Counseling- Career counselin encourages self awareness and helps students discover their true potential. {it allows students to assess their Strengths, weaknesses. and personal interests in choosing a career. It gives learners tools to develop short term and long term professional plans. Key Concepts- +. Ayocation. A chosen acinity pursued for person nal Satistacton, fuitiling an important 4 Of 8 Detson s afe, and may ar may not be income. generating 2 Career: The totality of work ania Ke retss through which an indnvaiual expresses themseives, inciting work, Ielswe. and svocetional actvibes Keer awareness: Gne s consciousness abou career related decisions, achieved Of valves, anittes, preterences, knowledge of occupations, Ife Sheough sest examenation roles and interests 4 Career developnvient. Al psyctniogkal, socktogkal, educational, physical economic, and othe factors that shape one s career over thet Hespan 5 Career counseling: Individuat or group counseling fecused on increasing career awareness and fostering decision making regarding cater goats 5. Career guidance: A counselor designed program oftesing informabon on career Gevelopment and lacittating carter awareness tur indiviqua s, 7. Career pati: The sequence of positions andior jons that indicate potental advancement"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: Gina Cook ee nUMR 95 631, -5590 Collins, Hardy ang Ferrell Job Readiness Understanding Career Counseling. Career nese ng Self awareness and helps students discover their true potential. ‘It allows Students to assess their Strengt S, Weaknesses, an Personal Interests in choosing a Career. It gives learners tools to develop short term and long term Professional plans. Key Concepts- 1. Avocation: A chosen a e ncou rages ctvity pursued for personal satistaction, fut fling an important 4gned program offering information on career Gevelopment and facilitating career awareness for individuals, 7. Career path: The sequence of positions andlor Jobs that indicate potential advancement"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: Gina Cook Roll numiy 95 63 1 5590 Subject: _ Collins, Hardy and Ferret! Job Reaaness Understanding Career Counseling: Career counselin encourages self awareness an helps students discover their true potential. “it allows students to assess their strengths, wea nesses, an personal interests in choosing a career. It gives learners tools to develop short term and long term professional plans. Key Concepts themselves, including work, leisure, and activites 3. Career awareness ‘One s consciousness about career related decisions, achieved ‘abilities, preferences, knowledge of occupations, Me through seft examination of values, roles, and interests: 4. Career development: Al ps) ‘sociological, educational, physical, Economie, ‘and other tactors that shape one s career over their ilespan. 5 Career counseling: Individual oF gr awareness and fostering career program offering information on career evelopment and facitating career awareness for individuals 7. Career path: The sequence of positions and or jobs that indicate potential advancement"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "career",
        "ocr_text": "Career Counseling 9 Carper Counseting. areer counseling helps bridge the 9ap between academic learning arid future employment, it helps students Prepare for future challenges by iMproving their decision making and planning skills. it encourages self reflection to better understand eersonal Strengths and abilities,"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "career",
        "ocr_text": "Career Counseling anestanding Serer Counseling: Career counselin helps pridge the gap between aca amic leaming an future employment. it helps students prepare for future challenges by! mprovi ing their decision making and planning skills encourages self reflection to better understand persor vai strengins and abilities Hoy Concenss"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "career",
        "ocr_text": "Career Counseling imiderstanding Caree Career counseling helps bridge the gap between academic learning and future emplayment. lt helps students prepare for future challenges by improving their aaneelinge decision making and planning skills. It encourages seif reflection to better understand personal strengths and abilities."
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: QSKp ales Roll numbeg302057988 ‘Subject: inson Ltd Self Assessment oe = Understanding Career Counseling- Career counseling helps bridge the gap between academic learning an future employment. Ithelps students prepare for future challenges by i their decision making and planning skills. It encourages self reflection to better understand personal strengths and abilities. Key Concepts- 1. avocation: A chosen activity pursued for personal satisfaction futfiting an important aspect of a person s life, and may or may not De income generating 2 Career. The totality of work and life roles through which an individual expresses themselves, including work, leisure, and avocational activites 43, Career awareness: One s consciousness about career related decisions, achieved through setf examination of values, abilities, preferences, knowledge of occupations, life roles, and interests 4, Career development: Ail psychological, sociological, ‘educational, physical, economic, ‘and other factors that shape one s career over their ifespan. Career counseling: Individual or group counseling focused on increasing career awareness and fostering decision making regarding career goats. 6. Career guidance: A counselor designed program offering ‘information on career development and facilitating career awareness for individuals 7. Career path: The sequence of positions andior jobs that indicate potential advancement"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "career",
        "ocr_text": "Career Counseling Alexander Name: Qgi7nes Roll numbea302057988, Subject: inson Ltd _ “Assessment Understanding Career Counseling- Career counseling helps bridge the gap between academic learning and future employment. It helps students prepare for future challenges by improving their decision making and planning skills. It encourages self reflection to better understand personal strengths and abilities. Key Concepts- 1. Avocation: A chosen activity pursued for personal satisfaction, futfling an important aspect of a person s life, and may or may not be income generating 2. Career: The totality of work and life roles through which an individual expresses themselves, including work, leisure, and avocational activities. 3. Career awareness: One s consciousness about career related decisions, achieved through seff examination of values, abilities, preferences, knowledge of occupations, life roles, and interests. 4. Career development: All psychological, sociological, educational, physical, economic, and other factors that shape one s career over their lifespan. 5. Career counseling: Individual or group counseling focused on increasing career awareness and fostering decision making regarding career goals. 6. Career guidance: A counselor designed program offering information on career development and facilitating career awareness for individuals. 7. Career path: The sequence of positions andior jobs that indicate potential advancement"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "career",
        "ocr_text": "Career Counseling Name: O° Katherine Roll numbgp5 391 9314 Subject: Cox LLC Job ‘eadiness Understanding Career Counseling- It helps individuals prepare for the world of work by teaching planning and decision making skills. It allows students to assess their strengths, weaknesses, and personal interests in choosing a career. |t encourages self reflection to better understand personal strengths and abilities. Key Concepts- 1. Avocation: A chosen activity pursued for personal satisfaction, fulfiling an important aspect of a person s life, and may or may not be income generating. 2. Career: The totality of work and life roles through which an individual expresses themselves, including work, leisure, and avocational activities. 3. Career awareness: One s consciousness about career related decisions, achieved through self examination of values, abilities, preferences, knowledge of occupations, life roles, and interests, 4. Career development: All psychological, sociological, educational, physical, economic, and other factors that shape one s career over their Iiespan. 5. Career counseling: Individual or group counseling focused on increasing career ‘awareness and fostering decision making regarding career goals. 6. Career guidance: A counselor designed program offering information on career development and facilitating career awareness for individuals. 7. Career path: The sequence of positions and or jobs that indicate potential advancement."
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "career",
        "ocr_text": "Career Counseling name Roll numba5 391 2314 Subject Cx Lic Job ‘eadiness Dr Katherne Understanding Career Counseling: It helps individuals prepare for the world of work by teaching planning and decision making S ills. It allows stugents to assess their strengths, weaknesses, and personal interests in choosing a career. It encourages self reflection to better understand personal strengths and abilities."
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "career",
        "ocr_text": "Career Counseling Understanding Career Gounseliige ‘it helps individuals prepare for the world of work by teaching planning and decision making skills. ai allows students to. assess their strangins, weaknesses, and personal interests in choosing career. encourages self reflection te better understand personal strengths and abilities. Key"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "career",
        "ocr_text": "Understanding fareer Sounseing- it helps individuals prepare for the worid of woric by teaching lanning and decision making Skills. “ft allows Students fo assess thelr SYengins, weaknesses. and personal interests in chocsing a career i encourages self reflection to better understand personal strengths and abilities. Hey Convepts."
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "career",
        "ocr_text": "reer same: Oa Rosi nunibeg 5391 2314 subject x LEC Joo counseage selin Understanding cores Itheips individuals prepare for the janning world of work by and decision making skilis. tt allows stu ths, wea’ 3 in choosing 4 career. stren interests jt encourage nderstand persona better u strengt vey Concepts A chosen actity pursed 224 persons son s He, 96 may may nat pe ncome generans. ny of work anne He FOES trough wtuch af i otk, Sere, #8 2 One s CONSEIAATESS ination of values, ACES. Avocutton. sopedt of 2 per 2 Careet, The slam nemsenes nctuesy 2 Career awareness arecuugn seit exe ries, and interests teaching s theif, gents, to asses nesses, an personal S self reflection to hs and abilities. eapstaction, Aaa 3 wmgortant pero! CRTeSSeS 8, PI. cation, PYEICAA, ECON pets WARS DAL 4 Career Oe Aa payenonogy nape one s cartes Fes focused on increasing careet ‘A coumseter designe’ PROTA one ineainedts spespocal OF grOUP COUNSEND ing segarang cores? 0205S cme ong wtoateaan OF reer var ecress 1 of posons anctor jus iat wnacate potential"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "career",
        "ocr_text": "Career Counseling undarstanding Career Counseling: Career counseling guides students in aligning their passions with meaningful career opportunities. Career counseling guides igarners to create a clear plan lor achieving their long term career goa s. encourages self reflection to petter understand persona strengths and abilities. Key Goncept ave ne potential"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "career",
        "ocr_text": "icholas Career Counseling Roll numbef3 45199294 Subject: Baker, Figueroa and Wilson Self Assessment Understanding Career Counseling- Career counseling guides students in aligning their passions with meaningful career opportunities. Career counseling guides learners to create a clear plan for achieving their long term career goals. It encourages self reflection to better understand personal strengths and abilities. Key Concepts- 1. Avocation: A chosen activity pursued for personal satisfaction, futfling an important aspect of a person s life, and may or may not be income generating, 2. Career: The totality of work and life roles through which an individual expresses themselves, including work, leisure, and avocational activities, 3. Career awareness: One s consciousness about career related decisions, achieved through self examination of values, abilities, preferences, knowledge of occupations, life roles, and interests. 4. Career development: All psychological, sociological, educational, physical, economic, and other factors that shape one s career over their lifespan. 5. Career counseling: individual or group counseling focused on increasing career awareness and fostering decision making regarding career goals 6. Career guidance: A counselor designed program offering information on career evelopment and facilitating career awareness for individuals 7. Career path: The sequence of positions and or jobs that indicate potential advancement"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "career",
        "ocr_text": "Career Counseling Career counse rare fing guides Sludents jn aligning their pa SSiOns with Career opportunities, Career counsel create clear long te it encourages Self reflectj eller understand person strengths and abilities. Meaningful eamers to plan for achieving their Mm Career goals"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "career",
        "ocr_text": "Career Counseling Roll number345199294 Subject: Baker. Figueroa and Wilson Self Assessment Understanding Career Counseling- Career counseling guides students in aligning their passions with meaningful career opportunities. Career counseling guides learners to create a clear plan for achieving their long term career goals. It encourages self reflection to better understand personal strengths and abilities. 1. Avocation: A chosen activity pursued for personal satistaction, fulfiling an important aspect of a person s lite, and may or may not be income generating. 2. Career: The totality of work and lfe roles through which an individual expresses themselves, including work, leisure, and avocational activities. 3. Career awareness: One s consciousness about career related decisions, achieved through self examination of values, abilities, preferences, knowledge of occupations, life roles, and interests. 4. Career development: All psychological, sociological, educational, physical, economic, and other factors that shape one s career over their lifespan 5. Career counseling: Individual or awareness and fostering decision. 6. Career guidance: A counselor d development and facilitating career 7. Career path: The sequence of, advancement. 9rOup Counseling focused on increasing career ‘Making regarding career goals lesigned program offering information on career awareness for individuals. Positions and or jobs that indicate potential"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "career",
        "ocr_text": "Career Counseling Roi nambepaas 199784 Subject: Boker, Figueroa snd wiisen Sel Assessmen Understanding Career Counseling: Career counseling 9 aligning the cal reer oppo 1 uides students in ir passions with meaningful riunities. Career counseling uides learners to create a clear plan for achieving their iong term career goals. jt encourages self reflection to better understand personal strengihs an d abilities. tough set exaninaton soles, and interests 4. Career deveiopmert: and other factors that shape ofe s arareness arnt fostering Geo 6 Caveer guidance: A coun: advancement of values, atsifles, preferences, Xt {An psychological, sociological, educationat, PMYsCst career over S. Career counseling’ thesniqual of group oun economic ther lespan. ating focused on increasing careet Jeon making regarting career goals designed program offering Information on cane"
    }
]