[
    {
        "image": "certofcash2_synth_10_aug1.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is to Certify that Teacher Lia not incurred any unauthorized absences or tardiness from January 20 Inne M. Santos has 24 to October 2024. This on is issued to attest to her ex ‘emplai attendance record. y certificati Mary Carpenter copes!"
    },
    {
        "image": "certofcash2_synth_10_aug2.png",
        "label": "certofcash",
        "ocr_text": "Republic of the Phitppines DepED Department of Caveavon @O CERTIFICATION This is to certify that Teacher Lianne M. Santos has not incurred any unauthorized absences or tardiness from January 2024 to October 2024. This certification is issued to attest to her exemplary attendance record. Mary Cannes"
    },
    {
        "image": "certofcash2_synth_10_aug3.png",
        "label": "certofcash",
        "ocr_text": "epubic of the Phippines \"Sopartment of Education CERTIFICATION her Lianne M. Santos has This is to certify that Teacl not incurred any unauthorized absences or tardiness from January 2024 to October 2024. This certification is issued to attest to her exemplary attendance record. Mary Carpenter Occupational"
    },
    {
        "image": "certofcash2_synth_10_aug4.png",
        "label": "certofcash",
        "ocr_text": "This is to certify that Teacher Lianne M. Santos has Not incurred any tinautho! ized absences cr tardiness from Janda: 2024 to October 2024. This Certification is issued to attest to her exemplary attendance record,"
    },
    {
        "image": "certofcash2_synth_10_aug5.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is to certify that Teacher Lianne M. Santos has not incurred any unauthorized absences or tardiness from January 2024 to October 2024. This certification is issued to attest to her exemplary attendance record. Mary Carpenter aoa"
    },
    {
        "image": "certofcash2_synth_1_aug1.png",
        "label": "certofcash",
        "ocr_text": "ATION i. Dela Cruz has rend te Sen cCERTIFIC This is to certify that Tea eis Maria ren (10) years ‘of continue’ and dedicated service Lorenzo College 2 ‘Ot Teamnaiog! without any, rect administative 6 Case. THiS certification 1s issued to SU eoport her application for the Loyalty Award, affective 2s of January ered Deborah Chan a"
    },
    {
        "image": "certofcash2_synth_1_aug2.png",
        "label": "certofcash",
        "ocr_text": "republic of the Philippines tment of EdueABON DepED way tes District farickborough ees CERTIFICATION This is to certify that Teacher Maria L. Dela Cruz has rendered ten (10) years of continuous and dedicated service to San Lorenzo College of Technology without any record of administrative case. This certification is issued to support her application for the Loyalty Award, ‘effective as of January 4, Deborah Chan ‘Therapeute, nuiogrepne"
    },
    {
        "image": "certofcash2_synth_1_aug3.png",
        "label": "certofcash",
        "ocr_text": "Aepatc ofe rnnes DepED NS, alt ®O ‘Dente Pckborough CERTIFICATION This is to certify that Teacher Maria L. Dela Cruz has tendered ten (10) years of continuous and dedicated service to San Lorenzo College of Technology without any record of administrative case. This certification is issued to support her application for the Loyalty Award, effective as of January 4, Deborah Chan adagrapner"
    },
    {
        "image": "certofcash2_synth_1_aug4.png",
        "label": "certofcash",
        "ocr_text": "KERFPRPCATION This is Re oe ten {10} cher Maria rah Cl Shan"
    },
    {
        "image": "certofcash2_synth_1_aug5.png",
        "label": "certofcash",
        "ocr_text": "naan peaepass DepED oe eee Dwision, a CERTIF This is to certify that Teacher ten (10) years of continuou Lorenzo College of Tech: administrative case. This cer application for the Loyalty A\\ ICATION Maria L. Dela Cruz has rendered s and dedicated service to San nology without any record of tification is issued to support her ward, effective as of January 4, 025. Deborah Chan werapeute sadographer"
    },
    {
        "image": "certofcash2_synth_2_aug1.png",
        "label": "certofcash",
        "ocr_text": "apa othe regpes Deed ‘Depurtenet of Cantones (e) CERTIFICATION This is to certify that Teacher Adrian S. Torres has completed the egued forty 40) hours of In Service Training conduct by St. Martin Institute of Computing from March 15, 2024 to March 19, 2024. This Certification is issued for whatever legal and officiai Purpose it may serve. Maria Martinez son geeernen"
    },
    {
        "image": "certofcash2_synth_2_aug2.png",
        "label": "certofcash",
        "ocr_text": "Reyes af he Ppepswes Oehen CERTIFICATION This is fo certify that Teacher Adrian S. Torres has completed the required forty (40) hours of in Se: Training conducted by St. Martin Institute of Comp from March 15. 2024 t March 19, 2024. This ceitification is issued for whatever legai ficial purpose it may"
    },
    {
        "image": "certofcash2_synth_2_aug3.png",
        "label": "certofcash",
        "ocr_text": "Bis of Wet Rae CERTIFICATION to certify that Teacher Adrian S. 7 feted th required forty (40) onducted by St. Martin Institute of Compu 215, 2024 to March 19, 2024, This certification is issued for whatever legal and off purpose it may serve. Maria Martinez"
    },
    {
        "image": "certofcash2_synth_2_aug4.png",
        "label": "certofcash",
        "ocr_text": "ify that Teacher Adrian S Torres has completed the required forty (40) hours of In Service Traini Sr {. Martin Institute of Com wtiny from March 48, 2024 to March 19, 2024. This certification {8 issued for whatever legal and Officiat Purpose it may serve. Maria Martinez Saou Sresomet"
    },
    {
        "image": "certofcash2_synth_2_aug5.png",
        "label": "certofcash",
        "ocr_text": "D PED epubtic of ‘star District f West Mike CERTIFICATION This is to certify that Teacher Adrian S. Torres has completed the required forty (40) hours of In Service Training conducted by St. Martin Institute of Computing from March 15, 2024 to March 19, 2024. This certification is issued for whatever legal and official purpose it may serve. Maria Martinez Sons geeroment"
    },
    {
        "image": "certofcash2_synth_3_aug1.png",
        "label": "certofcash",
        "ocr_text": "DepED CERTIFICATION This is to certify that Teacher Beatriz R. Ramos has faithfully served as a faculty member of Philippine Institute of Modern Studies from June 2, 2015 up to the present. This certification is issued upon the employee s request for employment verification. Joshua Jackson Bookseller"
    },
    {
        "image": "certofcash2_synth_3_aug2.png",
        "label": "certofcash",
        "ocr_text": "is to certify that Teacher Beatriz R. Ramos has a liy member of Phitippine institute of Modem Studies irom June 2, 2015 up to the present. This cerlification is issued upon the employee s request for employment verification. This faithfully served as a facul Joshua Jackson Bookseller"
    },
    {
        "image": "certofcash2_synth_3_aug3.png",
        "label": "certofcash",
        "ocr_text": "Republic of the Philippines Department of Education CERTIFICATION This is to certify that Teacher Beatriz R. Ramos has faithfully served as a faculty member of Philippine Institute of Modern Studies from June 2, 2015 up to the present. This certification is issued upon the employee s request for employment verification. Joshua Jackson Bookseller"
    },
    {
        "image": "certofcash2_synth_3_aug4.png",
        "label": "certofcash",
        "ocr_text": "vet cd upon thee request for employment veriticat"
    },
    {
        "image": "certofcash2_synth_3_aug5.png",
        "label": "certofcash",
        "ocr_text": "Deed \"span eee eee CERTIFICATION is acher Beatriz R. Ramos has faithfull served as a faculty member of Philippine Institute of Modern Studies from June 2, 2015 up to the present. This certification is issued upon the employee s request for employment verification. This is to certify that Te Joshua Jackson Bookseller"
    },
    {
        "image": "certofcash2_synth_4_aug1.png",
        "label": "certofcash",
        "ocr_text": "cerriFscaTion Dela Pefia nas This is to certify that Teact yer Jerome. ait adminisirat weg ary ied he office of National By a nation a oo eqUest for ification is 'ssu gcord veri logy. Thi Tecnn employment f fion David Wiikinson"
    },
    {
        "image": "certofcash2_synth_4_aug2.png",
        "label": "certofcash",
        "ocr_text": "@ office 0 ional Gaver ity of fr Technology. This certification is issued upon requ em ployment record verificati David Wit"
    },
    {
        "image": "certofcash2_synth_4_aug3.png",
        "label": "certofcash",
        "ocr_text": "Republic of the Philippines CERTIFICATION This is to certify that Teacher Jerome C. Dela Pefia has no pending administrative or disciplinary case filed before the office of National University of Information Technology. This certification is issued upon request for employment record verification. David Wilkinson automotive"
    },
    {
        "image": "certofcash2_synth_4_aug4.png",
        "label": "certofcash",
        "ocr_text": "CERT Fication This is to cay that Teacher Jerome Dela Pei has NO pending adiministrati OF disciplinary case Hog elore the Giice of National Uy, Nersity of information Ane iS Certification 'S ISsued upon request for amploymer econ ecord verification. i David Wilkinson Engen"
    },
    {
        "image": "certofcash2_synth_4_aug5.png",
        "label": "certofcash",
        "ocr_text": "CERTUFDR CATION This is to Certify that Teacher Jerome C. Dela Pefia has NO pending administrative Or disciplinai Case filed regfore the Office of {National University Of rormation ecl “ons cettification is issued y jues oy record Verification” ea David Wilkinson aiomobve"
    },
    {
        "image": "certofcash2_synth_5_aug1.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This {s to certify that Teacher Lianne M. Santos is a oonafide staff member of San Lorenzo College of Technology under the posifion of Senior High School instructor. This certification is issued for the purpose of bank ican application. Richard Bentley Psychotheracist"
    },
    {
        "image": "certofcash2_synth_5_aug2.png",
        "label": "certofcash",
        "ocr_text": "ee Sch f San Lorenzo College of €chnology under the posit, Oo! Instructor. T; ion of Senior 4 ip tion is iss for th Purpose’ oF SSE Tas 4H, ssued Richard Bentiey Psychotherapist"
    },
    {
        "image": "certofcash2_synth_5_aug3.png",
        "label": "certofcash",
        "ocr_text": "Behe Y a CA) CERT IFILCATIGON eM. Sanios is a nze College of Senior High ication is issued for the dank loan application"
    },
    {
        "image": "certofcash2_synth_5_aug4.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is to certify that Teacher Lianne M. Santos is a bonafide staff member of San Lorenzo College of Technology under the position of Senior High School Instructor. This gettiication is issued for the purpose of bank joan application."
    },
    {
        "image": "certofcash2_synth_5_aug5.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is to certi that Teacher Lianne M. Santos is a ponafide staff member of San Lorenzo Coliege of Technology under the position of Senior High School instructor. ins certificati js issued for the purpose oO nk joan application. Richard Bentley Psychotherapist"
    },
    {
        "image": "certofcash2_synth_6_aug1.png",
        "label": "certofcash",
        "ocr_text": "pepeD Sete @O CERTIFICATION This is to certify that Teac the seminar titled \"Enhancing Teaching Innovation’ conducted at St. Martin Institute of Computing on August 25, 2024. This certification 1s issued for professi development record purposes. Valerie Sims eeeet"
    },
    {
        "image": "certofcash2_synth_6_aug2.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is to certify that Teacher Adrian P. Cruz has atiended the seminar titied ‘Enhancing Teaching Competence through Innovation’ conducted at St. Martin institute of Computing on August 25, 2024. This certification is issued for professional development record purposes. Valerie Sims Bese otesapates"
    },
    {
        "image": "certofcash2_synth_6_aug3.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is to certify that Teacher Adrian P. Cruz has attended the seminar titled ‘Enhancing Teaching Competence through innovation’ conducted at St. Martin institute of Comat on August 25, 2024. This certification is issued for professional development record purposes. Valerie Sims A 9"
    },
    {
        "image": "certofcash2_synth_6_aug4.png",
        "label": "certofcash",
        "ocr_text": "D PED \"Sepurment of Caneston ®O __ CERTIFICATION r 1 Adrian P. Cruz has attended the seminar titled 'Enhancin Teaching Competence through Innovation’ conducted at St, Martin Institute of Computing on August 25, 2024. This certification is issued for professional development record purposes. This is to certify that Teachet Valerie Sims interorspatial"
    },
    {
        "image": "certofcash2_synth_6_aug5.png",
        "label": "certofcash",
        "ocr_text": "Republic of the Philippines DepED Send CERTIFICATION This is to certify that Teacher Adrian P. Cruz has attended the seminar titled ‘Enhancing Teaching Competence through Innovation’ conducted at St. Martin Institute of Computing on August 25, 2024. This certification is issued for professional development record purposes. Valerie Sims interorspatal"
    },
    {
        "image": "certofcash2_synth_7_aug1.png",
        "label": "certofcash",
        "ocr_text": "CEATIF EOC ATION certify that Teacher featriz 2. Samos has been idially employed under Philippine lastituie af Modern es since June 10, 2017 and is currently het nee instructor. This ceri ia fication ourposes. Situ position af Computer Se issued upon request for record and veri Dane Fuentes"
    },
    {
        "image": "certofcash2_synth_7_aug2.png",
        "label": "certofcash",
        "ocr_text": "Republic ofthe Philippines DepED oven tae CERTIFICATION This is to certify that Teacher Beatriz R. Ramos has been officially employed under Philippine Institute of Modern Studies since June 0, 2017 and is currently holding the position of Computer Science Instructor. This certification is issued upon request for record and verification purposes. Dana Fuentes ural practice suveyor"
    },
    {
        "image": "certofcash2_synth_7_aug3.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is to certify that Teacher Beatriz R. Ramos has been officially empioyed under Philippine instituts of Modern Studies since June 19, 2017 and is currently holding the position of Computer Science instructor. This certification is issued upon request for record and verification purposes, Dana Fuentes Fue pices se"
    },
    {
        "image": "certofcash2_synth_7_aug4.png",
        "label": "certofcash",
        "ocr_text": "beheo SSUES 8 OFF Moder 7 ently holding the tor. This cerlification is ast for record and verification purposes, “issued upon ron Dang Fusntes"
    },
    {
        "image": "certofcash2_synth_7_aug5.png",
        "label": "certofcash",
        "ocr_text": "Deep SEES @O Dasion of Senos District of xe Dat CERTIFICATION This is to certify that Teacher Beatriz R. Ramos has been officially employed under Philippine Institute of Modern Studies since June 10, 2017 and is currently holding the position of Computer Science Instructor. This certification is issued upon request for record and verification purposes. Dana Fuentes ural practice"
    },
    {
        "image": "certofcash2_synth_8_aug1.png",
        "label": "certofcash",
        "ocr_text": "agmatine ofthe Phiten rs Dee? ‘oepectoneat of Hecate fogon 5 Pet Ereyy Dose of SEH ag MS rade eet CERTIFICATION This is to certify that Teacher Maria L. Dela Cruz has satisfactorily completed the academic requirements and duties assigned during the academic year 2024 2025. This certification 1s issued for reference ‘and Gocumentation purposes. Carolyn Torres Kenetng teracon"
    },
    {
        "image": "certofcash2_synth_8_aug2.png",
        "label": "certofcash",
        "ocr_text": "republic of the Philippines Toepartment of Education DepED as, istrict fangremouth CERTIFICATION This is to certify that Teacher Maria L. Dela Cruz has satisfactorily completed the academic requirements and duties assigned during the academic year ion is issued for reference 2024 2025. This certificat ‘and documentation purposes. Carolyn Torres ‘Account: *Schncs"
    },
    {
        "image": "certofcash2_synth_8_aug3.png",
        "label": "certofcash",
        "ocr_text": "Republic of the Philippines Department of tducsnen Region 5 Even Orision of va CERT OA TT oy This is to Certify that Teacher Maria L. satisfactorily completed the academi, This Certificati and documentati requirements Ing the aca IN is Issuer On purpo: Carolyn Torres ‘eee demic year d for reference Ses."
    },
    {
        "image": "certofcash2_synth_8_aug4.png",
        "label": "certofcash",
        "ocr_text": "Republic Department of DepED tangremouth CERTIFICATION This is to certify that Teacher Maria L. Dela Cruz has satisfactorily completed the academic requirements and duties assigned during the academic year 2024 2025. Ths, Certification Is issued for reference and documentation purposes. of the Philipines Carolyn Torres technician"
    },
    {
        "image": "certofcash2_synth_8_aug5.png",
        "label": "certofcash",
        "ocr_text": "Gf the seinen Cee rirfrig SATION This is fo certity that Teacher Matia L. Dele Cruz has Satisfacioriiy compieled the academic requirements and dutiés assigned during ne academic year 2024 2925, is certificat lion is issued for reference and documenta ion purposes. Carol Torres ¢"
    },
    {
        "image": "certofcash2_synth_9_aug1.png",
        "label": "certofcash",
        "ocr_text": "CREATIFICATION s that Teacher Jerome C. Dela Pefa nas factory Set 9 Nations! University of Hnology a6 a Classroom teacher for the me ification is Issued to support spplication far promotion Information Heather H eaignes"
    },
    {
        "image": "certofcash2_synth_9_aug2.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION rify that Teacher Jerome come factory service ational Univ information Technology a5 sroom teacher past five (5) years. This certification 1s issued fo support his application for promation. This is to rendered set Heather Hensiey"
    },
    {
        "image": "certofcash2_synth_9_aug3.png",
        "label": "certofcash",
        "ocr_text": "DepED Sew ean @O CERTIFICATION This is to certify that Teacher Jerome C. Dela Pefia has rendered satisfactory service to National University of Information Technology as a classroom teacher for the past five (5) years. This certification is issued to support his application for promotion. Heather Hensley Designer, graphic"
    },
    {
        "image": "certofcash2_synth_9_aug4.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is io certify that Teacher Jerome C. Dela Pefia has rendered satisfactory service to National University of Information Technology as a ciassroom teacher for the past five (5) years. This certification is issued to support his application for promotion. Heather Hensiey Denigner, groptec"
    },
    {
        "image": "certofcash2_synth_9_aug5.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is to certify that Teacher Jerome C. Dela Pefia has rendered satisfactory service to National University of Information Technology as a classroom teacher for the past five (5) years. This certification is issued to support his application for promotion. Heather Hensley Designer, graphic"
    }
]