[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "certacceptance",
        "ocr_text": "wi on, Roberts and Herrera Schooi USS Flores, EPO AP Bt CERTIFICATE OF ACCE offi ved and instatle vernon initaive, T 1 strategic campus, fia that the university camera sysiems Inyoived theinsialiaton st! Secutiy an and veriies t ep fety an monitoring, particulary c eo Uained in ino leg n John Barnelt Audiological scient"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "certacceptance",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "certacceptance",
        "ocr_text": "‘Republic of the Philippines te, Bw ‘Commission on Higher Education Region 3 ‘Schools Division of Bohol and Herrera School PO AP 81965 Wilson, Roberts USS Flores, F| PTANCE CERTIFICATE OF ACCE! ‘This Certifcate of Acceptance is Nerey jesued to confirm thatthe university Nop, is Chal received and installed New \"oP, securty camera SSIs 2 part of uccesst NY mprovement intiave, The PFT, 15 Sead fhe instalation of tity CO) the seOea in strategie campus locaton 2S curity and Maintenance OMCs supervised the entire process ‘system aims to enhance CA wus safety and monitoring, tem aime f Groal events. Staff members Tay eer trained in monitoring ot ures and incident reporting. The nbers have jon appreciates the fort Of 41 i project s completion, TNs “enificate officially acc et AnaelaRich Engineer, electronics anor Repussentatvs John Barnett Audioloaical scientist"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "certacceptance",
        "ocr_text": "LIB h oy iS and Hewera PO AP 87995 TEOP ACCEPT ane z Stratage: campo Sepervised ine gnase ei ‘yom alos io arttanee eae Pees ened schoot E J Rentoring. py events San mete! fave bees taines 206 insite vepartna ferents eve perimcits that canteies. tea p, g80 the WD cee citatiae: fotin Baumert Audiotogic:"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "certacceptance",
        "ocr_text": "‘Hilson, Reberls and Herrera Schooi Flores, FROAP 81959 USS CCEPTAN CRRTISICATE OF AG that the university has ames systains 23 part of ation of thurty G0} ‘This Ceitiicate of Acceptance 1a hateby lssued to contin essfully received art ‘eve Cainptes sect fety improvement infbative, The project involved the inst Famous iccaions The Sacuelty and M and varied pert dewens. 7 maim i enhance camaus satel and moniieing, particulary during nig 15 and school events, Staff member ia monitoring, procedures and incident raporing, The adm ffort ot at Separtents that 20 he project s o site acknowieds ‘id occephance of the new secutlly system Angela Rich Engineer, electronics John Barat Audiolagical scientist"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "certacceptance",
        "ocr_text": "Hemandaz, Duran end M: y Academy 812 Etiot Station, West Clvistina, ME C4083 hereby issued ta acknowledge ths rev iors donated by the Colege Alumni igh: nsaeciion by the Era onfirmer te meet the required quality tandarce incoming second year sclence studen s for th ilbelp Fecuce the exper of stdents whe professionalism in io lzboratory The College Dean ard the Suaply bot vetified and sigried «ff on the inshoutisn rapor, The matiution eines le someek gretiusde to ihe aiumn fer thelr Contnued support anal gariarosity toward sis wetare artiicale serves as an official acimowiedument of the donation 2 te successti temover pk of at iy Custeian s Office Fe unions wl bo borery courses semoting safety eet ti Josenh Gomez Best boy DusevBenrscuziine Michael Ramirar omimuniy develonmart worker"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "certacceptance",
        "ocr_text": "Homandes, Duean and Passer Academy 212 Ellott Station West Chilstina ME 04032 NCP CER EINICAER OF ACCE Tris Carttceia of Accaptance is hereby iniuad 10 ackrowledge ihe receipt trenty foe 125 sets of laree tary urrtcrnis dorates: Uy he Cobege Aluece Cakeh He Pact ver underwent a Brauch fapectes by the Property Cusiecian s <athoe vaecd nae Confinved te \"Demet Me FecgureS Suslty stanaacds The onkecsns wa bo gawburad Wy incoming se ot ywar science stuclants for the r laboratory courtes eTtn atin wik he p ‘eguce He expanses ot shiserts ahbe pomating fety and profeseunaiem a herabonuiy the Catleae Duran and Ne Supply OFices both veotieg veut sigtees off on the insgection (apo Sis Neate Bhimva ty ther contnued 9scfor and generost Carne ste fU Sc ate SeT1 S a8 at clad oannwsed t ng incon Anat Joseuh Goriez Best boy own"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "certacceptance",
        "ocr_text": "Hemensiez, Guran a Reset S12 Ett Station, Wage Cp E 0eea3 \"psn Se 29 ackrowteciye the sg lt of sent 3p tttiorms donsten Fath Colege na Hispection by thy Onerty Cy 3S The Unoem Gents Foe Mie iabratoy fe romting oa the Supply Gfcar Dn extend Sil Geterosity toward student gi! Scknowiedgiment a ie donation and ‘cessfidl tumouar"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippincs S Commanen on Higher Educator th i pend Se Hemandez, Duran and Massey Academy 812 Eliott Station, West Chvistina, ME 04083 CERTIFICATE OF ACCEPTANCE oe SS nae gelanc® s herby issued to the C Jwonty five (25) sts of aboratry 2008 Coch sat denc donsted by the sia confirma meet he requred ty hanes as ice the sated 1 incoming second year science students for the ake or The donation will help reduce the expense s of stidents ane oa rote ssionalism in the laboral The Colege Dean an tae Sore ately an verified and signed off on the inspection report The hence ‘grattude to the: {continued support and fomard sudent\" welfare. This serves as an its successful tumover connor Accepting Authority: Joseoh Gomez Best boy Donor Reprscatatine Michael Ramirez"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Homandiox, Duran ang Massey Academy B12 Blot ation, tues 4, 6 gusty stan: yea! science stodents for then ONSOs of stirersts 4 th aligge Bo rea eesecton ronan. Ths haan cits their continued sugars ay 8S an offi voseoh Gomaz Best bay Dower Reprcscas Michael Ramitrar Sereenunty acrornmars we"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "certacceptance",
        "ocr_text": "‘Republic ofthe Philippines communi en her Eaten we Region 4 oe e una aS Chambers Hamilton Institute USNS Deleon, FPO AA 89916 CERTIFICATE OF ACCEPTANCE Adam Patterson Academic librarian ‘Dunur Repicscatatine Jennifer Paae Technical brewer"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "certacceptance",
        "ocr_text": "melagene Chambers Harnilion Institute USNS Deleon, FPO AA 899 ‘This corities that tie metiaution has aficlaily asropted fhe compiotion ane tamawee ab the new Sheen Actwly Canter tinded under us develesment program. “The facility wes constructed in soeorianes with appraved architectural and sat standards, as verifes by the Campus Planning and Developmant Ofiew Ruorssoctatives Soin the contacter, the oniiago ackninivatan and ibe stadent ly conducted final walkthrough to ancure complinnce. Fhe new teaiding ile 9 space for oo curticular and extre curioular student actisting A wii alo gaive 88 8 venus for leadershi ‘raining, organization masons, and udtural ‘The eaministation expresses ity sin gore appreciation io ato ins the project s completion, This Carsticate of Accept zea the structure as an oficial aiidhdon te campus fost Acsupting Autiaety Adam Paterson Academic lirarian RhmesBesecswataiins: fier Page Techninal hrewer"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "certacceptance",
        "ocr_text": "milion institute PO AA 898 hambers H USNS Deleon, FF d by the ingees Cerltical: iattaddion. Adam Patiersan Academic liprarian DauowiRunresenvetie Jennifer Page echninal brewer"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "certacceptance",
        "ocr_text": "bayine ton In. mn FOC AK BY 6 CUE SURO COPPER ANGE Postterecss c librarian"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education ‘Region 4 Schools Division of aguna Chambers Hamilton Institute USNS Deleon, FPO AA 89916 ERTIFICATE OF ACCEPTANCE CERTIFICATE OF ACCEPTANCE This certifes that the institution has offically accepted the completion and tunover of the new Student Activity Center funded under the campus development program. “The facility was constructed in accordance with approved architectural and safety standards, as verified by the Campus Planning and Development Office. Representatives from the contracior, the college administration, and the student ody conducted a final walkthrough to ensure compliance. The new building provides a space for co curricular and extra curricular student activities it wll also ‘serve as 2 venue for leadership training, organization meetings, and cultural programs. The administration expresses its sincere appreciation toall offices ‘nvolved in the project s completion. This Certificate of Acceptance formally recognizes the structure as an official addition to campus facilities. Accepting Authority: Adam Patterson Academic librarian DonorRepresentative: Jennifer Paae Technical brewer"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "certacceptance",
        "ocr_text": "Dortmineion on Hepner Emcaten Castillo ine Inetituie Reber writer"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "certacceptance",
        "ocr_text": "schol Dy sis Palawan Castillo Inc institute TONST Bishop Waik, Kristensaed, ME 31469 fas CHIFICATE OF AC PAN This Gevitfzate af Acceptance confirms that the universtiy has iacaived and SucceRSfuily Installed the campus wide WEF! system Sonsteci by Telive Conmunestions. The equipment includes rater access points, ahd ne managemen; sotware which ware a testad for operetiona; otf information ata Communications Technology Ofc? suoatuted the Instabaton and yichictad connaciivay tesis in ali major Buildings The systar has significant wxoved student and oily access 16 digital resources. ‘Taining aesshons for “parse nel hays alo been scheculed fo ensu e preger nie lance anc wbleshoning Tha eiministation wecognizes Teblet Lomununicatcns for the’ 9 Supporting vigits! education. This documen sten0s as formes pact facts siccendul completion sed acoapuance by the mbvecsty Ascoing Rebecca farnes Prison officer Tinos, Bepecscmiatiis Alaxandia limenes Sriance writer"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "certacceptance",
        "ocr_text": "Castille Inc Institute 70187 Bishoo Walk, i, ME J1869 university has received 2 nated by TeiNe Sines, anc Heer a! eifcianey. 1h Accogtance contr canbus- wide Wi tested to! operat Ofice super iinge. Te Syste Ma is Comtibcate Suicceastiay installed The equ otegmasnicatiors ironaucted connectivity teste in afl majo. foieees student and scully access fo cil nnel have also Beet ‘ed to jes gating, {he sunita comnmtinaer to Supporting gtat if ne progect s SuCteSs! significanty sassions fort tui compiel Reherca Baines Prison officer Denaheenis wanders Jeencr NM Srience weiter"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "certacceptance",
        "ocr_text": "Palawan Casiillo Inc institute 015? Sisinp Wath, Kristenstad, ME 31888 CERPIEIC is that the university has recatved and wie donsted by Teiflet Corenunisariare, The equipment inchides tite points, and nework inanggement sofware, which were att A ang Conznunigations Techn 2 cedures crmeciviy tts i al major Bullogs, The aysiny fas slaruicanty 83 tod eesions for fF Pioger me ntenane Communications far the potiing dwial aducstien. Thi f stands as formal ect sworeasial completion anal azcapiance by bye univerety ucresaiully installed ra Barnes Prison officer Srience writer"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Inc Institute nagen are Communit conducted canne improvec Ice and nicalions for their formal proot ty wwatich. this decume ‘completion and accepiance"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "certacceptance",
        "ocr_text": "‘Region 9 Canmison on Higher Eaton ww ‘Schools Division ofSamar al Memillan Combs School (088 Conner Junction Suste 832, Trevorhaven, MO 21134 CERTIFICATE OF ACCEPTANCE This document certifies that the institution has officially accepted the financial assistance provided by the Department of Science and Technology (DOST) under the Facutty Research Grant Program. The funds are intended for use in approved research projects focusing on renewable energy and sustainable materials. The Research Office has verified that all requirements and documentation are complete. A memorandum of agreement between the DOST and the university has been duly signed and fled. The grant will enable faculty researchers to advance studies relevant to national development. Financial monitoring and reporting shall bbe overseen by the university s accounting department. This certificate ‘acknowledges the receipt and acceptance of the sald grant in full compliance with existing policies. .ccepting Authority Todd Wood Scientist, research (medical) DonorRepresentative: Dvlan Mvers Commercial horticulturist"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "certacceptance",
        "ocr_text": "Republic uf the Phitipoincs ‘Samar Momitian Combs Scho! 8 882, Bevarnaven, 0) 32134 tha peotided by the Brant Dy fhe insthetion hag artnet of Scien. Sure. Phe fn tthe Francia nology OST) uicier mg tbede for iiss ip scot Bipeg feta enorcy and sist matatia s The edlfied that al cecuinssien SDR documentatins sre fa 2 etween the DOST ant pe university fie Haale Faculty resmarch ays aS I evel Pg td repne 0 by the univ schnowledges the roan his O94 Wine Scientist, research (medicals Ovlan Myers Commercial hort"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "certacceptance",
        "ocr_text": "cit costtiay that me iy assistance: tended by ths epee nt of Science 994 “ehnolo 3y Basaaen Grent morandtan of agivemcn: between the DUST and the uriverstiy Nas Dole focally wines cers to axtvance Bpriec Financial mwaitoring aiid venorby shai 9 orcet ning dagerement Th eptanie of ha valet Grunt hath companion ath ce OES HUD by Be Unive acknowledges tne tceip! and a Todt Wena Serentist 2 himediwcat) Dylan Myers. Commercal horieuttunst"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "certacceptance",
        "ocr_text": "Baars of ths Prutrpincs o Comsteion on Mihe Eucatnn F ay 9 Memillan Combs Schoo! (268 Conca inaten Suite 2 Trowolaaeen MO 2118 Tits document cet tt fa intttion hes ofldaty acrwpla he fnancit aasitanen provided iy the Department of Senco ens (OST) trder Progruir, Toe und: ave intended fo tae in snrgeed fesearch project focusing 3. anewatie ergy and sustamable Reoeaich Office nas vanied that al requirements and docymant ade’ cepts A memamar of areumentimiwoan te OOS snd the avast ha been dy signed and fled. The grat wit onlo aly iepau chs to sovance statin revert fo natcoal Franca mortoing wd reporting) ser ahs anbamggee ges lee the recip ran Inbal corte wh acknomedges the receipt and acceptance of Seccmuny Autlmonts: “Toda Wood Sciendst, research (medical) Doarkerusenaes, Dvlan Myers Commercial horicuitunst"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Is oSamar Memillan Combs School ure econ Su 582, Tere MOT CERT TFICATE OF AC ‘CEPTANCE This document that the institution has oes sae 2 Beparment ori tech \"awe parent nds re le sie oe 1g on eragnewable enetgy and elainable materials. The jed that all requi Todd Wi Scientist, research ominedical) ‘Donor Repssssntalives Dvlan Myers ‘Commercial horticulturist"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines a Commision on Higher Eaucaten ow Ne ina a Estrada Wilson Institute 4090 Hughes Lock Apt. 363, Encmouth, MT 46328 CERTIFICATE OF ACCEPTANCE This Certificate of is hereby awarded to confirm that the of Ne cons emer es ceca cea manikins, ometers, and from, yrve Corporation. ‘The items were inspected by the Supply Office and confirmed to be in excellent Condition These educational tools will be integrated into the Laboratory to enhance hands on leaming Faculty members have been ‘on ‘and storage of the new equipment gealy mproweg te gully suring essen sche ness. The m expresses ‘rattle w Medgonce poration fr its continued suppor ‘acknowledgment of receipt and acceptance of the donation. ‘Assspting Authority: Bruce Villanueva Horticultural consultant Duour Repoccataiine Kristina Jenninas ‘Accountant, chartered management"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "certacceptance",
        "ocr_text": "Resowdincot the !elinoren. PAE 9 Estrada Wilson Institute 4090 Paes Leuk Ast 363. Enomout MT 4808 CERTIFICATE OF ACE! PTANCE This Certifcate of ix hereby aworded to contirn that the Nuranghes awed s oes : Assenbes. Amnon Bruce Vilaniava Horticultural consuitant Dam ccarasiains Kristine Jenninas ACONIHOns charters manaqymert Cerrmatnn 59 High Casco pie Ss ao"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commun on Her Eacten i == ‘Schools Division ofCayite Estrada Wilson Institute 4690 Hughes Lock Apt. 363, Extomouth, MT 46328 CERTIFICATE OF ACCEPTANCE This Certitcate of Acceptance is hereby awarded to confirm that the of Mring hs cvs smart varing quien indudiey shvetator have ‘and storage of the new equipment. The donation contributes ‘© improving the y nusing educate and cna poperedness The ‘Corporation for its continued support tothe medical education This certificate serves as formal ‘acknowledgment of receipt and acceptance of the donation. Accepting Authority: Bruce Villanueva Horticultural consultant ‘Duo Repoocatainc Kristina Jenninas Accountant, chartered management"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "certacceptance",
        "ocr_text": "Republic ofthe Philippines Commission on Higher Education Region 9 Schools Division of Cavite Estrada Wilson Institute 4690 Hughes Lock Apt. 383, Enomouth, MT 46928 “ERTL ATE OF ACCEPTANCE CERTIFICATE OF ACCEPTANCE Hong ate of Acceptance is hereby awarded to confi thatthe College of Nursing has received a shipment of trainin the proper handling and storage of the new equipment The Genatam connatecen argaty improving the quality of nursing education and clinical preparednace rhe College expresses its gratitude to MediServe Corporation forts coin g support tothe medical education Community This certificate serves as formal acknowledgment of receipt and acceptance of the donation Et Author: Bruce Villanueva Horticultural consultant Kristina Jenninas ‘Accountant, chartered management"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Estrada Wilson institute ee enamout. FF S78 gs hes WIA ga ot 5820 pce a nami 24TH confirm tat te CO me a acute LE si esr ope, Far, Wea oan ona icra ees hae fire wonation core ass 17 uate eaical Qecation eiswuoagret oF pnice Vilar Horticultural conguitant Tenant hapenarales Kristina Jencinas sonnten crosied ROGET"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "certacceptance",
        "ocr_text": "AloPwingasinan Howell Mertin Academy ged Bhar Ped ite $20, South Chiveoonades, TH AIRS CERTIFICATE OF ACC This certs that the Insttution fomnaily accents the donation oF fer (10) muatinedis projecters from the Botars Cauh of Makati The equipment was Yofvered ih Seales condition and inspected by the Property Office for completeness and functionally. Each uni was assigned to a specitic academic deparment for sinictio he projectors walt enhance he teaching ane fienge, especaliy for Casse' idiovistal presenting of fhe Vice President for Academic Atta Epproved their inclusion ip the schoo s property sivantary, This dona gigs with the insttuton s orgoing maduPzaton efforts, Ve university extents i deep appieciacon to the Roiwy Club of Makati tor fais meaningtul ‘caaribhion to aancation Pamela Anderson Radiakon protection practiborer DenowBeamrasatation: Erik Wes Enykontnentai health practitioner"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "certacceptance",
        "ocr_text": "offen (10 at the insttuton formally accests the donation i jpment was This cartifies that the ¥y toss from the Rotary Chub of Makati, The eat fed condivon and mspected by the Prope! y Gifice for assigned 20 a specific rojectors wit enfance NE audiovisual 5 fi artment tor instructional baming experienpe, esuocraily (0 thee atthe Vice Presitent sion in ine schoot s property in sogeminaion eters. Tr nig ine Rotary Club of Makall tor i Tontribtilion to education. approved thelt in angns with te institut axlends i$ deep spore: Pamela Anderson Radiation protection practitiones sini Erik West Ereveonmentat neaith pructinoney"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 1 Schools DivisioPefngasinan Howell Martin Academy 1944 Sheri Port Sute 422, South Chvistopherort, TX 29083 CERTIFICATE OF ACCEPTANCE This certifies that the institution formally accepts the donation of ten (10) multimedia projectors trom the Rotary Club of Makatt. The equipment was delivered in sealed condition and inspected by the Property Office for completeness and functionality. Each unit was assigned to a specific academic depariment for instructional use. The projectors will enhance the teaching and leaming experience, especially for classes requiring audiovisual presentations. The Office of the Vice President for Academic Affairs has approved their inclusion in the schoo s property inventory. This donation jlgns with the instulon s ongoing modernization efrts, The university extends its deep appreciation to the Rotary Club of Makati for this meaningful contribution to education, Accepting Authority: Pamela Anderson Radiation protection practitioner Donor Representative: Erik West Environmental health practitioner"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippinss Td Commission on Hope Earaten Region _ Sh Diisiseangesinan Howell Martin Academy 1944 Shem Pon Sute 422. Sout Chestophedtort TX 23083 CERTIFICATE OF ACCEPTANCE Ts certbes tat the insttvton formaty accepts the donaton often (10) multmedia projectors from the Rotary Club of Makati, The equ! was delivered in sealed inspected by the Property ‘or ss iy Each unt to a specific unit was a xc apartnenttor nstuctonal use The pri will enhance the teaching and leaming for requiring audiovisual ‘presentations. The Office of the Vice President for Academic Aftairs has their incusion in he schoo! s property inventory. This donation aligns with the instituton s ization efforts. The university extends ts deep appreciation to he Rotary Club of Makati for fis meaningful contribution to education ‘Ascspting Authority: Pamela Anderson Radiation protection practitioner Dass Re pie seit Erik West Envronmental health practioner"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Rapuble vt the Pubppince cn tiger Eoucaton isuion Sih. DuuPangasinen Howeill Martin Academy 1 Sete 422 San crv webetert Te 23083 accepts the donation of ter (40) mutimedia projects trom ta Rotary Ciub of Makai The 2quipment was delivered Sealed conation and inspected by the Properly Office for completeness ana functonaity Each unt was assigned to a speciic sicaaentic department for insituciionat usa. The projectors wit eniarce teaching afd teaming experience, especially tor Casses requiring auciovisiel presentations The Citice of the Vice Presiden! or Academic Aftirs has approved thelr mietusion in the School s property inventory This donation tigns with the site extends is den appr Pamela Anderson (00 protection practitioner Frik West Envronmantal haath practioner"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "certacceptance",
        "ocr_text": "© Republic of the Philippines Commission on Higher Education Region 10 Schools DivisioPeingasinan Ryan Campbell Academy (9508 Aches Chub Apt. 327, New Kristentown, SC 91144 CERTIFICATE OF ACCEPTANCE Ascspting Authority: Brent Rogers Technical brewer DonorReposcatatins: Bailev Bailey Call centre manager"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "certacceptance",
        "ocr_text": "Repubiis oi the Poilizamee fon on te Bevoater tw Sahni: Di ktoPeingusinan Ryan Campbell Academy GS Micka Ts Spt 27. Me Artatoun, 36 Te CERTIFICATE OF ACCEPTAN This Cecticate of Acceptance is haceby issued to ackowicdge the approve and pioption of the Cornmmmiy Ouiw ach Pooaram proprsas ty Be stadent Counc! he sist ans gonide has iavacy and Syelan A iese ing to neeryy colnprabencive tevin by line Otfice of Studert Mtaes the co s nission of community engagement guidelines heve been Braizad in coordinate ‘with cca! government utits Fuculty A etunieors have Been aasigced sv prot adyisers and evatatinis. The adminustratun recognizses tha clfors of the tuent Counc’ for inthaiing program that foots civic wesponsabiliy. This cortitcala fornnally cooords the project s accegtence anc erpraval fx execution. Asspung Autboic. Brent Rogers Technical brewer Dawe Bapuramnatinn, Bailey Bailey Call centre manager"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "certacceptance",
        "ocr_text": "Repub of ths Philinyines py Commieson on Mier Educator Region 10 Ryan Campbell Academy 2808 teahoe Cus Ape. 327, New atertonn, $6 U4 ERTIFICATE OF ACCEPTANCE ‘Thes Canticste of Acceptance Is heyeby issued to ack the approval ans asopton mn of the Community Cutwac: jon Bae he ve Student Cound a fae oot ie and od vating taney aps Ae a copiers found to alg with the ete hiesoncl tones engage Hfptemertation schedviaa and suey gucedres have Seen aized courdpaton ‘with leat government units. Fac tartan fave bn asin’ ns peclect asyoers Fd eyaieatts ne a ion reco ize vy rs ft Sader Iniiating a program: thet fosters civic responsibly. This tRSraly mea Yo pope’ maepance and eopraval emcaon Acscpins Autioo Brent Reaers Technical brewer Batley Bailey Call centre manager"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "certacceptance",
        "ocr_text": "ew Ryan Campbei 4, P02 nce Chis Apt, 3 Ene adoption of Phe projes barangays A dent Coun nears et Atbsrs, the mun extn fri2a hao buen Emote g ook unis. Facult’ voluntoa E aators. The aciminde Invite 3 prose records Ihe pia Fave buen assione istration recor 28 the eff Brent Rogers Technical brewer Rone Rspeessadatine: Bailev Baitey Call centres inanager"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Corssnce a Hight Sau Joo Pmingasman Ryan Campbell Academy 0508 Hanae Subs A OT New Rowientons 30 614 CERTIEIC NTS OF ACCEPTANCE This Cerite 2 of Accoptance enrty Hove to acknorsledge thw agpioval art Cornmunity Ont fam proposed by dan: Counc ane tn provide B. is acy and Weliherd tr 8 Ar 4 comate hen OMe of Student Atte the wath ca! government units Ne ren Assigned Ss pecinct advisers ars evaiuanrs: The admwniseation scognizes the efiores of tie Student vc iosconssbinty Thee cortifcale Brent Rogers Technical brewer Dupo Repassoans s Bailey Bailey Cali centre manager"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "certacceptance",
        "ocr_text": "© Rodriquez Krueger Schoo! 548 Geet Gescent, New Richaetiten, W 79191 This certifies that the universtly has accepted the delivery and instalation of the digital tbrary system provided by SduTech Soluizons system includes software lor €-hook access, digital c: ogg and dine resource sharing. The 'T Department sucesstuiy completed the system configuration and use: tesling phase. Library stalf were trained ‘on tnanaging and upcatng the new digital colcion ‘The proyect 1s expected 10 increase accessibiity to academe: matesials and improve sol eeea et acency, The aumnstzation acknowledges Fa iech Solution: HE COMM IM eHT 16 as ime iNnGvahoOn This dogypent SSNS UP SO recent oad ak acceptonce ol the dita sry system, Assepucg Aututi. Christine Watson Banker Dunn Repasuiatine: Emiiv Milis Water quatity scientist"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "certacceptance",
        "ocr_text": "Rod 54 Gront C very and h Sctutans. aloging, and pmpiated the were trained ne project is and dnprove accepted the i provided by Edu pdating the bility lo acedem stration 2 iment ibrar Water quality scientist"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "certacceptance",
        "ocr_text": "Rodriguez. Krueger Schoot Christine Watson Banker Water quality scientist"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines commission on Higher Education Region 6 ‘Schools Division oF 733g\" Rodriguez Krueger School 548 Grant Cresce' nt, New Michaelview, IL 79194 ‘This certifies that the university has accep ee the detiveny and installation of the digital library system fovided by EduTech Solutions jpstalateminclides software for e book acco. digital cataloging, and The S eesource sharing. The IT Departmen’ Sy ccesstully completed the aise. Library staff were train yystem configuration and user testing phi ystem faaging and updating the new cigtal ‘collection. The project 's expected to increase accessibilty te SSgemic materials and improve s, steseatch affcieny “Te administration ‘acknowl es Eautech solutions ‘ir Cot jitment to a mic innovatior i cument Solutions dfcar proot ot iment 10 29 NE eptance of tne Signal trary system Accepting Authority Christine Watson Banker ponor Representative Emily Mills Water quality scientist"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Repubus of the Philiayinnes ae comes, fN Reston 6 Sebowls Rican ofsreeerys Rodriguez Krueger School Prt toh salle This cevtifies that the university has accepted the ep instaltaton of the digéal libr: System adea by Fdutech lutions. The system icluoes sateen iat a owIeS Cataloging, and Oniine resource sharing. The {T Deparment sacccoue, System w “tesa! eet, Reet ST TE SANs sy Ascorting Authorisy, Christina Watson Banker Doser Remaeuatin: Emily Mills Water quality scientist"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "certacceptance",
        "ocr_text": "Ranabiie sof she Photapinas Comemiann on tiger Eeucaten 1 Baan Schule Vianna siCavte Morton White Schoo! 9865 Semuei Mall, Acarnsview, PW 65153 This Coricate certs orien sealant year A220, Mamocarebur of Agrees 238 an ee recat wear for stunts in medica Asomieg Aut Randy Smith Air traffic controler Duackgnoaiste Chetsea Grooks Conterence centre manager"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "certacceptance",
        "ocr_text": "Region 1 Schools Dission ofCavate Morton White School 9885 Samuel Mall, Adamsview, PW 65153. GS cover vane toeona (pe CERT! ICATE OF TANCE This Certificate $fAcceptance confirms that the university has entered into a partnership agreement with Cty General Hospital for internship placements for the ‘academic year 2025 2026 The Memocancimn of ment was reviewed and signed by both parties. ensuring compliance with CHED and PRC standards. The partership provides valuable dinical training for students in medical technology fursing. and physical herapy programs The hospital has allocated traning slots and receptors for student superision Orientation sessions and evaluation ‘oper implementation The institution Assspuung Authonty, Randv Smith Air traffic controller Dunur Reposentatine Chelsea Brooks Conference centre manager"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "certacceptance",
        "ocr_text": "ys bine so hs PUlaE NN Conmminn of Mejias Banter Ress t Shed DameniCavite Morton White Schoo! 92a Samuel Mal Adamsvews, pw e51S3 CERTIFICATE OF ACCEREANCE egtanca confirms tial the unrest sity burs entered ime parhrarship agresimer wth Cty Genarat Hospi ex invensig rks ke ts so Sihenie pox 202 2006 Tha Mernecarchim of Arseamene a8 ST sipred by ont parties nesting compan was sannenis. he We reechap provides vavurbse Circa: ueisng tr staderts medica! techeaiony ghycal mocap prugiarna. The hzaptsal a whee ie? Trang os CaN sevens for skscert super tsice, OneTtalcn WES OG ‘evil. ined to anaure peopny impermentatien The mst tice: ah Tegal s congrats supput ic fostering qualty nea Mer ial carticate sorves a€ formas (acog et OF ME POMERAT S Tsscoptanece wnnheecttty Tis Coniteas: of Ac Ansan sido. Randy Srwth Air traffic controller Done Resccaestauns Cheisea Brooks: Conterence centre manage"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 1 ools Division fa yite Morton White School 9885 Samuel Mall, Adamsview, PW 65153 CERTIFICATE OF ACCEPTAN' CERTIFICATE OF ACCEPTANCE This Certificate of Acceptance confirms that the university has entered into a ecadorie (ne aoe th Cky General Hospital for internship placements for the academic year 2025 2026. The Memorandum of Agreement as reviewed and signed by both parties, ensuring compliance with CHED and PRC standards. The Fureing mPeProvides valuable clinical training for students in medical technology regs ang physical therapy programs. The hospital has allocated training Sia and preceptors for student supervision. Orientai i procedures acknowledges City General Hospital s continued support in fostering qualty heith education. This certficate serves as a formal recognition ofthe partnership s acceptance and effectivity. Accepting Authority Randv Smith Air traffic controller Donor Representative: Chelsea Brooks Conference centre manager"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "certacceptance",
        "ocr_text": "faaicateticie ‘Schools Division ofavite Morton White School 9885 Samuel Mall, Adamsview, PW 65153 CERTIFICATE OF ACCEPTANCE cata of confirms that the univer ent wi tarde Ke hp plcemeis te ers Academie year 2025 2026. The Memorandum of Agreement was rev signed by both parties, ensuring *e with CHED and PRC standards, The ners! ides valuable circa traning for suri in medical technology, mars, sad sev al herapy programs. hg hospital has allocated trait eee student supervision. riectdion sessions ed eva _bjozadure have baon gon uid lo ensue proper Inplamensaton, The institution ‘Hospital s continued support sch wecge* he corficate soves as a formal eon ole cashes ‘acceptance and effectivity Accepting Authority: Randv Smith Air traffic controller Donor Reprssentatine Chelsea Brooks Conference centre manager"
    }
]