[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "certemployment",
        "ocr_text": "CERTIFICATE OF Enq PLOYMENT Bertember 42 2000 To Whar tt May Concern: Matthew Hampton» piesensiy ews Group A: aderny as of (10 a pores ofS vanes and g Russell Pytts"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "certemployment",
        "ocr_text": "Yo Whom H May Concern: ery period of vawts end Q"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "certemployment",
        "ocr_text": "Republic oF the Philippines pe Department of Fann Regimen ot aS wisi guna seeoHll PC sti Sut 731. Comystay, per CERTIFICATE OF EMPLOYMENT Se 12 oy To Whom tt May Concern: This is to certify that Matthew Hampton is presently employed in Mathews Grou Academy as of BNA 09 2005 since October 11 2002 oF tor a renan °5 years and g months. TMS Certification is issued upon the request of Russell Potts {or whatever purpose it may serve him Loretta Juarez OMficet In Charge"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "certemployment",
        "ocr_text": "Divisionpaguna Hall PLC Institute: 15214 chatopher Pont Sule 731, Catrystad wa30a0\" me Republic ofthe Philippines 3 Li] 5 Pearman Ean eT) Se _ CERTIFICATE OF EMPLOYMENT September 12 S00 To Whom It May Concern: his isto ceruity that Matthew Hampton presently employed in Mathews Group Academy as of Jansanios 205 since October 11 2002 °F for 2 Period of 5 years and Q months. ‘This certification is issued upon the request of Russell Potts for whatever purpose it may serve him. Loretta Juarez Officer n Charge"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "certemployment",
        "ocr_text": "tegune Te May Cancer: pion Cxtot y menths - o years and oy 1 lvarog"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "certemployment",
        "ocr_text": "Yo Whom it May Concern: enity that Amanda E Haas, Musphy and ce daly 17 2042 peros of 2 years an request of Suilie Martin"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "certemployment",
        "ocr_text": "CERTIFICATE OF EMPLOYMENT May 21 2000 To Whom It May Concern: This is to certify that Amanda Hinton 's presently employes in. Haas, Murphy and Richardson School of ‘April 07 2021 since July 17 2012 oF for period of 2 years and 2 months” This certification is issued upon the request of Julie Martin for whatever purpose it may serve him. tBR,"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "certemployment",
        "ocr_text": "tuk as ee CERTIFICATE OF EMPLOY meny MNT cay 70 Wenam 1 May Concnrn. 2s anu Jule ty"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "certemployment",
        "ocr_text": "Hardina and Sons Academy 7103 Syrney Squares, Tmeyourgh, AK 80007 CERTIFICATE OF EMPLOYMENT May 21 2000 To Whom It May Concern: ‘This is to certify that Amanda Hinton is presently employed in ~Haas, Murphy and Richardson School as of April07 2021 since July 17 2012 oF for period of 2 years and 2 months. This certification is issued upon the request of Juli julie Martin for whatever purpose it may serve him."
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "certemployment",
        "ocr_text": "Republic ofthe Philippin Departmer Region Divisiongtylacan Harding and Sons Academy 7108 Syehney Squares, Tseyburgh, AK 50007 CERTIFICATE OF EMPLOYMENT May 21 2000 To Whom It May Concern: This is to certify that Amanda Hinton is presently employed in Haas, Murphy and Richardson School as of April 072021 since July 172012 or for a period of 7 years and 2 months. This certification is issued upon the request of Julie Martin for whatever purpose it may serve him."
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "certemployment",
        "ocr_text": "Avale LLC 8072 Galanay Vig ot Bae CERTIFICATE oF EMPLOYMENT May G4 20114 To Whom May Concerns Te 18 t cursity that Melissa Huber Woodard, Lee ang Srown institute: OS® March 26 2014. or for e perad arg a8 of ears ane tion he request * Katharine Griftin hatever p nim,"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "certemployment",
        "ocr_text": "CERTIFICATE OF EMPLOYMENT May 04 2071 Te Whom it May Concern: ‘Wood March oa is"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "certemployment",
        "ocr_text": "CERTIFICATE OF EMPLOYMENT ya wnam it May Concerns stitute fp oynace and Katherine Grin"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "certemployment",
        "ocr_text": "7 ~\"Leyte cons Ayala LLC Schoo Yate Pon Bruce ni CERTIFICATE OF EMPLOYMENT May 04 2011 To Whom It May Conce, This 5 to certify that Melissa Huber employed in Woodard, Lee and Brown Institute SSBF since March 20 2014 oF for a perod of ‘months '5 presently 1 Years and 1 Ths Certification 5 issued upon the ““* Katherine Griffin {or whatever purpose may sery fe him ristine Richards."
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "certemployment",
        "ocr_text": "Republic of the Philippines scam of eeete A Division Leyte ~~ Ayala LLC Schoo e072 Gutowey Viet. Por Bre, WH oe CERTIFICATE OF EMPLOYMENT May 04 2011 To Whom It May Concern: Melissa Huber ad Lee and Brown Institute ad ‘or for period of 4 years. and 1 This is to certify that employes in. Woodard, Nowagpe 8 since March 202014 months” upon the request of Katherine Griffin ‘This certification is issued serve him. for whatever purpose May"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "certemployment",
        "ocr_text": "an Nee Bud Academy CERTIFICATE OF EMPLOYMENT To Whom Ki May Concern: p institue a erent og years andy Zachary Sanchez Joseph Strona"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "certemployment",
        "ocr_text": "af Fancation WWitiamson, Cu Seavey Fo Whom it May Concerns nae Paula Jenkins Rodriquez Group in 6 2647 o« Fora Zachary Sanchez. org"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "certemployment",
        "ocr_text": "“Bbiacan ‘Cunnmanam ad Bini Academy way hey 26597, Part it, DD Witiam: CERTIFICATE OF EMPLOYMENT Yo Whows May Concern: y that Paula Jenkins Rodriquez Group institute as oF vince September 16 20 Por for s paind of 4 years pesige, sanatha, request of Zachary Sanchez whatever purpese it mays Joseph Strong"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "certemployment",
        "ocr_text": "gible af he Pitino rend a? Kabecatien: ae a a ae Witlamson, Cunningham and Bird Acedemy S12 ay agray gt 997 te BD CERTIFICATE OF EMPLOYMENT Yo Whom ff May Concern: is to comity Paula Jenkins pieseny erapioved to Rodriguez Group instituis August 02 1022 since September 16 2017 oF fer o per as of 4 years andeg moaths. jee upon the resus of Zachary Sanchez for whatever purpese A may sete joseph Strong"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "certemployment",
        "ocr_text": "ason, Cunninane BERG) Hah fe n and Bird Acad: este, CERTIFICATE OF EMPLOYMENT srontis this certifi coe whale"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "certemployment",
        "ocr_text": "ies Republic ofthe Philippines Department of Education Region 7 PeisenFarlac Moore. “Setiantes and Watson University CERTIFICATE OF EMPLOYMENT ‘August 28 1998 To Whom It May Concern: This is to certify that Lori Rogers 's presently employed in Short Bryan School as of Fetey 08 since April 03 2023 or for a period ofS years and 5 ‘months. This certification is issued upon the request of Ivan Smith for whatever purpose it may serve him. Alex Stone Oficer In Charge"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "certemployment",
        "ocr_text": "CERTIFICATE oF EMPLOUMERT uggs 28 1888 To véham May Concent to cenily shat Lon Rogers iso Shor Biryan Sconce as af gr tor 8 geras of te 5 yar 208 5 ivan Smith"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "certemployment",
        "ocr_text": "Te Whom it May Concern: Loni R +-Bryan 5 5 Years ond 5 ments, “ivan Srvith Ajex Stone"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "certemployment",
        "ocr_text": "_Deperimce ot Fdeotn uy . Tarlac Moore. Cervantes and Watson University CERTIFICATE OF EMPLOYMENT August 28 1998 To Whom It May Concern: This 1s to certify that Lori Rogers 5 present Short Bryan School asof nce Apnl03 2023 or for 2 perod of 5 years and 5 Ivan Smith Alex Stone"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "certemployment",
        "ocr_text": "Moore, Cer CERTIFICATE OF EMPLOYPMENT To Whom i May Concern: This ws te Lori Rogers Shor Bry"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "certemployment",
        "ocr_text": "Tu Waany tt May Concern: Doyears and snanihs Donna Shea"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "certemployment",
        "ocr_text": "aot, Republic of the Philippines Department of Education Region 19 <4 Divisions iawan Lee, Martinez and Moore Institute 3202 Kathleen Por, Douglasberg, TN 75160 CERTIFICATE OF EMPLOYMENT. July 29 2025 To Whom It May Concern: This is to certify that Jessica Butler is presently employed in Reid Young College as of January 03 2001 since January 23 1998 or for period of 2 years and 4 months. This certification is issued upon the request of Donna Shea for whatever purpose it may serve him Kristin of QWIRAN,."
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "certemployment",
        "ocr_text": "sat ot Focation Yo Whom ft May Concerns Butler lege b uatod Of years and 4 Donna Shea"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "certemployment",
        "ocr_text": "Peptic of fe Panlirpies Depactnwret of Eee. ation Rezion 2 Do PRlawan Lee, Martinez and Moore Insitute 3202 Katnawn Po, Ceugesiary, TH 75160 CERTIFICATE OF EMPLOYMENT july 29 2625 To Whom It May Concern: This is to certify that Jessica Butior fc presently employed in Reid Young College as of January 200% since January 23 1908 oF for verted of 2 years and 4 menths. This certification i issued upon the request of Donna Shea for whatever purpose it may serve him. Kristin Bowman,"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "certemployment",
        "ocr_text": "Republic of the Philippines awa wy Dasiopalawan Lee, Martinez and Moore Institute \"3302 Kathie Port, Dougiasberg, TN 75100 CERTIFICATE OF EMPLOYMENT July 29 2025 To Whom It May Concern: This is to certify that Jessica Butler vs presently employed in Reid Young College as of January 03 2001 since January 23 1998 oF for a perod of 2 years and 4 months ‘This certification 1s issued upon the request of Donna Shea for whatever purpose it may serve him. Kristin oBQwman..."
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "certemployment",
        "ocr_text": "Republic ofthe Philippines Department of Education Region 40 DwsOERgayan Sims. Daugherty and Dunn School Thamasborough, MD 4293 Jom Pace, ‘ere CERTIFICATE OF EMPLOYMENT August 27 1997 To Whom It May Concern: This is to certify that Kimberly Bradford is presently employed in Wright PLC University as of SsP gge OT since January 13 2018 or fore Period of years and 7 months. ‘suest of Amanda Myers for whatever purpose it may serve him, Evelyn Jenkins Oficr f Ch"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "certemployment",
        "ocr_text": "Republic ofthe Philippines iment of Education gion 40 Divisio gayan Sims, Dauaherty and Dunn School 4283. 4, Tarasbocugh, MD 67145, st CERTIFICATE OF EMPLOYMENT ‘August 27 1997 To Whom It May Concern: This is to certify that Kimberly Bradford __ is presently employed in Wright PLC University as of Sevtegye' 07 since January 13 2018 or for a period of years and 7 months. This certification is issued upon the request of Amanda Myers for whatever purpose it may serve him. Evelyn Jenkins Oftcerto Charge"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "certemployment",
        "ocr_text": "y and Dyna Senost ngs CERTIFICATE OF EMPLOYMENT avguat 27 1987 to Wham It May Concern Kirnberly Bradford 5 te certty mat a) ing cn the east ot Amanda Myers issued Ups! ee i may sesve Bar. vie Dt JERKS sia Phage"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "certemployment",
        "ocr_text": "To Whore it May Concern: This is to certity thee Kimberly Bradford Wright PLO Uh Jenuary 13 2018 or fer a as of Sears ane 7 Amanda Myers"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "certemployment",
        "ocr_text": "of Educeon CERTH sugust 374 y Concent To Whew it Ma Kimberly Bradford is presently miverety years «eT"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "certemployment",
        "ocr_text": "CERTIFICATE OF EMPLOYMENT August 22 Yo Whom it May Conc 5 presently ley Lid instiiute of or ier a pared ef 3 years and g Kelly Johnsen Scott Harri"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "certemployment",
        "ocr_text": "Republic ofthe Philippines Department of Education Region 10 DiviioBenguet Fowler Group Academy PSC 6691, Box 7869, APO AA 97673, CERTIFICATE OF EMPLOYMENT ‘August 222019 To Whom It May Concern: This is to certify that Fred Wilson is presently employed in Bailey Ltd Institute as of June 04 2017 since May 222008 or for a period of 3 years andg ‘months. This certification fs issued upon the request of Kelly Johnson for whatever purpose it may serve him, Scott Harris neertn Charge"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "certemployment",
        "ocr_text": "Pepartssont of F, Regex 10 Pen guet Fowler Group Ac PSC S095, Box 7689, AROMA gromy CERTIFICATE OF EMPLOYMENT August 2 2019 To Whom it May Concern: This 15 to comity chat Fred Wilson ‘S presentty eenpiayed in Bailey tte institute aor June 04 2017 since May 222008 ov 190 peed of Years and g mouths TH centification is issued igen ‘ne weeeest of Kelly Johnson for whatever purpose ray Beeve bins"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "certemployment",
        "ocr_text": "CERTIFICATE OF EMPLOYMENT ‘Yo Whein ft May Concern: aso 58 £5 years and g so Kelly Johnsen"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "certemployment",
        "ocr_text": "& J a 10 t wT Fowler Group Academy PSC 6681, Box 7869, APO AA 97673 CERTIFICATE OF EMPLOYMENT August 22 2019 ‘To Whom It May Concern: Ths is to certify that Fred Wilson is presently employed in Bailey Ltd Institute as of june 04 2017 since May 222008 oF for period of 3 years. and Q ‘months. This certification is issued upon the request of Kelly Johnson for whatever purpose It may serve him"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "certemployment",
        "ocr_text": "Republic ofthe Philippines Department of Education Region 8 Division ofariac Hopkins, Howard and Grimes Institute Taylor Svavenue, New Sarahtown, Ri saat CERTIFICATE OF EMPLOYMENT Ney sber To Whom It May Concern: This is to certify that. Raymond Parker _ s presently employed in Tran PLC Institute Se March 18 2008 since October 09 2018 \"oF Period of 4 years and months. ‘his certification is issued upon the request of Angela Castillo for whatever purpose it may serve him."
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "certemployment",
        "ocr_text": "Hopkin and Grimes institute oeiman, lee Sano, Ps one CERTIFICATE OF EMPLOY MEAT Raymond Parker is presently Tran PLC fnstitute as of a4 epars emtigg ela Castili purpose may cere hi"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "certemployment",
        "ocr_text": "fe Repub ote Pitppines ea) Hopkins. Howard and Grimes institute ‘Stevens, New Sarahiown, CERTIFICATE OF EMPLOYMENT “ersaber To Whom It May Concern: This is to certify that Raymond Parker ‘S presently employed in Tran PLC Institute bated March 18 2008 *°* October 09 2018 ©F for a pered of 4 ears andyo months TWs certification is issued upon ine reavest of Angela Castillo {or whatever purpose it may serve hie, senlney"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "certemployment",
        "ocr_text": "Repco he Pi Dison fertac Hopkins, Howard and Grimes Institute 2076 Toyir Savane, New Seranown, Ft CERTIFICATE OF EMPLOYMENT NSYSBBS\" To Whom It May Concern: his is to certify that’ ~—- Raymond Parker —_ s presently employed in Tran PLC Institute asof March 182004 since October 09 2018 &F for 2 period of 1 years. and4Q months This certification is issued upon the request of Angela Castillo for whatever purpose it may serve him Monigéinery Olseersbec hare"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "certemployment",
        "ocr_text": "Reputie a! te Piggies 1 ‘ariac Hepiins. Hoxard ang Grimes Insitute nme New rwartoen weed CERTIFICATE OF EMPLOYMENT Te Whom it May Concern: Tes Ge cou msi Raymond Parker presently enaployed ‘0 Tran PLC institute a Maren W2E84 see October D9 2018 OF (or perce of} years enezo months This certification is issued voor the reasett ot Angela Castillo for whatever purpose i may serve Nien"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "certemployment",
        "ocr_text": "‘Palawan Dunn. Greer and Wallace Institute 548 Jenner Vile, Yangturt 014 CERTIFICATE OF EMPLOYMENT May 25 2022 To Whom It May Concern: This is to centity that James Weber presently employed in Montes Ltd University as of OecggRe sinceFebruary 27 2019er for a perod of years and Gg months This certification 1s ~\\° Monica Pacheco for whatever purp Angela Wilson"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "certemployment",
        "ocr_text": "CERTIFICATE OF EMPLOYMENT fo inom 1 May Eaneeen: ond years Monica *"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "certemployment",
        "ocr_text": "Repwbtic nf dae Phaitigpines eporcimeat of Edweanioy Rexioa a Deowhtewan Gunn, Greer and Wallace institute 53 Jeneiter Vite, Yangtun, WA $1084 CERTIFICATE OF EMPLOYMENT May 25 2022 ‘To Wham It May Concern: This is to certity that Jaines Weber is presently employed in Montes Ltd University as of Docamme since February 27 201G0F for o period of 5 years ans G months. This certification is issues! upon the reauest of Monica Pacheco for whatever purpose may serve him,"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "certemployment",
        "ocr_text": "Brey ana, Gre Ma To Whom it May Cancers: of years and This centificat for where"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "certemployment",
        "ocr_text": "Yo Whom it May Concern: erty tat James Web Jantes Lid Univers! i 1s years ana Monica Pacheco"
    }
]