[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education Region 12. Benavet P) Brit avg gel Sur Depe Li Bennett University ‘South Lisaland City CERTIFICATE OF ENROLMENT This 's to certify that Dana Velasquez with 5196434 s Officially enrolled in BN gh Sownce nat Stokes Ltd Academy Quezon City bivision’ School wear gg93 St Purposely to avail the Needed for enrotment vert ication by a prospective employer 'ssued on this 16 day of Juy 9946 at Moore PLC College Bulacan Philippines Seth Russo Registrar Noted by Matthew Nguyen"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education Region12, Benauet r See psu DepE Li Bennett University ‘South Lisaland City CERTIFICATE OF ENROLMENT This is to certify that Dana Velasquez with 5496434 is officially enrolled in Rach <i sGeacs Gat Stokes Ltd Academy Quezon _ “ity Bivision, Schoo! Year 2022 2025 This certification is issued upon request purposely to avail the Needed for enrollment verfication by a prospective employer. Issued on this 16 day of Juy .20168 Moore PLC College Bulacan Philippines: Seth Russo Registrar Noted by: Matthew Nguyen"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "certenrollment",
        "ocr_text": "rent of Education Benguet Brag mgt Dept Li Bennett Uni iversity South Lisalang City Departm Region 12 CERTIFICATE OF ENROLMENT This is to certify that Dana Velasquez with OFFclalv enrolled in Buehler of Sent Cee Year op SORES Ltd Academy Quezon Civ Bwisin: School tear 29S 2025 'ssued on this 16 day of Juy 2016 at Bulacan Philippines Moore PLC College ‘Seth Russo Registrar Noted by: Matthew Nguyen"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "certenrollment",
        "ocr_text": "U Bennett University Soun inaiend Cty CERTIFICATE OF ENROLMENT This is to certify that Dang Velasquez with 5196434 ofMeniry enrolied in Pasheter et Sevace mye Stokes Lid Academy Quezon Cy vision: Shoal wear ns arene et UPOR reRUESt pumpOSty to aval the Yercaton by a Srospective enptyyor, Wssued on this 16 day of ney a Cc aro \"Philippines 218 Moore PLC College This certificat Needed for envoknant Seth Russo Registrar Noted oy Matthew: Nguyen"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "certenrollment",
        "ocr_text": "@ Department es pavration Region12. Deas ogg ow DepED LiBennett University ‘South Usaland City CERTIFICATE OF ENROLMENT This is to certify that Dana Velasquez with 5496434 officially enrolled in fashelc Ascears eat Stokes Ltd Academy Quezon _ tty Division, School Year 2022 2025 This certification is issued upon request purposely to avail the ‘Needed for enrolment vertfication by a prospective employer. Issued on this 16 al 4 2016 Moore PLC College Bulacan ennppinen: ‘Seth Russo Registrar ‘Noted by: Matthew Nguyen"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education Region 3 Batangas ry “Guezonteceetione DepED Dver Mills College Walshhaven ty CERTIFICATE OF ENROLMENT This is to certify that Ruth Brown with 7496796 officially enrolled in S9gs E9j88em5 °° at Hodae Flynn Institute Cavite City Division, Schoo! Year 1981 1982 This certification is issued upon request purposely to avail the Required for participation in an academic competition. Issued on this 4 day ofbecember2005 4 Fox LLC School Cavite Philippines. Denise Brown Registrar Noted by: Nicholas Rose"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Nicholas Rose"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "certenrollment",
        "ocr_text": "Bs Devas MUNENE Bf Education Region 3 Watshhavanty CERTIFicaTE OF ENROLMENT This 15 t0 contty thet Ruth 1 Brown 7498796 Aicioty eoeciied in SEES Reamer n Hoxioe Fynn Instiute Cavite cayomnere Scho Yer 198 1982 Iie SeUMCatiOn is sue Ypen St PUECSHY tw sit the Requires te partepaton in an academe compets tsmued on this 4 aay Decor 205, Cavite Prlticpines Denise Awe Registrar Noted a Nicholas Rose"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education Region 3, Batangas Division of Dver Mills College WalshhavenCity CERTIFICATE OF ENROLMENT This is to certify that Ruth Brown with Officially enrolled in 8 at 9 sof Science Hodae Flynn Institute Cavite City Division’ School tear 1981 1982 6796 s This certific ation is issued upon Required tor partic Fequest purposely to avail the ation in an academic competition Issued on this 4 day Y ofDecember 9095 at Cavite Philippines” Fox LLC Schoo! Denise Brown Registrar Noted by. Nicholas Rose"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "certenrollment",
        "ocr_text": "with yan tastite Hones by"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Defer Joneshaventty CERTIFICATE OF ENROLMENT This is to ve Hecas Norte Civ Gis wih g3g964q is Melson Raberts Schoo! 4889 1989 This cenitication is iseued upon re For shidant vise renewal purposes, auesk pupoRely to eval the lssed a9 this 7 aay ofpeewnter g Pee 788 Bp Sur Phipps amen tee Regi Sierra Flake"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "certenrollment",
        "ocr_text": "tment of Education f Bukiénon Division af BE San DefiE Turner PLC Academy JoneshavenCity Region g CERTIFICATE OF ENROLMENT This is to certify that Garrett Smith with 8399644 is Tey cRreled in Bechgexorsaearn el Nelson Roberts School locos Norte City Division Zenog) Year 1980 1980 This certifica For student SAY ofbecember 1976 at Brandt Woods Academy Zamboanga del Sur, Philippines. James ee Registrar Noted by: Sierra Riake"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education Region 8 Bukidnon ry Este Sanat DepED Turner PLC Academy Joneshaven ity CERTIFICATE OF ENROLMENT This is to certify that Garrett Smith with 399644. officially enrolled in Seagcherey=\" at Nelson Roberts School Ilocos Norte “ity Division, School Year 1980 1989 This certification is issued upon request purposely to avail the For student visa renewal purposes. Issued on this 7 day ofpecember1976 st Brandt Woods Academy Zamboanga de! Sur __ Philippines. James ee Registrar Noted by: Sierra Rlake"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "certenrollment",
        "ocr_text": "wo Department of Education Region 8 Bukidnon Division st “Sam 8 oan Dee Turner PLC Academy JoneshavenCity CERTIFICATE OF ENROLMENT This is to certify that tsoatrett Smith with 8399644 is Officially enrolled in Bach, Ssooreaneyee at Nelson Roberts School locos Norte. City Division Schoo! Year 1980 1989, This certiicatio Sara ntS% UPON request purposely to avail the For student vi 'sa renewal purposes. Issued on this 7 day (December 1976 at Brandt Woods Academy Zamboanga del Sur, Philippines James ee Registrar Noted by: Sierra Rake"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "certenrollment",
        "ocr_text": "CERTIFICATE OF ENROLMENT james) oF rstrat"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "certenrollment",
        "ocr_text": "C Universit ez toviety CERTIFICATE OF ENROL Mgarr Hoces Needag Nancy trom Regisirg fitchell"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "certenrollment",
        "ocr_text": "on, Keath and St nomas Registrar Noted by Brianna Mitchell"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "certenrollment",
        "ocr_text": "‘This is to certity that. Marco Campbell with 2848016 officially enrolled in wi seceraeny at Scott and Sons University bares, aveaton locos Norte “*y von: ‘schoo! Year 2022 2014 ‘This certification is issued upon request purposely to avail the Needed for internship placement documentation. issued on this 9 day ONovember 1985 Clayton, Kesh and Gonaater Cotege Bohol Philippines. Nancy Thomas Registrar Noted by: Brianna Mitchell"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "certenrollment",
        "ocr_text": "Denk Domingueziovary CERTIFICSTE OF ENROLMENT LOH ES clay ofnioy Bohat Brianna Mitehet"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education Regiont0, Albay PY Division of isin gf. locos Norte DepED Jones Inc University Domingueztovirty CERTIFICATE OF ENROLMENT This is to certify that Marco Campbell with 2g4g016 s officially enrolled in SeheeetSeconday at Scott and Sons University llocos Norte “ity Division’ school Year2022 2014 This certification is issued upon request purposely to avail the Needed for internship placement documentation. Issued on this 9 day ofNovember 1985 at Clayton, Keth and Gonzalez Colege Bohol Philippines. Nancy Thomas Registrar Noted by: Brianna Mitchell"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education inion docus Norte Tanac Destnct Gresn and Sons College ‘conto, CFF CERTIFICATE OF ENROLMENT Tints fs to coetify thine Carle Jones wan 3430663 omtciaiy anvotied in BRAS SEER, at Jonnson and Sons Academy Quezon (City Divison, School Wear 2024 2617 ‘This cerviication Is isturd upon request purponty te avail the Required for participation m an academic competition anes on tin 9 owe a 1870 Chan K . 978 Chan fownsend Academy Scott Brown Registrar thes by Dr. tie Jordan:"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Rlequired tor parti purposely to avail the competition leet on day of vey ya7e etc) Phiagoines rani Foy Pagistrar Hoved bv: Br Aim tordan"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "certenrollment",
        "ocr_text": "Debet Green and Sons College cardioun CY CERTIFICATE OF ENROLMENT This is to certify that Carla Jones with 3430863. officially enrolied in £achels' gi $608 2, at Johnson and Sons Academy Quezon City Division, School Year 2024 2017. This certification is issued upon request purposely to avail the Required for participation in an academic competition Issued on this 9 day of 47 4978 at Chan Townsend Academy Cagayan Pri Scott Brown Registrar Noted by: Dr. lim lordan"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "certenrollment",
        "ocr_text": "CERTIFICATE OF ENROLMENT This is to certify that cig Joe with 3436863 Sed “at Johnson and Sons Acedemy ofsciatty envailed in Quezon ‘Soot Grown Registrar Noted by Or, fee Jordan"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education Region 6 Samar Division af _tlocos Norte E' Tarlac District Green and Sons College Cadioun CO CERTIFICATE OF ENROLMENT This is to certify that Carla Jones with 3430863 officially enrolled in Rachela 2. S2606 0 at Johnson and Sons Academy Quezon “ty biision. School Year 2024 2017 ‘This certification is. issue Required for participation in an academic compe! iesued on this 9 day of Juy .4978 Chan Townsend Academy Cagayan Philippines. 4 upon request purposely to avail the tition. ‘Scott Brown Registrar Noted by: Dr. lim lordan"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Region 2. Din anal tie ry Brown, Soott and Grey Schoo! Worth Paul SY CERTIFICATE OF ENROLMENT This 1s to certify thet Caroline Roger: wet 4945930 cihcioity enratied in Nerd Easeaton Nertes LLG University Negros Occksertat ote MSRocc Year 2013 1984 ‘This cortineation is iesued upon request wrpanaly to avel the Yo update student recards wn a partner stitution Istued on this 13 Cay otiovenba 2004 3 Cervantes PLC Academy Raat nipples: Frank Savuth Registiar motes by Patricia Cox"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Brown, Soott iy Noith Paui C& a parines chcexeenees 2004 Cary: oe issued an tf Rial Heed by Patricia Cox"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education Region’? Sorsogon Bere ese fi Taqunapistrct DepE Brown, Scott and Gray School North Paul Cy CERTIFICATE OF ENROLMENT This is to certify that_ Caroline Rogers with 4915930 officially enrolled in Smeg eifse., at Morales LLC University Negros Occidental City Division. Schoo! Year 2012 1984 This certification is issued upon request purposely to avail the To update student records with a partner institution. Issued on this 13 day ofioverbe: 2004 at Cervantes PLC Academy Rizal Philippines, Frank Smith Registrar Noted by. Patricia Cox"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education ion 2 aie Oa napid te DepE Brown, Scott and Gray School North Paul City CERTIFICATE OF ENROLMENT This is to certify that Caroline Rogers with 4915930 s Negally enrolled in -SesnaeretEany ar Morales LLC University Negros Occidental cify Bivision Schoo! tear 2012 1984 n is issued upon reque st purposely to avail the ‘cords with a partner instit tution, Issued on this 13 day ehovenbe 2004 at Cervantes PLC Academy. Rizal Philippines. Frank Smith Registrar Noted by. Patricia Cox"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "certenrollment",
        "ocr_text": "Region 2 Baoan gta Cagunanitnt own, Sonit and Gi North Paut CERTIFICATE OF ENROLMENT wh -49tse30 ube ueiversty ental OA west purpasety co avail He tat is issued upon rea ds with a patna i cthamae 204 Cervantes PLC Academy” Prank Smith Patrician COX"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education Region12, _ Nearos Occidental ry Quezon DepED Bender, Ward and Cole University RebSeabiow CERTIFICATE OF ENROLMENT This is to certify that Rrandon Sanchez with 3929551 officially enrolled in Sgangeifinggemen at Tucker Martin College ‘Zamboanga del Sur City Division, School Year 1973 1985 This certification is issued upon request purposely to avail the Needed for internship placement documentation Issued on this 2 day ofbecenber1981 at Bradley Ortega School Palawan Philippines. David .lohnson Registrar Noted by: Maurice Stevens"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "certenrollment",
        "ocr_text": "request 6 uTRENIation: avail the 981 Bradley. Ortega Sch Savi Reqitrar 28 by: Maurice &"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education Region12. Negros Occidental Division of Nueva Ecija ‘QuezonDistrict Bender, Ward and Cole University City Dee ReptSeSview CERTIFICATE OF ENROLMENT This is to certify that “Rrandon Sanchez with 3929551 s officially enrolled in Sguismasssgeten’ at Tucker Martin College Zamboanga del Sur City Division, School Year 1973 1985, This certification is issued upon request purposely to avail the Needed for internship placement documentation. Issued on this 2 day olbecenber1981 Bradley Ortega School Palawan Philippines. David -lahnson: Registrar Noted by: Maurice Stevens"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "certenrollment",
        "ocr_text": "CERTIFICATE OF ENROLMENT wits gz2B55T eei Niastin College Zampoange a! 1873 1985 ve inves upon request purvostly te ova whe {parent seth that aiticielly encoded io ea This is to cer This cotiie Blea dedt fox day otsorenns 44 Hr agiey Ortega School Pepin Pawan Bawid dots Register Mausee Stevei"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "certenrollment",
        "ocr_text": "ie Quezon 322! Mote by Maurive Stevens"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "certenrollment",
        "ocr_text": "B Department of Education Region Divisionot gel BE istrict Ruiz, Fisher and Taylor School Aliciaberg Cty CERTIFICATE OF ENROLMENT This is to certify that Jerry Murphi wah 9] Cat ca eka ot ay pant ay 8718443 Cavite City Division. Schoo! Year 1993 1991 'ssued on this 10 day of Agat locos Norte Philippines Tiffany Leon Registrar Noted by. Angela Williams"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Bapartmnaen of Exucation Alciatery CERTIFICATE OF ENROLMENT Jerry Murohy pe 7184450 ton ara Bienen Tereod a edt tipon f Recor with a Darien msttioy fo avoil she ismaed on this 19 day of 03 Norte Prt t990 2 Nove by Angela Willams:"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "certenrollment",
        "ocr_text": "aly to avai the ola Willa:"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "certenrollment",
        "ocr_text": "'S apartment of Education SR vise Ruiz, Fisher and Taylor School Aliciaberg SY CERTIFICATE OF ENROLMENT This eify ther Jerry Murphy with 9718443 offeialty enrolled in Senge sceee at Jehmson, rismiton and Fiveua Scroot Cavite city Division, ‘Schoo! Year 1993 1981 ‘This certification is issued pen request purposely to avall the Yo update student records with s partner inslitution, ‘scved on this 10 day of Amd 3 1900 8 Hans, Daniel and Cobh Acacenty« fecos Norte Piling Fflany i200 Registrar Noted by. Angela Williams"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "certenrollment",
        "ocr_text": "ry Department of EdUCatON Region cet Brvsieg ss,, Sorsogon CERTIFI ins 16 Cavite To update student 1200\" tesves on fincas Notte wane bv Angela Withams ths 10 day of Ae 1990 Bho owt yor and Taylor ‘Schoo! Alciaderg “Y CATE OF ENROLMENT win 9748403 non 9 RO SE at Hees, Daniel arnt CODD ACHE Prainpines Tiffany LEO Register"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "certenrollment",
        "ocr_text": "SSSSQqQm Dm 2 05 Department of Education Region 2 Aquean det Sur Beisien att Laan De} Waller | C School New Kenneth Cty CERTIFICATE OF ENROLMENT This is to certty that Teresa Morgan with 7238312 officially enrolled in SmrarctSezrer at Morns Group Academy Leyte City Division, School Year 1995 2011 This certification Needed for internship placement documentation Is issued upon request purposely to avail the igsued on ths 27 day of May .2012 8 Bray, Smith and Guerra Insitute camar Phuippines Brett Suton Registrar Notes by Anthonv Forbes"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education Region 2, Agusan del Sur o OM amyl I DepED Waller | C School New Kenneth City CERTIFICATE OF ENROLMENT This is to certify that Teresa Morgan with 7238312 officially enrolled in B 4q 9 Seeree i\" at Morris Group Academy Leyte City Division, ‘School Year 1995 -2011 This certification is issued upon request purposely to avail the Needed for internship placement documentation Issued on this 27 day of May .2012 at Bray, Smith and Guerra Institute Samar Philippines. Brett Sutton Registrar Noted by: Anthonv Forbes"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "certenrollment",
        "ocr_text": "pepartment of Education Region 2» Aqusandel Sur Seren at lo Eadavawistret Dee 4 Waller 1C School New Kenneth CY CERTIFICATE OF ENROLMENT this is to certify that Teresa Morgan with 7238312 officially enrolled in BeMasgcgiyes at Morris Group Academy Leyte ct Dilsion: Schoo! ear 41995 2011 ‘This certification is issued Needed for internship placemen' upon request purposely to avail the ‘t documentation. sesued on this 27 day of May .2012 Bray, Smith and Gvera Institute Samar Philippines. Brett Sutton Registrar Noted by: Anthonv Forbes"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "certenrollment",
        "ocr_text": "Needed for internshgs placem documentati 201ze Anthony Forbes"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "certenrollment",
        "ocr_text": "This cervtienti 9 placement nip Sueur ins! pan by Anthony Forbes"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education Region Tat MD ambategict Del i 126, Collins and Simp on University Michasibury ty CERTIFICATE OF ENROLMENT ‘This 6 to cesti ofcialty enroiieg iy Sete! by ow asi 19 This Fors 3% Beued user requent purposely to avail ident visa renaval pumoses bescited on this 2D cay oBeetemnter Bviacan Pe Brown Clark institute Jostiia Amoie Registrar"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Department of Education Region date vision of Fambalesistic DepE Gates, Collins and Simpson University Michaelbury“\" CERTIFICATE OF ENROLMENT ‘This is to certify that. Wesley Deleon with 5868321 lv enrolled in Bengxctecere” at Ray, Hayes and Martin Institute offical City Division, School Year 1975 1977 Misamis Onental ‘This certification is issued upon request purposely to avail the For student visa renewal purposes icsued on this 20 day ofeptenber4978 Brown Clark Institute Bulacan Philippines. Joshua Amold Registrar Noted by: Kimberlv Mcconnell"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "certenrollment",
        "ocr_text": "CERTIFICATE OF ENROLMENT trisercenityter Wesley Deleon wih 5888 aiticelly anewied in POMEL SNS dt Ray, Haves and Marth ips! Misamis Onenial porpostiy a s 4 upon renuest ga fancwal PUIPOSeS. ig estat For students iguied on tie 20 dey Butera revtad by Kirsberlv Mcconnell Brown Clark inst ue"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "certenrollment",
        "ocr_text": "wah 586 eergg7g at -Clark Institute sae nis Brown Clark institute Kisnberty Nv"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "certenrollment",
        "ocr_text": "Dopey ON wth -EBGRS2T Hayes anit Marin Instiive Kimberty Mecon"
    }
]