[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "certemployment",
        "ocr_text": "MurenyboroUNN fl Group Acad 9941, Box 4654_ APO A! aia @exernie con Human Been"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "certemployment",
        "ocr_text": "ic ofthe Philippines foviaee of Rona q _ ‘MunicipalityMurDnvDOrOuan @. 7 Williams Groud Academy use” 4654. APO ‘AE 02345 pS 9941. Box 4654. ‘abigails4 example com Republi Pr anagement Office nt Office __ CATE OF _MPLOYMENT CERTIF! “Fo whom it may Concer: employee of sym Cassandra Bolton, an Hodges Michael College Bolton ci Supply Ome Head v3 up waugust 07 2018 ection x being issued upon te request of BREE, for wheres leet ave his best This purpose it may se nenhig 7 do AUGUSQBENOPETS LLC Academy Paige Price Administrative Officer Tt ‘oftices in Charge, HRMO-"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "certemployment",
        "ocr_text": "Republic othe Pipes Prosine ol oho MunisipaliyMurphvborouah Williams Group Academy PSC 9941. Box 4654. APO AE 02345 abigail54 example com Human Resource Management Office CERTIFICATE OF EMPLOYMENT To wlhoun i may Concer: This isu cents that Cassandra Bolton is emploee 0 Hodges Michael College ssa Property and Suppls Office Head «ith the satus a mvergrareeroner [OH AUgUEI2S 1998 UP WAugust Q7 2018 avi Given his] 7 hs «AUgUS gggeHopkins LLC Academy Paige Price Adinistrative Oficer TT (VicersineC hargs, HIRMO"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "certemployment",
        "ocr_text": "Roveuree Mompyoment C4 ie CERYEPIOA TE OF EMPLOYMENT Cassandra Michael College |e) Bruparry Be sR Fernie ate FNM Age SHH ID Uiaagnt 62 2000 evel oy gp HOpKINS LEC Academy"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "certemployment",
        "ocr_text": "Stee” Williams Groun Academ, PSC 3941, Box 4654. APO AE 9 abigalinag: ample com Hamen Resource Mf, My and Sapipls Gitice Hort cs"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "certemployment",
        "ocr_text": "© Nelson Brown College 8.\" iinet Pou Sate 22 Lone i soecuevasghexamie cig Afsanaa Resource Moaazement Office CERTIFICATE OF EMPLOWMENT Pwo fark Mormow yao Grawt, Vnazqund ant Momotiey Cofimge ose Preports cad Supply Office Bead Ne alas 0 atereti gener atomw a8 duly 0) 1997 wave, evs SE reo cen QZ oo! Junepg pent iauver Lit Be aderny"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "certemployment",
        "ocr_text": "210 Watt Row Sue 225 joacucves example org Human Resource Management Office CERTIFICATE OF EMPLOYMENT Jack Morrow Cramemar Huampiey Coe a sears wt ply Offs end w Gisea QT do of Jungpaggetianyen Lid Oncor"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "certemployment",
        "ocr_text": "CER FIFICA TE OF EMPLOYMENT os Jack Morrow 7 oer Velazquez and Humobfey College as Proeets at Soppty fies Hes Noses ‘hogew OY 180) my"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "certemployment",
        "ocr_text": "Neison Brown Colleae {tee What: Row Site 225, Lasts (9 24292 mecusvas example. og Homa Resoares Management Office CERTIFICATE OF EMPLOYMENT Tes in oo Jack Morrow ss soe 4 phiey Collage os Property ani Supply Oc Head wath ia eaters angina otccmsei ah OY OF acasia pups may sere Pads"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "certemployment",
        "ocr_text": "Nelsor Brown Collece ie ABA Hyatt Row Sule 228, Liawoe, Daers Hen yoacuavas exa Human Resoue Management Officer OF EMPLOYMENT Jack Morrow we College ow Property aus Sepply GfRice Head with 2 op teby OF 1907 fag) trereyuens ns GABE fer whatever ed sien tiny oy 08 Junepgageh"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "certemployment",
        "ocr_text": "Rabi of the Pits Frvaxeel Woe Nawicinan; oan Searvetie 2, Sannan and Hawiites College 72988 Henary Vide, Lave Pes0n, UT 8176 acarwarsong exemple Com Human Remerce Janagement Office ee CERTIPICATE OF EMPLOYMENT To atens it ouy Concert Tes ww col tu Christopher JOHNSON ss exreree of Roberts- Powel dea Praperty sod Segghy (ce Had ew Rcberts Powet Urwersty quay N20 tinenitanawtiny nal qe creqecs UM, Go wanes ta ppene si my serez bn he vena 1 aD écembo 2g rn erent Michael edeenains toe Ofc 1 Oiicee io- Chaxge, HRMO"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "certemployment",
        "ocr_text": "fopher JORASOF 9 ertos= July 1207 Roberts Powel Gisoithie 4 Deeg gge 2 se seater casey"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "certemployment",
        "ocr_text": "Hunan Reweree Manazerseut Office PLOWAIENT Hatiies fons Sefrociter fi wielcver toesh a apt 8 Poneare aac ener,"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "certemployment",
        "ocr_text": "Reps tio Spence, Swansea ans 7288S bunny Vilage, Lee Susniveison example com Management Office Homan Resourss CEETIFICATE GF EMILY MENT ty Gtfiee Heat sith Johnson ss teeperis and Sv2p! 112044 a de led se"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "certemployment",
        "ocr_text": "pistiagive grange 4g Management OFFS CERTIFICATS. OF EMPLOW MESS ner JOHNSON a rages goly ET Christos vicnaet sonpe9 EMO"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "certemployment",
        "ocr_text": "CERTIFICATE OF EMPLOYMENT To whom it may Concern Honk oan, Russell Moreno MD i» empoyee oe te auf lunt Edwards Academy se LRAPrOPEHY and Supply Office Head wih J PeScaton heing inns apn the ruc KEY AEN fr whatever legal Purpone it may serve his hese Gone *aSeptom) g7 pKeller Rice University Set Op st"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "certemployment",
        "ocr_text": "Republic ofthe Phitppenes osaMannina a PLC Institute A Route, Watsonville, LA 25210 com Human Resource Management Office CERTIFICATE OF EMPLOYMENT. To whom st may Concern: lr ppeloe Russell Moreno MD is #* employee of Hunt Edwards Academy as a Property and Supply Office Head wich the ste efrgnes ene bo SRR up Womenew 28207 This certification is being issued upon the request of Kelly AEN for whatever legal urpone it may serve his best Givenihin 3 Septem) g 7g Keller Rice University Administrative Officer It Oftcer io Charge, HRMO"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "certemployment",
        "ocr_text": "pupae te aiy sees Sheath 3 SBepteny g 7orKeller ce: University"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "certemployment",
        "ocr_text": "Republic ofthe Philipines Province of Wear fi. Municipaliy of Devonbera Mannina PLC Instit ws: Ly 65820 Swanson Route, Watson te o5210 af Nlosdonald example com CERTIFICATE OF EMPLOYMENT. To whom it may Concern: Ho 2s Russell Moreno MD is employee or Hunt Edwards Academy 8s 8 Property and Supply Office Head with She MUL Erg electric me DORRP 26 ep uooeee a TESS Mietion sing sat upon te eqsotKElly AEN for water eg Purpose it may serve his bese Given is 3 “Septem g7giKeller Rice University Tina Stewart Administrative Officer I Officer in Charge, HRMO Nota wit Of eat"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "certemployment",
        "ocr_text": "Republic ot te Bi Weatecraith, UA25280 Fosdonaliighexample cor Haan Mesource Munsacment Office sore CERTIFICATE GF EMPL OVEN This 5 9 cet “Russell Morang AD) bo cnopie Hunt dwards Academy Prmpeets ana $3 eases mst Fone DOE on ecgecey,"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "certemployment",
        "ocr_text": "Human Re Ma mt wmaan Resource Management Office CERTIFICATE OF EMPLOY MENT ‘Towhom i euay Concer: The boos the Robert Sims =n employer o Grant LLG Set sa Property aad Sepply Office Head with a Tt eo Tee riding ring saved ue te meget ot BES, ty winaver feast Purine may seve i te, Goes td 7 Say ot Suly ay 9 gu lobresion tucas Cottege Aamensracive Oicer it Ofesicin Charge, HRM"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "certemployment",
        "ocr_text": "Republic othe Phin Prosineeol AlbaV _ Musial of Milena Aauilar and Sons School £0505 Coleen Cone At 708. Stone.) 60700, tinaarias example com Human Resource Management Office CERTIFICATE OF EMPLOYMENT To whom it may Concern Thivsweenity tha Robert Sims Sar smployee of Grant LLC Schoo! ea Property and Supply Office Head the satus of Toxicolog st Fit ansay of 099 up teMay O1 2015 This certification is being sued upon the request of MRS far whatever Tegal purpose st may serve is bes Giventhie] 7 ty of Julyogzqdonnston Lucas College Ryan Ramsey Administrative Officer It IRMO (otticersin Cha"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "certemployment",
        "ocr_text": "Republic ofthe Philippines Provinee of Albay Cy _ Masia of Millville i 1, Aauilar and Sons School eee £80505 Coleen Center At. 703, Stnefrt, NJ 80700 tinaarias example com Human Resource Management Office CERTIFICATE OF EMPLOYM! To whom it may Concern: This is wo centfy that Robert Sims _is an employee of Grant LLC School ‘sa Property and Supply Office Head with the satus of Toxicologist [om uanuay 0 2220 up toMay 01 2015 Given this] 7 day of July2q g ptJohnston Lucas College Ryan Ramsey Administrative Officer I Officer in Charge, IRMO"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "certemployment",
        "ocr_text": "ee Albay Murisinsiyv of sAiton ie Aguilar and Song Schoo! 28595 Cotsen Centr ser tnaaries exan Hunton Resusrce Meusgenent Office nennenneesonirnnenn an FEE ener sen ane CERTPICATE OF EMPLOYMENT To whows itaay Talc 10 Sims isc employee ot Grant LLC Schoo 2 AP pect sed Sopp Chee Had wit estes Tasseclegist Et ay 2 UP May Os 30: TNS cette Bois sved ap weet ae, Prime HEE tee Ghent 7 oF Jubyooy ag Johnston Luens Cot"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "certemployment",
        "ocr_text": "Anuar and S 8 270, Sane 1 TOR aKemiple Com Homan Resurce Management (fice OF EMPLOY Robert Sims 2 gupbayer Sha Pragnenty sad Seaayty OWlee Aeasl wit ee neragastod MSGR tex wheter lena!"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "certemployment",
        "ocr_text": "Republic ofthe Philippines Province Batangas Municipality of Lydiaville Marks, Strong and Baker College 0080 Nchotsan Estates, Sy 082, Honan LA gonzalezkevin example net Human Resource Management Office CERTIFICATE OF EMPLOYMENT To whom it may Concer: This iso cenity hat Jeffrey Williams iss» employee of Bell Ruiz College asaProperty and Supply Office Head with the status Of rmcecseryyeone from ORCA 18 Up cE ebeuary 182008 This certification is being ined upon the request o USHN DAViS for whatever legal ‘purpose it may serve his best Given this * day of Aprily gg! Pav. tread Retin Sent Ryan z Administrative Officer I Officer in Charge, HRMO Nat ie Oe sat"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "certemployment",
        "ocr_text": "162 titoness, La example net aonzabezkevinig an Resource Mtanavement Otfice omer CERTIFICATE OF Earp, OYMENY Jeffrey Wittamns Belt Ruiz College the sts of ply th Head with i bei ist up the sexes of 8 CAB Tgp pu Pre toners btn Sera"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "certemployment",
        "ocr_text": "Manic CERTIFICATE OF EMPLOYMENT eton Jeffrey Williama son empi Rell Ruiz College Da Peopeety nud Supply Qfice Head wi Patna 182208 os Oavis ses ser Tegal This werutication ib Given this Bes of Apriig gaye Paves tanzaey Rens Seto"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "certemployment",
        "ocr_text": "Republic he Philipines au Province oatanaas Soe’ Municipality of Lvdlavile 4 Marks, Strong and Baker College 0080 Nehoen Ease, fe 082 Herat cae gonzalezkevin example net Human Resource Management Office CERTIFICATE OF EMPLOYMENT. To whom it may Concern: This is to cenify that Jeffrey Williams is an employee of Bell Ruiz College 88 4 Property and Supply Office Head with the tus of sacreceor ream (TOR DRED up LoFebrary 162008 This certification is being issued upon the request o JUSHN DAVIS for whatever legal Purpose it may serve his best, Given this 5 day of April gg 7! P2 0*. Largan Retire Schect Ryan Vasquez Administrative Officer It Ofticer in Charge, HRMO Not a wh fii sea"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "certemployment",
        "ocr_text": "Reger of the Paap Promince oBMtANGRS Messina of Lugiavile Marks, Strong and Baker College E8 rachonar Gatetan Sue BBE Hatred LA gonzelozkevingexample. net Hann Resource Masagement Office CERTIFICATE OF EMPLOYMENT Yo whem it etay Concer: Tots wvcerity tee Jeffrey Williams se empiosee of Bett Ruiz College as 8 Property and Sapply '2fibee Head with be ete af secwreeseenen FO OAH 8 tata 1808 ‘This cattifeaiion being isswad pp the export A UEHN OWNS for ahutever Kegit jporpoce 4 eury serve hes best Given this hy of APTI gp Pre Uraene atten Ste (Oicerta Caarge, HRMO-"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "certemployment",
        "ocr_text": "Repudia of the Philips Jones, Shaw and Hunt Academy (05620 Lopez Plains, Richardshire, GA 84410 org Human Resource Management Office CERTIFICATE OF EMPLOYMENT To whom it may Concern: This ntweenify hat Dillon Finley —_ i+» enplonee of Reed, King and Becker University Property and Supply Ofice Head with the satus of cones ramanenene [0% jung 01 2006 P ADH 13 1996 Thin ceriication i being und upon the roqurst of Gackt for whatever legal Prepone may serve his het Gnesi comboog Sate9e Boene Cotege Brooke. Admamustrauive Office I Ofticer io Charge, HRMO-"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "certemployment",
        "ocr_text": "amps sabe! ew and Hunt Academy Plains, Rchandshire, GA 2401 dang exampie org Human Resouses Maaugement Ofce CERTIFICATE OF EMPLOYMENT Ti eioens me Dillon Finley King and Becker University a 2 Praprcs ‘Ser Hatt OF cen stratum 12 Saggy Office Head with es G5 20te UPMOAGTE 9 494 Taney This sued upon ite eaues ot BORE for wi porpone ii ay Give one Colage Brooke Jone: ROMO"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "certemployment",
        "ocr_text": "Republic ofthe Philippines Provinee ol Igabela Municipality of East Jones, Shaw and Hunt Academy \\) (05620 Lopez Plains, Richardshire, GA 84410 ar powelljordan example org Human Resource Management Office CERTIFICATE OF EMPLOYMENT To whom it may Concer: This isto ceity hat Dillon Finley is an employee of Reed, King and Becker University asa Property and Supply Office Head with the satus Of creenrematenema IFO0' une 94 2008 UP APTA 13 1996 This certification is being issued upon the request of Bacyey for whatever legal purpose it may serve his best. Given shi 346 combo og Galleges Boone College Brooke Jones Administrative Officer IT Officer in Charge, HRMO"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "certemployment",
        "ocr_text": "Repco he Piiopines tevin cl mata a, 05620 Lopez Plains, Richardshire, GA 84410 powelljordan example org Human Resource Management CERTIFICATE OF EMPLOYMENT ‘To whom it may Concern: This is to cenify that Dillon Finley —_is an employce of Reed, King and Becker University sa Property and Supply Office Head with the status Of coven rmmanenenan [0 jung 01 2006 “P “ADE 13 1996 This cenification is being sued upon the request of Berke far whatever legal Purpone may serve his best Given thi J 46 compo og: Galleges Boone Colege Brooke Admunustrative Offer Tl Ofticer in Charge, HRMO Nee et pet"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "certemployment",
        "ocr_text": "Republic of the Philippines ater in. Jones, Shaw and Hunt Academy —* zy, 05620 Lopez Plains, Rchardshire, GA 84410 “Mem powelljordan example org Human Resource Management Office CERTIFICATE OF EMPLOYMENT To whom it may Concern Tessioccnify that Dillon Finley is as euployee oi Reed, King and Becker University sa Property and Supply Office Head wih the satu of cane ramatorat yu 03 2904 HP WAIT 13 1996 is certification is heing ued upon the requestor BANS for whatever legal purpose it may acne hn fon Givenshit F does campo og Gallegos Boone Cotege Brooke Jones Administrative Officer Il Oicer in Charge, HRMO"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "certemployment",
        "ocr_text": "Republic ofthe Philippines Province Batangas Municipality ofEastangeimsut T Perkins Navis School ee PSC 7844. Box 6054. APO AE 73026 imurray example. com CERTIFICATE OF EMPLOYMEN To whom it may Concern: This is 10 certify that Aar Hess Group Institute OU Theat tional oer 27 ar ins ain being fd po the requ ae Keley rg whawver egal Purpose it may serve hie be Sara Peterson Administrative Officer I Officer in Charge, TRMO."
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "certemployment",
        "ocr_text": "Muniigaity of Eatargernen® P Perkins Navis School psc Toad, Box 6054. APO AE 7 ‘fmurray example com b- ‘csource Management Office Hama CERTIFICATE OF EMPLOYMENT To whem it may Concer cwty oe Aaron Flynn a an employee of TYTN ety and Supply cies Head Thi Hess Group Institute ue ans of rare. rare oom 227 to domany 132012 vp eeican nbn wns osc at LY aboever legal pup i ay serve his Best coven tig & 0 APHID eto and secon Umass ne ‘Sara Peterson Administrative OFticer ‘Ofticer in Charge, HRMO"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "certemployment",
        "ocr_text": "Province eBatangas *y Perkins Navis School Rud PSC 7844, Box 6054 APO AE 73026 fmurray example com ment Office Human Resource Mani CERTIFICATE OF EMPLOYMENT Too whom it may Comer fycnweeus ior Aaron Flynn svcnieess Hess Group Institute yriPaperty and Supply Office Head sith it may serve his bes cisco hi] B os of Apringot! purpose eto and lassen Unversity Sara Peterson Administrative Oe HE HRMO-"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "certemployment",
        "ocr_text": "etsege PDarkins Navis School PSC 7244, Sox 6054, APO AE 73026, finusay exatnple com Human Resource Management Office CERTIEICATE OF EMPLOYMENT Tim ivweesivoat Agron Flynn Supls ice Heo Hess Group Institute E Siew hiv F doy of Apribg gy pte HEMG"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "certemployment",
        "ocr_text": "Parkins Mavis Schon! 344, Box 6058, APO AE 13020 ‘urray anample corn Hunan Resource Masagement Office CERTIFICATE OF EMPLOYMEST Te wins it sey Concer ‘Mie Had tt This cenifica sud up crags ot HEE MORAY for whaarier lez ios of Aptiboo Sara Peterson ative OFF: HT seg, HRMO"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "certemployment",
        "ocr_text": "the Phaipiees oBenavet Mosicipalte dinthonvmouth Carita, Jones an YW Sorateste Sage Ap. 56, walkeraustin example Homan Resowee Mancgoment Office SRICATE OF EMPLOYMENT. To whose it ‘Tas is to certify hat is we ceplayes of ica iB sche vembgage Bom Ma mH wIEM Catherine Weeks Ackinisiraiy Cicos fh Om TEMG"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "certemployment",
        "ocr_text": "Republi of the Philippines Province oBenquet Mumowpality anthonvmout i Carrio, Jones and Frank. 1300 Chemtopner Square Apt 398, Sout Kim, NC walkeraustin example com Human Resource Management Office CERTIFICATE OF EMPLOYME! To whom it may Concer: This so cenify ht Renae Jones is an employce of _ Evans, Ells and Mason College \"s Freperty and ppt Of Hed wih sane of Theatre Brector jure 09 2018 “P Octsber 28 2003 Tis crcaion ng eps erepee AMOESES frwter tgd popes nay ere sa Given iQ NO vemboog! Mm acon Catherine Administrative Officer IH Officer in Charge, HRMO"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "certemployment",
        "ocr_text": "Repudiie of the Pathogens, si Frome oB ang yt 4 Meascipulty anthorwmoutn eee Cartiio, Jones ang Frank Academy 4 TeeoOvetope ReagyAe 398 Seven walkeraustin exampie com Suman Resource Management Office CERTIFICATE OF EMPLOYMENT To sous i mney Comer, ‘Toi siocetif hs ~— Renee Jones sn employee of Evans, Eflis and Mason Cotiage sr Property asd Supply «(Mller Mead sin ine was OFT ngnere Hector! am 05 Dove P Ozeber 8203 Tis coifcaonnbng hae gee te gue of AMMIE Ge wiser San popes teay ene haben iaQB Shs verno gg! ME HSM 8 Noreen pint"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "certemployment",
        "ocr_text": "Reps of tas Pa er RSH 30. Simi no hata Walkeraustn oxampie com Human Resource Managemen: Office CERTIFICATE OF EMPLOVME: NP To whom i ony Cancer This ss Seti thaw BO SONGS in cnpteyee oy Evans, s, Elis and Klason Sar College Ne $288 Taped threctoe her Peconic et ger fe winner opm my once Given “2B “bovempo gg: Hen. Nabe wanes compe tesa Adtonotsrative Offexe Olea hepe, RO)"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "certemployment",
        "ocr_text": "Human Reraurce Manaceiment Office —— Haman Nene CERTIFICATE OF To whem ay Concer 8828 HO veRiyo gg: Me Mme mame me Cathenne Adnan en Hoe Oficee neh ge, URMO"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "certemployment",
        "ocr_text": "Rranks Pi o institite: ses dck HYG, Fereta, HO 7212 ample org Humsn Kesonree Management Offi CERVIFICATE OF EMPLOYMENT Fo winaw may Co y 29 1808"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "certemployment",
        "ocr_text": "CERTIFICATE OF EMPLOYMENT To whom it may Concer: rom wweeenify ot Karen Gilmore i scnpionss of Hall Joyce Academy ina Property and Supply Oice Head wish he states of watane gelagat {or mnareven oP May 29 1998 “This certification is being issued upon the request of ASBs3, purpone it may serve his best coven hin 3* dy of Julyyg7 Rosario Miller Schoo! for whatever legal"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "certemployment",
        "ocr_text": "Provinee ol Samar Municipality of Justinoort Rrooks PI C Institute 701 Herander Cicies At 888. Tyerse, NO 72125 smatthews example org Human Resource Management Office CERTIFICATE OF EMPLOYMENT To whom it may Concern Tess tocesif st Karan Gilmore <9 <mployee of Hall Joyce Academy sProperty and Supply Office Head with the Matus of Wetsge geologat [0M er se im_up toMy 29 1998 This certification being nsued upon the eyuest ot HEME, for whatever legal Purpone it may serve his best. Given thi 3 da» of July4g7g Rosario Miller School Debbie Lynn Administrative Officer I Oicer in Charge. HRMO"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "certemployment",
        "ocr_text": "stenicipainy of Justinooet a Rroaks PIG institute eee Ter Hernan Coven At We, ipa, MO 7228 smatthews examply ory Human Resource Maoagement Office CERTIFICATE OF EMPLOYMENT To when it may Comer Te siocenis dst Karen Gilmore ie spiovee of HailJoyce Academy ‘eaPewperty and Sopply Odie Head i the siaows Of Wietete guctugiat TOO oemary 4 we uP Mealy 20 1998 seeneten ood Gren this 3 \"ay of July yg 7gRosario Miler Schout Oio 19 Cups, IRMO Mn ai sa Pht"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "certemployment",
        "ocr_text": "CERTIFICATE OF EMPLOY! TENT sutcen up Widay 29 1888 apse guevat HSENB, for deg sued op 2 feget"
    }
]