[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Pgiawan Rest Sule 605, West 1D Be265 Ag or THE PEGISTRAK OFFICE ae. ENROLLMENT CRETE nn B38BRO0 Semester nip Enteprene faylior Kenne"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Palawan Wright Hall University 28062 Bennett Rest Suite 605, West Raymond, ID 86865 OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT This isto certty that Edward Fowler with, «=—-:2383800 is a bonafide Grade student of this leamina institution of Chung, Skinner and Smith School He officially enrolled this Semester ‘SY 2008 1982 under to Bachelor of Science in Entrepreneurship Issued this certification upon the request for any legal purposes. Given thi di Conley Taylor lloilo wens 1 dy Augusio1§ Inst nie Certified by Kenneth M Martinez Registrar"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "certenrollment",
        "ocr_text": "Palawan 62 Bennett Rest Suite 605, West Raymong, 1D 86865 OFPICE OF THE REGISTRAR ROLLMENE vith 2383800 Chung ‘s ‘BY 2008 4 iesued this Given this [day ugusiosS at licilo"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "certenrollment",
        "ocr_text": "Palawan ___ Wright Hall University 28062 Bennett Rest Suite fe. West Raymond, ID 868 OFFICE OF THE REGISTRAR CERTIFICATION OF EN, ROLLMENT This isto sty 'S a bonafide Grade Chung, Skinne: SY 2008 1982 under Edward Fowler wth and Smith: School alled this Bachelor of Scrence in Entrepreneurs 2383800 Semester hip !ssued this certification upon the request for any legal purposes, G this 4 day at Conle -Taylor lloilo 1 #¥ Augusio13 institute Certified by Kenneth Martinez Registrar"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "certenrollment",
        "ocr_text": "Palawan Wright Hall University 28062 Bennett Rest Suite 605, West Raymond, ID Bose OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT This is to certify that Edward Fowler with 2383800 'saDonafide Grade student of th !eamina institution of Chung, Skinner and Smith School He officially enrolled this SY 2008 1982 under to Bachelor of Semester Science in Entrepreneurs! hip 'ssued this certification upon the request for any legal Purposes, Given this 4 ai tt Conley Taylor lloilo PCS Augusto13 Ins ius. Certified by. Kenneth Martinez Registrar"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Agusan del Sur H 1 Park Apt. 847, lehaven. 1 50940 OWWICE OF THE REGISTRAR CEIOUIEICSTION OF ENROLLEE NaH ENS 23 Poa g7s Riley Inc University Zambales Cenified by Jessica Youna Registrar"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Agusan del Sur 3765675 Semester Zambales Jessica Youna Registrar"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "certenrollment",
        "ocr_text": "Agusan del Sur d Harding School 765875 Semoster any legal civen this 23 4 BoamBg7H Riley ine University Zambales Cestified by ca YOund Registrar"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "certenrollment",
        "ocr_text": "Agusan del Sur Munoz, Nguyen and Harding School 680 Evan Park Apt. 847, Gabriellehaven, IL 50940 OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT This is to certify that Christina Potter with 3765675 is a bonafide Grade 49 student of this learning institution of Nguyen, Gallagher and Butler Institute He officially enrolled this Semester SY 2009 2006 under to Bachelor of Science in Tourism Management Issued this certification upon the request for any legal purposes. ven this 23 daNScembs97§ Riley Inc University Zambales Certified by Jessica Youna Registrar"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "certenrollment",
        "ocr_text": "Agusan dei Sur Munoz, Nguyen B7B5875 nis Semester nt lor of Science in Tourism “238 Hecemis975 ey Inc Unive Zambales Jdassica Your: 2"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "certenrollment",
        "ocr_text": "OFFICE OF THE REGIS HICATION OF ENEOLLMBN mester SY 1984 Niche:"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Cavite ways, Por Rebecca, 8S OFFICE OF THE REGIST RAR Univer fe Grade a Sudent p y Bachelor of Su any legal pups ef i night Roe emjavernboe8 aah mi upon the Oavae det Sur Certified by. Nicholas Andarsan Registrar"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "certenrollment",
        "ocr_text": "Cavite __ West: ‘Mann Academy _ 383 Kenneth Panaye, Port Rebecca, OFFICE OF THE REGISTRAR CERUEICATION OF ENROLEMENT This iste ceitty that Matthew White DVM, #1944 683 is atonafide Grade 2 student of this learning institution ot Jackson PLC University He officially enrolled this Semester SY 1994 1997 under to Bachelor of Science in Electrical Engineering cerbtication upan the request for any tegat purposes, Issued this Gen this 4 SRByemsgs6 Wright Redriguez Davao det Sur Academy Certified by Nicholas Anderson Registrar"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "certenrollment",
        "ocr_text": "Cavite _West Mann Academy 282 Kennet i Kays, Port Rebecca, AL 19783 OFFICE OF THE REGISTRAR SRRTIRICATION OF ENROLLMENT ‘This ist certify that Sa honatice Grade dackson PLC t SY 4988 4 te G41 883 gai purosee, Ceitihied oy Nicholas Andarson Regisirar"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "certenrollment",
        "ocr_text": "Cavite ONE Patt Rebes OFFICE OF Tig RE CERT TECATION of ROLLMENT 1941889 Sam estes Bavas det su) Nicholas Anderson Registrar"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Bohal Arellano Hanson College 8305 s ay ester vdsan egistrar"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Bohol ans Suita 636. West A 2S 183 OFFICE OF THE REGISTRAR ROLLMENT, CERTIFICATION vith 3948305 Semester n Technology Cettified by Carol Richardaan Registrar"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "certenrollment",
        "ocr_text": "Bonol Carter Mountains Suite 36, West Natasha, VA 26169 OFFICE OF THE REGISTRAR RSAB 305 Sen etter Guan ths 44 oBeiptembo7’ Logan inc Schoo! Cebu Carol Richardson Registrar"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "certenrollment",
        "ocr_text": "Bohol Arellano Hanson College 3721 Carter Mountains Suite 636, West Natasha, VA 26169 “s OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT This is to certity that Christina Turner with 3946305 ‘Pd bonafide Grade 7 student of this learning institution of Howell, Greene and Institute He officially enrolled this Semester SY 1979 1984 under to lor of Science in Information Technology Holloway h Bach Issued this certification upon the request for any legal purposes, Given this 44 *Sebtemhg76 2 Logan Inc Schoo! Cebu Certified by: Carol Richardson Registrar"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "certenrollment",
        "ocr_text": "Boho! e 636, West VA 2616! _Areliano Hanson College OPFICK OF THE REGISTRAR CERLIFICATION OF ENROLLMENT Semester information Technology er eo 4) Beptemka76 Logan irc Schoot } Richardson Registrar"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "certenrollment",
        "ocr_text": "licilo oa wall Fort, Easi Elizabeth, Hi 60527 with P3748 Semester Engineering igsued this yapon Sven he 1948 Jenuang7é Thomas and aquest for 888. Palawan"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "certenrollment",
        "ocr_text": "lloilo ___ Ramirez inc College 71868 4 Marshal hall Fo fast Elizabeth, OFFICE OF TRE REGISTRAR CERTIRICATION OF ENROLLMENT This is to certify that Diane Banks with 2373719 is a bonafide Grade a student of this ie2mning insttution of Gregory, Weber and Vargas University +) SY 2003 1977 under to Bachelor of Scienc y enrolled tis Semester Flactical Engineering issued this certification upon the request for any legat purposes. Gwen tis 19 Y Januahg7é mas and Palawan Sone 8508 Certiied by Kimberly Hoffman Registrar"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "certenrollment",
        "ocr_text": "lioilo 71868 Marshall Fort, East E HI 80527 OFFICE OF THE REGISTRAR wih 2373719 Semoster nginesna 1g Lhomas an: ons as and Kimberly Hoffman Registiar"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "certenrollment",
        "ocr_text": "lloilo Ramirez Inc College 71868 Marshall Fort, East Elizabeth, HI 60527 OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT This is to certify that Diane Banks with 2373719 is a bonafide Grade a student of this learnina institution of Gregory, Weber and Vargas University He officially enrolled this Semester SY 2009 1977 under to Bachelor of Science in Electrical Engineering Issued this certification upon the request for any legal purposes. Given this 49 day Januaftg76 homasand Palawan S5Rg Serio0 Certified by: Kimberly Hoffman Registrar"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "certenrollment",
        "ocr_text": "lloilo Ramirez Inc College 71868 Marshall Fort, East Elizabeth, HI 60527 OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT This is to certify that Diane Banks with 2373719 is a bonafide Grade o student of this learning institution of University He officially enrolled this Semester Gregory, Weber and Vargas SY 2009 1977 under to Bachelor of Science in Electrical Engineering .gal purposes. Given this 19 dav Januattg76 Thomas and Palawan issued this certification upon the request for any le Certified by: Kimberly Hoffman Registrar"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Cagayan emester"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Cagayan eh 1 Tort jtoad Tae GISTRAR OFFICE OF THE RE 7A40585 Parenter side ra Whita Camache If sete BY 4975 180 Some Tegcos oceans Navid Cabrera Registrar"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "certenrollment",
        "ocr_text": "Cagayan _Santiago PLC Academy 5031 Todd Trafficway Apt. 281, Hannahville, MP 11796 OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT. This is to certify that Mitchell Curry with 7110585 is a bonafide Grade 1n student of this learning institution of White Camacho Institute He officially enrolled this Semester SY 1975 1979 under to Bachelor of Science in Psychology Issued this certification upon the request for any legal purposes. Given this Q day of May2018 Jennings Ltd ros Academy Ne Occidental Certified by David Cahrera Registrar"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "certenrollment",
        "ocr_text": "Cagayan __ Santiago PLC Academy 5031 Todd Trafficway Apt. 281, Hannahville, MP 11796 OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT This isto certty that_ Mitchell Curry with, 7110585 fe Grade 4n student of this learning institution of White Camacho Institute Hi cially enrolled this Semester SY 1975 1979 under to Bachelor of Science in Psychology ssued this certification uf 1 any legal purposes. Given this Q day of Vlaypor3 2 Jennings Ltd Negros Academy Occidental Certified by David Cahrera Registrar"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "certenrollment",
        "ocr_text": "Cagayan _ Santiago PLC Academy 5031 Todd Trafficway Apt. 281, Hannahville, MP 11796 OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT. This is to certify that Mitchell Curry with 7110585 is a bonafide Grade 1n student of this leamina institution of White Camacho Institute He officially enrolled this Semester SY 1975 1979 under to Bachelor of Science in Psychology |ssued this certification upon the request for any legal purposes. Given thi day of i t Jennings Ltd Neato Wem mie) Q) vis May2013 _ Academy Occidental Certified by: David Cabrera Registrar"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Cebu g ‘d Meadows Suite 973. Hornandezbury, RI 32645 OFFICE OF THE RE: GISTRAR MUGS OF ENROLEMENT Price PLO College Ryle Ort Reg iz far"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Nguyen, Vieadows Sul ezbury, RY 3: OFFICE OF THE REGISTRAR SERTIRICATION OF p ENEOLLME Ny with 28R2660 Sora aszer 38 Adtiinistration Julytgga a Price PLO College -"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "certenrollment",
        "ocr_text": "Cebu Nguyen, Murray and Duarte University 679 Edward Meadows Suite 978, Hernandezbury, RI 32645 OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT. This isto certify that Michael Smith with 2852660 is a bonafide Grade 9 student of this learning institution of Payne, Jones and Armstrong Academy He officially enrolled this Semester SY 1980 2015 under to Rachelor of Science in Business Administration Issued this certification upon the request for any legal purposes. Given this 6 day of July 993 Price PLC College Bulacan Certified by. Kvle Ortiz Registrar"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "certenrollment",
        "ocr_text": "Cebu Nguyen, Murray and Duarte University 679 Edward Meadows Suite 978, Hernandezbury, RI 32645 OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT This is to certity that Michael Smith with 2852660 pA bonatide Grade a student of thi !earnina institution of Payne, Jones and Armstrong Academy He Officially enrolled this Semester SY 1980 2015 under to Rachelor of Science in Business Administration 'Ssued this certification upon the request for any legal Purposes, Given this 6 44 of Julyqggg at Bulacan Y Price PLC College Certified by. Kvle Ortiz Registrar"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "certenrollment",
        "ocr_text": "Cebu Suite 978, 22845 2852686 Semester issued the e oxen is day Julyygg§ Price PLC College Bulacan"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Oy OK 9452430 this Semester y Management Norte Matinaw Porter Regisirar"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Isabela ORFICE OF THE REGISTRAR CERTIED CATION OF ENROLLMENT win 9882120 tag cartificatior en this 22 doy fynavood Moss and locas Nore Certified by Matthew Partar Registrar"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "certenrollment",
        "ocr_text": "isabela is, Jonesville, OK OFFICE OF THE REGISTRAR CERTINICATIOS OF ENROLLMENT. wih 9452 ‘Semester issued thi Siven this 23 day of qa Richards, Moss Sven ts 22 49\" Junebood Rees Reo y floces Norte Matthew Parter Registrar"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "certenrollment",
        "ocr_text": "Isabela Saker, Edwards and Ortega Institute 196 L Lany ights, Jonesville, OK OFFICE OF THE REGISTRAR CERYIEICATION OF UNROULMENT 9452120 Semester Management £99 at Richa oss and 2298 June2004 Gonzsies Academy locos Norte Matinew Porter Registrar"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "certenrollment",
        "ocr_text": "isabela Jongaville, OK OF OFFICE OF THE REGISTRAR with 9489420 is 3 he fi Medon al Le Schoo! SY 2008 1984 Bach ise on the request far a ft this cachticati ve sot sang a Richards, Moss and Given 5 32 485 9! JuneBOOd Baris Neacien ny Hecos Norte Matihaw Porter Registrar"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Cagayan 9 Jones Divide apt 948, Gravestown, NE 71878 OFVICE OF THE REGISTRAR win 754835 Siven tis 4 ew CigtohBo1 Baker Group College Quezon fierek Ramirez Ragisirar"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Cagayan __ Sanchez PLC School __ 0609 Jones Divide Apt. 848, Gravestown, NE 71878 OFFICE OF THE REGISTRAR CERTIRICATION OF ENROLLMENT 5751835 S Semester request tor any legal py Derak Ramiraz Reoistrar"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "certenrollment",
        "ocr_text": "Cagayan _anchez PLC Se OFFICE OF TAR REGISTRAR CEBEICATION OF ENROLLMENT Semester ring ‘issue atien non the request for any Given this 46 437 GctnbRoi a Bake: Quezon"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "certenrollment",
        "ocr_text": "Cagayan Sanchez PLC Schoo} 0609 Jones Divide Apt 848, Gravestown, NE 1878 OFFICE OF THE REGISTRAR wath 5751835, Nerek Ramirez Registrar"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "certenrollment",
        "ocr_text": "OSES pt, BSS, chez PLC Schoo OFPICE OF THE REGISTRAR CRRUICATION OF ENROLLMENT. ny legal purposes. Greun Cellege Quezon Derek Ramire7 Registiar"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "certenrollment",
        "ocr_text": "Nueva Ecija Le and Sons School 68527 Vou Trace a 512, East Katherineport, GA 11004 OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT Erika Kennedy with 7527439 'S2 bonafide Grade +4 student of the learning institution of West Jones University He officially enrolled this SY 2015 1981 under to Bachelor of Semester Science in Civil Engineeri ing !ssued this certification upon the request for any legal Purposes, Given this 45 day of July4998 =~ Howell Inc Zambales Schoo? Certified by: Frica Mann Registrar"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "certenrollment",
        "ocr_text": "Nueva Ecija Le and Sons School 68527 Kelty Trace Apt. 512, East Katherineport, GA 11964 OFFICE OF THE REGISTRAR SEEIEICATION OF ENROLLMENT This 6 ta certily that Erika Kennedy vat #8 a Donalide Grede +5 student of this earmna insitudon of West Jones University He SY 2045 1961 under to 7527439 ‘aly enrolled hs Semester Bachelor of Science in Civil Engineering 'ssued this cerpfiration upon the request for any legsi purposes, Given ts 15 da of Julvgogg x i ine Zambaies \"Beh Certhed by Frica Mann Registrar"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "certenrollment",
        "ocr_text": "Nueva Ecija Le and Sons School 68527 Kelly Trace Apt. 512, East Katherineport, GA 11004 OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT This is to certify that Erika Kennedy with 7527439 is a bonafide Grade 14 student of this learnina institution of West Jones University He officially enrolled this Semester SY 2015 1981 under to Bachelor of Science in Civil Engineering Issued this certification upon the request for any legal purposes. Given this 15 day of July4gg8 t HQwell Inc Zambales Schoo! Certified by Frica Mann Registrar"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "certenrollment",
        "ocr_text": "Nueva Ecija Le and Sons School 68527 Trace ry 512, East ineport, 11004 OFFICE OF THE REGISTRAR CERTIFICATION OF ENROLLMENT This is to certify that Erika Kennedy with is a bonafide Grade 4+ student of this leamina of West Jones University He officially enrolled this Semester SY 2015 1981 under to Bachelor of Science in Civil Engineering 7527439 Issued this certification upon the request for any legal purposes. civen this 15 4av of July3998 wellinc =~ Zambales HQeFoo!| Certfed by Frica Mann Registrar"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "certenrollment",
        "ocr_text": "Nueva Ecila Le and Son y Katherineport, GA 17004 OFFICE OF THE REGISTRAR CEREIES. AVION OF ESROLLMENT ASS Semester Ing inc OH Zambales Erica Mann Registrar"
    }
]