[
    {
        "image": "certoftraining_synth_10_aug1.png",
        "label": "certoftraining",
        "ocr_text": "Jimenez Group University Main Camous Colleae of Enaineering Registrar s Office Certificate of Training Adam Weaver This certifies that Monica Cox has finished Hs Bata ‘Sfructures training, fas fins the standards set by the College of Arts and Letters and its academic board. Leah Stephens Jody Ramirez Course Instructor Dean"
    },
    {
        "image": "certoftraining_synth_10_aug2.png",
        "label": "certoftraining",
        "ocr_text": "Certificate of Craving __ Adam. Weaver This geriifige s that ivion x has 1s fnispe ata S fruclures ain Sneet ag ihe Aris and 5 set by the College of siandarc cadernis board. Letiers anc is 3 Jody Ramee Dean"
    },
    {
        "image": "certoftraining_synth_10_aug3.png",
        "label": "certoftraining",
        "ocr_text": "Ceriiiicate at Uraining Adam Weaver a This series that Monica Cox has finished the Data Structures training, meting the standards set by the C College of Arts and Leilers and its academic board. Leah Cour"
    },
    {
        "image": "certoftraining_synth_10_aug4.png",
        "label": "certoftraining",
        "ocr_text": "UA Colleae of Enaineering Registrar s Office Certificate of Training Adam Weaver This certifies that Monica Cox has finished the Bata Struc ures training, as int the standards set by the College of Arts and Letters and its academic board. Leah Stephens Jody Ramirez Course Instructor Dean"
    },
    {
        "image": "certoftraining_synth_10_aug5.png",
        "label": "certoftraining",
        "ocr_text": "Wertificate af Craining This certifies that Monica Cox has fini ‘the Data Structures train ng. siandards set Letiers an demic card."
    },
    {
        "image": "certoftraining_synth_11_aug1.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING vy tir Troy Martinez"
    },
    {
        "image": "certoftraining_synth_11_aug2.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING 4"
    },
    {
        "image": "certoftraining_synth_11_aug3.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING Troy Martine if] vical"
    },
    {
        "image": "certoftraining_synth_11_aug4.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING Q Martine. Troy"
    },
    {
        "image": "certoftraining_synth_11_aug5.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING this Certificate Is Awarded To Troy Martinez defense of the ‘Awarded upon successful eesicapstone, evidencing Laboratory Techniques th tory gh analysis and academic rigor Michael Orozco Signature Date"
    },
    {
        "image": "certoftraining_synth_12_aug1.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING This Certificate Is Awarded To Christopher Fog dedication and excellence inthe Data structures practicum, demonstrating readiness for professional practice ssenoe ot 2008 Monica Green Date Signature"
    },
    {
        "image": "certoftraining_synth_12_aug2.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING é Saas ity"
    },
    {
        "image": "certoftraining_synth_12_aug3.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING Th Christopher Fou, dedication and. Excellence in the Data Teaetues Practicum, demorst sing readiness for professional praciee Monica Green Monica Green Signature"
    },
    {
        "image": "certoftraining_synth_12_aug4.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF rine!"
    },
    {
        "image": "certoftraining_synth_12_aug5.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING This Certificate Is Awarded To Christopher Fogdedication and excelnce the Data {factures practicum, demonstrating readiness for professional practice. once 01 208 Monica Green Date Signature —"
    },
    {
        "image": "certoftraining_synth_13_aug1.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING"
    },
    {
        "image": "certoftraining_synth_13_aug2.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING"
    },
    {
        "image": "certoftraining_synth_13_aug3.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING"
    },
    {
        "image": "certoftraining_synth_13_aug4.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING 5 James Hen"
    },
    {
        "image": "certoftraining_synth_13_aug5.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING this Certificate Is Awarded To James Henry For exemplary performance in the Educational Psychology module, including outstanding lab wor ye consistent achievement on ‘assessments Theresa Taylor March 18, 2016 Signature Date"
    },
    {
        "image": "certoftraining_synth_14_aug1.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING i This Certificate Is Awarded To Raniel This award acknowledges distinguished contribution to the Data Structures research project, showing rigorous methodology and clear results. None 7 2007 ‘Adrienne Smith Date Signature _ e"
    },
    {
        "image": "certoftraining_synth_14_aug2.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINS"
    },
    {
        "image": "certoftraining_synth_14_aug3.png",
        "label": "certoftraining",
        "ocr_text": "CERT! FICATE OF TRAINING Pee"
    },
    {
        "image": "certoftraining_synth_14_aug4.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING 4 pad Moore a"
    },
    {
        "image": "certoftraining_synth_14_aug5.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING pe ni Or"
    },
    {
        "image": "certoftraining_synth_15_aug1.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING d EET SESE"
    },
    {
        "image": "certoftraining_synth_15_aug2.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING Joel Cooper"
    },
    {
        "image": "certoftraining_synth_15_aug3.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING"
    },
    {
        "image": "certoftraining_synth_15_aug4.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING"
    },
    {
        "image": "certoftraining_synth_15_aug5.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING"
    },
    {
        "image": "certoftraining_synth_16_aug1.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING ins Yara Higg"
    },
    {
        "image": "certoftraining_synth_16_aug2.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING 2"
    },
    {
        "image": "certoftraining_synth_16_aug3.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING"
    },
    {
        "image": "certoftraining_synth_16_aug4.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING i Tara Higgins"
    },
    {
        "image": "certoftraining_synth_16_aug5.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING wr"
    },
    {
        "image": "certoftraining_synth_17_aug1.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING Holly Lowery John Hayes Signature"
    },
    {
        "image": "certoftraining_synth_17_aug2.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING"
    },
    {
        "image": "certoftraining_synth_17_aug3.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING This Certificate Is Awarded To Holly Lowery Granted for completion of the Data Structures Seminar with active participation and insightful Contributions to discussions and presentations. dune 01, 1991 John Hayes Date Signature"
    },
    {
        "image": "certoftraining_synth_17_aug4.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING i Holly Lowery Granted for completion of the Data Structures seminar with active participation and insightful contributions to discussions and presentations. June 01, 1991 John Hayes Date Signature"
    },
    {
        "image": "certoftraining_synth_17_aug5.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING"
    },
    {
        "image": "certoftraining_synth_18_aug1.png",
        "label": "certoftraining",
        "ocr_text": "Ce ERTIFICATE OF TRAINING"
    },
    {
        "image": "certoftraining_synth_18_aug2.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING 3 s Amarcted To v ial PRIOR Hangiton"
    },
    {
        "image": "certoftraining_synth_18_aug3.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING 4 Ric} _Hami in"
    },
    {
        "image": "certoftraining_synth_18_aug4.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING :"
    },
    {
        "image": "certoftraining_synth_18_aug5.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICAT OF TRAINING _Ha"
    },
    {
        "image": "certoftraining_synth_19_aug1.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING"
    },
    {
        "image": "certoftraining_synth_19_aug2.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING olanda Ce"
    },
    {
        "image": "certoftraining_synth_19_aug3.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICAg TE OF TRAINING Yolanda —Gerdon"
    },
    {
        "image": "certoftraining_synth_19_aug4.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING Yolanda sarden."
    },
    {
        "image": "certoftraining_synth_19_aug5.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING i Yolanda For dedication and excellence in the Engineering Design practicum, demonstrating readiness for professional practice. Hate: Signature"
    },
    {
        "image": "certoftraining_synth_1_aug1.png",
        "label": "certoftraining",
        "ocr_text": "uA Ges Ns Certificate af Ceaining oe Mark, Hicks. Awarded to Kel lsey Harnilton for fulfil! Hing the requirements of the Data Structures, shov wing consistent academic performance and participation."
    },
    {
        "image": "certoftraining_synth_1_aug2.png",
        "label": "certoftraining",
        "ocr_text": "Ali and Sens University Seuth Camous D537 Met Fate, West Una Colleae of Aris and Letters Office of Practicum Gives ths Certificate of Craining Mark Hicks Awarded to Keisey Hamilton for fulfilling the requirements of the Data Structures, showing consistent academic performance and participation. Debbie Jackson Robert Bailey Field Supervisor College Dean"
    },
    {
        "image": "certoftraining_synth_1_aug3.png",
        "label": "certoftraining",
        "ocr_text": "ters this Certificate of raining Awarded to Kelsey Hamilton for fulfilling the requirements of the Data Structures, showing consistent academic pertormance and parlicipation."
    },
    {
        "image": "certoftraining_synth_1_aug4.png",
        "label": "certoftraining",
        "ocr_text": "Calieae of Aris tars of Prai Certificate of Ceaining Awarded to Kelsey Hamilton for fulfilling the requirements of the Data Structures, showing consistent acadernic performance and participation."
    },
    {
        "image": "certoftraining_synth_1_aug5.png",
        "label": "certoftraining",
        "ocr_text": "Office of Practicum Gives th Ak and Sons University UA Certificate of Training Collage of Arts and Letters Awarded to Kelsey Hamilton for fulfilling the requirements of the Data Structures, showing consistent academic performance and participation. Debbie Jackson Robert Bailey Field Supervisor College Dean"
    },
    {
        "image": "certoftraining_synth_20_aug1.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING This Certificate Is Awarded To Tammy For dedication and excellence in the Organic Chemistry practicum, demonstrating readiness for professional practice. Jessica Taylor Signature"
    },
    {
        "image": "certoftraining_synth_20_aug2.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING g pysarded Tammy Escobar."
    },
    {
        "image": "certoftraining_synth_20_aug3.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING"
    },
    {
        "image": "certoftraining_synth_20_aug4.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING 3"
    },
    {
        "image": "certoftraining_synth_20_aug5.png",
        "label": "certoftraining",
        "ocr_text": "CERTIFICATE OF TRAINING d Tammy"
    },
    {
        "image": "certoftraining_synth_2_aug1.png",
        "label": "certoftraining",
        "ocr_text": "Hannon LLC University North Camous ar Gentes Cee BEARS aera Colleae of Science Office of Student Affairs Gives ths Certificate of Training Tiffany Mitchell participated in the Capstone Project module and compieted all coursework and practical assignments under the supervision of the Practicum Office. Lee Jones Emily Becher Field Supervisor Dean"
    },
    {
        "image": "certoftraining_synth_2_aug2.png",
        "label": "certoftraining",
        "ocr_text": "us Colieae of Science Office of Student Afar Certificate af Craining Monique Jones Tiffany Mitchel! Participated in the Capstone roiect module and completed aij coursework and practical assignments under the Supervision of the Practicum Office, Lee Jones Emity Becker Fieid Supervisor Dean"
    },
    {
        "image": "certoftraining_synth_2_aug3.png",
        "label": "certoftraining",
        "ocr_text": "Harmon LLC University North Camous set Gonzalez Lodge SEG Eadewtaven Colleae of Science Office of Student Affairs Gives this Certificate of Training Monique Jones Tiffany Mitchell participated in the Capstone Project module and completed all coursework and practical assignments under the supervision of the Practicum Office. Emily Becker Lee Jones Field Supervisor Dean"
    },
    {
        "image": "certoftraining_synth_2_aug4.png",
        "label": "certoftraining",
        "ocr_text": "Cevtiticate of Craining _ _Monique Jones Titany Mitchell participated in the Capstone Project module and cornpleted all coursework and practical assignmertts under the supervision of the Practicum Office."
    },
    {
        "image": "certoftraining_synth_2_aug5.png",
        "label": "certoftraining",
        "ocr_text": "Heae of Si ance Ws Gives Certificate of Craining Tiffany Mitchell participated in the Capstone Project module and competed all coursework ang practical assignmer under the supervision of the Practicum Office."
    },
    {
        "image": "certoftraining_synth_3_aug1.png",
        "label": "certoftraining",
        "ocr_text": "Flynn LLC University SON SN eager bey Colleae of Arts and Letters Office of Practicum Gives this Certificate of Training ____ Jessica Baker ____— Mark Graham completed the Teaching Practicum practicum with satisfactory performance and demonstrated competence in required skills and assessments. Karen Stephenson Kimberly Ruiz Training Supervisor Dean of the College"
    },
    {
        "image": "certoftraining_synth_3_aug2.png",
        "label": "certoftraining",
        "ocr_text": "Flynn LLC University North Camous {S700 Stephane ees Noa Pageven Colleae of Arts and Letters Office of Practicum Gives this Certificate of Training ___ Jessica Baker ___ Mark Graham completed the Teaching Practicum practicum with satisfactory performance and demonstrated competence in required skills and assessments. Karen Stephenson Kimberly Ruiz Training Supervisor Dean of the College"
    },
    {
        "image": "certoftraining_synth_3_aug3.png",
        "label": "certoftraining",
        "ocr_text": "Flynn LLC University North US poly eo oot aares Colleae of Arts and Letters Office of Practicum Gives the Certificate of Training ___ Jessica Baker ___ Mark Graham completed the Teaching Practicum practicum with satisfactory mance and demonstrated competence in perfor 4 required skills and assessments. Karen Stephenson Kimberly Ruiz Dean of the College Training Supervisor"
    },
    {
        "image": "certoftraining_synth_3_aug4.png",
        "label": "certoftraining",
        "ocr_text": "g Arts and Letiers CUCU Certificate of Training uw WeSsics Baker Mark Graham compieted the Teaching Practicum practicum with satistactory performance and demonstrated competence in required skills and assessmenis."
    },
    {
        "image": "certoftraining_synth_3_aug5.png",
        "label": "certoftraining",
        "ocr_text": "Flynn LLC University College of Arts and Letters Office of Practicum Gives this Certificate of Training Mark Graham completed the Teaching racticum Practicum with Satisfacto Performance and 4 MOnstrated Competence jn required skills and assessments. Karen Stephenson Kimberly Ruiz Training Supervisor Dean of the College"
    },
    {
        "image": "certoftraining_synth_4_aug1.png",
        "label": "certoftraining",
        "ocr_text": "£28 Certificate of Training Shane Webb Michael Soton completed the Capstone Project F surn with satistactory performance and demonstrated compeien required skills anc ssessments. in"
    },
    {
        "image": "certoftraining_synth_4_aug2.png",
        "label": "certoftraining",
        "ocr_text": "Sr Bryant Orazco University Colleae of Education Registrar s Office Gives this Certificate of Training Michael Solomon completed the Capstone Project Practicum with Satisfacto; Performance and demonstrated competence in required skills and assessments. Dr. Sarah Cordova Daniel Nelson Practicum Supervisor College Dean"
    },
    {
        "image": "certoftraining_synth_4_aug3.png",
        "label": "certoftraining",
        "ocr_text": "Bryant Orozco University South Campus 23131 Annette Lane, Port Hector Shoot, Colleae of Education Registrar s Office Gives this Certificate of Training Ss ane Webb Michael Solomon completed the Capstone Project practicum with satisfactory performance and demonstrated competence in required skills and assessments. Or. Sarah Cordova Daniel Nelson Practicum Supervisor College Dean"
    },
    {
        "image": "certoftraining_synth_4_aug4.png",
        "label": "certoftraining",
        "ocr_text": "Bryant Orozco University South Campus 23131 Annette Lane Port Hector Colleae of Education Registrar s Office Gives this Certificate of Training —___Shane Webb Michael Solomon completed the Capstone Project practicum with satisfactory performance and demonstrated competence in required skills and assessments. Dr. Sarah Cordova Daniel Nelson Practicum Supervisor College Dean"
    },
    {
        "image": "certoftraining_synth_4_aug5.png",
        "label": "certoftraining",
        "ocr_text": "Bryant Orozco University South Campus 23131 Annette Lane, Port Hector Colleae of Education Registrar s Office Gives this Certificate of Training Shane Webb Michael Solomon completed the Capstone Project practicum with satisfactory performance and demonstrated competence in required skills and assessments. Dr. Sarah Cordova Daniel Nelson Practicum Supervisor College Dean"
    },
    {
        "image": "certoftraining_synth_5_aug1.png",
        "label": "certoftraining",
        "ocr_text": "Charles Inc University Downtown Campus Trace, Jahon Colleae of Enaineering Registrar s Office Gives this Certificate of Training James Murray Heidi Phillips participated in the Capstone Project module and completed all coursework and practical assignments under the supervision of the Practicum Office. Jamie Davenport Kaitlin Morales Training Supervisor Dean"
    },
    {
        "image": "certoftraining_synth_5_aug2.png",
        "label": "certoftraining",
        "ocr_text": "Certificate of Wraintag Heidi Philfing Participated in the Capstone Project modijle and completed ail coursework and practical assignments under the SUPErVision of the Practicum Office,"
    },
    {
        "image": "certoftraining_synth_5_aug3.png",
        "label": "certoftraining",
        "ocr_text": "Colieae of Engine i Gives this Certiiieste of Training Heidi Phillips participated in the Capstone Project module and completed ail coursework and practical assignments under the supervision of the Practicum Office."
    },
    {
        "image": "certoftraining_synth_5_aug4.png",
        "label": "certoftraining",
        "ocr_text": "Charles Inc University Downtown Camous gee tacthiaven Colleae of Enaineering Registrar s Office Gives this Certificate of Training James Murray Heidi Phillips participated in the Capstone Project module and completed all coursework and practical assignments under the supervision of the Practicum Office. Jamie Davenport Kaitlin Morales Training Supervisor Dean"
    },
    {
        "image": "certoftraining_synth_5_aug5.png",
        "label": "certoftraining",
        "ocr_text": "Certificate of Traiwing _Jemes Murray hilips participated in the Capstone ie and completed ali coursework ical assignments under ine ion of the Practicum Office. Heidi! Project modu and pra supervis"
    },
    {
        "image": "certoftraining_synth_6_aug1.png",
        "label": "certoftraining",
        "ocr_text": "Michael Deleon completed the Research Methods practicum with satisfactory nerformance and demonstrated competence in required skills and assessments. Cai"
    },
    {
        "image": "certoftraining_synth_6_aug2.png",
        "label": "certoftraining",
        "ocr_text": "‘Saunders LLC University Main Campus 452 Cruz Mills, Jimenezhaven\\ Colleae of Arts and Letters Registrar s Office Gives this Certificate of Training Richard Henry Michael Deleon completed the Research Methods practicum with satisfactory performance and demonstrated competence in required skills and assessments. Ariana Cannon Tara Jones Practicum Supervisor College Dean"
    },
    {
        "image": "certoftraining_synth_6_aug3.png",
        "label": "certoftraining",
        "ocr_text": "ue ai Letters Certificate of Training Michael Deleon completed the Research Methods practicum with satisfactory performance and demonstrated competence in required sxills arc assessments."
    },
    {
        "image": "certoftraining_synth_6_aug4.png",
        "label": "certoftraining",
        "ocr_text": "Saunders LLC University Main Camous ‘452 Cruz Mills, dimenezhavert Colleae of Arts and Letters Registrar s Office Gives this Certificate of Training Richard Henry Michael Deleon completed the Research Methods practicum with satisfactory performance and demonstrated competence In required skills and assessments. Tara Jones Ariana Cannon Practicum Supervisor College Dean"
    },
    {
        "image": "certoftraining_synth_6_aug5.png",
        "label": "certoftraining",
        "ocr_text": "Saunders LLC University Main Campus 452 Cruz Mil, Jimenezhaver! Colleae of Arts and Letters Registrar s Office Gives this Certificate of Training Richard Henry Michael Deleon completed the Research Methods practicum with satisfactory performance and demonstrated competence in required skills and assessments. Ariana Cannon Tara Jones Practicum Supervisor College Dean"
    },
    {
        "image": "certoftraining_synth_7_aug1.png",
        "label": "certoftraining",
        "ocr_text": "Neves Rargues wr Rarcok Main Camous Colieae of Education Office of the Dean Gives ths Certificate of Training —dulie Miranda Awarded to Jared Mann for fulfilling the requirements of the Laboratory Techniques, showing consistent academic performance and participation. Richard tngram Ange! Combs Fieid Supervisor Desn of the College"
    },
    {
        "image": "certoftraining_synth_7_aug2.png",
        "label": "certoftraining",
        "ocr_text": "Colleae oO Sivas this Cortifiente of Craining julie Miranda Awarded to Jared Mann for fulfilling ihe requirements of the Laboratory Techniques, showing consistent academic performance and participation. Angel Con Dean of the"
    },
    {
        "image": "certoftraining_synth_7_aug3.png",
        "label": "certoftraining",
        "ocr_text": "Hayes Rodriguez and Randal ‘unwversi Main Camous ‘2528 Mayer Express ‘Saelasiad Colleae of Education Office of the Dean Gives this Certificate of Training to Jared Mann for fulfilling the requirements of the Laboratory Techniques, showing consistent academic performance and participation. Awarded Richard Ingram Angel Combs Field Supervisor Dean of the College"
    },
    {
        "image": "certoftraining_synth_7_aug4.png",
        "label": "certoftraining",
        "ocr_text": "Call ucation ae Gives this Certificate of Craining Jule Miranda Awarded to Jared Mann for fulfilling the requirements of the Laboratory Techniques, showing consistent academic performance and participation."
    },
    {
        "image": "certoftraining_synth_7_aug5.png",
        "label": "certoftraining",
        "ocr_text": "Certificate af Graining Julie Miranda Awarded to Jared Mann for fulfilling the requirements of the Laboratory Techniques. showing consistent academic performance and participation."
    },
    {
        "image": "certoftraining_synth_8_aug1.png",
        "label": "certoftraining",
        "ocr_text": "Lewis Garrett and Wood Cniversity South Camous 533 Morr Crees, Fernandezberg College of Computer Studies Office of Practicum Gives this Certificate of Training iah Marti Max Rivers eee in the Teaching Practicum module and completed all coursework and practical assignments under the supervision of the Office of Student Affairs. David Oneal John Moses Course Instructor Dean of the College"
    },
    {
        "image": "certoftraining_synth_8_aug2.png",
        "label": "certoftraining",
        "ocr_text": "Certificate al Sraining Jeremiah Martin Max Rivers participated in the Teaching Practicum module and completed all coursework and practical assignments under the supervision of the Office of Student Affairs."
    },
    {
        "image": "certoftraining_synth_8_aug3.png",
        "label": "certoftraining",
        "ocr_text": "College of Computer Studies Office af Practicum Certificate of Dealing __Jeremiah Martin Max Rivers participated in the Teaching Practicum module and completed all coursework and practical assignments under the supervision of the Office of Student Affairs."
    },
    {
        "image": "certoftraining_synth_8_aug4.png",
        "label": "certoftraining",
        "ocr_text": "Lewis Garrett and Wood Gniversity South Camous 333 Moms Crees, Femandezbers College of Computer Studies Office of Practicum Gives this Certificate of Training Jeremiah Martin Max Rivers participated in the Teaching Practicum module and completed all coursework and practical assignments under the supervision of the Office of Student Affairs. David Oneal John Moses Course Instructor Dean of the College"
    },
    {
        "image": "certoftraining_synth_8_aug5.png",
        "label": "certoftraining",
        "ocr_text": "Lewis Garrett and Wood Tniversity South Campus Femandezberg ScHooL College of Computer Studies Office of Practicum Gives this Certificate of Training Jeremiah Martin Max Rivers participated in the Teaching Practicum module and completed all coursework and practical assignments under the supervision of the Office of Student Affairs. David Oneal John Moses Course Instructor Dean of the College"
    },
    {
        "image": "certoftraining_synth_9_aug1.png",
        "label": "certoftraining",
        "ocr_text": "Jeremy Jonnson Megan Miller completed the Gapstone Project practicum with satisfactory performance and demonstrated competence in required skills and assessmenis."
    },
    {
        "image": "certoftraining_synth_9_aug2.png",
        "label": "certoftraining",
        "ocr_text": "Rovers Munoz ang Sateen vei South Camous 155 Aen Stag, Hewes Vevenaay Colieae of Education Registrar s Office Gives this Certificate of Training ___Jeremy Johnson Megan Miller completed the Capstone Project practicum with satisfactory performance and demonstrated competence in required skills and assessments. Darren Graves Gabriel Beker Prachcum Supervisor Dean"
    },
    {
        "image": "certoftraining_synth_9_aug3.png",
        "label": "certoftraining",
        "ocr_text": "Roverts Mynaz acd ‘Gooawin Uneveraity auth Carr th Coliese of Education Registrar s Of Gives this Certificate of Training ___ Jeremy Johnson____ Megan Miller completed the Capstone Project practicum with satisfactory performance an ‘demonstrated competence in required skills and assessments. Darren Graves Gabriel Baker Practicum Supervisor Dean"
    },
    {
        "image": "certoftraining_synth_9_aug4.png",
        "label": "certoftraining",
        "ocr_text": "Roberts Mc eosin INCE a South Camous ise Ser heh Seog Colleae of Education Registrar s Office Gives this Certificate of Training Jeremy Johnson Megan Miller Completed the Capstone Project Practicum with Satisfactory performance and demonstrated competence i Darren Graves Gabriel Baker Practicum Supervisor Dean"
    },
    {
        "image": "certoftraining_synth_9_aug5.png",
        "label": "certoftraining",
        "ocr_text": "Certificate of Srgiwing deremy Jon Meget Miller co ompleted the Capstone Project ‘cum with Set “igfactory perform noe and mpetence in required skills d assess gments."
    }
]