[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Phili Commission on Higher Region 4 DAVISON Education Zamboanga del Sur award Certificate of Acce plance &ssica Powel} ‘Mor fon PLC Academy nmendations academic Carol Wridnt Porsonel assistant"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "certacceptance",
        "ocr_text": "Certificate of Accepiance Jessica Powell Horton PLC Academy"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "certacceptance",
        "ocr_text": "aware’ th Certificate Jessica Powell Horion PLC Acad"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 4 DIVISION OF Zamboanga del Sur awards this Certificate of Acceptance to Jessica Powell Horton PLC Academy This certifies that the College of Arts and Sciences has accepted the accreditation recommendations of the Commission on Higher Eduenton {CHED). The institution commits to implementing the Suggested improvements. This acknowl ledgment signifies our dedication to upholding high sea jemic standards Given on they7* day of February2009 Carol Wright Personal assistant"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 4 DIVISION OF Zamboanga del Sur awards this Certificate of Acceptance Jessica Powell Horton PLC Academy This certifies that the Colle: of the Commission on Higher Ea Suggested improvements. This ack Carol Wright Personal assistant"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "certacceptance",
        "ocr_text": "——~_ the Philippines Republic of her Education Commission on Hi Region pvsionof Cavite awards this Certificate of Acceptance w Melissa Lowery Jenkins School __ Baker~ Ths Cenificate, of bran teed is hereby, rssved to acknowedge fhe rect tof 20 computer units: ‘ABC Tech Sol ons to He College ct Information ‘Techn the units were inspected MeO he msttutian exxesses grattude for the support int donated Dy ASS: fech S and tour! 'e be tn excelent working comet eanancang celal earning Given on they 7* day eGepternde20t 9 Ajexis Lovez Camera operator"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region DIVISIONCF —- Cavite awords this ___ Certificate of Acceptance to Melissa Lowery a Baker Jenkins School This Certificate of Acceptance is hereby issued to acknowlexige the receipt of 20 computer units donated by ABC Tech Solumons to the Cofege of Information technology The unks were mepecied and found 19 be in excelent working condition. The instlution expresses ts gralitude for the support in enhancing digital learning. Given on they 7\" day oSeptembe2010 Alexis Lopez Camera operator"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "certacceptance",
        "ocr_text": "Republ Ceornmission on Higher Education cof the Philippi DIMSIONCF Cavite Meliss Lopez eralor"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 5 DIVISONOF Cavite awards this Certificate of Acceptance to Melissa Lowery Baker Jenkins School This Certificate of Acceptance is hereby issued to acknowledge the receipt of 20 computer units donated by ABC Tech Solutions to the College of Information Technology. the units were inspected and found to be in excellent working condition. The institution expresses its gratitude for the support in enhancing digital learning Given on they 7“ day oSeptembe2010 Alexis Lopez Camera operator"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Philippines Rep i Commission on i Higt her Education DIVISION OF Cavite awards this cate of Acceptance Melissa Lowery denkins Saksel 3 the ng consiiticn. The enhancing aiital eae son they 7* day oSeptemberGi0 Alexis Lopez c ara operator"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "certacceptance",
        "ocr_text": "Commission on Hi fi oe Erin Romero Aivarez Bamett insthute Joseoh Daniels potogist, ona"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "certacceptance",
        "ocr_text": "xe, Republic of the Philippines ie am Commission on Higher Education —_ Region 8 DIVISION OF Misamis Oriental awards this Certificate of Acceptance to Erin Romero Alvarez Barnett Institute This certifies that the College of Education formally acce} the newly renovated classrooms under the Infrastructure improvement project funded by the Department of Education. All works were completed according to specifications and safety standards. The facilities will be used starting this academic year. Given on thegg* dayof July 2004 Joseph Daniels Psychologist, occupational"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "certacceptance",
        "ocr_text": "f “, Republic of the Philippines =~ Commission on Higher Education Region 8 DIVISION OF Misamis Oriental ‘awards this Certificate of Acceptance Erin Romero Alvarez Barnett Institute Triocructare mance no eaucaton formal accepts the renovated classrooms under the frastructure improv project funded Bepartment of Education all wonns were completed according to spectications and safety standerae The facilities will be used starting thi: iS academic year. Given on theg9* dayof July 2004 Joseph Daniels \\~d Psychologist, occupational"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region g DIVISION OF Misamis Oriental awards this Certificate of Acceptance to Erin Romero Alvarez Barnett Institute This certifies thatthe College of Education formally accepts the newly renovated ciassrooms under the infrastructure improvement project funded by the Department of Education. All works were completed according to specifications and safety standards. The facilities will be used starting this academic year. Given on they“ dayof July 2004 Joseph Daniels Psychologist, occupational"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines we: Commission on Higher Education Be Region - DIVISION OF Misamis Oriental awands this Certificate of Acceptance Erin Romero Alvarez Barnett institute classrooms under the i “this certifies that the College of Educaton forms accepts he nenty renovaled Mrectuctre enprovennet BeOS y the Y orcrrimera of Educator. All ¢ors ‘vere comprered Fee and safety standaras. 1 dries wal be used sarang acadann. you according 10 spec Given on thegg* dayot July 2004 Josevh Daniels Psychotogist cecupabonal"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines ft Bw Commission on Higher Education BO Region 8 DIVISION OF Agusan del Sur Certificate of Acceptance Stephanie Walters Strickland PLC Institute The University of San Rafael accepts the financial grant training and student innovation gras tes coin hon is greatly Given on thes dayof June 1986 Anthony Doualas A Ca ——— Association to the Alumni encanta appreciated for advancing ="
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "certacceptance",
        "ocr_text": "Republic Fhe Philippines ved, . i a Commission on Higher Education Region 8 DIVISION OF Agusan dal Sur awards this __ Certificate of Acceptance to Stephanie Walters SC sSStrickland PLC institute The University of San Hateet accepts the financial grant provided by the Atumn Association to ‘Suj research development progracr, The grant wil be shocalad tor faculty research taming and student [pele grants. This contnbuton s greatly epprecated for atvancing academic excellence Given on thes “dayof June 1986 Anthony Doualas 4 Office manager BU"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "certacceptance",
        "ocr_text": "te of the Phill SiON on Higher Educa von P Agusan del Sur aurards this Certificate of Acceptance te Stephanie Watters a Strickland PLC lnstitute iS fairing end 1 T st a BS contnbution is gi IC excellence, eB dayof jung Anthony Douglas Office manager"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "certacceptance",
        "ocr_text": "£ Republic of the Philippines fr B Commission on Higher Education y Region 8 DIVISION OF Agusan del Sur awards this Certificate of Acceptance to Stephanie Walters Strickland PLC Institute The he University of Si of —t Rafael eaatinn the financial grant provided Alumni Association onto ch development ram. einen will be ‘atogatod for faculty research fang and student innovation ats his Cn ion is greatly appreciated for advancing Given on thes Se i June 1986 Anthony Doualas Office manager Ty s P\\"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "certacceptance",
        "ocr_text": "wi ‘4 Commis Certificate of Acceptance Stephanie e Walters kland PLC Inst"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines rnission on Higher Education Region com DIVISION OF lloilo awards this __ Certificate of Acceptance Antonio Johnson It Simpson Willis institute This Centiticete of Acceptance is esented to confera that the school litvary nas received 520 voumnes: of acadennc BOOKS donated oy Ihe ‘National 500K ‘Development Beard. The. materials were carelutly mnventonad and are now ‘avaiable for student ‘and facutty use. The institution ‘acknowledges the invaluable support tts Reracy iniuatives. Given on they Q* day of Apri 2019 Lauren Chenv Transport planner"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "certacceptance",
        "ocr_text": "( Republic of the Philippines ‘Se Commission on Higher Education Region DIVISION OF lloilo awards this Certificate of Acceptance to Antonio Johnson II Simpson Willis Institute This Certificate of Acceptance is presented to confem that the schoo library has received 500 volumes of academic books donated by the National Book Development Board. The materials were carefully inventoried and are now available for student and faculty use. The institution acknowledges the invaluable support to its literacy initiatives. Given on the g\" day of April 2010 Lauren Cherry Transport planner"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "certacceptance",
        "ocr_text": "He of the Pb AMISSION on Hig) 6 her Education piv Holo Certificate of Aeceptance Antonio Johnson Simpson Willis Institute"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "certacceptance",
        "ocr_text": "on Republic of the Philippines rs Commission on Higher Education Region DIVISION OF lloilo awards this Certificate of Acceptance to Antonio Johnson II Simpson Willis Institute resented to confirm that the school library has received 500 volumes This Certificate of Acceptance is Br he National Book Development Board. The materials were carefully of academic books donated by cade ied and are now available for student and faculty use. The institution acknowledges the ‘nvaluable support to its literacy initiatives. Given on the 9\" dayof April 2010 Lauren Cherrv Transport planner"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "certacceptance",
        "ocr_text": "® pps Commission on Higher Education DrvIsios Ot Howe Certificate of Acceptance Antonio Johnson tt Simpson Witiis instituie Lauren Cherry Transpeit pienner"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 3 DIVISION OF Agusan del Sur awards this Certificate of Acceptance Julie Thomas Rodriguez, Rogers and Fletcher University This document certifies that the tavetsity formally accepts the ISO 9001 2015 Quality Management Certification awarded after a succesviag fe revance audit. All required standards have hoe satisfactorily met. The management commuter Tprocaining continuous quality improvement i all institutional processes Given on they5* day of June 1991. John Johnson Nutritional therapist"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "certacceptance",
        "ocr_text": "Fd as Co i 1 Higher Education Region 3. Prison oF Agusan dei Sur Certificate of Acceptance Julie Thomas Rodriguez. Regers and Fl cher University"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Phiti Commission on Higher Esty cation AUG: F Agusan del Sur awurds thir ertificate of Acceptance to Julie Thomas Jriguez, Rogers and Fletcher University June 1984 John Joh Nubritonas"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 3 DIVISION OF Agusan del Sur awards this Certificate of Acceptance to Julie Thomas Rodriguez, Rogers and Fletcher University This document certifies that the university formally accepts the ISO 9001 2016 Quality Management ‘Cotitication awarded after a successful compliance audit. All required standards have been satisfactonly met. The management commits to maintaining continuous quality improvement in all institutional processes. Given on they5* dayof June 1994 John Johnson Nutritional therapist"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 3 DIVISION OF Agusan del Sur awards this Certificate of Acceptance to Julie Thomas ___ Rodriguez, Rogers and Fletcher University 9001 2015 Qual Management ifies that the university, Conration awarded after a successful ComPbaree audit All required standards have been satelactonly met. The management commits 10 a taining continuous quality improvement In all institutional processes Given on thegg* dayof June 199+ This document cert John Johnson Nutritional therapist"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Cornmission on Higher Education Region 1 DIVISONGF ~— Cavite _ rtificate of Acceptance t Carl Jones _ «Peters Stevens College 7 s eo a wi the deln of taal ‘s from Trraveletech Loooraones Mivteme were serked tesicd and und complont wah tne agreed specifications, The equipment wii be utiized for the upcoming academic term to support practical teaming. Given on thegg” day ofNoyembeRO14 Kavin White Fa Metaiusgist"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 4 DIVISION OF Cavite awards this Certificate of Acceptance to Carl Jones Peters Stevens College This certifies thatthe College of Engineering accepts the delivery of laboratory instruments from Innovate Tech Laboratories. All items were verified, tested, and found compliant with the agreed specifications. The equipment willbe utized for the upcoming academic term to suppor practical arning. Given on theyg* day of joyvembe2014 Kevin White Metallurgist"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "certacceptance",
        "ocr_text": "Commissior be wants this Certificate of Acceptance Cari Jones vens College 26° day oNoyambef014 Kevin Wile: Metal"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "certacceptance",
        "ocr_text": "Carl Jones Peters Stevens College epts the delivery of tebe! “i ang. ONovembebot4 wi thegg"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 1 DIVISION OF Cavite awards this 7 Certificate of Acceptance to Carl Jones Peters Stevens College ‘This certifies that the College of Engineering tr ts the delivery of aboratony instruments from This Cate Tech Laboratories. All items were 9. 26 eP ested, and found compliant wih We agreed spentications. The equipment will De uttized fr the tipeoming academic term to Support practical learning Given on thegg® day oNovembe2014 Kevin White ‘Metallurgist"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 5 DIVISION or ‘Negros Occidental awards this Certificate of Acceptance to Kathy Logan Stout PLC College The institution accepts the Memorandum of Agreement between the school and the Local Government waste management Mgucation. Both pares have agreed iptance formalizes the partnership in promoting Kristi Santiago Haematologist"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 5 DIVISION OF Negros Occidental awards this Certificate of Acceptance to Kathy Logan Stout PLC College m of Agreement between the school and the Local Goyer ment rnagement education, Both parties have agreed the partnership in promoting The institution accepts the Memorandu! Unit for the community extension project on waste mat faltne terms and implementation schedule. This acceptance formalizes environmental awareness. Given on the, day oGeptembe1 978 Kristi Santiaao Haematologist"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "certacceptance",
        "ocr_text": "' ippines Commission on Higher Education Repor 5. DIVISION OF Magras Ocean Cer tificate of Acceptance Kathy Logan Stout PLC College HEN! between the school ane the ios of edixaton. Both formeiwes the partn aniiago atologst"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "certacceptance",
        "ocr_text": "“oats Republic of the Commission on Higher Education lippines awards thit Certificate of Acceptance Kathy Logan Stout PLC College"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Cornmmission EHVISION _ Certificate of Acceptance Kathy Logan Stout PLC College Kristi Santi Hae"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "certacceptance",
        "ocr_text": "Bs: srudent 0 Repub"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region DIVISONOF Bulacan awards this Certificate of Acceptance to Benjamin Harrison Barker Inc Institute This is to certify that the school accepts the donation of ten {19} ceiling fans from the Parent Teacher Association. The equipment has been installed in selected classrooms to improve ventilation and student comfort. The administration extends its appreciation to the PTA for its continued support. Given on they9\" day of January 1994 Leslie Johnson Engineer, civil (consulting)"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "certacceptance",
        "ocr_text": "wy Republic of the Philippines fe am Commission on Higher Education Region pivisioNOF Bulacan awards this Certificate of Acceptance to Benjamin Harrison Barker Inc Institute This is to certify that the school accepts the donation of ten (10) ceiling fans from the Parent Teacher Association. The equipment has been installed in selecte< classrooms to improve ‘ventilation and ‘student comfort. The administration ‘extends its appreciation ‘to the PTA for its continued support. Given on thepg* day of January 1994 Leslie Johnson Engineer, civil (consulting)"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "certacceptance",
        "ocr_text": "Republic of Commission Benjamin Harrison Barker inc Institute supper."
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "certacceptance",
        "ocr_text": "Republic of tho p Commission on Highs, a er Education Bulacan ds this Certifica f Of Acceptance 2 Benjamin Harrison Barker Inc Institute onth IQ day of"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 4 DIVISION OF Benguet awards this ______ Certificate of Acceptance This Certificate of Accey components under the to Chad Hall Hall Ltd Academy tance confirms that the institution has accepted the delivery of ICT networking campus modernization project. The technical inspection committee verified all tems as complete and functional. These resources will enhance the connectivity infrastructure of the campus Given on theg dayof March 1994 Christy Werner Commissioning editor"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "certacceptance",
        "ocr_text": "of she Philippines sion on Higher Education Region of Benguet this rtificate of Acceptance te Chad Hall Hall Lid Academy ‘ical nepection flame as complole avd fun the connectivity wt Given on theg davet Mamh 1994 Comins: ing editor"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "certacceptance",
        "ocr_text": "Republic of the Philippines Commission on Higher Education Region 4 DIVISION OF Benguet awards this Certificate of Acceptance to Chad Hall Hall Ltd Academy ‘This Certificate of Acceptance confirms that the institution has accepted the delivery of ICT networking Tris Conenis under the campus modernization project. The technical inspects committee verified all components plete and functional. These resources will enhance the connectivity infrastructure of the campus. Given on theg dayof March 1994 Christy Werner Commissioning editor"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "certacceptance",
        "ocr_text": "~~; Republic of the Philippines ‘eg: Commission on Higher Education Ae Region 4 DIVISIONOF Benguet awards this Certificate of Acceptance to Chad Hall Hall Ltd Academy This Certificate of Acceptance confirms that the institution has accepted the delivery of ICT networkin ‘components under the campus modernization project. The technical inspection committee verified al {tems as complete and functional. These resources will enhance the connectivity infrastructure of the ‘campus. Given on theg dayof March 1994 Christy Werner Commissioning editor"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "certacceptance",
        "ocr_text": "as Reput hikiapin 3 ae Commission Higt er E Education Benguet _ Certificate of Acceptance o Rad Hal} i Acadamy March 1994"
    }
]