[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION THE FOLLOWING AWARD IS GIVEN TO Pamela Lowery This certificate is given to for his achievement in the field of education and pr Natalie Perry oves that he is competent in his field. Briana Tate HEAD MASTER Kristen Davis"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "cert",
        "ocr_text": "CMR TIFICATE OF RECOGNITION THE FOLLOWING AWARD IS GIVEN TO Pamela Lowery This certificate is givento Natalie Perry for his achievement in the field of education and proves that he is competent in his field. Briana Tate 5 HEAD MASTER Kristen Davis Ee"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION er THE FOLLOWING AWARD Is GIVEN TO This certificate is given to Natalie Perry for his achievement in the field ofe education and proves that he is competent in his field, Brian: na Ti ate ‘Kris en Davis HEAD MAS\" TER MENTOR"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "cert",
        "ocr_text": "h, CBRTIFICATE OF RECOGNITION THE FOLLOWING AWARD IS GIVEN TO Pamela Lowery This certificate is givento Natalie Perry for his achievement in the field of education and proves that he is competent in his field. Kristen Davis NU MENTOR IN Briana Tate HEAD MASTER"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "cert",
        "ocr_text": "| CBR TIFIGAT E OF RECOGNITION Pamela Lowery This certificate is givento Natalie Perry for his achievement in the field of education and proves that he is competent in his field. Briana Tate . HEAD MASTER Kristen Davis 1"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION pene coed THE FOLLOWING AWARD IS GIVEN TO This certificate is given to Paul Johnson 4 the fleld of education and proves that he is competent in for his achievement ts his field. Bri lan 1 Peters eo"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "cert",
        "ocr_text": "a ALLTEL rar ao 23 AIK OS K CERTIFICATE OF RECOGNITION G AWARD IS GIVEN TO THE FOLLOWIN Jose Carney eis given to Paul Johnson oy ducation and proves that he is competent im his field. This certificat for his achievement in the field of Jo ce Perez i"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION THE FOLLOWING AWARD IS GIVEN TO ose Carney —| This certificate is given to Paul Johnson of education and proves that he is competent in his field. for his achievement in the field Joyce Perez eo HEAD MASTER r Brian. Peters ve"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "cert",
        "ocr_text": "OF RECOGNITION AWARD 18 GIVEN TO THE FOLLOWING ento Paul Johnson d proves that he is competent in his field. This certificate is giv for his achievement in the field of education an Joyce Perez D MASTER"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "cert",
        "ocr_text": "CERT PICATE OF RECOGNITION THE FOLLOWING ae 1S GIVEN TOG This certificate is given to Paul Johns son tor his ac thiev etmentin the field of edu cation and proves that he is com ipetont in his field, Joyce P aT e2Z Brian Peters"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "cert",
        "ocr_text": "ana RE REA ES S ET S A TT TE TES CERTIFICATE OF REGOGNITION enenonanes en econo ee neni AWARD IS GIVEN TO THE FOLLOWING This certificate is given to Jennifer Carroll for his achievement in the field of education and proves that he ig competent in his field. Gary Flores MENTOR Elizabeth Alvarez HEAD MASTER ROAM TLE ENS ITS INE"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION ——o sts THE FOLLOWING AWARD IS GIVEN TO Luis Stokes This certificate is given to Jennifer Carroll for his achievement in the field of education and proves that he is competent in his field. Elizabeth Alvarez HEAD MASTER Gary Flores ENTOR"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION ¢-__ THE FOLLOWING AWARD Is GIVEN TO Luis Stokes This certificate is given to Jennifer Carroll _ for his achievement in the field of education and proves that he is competent in his field. Elizabeth Alvarez Gary Flores HEAD MASTER ENTOR"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "cert",
        "ocr_text": "£4 CERTIFICATE 4° OF RECOGNITION THE FOLLOWING AWARD IS GIVEN TO Luis Stokes This certificate is given to Jennifer Carroll for his achievement in the field of education and proves that he is competent in his field. V4 Elizabeth Alvarez w Gary Flores a HEAD MASTER &* 4 MENTOR oP,"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "cert",
        "ocr_text": "eT eenieneeninatill ASSLT TTA a aan CERTIFICATE OF RECOGNIT ION f THE FOLLOWING AWARD IS GIVEN TO Luis Stokes this certificate is given to Jennifer Carroll é for his achievement in the field of education and proves that he is competent in his field. bi Elizabeth Alvarez Gary Flores as HEAD MASTER MENTOR i‘ H"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION THE FOLLOWING AWARD IS GIVEN TO This certificate is given to Joseph Norrran for his achievement in the field ef education and proves that he is competent in his field, Andrew Boyer R MENTOR Erin Stephens f"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION THE FOLLOWING AWARD [8 GIVEN TO This certificate is given to Joseph Norman for his achievement in the field of education and proves that he is competent in his field. Andrew Boyer % SSR ARSENE SESE IIE SELES EPSRC LAPUA IN ER Erin Stephens HEAD MA"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "cert",
        "ocr_text": "N CERTIFICATE OF RECOGNITION THE FOLLOWING AWARD IS GIVEN TO Cheryl Smith SL RD REA This certificate is given to Joseph Norman for his achievement in the field of education and proves that he is competent in his field. j Se Erin Stephens HEAD MASTER Andrew Boyer MENTOR SARA ATR OE CARE ESTA BASRA SPEEDS ACh NE"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "cert",
        "ocr_text": "- —— SE OS CERTIFICATE OF RECOGNITION | a THE FOLLOWING AWARD IS GIVEN TO Cheryl Smith This certificate is given to Joseph Norman for his achievement in the field of education and proves that he is competent in his field. Erin Stephens Andrew Boyer MENTOR HEAD MASTER a"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "cert",
        "ocr_text": "scrote THE FOLLOWING AWARD IS GIVEN TO This certificate is given to Joseph Norman for his achievement in the field of education and proves that he is competent in his field. Erin Stephe Andrew Boyer"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "cert",
        "ocr_text": "SS EES DE RTT NNER T SI CERTIFICATE OF RECOGNITION THE FOLLOWING AWARD 18 GIVEN TO Monique Sanchez This certificate is given to Robert Zhang for his achievement in the field of education and proves that he is competent in his field. Renee Graves anaes HEAD MASTE? Cindy Mccall MENTOR"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "cert",
        "ocr_text": "> CERTIFICATE OF RECOGNITION —— C2 a THE FOLLOWING AWARD IS GIVEN TO Monique Sanchez This certificate is given to Robert Zhang for his achievement in the field of education and proves that he is competent in his field. Renee Graves Cindy Mccall HEAD MASTER MENTOR"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION Pe THE FOLLOWING AWARD IS GIVEN TO Monique Sanchez This certificate is given to Robert Zhang for his achievement in the field of education and proves that he is competent in his field. Renee Graves HEAD MASTER Cindy Mccall ‘i SR HEUTE a OSE SP ABORT NAM ETE CTR"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "cert",
        "ocr_text": "‘eaScraneese Sun bsanonc eso ceman coma ccn CERTIFIC ATE OF RECOG NITION THE FOLLOW! ING AWaRD TS GIVEN TO This certificate i is given to Ro obert Zhang revement in the Held of education and proves tha; he is Coa for his achi ipetent in his Held. Cindy Mccall"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "cert",
        "ocr_text": "fonique , Sanchez This certificate ig 8iven to ‘Robert Zhang for his achiever In the eld of education and prove 8 that he ig Competent in his field. Renee Gr. ves” HEAD MASTER Cindy J ‘Mccall MENTOR"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "cert",
        "ocr_text": "ARD IS GIVEN TO THE FOLLOWING AW ate is given te Alan Smith ation and proves that he is competent his field. this certific fox his achievement in the field of educ Kimberly Mitchell MENTOR Mare Moren HEAD MAS Huse pA AM RS LOI"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "cert",
        "ocr_text": "SAROREATESEREE Seis acs OF RECOGNITION “oe a THE FOLLOWING AWARD Is SIVEN TO This certifi i iventr i E oo This certificate is BIVEN TO Alan Smith oo 1 for his achievement in the field of education and proves that he is competent in his field. Kimberly Mitchell i MENTOR e"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "cert",
        "ocr_text": "eee a CERTIFICATE OF REC OGNITION tm _ ty THE FOLLOWING AWARD Is GIVEN To a a This certificate is given te Alan Smith 1 for his achievensent in the field of education and proves thar he is competent in his field. a M re Moran Kimberly Mitchell i MASTER MENTOR insane asian"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "cert",
        "ocr_text": "This Certificate j i given to “ment in the field of educ: for hig achiey Mare Moran HEAD MAS TER"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION 7¢@¢ partifinss te alee se oy This gaa: is given to Alan Smith ee for his achievement in the field of education and proves that he is competent in his field. Kimberly Mitchell MENTOR Marc Moran"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "cert",
        "ocr_text": "THE FOLLOWING AWARD Ig GIVEN To This certj fleate is given to Isaac Phillips for his achievement in the fleld of education and proves that he is com -etent in his field, PB E Mclaughtin Db D TER Shawn Gilbert D MAS MENTOR"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION Annette Anderson This certificate is given to isaac Phillips at for his achievement in the field of education and proves that he is competent in his field, ie Danielle Mclaughlin Shawn Gilbert NG HEAD MASTER MENTOR"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION a = THE FOLLOWING AWARD IS GIVEN TO Annette Anderson This certificate is given to fepae Phillips for his achievement in the fleld of education and proves that he is competent in his field. Danielle Mclaughlin HEAD MASTER"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION ee ae THE FOLLOWING AWARD 1S GIVEN TO This certificate is given to isaac Phillips tin the field of education and proves that he is com pevent in his field. for his achievemen i Danielle Mclaughlin Shawn Gilbert MENTOR HEAD MASTER SS BREESE SEE"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "cert",
        "ocr_text": "De CERTIFICATE OF RECOGNITION THE FOLLOWING AWARD IS GIVEN To Annette Anderson This certificate is given to Isaac Phillips for his achievement in the field of education and proves that he is competent in his field. Danielle Mclaughlin Shawn Gilbert HEAD MASTER MENTOR"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "cert",
        "ocr_text": "ee ee ee fe i ee CERTIFICATE OF RECOGNITION THE FOLLOWING AWARD IS GIVEN TO This certificate is givento Jose Little for his achievement in the field of education and proves that he is competent in his field. “Alexa Bishop HEAD M"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "cert",
        "ocr_text": "» £4w& a, 22 CERTIFIGATE OF RECOGNITION ——— ey ee THE FOLLOWING AWARD IS GIVEN TO Craig Hamilton This certificate is givento Jqge Little for his achievement in the field of education and proves that he is competent in his field. Alexa Bishop Randy Dixon HEAD MASTER MENTOR | Me AO"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "cert",
        "ocr_text": "i ae ENON UES OF RECOGNITION THE POLLOWING AWARD Is GIVEN To ‘’ Thie ari tin. je ot . a This certificate 'S given to Jose Little a if for his achievemen; in the field of education and Proves that he is competent in his field. Alexa Bishop HEAD MASTER"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "cert",
        "ocr_text": "= CERTIFICATE K OF RECOGNITION REA —— THE FOLLOWING AWARD IS GIVEN TO Craig Hamilton This certificate is given to Jose Little for his achievement in the field of education and proves that he is competent in his field. Alexa Bishop Randy Dixon HEAD MASTER M TOR"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "cert",
        "ocr_text": "> A CERTIFICATE yi, OF RECOGNITION a SS THE FOLLOWING AWARD IS GIVEN TO Craig Hamilton This certificate is given to for his achievement in the field of education and prov Jose Little es that he is competent in his field. B j"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION THE FOLLO given to Patricia Hayes F tent in his field. This certificate is ation and proves chat he is compe for hig achievement in the field of educ James cs Jonathan Weber 4 D MASTER"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION THE FOLLOWING AWARD {8 GIVEN TO This certificate is given to Patricia Hayes for his achievement in the field of education and proves that he is competent in his field. James Garrison MENTOR ASSESS LST NNSA DEE ESN LALO OEE RIO ESSENSE AE"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "cert",
        "ocr_text": "eS 7 N CERTIFICATE OF RECOGNITION ooo ee eee THE FOLLOWING AWARD IS GIVEN TO Heather David This certificate is given to Patricia Hayes for his achievement in the field of education and proves that he is competent in his field. Jonathan Weber James Garrison HEAD MASTER MENTOR"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "cert",
        "ocr_text": "aE OAR ss eee RSPR RI SR eae eRRRNRS Ry gPRTIFICATE OF RECOGNITION THE FOLLOWING AWARD IS GIVEN To This certificate ig given to Patricia Hayes for his achievement in the fleld of ed ucation and proves that he is competent in his field, Jonathan Weber AD MASTER a"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION THE FOLLOWING AWARD IS GIVEN TO Heather David This certificate is given to for his achievement in the field of education and p Patricia Hayes roves that he is competent in his field. f Jonathan Weber James Garrison HEAD MASTER MENTOR a tm"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "cert",
        "ocr_text": "= Sen\" CERTIFICATE OF RECOGNITION _ __@ THE FOLLOWING AWARD IS GIVEN TO Christina Ramirez This certificate is given to Martin Murray the field of education and proves that he is compe for his achievement in tent in his field. Yolanda Warren HEAD MASTER ——"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE yi OF RECOGNITION THE FOLLOWING AWARD 1S GIVEN TO Christina Ramirez iven to Martin Murray nand proves that he is competent in his This certificate is field. for his achievement in the field of educatio i iT 9"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "cert",
        "ocr_text": "OF REC as NITION, sen a THE FOLLOWING AWARD is Christi ina This certificate is given t vement in the field of education and GIVEN To 0 Martin Murray proves that he is competent in his field, for his achie “Yoi ianda Warren HEAD MASTER"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "cert",
        "ocr_text": "CERTIFICATE OF RECOGNITION Sls SG Ae a eee THE FOLLOWING AWARD IS GIVEN TO Christina Ramirez. This certificate is en to Martin TET for his achievement in the field of education and proves that he is competent in his field. elem Warren aMichele HEAD MASTER Blanga aid"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "cert",
        "ocr_text": "AIST TIIE a emit CERTIFICATE OF REGQGNITION THE FOLLOWING AWARD IS GIVEN TO Christina Ramirez 5 LILES This certificate is given to Martin Murray a for his achievement in the field of education and proves that he is competent in his field. hy Aichele a ;"
    }
]