[
    {
        "image": "certofappearance1_synth_10_aug1.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas 4 wh tomy we Lean Kagawaran ng Edukasyon 3LON Schools DH 3 Jenkins as Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Sherry Rod rig ues of SHHICRTY Department appeared on this Office on August 20, 2025 to transact official This certifies that Brianna Woods attended the Spend Program symposium held in New Aprilport and completed 2 hours of professional development relevant to the field. Wendy Thomas ssn PS RENMEI"
    },
    {
        "image": "certofappearance1_synth_10_aug2.png",
        "label": "certofappearance",
        "ocr_text": "TT t tS | Republika ng Pilipinas Kagawaran ng Edukasyon Certifi cate of ce | TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Sherry Rodriguez _ of Quickly Depariment _ appeared on this Office on August 20, to transact official business as follows: This certifies that Brianna Woods attended the Spend Program symposium held in New Apri iport and compieted 2 hours of professional development relevant to the field."
    },
    {
        "image": "certofappearance1_synth_10_aug3.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Sherry Rodriquez 7 of This certifies that Brianna Woods attended the Spend Program symposium held in New Aprilport and compieted 2 hours of professional development relevant to the field. Wendv Thomas nd"
    },
    {
        "image": "certofappearance1_synth_10_aug4.png",
        "label": "certofappearance",
        "ocr_text": "—— Republika ng Pilipinas Kagawaran ng Edukasyon REGION 20 Schools Division e ankins- ni Certificate of Appearance TO WHOM IT MAY CONCERN ; =] This certifies that Brianna Woods attended the Spend Program symposium held in New Aprilport and completed 2 hours of professional development | relevant to the field. Wendv Thomas md Rodriguez i Ae ck SS SRE AN ESOS RN ESSA ARAN"
    },
    {
        "image": "certofappearance1_synth_10_aug5.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon REGION 20 Schools Division Office of NEW... Jenkins Thomas University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Sherry Rodriguez of Quickly Department appeared on this Office on august 20, 2025 to transact official business as follows: This certifies that Brianna Woods attended the Spend Program symposium held in New Aprilport and completed 2 hours of professional development relevant to the field. Wendv Thomas tanchar Johnson Andersen and Rodriguez University"
    },
    {
        "image": "certofappearance1_synth_1_aug1.png",
        "label": "certofappearance",
        "ocr_text": "| Republika ng Pilipinas Kagawaran ng Edukasyon TO WHOM IT MAY CONCERN This is to certify that Mr. /Ms, Priscilla Gonzalez Oj Qf Bete 4 eos on gee fg os i This certifies that Mary Mclaughlin attended the Cup Program panel i discussion held in New Natallechester and completed 3 hours of professional development relevant to the field. i Ariana Macias Gentry Daniels and Conner University 1 een sc RS RU REO Nemes a ck Td"
    },
    {
        "image": "certofappearance1_synth_1_aug2.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon REGION 7 schools Division Office of Bowen Elliott University Certificate of Appearance TO WHOM IT MAY CONCERN of This is to certify that Mr Ms. Priscilla Gonzalez to transact official Since Office ee _ appeared on this Office on January 12, 2023 business as follows: This certifies that Mary Mclaughlin attended the Cup Program panel discussion held in New Nataliechester and completed 3 hours of professional development relevant to the field. Ariana Macias Politician s"
    },
    {
        "image": "certofappearance1_synth_1_aug3.png",
        "label": "certofappearance",
        "ocr_text": "Be Republika ng Pilipinas Kagawaran ng Edukasyon REGION 7 Schools Division Office of YP% uns Bowen Elliott University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Priscilla Gonzalez of Since Office appeared on this Office or January 12, 2023 to transact official business as follows: This certifies that Mary Mclaughlin attended the Cup Program panel discussion held in New Nataliechester and completed 3 hours of professional development reievant to the field. Ariana Macias Politigian s Gentry Daniels and Conner University"
    },
    {
        "image": "certofappearance1_synth_1_aug4.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon REGION 7 Schools Division Office of N2 atnient Bowen Elliott University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Priscilla Gonzalez 7 of Since Office appeared on this Office on January 12, 2023 to transact official business as follows: This certifies that Mary Mclaughlin attended the Cup Program panel discussion held in New Nataliechester and completed 3 hours of professional development relevant to the field. Ariana Macias Politigian s Gentry Daniels and Conner University"
    },
    {
        "image": "certofappearance1_synth_1_aug5.png",
        "label": "certofappearance",
        "ocr_text": "Republik eo a ng Pilipinas Kagawaran ng Edukasyon Certifi cate of Appearance TO WHOM IT MAY CONCERN Since Office _ business as follows: This certifies is to certify appe that Mary Mcia ughtl discussion held in New Nataliech development relevant to the field. Ari in attended the Cu aster and comp slet ana Macias Priscilla Gonzalez of to transect official erect OFF this Office on January 12, 2023 p Program panel ad 3 hours of professional i"
    },
    {
        "image": "certofappearance1_synth_2_aug1.png",
        "label": "certofappearance",
        "ocr_text": "ny Republika ng Pilipinas Kagawaran ng Edukasyon Certificate of Appearance | This is to certify that Mr Ms. Lisa Zimmerman of i Dcnad of beam appeared on this Office on Secernber 30, 2924 to transact official | This certifies that Keith Rhodes attended the Something Program panel | discussion held in Stevenview and cornpleted 3 hours of professional development relevant to the fieid. Se tt Short ai sales"
    },
    {
        "image": "certofappearance1_synth_2_aug2.png",
        "label": "certofappearance",
        "ocr_text": "8S Ps Om oy Ly 2 4, Republika ng Pilipinas Kagawaran ng Edukasyon REGION 20 Schools Division Office of Lambaro Ramirez and Sons University Certificate of Appearance TO WHOM IT MAY CONCERN of Lisa Zimmerman to transact official This is to certify that Mr Ms. appeared on this Office on December 30, 2024 School of Learn business as follows: This certifies that Keith Rhodes attended the Something Program panel discussion held in Stevenview and completed 3 hours of pro essional development relevant to the field. Scott Short Walls Alexander and Roberts niversily"
    },
    {
        "image": "certofappearance1_synth_2_aug3.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng F Pilipina Kagawaran 0g ng E Edukas syon TO WHOM t IT MAY CONCERN This is to certily that Mr Ms. Lisa Zé Fimamerman ot School of Leam 7 appeared on this Office of pecember 20, 2024 to transact official business as follows: i This certifies that Keith Rhodes attended the Something Pro ram panel | discussion he id in Stevenvi iew ane completed 3 hours of profes gsional i development relevant to the fle \\"
    },
    {
        "image": "certofappearance1_synth_2_aug4.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon REGION 20 Schools Division Office of Lambera Ramirez and Sons University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Lisa Zimmerman 7 of School of Learn _ _ __ appeared on this Office on December 30, 2024 to transact official business as follows: This certifies that Keith Rhodes attended the Something Program panel discussion held in Stevenview and completed 3 hours of professional development relevant to the field. Scott Short Technical sales anainesr Walls Alexander and Roberts niversity"
    },
    {
        "image": "certofappearance1_synth_2_aug5.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon REGION 20 Schools Division Office of Lambera Ramirez and Sons University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Lisa Zimmerman 7 of School of Learn _ _ appeared on this Office on December 30, 2024 to transact official business as follows: This certifies that Keith Rhodes attended the Something Program panel discussion held in Stevenview and completed 3 hours of pro essional development relevant to the field. Scatt Short Technical sales enaineer Walls Alexander and Roberts niversity"
    },
    {
        "image": "certofappearance1_synth_3_aug1.png",
        "label": "certofappearance",
        "ocr_text": "ANG ” %%y, s tS >: %, é 2 ° 2 2 %, Am Cl Republika ng Pilipinas Kagawaran ng Edukasyon REGION 18 Division Office of Jeffrevmouth Schools Powell University Ryan- Certificate of Appearance TO WHOM IT MAY CONCERN that Mr Ms. Andrea Shaw of This is to certify appeared on this Office on November 23, 2024 to transact official Watch Department o attended the Rule Program seminar held in d 4 hours of professional development business as follows: This certifies that Katie Santiag West Jeromeside and complete relevant to the field. Brenda Cooper Sound tec ftim viden Lyons Group University"
    },
    {
        "image": "certofappearance1_synth_3_aug2.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon REGION 12 Schools Division Office of Jeffravmouth Ryan Powell University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Andrea Shaw of Watch Department ee appeared on this Office on November 23, 2024 to transact official business as foliows: This certifies that Katie Santiago attended the Rule Program seminar held in West Jeromeside and completed 4 hours of professional development relevant to the field. Brenda Cooper Sound technician, hroadractine filrn vidac Lyons Group University"
    },
    {
        "image": "certofappearance1_synth_3_aug3.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas agawaran ng Edukasyon REGION jg Schools Division Office of Jeffrevmouth Ryan Powell University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Andrea Shaw of Watch Department appeared on this Office on November 23, 2024 to transact Official business as follows: This certifies that Katie Santiago attended the Rule Program seminar held in est Jeromeside and completed 4 hours of Professional development relevant to the field. Brenda Cooper Sound technician hroadeactina film lvidan Lyons Group University"
    },
    {
        "image": "certofappearance1_synth_3_aug4.png",
        "label": "certofappearance",
        "ocr_text": "4. WANG 2? y Republika ng Pilipinas Kagawaran ng Edukasyon REGION is Schools Division Office of Jeffrevmouth Ryan Powell University Certificate of Appearance TO WHOM IT MAY CONCERN Andrea Shaw _ of to transact official This is to certify that Mr Ms. appeared on this Office on November 23, 2024 Watch Department business as follows: This certifies that Katie Santiago att West Jeromeside and completed 4 hours of pro relevant to the field. ended the Rule Program seminar held in fessional development Brenda Coo Sound technician, Rraadractina film. Iie Lyons Group University per"
    },
    {
        "image": "certofappearance1_synth_3_aug5.png",
        "label": "certofappearance",
        "ocr_text": "| Republika ng Pilipinas i Kagawaran ng Edukasyon REGION 1a Schools Division a of .lefirevmouth Ryan Powell University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Andrea Shaw of Watch Department ee appeared on this Office on November 23, 2024 to transact official i business as follows: This certifies that Katie Santiago attended the Rule Program seminar held in 4 hours of professional development West Jeromeside and completed relevant to the field eecinnnennnntn a OCCA CC Cn"
    },
    {
        "image": "certofappearance1_synth_4_aug1.png",
        "label": "certofappearance",
        "ocr_text": "oo an | Republika ng Pilipinas Kagawaran ng Edukasyon REGION 4 i Schools Division C# Part Matia Peterson inc University Certificate of Appearance TO WHOM IT MAY CONCERN Present College _ ee appeared on this Office om suly 28, 2024 to transact official This certifies that Briana Johnson attended the Class Program seminar held | in Turnerville and completed 6 hours of professional development relevant to the field. Mannis 1 Manager John H Johnson sere"
    },
    {
        "image": "certofappearance1_synth_4_aug2.png",
        "label": "certofappearance",
        "ocr_text": "_ Republika ng Pilipinas Kagawaran ng Edukasyon REGION Schools Division Of Bact Maria 1 Peterson inc University i TO WHOM [fT MAY CONCERN This certifies that Briana Johnson attended the Class Program seminar held in Turnerville and completed 6 hours of professional development relevant to the field. i i 1 nner ee |"
    },
    {
        "image": "certofappearance1_synth_4_aug3.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon REGION 4 Schools Division Office of Part Maria Peterson Inc University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Michelle Lamb 7 of Present College appeared on this Office on July 28, 2024 to transact official business as follows: This certifies that Briana Johnson attended the Class Program seminar held 0 Tumerville and completed 6 hours of professional development relevant to the field. John Dennis Hotel manager Johnson Woodard and Mathis University"
    },
    {
        "image": "certofappearance1_synth_4_aug4.png",
        "label": "certofappearance",
        "ocr_text": "_ Republika ng Pilipinas Kagawaran NG Edukasyon Schools Division OF Peterson Inc University Certificate of Appearance of Pert Mara to transact TO WHOM IT MAY CONCERN j Present College _ appeared on this Office om July 2s. 2024 i ttended the Class Program semina This certifi in Turnerv the field. as that Briana Johnson 4 ile and completed 6 hours of professional developme Jonn Mennis Hotel mz yager nt rele | ot official r held vant to"
    },
    {
        "image": "certofappearance1_synth_4_aug5.png",
        "label": "certofappearance",
        "ocr_text": "cae FP BP Yee SG 3 2. 2. 2 a ol Republika ng Pilipinas Kagawaran ng Edukasyon REGION 4 Schools Division Office of Po Peterson Inc University Certificate of Appearance rt Maria TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Michelle Lamb of _ appeared on this Office on July 26, 2024 to transact official Present College _ inar held business aS follows: ded the Class Pro ram sem levant to This certifies that Briana Johnson atten in Turnerville and completed 6 hours of professional development re the field. John Nennis Hotel manager Johnson Woodard and Mathis University"
    },
    {
        "image": "certofappearance1_synth_5_aug1.png",
        "label": "certofappearance",
        "ocr_text": "Republika na Pilipinas Kagawaran ng Edukasyon REGIO Vang dan Certificate of Appearance TO WHOM IT Ma business as follows: AY CONCERN &ppeared on This certifies that Anthony held in Deborah ort and co relevant to the field. Henry attende Mpleted 2 hou Paul f eat / 1is Office on Nover Kenneth Nguyen Php to transact official d the Evidence Program workshop rs of professional development Snow <orner University emer teeter"
    },
    {
        "image": "certofappearance1_synth_5_aug2.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon REGION 13 Schools Division Office of Waltarshire Vang Howard and Stanley University Certificate of Appearance TO WHOM IT MAY CONCERN This is to_ certify that_ sMr Ms. Kenneth Nguyen PhD _ of School of Table _ appeared on this Office on November 01, 2024 to transact official business as follows: This certifies that Anthony Henry attended the Evidence Program workshop held in Deborahfort and completed 2 hours of professional development relevant to the field. aul Sno Pau ad ra raha Barry Williams and Conner University"
    },
    {
        "image": "certofappearance1_synth_5_aug3.png",
        "label": "certofappearance",
        "ocr_text": "f Republika ng Pilipinas Kagawaran ng Edukasyon REGION 13 Schools Division Office of Waitershirs Vang Howard and Staniey University Certificate of Appearance TO WHOM iT MAY CONCERN This is to certify that Mr./ Ms. Kenneth Nguyen PhD of Schoo! of Table appeared on this Office on November 04, 2024 to transact official pusiness as follows: nded the Evidence Program workshop This certifies that Anthony Henry atte held in Deborahfort and completed 2 hours of professional development relevant to the field. Pail Snow Market, versity Barry Williams and Conner Uni"
    },
    {
        "image": "certofappearance1_synth_5_aug4.png",
        "label": "certofappearance",
        "ocr_text": "Kagawaran ng Edukasyon REGION 43 Republika ng Pilipinas This is to certify that’ ~— Mr Ms. Kenneth Nguyen PhD _ ot This certifies that Anthony Henry attended the Evidence Program workshop held in Deboranfort and completed 2 hours of professional development i relevant to the field. —_"
    },
    {
        "image": "certofappearance1_synth_5_aug5.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon REGION 13 Schools Division Office of Waltershire Vang Howard and Stanley University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Kenneth Nguyen PhD _ of School of Table appeared on this Office on November 01, 2024 to transact official business as follows: This certifies that Anthony Henry attended the Evidence Program workshop held in Deborahfort and completed 2 hours of professional development relevant to the field. Paul Snow Sohne Barry Williams and Conner University"
    },
    {
        "image": "certofappearance1_synth_6_aug1.png",
        "label": "certofappearance",
        "ocr_text": "BS Republika ng Pilipinas Kagawaran ng Edukasyon REGION 2 Schools Division Office of Sputh Morris Smith and Clark niversity Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. School of City Pamela Parker _ of appeared on this Office on priio3, 2024 to transact official business as follows: Single Program seminar held in This certifies that Don Riggs attended th i 1 hour of professional development relevant to the Kristaland and complete field. James Smith Production Assisi tant television Burns Nguyen University"
    },
    {
        "image": "certofappearance1_synth_6_aug2.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran nge Equkasyon Se “eof ha University Certificate of Appearance schools Divis Moris TO WHOM {T MAY CONCERN This is to certify that Mr Ms. Pamela Parker of school of City appeared on this Cffice on emis. 2024 to transact official business a follows: This certifies that Don Riggs attended the Single Progt ram seminar held in Kristalane and Cc omplete 4 hour of pro ofessional de de yelopment relevant to the Jam s amith Bums- Nguyen Univer sity ener aenemnereat One eee"
    },
    {
        "image": "certofappearance1_synth_6_aug3.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon Schools Divisi i Certificate of Appearance gs attended the Single Program semina to transact r held in official Kristaland and completea 5 hour of professional development relevant to the TO WHOM IT MAY CONCERN School of City business as follows: This certifies that Don Rig field."
    },
    {
        "image": "certofappearance1_synth_6_aug4.png",
        "label": "certofappearance",
        "ocr_text": "| Republika ng Pilipinas Kagawaran ng Edukasyon REGION Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Pamela Parker of School of City 4ppeared on this Office on Apnios, 2024 to transact official business as follows: This certifies that Don Riggs attended the Single Program seminar held in Kristaland and completed 1 hour of professional development relevant to the field. Burns Nguyen University |"
    },
    {
        "image": "certofappearance1_synth_6_aug5.png",
        "label": "certofappearance",
        "ocr_text": "< N *%, Bb fa) os bs Republika ng Pilipinas Kagawaran ng Edukasyon REGION 2 Schools Division Office of South Morris Smith and Clark niversity Certificate of Appearance TO WHOM IT MAY CONCERN of certify that Mr Ms. Pamela Parker 7 This is to _ appeared on this Office on April 03, 2024 to transact official School of City ee business as follows: This certifies that Don Ri Kristaland and completed 1 hour 0 field. gs attended the Single Program seminar held in f professional development relevant to the James Smith Production assistant television Burns Nguyen University"
    },
    {
        "image": "certofappearance1_synth_7_aug1.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon REGION 20 Schools Division Office of Wesk Walker Inc University Certificate of Appearance TO WHOM IT MAY CONCERN of Kristin Griffin certify that Mr Ms. to transact official This is to School of Federal appeared on this Office on December 02, 2022 business as follows: This certifies that Colin Buckley attended the Wear Program seminar held in West Sherrichester and completed 2 hours of professional development relevant to the field. Darren .lahnson Davis Dudley University"
    },
    {
        "image": "certofappearance1_synth_7_aug2.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng =dukasyon REGION Schools Divi Walker inc Uy oF ast Certificate of Appearance - ; lent} [EEE oy Fa This is to certify that Mr Ms. Kristin Griffin of School of Federal appeared on this Office on December 02, 2022 fo transact official] This certifies that Colin Buckley attended the W j lA en Vest Sherrichester and d completed 2 hours of professional relevant to the field. Sar Program seminar held in develonment"
    },
    {
        "image": "certofappearance1_synth_7_aug3.png",
        "label": "certofappearance",
        "ocr_text": "e, c Republika ng Pilipinas Kagawaran ng Edukasyon REGION 2 Schools Division Office of West Walker Inc University Certificate of Appearance TO WHOM IT MAy CONCERN This is to certify that Mr Ms. Kristin Griffin _ of School of Federal _ —— 4ppeared on this Office on December 02, 2022 to transact official business as follows: This certifies that Colin Buckle est Sherrichester and compl y attended the Wear Pro relevant to the field. gram seminar held in eted 2 hours of professi onal development Darren .lohngon Davis Dudley University"
    },
    {
        "image": "certofappearance1_synth_7_aug4.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon REGION 20 Schools Division Office of West Walker Inc University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Kristin Griffin of School of Federal appeared on this Office on December 02, 2022 to transact official business as follows: This certifies that Colin Buckley attended the est Sherrichester and compl Wear Program seminar held in relevant to the field. eted 2 hours of professional development Darren -lIoahnson Teacher, English as a foreian lanauiane Davis Dudley University"
    },
    {
        "image": "certofappearance1_synth_7_aug5.png",
        "label": "certofappearance",
        "ocr_text": "Yes ee Republika ng Pilipinas Kagawaran ng ukasyon REGION 2 Schools Division Office of West Walker Inc University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms, Kristin Griffin School of Federal December 02, 2022 of appeared on this Office on business as follows: This certifies that Colin Buckley attended t est Sherrich he Wear Program Seminar held in cnester and completed 2 hours Of professional development relevant to the field. to transact Official] Darren .lohngon reian Davis Dudley University"
    },
    {
        "image": "certofappearance1_synth_8_aug1.png",
        "label": "certofappearance",
        "ocr_text": "vets email onsen ESSE OET SES REET NEC eA EAE RIA IIIS MEET OE TE cevesenernonntnacstnnaNR NRE IOE cre aon Se Republika ng Pilipinas i Kagawaran ng Edukasyon REGION 15 ville Schools Division Office of Christonhensh Clements Lid University i Certificate of Appearance Shelley Garza _ of Of wine ‘7 eit ava B ee Office oO Acthviy appeared on this Office Of December 26, 2024 to transact official This certifies that Erin Walker attended the Choice Program panel discussion held in East Jessica and completed 7 hour of professional development relevant to the field. Environmental Jaime Rodriquez MD Wright Hall University me)"
    },
    {
        "image": "certofappearance1_synth_8_aug2.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon REGION 15 Schools Division Office of Christonherville Clements Ltd University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Shelley Garza _ of Office of Activity appeared on this Office on December 28, 2024 to transact official business as follows: This certifies that Erin Walker attended the Choice Program panel discussion held in East Jessica and completed 1 hour of professional development relevant to the field. Jaime Rodriquez MD Wright Hall University"
    },
    {
        "image": "certofappearance1_synth_8_aug3.png",
        "label": "certofappearance",
        "ocr_text": "eis ous TQ WHOM jrM Office of Activity iness 35 fo This cert held relev in Ea ant to the field. cement encase Republika NG Pilipinas Kagawaran Ng eEdukasyon Siviaion Office o! Clements Lic University Certificate of Appearance neistonhervile ay CON CERN Shelley Garza ; appeared on this Office on December 28, 2024 e Choice Program pan r of professional devel lows: fies that Erin Walker attended th si Jessica and completed 4 hou driguel MD omental Lei on Jayne KO en Wright Hall University _ eel to tra el discussion opment \\ |"
    },
    {
        "image": "certofappearance1_synth_8_aug4.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon Schools Division O1 Clements Lid University Certificate of Appearance of Christoohervitte TO WHOM IT MAY CONCERN This is to certify —that Mr. /Ms. Shelley Garza _ wo Office of Activity ; appeared on this Office on Bee 28, 2024 to transact official | This certifies that Erin Walker attended the Choice Program panel discussion | held in East Jessica and completed 1 hour of professional development relevant to the field. Jaime Rodriquez MD ena University vcerotsn bo e HHISAEA EINE EO en Wright Ha seecnemeesunte nn 2 DCL SIT On"
    },
    {
        "image": "certofappearance1_synth_8_aug5.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon ION 45 REG Schools Division Office of c Clements Ltq Uni Certificate of A hristooherville versity Ppearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Shelley Garza _ of Office of Activity appeared on this Office on December 28, 2024 business as follows: to transact Official at Erin Walker attended the Choice Pro ram panel eld in East Jessica and Complete relevant to the field. g discussion d 1 hour of Professional development Jaime Rodriquez MD Environmental Wright Hall University"
    },
    {
        "image": "certofappearance1_synth_9_aug1.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon | RE Certificate of Appearance AGUS is to certify that Mr Ms. Rose Shaffer of Face College appeared on this Office on to transact official i This certifies that Megan Martin attended the Skin Program seminar held in Smithberg and completed 6 hours o the field. f professional cevelopment relevant to |"
    },
    {
        "image": "certofappearance1_synth_9_aug2.png",
        "label": "certofappearance",
        "ocr_text": "an nen RE SE PSR seb itt SHUR OAISTER AS RESTA NSPE INESANS OT Kagawaran ng Edukasyon REGION 4 Office of Cowanhaven Gilespie Walter University Certificate of Appearance Republika ng Pilipinas This is to certify that Mr. Ms. Rose Shaffer of Face College appeared on this Office on July 19, 2028 to transact official business as follows: This certifies that Megan Martin attended the Skin Program seminar held in Smithberg and completed 6 hours of professional development relevant to the field. FE viller aod Robinson sity"
    },
    {
        "image": "certofappearance1_synth_9_aug3.png",
        "label": "certofappearance",
        "ocr_text": "= t ww & Republika ng Pilipinas Kagawaran ng Edukasyon REGION Schools Division Office of Cowanhaven Gillespie Walter University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Rose Shaffer Face College _ of appeared on this Office on suy 19, 2023 to transact official business as follows: This certifies that Megan Martin attended the Skin Program seminar held in maithberg and completed 6 hours of professional development relevant to e field. nevebainnict Bowman Hancock end Robinson niversity"
    },
    {
        "image": "certofappearance1_synth_9_aug4.png",
        "label": "certofappearance",
        "ocr_text": "ae .-. OO Republika ng Pilipinas Kagawaran ng Edukasyon REGION Schools Division Office of Cowanhaver Silespie Waller University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Rose Shaffer 2 af business as follows: This certifies that Megan Martin attended the Skin Program seminar held in Smithberg and completed 6 hours of professional development relevant to the field. Heather Filer Bowmal ‘Levasseur ee ANAS CEO ACOA MANE"
    },
    {
        "image": "certofappearance1_synth_9_aug5.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Edukasyon REGION Schools Division Office of Cowanhaven Gillespie Walter University Certificate of Appearance TO WHOM IT MAY CONCERN This is to certify that Mr Ms. Rose Shaffer _ of Face College appeared on this Office on Juty 19, 2023 to transact official business as follows: This certifies that Megan Martin attended the Skin Program seminar held in maithberg and completed 6 hours of professional development relevant to e field. Heather Fi ler Counselling nevehoianict Bowman Hancock and Robinson niversi ty"
    },
    {
        "image": "certofappearance2_synth_11_aug1.png",
        "label": "certofappearance",
        "ocr_text": "| _ Repatliia ag Bdipwas i eagawaran ag Chekasean | Ng 1 seniooe. ISOW OFNCE OF gan, { i Certificate of Appearance i i i This is to certify thet Mr Mrs. 0 Michaelbyan 000 of j i i | Alac Combs i i es. grape Social worker Return Collage hea eee |"
    },
    {
        "image": "certofappearance2_synth_11_aug2.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilrpinas Ragawaran ng Edukasvon REGION 9 SCHOOLS DIVISION OFFICE OF 23 jmoun Certificate of Appearance This is to certify that Mr Mrs. _Michael Lynn of By Department attended the Technology Symposium held at _Outside Center on May 04, 2024 Alec Combs Designer, graphic Social worker Return College"
    },
    {
        "image": "certofappearance2_synth_11_aug3.png",
        "label": "certofappearance",
        "ocr_text": "Republika ug Pilipinas BRagawaran ng Enukasvon REGION 9 ScHOOIS DIVISION OFFICE OF Bgiomean Certificate of Appearance This is to certify that Mr Mrs. _____ Michael Lynn\" attended the Technology Symposium By Department on May 04, 2024 held at _Outside Center of Alec Combs Designer, graphic social worker Retum College"
    },
    {
        "image": "certofappearance2_synth_11_aug4.png",
        "label": "certofappearance",
        "ocr_text": "| Certificate of if ppearance | | | | his is to certify that Mr Mes. Michael Lynn of \\ a ee attended the a i Lon. May 04, 2024 Alec Cambs t rape |"
    },
    {
        "image": "certofappearance2_synth_11_aug5.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Ragawaran ng Edukasvon REGION 9 SCHOOLS DIVISION OFFICE OF gan Certificate of Appearance This is to certify that Mr Mrs. Michael Lynn By Department attended the Technology Symposium held at _Outside Center on. May 04, 2024 Alec Combs Designer, graphic Social worker Retum College"
    },
    {
        "image": "certofappearance2_synth_12_aug1.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Ragawaran ng Edukasvon REGION 6 SCHOOLS DIVISION OFFICE OF gouth Jared Certificate of Appearance This is to certify that Mr Mrs. Javid Jefferson of Quite Office attended the _Just Symposium held at _Member Center OM. March 21, 2024 Christine Price Surveyor, minerals Pull College"
    },
    {
        "image": "certofappearance2_synth_12_aug2.png",
        "label": "certofappearance",
        "ocr_text": "Wagawar RE seamests OF 26 GF Gout Jared i | Certificate at Appearance —— ____ Bttenat es 1 —— an Mach 21 We | \\ Christine Price t"
    },
    {
        "image": "certofappearance2_synth_12_aug3.png",
        "label": "certofappearance",
        "ocr_text": "a SOHOGHS DY aN c South Josed | Certificate of Appearance This is to certify that Mr Mrs. Qavid Jefferson. of i held st oe cree eneen 2 Mare 24, 2024 Brice i"
    },
    {
        "image": "certofappearance2_synth_12_aug4.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Ragawaran ng Edukaspon REGION 6 SCHOOLS DIVISION OFFICE OF south Jared Certificate of Appearance This is to certify that Mr Mrs. David Jefferson of attended the _Just Symposium Quite Office held at _Member Center on March 21, 2024 Christine Price ‘Surveyor, minerals Pull College"
    },
    {
        "image": "certofappearance2_synth_12_aug5.png",
        "label": "certofappearance",
        "ocr_text": "ng Beepinas Bepeblses ff ehakasvat Fraqawacan 1 RECON 6 SOROS pee TE Certificate of Appearance OF South Jarod _David Jefferson —-— certify that Bir f en BNE ned the _or March 4 of"
    },
    {
        "image": "certofappearance2_synth_13_aug1.png",
        "label": "certofappearance",
        "ocr_text": "| _ Repallibs ag Bytyina: i Ragauaras ng Chehkaesn i OM gs SCHOGLS LAWIMION Genny oF Siew Anne i i Certificate af Appearance i | i This is to certify that Mr Mrs. _ _ Terry Cruz OF | nw attended Che _Poic ene 8, Nevornbor ts, 2024, i yden Sims i"
    },
    {
        "image": "certofappearance2_synth_13_aug2.png",
        "label": "certofappearance",
        "ocr_text": "This is School of Wall Republika ng Pilipinas Ragawaran ng Edukaspon REGION 9 SCHOOLS DIVISION OFFICE OF jew Anne Certificate of Appearance to certify that Mr Mrs. Terry Cruz held at _social Hall attended the Police Symposium On _ November 15, 2024 Hayden Sims Engineer, drilling omeunty education School of Remain"
    },
    {
        "image": "certofappearance2_synth_13_aug3.png",
        "label": "certofappearance",
        "ocr_text": "| Repatltha ag Pilipinas Ragawaran wy Epakaspen REGION 9 SCHOOLS DIVISION OFFICE OF Now Anno Certificate of Appearance of Mr Mrs, __-- __ Terry Cruz ..—---—- This is to certify that ____attended the _Poslew Symposiums a School of Vial ____ on. November 15, 2024 Hell at Social tat nn Hayden Sims Engineer, arting Capueny woven School of Remain es"
    },
    {
        "image": "certofappearance2_synth_13_aug4.png",
        "label": "certofappearance",
        "ocr_text": "& Republika ng Pilipinas Ragawaran ng Edukasyon REGION 9 SCHOOLS DIVISION OFFICE OF New Anne Certificate of Appearance This is to certify that Mr Mrs. Terry Cruz. of School of Wall attended the Police Symposium held at _Social Hall Nn November 15, 2024 Hayden Sims Engineer, drilling Gommunty esvcaton School of Remain"
    },
    {
        "image": "certofappearance2_synth_13_aug5.png",
        "label": "certofappearance",
        "ocr_text": "fe ‘BB: bd Republika ng Pilipinas Ragawaran ng Edukasvon REGION 9 SCHOOLS DIVISION OFFICE OF jew Anne Certificate of Appearance This is to certify that Mr Mrs. Terry Cruz. of School of Wall attended the Police Symposium held at _Social Hall Nn _ November 15, 2024 Hayden Sims Engineer, drilling ‘education School of Remain"
    },
    {
        "image": "certofappearance2_synth_14_aug1.png",
        "label": "certofappearance",
        "ocr_text": "| Certificate of Appearance i This ts to certify thet Mr Mre. 0 Wiliam Howell. of FE 1 _Migh L held a"
    },
    {
        "image": "certofappearance2_synth_14_aug2.png",
        "label": "certofappearance",
        "ocr_text": "| REION 4 H SIGHS DIVISION GEE OF yon Certificate of Appearance t Austin This is to certify that Mr Mrs. Wiliam Howell of I"
    },
    {
        "image": "certofappearance2_synth_14_aug3.png",
        "label": "certofappearance",
        "ocr_text": "Jhagawaras ng Chahasvas i REGLON 4 H SCHOGLS DIVISION OFFICE GF yest Austin i Certificate of Appearance | aw titended the i hell at _ Hope"
    },
    {
        "image": "certofappearance2_synth_14_aug4.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Sagawaran pd Soukasyon REGION 14 SCHOOLS DIVISION OFFICE OF West Austin Certificate of Appearance This is to certify that Mr Mrs. _ __ William Howell _____— of _Might Office attended the Manager Workshop held at _Hope Center Nn December 21, 2024 Kimberly Lopez Financial risk analyst Aulomotve engineer Maintain Department"
    },
    {
        "image": "certofappearance2_synth_14_aug5.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Kagawaran ng Cdukaspon REGION SCHOOLS DIVISION OFFICE OF West Austin Certificate of Appearance This is to certify that Mr Mrs. ———William Howell of Might Office attended the _Manager Workshop held at _Hope center On December 21, 2024 Kimberly Lopez Financial risk analyst Automotive engineer Maintain Department"
    },
    {
        "image": "certofappearance2_synth_15_aug1.png",
        "label": "certofappearance",
        "ocr_text": "| Repniitha vy Bikpas i Kagewaraa aq Chakasrow i RENO 19 i i SCHOOLS ENNSION OFA OF i i : Certificate of Appearance certify that Me Mre, __ Kevin Bryan..."
    },
    {
        "image": "certofappearance2_synth_15_aug2.png",
        "label": "certofappearance",
        "ocr_text": "‘eB <4 Republik. al igioees ms Tnlaes REGION 10 SCHOOLS DIVISION OFFICE OF y4iisfut Certificate of Appearance This is to certify that Mr Mrs, __Kevin Bryan _ -School of Mean attended the _Break Conference held at _Give Hat On March 23, 2023 Flizabeth Hall Museum education officer Tarwooste Office of Father"
    },
    {
        "image": "certofappearance2_synth_15_aug3.png",
        "label": "certofappearance",
        "ocr_text": "Ri Ki Kapamaran ny Eubasyon REGION 10 SCHOOLS DIVISION OFFICE OF yiisfurt Certificate of Appearance This is to certify that Mr Mrs. Kevin Bryan School of Mean attended the _Break Conference held at _Give Hat On March 23, 2023 Flizabeth Hall education officer Museum"
    },
    {
        "image": "certofappearance2_synth_15_aug4.png",
        "label": "certofappearance",
        "ocr_text": "Revebiths ag Pikpraas Ragawaran ng Sdikasvon REGION to SCHOOLS DIVISION OFtCE oy Matisfont Certificate of Appearance This is to Certify that Mr Mrs, Kevin Bryan_ Attended the ema A Contorenice OF March 23, 2023"
    },
    {
        "image": "certofappearance2_synth_15_aug5.png",
        "label": "certofappearance",
        "ocr_text": "This is School of Mean to Republika ng Bilprnas Kagawaran ng Edukasvon REGION 40 SCHOOLS DIVISION OFFICE OF yilisfurt Certificate of Appearance certify that Mr Mrs. ______ Kevin Bryan attended the _Break Conference held at _Give Hall on March 23, 2023 Flizabeth Hall Museum education officer Office of Father of"
    },
    {
        "image": "certofappearance2_synth_16_aug1.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Ragawaran ng Edukasvon RIGION 13 SCHOOLS DIVISION OFFIC Certificate of Appearance OF Jessicaburgh This is to certify that Mr Mrs. Martha Bailey Never Office ——~ _attended the _Movie Workshop on May 01, 2024 held at Garden Centet Shawn Cook st commercial Hortcultuns Financial controller School of Possible"
    },
    {
        "image": "certofappearance2_synth_16_aug2.png",
        "label": "certofappearance",
        "ocr_text": "i ny Bilipinas | Aagswaran ng Chakasrey scunms 8 HICK OF Jessicanugh i | Certificate of Appearance is to that Me f Mrs. Macha Bailey _ ce OE"
    },
    {
        "image": "certofappearance2_synth_16_aug3.png",
        "label": "certofappearance",
        "ocr_text": "9 3 : Republika ng Pilipinas Ragawaran ng ECdukasvon REGION 13 SCHOOLS DIVISION OFFICE OF Jessicaburgh Certificate of Appearance This is to certify that Mr Mrs. ___ Martha Bailey .- Sof Never Office attended the _Movie Workshop on May 01, 2024 held at _Garden Center Shawn Cook Horticulturist, commercial Financial controller School of Possible"
    },
    {
        "image": "certofappearance2_synth_16_aug4.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Ragawaran ng Edukasvon REGION 13 SCHOOLS DIVISION OFFICE OF Jessicaburgh Certificate of Appearance This is to certify that Mr Mrs. Martha Bailey Never Office attended the _Movie Workshop held at _Garden Center on. May 01, 2024 Shawn Cook Horticulturist, commercial Financial controller School of Possible"
    },
    {
        "image": "certofappearance2_synth_16_aug5.png",
        "label": "certofappearance",
        "ocr_text": "Bily ne Cini This is to cer thar Mr Mrs. ss Martha Bailey _ OF __attended the 4 on"
    },
    {
        "image": "certofappearance2_synth_17_aug1.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas Ragawaran ng Edukasyon REGION 14 SCHOOLS DIVISION OFFICE OF Port Clinton Certificate of Appearance This is to certify that Mr Mrs. Eduardo Duran of Feel Office attended the _Professor Conference held at _virtual Piattorm ON October 29, 2024 Katherine Jones Psychologist, sport and exercise Forensic paychoogat School of Listen"
    },
    {
        "image": "certofappearance2_synth_17_aug2.png",
        "label": "certofappearance",
        "ocr_text": "i Bepllika nq Biltgours t Bagawaran ag Chihasyst MEGION 16 SCMOBKS DIVEMON OFFICE OF Pot Cinton Certificate of Appearance This is vo certify that Mr Mrs Eduardo Duran. of i i “Fee! Office Attended the Professor Conference __ ON Octoner 28, Schooi of Listen Nn ae ee ee ms _"
    },
    {
        "image": "certofappearance2_synth_17_aug3.png",
        "label": "certofappearance",
        "ocr_text": "This Feel Office is to Republika ng PBiltpinas Ragawaran ng Edukasvon REGION 14 SCHOOLS DIVISION OFFICE OF poet Clinton Certificate of Appearance certify that Mr Mrs. Eduardo_Duran attended the _Professor Conference held at _Virtual Platform On October 29, 2024 Katherine Jones Psychologist, sport and exercise Forensic psychologist School of Listen of"
    },
    {
        "image": "certofappearance2_synth_17_aug4.png",
        "label": "certofappearance",
        "ocr_text": "| Bepadltiba sq Pilipinas Lagawaran ag Chvkasvon REGION 44 SCHOOLS DIVISION OFFICE OF Pet Cinton Certificate of Appearance This is to certify that Mr Mrs. ___ _ Eduardo Duran of Feel Office ee _attended the _Professar Conterence held at _virtuai Piationn ______.. O14 October 29, 2024 Katherine Jones Psychologist, sport and exercise Tevertepayetsogel School of Listen a"
    },
    {
        "image": "certofappearance2_synth_17_aug5.png",
        "label": "certofappearance",
        "ocr_text": "t \\ Fepabltha ug Hlvisse i Ragawaran aa Shywasesn 4 CHGS s ISON Orne CE iF Pot | Certificate of Appearance | i | This is to certify that Mr Mrs. Eduardo. Quran. af _— a _atended the _Priess ee { __oF Getober 26 2024 |"
    },
    {
        "image": "certofappearance2_synth_18_aug1.png",
        "label": "certofappearance",
        "ocr_text": "This is Sehoolol New held et _ virtual eau pias ag Coskaseoy Certificate of Appearance to cer that Mr. /Mrs. -Nocman Lopez ee Oded the on June 16, Linda Hughes Clseeal biochemist Yet Othice"
    },
    {
        "image": "certofappearance2_synth_18_aug2.png",
        "label": "certofappearance",
        "ocr_text": "' Repel ag Pepin i nent ns oH | Certificate of Capearance { t A i is to certify that i School. a 1 held at ee 68 June 18, 2024 { | t i 1 Linda Hughes ;"
    },
    {
        "image": "certofappearance2_synth_18_aug3.png",
        "label": "certofappearance",
        "ocr_text": "SOMOS ~ Certificate of Apprarante i 1 4 | This is to that Mue./ Mes Norman Lopez of School of New sure Sontomnce H , 1a t 1 | q Linda Huahes \\"
    },
    {
        "image": "certofappearance2_synth_18_aug4.png",
        "label": "certofappearance",
        "ocr_text": "ie: RK ih Ripionran i Poikasyo mn REGION 13 SCHOOLS DIVISION OFFICE OF Le semeysnee Certificate of Appearance This is to certify that Mr Mrs. Norman Lopez School of New attended the _strcture Conference held at _virtual Piatform on June 16, 2024 Linda Hughes Clinical biochemist hla Yet Office"
    },
    {
        "image": "certofappearance2_synth_18_aug5.png",
        "label": "certofappearance",
        "ocr_text": "{ Smmermacanisen nant a 8 Gtlgnag ag Covhasyag OF sae stepson | Certificate af Appearance i i certily thar My Mrs. ~Narman Lopez. a of Hi School of New a -—.Attended the _9, a i beld at ane OTL June t | i i i i"
    },
    {
        "image": "certofappearance2_synth_19_aug1.png",
        "label": "certofappearance",
        "ocr_text": "~ Republika ng Pilipinas Kagawaran ng €dukasvon REGION 14 SCHOOLS DIVISION OFFICE OF ‘North Kimberty Certificate of Appearance This 00 Office held at _vitual Piattorm is to certify that Mr Mrs. ——_WillamGay of attended the _Annual Event Forum On December 05, 2022 John Livingston ‘Ammed forces logistics support administrative officer Comeunty arte worker Office of Sure"
    },
    {
        "image": "certofappearance2_synth_19_aug2.png",
        "label": "certofappearance",
        "ocr_text": "Republika ng Pilipinas RKagawaran ng Edukasvon REGION 11 SCHOOLS DIVISION OFFICE OF North Kimbery Certificate of Appearance This is to certify that Mr Mrs. William Gay Too Office attended the _Annual Event Forum held at _Virtual Platform MN. December 05, 2022 John Livingston ‘Armed forces logistics supportladministrative officer ‘Community arts worker Office of Sure"
    },
    {
        "image": "certofappearance2_synth_19_aug3.png",
        "label": "certofappearance",
        "ocr_text": "Certificate af Appearance | H is to cermtiy thar Mr Mers. 0 Wiliam Gay of |"
    },
    {
        "image": "certofappearance2_synth_19_aug4.png",
        "label": "certofappearance",
        "ocr_text": "{ H | Regahiia ag Bilpeas { Ragatearan ag Chokasinn | 7 GHRCE OF nemeneny i Certificate of Appearance | This is to certiiy that Mr. /Mrs ~——--_ _ William Gay oof _ _ attended the Geld at _vir oreenntnianmeenesntat meres OO Di"
    },
    {
        "image": "certofappearance2_synth_19_aug5.png",
        "label": "certofappearance",
        "ocr_text": "| Regubliks ox Bilyinas | Taagawaran ny Cbakaseea i 20m 14 i Certificate of Appearance | i Teo OFF 7 a attended the _An ee |"
    },
    {
        "image": "certofappearance2_synth_20_aug1.png",
        "label": "certofappearance",
        "ocr_text": "| gal ng Gilieas Fane ng Caukneven i REGION 1 SCHOOLS DIVISION OTRICE GF ayatashin Certificate of Appearance This is to that Mr Mrs. Richare Burke of on April i bekd at | chard Warren Rasio pr Academic j hoo! of in i"
    },
    {
        "image": "certofappearance2_synth_20_aug2.png",
        "label": "certofappearance",
        "ocr_text": "j i t Repaliba ae Biliginas | Fagwearaa #8 CorTasear \\ ytOM 4 1 EVIsION OFFICE ar A H t Certificate of Appearance y t Bee Richard Burke cr Apnil 06, 2023"
    },
    {
        "image": "certofappearance2_synth_20_aug3.png",
        "label": "certofappearance",
        "ocr_text": "“a Republika ng Bihpinas Ragawaran ng Ctakasrox REGION 4 SCHODLS DIVISION OFFICE OF Ayeiashie Certificate of Appearance This ie to certify that Mr Mrs. _ Richard Burka... of Near Department attended the _iSymposien held at _Lopezsnire Campus _ _ OM. April 08, 2023, Richard Warren Radio producer Academic \"brsian School of fa"
    },
    {
        "image": "certofappearance2_synth_20_aug4.png",
        "label": "certofappearance",
        "ocr_text": "1 Tagawaran ag Ebakasvon i Certificate of Appearance f i This is te certify that Mr Mrs. _ Richard B _ ot | i ___attendec oe ' ee OTE Apnlas i | ichard Warren i Radi i i Acadenit Tbeaian i"
    },
    {
        "image": "certofappearance2_synth_20_aug5.png",
        "label": "certofappearance",
        "ocr_text": "Certificate af Sypearance i is io certify that Mr Mrs. Richard Burke of Near Department CtCCtte ig the __ held at __ OT April 06, 2023 Fe | ichard Warren i Academie fbredan |"
    }
]