[
    {
        "image": "certofcash1_synth_10_aug1.png",
        "label": "certofcash",
        "ocr_text": "‘Republic of the Bhitivotnes Bevartment of Eouc ion REGION 1 Por Erica SCHOOLS DIVISION oF CERTIFICATION This is to Certify that Teac! Santos has not !ncurred any Unauthorized absences or tardi anuary 2024 to October 9024. This certificati attest fo lion is ssaued fo ler exemplary attendance recor Christina Peters Paediatric nurse"
    },
    {
        "image": "certofcash1_synth_10_aug2.png",
        "label": "certofcash",
        "ocr_text": "Wrote ok Ge Pm Bepariment of Ceacadion REGION pat tse Schone uryision oF a CERTIFICATION This is to certify that Teacher Lianne M. Santos has not incurred any unauthorized absences or tardiness from January 2024 to October 2024. This certification is issued fe attest to her exemplary attendance record, Christina Peters Paediatric nurse"
    },
    {
        "image": "certofcash1_synth_10_aug3.png",
        "label": "certofcash",
        "ocr_text": "— EageNt: x the Bhi Sewatwent of Cyacation KECION 1 pon Soceeminer SENOOLS OIVISTON OF CERTIFICATION This is to certify that Teacher Lianne M. Santos has not incurred any unauthorized absences or tardiness from January 2024 to Octo! r 7024. This certification is issued to attest to her exempiary attendance record. Chrisiina Peters Paediatric nurse"
    },
    {
        "image": "certofcash1_synth_10_aug4.png",
        "label": "certofcash",
        "ocr_text": "Republic ofthe Bbilinnines Department of Education REGION 1. pon Encaciag SCHOOLS DIVISION OF CERTIFICATION This is to certify that Teacher Lianne M. Santos has not incurred any unauthorized absences or tardiness from January 2024 to October 2024. This certification is issued to attest to her exemplary attendance record. Christina Peters Paediatric nurse"
    },
    {
        "image": "certofcash1_synth_10_aug5.png",
        "label": "certofcash",
        "ocr_text": "ee end of Cenication CS ovale Beengtee SCHOOLS DIVISION oF MS Yt a CERTIFICATION This is to Certify that Teacher Lianne M. Santos has not incurred any unauthorized absences or fardiness from January 2024 to October 2024. This certification is issued fo atiest to her exemplary attendance recor Christina Peters Paediatric nurse"
    },
    {
        "image": "certofcash1_synth_1_aug1.png",
        "label": "certofcash",
        "ocr_text": "Department of Cyucation REGION 4 East Beriaminouny, SCHOOLS DIVISION OF \"Sr\" agp CERTIFICATION This is to outy that Teacher Maria L. Dela Cruz has rendered ten (10) years of continuous and dedicated service to San Lorenzo College of Technology without any record of administrative case. This certification is issued to support her application for the Loyalty Award, effective as of January 4, 2025. Perry Davenport Mining engineer"
    },
    {
        "image": "certofcash1_synth_1_aug2.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is to certify that Teacher Maria L. Dela Cruz has tendered ten BO} ears of continuous and dedicated service to San Lorenzo College of Technology without any record of administrative case. This certification fs issued to support her application for the Loyaity Award, etfective as of January 4, 2025. Perry Davenport Mining engineer"
    },
    {
        "image": "certofcash1_synth_1_aug3.png",
        "label": "certofcash",
        "ocr_text": "Aap ye ines Pegarsuent X Cancetsen REGEON 4 East Generate 3 is Oe certs y inal Teacner ears of ct wi d of admini cottfication is ‘issued io support the Loyally Award, effective as oF Sanuary 4 2 Perry Davenport Mining en:"
    },
    {
        "image": "certofcash1_synth_1_aug4.png",
        "label": "certofcash",
        "ocr_text": "Republic ofthe Dhiiopines Department of Education REGION 1 Senay SCHOOLS OIvistON OF et =i CERTIFICATION This is to certify that Teacher Maria L. Dela Cruz has rendered ten (10) years of continuous and dedicated service to San Lorenzo College of Technology without any record of administrative case. This certification is issued to support her application for the Loyalty Award, effective as of January 4, 2025. Perry Davenport Mining engineer"
    },
    {
        "image": "certofcash1_synth_1_aug5.png",
        "label": "certofcash",
        "ocr_text": "RESTON 4 tay S394 OWvision OF ee CERTIFICATION This is to eority that Teacher Maria L. Deia Cruz has rendered ten 0} years of continuous and Gedicated Service to San Lorenzo College of Technology without any record Of administrative case. This Certification fs issued to support her Spplication for Loyalty Award, effective 8 of January 4, 2025"
    },
    {
        "image": "certofcash1_synth_2_aug1.png",
        "label": "certofcash",
        "ocr_text": "Ripe doe Datos Beyarizncwd vl Coeiawes 2024 legal ons oti"
    },
    {
        "image": "certofcash1_synth_2_aug2.png",
        "label": "certofcash",
        "ocr_text": "Fel ty Service Training con ducted by ot i sie of a omputing 1 T"
    },
    {
        "image": "certofcash1_synth_2_aug3.png",
        "label": "certofcash",
        "ocr_text": "agai of Ge Vpn Beganument of Coaceteon 1 Be CERTIFICATION This is to certify that Teacher Adrian S. Torres has completed the requirec J forty (40) hours of vice Training conduc! ted by _ Martin raputing from M rch poate to 4. Tris certification is for 308e It may Serve."
    },
    {
        "image": "certofcash1_synth_2_aug4.png",
        "label": "certofcash",
        "ocr_text": "Regnier on Or Didcot BDeparient of Coecaion REGION 1 Port Seeger, NQOAS OFVISION OF oa CERTIFICATION This is to certify that Teacher Adrian S. Torres has completed the required forly (ae) hours of In Service Training conducted by St. Martin Institute of Computing from March 15, 2024 to March 19, 2024. This certification Is issued for whatever legai and official purpose it may serve. Anna Vanes Physicist, medical"
    },
    {
        "image": "certofcash1_synth_2_aug5.png",
        "label": "certofcash",
        "ocr_text": "Bepubltr of the Pbilipoines Department of Education REGION 1 PortSteyen, SCHOOLS DIVISION OF =~ CERTIFICATION This is to certify that Teacher Adrian S. Torres has completed the required forty (40) hours of In Service Training conducted by St. Martin Institute of Computing from March 15, 2024 to March 19, 2024. This certification is issued for whatever legal and official purpose it may serve. Anna Vance Physicist, medical"
    },
    {
        "image": "certofcash1_synth_3_aug1.png",
        "label": "certofcash",
        "ocr_text": "Pagaihic ot de Bilizoine Meparimeni of Chacatine ify that Te served ute of f Moder farnh, E nitippine om June 2, 2015 uy i. This certification is issued up ployee s request for"
    },
    {
        "image": "certofcash1_synth_3_aug2.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is to certify that Teacher Beatriz R. Ramos has faithfully served as a faculty member of Philippine Institute of Modern Studies from June 2, 2015 up to the present. This certification is issued upon the employee s request for employment verification. Daniel Rocha Charity officer"
    },
    {
        "image": "certofcash1_synth_3_aug3.png",
        "label": "certofcash",
        "ocr_text": "Ge Pheies a ok Shoentinn CERTIFICATION Sis 3 io cerlify that Teacher Beatriz R. Ramos has fi ithfully s ved as a fa rember of Phil lippine institute of Modern Studies from June S up to the present. This certi nis ed upon the employee s request for employment verif"
    },
    {
        "image": "certofcash1_synth_3_aug4.png",
        "label": "certofcash",
        "ocr_text": "Republic ofthe Didiopines Department of Coucation REGION 5 Riveramaatt, SCHOOLS DIVISION OF \"=,\" CERTIFICATION This is to certify that Teacher Beatriz R. Ramos has faithfully served as a faculty member of Philippine Institute of Modern Studies from June 2, 2015 up to the present. This certification is issued upon the employee s request for employment verification. Daniel Rocha Charity officer"
    },
    {
        "image": "certofcash1_synth_3_aug5.png",
        "label": "certofcash",
        "ocr_text": "Republte of the Dyaizoines ment REGION 5 Riveramoilit ‘SCHOOLS DIVISION OF CERTIFICATION This is to Certify that Teacher Beatriz R. Ramos has faithfully served as a faculty member of Philippine Institute of Modern Studies from June 2, 2015 up to the present. This certification is issued upon the employee s request for employment verification. Daniel Rocha Charity officer"
    },
    {
        "image": "certofcash1_synth_4_aug1.png",
        "label": "certofcash",
        "ocr_text": "Resch fin Binsin Api af @eesetion NG adminis yeaeen flied defore th, ity of inform OF ‘his cer tification j is issued upon p employment cord verh"
    },
    {
        "image": "certofcash1_synth_4_aug2.png",
        "label": "certofcash",
        "ocr_text": "Ragathite of sige Seltialens: Sepachment of Oraecaion CERTIFICATION This is to 'y that Teacher Jerom Pefia has no pending administrat disciplinary case filed before the of National University of information Technology. This certification is issued upon request for employment record verification."
    },
    {
        "image": "certofcash1_synth_4_aug3.png",
        "label": "certofcash",
        "ocr_text": "‘Republic of the Bbdlivoines Department of Cbucation REGION 9 East Voloton SCHOOLS DIVISION OF sa CERTIFICATION This is to certify that Teacher Jerome C. Dela Pefia has no pending administrate or disciplinary case filed before the office of National University of Information Technology. This certification is issued upon request for employment record verification. Crystal Lopez Scientific laboratory technician"
    },
    {
        "image": "certofcash1_synth_4_aug4.png",
        "label": "certofcash",
        "ocr_text": "nae os BABiesie communica Jerome ©. Dela trative Of"
    },
    {
        "image": "certofcash1_synth_4_aug5.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is to certify that Teache: er Jerome C. Dela Pefia has no pendin administrative or disciplinary case filed before the Office of National University of information Technol, This certification is issued upon request for employment record verification. Crystat Lopez Scientific laboratory tachnician"
    },
    {
        "image": "certofcash1_synth_5_aug1.png",
        "label": "certofcash",
        "ocr_text": "“Ayal tbe los Bopartwsent Ce REG’ 5 Alex CERTIFICATION acher Lianne M. Santos momber of San Lorenzo, ay under the position of oi instructor. This certification s@ of bank loan High Seno: is issued for the pu appiicat"
    },
    {
        "image": "certofcash1_synth_5_aug2.png",
        "label": "certofcash",
        "ocr_text": "Department of Coucation REGION 6 Aexandertort SCHOOLS DIVISION OF CERTIFICATION This is Ad certify that Teacher Lianne M Santos Ecfege' of techn Ogy under the position of Senior High School Instructor. This certification is issued for the purpose of bank loan application. Mark Green Geologist, wellsite"
    },
    {
        "image": "certofcash1_synth_5_aug3.png",
        "label": "certofcash",
        "ocr_text": "Bepartment of Coucation REGION 6 Aesanceca SCHOOLS DIVISION OF a CERTIFICATION This is to certify that Teacher Lianne M. Santos enz ta be} Biers techno membel of Sepostion of Senior High School Instructor. This certification is issued for the purpose of bank loan application. Mark Green Geologist, wellsite"
    },
    {
        "image": "certofcash1_synth_5_aug4.png",
        "label": "certofcash",
        "ocr_text": "rua the Bacay Taeporrtunets a“ baba aRaoy CERTIFICATION Lianne M. Santos Shae’ Sermor H is issued for the applic"
    },
    {
        "image": "certofcash1_synth_5_aug5.png",
        "label": "certofcash",
        "ocr_text": "‘Republic of the Bhdisoines Department of Coucation REGION 6 Alexandertort SCHOOLS DIVISION OF CERTIFICATION This is to certify that Teacher Lianne M. Santos is a bonafide staff member of San Lorenzo, Eoffe je af echnology under the Bost ion of rl Senior High School Instructor. This certification is issued for the purpose of bank loan application Mark Green Geologist, wellsite"
    },
    {
        "image": "certofcash1_synth_6_aug1.png",
        "label": "certofcash",
        "ocr_text": "This is to c has atiende T aching Gi conducted ai on August 2 2 f through innov: if Martin Inetitule of ig 2024. Th cation is issued 7a development record purposes."
    },
    {
        "image": "certofcash1_synth_6_aug2.png",
        "label": "certofcash",
        "ocr_text": "‘Republic ofthe Bbiinoines Department of Education REGION 4 East Crysta SCHOOLS DIVISION OF, CERTIFICATION This is to certify that Teacher Adrian P. Cruz has attended the seminar titled 'Enhancin: Teaching Competence through Innovation conducted at St. Martin Institute of Computing on August 25, 2024. This certification is Issued for professional development record purposes. Annette Harris DDS Engineer, maintenance"
    },
    {
        "image": "certofcash1_synth_6_aug3.png",
        "label": "certofcash",
        "ocr_text": "Regubler of the Dedgoincs Department of Coucation REGION 4 East Crystal SCHOOLS DIVISION OF CERTIFICATION This is to certify that Teacher Adrian P. Cruz has attended the seminar titled ‘Enhancing Teaching Competence through Innovation conducted at St. Martin Institute of Computing on August 25, 2024. This certification is issued for professional development record purposes. Annette Harris DDS Engineer, maintenance"
    },
    {
        "image": "certofcash1_synth_6_aug4.png",
        "label": "certofcash",
        "ocr_text": "Ragahic of te DYiavins Bepartment of Eoucation REGION 4 East COBRBS 01 scHOOLS DIVISION OF, CERTIFICATION ify that Teacher Adrian P. Cruz t seminar titled ‘Enhancing Teaching Competence through Innovation in Institute of Computing on August 25, 2024. This certification is issu for professional development record purposes. Annette Harris DDS Engineer, maintenance"
    },
    {
        "image": "certofcash1_synth_6_aug5.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is to certify that Teacher Adrian P. Cruz has attended the seminar titled ‘Enhancing eer mg Competence through Innovation conducted at St. Martin Institute of Computing on punt 25, 2024. This certification is issue for professional development record purposes: Annette Harns DDS: Engineer, maintenance"
    },
    {
        "image": "certofcash1_synth_7_aug1.png",
        "label": "certofcash",
        "ocr_text": "seg a te Bisons Mewes ‘aiken of Seaention R. Ramos Phiiopine 20it 7 noe cerifi Sear iGadvent"
    },
    {
        "image": "certofcash1_synth_7_aug2.png",
        "label": "certofcash",
        "ocr_text": "Basie ofthe BMiantiey Biepas aren"
    },
    {
        "image": "certofcash1_synth_7_aug3.png",
        "label": "certofcash",
        "ocr_text": "hic of ae BR Begarsaeat of Chacdicn This is to certify the has been officia institule of Modern S ig currently hol Sgience INS, 3h Feaues! 10"
    },
    {
        "image": "certofcash1_synth_7_aug4.png",
        "label": "certofcash",
        "ocr_text": "Bepollic of de Bbiioines al ak Soncation is to cert tal Teaches Beaiiz R. Ramos been off Philippine f une 10, 2047 iign is iss a verticaton f parpos"
    },
    {
        "image": "certofcash1_synth_7_aug5.png",
        "label": "certofcash",
        "ocr_text": "Depart REGION 10 Me SchoOLS olvistonrar CERTIFICATION This is to Certify that Teacher Beatriz R has been o Ramos fficially Employed under Philippine Institute of Modern Studies since June 1 2017 and is Currently holdin the position of Computer cience lostructor. This dveligation is issued Upon request for record and veri Cation i Earl Wang Food technologist"
    },
    {
        "image": "certofcash1_synth_8_aug1.png",
        "label": "certofcash",
        "ocr_text": "Sage af the Bpteemtee Bpartment of Chucatien CERTIFICATION This is to certify that Teacher Maria L. Dela Cruz fee satisfactori ily ore the ae requirements and academic year 2024. iesued Tor Ree Veterinary"
    },
    {
        "image": "certofcash1_synth_8_aug2.png",
        "label": "certofcash",
        "ocr_text": "Regal of he Bhtapines Bepartment of Coucation REGION 6 Kellerborough, SCHOOLS DIVISION OF cm. CERTIFICATION This is to certify that Teacher Maria L. Dela Cruz has satisfactorily completed the academic requirements and duties assigned during the academic year 2024 2025. This certification is issued for reference and documentation purposes. Yvonne Miller Veterinary surgeon"
    },
    {
        "image": "certofcash1_synth_8_aug3.png",
        "label": "certofcash",
        "ocr_text": "‘Republic of the Bhdiopines Department of Education REGION 6 Ketervorqugh, SCHOOLS DIVISION Of sn CERTIFICATION This is to certify that Teacher Maria L. Dela Cruz has satisfactorily completed the academic requirements and duties assigned during the academic year 2024 20285. This certification is issued for reference and documentation purposes. Yvonne Miller Veterinary surgeon"
    },
    {
        "image": "certofcash1_synth_8_aug4.png",
        "label": "certofcash",
        "ocr_text": "Bepubli of te Bhaivoines Department of Ebucation REGION 6 _Kelerborau, SCHOOLS DIVISION Of == CERTIFICATION This is to certify that Teacher Maria L. Dela Cruz has satisfactorily completed the academic requirements and duties assigned during the academic year 2024 2025. This certification is issued for reference and documentation purposes. Yvonne Miller Veterinary surgeon"
    },
    {
        "image": "certofcash1_synth_8_aug5.png",
        "label": "certofcash",
        "ocr_text": "“Bucpubltr of the Bbdipoincs Department of Education REGION 6 _ Kelerborqugh, SCHOOLS DIVISION OF, CERTIFICATION This is to certify that Teacher Maria L. Dela Cruz has satisfactorily completed the academic requirements and duties assigned during the academic year 2024 2025. This certification is issued for reference and documentation purposes. Yvonne Miller Veterinary surgeon"
    },
    {
        "image": "certofcash1_synth_9_aug1.png",
        "label": "certofcash",
        "ocr_text": "Republic of the Dhdivpines Department of Education REGION 4 Janetpggt, SCHOOLS DIVISION OF CERTIFICATION This is to certify that Teacher Jerome C. Dela Pefia has rendered satisfactory service to National University of Information Technology as a classroom teacher for the past five (5) years. This certification is issued to support his application for promotion. Jesse Smith Chief Operating Officer"
    },
    {
        "image": "certofcash1_synth_9_aug2.png",
        "label": "certofcash",
        "ocr_text": "public of te Dhiioines Bepartment of Coucation ne REGION 4 CERTIFICATION This is to certify that Teacher Jerome Cc. Dela Pefia has rendered satisfactory Serer to echnology as National University of Information 1 a classroom teacher for the past five ‘S) years. This certification is issued to support his application for promotion. Jesse Smith Chief Operating Officer"
    },
    {
        "image": "certofcash1_synth_9_aug3.png",
        "label": "certofcash",
        "ocr_text": "CERTIFICATION This is to certify that Teacher Jerome C Peta has rendered satisfactory servic National University of infarmation Technol a cla om teacher for the past five (5) ye: This certification is issued to support his ation for promotion."
    },
    {
        "image": "certofcash1_synth_9_aug4.png",
        "label": "certofcash",
        "ocr_text": "Raanite af ye Meo Breyar ment of Cbucation CERTIFICATION This is to certify that Teacher Jerome C. Dela Pefa has rendered sfimation Technok to National University of information Technology as a classroom teacner for the past five (5) years. This certification is issued te support his application for promotion. Jesse Smith Chief Operating Officer"
    },
    {
        "image": "certofcash1_synth_9_aug5.png",
        "label": "certofcash",
        "ocr_text": "otifiy Ort This ts to é ech past five (hy sued te SUPDO ation. nology as ears."
    }
]