[
    {
        "image": "chedro1_synth_10_aug1.png",
        "label": "chedro",
        "ocr_text": "Republic Philippines at ON HIGHER EDUCATION ONAL a Office of the Presid: IMISSIO CHEDRD Series oF is) PUS ORDINATORS Su Date: Date wae nnnwnee nn the infory Pursuant to the policies cont tion earance fror ihe contact LY VELASQUEZ. val Director LLM CHED Regional Office iti"
    },
    {
        "image": "chedro1_synth_10_aug2.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines j $s ESET Office of the President co t.. ES Won 4 A COMMISSION ON HIGHER EDUCATION October 25, 2025 bs CHED REGIONAL OFFICE it cotter i, Dontada Maonpege! Goverment Comer, Mamps. Son Femende, Pampers odor’ fhe 13 2528 Emait: dromsey onhillipsword net CED Rapena Tel. No.: (05 6 IEMORANDUN ORDER NO. CHEDRO Series of 2025 To: TO. CHEDRO CAMPUS COORDINATORS Subject: RY ACADEME INTERNSHIPS SUBJECT GUIDELINES FOR iNDUSTI Date: 25 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Cffice, the folowing advisories are hereby issued for the information and guidance of alt concerned. {. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 11, 2025. 2. Ensure alignment of institutional plans wil 3. For activities requiring face to face conduct, post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coc: via the contact details indicated above. ith the Philippine Qualifications Framework secure pricr clearance from jocat {ATF units and submit dinate with the Monitoring and Evaluation Unit for clarifications SHELLY VELASQUEZ, LL M, Regional Director CHED Regional Office Ii!"
    },
    {
        "image": "chedro1_synth_10_aug3.png",
        "label": "chedro",
        "ocr_text": "Republic of the F Office of the P C OMMISSION ON HIGHER EDUCATION A an os LLE ASE F \"od here Or wo RO CAMPUS COORDINATORS Subject: SUBJECT GUIDELINES FoR INDUSTRY ACAD Date: October 2925 Pursuan Regional of this ncemed ONS af@ requested to submit the: stem not mber 74, 2025, ent of institution: Feparts through the CHED! ORO O Or Document Tracking th the Philippine Quali ions Framework. induct, secure prior clearance from te ive (5) working days. nd wide dissemination, i details indicated above. pos! ity “reports wit! hin fi For compliance via fhe LLM. Director Regional Gfice itt"
    },
    {
        "image": "chedro1_synth_10_aug4.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines p Co LE A S ar Office of the President COMMISSION ON HIGHER EDUCATION October 25, 2025 CHED REGIONAL OFFICE III Tel. No.: (06) 693 2528 Email: dramsey phillipsworld net CHEDRO MEMORANDUM ORDER NO. Series of 2025 To: TO CHEDRO CAMPUS COORDINATORS Subject: SUBJECT GUIDELINES FOR INDUSTRY ACADEME INTERNSHIPS Date: 25 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned. 1. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 11, 2025. 2. Ensure alignment of institutional plans with the Philippine Qualifications Framework. 3. For activities requiring face to face conduct, secure prior clearance from local [ATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaluation Unit for clarifications via the contact details indicated above. SHELLY VELASQUEZ, LL M. Regional Director CHED Regional Office II!"
    },
    {
        "image": "chedro1_synth_10_aug5.png",
        "label": "chedro",
        "ocr_text": "SOLEASE ra SO po Bas AHO CHEORO Seres of To: INDUSTF WTERNSHIPS rough the Ch nce and ntact deta’ above."
    },
    {
        "image": "chedro1_synth_1_aug1.png",
        "label": "chedro",
        "ocr_text": "ON INSTITUT (HED PRESIDENTS Pursuant te the p al Office ali Issued for the jy didated Sand sun Unit for KATHRYN gir"
    },
    {
        "image": "chedro1_synth_1_aug2.png",
        "label": "chedro",
        "ocr_text": "woe Pa FHER EDD clanac ations aa 49 art fo"
    },
    {
        "image": "chedro1_synth_1_aug3.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines ta cr Office of the President c L EAS 324 Nr COMMISSION ON HIGHER EDUCATION October 24, 2025 CHED REGIONAL OFFICE VII CHED Regional Office Vil, Sudion, Lahug, Cebu City GCHEDRO Ww Tel. No.: (08) 362 6770 Email: asmith fdcapital ph MEMORANDUM ORDER NO. CHEDRO ry Series of 2025 To: TO PRIVATE HIGHER EDUCATION INSTITUTION (HEI) PRESIDENTS Subject: SUBJECT SUBMISSION OF MIDYEAR ENROLLMENT REPORTS 24 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned. 1. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 11, 2025. 2. Ensure alignment of institutional plans with the Philippine Qualifications Framework. 3. For activities requiring face to face conduct, secure prior clearance from local [ATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaluation Unit for clarifications via the contact details indicated above. KATHRYN LI, PH D. Regional Director CHED Regional Office VII"
    },
    {
        "image": "chedro1_synth_1_aug4.png",
        "label": "chedro",
        "ocr_text": "CLEASeE re Qetober 24, 2025 guéore i Republic of the Phiippines Gflice of the President My COMMISSION ON HIGHER EDUCATION &. HAL OFFICE V8 ie MEMORANOUM ORDER NG CHEDRO Series of 2025 PRESHE, EDUCATION INST PTUTION (HED To fO PRIVATE HIGi Subject: SUBJECT SUBMISSION OF MIDYEAR ENROLLMENT REPORTS Date the Commission on Higher Educa’ in view of the ongoing initiatives of concerned. d guidance Ondine Decument Tracking nformation 2 ai Office, the following advisories are hereby issued for the idated reports through the CHEDRO consolidal 4. inelitutions are reques: dito submit t 44, 2028. onal plans with the Philippine Qu jifications Framework. face conduct, secure prior clearance from local (ATF units and submit five (5) working days. fion. Kindly coordinate th the MV ring and Evaluation Unit for clari KATHRYN LI, PH D. ector Regional CHED R nal Office Vil"
    },
    {
        "image": "chedro1_synth_1_aug5.png",
        "label": "chedro",
        "ocr_text": "PST aaa CHER MEMORANDA. NO. Series of 2625 Tor TO PRIVATE HIGHER EDUCATION INSTITUTION Subject: SUBJECT Date: 2d October ris on Higher Education and in view of the ongoing initiatives of this Pursuant to the policies of the a ories are hereby issued for the information and guidance of all conce ned Rayional Office, the following adv iions are requested te submit their consoidated reports through the Cr vember 11, 2025. tutional plans with the F og to face conduct within five (5) working di. ine Document Tracking System not later than Ne 2. Ensure alignment of ir and subreit cnordinate with the Monitoring and Evaluation Unit for Garfications 2 dissemination. Kin dicated above. compliance and w he contact det: KATHRYN LI, PH D. Regional Director CHED Ragional 0% fice Vii"
    },
    {
        "image": "chedro1_synth_2_aug1.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines p & cr Office of the President c LEAS a Yr COMMISSION ON HIGHER EDUCATION october 25, 2025 CHED REGIONAL OFFICE , GHEDRO it CHED Regional Office |, City of San Femando, La Union Tel. No. (09) 378 9788 Email hayesapril wluconstruction com ph oO MEMORANDUM ORDER NO. a3 CHEDR' Series of 2025 To: TO DIRECTORS OF CHED RECOGNIZED HIGHER EDUCATION INSTITUTIONS Subject: SUBJECT SUBMISSION OF MIDYEAR ENROLLMENT REPORTS Date 25 October 2025 \\going initiatives of this dance of all concerned. ent Tracking n and in view of the on: information and gui rough the CHEDRO Online Docum icies of the Commission on Higher Educatio! following advisories are hereby issued for the i uested to submit their consolidated reports th November 20, 2025. f institutional plans with the Outcomes Based Quality Assurance. ing face to face conduct, secure prior clearance from local ATF units and submit hin five (5) working days. n, Kindly coordinate with the Monit Pursuant to the poli Regional Office, the 4. Institutions are req System not later than 2. Ensure alignment o' 3. For activities requiri post activity reports wit oring and Evaluation Unit for clarifications and wide disseminatior For compliance etails indicated above. via the contact d KAREN GARCIA, DBA Regional Director CHED Regional Office |"
    },
    {
        "image": "chedro1_synth_2_aug2.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines CLE A SE rm vom [Oe a Office of the President C OMMISSION ON HIGHER EDUCATION October 25, 2025 CHED REGIONAL OFFICE CHED Regional Office I, City of San Femando, La Union GCHEDRO Ww Tel No (09) 378 9788 Email hayesapni wluconstruction com ph MEMORANDUM ORDER NO CHEDRO uM Series of 2025 To: TO DIRECTORS OF CHED RECOGNIZED HIGHER EDUCATION INSTITUTIONS. Subject: SUBJECT SUBMISSION OF MIDYEAR ENROLLMENT REPORTS Date: 25 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned 4. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 20, 2025. 2. Ensure alignment of institutional plans with the Outcomes Based Quality Assurance 3. For activities requiring face to face conduct, secure prior clearance from local IATF units and submit post activity reports within five (5) working days For compliance and wide dissemination. Kindly c via the contact details indicated above coordinate with the Monitoring and Evaluation Unit for clarifications KAREN GARCIA, DBA Regional Director CHED Regional Office |"
    },
    {
        "image": "chedro1_synth_2_aug3.png",
        "label": "chedro",
        "ocr_text": "Office of the President COMMISSION ON HIGHER EDUCATION October 25, 2025 CHED REGIONAL OFFICE HED Regional Office |, SY ‘of San Femando, Lo Union gree exp i t Tet. No.: (03) 278 0788 Email hayasapni wiuconstructon com Dh Republic of the Philippines rs CLE A SE y i? ,ANDUM ORDER NO. rey CHEDRO YEMOP Series of 2625 TORS OF CHED RECOGNIZED HIGHER EDUCATION INSTITUTIONS To: TO: DIREC Subject: SUBJECT SUBMISSION OF MIDYEAR ENROLLMENT REPORTS Date: 25 October 2025, view of the ongoing initiatives of this guidance of ali concerned. on Higher Education and in ent Tracking py issued fol tha information and sted to submit their consolidated reports through the CHEDRO Online Docum ber 20, 2025 ie Outcomes Based Quality Assurance ance from locat {ATF units and submit Commissio the following advise: jes are here! Pursuant to the poticies of the Regional Office, 4, Institutions are reque’ System not later than Novett 2. Ensure alignment of institutional plans with th 3. For activities requiring face to face conduct, S post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaluation Unit via the contact details indicated above. ecure prior cleat for clarifications KAREN GARCIA, DBA Ragional Director CHED Regional Office |"
    },
    {
        "image": "chedro1_synth_2_aug4.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines op Ame Office of the President CLEASE Y COMMISSION ON HIGHER EDUCATION CHED REGIONAL OF FICE 1 GHED Ragional Office |, City of San Fernando, La Union oedore Hi Tel No.. (09) 378 9788 Email: hayesapril wluconsiruction com ph October 26, 2025 MEMORANDUM OROER NO CHEDRO upon’ Series of 2025 To: TO: DIRECTORS OF CHED RECOGNIZED HIGHER EDUCATION INSTITUTIONS Subject: SUBJECT SUBMISSION OF MIDYEAR ENROLLMENT REPORTS 25 October 2025 Pursuant to the policies of the Cominission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned. 1. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 20, 2025. 2. Ensure alignment of institutional plans with the Outcomes Basad Quality Assurance. 3. For activities raquiring face to face conduct, secure prior clearance from local IATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaluation Unit for clarifications via the contact details indicated above. KAREN GARCIA, DBA Regiona! Director CHED Regional Office |"
    },
    {
        "image": "chedro1_synth_2_aug5.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines £ LE A Ss Tr Office of the President i COMMISSION ON HIGHER EDUCATION October 25 2025 CHED REGIONAL OFFICE i CHED Regional Office |, City of San Femando, La Union CHEDRL wm Tel No (09) 378 9788 Email hayesapni wluconstruction com ph MEMORANDUM ORDER NO CHEDRO a Series of 2025 To: TO DIRECTORS OF CHED RECOGNIZED HIGHER EDUCATION INSTITUTIONS Subject: SUBJECT SUBMISSION OF MIDYEAR ENROLLMENT REPORTS Date: 25 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned 1. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 20, 2025. 2. Ensure alignment of institutional plans with the Outcomes Based Quality Assurance. 3. For activities requiring face to face conduct, secure prior clearance from local |ATF units and submit Post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaluation Unit for clarifications via the contact details indicated above. KAREN GARCIA, DBA Regional Director CHED Regional Office |"
    },
    {
        "image": "chedro1_synth_3_aug1.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines oO A T, Office of the President cL Les S mm re COMMISSION ON HIGHER EDUCATION CHED REGIONAL OFFICE XI a CHED Regional Office XI, Dakudao Loop, Davao City CHEDRO Wt Tel. No.: (06) 935 4918 Email: megan61 yebanking ph October 31, 2025 MEMORANDUM ORDER NO. CHEDRO uM Series of 2025 To: TO PRESIDENTS HEADS OF STATE UNIVERSITIES AND COLLEGES Subject: SUBJECT IMPLEMENTATION OF FLEXIBLE LEARNING MODALITIES Date: 31 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned. 1. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 13, 2025. 2. Ensure alignment of institutional plans with the Learning Continuity Roadmap. 3. For activities requiring face to face conduct, secure prior clearance from local [ATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaluation Unit for clarifications via the contact details indicated above. LORI ANDERSON, PH D. Regional Director CHED Regional Office XI"
    },
    {
        "image": "chedro1_synth_3_aug2.png",
        "label": "chedro",
        "ocr_text": "Office of the President Republic of the Philippines p CL LEAS Tr COMMISSION ON HIGHER EDUCATION October 31 2025 CHED REGIONAL OFFICE XI CHED Regional Office XI, Dakudao Loop, Davao City GHEDRO iT] Tel. No.: (06) 935 4918 Email: megan61 yebanking ph UM ORDER NO. CHEDRO MEMORAND! ae Series of 2025 To: TO PRESIDENTS HEADS OF STATE UNIVERSITIES AND COLLEGES Subject: SUBJECT IMPLEMENTATION OF FLEXIBLE LEARNING MODALITIES Date: 31 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned. 1. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 13, 2025. 2. Ensure alignment of institutional plans with the Learning Continuity Roadmap. 3. For activities requiring face to face conduct, secure prior clearance from local IATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaluation Unit for clarifications via the contact details indicated above. LORI ANDERSON, PH D. Regional Director CHED Regional Office XI"
    },
    {
        "image": "chedro1_synth_3_aug3.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines p ss LE A Ss ad rT Office of the President COMMISSION ON HIGHER EDUCATION October 31, 2025 CHED REGIONAL OFFICE XI CHED Regional Office X!, Dakudao Loop, Davao City CHEDRO iW Tel. No: (06) 935 4918 Email: megan61 yebanking ph IEMORANDUM ORDER NO. CHEDRO ™! Series of 2025 TO PRESIDENTS HEADS OF STATE UNIVERSITIES AND COLLEGES To: Subject: N OF FLEXIBLE LEARNING MODALITIES SUBJECT IMPLEMENTATIO! Date: 31 October 2025 n and in view of the ongoing initiatives of this he information and guidance of all concerned. e Document Tracking ommission on Higher Educator issued for t it their consolidated reports through the CHEDRO Onlin Pursuant to the policies of the C Regional Office, the following advisories are hereby i 4. Institutions are requested to submi System not later than November 13, 2025. 2. Ensure alignment of institutional plans with the Learning Continuity Roadmap. 3. For activities requiring face to face conduct, secure prior clearance from local |ATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coor via the contact details indicated above. dinate with the Monitoring and Evaluation Unit for clarifications LORI ANDERSON, PH D. Regional Director CHED Regional Office X!"
    },
    {
        "image": "chedro1_synth_3_aug4.png",
        "label": "chedro",
        "ocr_text": "4 ORDER NO. Po: TO° PRESIDENTS; OF STATE UNIVE NTATION OF FLEXIBLE les of the Commission on Higher Education the following advisor fonal plans with the Learning Contin to face conduc fs and si ications LOR! ANDERSON, PH 0. Regional Director EDR Office Xt glen,"
    },
    {
        "image": "chedro1_synth_3_aug5.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines p i cA cf Office of the President S LES LS pee Yr COMMISSION ON HIGHER EDUCATION Gann AAG CHED REGIONAL OFFICE XI a CHED Regional Office XI, Dakudao Loop, Davao City CHEDRO Ww Tel. No.: (06) 935 4918 Email: megan61 yebanking ph MEMORANDUM ORDER NO. CHEDRO a Series of 2025 To: TO PRESIDENTS HEADS OF STATE UNIVERSITIES AND COLLEGES Subject: SUBJECT IMPLEMENTATION OF FLEXIBLE LEARNING MODALITIES 31 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned. 4. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 13, 2025. 2. Ensure alignment of institutional plans with the Learning Continuity Roadmap. 3. For activities requiring face to face conduct, secure prior clearance from local IATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaluation Unit for clarifications via the contact details indicated above. LORI ANDERSON, PH D. Regional Director CHED Regional Office XI"
    },
    {
        "image": "chedro1_synth_4_aug1.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines on oe rm we Office of the President a LEA SE ry COMMISSION ON HIGHER EDUCATION October 25, 2025 4 CHED REGIONAL OFFICE y ice V, Rawis, Legazpi City, Albay 12 Email lawrencemarc pkjy, ph GhdoRe i i i CHEDRO MEMORANDUM ORDER No. Series of 2025 To: To DIRECTORS OF CHED RECOGNIZED HIGHER EDUCATION INSTITUTIONS Subject: SUBJECT CONDUCT oF FACULTY DEVELOPMENT WEBINARS Date 25 October 2025 Xrwrnmee waren nnn en Pursuant to the poticj S of the Commission on Higher Edu: Regionai Office, the following advisories are hereby issu, 1. Institutions are requested to submit thes System not tater than November 17. 2025, 2. Ensure alignment of in; Stitutional plans with 3. For activities requiring face.: cation and in view of ed for the information ed reports through the cy the Ongoing initiatives Of this aNd guidance of aij concerned, HEORO Online Document CONSolidai t Tracking the Learning Continy ity Roadmap, to face conduct, Secure prior Clearance from local {ATF units and Submit post activity feports within five (5) Working days. For compliance and Wide disseming tien, Kindly Coordinate with via the contact details indicated above, the Monitoring and Evalustion Unit for clatitications PATRICK HARRINGTON, LOM. Regional Oirector CHED Regional Office V"
    },
    {
        "image": "chedro1_synth_4_aug2.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines .o), ro Office of the President cL L EA. Ss mt COMMISSION ON HIGHER EDUCATION October 25, 2025 CHED REGIONAL OFFICE V i CHED Regional Office V, Rawis, Legazpi City, Albay GHEDRO mW Tel. No.: (06) 223 0092 Email: lawrencemark kjv ph MEMORANDUM ORDER NO CHEDRO an Series of 2025 To: TO DIRECTORS OF CHED RECOGNIZED HIGHER EDUCATION INSTITUTIONS Subject: SUBJECT CONDUCT OF FACULTY DEVELOPMENT WEBINARS Date: 25 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned. 4. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 17, 2025. 2. Ensure alignment of institutional plans with the Learning Continuity Roadmap. 3. For activities requiring face to face conduct, secure prior clearance from local |ATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaluation Unit for clarifications via the contact details indicated above. PATRICK HARRINGTON, LL M. Regional Director CHED Regional Office V"
    },
    {
        "image": "chedro1_synth_4_aug3.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines j LLE ASE; Office of the President c L Es Ss PY COMMISSION ON HIGHER EDUCATION October 25, 2025 CHED REGIONAL OFFICE v CHED Regional Office V, Rawis Legazpi City, Albay CHEDRY Ww Tel No (06) 223 0092 Email lawrencemark kyv ph MEMORANDUM ORDER NO CHEDRO M Series of 2025 To: TO DIRECTORS OF CHED RECOGIIZED HIGHER DUCATION INSTITUTIONS Subject SUBJECT CONDUCT OF FACULTY DEVELOPMENT WEBINARS Date: 25 October 2025 quested to submit their consoli in November 17, 2025 System not later tha 2. Ensure alignment of institutional plans with the Learnini 3. For activities requiring face to face conduct, secure pri Post activity reports within five (5) working days. For compliance and wide dissemination Kindly coordinate with the Monitoring and Evaluation Unit for Clarifications via the contact details indicated above. ig Continuity Roadmap lor clearance from local |ATF units and submit PATRICK HARRINGTON, LL M Regional Director CHED Regional Office V"
    },
    {
        "image": "chedro1_synth_4_aug4.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines 5 ELE A Sr n a Office of the President COMMISSION ON HIGHER EDUCATION October 25, 2025 CHED REGIONAL OFFICE V re, Office V, Rawis, Legazpi City, Albay oudoRreo ist CHED Ragionat Tet. No. (06) 223 0092 Email tawrencemork kiv. pn JORANDUM ORDER NO. CHEDRO MEM Series of 2025 To: TO. DIRECTORS OF CHED RECOGH 4ZED HIGHER EQUCATION INSTITUTIONS Subject: F FACULTY DEVELOPMENT WEBINARS SUBJECT CONDUCT ol 28 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing Regional Office, the following advisories are hereby issued for the information and guidance of ail concerned. 4. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not laier than Novernber 17, 2025. 2. Ensure alignment of institutions! plans with the Learning Continuity Roadmap. 3, For activities requiring face to face conduct, secure prior clearance from Jocal AT post activity seports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaiuati via the contact details indicated above. F units and submit ion Unit for clarifications PATRICK HARRINGTON, LLM. Regional Director CHED Regional Office v"
    },
    {
        "image": "chedro1_synth_4_aug5.png",
        "label": "chedro",
        "ocr_text": "Repub! Philippir Office of the Preside COMMISSION ON HIGHER EDUCATION ober 25, 20) a SHEDRY CHEDRO Series oF £2905 ORS OF CHED RECOGHIZED HIGHER ED SUBJECT CONDUC fon ar qu through the CHEDRO Online Document Trae! with the Lear Roadmap. ace conduct, warkin g and submit tram local IATF uni ys Unit for For compl coordi be ion. ations"
    },
    {
        "image": "chedro1_synth_5_aug1.png",
        "label": "chedro",
        "ocr_text": "wo a ne ee DUM ORDER NO. Sei S To: TO: MIRECTORS OF RECOGNIZED HIGHER EDUCATION INSTITUTIONS SUBJEC DIMPLEM F FLEX? LEARNIN ODALITIES 31 October 2 ducation and view of the ongoing initigtives of ued for the inf af mand gu e of all con ad reports throt IRG Online O For comp! ations via the RICKARD CIS! Regional Director Regional ¢"
    },
    {
        "image": "chedro1_synth_5_aug2.png",
        "label": "chedro",
        "ocr_text": "fthe Philippines of the President ON HIGHER EDUCATION F F petaber $1, 2028 GHEDRO iit Repune (EMORANDUM ORDER NO. cHEepRe FO 48 jes OF 2025, Tou Subject: NTATION GF SUBJECT IMPLEN 31 Cobar 2025 g intiatives of of all con 1@ Document Tre the orig on. on Higher Education and in view of esvied for tha information and g ned. s are hereby ions are requested to submit ther consolidated reports through the CHEDRO C ber 16, 2025. tional plans with the Ouicomes Based Quality Assurance. atoface conduct, secure prior clearance from local IATF us days. ly coordinate with the Moniior ivity reports W: rifications: ing and Evaluation rst for clarficgt! and wide disse ARD CISNEROS, PH. O. Regional Director 3 Regional Office ws"
    },
    {
        "image": "chedro1_synth_5_aug3.png",
        "label": "chedro",
        "ocr_text": "c ofthe Philippines or gos gon A Et ERO taper, of the President pile ASE TY, Bensed 5 Mapet Becn 4 COMMISSION ON HIGHER EDUCATION ‘ October 31, 2025 “andore 11 Tal. No. CHEDRO Series of 2028 RAND C 4 To: $uU ECT IMPLEMENTATION OF FLEXIBLE LEARN! of the Commission ont ise, the following advisories are her fier Education and in view of the on y issued for the information and guidan iS] of all conce: re requesied to s /siem not later than November 18, 2025 ignment of institutional plans with the ies requiring face. reports wi rail their consolid. reports through the CHEDRO Online Document Tracking S: ased Quality Assurance prior ciearance from iocal ATF units and submit posi ae! vorking days. For compliance and wide dissemination Kindly coordinate with the Moni fy ing and Evalu via the contact detalis fon Unit for clay SHARD CISNERO: Regional Direct SHED Regional Office Xi PH D."
    },
    {
        "image": "chedro1_synth_5_aug4.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines , ca cT Office of the President ES LEA rm COMMISSION ON HIGHER EDUCATION october 31, 2028 CHED REGIONAL OFFICE XI CHED Regional Office Xi, Dakudao Loop, Davao City cHeD RO I javentures org. ph i: Tel. No.: (05) 991 9722 Email: kramirez@) MEMORANDUM ORDER NO. CHEDRO Series of 2025 IER EDUCATION INSTITUTIONS TO DIRECTORS OF CHED RECOGNIZED HIGHT To: Subject: F FLEXIBLE LEARNING MODALITIES SUBJECT IMPLEMENTATION fe) 31 October 2025 igher Education and in view of the ongoing initiatives of this by issued for the information and guidance of all concerned. Pursuant to the policies of the Commission on Hi dated reports through the CHEDRO Online Document Tracking Regional Office, the following advisories are here! 4. Institutions are requested to submit their consolit System not later than November 18, 2025. 2. Ensure alignment of institutional plans with the 3. For activities requiring face to face conduct, secure post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinat via the contact details indicated above. uality Assurance. Outcomes Based Q from local |ATF u prior clearance nits and submit ‘e with the Monitoring and Evaluation Unit for clarifications RICHARD CISNEROS, PH D. Regional Director CHED Regional Office xl"
    },
    {
        "image": "chedro1_synth_5_aug5.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines 4 -% office of the aa a LEAS a TY COMMISSION ON HIGHER EDUCATION october 31, 2025 4 CHED REGIONAL OFFICE XI GHEDRO i ao Loop, Davao city @javentures: org ph CHED Regional Office Xi, Dakud Tel. No. (05) 991 9722 Email: kramirez( IDUM ORDER NO. 49 CHEDRO MEMORAN! series of 2025 TO DIRECTORS OF CHED RECOGNIZED HIGHER EDUCATION INSTITUTIONS To: DALITIES EXIBLE LEARNING MO! Subject: SUBJECT IMPLEMENTATION OF FLI 31 October 2025 ing initiatives of this nce of all concerned. Document Tracking ew of the ongoil d for the information and guidat DRO Online ports through the CHE! ion on Higher Education and in vi are hereby issue onsolidated ret the Commissi the following advisories ested to submit their ct November 18, 2025. institutional plans with the Outcomes Based ing face to face conduct, secure prior clearanct to the policies of Pursuant Regional Office, 4. Institutions are requ System not later than 2. Ensure alignment Quality Assurance. 3, For activities requir e from local IATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and via the contact details indicated above. Evaluation Unit for clarifications RICHARD CISNEROS, PH D. Regional Director CHED Regional Office X!"
    },
    {
        "image": "chedro1_synth_6_aug1.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines .o-; Office of the President CLEA SEY COMMISSION ON HIGHER EDUCATION October 30, 2025 CHED REGIONAL OFFICE x YOU NO. CHEDRO MEMORANE Mt ORDER Series of 2025 To: To CHEDRO CAMPUS, COORDINATORS Subject SUBJECT CALL FOR NOMINATIONS TO THE REGIONAL QUALITY AWARDS Date 30 October 2025 lion and guidance of all concerned. ed reports through the CHEDRO Online Document Tracking vember 18, 2025, 2. Ensure alignment of Institutional Plans with the Outcomes Baseg Quality Assurance 3. For activities requiring face to face Conduct, secure Prior clearance from local |ATF units and submit Post activity feports within five (5) working days, For compliance and wide dissemination, Kin via the contact details indicated above JARED CLAYTON, ED D. Regional Director CHED Regional Office x"
    },
    {
        "image": "chedro1_synth_6_aug2.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines Mice of the esident COMMES SSION an HIGHE R EDUCATION SONAL OFFICE X ices Bese. ) he ie Oro City yogies. og ph Tel. No. (62) 123 SER NO. CHEDEO Series of Ta: 7O CHEDRG CAMPUS Subject: JONAL GUALITY AWARDS NS TO THE Ri SUBJECT CALL FOR NOMINAT Date: 20 Qeiober 2025 ong niliatives of this guidance af all concerned her Education andi in view of the ssued for the information her ORG Online Document Tracking solidated reparis through the Ch System not later 2. Ensure alignment of instit 3, For activities requiring face to- post activity reports with! For compliance and wide dissemi a the contact details indicated a th the Quicomes Based Quality Assurance. a TATE units and submit Unit for clar isations ve. Regional Duector CHED Ragicnal Offic"
    },
    {
        "image": "chedro1_synth_6_aug3.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines 5 ais Office of the President aE EAS ery COMMISSION ON HIGHER EDUCATION CHED REGIONAL OFFICE x October 30, 2025 CHEORG 11; MEMo} \\NDUM ORD) R CHEDRO MEWoRAVOUM ORDER No Series of 2025 To: To CHEDRO. CAMPUS COORDINATORS Subject: SUBJECT CALL FOR NOMINATIONS TO THE REGIONAL QUALITY AWARDS Date 30 October 2025 lation, Kindly Coordinate with the it ils indicated above. Monitoring and Evaluation Unit for Clarifications JARED CLAYTON, ED D. Regional Director CHED Regional Office x"
    },
    {
        "image": "chedro1_synth_6_aug4.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines Oe aad] Office of the President a LEAS Yr COMMISSION ON HIGHER EDUCATION CHED REGIONAL OFFICE X CHED Regional Office X, Corales Ave., Cagayan de Oro City CHEDRO iW Tel. No.: (02) 123 4339 Email: murraycolin rictechnologies org ph October 30, 2025 CHEDRO MEMORANDUM ORDER NO. Series of 2025 To: TO CHEDRO CAMPUS COORDINATORS Subject: SUBJECT CALL FOR NOMINATIONS TO THE REGIONAL QUALITY AWARDS Date: 30 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned. 1. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 18, 2025. 2. Ensure alignment of institutional plans with the Outcomes Based Quality Assurance. 3. For activities requiring face to face conduct, secure prior clearance from local IATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaluation Unit for clarifications via the contact details indicated above. JARED CLAYTON, ED D. Regional Director CHED Regional Office X"
    },
    {
        "image": "chedro1_synth_6_aug5.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines 5 j ctr Office of the President LEAS eae é COMMISSION ON HIGHER EDUCATION amber 30, 2028 CHED REGIONAL OFFICE X s Ave., Cagayan de Oro City GHEDRO am CHED Regional Office X, Corale Tel. No.: (02) 423 4339 Email murraycolin rictechnologies. org ph MEMORANDUM ORDER NO. CHEDRO Series of 2025 To: TO CHEDRO CAMPUS COORDINATORS Subject: SUBJECT CALL FOR NOMINATIONS TO THE REGIONAL QUALITY AWARDS 30 October 2025 e ongoing initiatives of this d guidance of all concerned. sument Tracking igher Education and in view of thi by issued for the information an Pursuant to the policies of the Commission on Hi through the CHEDRO Online Doct Regional Office, the following advisories are here! 4. Institutions are requested to submit their consolidated reports System not later than November 48, 2025. 2. Ensure alignment of institutional plans with the Outcomes Based Quality Assurance. 3. For activities requiring face to face conduct, secure prior clearance from local |ATF units and submit post activity reports within five (5) working days. ation. Kindly coordinate with the Monitoring and Evaluation Unit For compliance and wide dissemin via the contact details indicated above. for clarifications JARED CLAYTON, ED D. Regional Director CHED Regional Office X"
    },
    {
        "image": "chedro1_synth_7_aug1.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines oe ee ea) i Office of the President u L. el. S COMMISSION ON HIGHER EDUCATION october 26, 2028 q CHED REGIONAL OFFICE IX a CHED Regional Office IX. Gov. Camins Ave., Zamboanga City CHEDRO mW Tel. No. (07) 031 6507 Email: fritzkristen zex org ph MEMORANDUM ORDER NO. CHEDRO M Series of 2025 To: TO PRIVATE HIGHER EDUCATION INSTITUTION (HEI) PRESIDENTS Subject: SUBJECT IMPLEMENTATION OF FLEXIBLE LEARNING MODALITIES Date: 26 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned. 4. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 18, 2025. 2. Ensure alignment of institutional plans with the Learning Continuity Roadmap. 3. For activities requiring face to face conduct, secure prior clearance from local IATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaluation Unit for clarifications via the contact details indicated above. GARRETT WILSON, ED D. Regional Director CHED Regional Office IX"
    },
    {
        "image": "chedro1_synth_7_aug2.png",
        "label": "chedro",
        "ocr_text": "i A Sees PS, oat CHEN it ORDER NC (ORANG CHEDRO Saries of 2025 Ta: TG: PRIVA Sub BLE LEARNING MODALITIES IMPLEMENTATION OF FLE Pursuant to the p: Regional Office, the following advisories are here not later than iM: stilutional plans w ce to- onduct, secure prior ci tive (8) word ays. smination. Kind: oi ications post activity reports: For cometiancs and wid via the contact detaits ing GARRETT WILSON, ED D. Regional Director -0) Regional Offic x"
    },
    {
        "image": "chedro1_synth_7_aug3.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines an aad] ACF Office of the President c L Es ‘S peas rN COMMISSION ON HIGHER EDUCATION CHED REGIONAL OFFICE Ix CHED Regional Office IX, Gov. Camins Ave., Zamboanga City CHEDRO Ww Tel. No.: (07) 031 6507 Email: fritzkristen zex org ph a _ _ 1lss__ 777 <<< October 26, 2025 \\NDUM ORDER NO. CHEDRO MEMORANOUM Series of 2025 To: TO PRIVATE HIGHER EDUCATION INSTITUTION (HEI) PRESIDENTS Subject: SUBJECT IMPLEMENTATION OF FLEXIBLE LEARNING MODALITIES Date: 26 October 2025 x- Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned. 1. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 18, 2025. 2. Ensure alignment of institutional plans with the Learning Continuity Roadmap. 3. For activities requiring face to face conduct, secure prior clearance from local IATF units and submit Post activity reports within five (5) working days. For compliance and wide dissemination. Kindh ly coordinate with the Monitoring and Evaluation Unit for clarifications via the contact details indicated above. GARRETT WILSON, ED D. Regional Director CHED Regional Office IX"
    },
    {
        "image": "chedro1_synth_7_aug4.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines p i cr Office of the President LEAS COMMISSION ON HIGHER EDUCATION October 26, 2025 CHED REGIONAL OFFICE IX CHED Regional Office IX, Gov. Camins Ave., Zamboanga City CHEDRO Ww Tel, No: (07) 031 6507 Email: fritzkristen zex org ph RANDUM ORDER NO. CHEDRO “ENO Series of 2025 To: TO PRIVATE HIGHER EDUCATION INSTITUTION (HE!) PRESIDENTS Subject: SUBJECT IMPLEMENTATION OF FLEXIBLE LEARNING MODALITIES Date: 26 October 2025 ion and in view of the ongoing initiatives of this Commission on Higher Educati dvisories are hereby issued for the information and guidance of all concerned. hrough the CHEDRO Online Document Tracking Pursuant to the policies of the Regional Office, the following ai 4. Institutions are requested to submit their consolidated reports tl System not later than November 18, 2025. 2. Ensure alignment of institutional plans with the Learning Continuity Roadmap. 3. For activities requiring face to face conduct, secure prior clearance from local IATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monit via the contact details indicated above. foring and Evaluation Unit for clarifications GARRETT WILSON, ED D. Regional Director CHED Regional Office IX"
    },
    {
        "image": "chedro1_synth_7_aug5.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines i Office of the President c LEAS COMMISSION ON HIGHER EDUCATION CHED REGIONAL OFFICE Ix CHED Regional Office IX, Gov. Camins Ave., Zamboanga City et Tel. No.: (07) 031 6507 Email: fritzkristen zex org ph cH DRO m October 26, 2025 MEMORANDUM ORD! CHEDRO JM ORDER NO Series of 2025 To: TO PRIVATE HIGHER EDUCATION INSTITUTION (HEI) PRESIDENTS Subject: SUBJECT IMPLEMENTATION OF FLEXIBLE LEARNING MODALITIES Date: 26 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned. 1. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 18, 2025. 2. Ensure alignment of institutional plans with the Learning Continuity Roadmap. 3. For activities requiring face to face conduct, secure prior clearance from local IATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaluation Unit for clarifications via the contact details indicated above. GARRETT WILSON, ED D. Regional Director CHED Regional Office IX"
    },
    {
        "image": "chedro1_synth_8_aug1.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines E LE A Ss E r Office of the President COMMISSION ON HIGHER EDUCATION October 24, 2025 CHED REGIONAL OFFICE II CHED Regional Office Il, Carig Sur, Tuguegarao City, Cagayan GHEDRO iT} Tel. No.: (08) 735 2542 Email phiggins slkholdings. ph (9) MEMORANDUM ORDER NO. Ba CHEDR‘ Series of 2025 To: TO CHEDRO CAMPUS COORDINATORS Subject: SUBJECT IMPLEMENTATION OF FLEXIBLE LEARNING MODALITIES 24 October 2025 Education and in view of the ongoing initiatives of this ation and guidance of all concerned. ports through the CHEDRO Online Document Tracking Commission on Highe! Pursuant to the policies of the dvisories are hereby issued for the inform: Regional Office, the following ai 4. Institutions are requested to submit their consolidated re| System not later than November 23, 2025. 2. Ensure alignment of institutional plans wi 3. For activities requiring face to face conduct, secure prior cleal post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Mot via the contact details indicated above. ith the Outcomes Based Quality Assurance. ance from local IATF units and submit itoring and Evaluation Unit for clarifications MELINDA HARRISON, ED D. Regional Director CHED Regional Office I!"
    },
    {
        "image": "chedro1_synth_8_aug2.png",
        "label": "chedro",
        "ocr_text": "Deu EASE TS). Ociaber 24, 2025 j alone a2 18g ‘2 MORANDUM Of) a BNO, CHEDRO Series af 2028 To: ro ORDINATORS Subject: SUBJECT IMPLEMENTATION EXIBLE LEARNING MODALITIES the Commission on Higher Education and in view of ihe ongoing iniiatives of this i es are hereby issued for the information and guidance of noemed, the CHEDRO Ragiona! Office, the folic 4. inslitutions ars requesied to submit dated reports thre Document Tracking Sysiem not later than November 23, 2025 Ament of ey plans with the Outcomes Ba e conduct, secure pricr clearar working days. Quality Assurance. from focal ATE uniis and submit post activity reports within fi tor clarifications issemination vated apave. For compliance and wide via the conlact details ind) MELINDA HAR Regiona! Director CHED Region"
    },
    {
        "image": "chedro1_synth_8_aug3.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines Office of the President .. LEAS rY COMMISSION ON HIGHER EDUCATION October 24 2006 CHED REGIONAL OFFICE 11 CHED Regional Office Il, Carig Sur, Tuguegarao City, Cagayan ChEDRY mW Tel. No.: (08) 735 2542 Email Phiggins sIkholdings ph i CHEDRO MEMORANDUM ORDER NO. Series of 2025 To: TO CHEDRO CAMPUS. COORDINATORS Subject: SUBJECT IMPLEMENTATION OF FLEXIBLE LEARNING MODALITIES Date: 24 October 2025 Pursuant to the Policies of the Commission on Higher Education and in view of the Ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned. 1. Institutions are requested to submit their Consolidated reports through the CHEDRO Online Document Tracking System not later th {3} Prior clearance from local IATF units and submit Post activity reports within five (5) working days. For Compliance and wi ide dissemination, via the contact details Kindly coordinate with the Monitoring and Evaluation Unit for Clarifications indicated above. MELINDA HARRISON, ED D. Regional Director CHED Regional Office ||"
    },
    {
        "image": "chedro1_synth_8_aug4.png",
        "label": "chedro",
        "ocr_text": "e Philippines ern oe A «s ole a \"Office of the President i Bw ha bo a4 COMMISSION ON pee R EDUCATION a toes ie October 24, 202: ‘enidore ut 1, Tuguegarao City HOIGINGS TO. CHEDRO CAMPUS COORL HNATORS EMENTATION GF FLEXIBLE LEARNING Mi 1g initiatives of this xce of all concerned. BRO On! Purs Document Tracking ough the CHE ed io submit their cons ae sporis thy Ire Saernsia ott ott wore’ as with the Gutct omes Based Quality Assurance. requiring face te lace oeanelie _ secure prior clearance from focal IATF units and sub ent ig days. ly coordinate wi 3. For post- -antivity reports within the Monitoring and valuation Unit for ck For compliance via the contact diet i ind MELINDA HARE Regional Director al Office c"
    },
    {
        "image": "chedro1_synth_8_aug5.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines 5 E LEA Ss isd Tr Office of the President COMMISSION ON HIGHER EDUCATION october 24, 2025 CHED REGIONAL OFFICE I even CHEDRO mt ce Il, Carig Sur, Tuguegarao City, Cag CHED Regional Offi Email: phiggins slkholdings. ph Tel. No.: (08) 735 2542 MORANDUM ORDER NO. CHEDRO Series of 2025 TO CHEDRO CAMPUS, COORDINATORS Subject: SUBJECT IMPLEMENTATION OF FLEXIBLE LEARNING MODALITIES Date: 24 October 2025 f the ongoing initiatives of this lucation and in view of concerned. .d for the information and guidance of all RO Online Document Tracking of the Commission on Higher Ed hereby issue lidated reports through the CHEDI Pursuant to the policies Regional Office, the following advisories are 4. Institutions are requested to submit their consol System not later than November 23, 2025. 2. Ensure alignment of institutional plans with the Outcomes Based Quality Assurance. 3. For activities requiring face to face conduct, secure prior clearance from local IATF uni post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coor via the contact details indicated above. its and submit dinate with the Monitoring and Evaluation Unit for clarifications MELINDA HARRISON, ED D. Regional Director CHED Regional Office I!"
    },
    {
        "image": "chedro1_synth_9_aug1.png",
        "label": "chedro",
        "ocr_text": "October 27 oudore 18 HO. CHEDRO ME Sei roe Subject: EMENTAT SUBJECT IME aAMeWwo! al LATE unit face to face conduct. secure pr 5) working da ration, Kindly coordinate with th"
    },
    {
        "image": "chedro1_synth_9_aug2.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines 3 Office of the President a LEA S E 5 COMMISSION ON HIGHER EDUCATION CHED REGIONAL CFFICE Xit CHED Ragiona! Office ti, Carpenter Hill, Koronedai City chore t Hy Tel. No.: (08) 204 0371 Email: angeticad7 @gtopalempire. corn October 27, 2025 CHEDRG MEMORANDUM ORDER NO. Series of 2025 O CAMPUS COORDINATORS. To: TO: CHE SUBJECT IMPLEMENTATION OF FLEXIBLE LEARNING MODALITIES Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of ali concerned. 1. Institutions are requested to submit their consolidated reports through the CHEDRO Oniine Document Tracking System net later than November 18, 2025. 2. Ensure alignment of institutional plans with the Philippine Qualifications Framework. 3. For activities requiring face to face conduct, secure prior clearance from local ATF units and submit post activity reports within five (5) working days For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaiuation Unit for clarifications via the contact details indicated above. DESTINY PETERSON, PH D. Reagiona! Director CHED Regional Office Xi"
    },
    {
        "image": "chedro1_synth_9_aug3.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines tag Cc Office of the President x LEAS en COMMISSION ON HIGHER EDUCATION CHED REGIONAL OFFICE XII CHED Regional Office XII, Carpenter Hill, Koronadal City CheDRO m Tel. No.: (09) 204 0371 Email: angelica07 @globalempire com October 27, 2025 MEMORANDUM ORDER NO. CHEDRO at Series of 2025 To: TO CHEDRO CAMPUS COORDINATORS Subject: SUBJECT IMPLEMENTATION OF FLEXIBLE LEARNING MODALITIES Date: 27 October 2025 Pursuant to the policies of the Commission on Higher Education and in view of the ongoing initiatives of this Regional Office, the following advisories are hereby issued for the information and guidance of all concerned. 1. Institutions are requested to submit their consolidated reports through the CHEDRO Online Document Tracking System not later than November 18, 2025. 2. Ensure alignment of institutional plans with the Philippine Qualifications Framework. 3. For activities requiring face to face conduct, secure prior clearance from local IATF units and submit post activity reports within five (5) working days. For compliance and wide dissemination. Kindly coordinate with the Monitoring and Evaluation Unit for clarifications via the contact details indicated above. DESTINY PETERSON, PH D. Regional Director CHED Regional Office XII"
    },
    {
        "image": "chedro1_synth_9_aug4.png",
        "label": "chedro",
        "ocr_text": "Ofc Py -esident F Bos aA x S et nm commis? ON Hictee EDUC, ATION CHED REG Sert To: 10 Subje ATION OF FLEXIGLE LEARNING MODALITIES Date: Pursuant to the pole: Regional ©: Office. the 1. institutions are System not tater ih 2 #88 of the Comm, lowing ad 'ssion on Higher orles gr Fequested fo Submit H thar November 78 alignment of institutional plans with the Pp BS Fequiriny oface conduct. Pasi. “Activity reporis within five. (5) wo Ng Gays, For comipd and wide disser: details indica Education ang Oreby issued for the Consolidated ing Initiatives of this 2aNCR the CHEDRO fi ormation and gui feports through of ail concer Red, Miippine &: Ure prior clearance ff 1s Framework, OE fg CallATE units ang Submit nination led above. via the contact Kindly Coordinate with the Me: oniioring ang Evaluation An for Clarifications"
    },
    {
        "image": "chedro1_synth_9_aug5.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines Office of the President COMMISSION ON HIGHER EDUCATION CHED REGIONAL OFFICE Xt de TRCLEASE a) a Gotober 27, 2026 ondoee ne RANDU JMO} IRDER NO. GO CAMPUS COORDINATORS SUBJECT IMPLEMENTATION OF FLEXIBLE LEARNING MODALITIES Date: 27 Ocieber 2025 infiatives -@ of all concerned. mary for the inf Pursuant to the pulici Regional Cffice, the oh sg aR are requested to submit ai later than: Novamber 18, 2026. Amant of institutional plans with the Philippine Qualifications Fr face to face conduct, secure prior ance from tec in five (5) working days. in view Gi the ong ofles are here! the CHEDRG Online Document Tracking consolidated reports thre ATE units and submit Evaluation Unit for clarificati 2 and wile dissemination. Kindly coor act celails indicated above. nate with the Monitoring TINY PETERSON, PH D. ector Regional Office XH"
    },
    {
        "image": "chedro2_synth_11_aug1.png",
        "label": "chedro",
        "ocr_text": "R EDUCAT REGIONAL OFFIC: oily of San Fermando, La Unk MEMORAN No. No. 13 ni Guality and wes the fallawing dire: npliance. ihe necessary doc ter than November 16, 2025. Th All cancer is AEDKO online 6 19, the follawing: me through the yust include, put fouls Toster wi Mi, aNd ress: Ensure compliance y tho essment repors and ‘ontouiun ach proof of institutional accreditation status and quality assurance certifications, if applicahie. Non compliance may res: Hiations, penal Rew programs of courses, pproval of For further olari Monitoring and Evatuation Division at the contact details above. immediate and wide dieseiination of th prmorandum is requesied. Your i ty submission is highly appreciated as it supports the continuous higher education standards in the region. R MURRAY, PHD. Regional Director"
    },
    {
        "image": "chedro2_synth_11_aug2.png",
        "label": "chedro",
        "ocr_text": "sepye te cree BDUCATION REGIONAL ay of San Fernando, La Union boy Campus Administators ang Academic Officials: Subject invitation to Regional Stakeholder Consultation Date Movember 05, 2025 i ine with the Consnission s ongoing initlatives Lo strengthen higher eduisation quality and governance, this Office hereby issues the folowing directive for strict compliance. AB concemed utions are required to submit the necessary documentation through the CHEDRS oniine portal not ister than November 18, 2025. The submissions must include, but are not limited to, the following: Provide uf d faculty roster with complete credentials including highest educational aitainment, ieaching load distribution, and research cutput for the past academic year Ensure compilance with outcome hased education (OBE) siandards through documented assessment repors and curriculum mapping matrices. Allach proof of institutional accreditation status and quality assu ioe cenifications, if applicable. Non compliance may resuit In delayed processing of certifications, permit renewais, new programs or courses, vd approval of For further clarifications, please coordinate with the Monitoring and Evaluation Division at the inact details above, immediate and wide dissemination of this memorandum is eequested. Your flor in ensuring Umely submission is highly appreciated as if supporis the cont ent of higher education standards in the region. JENNIFER MURRAY, PHL"
    },
    {
        "image": "chedro2_synth_11_aug3.png",
        "label": "chedro",
        "ocr_text": "ihe NUM PROM THE REG. 120, 8. 2025 NAL DIRECTOR Cainpus Administrators and Date ct compllanes are requ ary documentation through the a7 thari November 18, 2025. The submissions must include, but are CREDEG ontine portai ne not limited to, the following: ide updaied facuity roster witht co Be teaching ioad distribution, and researc i output for the past acaclemic year, nce with Quicome based education (O85) standards throug) fepors and curriculum mapping matnces. proof of insti ditalion status and quailty assurance certifications, if apo i altainment, sumented stitulional act Hon comy may resut in delayed processir NS OF GOUT: 1g Of Cerlifications, permit renew: ang appro’ the Monitor ination of thi and Evaiuat memorandum JENNIFER MURRAY, PRLD. | Regionat Director it i 4"
    },
    {
        "image": "chedro2_synth_11_aug4.png",
        "label": "chedro",
        "ocr_text": "eeeee A Republic of the Philippines 1A (eS e\\ X/ Office of the President E/ COMMISSION ON HIGHER EDUCATION A REGIONAL OFFICE ily of San Femando, La Union MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 120, 8. 2028 For Campus Administrators and Academic Officials Subiect Invitation to Regional Stakeholder Consultation Date November 03, 2025 a In fine with the Commission s ongoing initiatives to strengthen higner education quatity and governance, this Office hereby issues the foliowing directive for strict compliance. Ali concemed institutions are required to submit the necessary documentation through the CHEDRO online portal not later than November 78, 2625. The submissions must include, but are not limited to, the following: Provide updated facuity roster with complete credentials including highest educationat attainment, teaching load distribution, and research output for the past acaderic year. Ensure compliance with outcome based education {OBE) standards through documented assessment reports and curriculum mapping matrices. Attach proof of instituttonal accreditation status and quailty assurance certifications, if applicable. Non compliance may result in delayed processing of certifications, permit renewals, and approval of new programs of courses. For further clarifications, please coordinate with the Monitoring and Evaiuation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciates as it supports the continuous improvement of higher education standards In the region. JENNIFER MURRAY, PH D. 1) Regional Director Vy"
    },
    {
        "image": "chedro2_synth_11_aug5.png",
        "label": "chedro",
        "ocr_text": "< hilippines Gifice of the President COMMISSION ON HIGHER EDUCATION % REGIONAL OFFICE I City of San Fernando, La Uncon Yet. Nos.: Tet (07) MEMORANDUM PROM THE REGIONAL DIRECTOR Ho. 190, s. 2026 for Campus Administrators and Academic Officials: Subject invitation to Regional Stekenoider Consultation: Date November 03, 2025 in tine with the Commission s ongoing initiatives to strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. Ail concemed institutions are required to submit the necessary documentation through the CHEDRO ontine portal not tater than November 18, 2025. The submissions must include, but are Not limited to, the foliowing: Provide updated faculty roster with complete credentials including highest educational attainment, teaching ioad distribution, and research output for the past academic year. Ensure compliance with oulcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Attach proof of institutional accreditation status and quality assurance ceitifications, if applicable. Non compliance may result in delayed processing of certifications, permit renewals, and approval of new programs or courses. For further ciarifications, please coordinate with the Monitoring and Evaluation Division at the contact detais above. immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. _ JENNIFER MURRAY, PH, D. |) Regenal Director"
    },
    {
        "image": "chedro2_synth_12_aug1.png",
        "label": "chedro",
        "ocr_text": "es ae Republic of the Philippines poem Office of the President E77 COMMISSION ON HIGHER EDUCATION 2 REGIONAL OFFICE 11 < Tuguegarao City, Cagayan a na a Tel. Nos.: Tet (06) 095 6485 Email; roli ched gov. ph MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 144, s. 2025 For All Presidents of State Universities and Colleges Subject Clarifications on Faculty Qualification Standards Date October 22, 2025 not limited to, the following: Provide updated facul Ity roster with complete credentials including highest educational attainment, ion, and research output for the past academic year. lutional accreditation status and quality assurance Certifications, if applicable. Include student enrollment data disaggregated by program, year level, and mode of delivery (face to face, blended, or online). Non compliance May result in delayed Processing of certifications, permit renewals, and approval of new Programs or courses. TYLER FITZGERALD, DBA Regional Director"
    },
    {
        "image": "chedro2_synth_12_aug2.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines Office of the President COMMISSION ON HIGHER ED REGIONAL OFFICE 1 Tuguegarao City, Cagayan UCATION 5. Tel. Nos.: Tet: (06) 095 6485 Email: roi ched gov ph MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 144, s. 2025 For All Presidents of State Universities and Colleges Subject Clarifications on Faculty Qualification Standards Date October 22, 2025 Non compliance May result in de} new programs or courses. For further Clarifications, please coordinate with the Monitoring and Evaluation Division at the Contact details ab above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education Standards in the region. TYLER FITZGERALD, DBA Regional Director"
    },
    {
        "image": "chedro2_synth_12_aug3.png",
        "label": "chedro",
        "ocr_text": "on Ge, x Republic of the Philippines pete Office of the President 2 %. COMMISSION ON HIGHER EDUCATION 3 5 REGIONAL OFFICE Il 5 “Fuguegarao City, Cagayan Tel. Nos.: Tel: (06) 095 6485 Email: roli ched gov ph MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 144, s. 2025 For All Presidents of State Universities and Colleges Subject Clarifications on Faculty Qualification Standards Date October 22, 2025 en higher education quality and mmission s ongoing initiatives to strengths governance, this Office hereby issues the following directive for strict compliance. institutions are required to submit the necessary documentation through the ater than November 49, 2025. The submissions must include, but are In line with the Co All concerned CHEDRO online portal not I not limited to, the following: Provide updated faculty ros teaching load distribution, al Attach proof of institutional accreditatio! Include student enrollment data disaggregated by progr (face to face, blended, or online). Non compliance may result in delayed new programs oF courses. For further clarifications, P! contact details above. immediate and wide cooperation in ensuring timely submission ii improvement of higher education standards in the region. ster with complete credentials including highest educational attainment, ind research output for the past academic year. ance certifications, if applicable. n status and quality assur am, year level, and mode of delivery processing of certifications, permit renewals, and approval of h the Monitoring and Evaluation Division at the f this memorandum is requested. Your ports the continuous Jease coordinate wit dissemination is highly appreciated as it supy TYLER FITZGERALD, DBA | Regional Director \\"
    },
    {
        "image": "chedro2_synth_12_aug4.png",
        "label": "chedro",
        "ocr_text": "COMMISSION ON HI REGIONAL of Fel. Noss Tet (aay EMORANDIAG PROM 5 EE RE ON AY DIRECTOR All Presidenis of Siete Universit Clarifications on Fe coker 22, 2026 inline with the Sori govermance, this Offi Sei Srgoing int Ge hereby issues thy Ves to gthen iottowing directive for Hed fo submit the her education quality and ot compliance, ‘SSary documentation thes The sub: CORCeMMed institutions ara req HEDRO online porial nat tater ROL limited to, the following. Provide updated far. teacl ai Novernber 19, 2025. iy roster with come *G Fesearch output for the Past academic ye; and Quality assurance cers egregated by program, year level, a gi Brog niede of delivery ce to face, blended, o onting). it in delayed proces SIN Of cei PETIT id approved of Wtificat nd Evaluation Division at the 3 Memorandurn is req. Your ‘mission is highly appreciated as fds in the region, es pPwts the continuous"
    },
    {
        "image": "chedro2_synth_12_aug5.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippi aOR Che Office of the President Ej COMMISSION ON HIGHER EDUCATION 3} 3 REGIONAL OFFICE tl Tuguegarao City, Cagayan: it: rolgched gov oh MEMORANDUM PROM THE REGIONAL DIRECTOR No. Ne. 144, 2025 For Ail Presidents of State Universities and Colteges Subject Clanfications on Faculty Qualification Standerds: Date October 22, 2025 in line with the Commission s ongoing initiatives to strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. Ali concerned institutions are required to submit the necessary documentation through the CHEDRO online portal not later than November 19, 2025. The submissions must include, but are not lirnited to, the following: Provide updated faculty roster with complete credentials including highest educational attainment, teaching load distribution, and research output for the past academic year. Atiach proof of institutional accreditation status and quality assurance certifications, if applicable. Include student enrollment data disaggregated by program, year level, and mode of delivery (face to face, blended, or online). Non compliance may result in delayed processing of certifications, permit renewais, and approval of new programs or courses. For further clarifications, please coordinate with the Monitoring and Evaluation Division st the conlact details above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highiy appreciated as it supporis the continuous improvement of higher education siandards in the region TYLER FITZGERALD, DBA |} Requonal Director y"
    },
    {
        "image": "chedro2_synth_13_aug1.png",
        "label": "chedro",
        "ocr_text": "oRGtie, Republic of the Philippines Office of the President EY COMMISSION ON HIGHER EDUCATION 3 REGIONAL OFFICE! oN City of San Fernando, La Union ornare Email: roi ched gov ph ‘Tel, Nos.: Tet: (07) 239 1046 MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 30, 8. 2025 For Heads of Private Higher Education Institutions lo. 46, Series of 2012 Subject Advisory on Compliance with CMO Ni Date October 28, 2025 hen higher education quality and In line with the Commission s ongoing initiatives to strengtt governance, this Office hereby issues the following directive for strict compliance. All concerned institutions are required to submit the necessary documentation through the CHEDRO online portal not later than Novem! missions must include, but are ber 17, 2025. The sub! not limited to, the following: ance certifications, if applicable. ,ditation status and quality assur Attach proof of institutional accre Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. ram, year level, and mode of delivery Include student enrollment data disaggregated by progr (face to face, blended, or online). Non compliance may result in delayed processing of certifications, permit renewals, and approval of new programs or courses. For further clarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. jim BROOKS, DBA | Regional Director"
    },
    {
        "image": "chedro2_synth_13_aug2.png",
        "label": "chedro",
        "ocr_text": "_ SetfFs oxtlcue, Republic of the Philippines 5 Office of the President Ey COMMISSION ON HIGHER EDUCATION A REGIONAL OFFICE! ity of San Fernando, La Union \"ever Email: roi ched gov ph ke ‘Tel. Nos.: Tel: (07) 239 1046 MEMORANDUM FROM THE REGIONAL DIRE No. No. 30, s. 2025 Heads of Private Higher Education Institutions For Subject ‘Advisory on Compliance with CMO No. 46, Series of 2012 Date October 28, 2025 igher educal n quality and strict compliance. ion through the must include, but are e Commission s ongoing initiatives to strengthen hi this Office hereby issues the following directive for ions are required to submit the necessary documentati not later than November 17, 2025. The submissions In line with th governance, All concerned instituti CHEDRO online portal not limited to, the following: Attach proof of institutional accreditation status and Ensure compliance with outcome based education assessment reports and curriculum mapping matrices. Include student it data disaggregated by program, year level, and mode of delivery enrollment (face to face, blen ded, or online). compliance may result in delayed processing courses. .tifications, if applicable. quality assurance Cel gh documented (OBE) standards throu: Non. of certifications, permit renewals, and approval of new programs or For further clarifications, please coordi contact details above. Immediate and wide di cooperation in ensuring timely submission is improvement of higher education standards in the re: nd Evaluation Division at the m is requested. Your the continuous inate with the Monitoring al ssemination of this memorandu! highly appreciated as it supports gion. jim BROOKS, DBA | Regional Director"
    },
    {
        "image": "chedro2_synth_13_aug3.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines ON Cte,, Office of the President gs ‘4 COMMISSION ON HIGHER EDUCATION S g REGIONAL OFFICE % ye City of San Fernando, La Union ao nee Tel. Nos.: Tek: (07) 239 1046 Email: roi ched gov ph ie MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 30, s. 2025 For Heads of Private Higher Education Institutions Subject Advisory on Compliance with CMO No. 46, Series of 2012 Date October 28, 2025 In line with the Commission s ongoing initiatives to strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. All concerned institutions are required to submit the necessary documentation through the CHEDRO online portal not later than November 17, 2025. The submissions must include, but are not limited to, the following: Attach proof of institutional accreditation status and quality assurance certifications, if applicable. Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Include student enrollment data disaggregated by program, year level, and mode of delivery (face to face, blended, or online). Non compliance may result in delayed processing of certifications, permit renewals, and approval of new programs or courses. For further clarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. JIM BROOKS, DBA _ Regional Director"
    },
    {
        "image": "chedro2_synth_13_aug4.png",
        "label": "chedro",
        "ocr_text": "MEMORAN| DUM fR¢ No 0. 30, 2025 For Subject Oe, Heads Of Private Higher Educuton Advisory on Compliance with October fn ine with the Coy Ali concerned institutions a CHEDRO ontine Porial not fotiowing: COMMISSION en, eae eat Repubtic of the Phi Office of the Presicient ON HIGHER ED UCATION REGIONAL OFFICE; Cty of San Fetranso, 42 Union M THE REGIONAL DRRECTOR instiutions CMO tie 46, Series Of 2012 28, 2025 re feQuited to Submit the necess; sary documentation through the ‘ater than November 4 7, 2025. The Submissions must inchide, but are JIM BROOKS, DBA~ j j Regional Grector | '"
    },
    {
        "image": "chedro2_synth_13_aug5.png",
        "label": "chedro",
        "ocr_text": "COMMISSION oN HIGHER GIONAL OFFICE MEMORANDUM F ROM THE RUGIONAL DIRECTOR Aavigory on Complance with CMO Ho, 48, Series of 2012 then higher education quatity and fF strict commples an through the ust Include, bul af€ ing iniflatives toe wes the following directve governance, this Office ions are required te subs aot later than November 4}, 203 mit ihe necesaary Oocul 8 The subMISsiIONS Ail concerned in CHEDRS online portal “pplicabie. not limited te, tne folios assurance certificatic accrediation status and quality wards through do sumented 1 COBE} stan 8. i instititional aah cutoome based educatl assesenent report and curriculum rapping mairic include suid solment dala sisagaregated by of face to face, blended, or online}. Non camplisnce may reguit in delayed pre new programs of 62UIses. Fog father clatiications, soniact details above. immediate and wide on in ensuring timely submis: wement of higher education stand: jewel, and meds of delivery ogra, year ¢. and approval of ng of cartifications. permit renewal ogordinaiz with the Monitoring and tion Division at the dissemination of (is meamorandam is requestes. is highly appr ciated as it supnorts the condinugus is in he region."
    },
    {
        "image": "chedro2_synth_14_aug1.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines ae, Office of the President E/ 2. COMMISSION ON HIGHER EDUCATION 3 5 REGIONAL OFFICE Vil ‘a Palo, Leyte Tel. Nos,: Tel: (08) 353 5073 Email: roviii ched gov ph MEMORANDUM FROM THE REGIONAL DIREC “TOR No. No. 95, s. 2025 For Heads of Private Higher Education Institutions Subject Guidelines on Hybrid Learning Implementation Date October 25, 2025 In line with the Commission s ongoing initiatives to strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. All concerned institutions are required to submit the necessal CHEDRO online portal not later than November 15, 2025. TI Not limited to, the following: Include student enrollment data disaggre (face to face, blended, or online). Provide updated faculty roster with complete credentials including highest educational attainment, teaching load distribution, and research output for the past academic year. Submit Institutional Development Plans (IDP) aligned with the Philippine Qualifications Framework (PQF) and relevant Policies, Standards, and Guidelines (PSGs). Attach proof of institutional accreditation status and quality assurance certifications, if applicable. Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum. mapping matrices. Non compliance may result in delayed processing of certifications, new programs or courses. For further clarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your Cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. ry documentation through the he submissions must include, but are gated by program, year level, and mode of delivery permit renewals, and approval of CHRISTOPHER WILLIAMS, ED D. Regional Director"
    },
    {
        "image": "chedro2_synth_14_aug2.png",
        "label": "chedro",
        "ocr_text": "{the President COMMISSION ON HIGHER EDU REGIONAL GFEFICE Vili Pale Leve Office ATION 5 RECKON AL BEREC POR cation (psttubons Heads of Pavate Higher entation ng ime October 26, 2025 oing initiatives to strengthen higher education g) yes the following directive for strict coMplance ry Joguinentation ity gugh ihe me nes 48, 2025. The submissions must include, bul are in tine wi Office hereby issu wired to submis ‘Ag concemed institutions are later than Noverso rial not later thy OREDRO online ed to, the following and mode of delivery flevel, ta disaggregated by program, tudent earamen + nolude Hacesotace, blended, OF online) Provide Updated facuity roster W in comp! edentiais including highest educational attainment, yeaching load gistibution, and research output for the past academic year pment Pians (DP) alignec with thy ippine Quanhi {institutional Develon 5. Standards, and Gute! and quailty ion (OBE) stan um mapping matrices it in delayed processing of certifications, permit renew ations Framework sions, if applicable nce cart gitation status saris through dooumented ased Educ yeports and and approval of compliance May 1 new programs oF COUrS: For further clanfications, Pl is above. Wrymediale and wide Gissen suring timely submission is highly appieck in tne region rovernent of higher education CHRISTOPHER WILL IAMS, ED D Regional Director"
    },
    {
        "image": "chedro2_synth_14_aug3.png",
        "label": "chedro",
        "ocr_text": "NDUM FROM yu MEMO! 3 2028 ons, ds of Private Higher Education last 9 implamentaion to strongiken righer ed agtive tor stiict soenptiance. nis ongoing in sues the ic station through the sary dou ne subir gred to submit te neck 18, 2028. gions must include, tufians ave requ than November CHEDRO online i _ the following: jnetude student enrolment date or online} y roster with complete crecientials goad det a8Od, ror cutput for the pe Development Plans 4 OP) aligned with the Philippine jeg, Standards, ines (PSGS)}. program, year feyel, and mode of delivery disaggregated by educational attainment, 5 inckiding ays Framework (PQE) ane re! Attach preof of ins’ permit 12 delayed process! 9 of certficalions. Nor compliance may yesuh ws OF GOUTS atlons, rae can Division at the foring asd fon Di memorandum 1s yequesied. Your new progr? For further ciarific; contact det ecaperatl :provel edinaie with ihe M id wide dissemination of? y y appreciated 35 region. vfion standards in ih LWiLLIAMS, BED. CHRIST oPHE"
    },
    {
        "image": "chedro2_synth_14_aug4.png",
        "label": "chedro",
        "ocr_text": "BR EDUCATION 3 MEMORANDUM FROM THE R 2028 ECGIONAL DIRECTOR No. No. 95, 5 Hi Heads of Privaie her Education Institutions Subject Guidelines en Hybrio Learning Implementation Date October 25, 202: in dine with the Commission governance, this Office hereb ongoing initiatives to strengthen higher education quality and the following directive for sirict compliance. A concemed institutions are required fo subi CHEDRG cniine poriai not later than Never hot limited ts, the following it the necessary decumentatie tber 15, 2025, The submissions must inolude, but are through the include student enroliment data di o face, blended, or online} Provide updated faculty roster with compiete credentials including highest educational attainment. leaching load distribution, and research ouiput for the past academic year. Submit ingtitutionat ment Plans (DP) aligned with the Philippine Qual: (PQF) and relevant Policies, Standards, and Guidelines (PSGs)}. Attach proof of instidional aca fon status and ti ance certifications, if apphoabie Ensure compliance with o: i education (OBE) standards through documented assessment reports arxi curriculum mapping matrices. aggregated by program, year ievei, and mode of delivery fications Framework Non compliance may re: new programs or courses. f further clarifications, please coordinate wi i in delayed processing of certifications, parm _ and approval of n the Monitoring and Evaluation Division at the contact deiails above. Immedi Kd wide dissemination of this memorandum is requested. Your coopera in ensuring timely submission is highly appreciated as supsorts the continuous improvel education standards in the region. ROWILLIAMS, Sirector D D."
    },
    {
        "image": "chedro2_synth_14_aug5.png",
        "label": "chedro",
        "ocr_text": "HIGH, ao leg, Republic of the Philippines Office of the President COMMISSION ON HIGHER EDUCATION §| z REGIONAL OFFICE VIII Palo, Leyte Tel. Nos.: Tel: (08) 353 5073 Email: rovii ched gov ph MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 95, s. 2025 For Heads of Private Higher Education Institutions Subject: Guidelines on Hybrid Learning Implementation Date October 25, 2025 In line with the Commission s ongoing initiatives to strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. All concerned institutions are required to submit the necessary documentation through the CHEDRO online portal not later than November 15, 2025. The submissions must include, but are not limited to, the following: Include student enrollment data disaggregated by program, year level, and mode of delivery (face to face, blended, or online). Provide updated faculty roster with complete credentials including highest educational attainment, teaching load distribution, and research output for the past academic year. Submit Institutional Development Plans (IDP) aligned with the Philippine Qualifications Framework (PQF) and relevant Policies, Standards, and Guidelines (PSGs). Attach proof of institutional accreditation status and quality assurance certifications, if applicable. Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Non compliance may result in delayed processing of certifications, permit renewals, and approval of new programs or courses. For further clarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. CHRISTOPHER WILLIAMS, ED D. Regional Director"
    },
    {
        "image": "chedro2_synth_15_aug1.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines ros Office of the President io COMMISSION ON HIGHER EDUCATION A g REGIONAL OFFICE e City of San Fernando, La Union Tel. Nos.: Tet: (07) 219 5665 nar Email: roi cned gov ph MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 81, s. 2025 For Campus Administrators and Academic Officials Subject ‘Submission of Updated Institutional Development Plans Date October 17, 2025 In line with the Commission s ongoing initiatives to strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. All concerned institutions are required to submit the necessary documentation through the CHEDRO online portal not later than November 17, 2025. The submissions must include, but are Not limited to, the following: Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Submit Institutional Development Plans (IDP) aligned with the Philippine Qualifications Framework (PQF) and relevant Policies, Standards, and Guidelines (PSGs). Attach proof of institutional accreditation status and quality assurance certifications, if applicable. Include student enrollment data disaggregated by program, year level, and mode of delivery (face to face, blended, or online). Non compliance may result in delayed processing of certifications, permit renewals, and approval of new programs or courses. For further clarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. \"ROGER HUGHES, ED D. ) Regional Director"
    },
    {
        "image": "chedro2_synth_15_aug2.png",
        "label": "chedro",
        "ocr_text": "EEUU aa on WG Republic of the Pailtppmes ey e Office of the President Fy A COMMISSION ON HIGHER EDUCATION EA 3 REGIONAL OFFICE! od cay of gan Femando, La union Sea Tel, Nos. Tet {07} 219 565\" Eanaib: roxgened gov 9\" Pl ah ee oo ON em MEMORANDUM EROM THE REGIONAL piRECTOR No. No. 81. §. 2025 For Campus Administrators and Acaden c oMmicials Subject Submission of Updated institutional ‘Development Plans: Date Qetober 17, 2025 ee oo in tine with the Commission s ongoing initiatives #0 strengthen higher education quality and nine tn pay bas tn ‘aul concerned institutions are required to submit the necessary documentation through the na concert re porto than Nove 17 2029 The submissions must but are not limited to, the following: Ensure compliance with outcome basee education (OBE) standards throug! documented assessment repos and curriculum matrices. Submit Institutional Pians (IDP) aligned with the Phiippine Qualifications Framework (POF) and relevant Policies, Standards, and Guidelines PSG). «attach proof of inatitutiona! accreditation status and quality assurance i W applicable. «inciude student enrolment data disaggregated by program, year jevel, and node of delivery or online). amit renewals, and approval of (face to face, blended processing of certifications, Pel may result itt delayed new programs oF Courses. For further clarifications, please coordinate with the HMontioring anc Evaluation Division atthe contact detatis avove. inmediat® and wide dissemination? of this memorandum 1 requested. Your cooperation in ensuring bmely submission 'S highly appreciated 33 it supports the continuous improvement of higher ion standards in the region ROGER HUGHES, EDD {\\ Regional Director"
    },
    {
        "image": "chedro2_synth_15_aug3.png",
        "label": "chedro",
        "ocr_text": "Ke Presic ce ott OMMISSION ON RIGHER EDUCATION Hi REGIONAL GFFICE oS city of San Femando, 3 Union MEMORANDUM EROM HE REGIONAL DIRECTOR No. No. 84 6. 2025 jministraters and Academic Oficial 2 of Updated institutional Developrnent Pi Subject 2025 when righer education quatity and g y ommission s ongoing iniiatives to in in governance, ine with the _ this Office hereby issues the following directive for strict compliance. mentation through the ary docu pmissions must include, but are ed institutions are required to subm Al conse! CHEDRO online portal not later than November 17, 202: not limited to, the following: Engure compilance with ouicome pased education (Oo! assesament reports and curriculum mapping matrices. brut Institutional Development Plans (OP) aligned (POF) and relevant Policies, Standards, and Guidelines iPSGs). diation stalus and quatity assurance certifications, if applicable 4, and made of delvery The su nted E} siandarcs througe docu with the Philiepine Qualifications Framework Attach proof of institutional ac «Include student enrollment data Gr blended, of oniine}. delayed pr Gaue to- fa and appreval of gsing of certl Mon compliance may resull i new programs OF Courses. For further clavifications, please coordinate wath ihe Mantoring and Evaluation Division at the contest details above. immediate and wide dissemination of {his memorandum is ensuring timely subimssion iS highly appre daa it supporis th a contnucus: cooperation i igher egucation standarts mi the regi improvement of Regional Firector"
    },
    {
        "image": "chedro2_synth_15_aug4.png",
        "label": "chedro",
        "ocr_text": "Republic of the Paitipg Office of the Presid COMMISSION ON HIGHER BI REGIONAL OFFICE Cary of San Oty of San MEMORANDUM PROM THE REGIONAL piRECTE oR Ne Campus Administraturs and Academic Officials Submission of Updated dns titast onal Development Plans in iine with the Commissi govermanca. this Office he: fe higher education quality ana reby issues the te directive for strict compianca. All concerned institutions até Fequired ta sut y documentation thre CMEDRO oniine portal net fater than November 47, 2025. The subm AOL mited to. the folowing. mit the neces. ugh the SSIONS Must Inchide, but are Ensure compliance with assessment reports sad Subm {POF} and rei uicome based education ics mapping matrices. it ingtiniionat Development Pang CDF) aligned evant Policies, Standards, and Guide Adlach proof of institutional accredhation include student rollment data oi face to face, blended, or oniine), curicult with ihe: Mes (PSGs atus and quail lip assurar ‘ce certifications, if appticabie ievel, and made of telivery Non compliance May rear Hew programs or cour For turther ications, please cox dinate with the Monitoring and Evaluation Divis contact details above. immediate anc wide dissemination of this memorandum i Hon its ensuring timely submission ig hi 'S highly apprec improvement of higher education Slandards in the Fegi aibin delay PPOCESSING Of vertifications, per {renewals ang a pproval of Wat the fequested. Your Ed as Ht supports the continuous: ROGER HUGHES,"
    },
    {
        "image": "chedro2_synth_15_aug5.png",
        "label": "chedro",
        "ocr_text": "Los Ghey ko Republic of the Philippines Office of the President ey a COMMISSION ON HIGHER EDUCATION A 3 REGIONAL OFFICE! ity of San Fernando, La Union Email: roi ched gov Ph Tel. Nos.: Tel: (07) 219 5665 MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 81, S. 2025 For Campus Administrators and Academic Officials mission Of Updated Institutional Development Plans Subject subi Date October 17, 2025 then higher education quality and 's ongoing initiatives to streng' the following directive for strict compliance. jocumentation through the clude, but are In line with the Commission s governance, this Office hereby issues ed institutions are required to jot later than November 17, 20 All concerns submit the necessary d CHEDRO online portal n 25. The submissions must in not limited to, the following: Ensure compliance with outcome based education (OBE) assessment reports and curriculum mapping matrices. lippine Qualifications Framework Submit Institutional Development Plans (IDP) aligned with the Phil (PQF) and relevant Policies, Standards, and Guidelines (PSGs). Attach proof of institutional accreditation status and quality assur «Include student enrollment data disaggregated by program, year (face to face, blended, or online). Non compliance may result in delay’ new programs OF courses. For further clarifications, please coordinat contact details above. Immediate and wide cooperation in ensuring timely submission improvement of higher education standards in the region. standards through documented ance certifications, if applicable. level, and mode of delivery permit renewals, and approval of ed processing of certifications, g and Evaluation Division at the his memorandum is requested. Your ports the continuous e with the Monitorin: dissemination of t! is highly appreciated as it sup| “ROGER HUGHES, ED D. \\\\ Regional Director \\"
    },
    {
        "image": "chedro2_synth_16_aug1.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines forme Office of the President E/ i. COMMISSION ON HIGHER EDUCATION 5) REGIONAL OFFICE Vill = Palo, Leyte Tel. Nos.: Tel: (07) 100 1539 Email: rovii ched gov ph MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 33, s. 2025 For Campus Administrators and Academic Officials Subject Clarifications on Faculty Qualification Standards Date 2 October 24, 2025 In line with the Commission s Ongoing initiatives to stren: igthen higher education quality and governance, this Office hereby issues the following dire ‘Ctive for strict compliance. All concerned institutions are required to submit th CHEDRO online portal not later than November 1 Not limited to, the following: Include student enrollment data disa (face to face, blended, or online). Provide updated faculty roster with complete credentials including highest educational attainment, teaching load distribution, and research output for the past academic year. Attach proof of institutional accreditation Status and quality assurance Certifications, if applicable. Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Non compliance may result in delayed processin new programs or courses. le necessary documentation through the 8, 2025. The submissions must include, but are iggregated by program, year level, and mode of delivery ig Of certifications, permit renewals, and approval of For further clarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your Cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. “KENNETH WEBB, PH D. Regional Director"
    },
    {
        "image": "chedro2_synth_16_aug2.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines Office of the President COMMISSION ON HIGHER EDUCATION 3| 3 REGIONAL OFFICE VIII Palo, Leyte Tel. Nos.: Tek: (07) 100 1539 rovii ched gov ph MEMORANDUM FROM THE REGIONAL DIRE No. No. 33, s. 2025 For Campus Administrators and Academic Officials Subject Clarifications on Faculty Qualification Standards Date October 24, 2025 In line with the Commission s ongoing initiatives to strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. All concerned institutions are required to submit the necessary documentation through the CHEDRO online portal not later than November 18, 2025. The submissions must include, but are not limited to, the following: Include student enrollment data disaggregated by program, year level, and mode of delivery (face to face, blended, or online). Provide updated faculty roster with complete credentials including highest educational attainment, teaching load distribution, and research output for the past academic year. Attach proof of institutional accreditation status and quality assurance certifications, if applicable. Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Non compliance may result in delayed processing of certifications, permit renewals, and approval of new programs or courses For further clarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. “KENNETH WEBB, PH D Regional Director"
    },
    {
        "image": "chedro2_synth_16_aug3.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines Office of the President oy COMMISSION ON HIGHER EDUCATION §| 3 REGIONAL OFFICE Vii Palo, Leyte Tet: (07) 100 4699 MEMORANDUM FROM THE REGIONAL DIRECTOR No, No. 33, §. 2025 For Campus Adminstators and Academic Officials Subject Clarifications on Facuity Qualification Standards Date Gctober 24, 2025 in tine with the Commission s ongoing initiatives io strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. Ail concemed institutions are required to submit the necessary decumentation through the CHEDRO online portal not later than November 16, 2025. The sudmissions must include, but are Not limited to, the following: include student enro lment data disaggregated by program, year levei, and mode of delivery (face to face, blended, or online). Provide updated faculty roster with compiete credentials including highest educational atlainment, teaching ioad distribution, and research outout for the past academic year Attach proof of institutional accreditation status and quality assurance certifications, if applicable. Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Non compilance may result in delayed processing of certifications, permit renewals, and approvai of new programs or courses. Foi further ciarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission Is highty appreciated as it supports the continuous improvement of nigher education standards in the region. “KENNETH WEBB, PH D. i Regional Director"
    },
    {
        "image": "chedro2_synth_16_aug4.png",
        "label": "chedro",
        "ocr_text": "k Republic of the Philippines 8; Office of the President 3 COMMISSION ON HIGHER EDUCATION 3 REGIONAL OFFICE VIII Palo, Leyte Tel, Nos.: Tet: (07) 100 1539 Email: rovili ched gov ph MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 33, 8. 2025 For Campus Administrators and Academic Officials Subject Clarifications on Faculty Qualification Standards Date October 24, 2025 In line with the Commission s ongoing initiatives to strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. All concerned institutions are required to submit the necessary documentation through the CHEDRO online portal not later than November 18, 2025. The submissions must include, but are not limited to, the following: Include student enrollment data disaggregated by program, year level, and mode of delivery (face to face, blended, or online). Provide updated faculty roster with complete credentials including highest educational attainment, teaching load distribution, and research output for the past academic year. Attach proof of institutional accreditation status and quality assurance certifications, if applicable. Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Non compliance may result in delayed processing of certifications, permit renewals, and approval of new programs or courses. For further clarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. KENNETH WEBB, PH D. Regional Director 4"
    },
    {
        "image": "chedro2_synth_16_aug5.png",
        "label": "chedro",
        "ocr_text": "OR NCH, si S Republic of the Philippines \\* fata */ Office of the President E/ re COMMISSION ON HIGHER EDUCATION 3 Ey REGIONAL OFFICE Vill Ss Ad Palo, Leyte sens Tel, Nos.: Tet: (07) 100 1539 Email: rovii ched gov ph MEMORANDUM. FROM THE REGIONAL DIRECTOR No. No. 33, s. 2025 For Campus Administrators and Academic Officials Subject Clarifications on Faculty Qualification Standards ion s ongoing initiatives to strengthen higher education quality and lowing directive for strict compliance. ;cessaly documentation through the he submissions must include, but are In line with the Commissi governance, this Office hereby issues the foll All concerned institutions are required to submit the net CHEDRO online portal not later than November 18, 2025. TI not limited to, the following: Include student enrollment data (face to face, blended, or online). Provide updated faculty roster with complete credentials including highest educational attainment, teaching load distribution, and research output for the past academic year. Attach proof of institutional accreditation status and quality assurance certifications, if applicable. Ensure compliance with coutcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Non compliance may result in delayed processing of certifications, new programs or courses. For further clarifications, pl disaggregated by program, year level, and mode of delivery permit renewals, and approval of ring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. lease coordinate with the Monitor KENNETH WEBB, PH D. \\\" Director"
    },
    {
        "image": "chedro2_synth_17_aug1.png",
        "label": "chedro",
        "ocr_text": "ident ER EDUCA ATION §& agov ph quailty and in tine with the weanance, in tation through the Include, DUE a! fhe nec mea to submit 2025. The oy euerissions mi than Novembe 44, 2 are nal attainment, including nighest |duce ter with red arch output for the n stains and quatity assu andards ia ve ie updated facully ros! jon, and re cations, Hf applica! documentes teaching 1 Attach proof o! i instituliona: pe ant Policies, Stan oermit renewals, and appreval of NS, hy the Monitoring ion Gi i memoranc suipporl 4g the continusus MARK {\\ Regional Birector"
    },
    {
        "image": "chedro2_synth_17_aug2.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines Office of the President 2 COMMISSION ON HIGHER EDUCATION 3) REGIONAL OFFICE! City of San Fernando, La Union Tel. Nos.: Tet: (04) 400 9449 Email: roi ched gov ph MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 36, s. 2025 For Campus Administrators and Academic Officials Subject Invitation to Regional Stakeholder Consultation Date October 27, 2025 In line with the Commission s ongoing initiatives to strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. Allconcerned institutions are required to submit the necessary documentation through the CHEDRO online portal not later than November 14, 2025. The submissions must include, but are not limited to, the following: Provide updated faculty roster with complete credentials including highest educational attainment, teaching load distribution, and research output for the past academic year. Attach proof of institutional accreditation status and quality assurance certifications, if applicable. Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Submit Institutional Development Plans (IDP) aligned with the Philippine Qualifications Framework (PQF) and relevant Policies, Standards, and Guidelines (PSGs). Non compliance may result in delayed processing of certifications, permit renewals, and approval of new programs or courses. For further clarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. MARK FOX, PH D. Regional Director"
    },
    {
        "image": "chedro2_synth_17_aug3.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines Office of the President COMMISSION ON HIGHER EDUCATION 2 REGIONAL OFFICE % City of San Fernando, La Union Tel. Nos.: Tet: (04) 400 3449 Email: roi ched gov ph MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 36, s. 2025 For Campus Administrators and Academic Officials Subject Invitation to Regional Stakeholder Consultation Date October 27, 2025 In line with the Commission s ongoing initiatives to ‘strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. All concerned institutions are required to submit the necessary documentation through the CHEDRO online portal not later than November 14, 2025. The submissions must include, but are not limited to, the following: Provide updated faculty roster with complete credentials including highest educational attainment, teaching load distribution, and research output for the past academic year. Attach proof of institutional accreditation status and quality assurance certifications, if applicable. Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Submit Institutional Development Plans (IDP) aligned with the Philippine Qualifications Framework (PQF) and relevant Policies, Standards, and Guidelines (PSGs). Non compliance may result in delayed processing of certifications, permit renewals, and approval of New programs or courses. For further clarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your Cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. MARK FOX, PH D. Regional Director"
    },
    {
        "image": "chedro2_synth_17_aug4.png",
        "label": "chedro",
        "ocr_text": "Republic of the Philippines Office of the President COMMISSION ON HIGHER EDUCATION §| REGIONAL OFFICE City of San Fernando, La Union Tel. Nos.: Tet: (04) 400 3449 Email: rol ched gov ph MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 36, s. 2025 For Campus Administrators and Academic Officials Subject: Invitation to Regional Stakeholder Consultation Date October 27, 2025 In line with the Commission s ongoing initiatives to strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. All concerned institutions are required to submit the necessary documentation through the CHEDRO online portal not later than November 14, 2025. The submissions must include, but are not limited to, the following: Provide updated faculty roster with complete credentials including highest educational attainment, teaching load distribution, and research output for the past academic year. Attach proof of institutional accreditation status and quality assurance certifications, if applicable. Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Submit Institutional Development Plans (IDP) aligned with the Philippine Qualifications Framework (PQF) and relevant Policies, Standards, and Guidelines (PSGs). Non compliance may result in delayed processing of certifications, permit renewals, and approval of New programs or courses. For further clarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. MARK FOX, PH D. _ i} Regional Director |"
    },
    {
        "image": "chedro2_synth_17_aug5.png",
        "label": "chedro",
        "ocr_text": "OFFICE nando, La Union fORKRANDUM Rom Yr ROM E REGIONAL DIREC Campy 8 Administrators and Acadumic OF Sudject Wilation te Regional Stakehay ed institutions EDRO ontin Rol litnited ta, i 5 to submit then ‘eter than November 14, 26 NE folowing Provide updated The Submissions must Inet, Ji for the pas N status anc quali “G ediuinat PDlicabls POush documented Feperts and curr Submit Institution: {PQE) and rei ulin Development he Philippine Qu ines (PSGs) layed provessing of 'S Framework compliance Hew program: 1BY result in ef cenificatio fease coordins the Mo Horing and Evaluati above. imme: eMmination of this mers"
    },
    {
        "image": "chedro2_synth_18_aug1.png",
        "label": "chedro",
        "ocr_text": "COMMISSION ON HIGHER ED REGIONAL O8 FE yyy Pak Leyte MEME SRANDUM PROM Pip re GHONAT NONO 68 5 2008 OS Ot Private High ucation insy hitions Submission of Updated tins titer October 18, 2025 ih ine witn the Comms einance, this Office my son s ONGOING initiatives tg i ereby issues the following d tion quality ar trengthen hiner educ, HECHVE for siviet o¢ pplance, All concerned festitions aTe required to gy rit the Hecessary documentation thy CHEDRO online portay Not igier than November 21, 2995 The si Not limited to, the rough the Submissions m; elude, but; Include student enrolment data Usaggregated (face to face, blende; Provide update: teaching load dis Dy program, year level, and mode of delivery dor onfing) faculty roster with om tribution, and researry Ensure compliance with eo: as: pele credentiats inciuding highest educ: HONS! attainment Ouipul for the past a cademts year, OMe Dased education {OBE Standards through Gosumente CUM ICU Mapping matrices Compliance May resuit in dek ved processing of AGW pr QPaIns OF cour Ses. For further clatifications, contact details above. ie sment reports Noi cerliications, permit fenewals, ang eo oval of please coord mired: le with the fa O and wice 1g timely subr of higher educati onitoring and Evaluation Division at the S8emination of thig memorandurn is requesied, Your Gated as it supports the cConBnuous: sefation in enguy WMprovement Mission is Righty appre, A Slandards in the region,"
    },
    {
        "image": "chedro2_synth_18_aug2.png",
        "label": "chedro",
        "ocr_text": "the President 20 REGIONAL OFFICE Vil Pato, Leyte Fei, Nos.: Tet (07) 085 9267 MEMORANDL No. No. 56, 5. 202 HONAL DIRECTOR For Heads of Private Highe Gucaiion insttutions Submis: of Updated Institutional Developmen Date October 46, 2025 in iine with ihe Commission s ong gevermance, this Office hereby ts: Ail concemed in: i te submit the neo CHEDRO online portal not later than November 24, 2025. The not lrnited a to, the folowing: NS ave req Include student enroliment dala disaggregated by program, yt (lace to face, blended, ar online}. Provide updated facuity roster with complete c: teaching load distributic: Ensure compilance with quicome based education (OBE) sian assessment reports and curriculum mapping matrices. i processing of ceri dinate with the M4 above. immediate and wide disseminatio cooperation in ensuring timely submission is highly appreciated ment of higher education standards in the region. impre’ MARY GARCIA, i u 4 COMMISSION ON HIGHER EDUCATION 2 ssary docurr edentiais inchiding highest lions, pen onitoring and of this memorandum is requested. Your A PL ntation through the ubmissions must include, bul are jevei, and mode of delivery catio’ i attainment, and research output for the past academic vear. dards through decumented it renewal tion Division at th a8 it supports the continu OBA |\\ Regional Director"
    },
    {
        "image": "chedro2_synth_18_aug3.png",
        "label": "chedro",
        "ocr_text": "Tel. Nos.: Tet: (07) 065 9267 MEMORANDUu: No. No. 58, s. 2025 For Subject Date In line with the governance, All Concemed institutions are required CHEDRO Online ‘M FROM THE REGIONAL DIRECTOR Heads of Private Higher Education institutions Submission of Updated institutional Development Plans October 16, 2025 '$ ongoing initiatives to strengthen hi \"Sues the following directive for ligher €ducation Quality ang Strict compliance, to submit the necessar \"y documentation through the Portal not later than November 21, 2025, The following: Submissions Must include, but are luding highest educational attainment, academic year Standards through documented IM is requested, Your highly appreciated as it Supports the Continuous cation standards in the Fegion. MARY GARCIA, DBA Regional Director"
    },
    {
        "image": "chedro2_synth_18_aug4.png",
        "label": "chedro",
        "ocr_text": "online, k Republic of the Philippines ‘o \\% Office of the President 2 COMMISSION ON HIGHER EDUCATION B REGIONAL OFFICE Vl Palo, Leyte Email: rovil ched gov ph Fel. Nos.: Tek: (07) 065 9267 ME MORANDUM I ROM THE RE GIONAL DIREC TOR No. No. 58, 8. 2025 Heads of Private Higher Education Institutions For ‘al Development Plans Subject Submission of Updated Institution Date October 16, 2025 jatives to strengthen higher education quality and following directive for strict compliance. cumentation through the Jude, but are mmission s ongoing initi fice hereby issues the quired to submit the necessary dow than November 21, 2025. The submissions must incl In line with the Cor governance, this Of ned institutions are re All concer! jot later CHEDRO online portal n not limited to, the following: Include student enrollment data disag: (face to face, blended, or online). Provide updated faculty roster with teaching load distribution, and research output for tht Ensure compliance with outcome based education (OBE) standar assessment reports and curriculum mapping matrices. permit renewals, and approval of Non compliance may result in delayed processing of certifications, new programs or courses. For further clarifications, please coordinate with the contact details above. Immediate and wide dissemins cooperation in ensuring timely submission is highly appre! improvement of higher education standards in the region. gregated by program, year level, and mode of delivery complete credentials including highest educational attainment, e past academic year. ‘ds through documented uation Division at the andum is requested. Your rts the continuous Monitoring and Eval ‘ation of this memor: ciated as it Suppo! MARY GARCIA, DBA. \\\\ Regional Director"
    },
    {
        "image": "chedro2_synth_18_aug5.png",
        "label": "chedro",
        "ocr_text": "af te Office of the Pr COMMISSION ON HIGHER EDUCATION REGIONAL OFFICE vit (UM PROM THE REGION. 4 DSRS PEG MEMOS, Heads of Private Higher Education insttubons J Gevelapment Plans 1, of Updated 115! Subject Subeni Getaber 15, 2025 Date 5 to strengthen higher education quality and a for sirick compliance. trough he inetd. oul are ang w eg the folowing dire: ve with the Coremission s Ong hereby issu aired to submit ihe A Novernber 24, 2025. int governance, this Office Aa concerned insti gions are red) CHEDRC online po J not tater nat finited 10, INE following: clude student srepliment data disaggregated py progam, yea! (iaceto tace, blended, of online! Provide updated faculty igaching joad distribution, and 12 earch output Ensure compliance with ouicame bases ducation (OBE) 8 assessment reports and curriculum mapping maiices. result in delays proceseing of sary documentation ions MUS jevel, and made of delivery with complete cred jals jckuding highest educational attainment, fine past goadennic year. neards tnrough documented rel FENEWeS, and approval ot on Division at he um ig fequested. “your 2 SONINUOMS with the Manito nadiate and wie oF senunation of this memo’ jimely submiss nis high appreciates ag supports th eguoalions standards in the fs gion. For further contact det sooperation i ensurtil sat of higher"
    },
    {
        "image": "chedro2_synth_19_aug1.png",
        "label": "chedro",
        "ocr_text": "MEMORANL No. No. 98, 8, 2025 THE REGIONAL DIRECTOR For of Private Higher Education ing indie n quality and hereby issues the following directive for sirict compliance. Med institutions are required to 2 On perial ne not limited io, the follow! sure compliance v ass Include student enrottm: oping matrices, it data disaggrega! (face to face Submit in: pdated xv fost ff mplete credentiais Including highest educational attainment, i distribution, and resear outpul for the past academic yeai may result in delayed processt REW POGIBINS Of Courses, ations, permit renewals, and approval of For lurther clarifications, please coordinate contact details above. eniTERTET and wide di with the Monitoring and Evatu; Division at the Semi memorandum is requested. Your He continuous LE ORR, PH. D. Zegional LY"
    },
    {
        "image": "chedro2_synth_19_aug2.png",
        "label": "chedro",
        "ocr_text": "ee PS. Mice Nae ON ON REGIONAL OFFICE! y Of Sat F PGHONAE DHREC FOR PUM EROM PtH MEMOKAN sie GAs 2OzE nor Education Ins Heads of Pruate rt fications an Facuity Qualification 5 Subwet Date November 03 tn fine with the Commission s governane wing dire Ail concerned insthutions are (ec! fed iG CHEDIRD online portat not late: than Nover otlowing not limited to, tv come pased education (0) sum mapping matices. we compliance with Out and cunic Ens: assessment report face to face, dlended, oF of ve) institutional Development Policies, Standards, and Gui ona? accreditation stat ity roster wily complete credet Submit (POF) and relevant Attach proof of Inst Provide updated facut gion, and research OUP TOF teaching joao distD Non compliance May new programs or Courses: Fer further clanfications, please onordinate vaith the Ft contact details above immediate ar eration in ensuling timely submtssio} ovement of high’ educate siandarus in the (e: submit the necessary dosumentanan t noer 27, 2075, The sudmissions Mu: enrolment data disaggtegated by prod wide diesemination of tn: and, (2 ites ONS varntards n higher educatlon quaitty and ctive for strict compliance rough the ist include, tut are BE) siangards through documented am, year level, ang mode of celtvei Phtippine Qualifications Framework care ent. assurance cenifications, (fap ais including highest edu pasenic year cational attanins past cations. gertail renewals. and approval oF jesull in delayed processing 6 cent on Division at the oniiosing and Evaiuat 3 yequested Your yorandiin uupports the ct ior GABRIELLE ORR, PRD Re; pocal Director"
    },
    {
        "image": "chedro2_synth_19_aug3.png",
        "label": "chedro",
        "ocr_text": "sk Republic of the Philippines aoc le ‘eu Office of the President ry a COMMISSION ON HIGHER EDUCATION 3 FI REGIONAL OFFICE i y City of San Fernando, La Union Tel. Nos.: Tel: (08) 786 8262 Email: roi ched gov ph MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 98, s. 2025 For Heads of Private Higher Education Institutions Subject Clarifications on Faculty Qualification Standards Date November 03, 2025 In line with the Commission s ongoing initiatives to strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. All concerned institutions are required to submit the necessary documentation through the CHEDRO online portal not later than November 27, 2025. The submissions must include, but are not limited to, the following: Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Include student enrollment data disaggregated by program, year level, and mode of delivery (face to face, blended, or online). Submit Institutional Development Plans (IDP) aligned with the Philippine Qualifications Framework (PQF) and relevant Policies, Standards, and Guidelines (PSGs). Attach proof of institutional accreditation status and quality assurance certifications, if applicable. Provide updated faculty roster with complete credentials including highest educational attainment, teaching load distribution, and research output for the past academic year. Non compliance may result in delayed processing of certifications, permit renewals, and approval of new programs or courses. For further clarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. GABRIELLE ORR, PH D. || Regional Director"
    },
    {
        "image": "chedro2_synth_19_aug4.png",
        "label": "chedro",
        "ocr_text": "St tte Republic of the Philippines Office of the President 2 COMMISSION ON HIGHER EDUCATION A REGIONAL OFFICE ~N y City of San Fernando, La Union is Email: roi ched gov ph ‘Tel. Nos.: Tet: (08) 786 8262 MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 98, S. 2025 Heads of Private Higher Education Institutions For Subject Clarifications on Faculty Qualification Standards Date November 03, 2025 n higher education quality and sion s ongoing initiatives to strengthe! lowing directive for strict compliance. jocumentation through the In ine with the Commis hereby issues the fol 5. The submissions must include, governance, this Office All concerned institutions are required to CHEDRO online portal not later than November 27, 202! not limited to, the following: h outcome based education (OBE) standards tht assessment reports and curriculum mapping matrices. «Include student enrollment data disaggregated by program, year level, and mode of delivery (face to face, blended, or online). Submit Institutional Developmen (PQF) and relevant Policies, Standards, and Guidelines (PSGs)- Attach proof of institutional accreditation status and quality assuranct Provide updated faculty roster with complete credentials including highest educational teaching load distribution, and research output for the past academic year. Non compliance may result in delaye ermit renewals, and approval of d processing of certifications, p' new programs or courses. For further clarifications, please coordinate contact details above. Immediate and wide disse! cooperation in ensuring timely submission is high improvement of higher education standards in the region. submit the necessary da but are rough documented Ensure compliance wit it Plans (IDP) aligned with the Philippine Qualifications Framework e certifications, if applicable. attainment, aluation Division at the randum is requested. Your rts the continuous with the Monitoring and Ev mination of this memo! ly appreciated as it suppor GABRIELLE ORR, PHD. | Regional Director"
    },
    {
        "image": "chedro2_synth_19_aug5.png",
        "label": "chedro",
        "ocr_text": "COMI MISSION MEMORA? No. No. 88, 6. 21 For dard Qualification y and in ne with the Commissian governance, this Office hereby necess AR co sed Institutions are required fo 8 CHEDR O online portal not later nan Now eae 27, 2028. The submissior imentation througn the Include, but are not limited to, the follow vei, and made of delivery Hons Framework Attach proof of institutional accre: Provide updated faculty rost faith COW teaching load distributton, and re! may resuil in delay: Division at the sted. YOur coordinate with the Me details above. tae disserinatior timely submission fs highly apps 7 education standards in the region. For further"
    },
    {
        "image": "chedro2_synth_20_aug1.png",
        "label": "chedro",
        "ocr_text": "k Republic of the Philippines eee le X (pha Office of the President S COMMISSION ON HIGHER EDUCATION 3| 3 REGIONAL OFFICE XII Koronadal City Tel, Nos. Tek: (02) 108 1971 i Email: roxii ched gov ph MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 133, s. 2025 For Directors of CHED Supervised Institutions Subject Invitation to Regional Stakeholder Consultation Date October 18, 2025 In line with the Commission s ongoing initiatives to strengthen higher education quality and governance, this Office hereby issues the following directive for strict compliance. All concerned institutions are required to submit the necessary documentation through the CHEDRO online portal not later than November 24, 2025. The submissions must include, but are not limited to, the following: Submit Institutional Development Plans (IDP) aligned with the Philippine Qualifications Framework (PQF) and relevant Policies, Standards, and Guidelines (PSGs). Include student enrollment data disaggregated by program, year level, and mode of delivery (face to face, blended, or online). Attach proof of institutional accreditation status and quality assurance certifications, if applicable. Ensure compliance with outcome based education (OBE) standards through documented assessment reports and curriculum mapping matrices. Non compliance may result in delayed processing of certifications, permit renewals, and approval of new programs or courses For further clarifications, please coordinate with the Monitoring and Evaluation Division at the contact details above. Immediate and wide dissemination of this memorandum is requested. Your cooperation in ensuring timely submission is highly appreciated as it supports the continuous improvement of higher education standards in the region. LOUIS MORGAN, DBA Regional Director"
    },
    {
        "image": "chedro2_synth_20_aug2.png",
        "label": "chedro",
        "ocr_text": "RIC Gr AER ED UCATION ‘REGION Koronaca! Ch UM PROM THE REGIONAL DIRE ote Me AEMORAND! tion through the de, pul ate AM concern DRO online poral sot bast mnited to, the follawing: tutional Development Pia os, Standards, and Guide! {data digaggregaiee by pr ar than Movember s (DP) align: Subrit fi (POF) and reiev de student 2, blended, oF OF proof of institutional ao Nance wilh GUTOOMe rogram, year approval of Norco new programs oF cOuISeS: For further cations, ph contact details above. a ino ¥ e with the Mentions and Evaluation Division at ine qnemorang requested Your supports the continuous bis MORGAN, DBA Regona: Director"
    },
    {
        "image": "chedro2_synth_20_aug3.png",
        "label": "chedro",
        "ocr_text": "COMM 493 8, 2025 NS NO For Subject governance, oncermed: Insti CHEERO ont! nol Henited institutional (face t Atlach proof of ze compl Hon compllance new programs of cours cations, plea For further clariti contact a cooperation In ens improvement T Ef iuiions are F porta not ta, the follow Development Pk i relevant POHCES, Standards, institutional oe with outc ome baS A mapping math i above. imi of higher educa! SSiON ON HIGHE REGIONAL OFFIC! sions jater than Now iment data disaga! tin delayed 1g timely submis Hon star supervised i cao 10 Regional Stakeholder ngoing initiative? toe to submit the ed educatl te ard Wide city stitutions. Sonsue ey education gu) ginen t sye for strict compbanice recess ember 24, 2025. Th eis TAUSE processing of certificall on i dards in the regio? LOUIS i amentation sraugh fey ane sciude, bul are pe,"
    },
    {
        "image": "chedro2_synth_20_aug4.png",
        "label": "chedro",
        "ocr_text": "COMM MEMORA No, No. 193, 5. 3 For Obeciors of CHED Supervised insitiuions ation to Regional Stakeholder Consultation skengthen higher education duality and dirsetive for foncemed institutions are required fo submit the neces CHEORO onilne portal not later than November 24, 202: Aoi limited to, the WEN. aty documentation through the The submission nelude, but are ulional Development Plans OOP? aligned with the Hippine Qualifications Framework (PQF) and relevant Policies, Stay lards, and Guidetines (PSGe), «Include student enrolment data disaggregated by (face to t OPIS), Atiach ‘stlutonal accradiation status an mpliance with cutcomebased Sesessment resorts and our regiam, yea level, and mode of Gellvery nd quadity ass ion vance certifications, if appitcabis, (OBE) standards through documented 8. ca uhen Mapping mate ay result in delayed processing of certifications, S OF COUTSEs. nifications, please coordinate with the Monitoring Ssontact details above. immediate and Sonperation in imi renewals, and approval of few progr For flurther o and Evatt: ion Division at the S memor: rece: LOUIS MORGAN, DBA Regional Director u ¥"
    },
    {
        "image": "chedro2_synth_20_aug5.png",
        "label": "chedro",
        "ocr_text": "—_ Republic of the Philippines Office of the President Ey COMMISSION ON HIGHER EDUCATION ¢) 5 REGIONAL OFFICE XII 3 A Koronadal City \"Savers ‘Tel. Nos.: Tet: (02) 103 1971 Email: roxi ched gov ph MEMORANDUM FROM THE REGIONAL DIRECTOR No. No. 133, 8. 2025 For Directors of CHED Supervised Institutions Subject Invitation to Regional ‘Stakeholder Consultation Da October 18, 2025 engthen higher education quality and initiatives to stre the following directive for strict compliance. tation through the the necessary document 24, 2025. The submissions must include, but are Commission s ongoing hereby issues are required to submit later than November In line with the governance, this Office ‘All concerned institutions CHEDRO online portal not not limited to, the following: Submit Institutional Development (PQF) and relevant Policies, Standart «Include student enrollment data disaggre! (face to face, blended, or online). Attach proof of institutional accreditation status and Ensure compliance with outcome based education assessment reports and curriculum mapping matrices. ult in delayed processing of certifications, Plans (\\DP) aligned with the Philippine Qualifications Framework ‘ds, and Guidelines (PSGs). gated by program, year level, and mode of delivery certifications, if applicable. quality assurance nted (OBE) standards through docume! Non compliance may res' permit renewals, and approval of new programs or courses. For further clarifications, please coordinate with thi contact details above. immediate and wide dissemination of this memorandum is requested. Your mission is highly appreciated as it supports the continuous cooperation in ensuring timely sul improvement of higher education standards in the region. e Monitoring and Evaluation Division at the Louis MORGAN, DBA | Regional Director"
    }
]