[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "classobserve",
        "ocr_text": "Marsh Cook School Gerson Centers, New Brandongide, Wy christopherballi gmaiig 574 3 180 Classroom Observation Summary Report Teacher rictin Horn Evaiwator: Wi Grade Level Suction: Room: Room 3 6 fnstreetions: For thie Ciessrogm Observation Summery 8 class observation for nO Gntive duration of the ciess wy this suromay fepOr as well as Dae ot Ean 40D ste of Evaluation: 1, Time of Evaluation: 2 04 Ply (S fasked witty Conducting aking down eg e WOSSary HOLES to be used in atached Tha e ‘whiator is V8DY tasked witty answering the Rhlowing 8 (5) cwastiong tnd providing 3 \"P8800 for hishhar ancwey, Question 1: fe the feactier able tw show Mastery of the lessens? Ves, the teacher was: that certain class, 9) Rent before she gave WS8 able te give able to show mastery of tha WaS wble to hands alt tre 0 activity 19 test the Sicier a coMmprehensiug Ssynthesi lessons she was gi Questions of the Students and M s isereing ang mastery, she 8 OF ihe entire discussion SCuSSING for Question 3 tp the tescheyr able te cregig OF ONMironmene that ie open ang welcoming for the students? Yes, the MEOATON Of the Classroom and fhe cess were Very welen: Ihe teacher entered thy iG not mMediaiety stact yi the She gilt fs about what they learned from the iast \"AIAG. InStgad, she ae Ware and she Blowdy transiti USSION, TRG and"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "classobserve",
        "ocr_text": "Marsh Cocok Schoo! 9191 Henderson Centers, New Brandensicn, WY 58564 christopherball gmaih2 576 3 130 Ciassroom Observation Summary Report Teacher rictin Horn Evatuater: i fie Grarte Level Section: 4 oD Dute of Pat et January 21, 2625 Room: Room 36 Time of Evaluation: 04 PM Instructions: For this Ciessroom Observation Summary Report, the evaiuator is tasked with conducting a class observation for ihe entire duration of the class while taking down necessary notes to be used in this summary report as weil as attached. The evaiuetor is hereby tasked with answering the following five (5) questions and providing a reason for his her answer. Question 1: Is the teacher able to show mastery of the lessons? Yes, the teacher was able to show mastery of the lessons she was discussing for that certain class. She was abie to handie ai! the questions of the students and fight before she gave an activity to test the student s leaming and mastery, she was able to give 2 comprehensive syrithesis of the entire discussion. Question 2: is the teacher abie tu create an environment that is open and welcoming for the students? Yes, the environment of the classroom and the ciass were very welcoming and open. When the teacher entered the ciass, she cid not immediately start with the discussion, nor did she grili the students abou what they learned from the last meeting. Instead, she ssked the students how they were and she siowly transitioned to starting the discussion."
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "classobserve",
        "ocr_text": "ferson Canters, Dew christopherbali omaib. 88564 576 3130 a ea .Marsh Cook Schoo! ie Classroom Observation Summary Report Teacher rig ti n Horn Gra: Hf Section: er A Date of Evaluation 70D 36 Time of Evaluation: 2: 04 PAA ry Question 1: fs the teacher able to show nrastery of the fessons? BIS the te ming for the cher able to create an environment that is apen and ents 8 were very we! natin"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "classobserve",
        "ocr_text": "real _Marsh- -Cook Sch ol ea ae christopherball@ Dgmaib2 576 3130 Classroom Observation Summary Report Kristin Horn Evaiuator: aWvitie ee Parker 40D Date of Evaluation: J “Time of Evatuation: 2: 04 PM Grate Level Section: Rear: Room a6 Question 1: fs the teacher abia to sow mm Yes, the teacher all the que eee are onment that is of ‘Yes, the en open. Whe digcussion exting agtgad, she 3 transition"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "classobserve",
        "ocr_text": ", Marsh Cook School 1 Henderson Centers, New Brandonsige WV 58564 christopherball gmaib2 576 3130 fala Al Classroom Observation Summary Report Teacher: ristin Horn Evaluator: VV illie arker Grade Level Section: 1 OD Date of Evaluation: january 21, 2025 Time of Sratuation: 04 PM \"y Report, the evaluator is tasked with conducting 2 class observation for the entire duration of the class while taking down necessary notes to be used in this summary report as well as attached. The evaluator is hereby tasked with answering the following five (5) questions and Providing a reason for his her answer. Room: Room 36 room Observation Summa Question 1: Is the teacher able to show mastery of the lessons? Yes, the teacher was able to that certain class. She was Tight before she gave an ac was able to give a coy show mastery of the lessons she was discussing for able to handle all the questions of the students and tivity to test the Student s learning and mastery, she ™mPrehensive synthesis of the entire discussion Question 2: Is the teacher able to create an environment that is open and welcoming for the students? Yes, the environment of t open. When the teacher discussion, nor did she g meeting. Instead, she asked the studer transitioned to Starting he classroom and the cl lass were very welcoming and ntered the class, she did not immediately start with the nts how they were and she slowly 9 the discussion"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "classobserve",
        "ocr_text": "Silva and Sons Academy Uss Krueger, FPO AE 12552 anthony1 S gmailes7 344 9164 Classroom Observation Summary Report Teacher Valerie May Evaluator: Regina Murphy Grade Level Section: 9 B Date of Evaluation: February 29, 2024 Room: Eom 78 Time of Evaluation: 6: 33 PM Instructions: For this Classroom Observation Summary Report, the evaluator ‘s tasked with conducting class observation for the entire duration of the class while taking down n jecessary notes to be used in ll as attached. The evaluator is hereby tasked with answering the following five (5) questions and providing a reason for his her answer. Question 1: Is the teacher able to show mastery of the lessons? Yes, the teacher was abl that certain class. She right before she gave ay was able to give a to show mastery of the lessons she was discussing for was able to handle all the questions of the students and in activity to test the student s learning and mastery, she comprehensive synthesis of the entire discussion, Question 2: Is the teacher able to create an environment that is open and welcoming for the Students? Yes, the environment Of the classroom and the class were very welcoming and Open. When the teacher entered the class, she did not immediately start with the discussion, nor did she grill the students about what they learned from the last meeting. Instead, she asked the students how they were and she slowly transitioned to starting the discussion."
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "classobserve",
        "ocr_text": "Silva and Sons Academy Uss Krueger, FPO AE 12502 anthony e gmailgs7 344 9184 Classroom Observation summary Report Regina Murphy Date of Evaluation: Febraty Grade Lovet Section ap bes Roo i 7 2B time of Evaluation: 6: 33 P MA Evaluator: pe, 2024 ysacnen Valerie May juator is tasked ceanchcting: wT sary notes te be usec it tagked wih engwering ine folowing: fngtretions: Fos this Classroom Observation Summary Repo. ne g observation %F he duration of the gigas while tax89 report as well 83 atigoned. The evaiuator is fer cons ard providing a reason for hisfner ansver five (6) 32! Queation T by the teacher? able to S28 magsiesy OF the fessone? teacher was able to show mastery of 1S jagaons she Was discussing for ihe at the au the students ant yes, shat cartain cles. She was able 16 Hen ne gave an activity 1 test the studant s 'earhing and mastery resis of the entte discussion. sight befor was a ple to give compre ensive 8) open and sige 2: bas tee teacher abe fo eroate a7 environment that is Ques weicoming (oF ihe students? *yes, the arearor ant of the ctoas! mando sed the Gast. she did oct apen. When dhe tescher erler Fon, nar did SNe gail the students about woat hey es the students HOW they were ane a assis meeting. ingigad, She ‘eanaitionad to aartng the Gseue"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "classobserve",
        "ocr_text": "Silva and Sons Academy USS Krueger, FPO AE 12552 anthony 6 gmailas7 s44 9164 Classroom Observation Summary Report Teachec Vaterie May Evaluator: Regina Murphy Grade Level Section: oB Date of Evatuation: February 28, 2024 mon Bot 78 marralatn 33 DM Instructions: For this Ciassroom Observation Summary Report, the evaluator is tasked with conducting class observation for the entire duration of the class white taking down necessary notes to be used in this summary report as well 2s attached. The evaiuetor is hereby tasked with answering the toltowing five (5} questions and providing a reason for hiser answer. Question 1: is the teacher able to show mastery of the Jessons? Yes, the teacher was able to show mastery of the lessons she was discussing for that certain class. She was able to handie all the questions of the students and Night betore she gave an activity to test the student s fearning and mastery, she was able to give comprehensive synthesis of the entire discussicn, Question 2: is the teacher able to create an environment that is open and welcoming for the students? ‘Yes, the environment of the classroom and the class were very welcoming and open. When the teacher entered the class, she did not immediately stast with the discussion, nor did she gril the students about what they learned from the last Meeting. instead, she asked the students how they were and she siowly transitioned to starting the diocussion"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "classobserve",
        "ocr_text": "va and Sons Academy 1s “1s se EPOAE 1 oe ne y bee creed anthony 16 qmaileany 344 9164 aire Classroom Observation Summary Report Regina Murony abuation: February 29, 2 i ok Q Instrustions: For this oom Obser Wy Report the evaluator is tasked with conducting 2 class observation for the entire duration of the class while faking down necessary notes fo be used in this summary report 4 cacht 1@ avalvator is herety tasked with answering the following question: agon for his her answer. Teacher Valerie May Evatuator: Grade Levei Section: Bate of Ev: 9B five (9) Yes, the teacher was able to show mastery of the lessens she was discussing for that certain class, She wes able to iudents and an activity to test the student s learning and mastery, she Question 2: is te teacher able to create ap environment that is oper and welcoming for the students? Yes, the environment of the classroom and the class were very welcoming and open. When the teachar entered the class, she did not immediately stat with the discussion, nis about what they lear ries transitioned to stariing the discussion"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "classobserve",
        "ocr_text": "Silva and Sons Academy enjey, FPO AE 12882 anthony 16 gmailex7. 344 0164 Classroom Observation Summary Report her: i E Evaluator Regina Yeache: Valerie May ee ad Grate Level Se ap Date of Evaluation: ty 29, 2024 Room: Resin 78 Viens of Evaluation: FS 33 PM a insteuctions: For thiz Classroom Observation Summary Report, the evaluator is lacked with conducting Glass observation for the entire duration of ihe class while taking down necessary nates fo by used i this summary report as weil as otlached, The evaiualor is hereby tasked with answering the following Bye (2) quastions anc providing 8 reason for histher ensveor, Question 1: is the tescher ebie te show mastery of the iossans? Yes, the teacher was able to show mastery of the het certain class. S right before sS0n8 She was discvesing for wits able to hancie ali tha questions of the students and she gave an activity to test the stuturt s leaming and mastery, to give a comprehensive synthesis of the entire discussi Question 2: fs the teecher able to create an environment that i epen and welcoming for the students? Yas, the envire open. When the 88, she ala not immediate \"y start dBCUssION, nor did she ori the students ahaut what they leamad fron tes last fhesting, instead, she azked the students how the vansitioned to starting the al"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "classobserve",
        "ocr_text": "Henry Wang Academy 91769 Sots Summit Sut 280, East Enca, DC 40440 michaelturner amates 959 8366 Classroom Observation Summary Report Teacher Brittany Nisisen Evaluator: Ped joore Grade Level Section: 2B Date of Evaiuation: june 03, 2024 Room: Roomy 44 Time of Evaiuation: 8: 53 PM Instructions: For this Classroom Observation Summary Report, the evaluator is tasked with conducting a class observation for the entire duration of ine ciass white taking down necessary notes to be used in this summary report as weil as attached. The evaluator is hereby tasked with answering the following five (5) questions and providing 4 reason for his her answer. Question 1: is the teacher able to show mastery of the fessons? ‘Yes, the teacher was able to show mastery of the iassons she was discussing for that certain cless, She was able to handle all the questions of the students end right before she gave an activity to test the student s learning and mastery, she was able to give a comprenensive synthesis of the entire discussion Question 2: is the teacher abie to create an environment that is open and welcoming for the students? Yes, the environment of the classroom and the class were very welcoming and open. When the teacher entered the class, she did not immediately start with the discussion, nor did she grill the stucents about what they leamed from the last meeting. instead, she asked the students how they were and she stovdy transitioned to starting the discussion,"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "classobserve",
        "ocr_text": "Teacher Brittany Nislson Evaluator: ney ore Grode Levet Section: 2B Date of Evaluation: ;, Reom: Roomy Aq dune 03, 2024 fistruntions: Far this Ciassrooin O1 ‘Mtustion: gy 53 Py OServation Summary Rep 2 class Observation for the he WY, the evaty ire duration of the CASS while tak this summary feport as well as atte Sveluator is heres fue (8) questions a 8d previding a reason for histher ans me of ator is tasken with conducting ng down in Vv NCtBS fo be used in dwith answering the following WO ¥98, the wacher wes able te show mastery of the tessons she Was dis that certain class, She was able to handle alt thi 'belore she gave an activity to fe give a comprener ng for fest the student istery, she nth Question 2: ts the teacher able ta create an ony welcoming for ironment Whe students? thst is open anc lass were 95, She did not immediate ts about what om the last they were and she slowly"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "classobserve",
        "ocr_text": "Evaluator: Amy Grade Level Section; PRINTABLE DOWNLOAD"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "classobserve",
        "ocr_text": "Wang {Academy ad a eisen 2 Level Section: teacher able to show mas oft i the questions of th cd student s leainir is of the was 4 Question the teac welcoming for the s"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "classobserve",
        "ocr_text": "Henry Wang Academy 1169 te 260, Eat Enc, DC aeno i michaelturner gmaiee gag sa8e aa a Classroom Observation Summary Report Teacher: grittany Nielsen Evaisator: any OOPS Grade Level Section: 28 Date of Evaluation: jine 03, 2006 Room: Roory 4 4 Time of Evaluation: 8 53 PM teuctions: For this Classroom Observation Si class chservation (or the entire duration of the clase while tak unig ck this summary report as weil ag altached, The evaluator is heraty nd proviaing reason for histher answer, Cuestion 4: 1s the teacher able to show mastery of the lessons? Yes, the igacher was able to show mastery of the lessens she was discussing for that certain class. She was ab! right before sha gave 4 Question 2: is the teacher able fe create an environment that is voen and wolcoming for the students? Yes, the environment of the classroom and the chi 2. When the teacher entered the class, she did not imin ion, Nor did she gril the st istead, she asked tre: ately start y ts about what they leamed from th he students how thay were and she siowly ed to starting the discussion"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "classobserve",
        "ocr_text": "‘ays. Port Brandt Vaughn institute ek harmonpeier gmahas 982 6882 a Classroom Observation Summary Report TeacherSharon Henry Evatcton Ratp nship HON Sanunry 18 2024 Grade Level Seciton. 6B Date of Evan. 2 Room 29 Time of Evaluation 4 2 07 AM Instructions For th 7 ODS y conducting a class ose n y fo be usi this summary /© ing the foliow ons and providing reas siner answer Question 1: fs the teacher abio to show mastery of the iessans? lessons she was decussing for as able to stow mastery of yudents and Yes, the ieact 2 was able to handie that certain nant batore she gave af aciivity t© le questions of the t s Hearing of the entire discussion enisive Synth ent that is open and Question 2: Js the teacher able to create an enaironm welcoming fer the studvats? and the class 9, she dio not ne students adout what they how they were and of tne classroo Yes, the envi on shen the teacher enter"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "classobserve",
        "ocr_text": "Brandt Vaughn Institute 516 Krista Keys, Port Maryview, MO 89324 harmonpeter gmais44 982 6862 ial iF Fl Classroom Observation Summary Report Teacher Sharon Henry Evaluator, lanvaniship Grade Level Section: 6B Date of Evaluation: January 14, 2024 Room: Room 29 Time of Evaluation: 1 2 07 AM Instructions: For this Classroom Observation Summary Report, the evaluator is tasked with conducting a class observation for the entire duration of the class while taking down necessary notes to be used in this summary report as well as attached, The evaluator is hereby tasked with answering the following five (5) questions and providing a reason for his her answer. Question 1: Is the teacher able to show mastery of the lessons? Yes, the teacher was able to show mastery of the lessons she was discussing for that certain class. She was able to handle all the questions of the students and right before she gave an activity to test the student s learning and mastery, she was able to give a comprehensive synthesis of the entire discussion. Question 2: Is the teacher able to create an environment that is open and welcoming for the students? Yes, the environment of the classroom and the class were very welcoming and open. When the teacher entered the class, she did not immediately start with the discussion, nor did she grill the students about what they learned from the last meeting. Instead, she asked the students how they were and she slowly transitioned to starting the discussion."
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "classobserve",
        "ocr_text": "eye Brandt V ughn Institute i Classroom Observation Summary Report FeachecSharon Hi Eva Blankenshi Grade Level an Date of Evaluation: january 14, Time of E a class 0 reason for of the entire Question 2: welcoming for the stu"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "classobserve",
        "ocr_text": "Brandt Vaughn Institute 516 Krista Keys, Port Maryview, MO 89324 harmonpeter gmai44 982 6862 lalla Classroom Observation Summary Report Teacher Sharon Henry Evaluator, lancership Grade Level Section: 6B Date of Evaluation: January 14, 2024 Room: Room 29 Time of Evaluation: 4 2 07 AM Instructions: For this Classroom Observation Summary Report, the evaluator is tasked with conducting a class observation for the entire duration of the class while taking down necessary notes to be used in this summary report as well as attached. The evaluator is hereby tasked with answering the following five (5) questions and providing a reason for his her answer. Question 1: Is the teacher able to show mastery of the lessons? Yes, the teacher was able to show mastery of the lessons she was discussing for that certain class. She was able to handle all the questions of the students and right before she gave an activity to test the student s learning and mastery, she was able to give a comprehensive synthesis of the entire discussion. Question 2: Is the teacher able to create an environment that is open and welcoming for the students? Yes, the environment of the classroom and the class were very welcoming and open. When the teacher entered the class, she did not immediately start with the discussion, nor did she grill the students about what they learned from the last meeting. Instead, she asked the students how they were and she slowly transitioned to starting the discussion."
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "classobserve",
        "ocr_text": "Brandt Vauann Institute 516 Kiista Keys, Port Maryview, MO 89324 harmonpeter gmay41 932 aa82 Classroom Observation Summary Report Evaluator, Raiph Blankenship Date of Evaluation: sanuary 14, Tine of Evaluation: 4 2 ‘OF AM haron Henry Grade Level Section: 6B wn Observation Summary Repxst, the evaly is tasked with conducting 2 duration of the class while tahing down ne fo be used in ag altgched. The evaluator is hereby fesked with answering ine following ihis summary raped es five (5 ng and providing 3 reason for histher answer, Question 1: Is the teacher able to show meatery of the lessen? to show mastery of the tassons she was discussing for that cavtain clase, Sho was able to handie at ations of the students andl ciivity to test the student s lawming and mastery, she right belore she gave an a was able to give u comprehensive synthesis oF the entire discussion Question ts the teacher able fo create ant environment that is open and welcoming tor the students? re very welcoming rely start wi Yes, the environment of the classroom and the class wer fer entered the class, She gid t _ ner did she ore med from the tast meeting, instead, sho agkad tie studenis how they wer and she ciowly yransitioned fo starting the discussion the students about what they"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "classobserve",
        "ocr_text": "Morton, Patterson and Herman cademv 530 Owens Landing Suite 861, Lake Davidland, AR 81866 davisandrew gmaibao3164610 Al Classroom Observation Summary Report Teacher: Vanessa Perry Evaluator: Joseph Maldonado Grade Level Section: 9E Date of Evaluation: july 48, 2025 Room: Room 6 8 Time of Evaluation: 2 1 7 AM Instructions: For this Classroom Observation Summary Report, the evaluator is tasked with conducting class observation for the entire duration Of the class while taking down necessary notes to be used in this summary report as well as attached. The evaluator is hereby tasked with answering the following five (5) questions and providing a reason for his her answer. Question 1: Is the teacher able to show mastery of the lessons? Yes, the teacher was able to show ma: that certain class. She was able to hi fight before she gave an activity to t was able to give a comprehen: istery of the lessons she was discussing for jandie all the questions of the students and fest the student s learning and mastery, she 'sive synthesis of the entire discussion. Question 2: Is the teacher able to cre ate an environment that is open and welcoming for the students? Yes, the environment of the classroom and the class were very welcoming and open. When the teacher entered the class, she did not immediately start with the i he grill the students about what they learned from the last meeting. Instead, she asked the students how they were and she slowly transitioned to Starting the discussion."
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "classobserve",
        "ocr_text": "Morton, Patterson and Herman Academy 526 Caves Landing Site G4 davisandrew gm: fond, AR 81868 18403164610 Classroom Observation Summary Report dwteaor, Joseph Maidonade Grade Level Section: oF Sate of Evaluation: tity 48, 2025 Reom: Rom 68 Time of Evelsation: 4 7 AM instructions: For this Classroom ervation Summary Report, the evaluator is lacked with conducting a class observation for the entire dural 8 while taking down necessary notes to be weed in this summary repert as well es attached. The evaluator 1s hereby tasked with answering the following five (33 questions aext pr ‘i y for histher answer, Tessher Vanesss Peiry Question 1: is the teacher eble to show mastery of the lessons? Yes, tha teacher was abie t chow mastery of the lessons she was discussing for that certain class. She was able to handle ali tha questions of the students and right befere she gave an activity to test the student s ieaining and mastery, she was able fo give comprehensive synthesis of the entire discussion. Question 2: is the tsecher able to create an enulronment that is open and welcoming for the studenia? isonment of the classroom and the class were very waiooming and open. When the teacher entered the cizss, she did riot knmediately start wih the discussion, nor did she gril the students about what they ieamed from the lest eneoting. instead, she asked the students how they were end she siowiy, i"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "classobserve",
        "ocr_text": "Morton, Patte: F ESO. and Herman Jland AR 61686 econ davisandrew gmaibags164610 al A Classroom Observation Summary Report YeasherVanassa Parry fatenon seoseeh, Maidonada Grade Level Section: oF Date of Evaluation: 10. 49 Jury 18, Room: Room Time of Evaluatic: ‘2: 4 7 AM lastructions (Ov is te a class observa: necessa this summary by tasned with five (5) questions mary Raper, the ev: ire duration of the class white ea. 7 hed with cond: notes t be used in wering the following: he evaluator is A westion 9: is the feachor abie to show mastery of the lessons? Yes, the teacher was able that certain class. She wa caw mastery of the lessons she was discussing for abie to handle afi the questions of the stude: light before she gave an activity te test the studer ng and m was able to give a compienens' entire discussion ie ery, she 2 synthesis of U Question 2: Is the teacher able to create an environment thet is open and welcoming for the students? Yes, the environment of the cf open. When the te: enteret discussion, nor didi she gril th meeting. insivad, the class were very welcoming a d the class, she did not immediately stant with the students sbout what they learned from the las! she asked the students haw they were and ansitioned to starting the discussion he slowly"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "classobserve",
        "ocr_text": "Morton, Patterson and Herman 530 Owens Landing i hgater Weviland AR 81866 davisandrew gmaiteao31 64610 lala! Classroom Observation Summary Report Evaluator: Joseph Maldonado Date of Evaluation: July 18, 2025 Grade Level Section: OE Room: RooIQGQB Time of Evaluation: 2. 4 7 AM Teacher: Vanessa Perry asked with conducting ry notes to be used in wering the following ions: For this Classroom Observation Summary Report, the evaluator is t for the entire duration of the class while taking down necessal II as attached. The evaluator is hereby tasked with ans\\ iding a reason for his her answer. Instructi a class observation this summary report as wel five (5) questions and provic to show mastery of the lessons? to show mastery of the lessons she was discussing for 1s able to handle all the questions of the students and the student s learning and mastery, she nthesis of the entire discussion. Question 1: Is the teacher able he teacher Was able ss. She wai an activity to test comprehensive Sy! Yes, t! that certain clas fight before she gave was able to give Is the teacher able to create an environment that is open and Question 2: yr the students? welcoming fo! the class were very welcoming and e did not immediately start with the learned from the last ind she slowly Yes, the environment of the classroom and open. When the teacher entered the class, she discussion, nor did she grill the st meeting. Instead, she asked the students how they were a! transitioned to starting the discussion."
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "classobserve",
        "ocr_text": "Morton, Pa pester and Herma davisandrew gmaibaosieae10 eee Classroom Observation Summary Report TeacherVanessa Perry Evaluator: Senate Mialdonade Grade Level Saction: Mate of Eveiuation: ja, 9 e July 18, 202! Room: Roonrg 6 Time of Evaluation: Pa 4 7 ne fnsttuctians: For this Classroom Observation Summary Report, the evaluator is tasked with conducting ve duration of the class while taking down necessary notes [o be 1 immary report svaiuator Is hereby tacked with ans five (5) questions and providing a reason for histher answer. this Question 4: is the teachuy eble fo show tnastery of the iessons? cher was able how mastery of the lessons she was disc: class. She was able to na: tng tor students was able to give a comprehensive synthesis of the entire discussion Question 2: Is the teacher able fo create an environment that is open and welcoming for tire students? Yes, the anvir of the class oper, When ne teacher e tered t vo ond the class were very welcoming and tudents about what they ieamed from 1 meeting. instead, oh the students how they were and she slowly transitioned to starting the discussion"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "classobserve",
        "ocr_text": "Clark Hill College 469 Alan Field Sute 939, New Nethanmauth, GAS rpark gmail corges9394690 Classroom Observation Summary Report Teacher: Michaela Wright Evaluator: Katherine enry Grade Level Section: 9E Date of Evaluation: niqy 41, 2025 Room: Roo 0) 4 Tire of Evetuation: |< 59 AM Observation Summary Report, the evaluator is tasked with conducting ‘ss while taking down necessary notes fo be used ia tasked with answering {he following: Instructions: For this Classroom class observation for the entire duration of the clat this summary report as weil as attached. The evaluator is hereby five (5) questions and providing a reason for his her answer. Question 4: Js the teacher able to show mastery of the lessons? ‘Yes, the teacher was ab e to show mastery of the tessons she waS discussing for that certain class. She was able to handie ali the questions of tne students and right before she gave 2n activity to test the student s earning end mastery, she was able to give a comprehensive synthesis of the entire discussion. Question 2: Is the teacher able to create un environment that is open and weicoming for the students? lass were very welcoming and Yes, the environment of the classroom and the cl not immediately start with the teacher entered the class, she did"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "classobserve",
        "ocr_text": "vn ClAtk Hill College eld Suite 9: Tpark g Classroom Observation Summary Report Teacher: Michaela Wright Evaluator: Kath erine e Grade Level g Section: Room: Room 0) 1 ni Date of Evaluation: \\yay 11, 2025 4 59 AM Time of Evaluation: Question 2: Is the teacher able to create an environment that is open and welcoming for the students? Yes, the environment of the Classroom and the Class were very welcoming and open. When the teacher entered the class, she did not immediately start with the discussion, nor did she grill the students about what they learned from the last Meeting. Instead, she asked the Students how they were and she slowly transitioned to Starting the discussion."
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "classobserve",
        "ocr_text": "Clark Hill College 3469 Aten Field Sue 939, New Nathanwnth, GA 52927 rpark gmail cormpesa3s4600 Classroom Observation Summary Report Teacher: Michaela Wright Evaluator: K, Hell Grade Level Section: 9E Date of Evaluation: yay 44, 2025 Instructions: For this Classroom Ooservation Summary Report, the evakuator is tasked with concucting a class observation for the entire duration of the class while taking down necessary notes to be used in this summary report as weil 2s attached. The evatuator is hereby tasked with answering the foliowing five (5) questions and providing a reacon for his her answer. Question 1: is the teacher able to show mastery of the lessons? Yes, the teacher was able to show mastery o/ the lessons she was discussing for that certain class. She was abie to handle ail the questions of the stucents and right before she gave an activity to test the student s leaming and mastery, she was abie to give a comprehensive synthesis of the entire discussion. Question 2: is the teacher able to create an environment that is open and wetcoming for the students? Yes, the environmant of the classroom and the class were very welcoming and open, Wher the teacher entered the class, she did not immediately start with the discussion, nor did she grill the students about what they teamed from the last meeting. Instead, she asked the students how they were and she slowly transitioned to starting the discussion."
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "classobserve",
        "ocr_text": "Clark Hill College HES Aten Fikd Susta 939, Hew Nathanmoutiy GA E3507 \"park gmail compgoasagng Classroom Observation Summary Report Teacher: HHichsela Wright Seat: Katherine t Gracie Level Section: B) (= Dale of Evaluation y sy 41, 2025 Tins Reon: Roonrg ¢y i of Evaluation: 4 59 AM Report, the evalustor is tasked: 88 wile toning down PECBSSETY 7 ‘aiudlor is hereby taske: 1g 8 reasce for histor answer fustructions: For this Ciassroan Observation Sum: 8 GlaS3 Observation for the entire Suration af the this summary repart as ff with condhacting S10 be ux Sitowering ts fei Me (3! questions eng provigi Question #: is the feecher able te Show mastery af the fessons? w Mastery of the lessons she was discus he was able to handle all the questions of the ‘ant before she gave an activity to test the Student s learning ana 4 comprehensive synthesis of the entire Guostion &: ts the teacher abie to create an eavironment that is open anc Wwalvoming for the students? Yes, the environment of th open. Whan the tescher a: classrcom and the class were ered the Class, she did not im did she gil the stuvents about what they ieamed from the fast stealing. Instead, she asked the Students how 4 2 and she slowly transitioned to Starting the disc Y welcoming and mediately star with the"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "classobserve",
        "ocr_text": "veo fark Hill College L '69 Allen Field Suite 939, New Nathanmouth, GA 53927 rpark gmail corgsg9394600 fl Al fl Classroom Observation Summary Report Teacher: Michaela Wright coe Grade Level Section: 9E Date of Evaluation: yay 44, 2995 Room: Room .) 1 Time of Evaluation: . 59 AM Instructions: For this Classroom Observation Summary Report, the evaluator is tasked with conducting Class observation for the entire duration of the class while taking down necessary notes to be used in this summary report as well as attac ched. The evaluator is hereby tasked with answering the following ‘Wve (5) questions and providing a reason for his her answer Question 1: Is the teacher able to show Mastery of the lessons? Yes, the teacher was able to show that certain class. She was able t fight before she gave an activity t was able to give a compreh mastery of the lessons she was discussing for 'o handle all the questions of the students and test the student s learning and mastery, she lensive synthesis of the entire discussion. Question 2: Is the teacher able to create an environment that is open and welcoming for the students? Yes, the environment of the classroom and the class were very welcoming and open. When the teacher enter red the class, she did not immediately start with the discussion, nor did she grill the students about what they learned from the last meeting. Instead, she asked the students how they were and she slowly transitioned to Starting the discussion."
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "classobserve",
        "ocr_text": "Velazquez PLC Institute Classroom Observation Summary Report Teacher: Melissa Elis Evatuat die Level Section: a Date of 6 D ate of Room: Renee 58 Time of Evaiuation: 6 Jnstrustions: For this Classroom O, class observation for the entire duration of the class white t this summary report as well as attached. The evaluator is hereby tasked five (5) questions ang providing reason fe ng down necessary note: ering the follon disther answer Guestion 7: is the teacher able to show mastery of the lessens? ‘Yes, the teacher was able te show mastery of the that certal She was able to handie all right before she gave an activity tthe student s tea ea comersher thesis of the to fe was able to er able to create an environment that is open and ts? Question 2: I the tea wolcoming for the stude: Yes, the environment of the classroom and the class open. When the teacher entered the siass, she dic not in discussion, ner did sh the stuclents about what they learned from the inet yigeling. Instead, she asked the students how they were and she slowly transitioned te starting the discussion."
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "classobserve",
        "ocr_text": "Velazquez PLC Institute 25 Myers Vista, West Jonathantown, iL agAes amanda& @omailexs620 n94 7 Classroom Observation Summary Report Yeacher Motiese Eli Batters Donald Lewis Grade Level Section: Bote of Evaluation: Qeroner 24. 2025 6D Roan: Roor 358 Tine of Evaluation: 6 4 5 PM smary Report, the evaluator is tasked wetP conducting class while taking down Necessary NOMS fo be used in Mary report as well as attached The svaivator hereby tasked with saswering the fotewing Bye (3) questions Wi, dnstractions: For this Classroom Observation Sur 4 dass coservation for the anties duration of the this Reestion 1 ls the teecher able 0 show mastary of the lessons? Vas, the teacher was able to show me ‘ety OF the lessons she was dis that certain: dass, She was able to handie ali the questioss fight betore she Gave an actn learning and maste to give Comprehensive synthesis of the entire discussion, sting for she Question 2: is the teacher abies fe create an environment that is Open eng weicsuning for the students? Yen, the enviconment of the classroom and the as open. When the teacher entered the class, she discussion, nor did she gri SS Bbout what they learned irom the iast meeting. instead, she asked the sucents how they were and she slowly transitioned to starting the discussion, SR WETS VEry Welcoming and ditt not immediately etact with the"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "classobserve",
        "ocr_text": "Velazquez PLC Institute 2995 Myers Vista, West Jonathantown, IL 88865 amanda85 gmaile4 620 0917 Classroom Observation Summary Report Teacher Melissa Ellis evanater: Donald Grade Level Section: 6D Date of Evaluation: October 24, 2023 Room: Room 58, Time of Evaluation: 6 1 5 PM Instructions: For this Classroom Observation Summary Report, the evaluator is tasked with conducting a class observation for the entire duration of the class while taking down necessary notes to be used in this summary report as well as attached. The evaluator is hereby tasked with answering the following five (5) questions and providing a reason for his her answer. Question 1: Is the teacher able to show mastery of the lessons? Yes, the teacher was able to show mastery of the lessons she was discussing for that certain class. She was able to handie all the questions of the students and right before she gave an activity to test the student s learning and mastery, she was able to give a comprehensive synthesis of the entire discussion. EDITABLE Question 2: Is the teacher able to create an environment that is open and PRINTABLE welcoming for the students? Yes, the environment of the classroom and the class were very welcoming and open. When the teacher entered the class, she did not immediately start with the discussion, nor did she grill the students about what they learned from the last meeting. Instead, she asked the students how they were and she slowly transitioned to starting the discussion. INSTANT DOWNLOAD"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "classobserve",
        "ocr_text": "Velazquez PLC Institute 2995 Myers Vista, West Jonathantown, IL 88865 amanda85 gmaile4 620 0917 Classroom Observation Summary Report Teacher: Melissa Ellis Evaluator: onald Grade Level Section: 6D Date of Evaluation: October 24, 2023, this summary report as well as attached. The evaluator is hereby tasked with answering the following five (5) questions and providing a reason for his her answer. Question 1: Is the teacher able to show mastery of the lessons? Yes, the teacher was able to show mastery of the lessons she was discussing for that certain class. She was able to handle all the questions of the students and Fight before she gave an activity to test the student s learning and mastery, she was able to give a comprehensive synthesis of the entire discussion. EDITABLE Question 2: Is the teacher able to create an environment that is open and PRINTABLE welcoming for the students? Yes, the environment of the classroom and the class were very welcoming and discussion, nor did she grill the students about what they learned from the last meeting. Instead, she asked the students how they were and she slowly INSTANT DOWNLOAD"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "classobserve",
        "ocr_text": "Velazquez PLC Institute 2995 Myers Vista, West Jonathantown, IL 88865 amanda85 gmaile4 620 0917 Flr Al Classroom Observation Summary Report Teacher: Melissa Ellis Evauator: Donald ewls Grade Level Section: 6D Date of Evaluation: October 24. 2023 Room: Room 5B Time of Evaluation: 6 1 5 PM Instructions: For this Classroom Observation Summary. Report, the evaluator is tasked with conducting Class observation for the entire duration of the class while taking down necessary notes to be used in this summary report as well as attached, The evaluator is hereby tasked with answering the following five (5) questions and providing a reason for his her answer Question 1: Is the teacher able to show mastery of the lessons? Yes, the teacher was able to show mastery of the lessons she was discussing for that certain class. She was able to handle all the questions of the students and right before she gave an activity to test the student s learning and mastery, she was able to give a comprehensive synthesis of the entire discussion Question 2: Is the teacher able to create an environment that is open and welcoming for the students? Yes, the environment of the classroom and the class were very welcoming and d the class, she did not immediately start with the students about what they learned from the last meeting. Instead, she asked the Students how they were and she slowly transitioned to starting the discussion"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "classobserve",
        "ocr_text": "2 2 Colles az College Jennings Ls amber: Classroom Observation Summary Report a Jones 1E Room Rec 370 Time of Evaive question 2 ts vaeicomig for"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "classobserve",
        "ocr_text": "Jennings Lopez College 629 Kathryn Trail Suite 026, South Charles, KY 71232 amberkelly gmail4ag0 940 4087 ial fF Fi Classroom Observation Summary Report Teacher Cynthia Jones Evaluator: eli sa Grade Level Section: 1 E Date of Evaluation: October 28, 2023 Room: Room 7) Time of Evaluation: T: 1 4 AM Instructions: For this Classroom Observation Summary Report, the evaluator is tasked with conducting a class observation for the entire duration of the class while taking down necessary notes to be used in this summary report as well as attached. The evaluator is hereby tasked with answering the following five (5) questions and providing a reason for his her answer. Question 1: Is the teacher able to show mastery of the lessons? Yes, the teacher was able to show mastery of the lessons she was discussing for that certain class. She was able to handle all the questions of the students and right before she gave an activity to test the student s learning and mastery, she was able to give a comprehensive synthesis of the entire discussion. Question 2: Is the teacher able to create an environment that is open and welcoming for the students? Yes, the environment of the classroom and the class were very welcoming and open. When the teacher entered the class, she did not immediately start with the discussion, nor did she grill the students about what they learned from the last meeting. Instead, she asked the students how they were and she slowly transitioned to starting the discussion."
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "classobserve",
        "ocr_text": "Jennings Lopez College vio Kasnryn Trae Sate 076. SouH Chaves, 6 W292 amberkelly gmailase 940 4087 Classroom Observation Summary Report yeacher Cynihia Jones Evaluator: Melissa ambdie Date of Evaluation: October 28, 2023 Grade Level Section: 4 Ee Room: Room 7 () Time of Evaluation: T: 4 4 AM ingeructions: For ts Classroom Observation Summay a class observation for the entire duration of the class while taki this summary report as wail as attacned. The evakiator 's pereby feve (5) questions and providing reason for hisher answe! Repori, the evaluator is tasked with) conducting ry notes to be used in ing down 1ecesst tasked with answering the folowing cher able to show mastery of the fessor8? ssons she wes discussing for of tne students and and mastery, she BSION. Question 1: Is the tes was able to show mastel She was able to handis ait the questions ivity to test the student s: jearning rehensive synthesis of the entire discu! ‘Yes, the teacher ry of the te: that certain class. night before she gave ar act was able to give 8 Comp! Question 2: 1s the teacher able tO create ar environment that is open and weicoming for the students? Yes, the enviranrnent of the cisssroom and the class were very welcoming 3nd When the teacher entered the lass. she did nek kenmediately start with the {the students avout What they learned from ine tast wed she slowly discussion, Nor did she gr meeting. instead, ghe asked the students how they were 8 transitioned to starting the aiscussion."
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "classobserve",
        "ocr_text": "Grade Level See tion: Room: dbestres. StlORS: Fer th 8 Cl88S obgey ration oF ty to hare AVE BN activity to tess Sive NUESHION 2: te she teacher wolvoming ter the studen 4610 to eres, is? AS an ery Vironriens thas is GRO? arep"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "classobserve",
        "ocr_text": "pez College ‘Sout Chattes, KY 7 Jenning 629 amberkelly gmallasg 940 4087 Classroom Observation Summary Report eacher Qynthia Jones Evelvate M Hes Sambie Date of Evatuation: Octoher 28, 202 of Evatuation: 7 44 AM Grade Lovel Section. 4 E Reon: Room 7 o Time svation Gurnmary Re while taxing owen instruetions: For this Class 0o! oO observation for the er n of ihe ok The evaluator is A for his her anSWEr this five (5) questions: and providing ee paasor tery of the lessons? Question fc ie He teacher able fo show 0 ei she was diseu ations af the students anc ry to test the student ntnesis of the ent t before she gave an act ghle to give a comprehensive s sre discussion. a1 environmers tat is open and is the teacher bie to create eeiente? Question welcoming for the s' coming end cart with the: environment of the ye open. When the teacher &' tered the C1688, discussion, nor did she gi ne students shoul wit the sudents how they meeting. insiead, she ashe iransitionet 49 starting the disc"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "classobserve",
        "ocr_text": "Hughes LLC Academy 66406 Smith Steam Apt 897, Lake Jenner, Vi 82472 burkecraig gmail cg236628 10 Classroom Observation Summary Report Teacher: auren Rodgers Evaivato:: {Holly ewis Grade Level Section: 7E Oate of Evaluation: October 12, 2024 ‘comment ‘meena 2 413 AM Yes, the environment of the classroom ar Open. When the teacher entered the class Gtscussion, nor did ste uril the stacents about what they learned from the love Meeting, instead, she asked the stucents how they were and she slowdy it fo starting the discussion, id the class were very welcoming and She did not immediately start with the"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "classobserve",
        "ocr_text": "Hughes LLC Academy 66486 Sman Stream Apt 897, Lake Jennifer, v1 82472 burkecraig gmail 9 236628 10 Classroom Observation Summary Report Teacher: auren Rodgers Evaluator: Holly Lewis Grade Level Section: 7E Date of Evaluation: Octobe, 12, 2024 Time of Evaluation: 2: 1 3 A M 'Ssroom Observation Summary Report, the evaluator is tasked with conducting the entire duration of the class while faking down necessary notes to be used in well as attached. The evaluator is hereby tasked with answering the following Providing a reason for his her answer. this summary report as five (5) questions and, Question 1: Is the teacher able to show mastery of the lessons? Yes, the teacher was able t lo show mastery of the les: that certain Class. She wa: S able to handle all the arning and mastery, she was able to give a comprehensive synthesis of the entire discussion"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "classobserve",
        "ocr_text": "siohes, fo ~itcademy Evatuator Holly ewis Date of Evatuation: 144 ers Grace Levet a Sect Roum: Reo, SOSSGry non OF 1S hereby tasked wip Mer answer SHSWEING the toliowng Question t: Is the teacher able to show Mastery of the lescons? Question 2: ts bie to create an anvironment that 15 6, welcoming for the $7 pen ang"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "classobserve",
        "ocr_text": "s LLC Academy ceamn Spt 807, Lake Jenner, vi out aig amail 96236628 19 urkect Classroom Observation Summary Report gyatuator, POlly Yaacher: auren Rodgers Lewis Date of Evataation: October 12, 2 Grade Lowal Section: 7 a Room: Roomy 44 ‘inne of Evaluation: oO: 4 cs AK Vi Instructions: FOr this Classroort Observation Summary Report, ihe evaluaion 'S fankedt! with conductag a ojass observation for the entire Craton of the class wake taking Gown 1 to be used 8 this summery rgpeet aS wel ag abiached. The avaivater hereby tasked wih five (8) questions end prowiiing B reason for Risfher answet eS answer Question ffs he teacher able to show mastery of the fessons? scussing for denn arch vy. she a ‘vas, the teacher wi hig to Show ifs of he fessone she sae de that certzin class. She WAS abie te handle afi the ques 3 of tre atte Aight before she gave an activ 0 test the student s arning and mast was able to give camnprehensive: synthesis of the endive discuseie Question 2: fs the igacher able to create an environment that is open and welcaming for ihe students? of the classroom and the class were very welcoming ard 4 ihe clase, she Gai net immediataly start with the _nor did she grill the students about what they jearmed from the ist Zag the suGents how they were gnd she slowly dig swarting the discussion. Yas, the environs: open. Wher the teacher enter"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "classobserve",
        "ocr_text": "Hughes LLC Academy 66486 Smitn Stream Apt. 857, Lake Janniter, Vi 82472 burkecraig gmail gg236628 16 Classroom Observation Summary Report Teacher:| guren Rodgers Evatuator: Helly ewis Grade Level Section: TE Bate of Evatuation: October 12, 2024 Instructions: For this Classroom Observation Summary Report, the evaluator is tasked with conducting a ciass observation for the entire duration of the class while taking down necessary notes to be used in this summary report as weil as attached. The evaluator is hereby tasked with answenng the folowing five (5) questions and providing a reason for his her answer Question 1: ts the teacher able to show mastery of the lessons? Yes, the teacher was able to show mastery of tne lessons she was discussing for that certain class. She was able to handie all the questions cf the students and right before she gave an activity to test the student s leaming and mastery, she was able to give a comprehensive synthesis of the entire discussion. Question 2; Is the teacher able to create an environment that is open and welcoming for the students? Yes, the environment of the classroom and the class were very weicorning and open. When the teacher entered the class, she did net immediately start with the discussion, nor did she grill the students about what they teamed from the last meeting. instead, she asked the students now they were and she slowly transitioned to starting the discussion."
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "classobserve",
        "ocr_text": "Thomas, Fox and Cowan Schoo! 1099 Dana Lake, New Angel, MA 65332 davidanderson grne ike s98 6 148 Classroom Observation Summary Report Teacher: Vietinda Watts Evaluator: on Sion Grade Level Section: 4B Date of Evaluation: Anrjj 03, 2024 Instructions: For this Classroom Observation Summary Report, the evaluator is tasked with conducting class observation for the entire duration of the class white taking down necessary notes to be used in this summary report as well as attached, The evalusior is hereby tasked with answering the fotiowing five (5) questions and providing 4 reason for his her answer. Question 4: ts the teacher able to shaw mastery of the lessons? Yes, the teacher was able to show mastery of the lessons she was discussing for that certain class. She was able to handie afi the questions of the students and fight before she gave an activity to test the student s learning and mastery, she was able to give comprehensive synthesis of the entire discussion. Question 2: fs the teacher able to create an environment that is open and wetcoming for the students? Yes, the environment of the classrcom and the class were very welcoming and open ‘When the teacher entered ihe class, she did not immediately start with Ine discussion, nor did she grill the students about what they leamed from the last meeting. instead, she asked the students how they were and she siowly transitioned to starting the discussion."
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "classobserve",
        "ocr_text": "Thomas, Fox and Cowan School 1099 Dana Lake, New Angel, MA 65332 davidanderson gme iit9 898 6148 alalial Classroom Observation Summary Report Teacher: Melinda Watts Evaluator: che Dai Grade Level Section: 4B Date of Evaluation: april 03, 2024 Room: Room 82 Time of Evaluation: 7 46 P M Instructions: For this Classroom Observation Summary Report, the evaluator is tasked with conducting a class observation for the entire duration of the class while taking down necessary notes to be used in this summary report as well as attached, The evaluator is hereby tasked with answering the following five (5) questions and providing a reason for his her answer. Question 1: Is the teacher able to show mastery of the lessons? Yes, the teacher was able to show mastery of the lessons she was discussing for that certain class. She was able to handle all the questions of the students and right before she gave an activity to test the student s learning and mastery, she was able to give a comprehensive synthesis of the entire discussion, Question 2: Is the teacher able to create an environment that is open and welcoming for the students? Yes, the environment of the classroom and the class were very welcoming and open. When the teacher entered the class, she did not immediately start with the discussion, nor did she grill the students about what they learned from the last meeting, Instead, she asked the students how they were and she slowly transitioned to starting the discussion."
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "classobserve",
        "ocr_text": "Tho: as, Fox and w Angel, ees ane cavidanderson grneieyss Classroom Observation Summary Report Evatuetor: Keyin Camppell 48 Date of Evaluation: april tustions. F Teacher: set Grade Level &: ‘or fis ssroorn Observation Sumo eeing »folowi 2 ion of as aflacte a7 this summary five (S} quesiv nort as Question 2: is the teacher able to create an environment that is open end welcoming for the siudents? onment oF the oh"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "classobserve",
        "ocr_text": "Thomas, Fox an 'd Cowan Schooi Osta Lake, New A, Gel, MA GS332 davidanderson gmesbo )898 6 148 Classroom Observation Summary Report Teacher: Melinda Watts Evahator: PA Grade Lever Section: 4B Date of Evaiuation April 03, 2024 Time of Evatuation: 7: 4 P M Jastructions: For tn nis Classroom Observation Se: ary Report the evaluator is tasked with conducting Ne ontira duration of the class white faking down necessary noles to be used in r Well 8 attached The evatuaior ig hereby tasked with answering the following Sj Providing reason for disfher answer Room: Ream 82 Question 4: ts the teacher able to show Mastery Of the lessons? Yes, the teacher WS able that certain class fight before she to show masta; She was sive to Rand! Gave an acti WAS able to give a com, OF the lessons she was ie alt the questions cf the Students and ity to test the student s learning and mastery, she Prenenisive synthesis of the entire discussion Siscussing for Yes, the environment of the classroom and the Class were very welcomi open. When the teacher enterad the cf She cid not immediately start wi the discussion, ss bout what they learmed from ‘the last meeting. instead. she g ‘ots how they were and she slowly Starting the discussion, ng and"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "classobserve",
        "ocr_text": "Thomas, Fox and Cowan School 1099 Dana Lake, New Angel, MA 65332 davidanderson gme ib9 898 6148 alia Classroom Observation Summary Report Teacher: Melinda Watts Evatuator Kevin Grade Level Section: 4B Date of Evaluation: April 03, 2024 Room: Room 82 Time of Evaluation: 7 46 PM Instructions: For this Classroom Observation Summary Report, the evaluator is tasked with conducting a class observation for the entire duration of the class while taking down necessary notes to be used in this summary report as well as attached. The evaluator is hereby tasked with answering the following five (5) questions and providing a reason for his her answer. Question 1: Is the teacher able to show mastery of the lessons? Yes, the teacher was able to show mastery of the lessons she was discussing for that certain class. She was able to handle all the questions of the students and right before she gave an activity to test the student s learning and mastery, she was able to give a comprehensive synthesis of the entire discussion. Question 2: Is the teacher able to create an environment that is open and welcoming for the students? Yes, the environment of the classroom and the class were very welcoming and open. When the teacher entered the class, she did not immediately start with the discussion, nor did she grill the students about what they learned from the last meeting. Instead, she asked the students how they were and she slowly transitioned to starting the discussion."
    }
]