[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "collegecode",
        "ocr_text": "Baasnite:"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "collegecode",
        "ocr_text": "Stud lent code in Bird, Cardenas and Smit College"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "collegecode",
        "ocr_text": "arg Sr College sens, Dee wioieing mauelest"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "collegecode",
        "ocr_text": "sd Smit Coteg: Visiting ststene"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "collegecode",
        "ocr_text": "Student cor Beeman: Hesree study ‘siting sta"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "collegecode",
        "ocr_text": "Student code in Becker West Academy"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "collegecode",
        "ocr_text": "Student code in Becker West Academy Sey anor 5c wat nen etn» renin nes eS Example: Degree study Taatics Visiting student 146"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "collegecode",
        "ocr_text": "Student code in Becker West Academy reggrgemnemsttatmaatiaataps reenencorrn meen ga sarc Poke Siytanes oitacnan se arsenate i oD Norge ne ween De NOH Example: Degree study ‘Toa Hets \"(eis Visiting student 146"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "collegecode",
        "ocr_text": "Student code in Becker West Academy Example: Degree study Visiting student amen innss 146"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "collegecode",
        "ocr_text": "Student code in Becker West Academy AEE Fea natal 0m cee ctmscen, ramen nas verte, a slow races ean aeeet ay eae sta ome ents Seams mma sien ae Sony acters hes seme emnaaresegaeneen tS Sere aress Sree te sa eames an yas ta a ech ona \"820A ate cay ened sae Br ee Example: Degree study Tra Hels iepsia * Visiting student vratiee Joreon 146"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "collegecode",
        "ocr_text": "Vieiting wtuden Nepestownn 438"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "collegecode",
        "ocr_text": "s, Dawson and student code in tment Savon ume Anse: 5 encourage Visiting student Megan Brarat 435"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "collegecode",
        "ocr_text": "Exanole: Pegree study"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "collegecode",
        "ocr_text": "udent cod 6) i accEUNIOEEY vegan Brena 435"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "collegecode",
        "ocr_text": "Student code in Simmons, Dawson and Sanchez University Attendance is a vial pat of the student code because it reflects responsibly and commitment. Stugents are expecied to attend al thee ‘lasses regulary and on tme. Absences must joned with vale reasons and approved by the department. Repeated iardiness can affect the stdents academic standing’ The poley sins ts sree consistency and accountality anang students“ 7U99® Example: Degree study fer Rowen Gib? Visiting student MegenBranct 435"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "collegecode",
        "ocr_text": "and Sons Schos example: Gegras study uiaiting student 300"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "collegecode",
        "ocr_text": "Student code in RuiZ and Sons School example: Degree study Visiting student 360"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "collegecode",
        "ocr_text": "in Ruiz and Sans School sinney stormed 2 og"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "collegecode",
        "ocr_text": "Degree iting stuctent"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "collegecode",
        "ocr_text": "Tool Exanipior Begree study Viaicing snetunt"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "collegecode",
        "ocr_text": "Student code in Smith PLC University Visiting student 28"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "collegecode",
        "ocr_text": "Student code in Srv Waiting stedienk"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "collegecode",
        "ocr_text": "Student code in Smith PEC University Visiting student Megan Foes 298"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "collegecode",
        "ocr_text": "+ PLO University YPLO University"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "collegecode",
        "ocr_text": "th PLC University Exeeptes Gegres study Visiting student iegen Fras 208"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "collegecode",
        "ocr_text": "Student code in Hartington, Snyder and Otson University ‘Academic honesty is one of the most important values in our colege. Plagamsmn, cheating, and otter dhonest practices are nt tolerated ‘Students must subst their own work and properly cte any sources used, Vioatons may resuk in disciplinary actons or academic penaties, ‘Upholding integnity ensures the credibity of our education and ‘Sehieverents Example: Degree study Menaeiterser Fans Visiting student Madison Cae 148"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "collegecode",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "collegecode",
        "ocr_text": "Exsmpte: Begeee stety Wishing student 148"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "collegecode",
        "ocr_text": "Student corte in Haringion, Snyder anc Obon Lnive $076 01 me mo! mpcnvd valves our cobmge ng. 40 tar co coes pr achows ate hol Weare pcoaty che any Seve $9 9 Siar achons ore Visiting stedent Mods cea 148"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "collegecode",
        "ocr_text": "on Univarsky 1 m one of he neal enponand ves Ov; Cote Exarapte Degree study Visiting student re)"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "collegecode",
        "ocr_text": "Student code in Hensley and Sons Academy campus. Everyone must help in waste ‘segregaion and ener; SS eee eee care ee Se a cee ec Example: Degree study Visiting student Julia Butler 395"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "collegecode",
        "ocr_text": "Hensley sdect code emp! ms. Bet one serait Stucents are 267304 Ravan Degree study Visiting Julia Bt"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "collegecode",
        "ocr_text": "- Wighing seudont 8 iulia ualer"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "collegecode",
        "ocr_text": "Student code in Hensley and Sons Academy plant These actions show our Example: Degree study Visiting student Julia Butler"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "collegecode",
        "ocr_text": "Student code in Hensley and Sons Academy ‘The student code emphasizes environmental esponsbity wan the cqnservaon, Shdents are advised to mines plate ute and mtetan “These actions show ourcommitment fo prtedtng the environment Tor ‘uture generations, Example: Degree study Visiting student Julia Butler 395"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "collegecode",
        "ocr_text": "Student code in Wright, Davis and Gregory Schoo! Use of mobile phones and gadgets during class hours i regulated by {he colege, Devices should be Set to silent mode fo avo distractions. Students are only alowed fo Use them when pertiicd by the instructor Yor academic purposes: Unauttorzed use may ead fo confiscation or acnary adion. Te obey ensure ators tema on Yearhng uring cass sessions Example: Degree study Kelsey Wright” Disks Visiting student Kel Flowers 318"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "collegecode",
        "ocr_text": "i@ student Kelly Poser 358"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "collegecode",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "collegecode",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "collegecode",
        "ocr_text": "ree where Examngte: Gegros sey Vititieg student"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "collegecode",
        "ocr_text": "Student code in Garcia Davis C Visiting stesomt"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "collegecode",
        "ocr_text": "Exaerote: Degree stedy Visiting student"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "collegecode",
        "ocr_text": "Student code in Garcia Davis College Respect for school property and facies is part of every student s duty, We are response or maniarung cearunessn caewours laporatones, and common areas, Danvaging equipment or vandalzing walls 8 serous oflense. The scion! prowaes resouroes for our use, 30 Wwe must handle them wah care. This ule helps create an orderly and leasani campus for everyone Example: Degree study “ibe Jobosen Bisboi2 Visiting student Ena dens 310"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "collegecode",
        "ocr_text": "Student code in Garcia Davis College Resped for school property and facities s part of every, tudenrs duty pect for choo ple for mantaining deantiness in lasso, fa eeee Common areas, Damaging equement a vandaag \\{aboratones, ant Renee, The school provides resources for WSS, als a serous hem with care. This rue helps create an orderly and ‘pleasant carnpus for everyone. Example: Degree study Nise Johnson Ba820 2 Visiting student Cop ienkins 310"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "collegecode",
        "ocr_text": "a Davis Colle Example: Degree study Visiting"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "collegecode",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "collegecode",
        "ocr_text": "+ siting etsent"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "collegecode",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "collegecode",
        "ocr_text": "Student code in Meyers Mcbride Academy Respect for school propery and facies js part of every students duty. ina tre teapot or mantarvng deaniness in classoors, raiotes, ard common areas. Damaging equipment or vanda in wae ene an conse, The scion prowses resources fr our use 20 ye must handle them with Care. Ths ule helps create an orderly and ‘leasant campus for everyone Example: Degree study acon Praies. Biri Visiting student Jeanne Day 288"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "collegecode",
        "ocr_text": "Student code in Meyers Mcbride Academy tacities is partof every student’ du casinos or cur use, 20 San order and Respect for school property and ie ae expons maniaeung deariness a aes red common areas. Damaging £aut anestrus offense. The school prondes Sere S aneare, Ths rule neips creat ve must handle them Slessant earnpus for everyone: Example: Degree study iron PPS Visiting student Jeanne Day 288"
    }
]