[
    {
        "image": "cofservice_synth_10_aug1.png",
        "label": "cofservice",
        "ocr_text": "Turner Thompson University Office of Extension Services Downtown Campus 47018 Young Springs Apt. 021, Brucechester —— CERTIFICATION This is to certify that Mary Watts has successfully completed the Community Outreach Project as part of the academic and community service requirements. Table population executive prepare cultural your society wide such society eight direction know. ra Taylor Cox Dean of Students a South Campus 617 869 7123x1819 j tanyabO example net"
    },
    {
        "image": "cofservice_synth_10_aug2.png",
        "label": "cofservice",
        "ocr_text": "Turner Thompson University Office of Extension Services Downtown Campus 47018 Young Springs Apt. 021, Brucechester Inn CERTIFICATION This is to certify that Mary Watts has successfully completed the Community Outreach Project as part of the academic and community service requirements. Table population executive prepare cultural your society wide such society eight direction know. nti Taylor Cox Dean of Students South Campus 617 869 7 123x1819 tanyabU example net"
    },
    {
        "image": "cofservice_synth_10_aug3.png",
        "label": "cofservice",
        "ocr_text": "Turner Thompson University Office of Extension Services Downtown Campus 47018 Young Springs Apt. 021. This is to certify that Mary Watts has successfully completed the Community Outreach Project as part of the academic and community service requirements. Table ultural your society wide population executive prepare itur such society eight direction Know. Taylor Cox Dean of Students eomncenenecin tenet OC South Campus 617- 869 7 123x813 taryaso example ret"
    },
    {
        "image": "cofservice_synth_10_aug4.png",
        "label": "cofservice",
        "ocr_text": "Turner Thompson University Office of Extension Services Downtown Campus 47018 Young Springs Apt. 021, Brucechester CERTIFICATION This is to certify that Mary Watts has successfully completed the Community Outreach Project as part of the academic and community service requirements. Table tural your society wide population executive prepare CU such society eight direction know. at Taylor Cox Dean of Students rr South Campus 617 869 7123x1819 tanya60 example net"
    },
    {
        "image": "cofservice_synth_10_aug5.png",
        "label": "cofservice",
        "ocr_text": "Turner Thompson University Office of Extension Services Downtown Campus 47018 Young Springs Apt. 021, a CERTIFICATION This is to certify that Mary Watts has successfully completed the Community Outreach Project as part of the academic and community service requirements. Table cultural your society wide population executive prepare CUIU! such society eight direction know. ati Taylor Cox Dean of Students SC South Campus 617 869 7123x1 819 tanyas60 example net"
    },
    {
        "image": "cofservice_synth_11_aug1.png",
        "label": "cofservice",
        "ocr_text": "} CERTIFICATE ol Of SERVICE t certificate is awarded to Derek Hunter Tiffany rendered service hours as part of the community program and met all requirements. iy 25, 2005 aga DATE SIGNATURE \"5 |"
    },
    {
        "image": "cofservice_synth_11_aug2.png",
        "label": "cofservice",
        "ocr_text": "(CERTIFICATE Of SERVICE Derek Hunter i Tiffany rendered service hours as part of the i community progrars and met ali requirements. j JH 28, 2025 _weesthan, Dare SIGMATURE if Rx,"
    },
    {
        "image": "cofservice_synth_11_aug3.png",
        "label": "cofservice",
        "ocr_text": "ser e CERTIFICATE 4 Of SERVICE Derek Hunter Tiffany rendered service hours as Part of the community progr: am and met all requirements."
    },
    {
        "image": "cofservice_synth_11_aug4.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE Derek Hunter Tiffany rendered service hours as part of the community program and met all requirements."
    },
    {
        "image": "cofservice_synth_11_aug5.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE i i Derek Hunter i i i Tiffany rendered service AIQUIS a8 part of ihe he community program and met aif requirements"
    },
    {
        "image": "cofservice_synth_12_aug1.png",
        "label": "cofservice",
        "ocr_text": "iL Alice Turner MD i Philip completed community service dutes in support of the outreach program."
    },
    {
        "image": "cofservice_synth_12_aug2.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE irded to Alice Turner MD Philip completed Community service duties in support of th Outreach Program. September 21, 6 2025 ichael ENE DATE SIGNATURE"
    },
    {
        "image": "cofservice_synth_12_aug3.png",
        "label": "cofservice",
        "ocr_text": "Alice Turner MD Philip completed community service duties j in support of the outreach program."
    },
    {
        "image": "cofservice_synth_12_aug4.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE Alice Turner MD Philip Completed Community service duties in support of the outreach Program. September 21 ichael 2025 Michae DATE SIGNATURE “sf"
    },
    {
        "image": "cofservice_synth_12_aug5.png",
        "label": "cofservice",
        "ocr_text": "| Alice Turner MD a Philip completed community service duties H iN Support of the outreach program, Mi et SIGNATUR"
    },
    {
        "image": "cofservice_synth_13_aug1.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE Emily Kelly Kristen completed community service duties in support of the outreach program. January 05, Thomas \"7028 ely ate sjowarure Ree PS)"
    },
    {
        "image": "cofservice_synth_13_aug2.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE Emily Kelly Kristen completed community service duties in Support of the outreac! Program. January 05, 2624 Trees DATE"
    },
    {
        "image": "cofservice_synth_13_aug3.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Emily Kelly i Kristen completed SOmmunity serving i i duties in SUppOrt of the outreach program. iG"
    },
    {
        "image": "cofservice_synth_13_aug4.png",
        "label": "cofservice",
        "ocr_text": "CERTIF ICATE Emily Kelly Kristen completed community service ort of the outreac! program, cuties in supp."
    },
    {
        "image": "cofservice_synth_13_aug5.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Emily Kelly Kristen completed community service duties in support of the outreach program. Fhpnpas Ketly ae |"
    },
    {
        "image": "cofservice_synth_14_aug1.png",
        "label": "cofservice",
        "ocr_text": "S CERTIFICATE Of SERVICE certificate is awarded t Sandra Bishop Heather completed community service duties in support of the outreach program. _ July 14 2024 Patricia Day DATE SIGNATURE"
    },
    {
        "image": "cofservice_synth_14_aug2.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE a Of SERVICE Sandra Bishop Heather completed community service duties in support of the outreach program. July 14, 2024 Patricia Day DATE SIGNATURE J '"
    },
    {
        "image": "cofservice_synth_14_aug3.png",
        "label": "cofservice",
        "ocr_text": ": i i i i i Sandra Bishop Heather completed community service 3] duties in support of the outreach program, i ti :"
    },
    {
        "image": "cofservice_synth_14_aug4.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE ERVICE H oi i Sandra Bishop ¥ He é H tii if ik Heaiher compieted community service it 1 duties in support of the outreach program. |"
    },
    {
        "image": "cofservice_synth_14_aug5.png",
        "label": "cofservice",
        "ocr_text": "Sandra Bishop Heather completed community service i i duties in support of the outreach program. duly 44, 2024"
    },
    {
        "image": "cofservice_synth_15_aug1.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE Donna Ward Cheryl contributed to the campus service project and fulfilled required activities. ristina _ July 18, 2023 nist SIGNATURE DATE"
    },
    {
        "image": "cofservice_synth_15_aug2.png",
        "label": "cofservice",
        "ocr_text": "iF CERTIFICATE i Donna Ward if Cheryi contributed to the campus service i it project and fulfilled required activities, L i i ae Dy 18 2023 pool we fig i"
    },
    {
        "image": "cofservice_synth_15_aug3.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE This certificate is awarded to Donna Ward Cheryl contributed to the campus service project and fulfilled required activities. _ July 18 2023 Kristina DATE SIGNATURE"
    },
    {
        "image": "cofservice_synth_15_aug4.png",
        "label": "cofservice",
        "ocr_text": "gu\" \"7S CERTIFICATE Of SERVICE Donna Ward Cheryl contributed to the campus service Project and fulfilled required activities. 2023 ristina oy 18 2023 »_sisina DATE SIGNATURE J"
    },
    {
        "image": "cofservice_synth_15_aug5.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE \\ Donna Ward J to the campus service cheryl contribute er project and fulfilled required activities. 1 att SvSnatunt —— ¢ 3"
    },
    {
        "image": "cofservice_synth_16_aug1.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE 1 . 1 Robert Weiss 1] Heather participates in volunteer service, | demonstrating commitment and responsibility. i| ah Bagel pate SIGNATURE"
    },
    {
        "image": "cofservice_synth_16_aug2.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Robert Weiss Heather partic fed in volunteer demonstrating c"
    },
    {
        "image": "cofservice_synth_16_aug3.png",
        "label": "cofservice",
        "ocr_text": "WS a CERTIFICATE A | Robert Weiss 1 Heather participated in volunteer service, semonsirating commitment and responsibility. i Ranial 7 Nea *"
    },
    {
        "image": "cofservice_synth_16_aug4.png",
        "label": "cofservice",
        "ocr_text": "i: CERTIFICATE 4 Robert Weiss Heather participated in volunteer service, i demonstrating commitment and responsibility."
    },
    {
        "image": "cofservice_synth_16_aug5.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Robert Weiss Heather participated in volunteer service, demonstrating commitment and responsibility. ‘ers a :"
    },
    {
        "image": "cofservice_synth_17_aug1.png",
        "label": "cofservice",
        "ocr_text": "Ss CERTIFICATE Of SERVICE Jose Griffin Ryan completed community service duties in support of the outreach program."
    },
    {
        "image": "cofservice_synth_17_aug2.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE Jose Griffin Ryan completed community service duties in support of the outreach program. October 17, ROBE 2024 ussell DATE J rs"
    },
    {
        "image": "cofservice_synth_17_aug3.png",
        "label": "cofservice",
        "ocr_text": "ge CERTIFICATE Of SERVICE This certificate is awarded to Jose Griffin Ryan completed community service duties in support of the outreach program. October 17, anie| Ps 2024 . ussell DATE SIGNATURE 1| H} E5) i iL! J"
    },
    {
        "image": "cofservice_synth_17_aug4.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Jose Griffin i | Ryan completed community service duties ' in support of ihe outreach program. i i i Daniel Russel"
    },
    {
        "image": "cofservice_synth_17_aug5.png",
        "label": "cofservice",
        "ocr_text": "e CERTIFICATE i Of SERVICE This certificate is awarded to Jose Griffin Ryan completed community service duties in support of the outreach program. Oct ‘ober 17, aniel a ussell_.» DATE SIGNATURE S"
    },
    {
        "image": "cofservice_synth_18_aug1.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE Bianca Santos li Anthony participated in volunteer service, demonstrating commitment and responsibility. May 23, 2024 Usa Mygonado"
    },
    {
        "image": "cofservice_synth_18_aug2.png",
        "label": "cofservice",
        "ocr_text": "i Bianca Santos | } H Anthony Y Participated j volunt, ice. demonstrating corn fii Cer Service, H commitment and Fesponsibility. H H May 23, 2024 Dare a ad :"
    },
    {
        "image": "cofservice_synth_18_aug3.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Bianca Santos i i Anthony participated in volunteer service. demonstrating commitment and responsibility. May 23, 2024 isa Maidacasia SHSRA TORE"
    },
    {
        "image": "cofservice_synth_18_aug4.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Bianca o Santos"
    },
    {
        "image": "cofservice_synth_18_aug5.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE i 4 i Bianca Santos i i Anthony participated in volunteer service, i demonstrating commitrnent and responsibility. i"
    },
    {
        "image": "cofservice_synth_19_aug1.png",
        "label": "cofservice",
        "ocr_text": "|) William Shepard i Jacqueline a ‘ed in organizh engagement act Ss and complet"
    },
    {
        "image": "cofservice_synth_19_aug2.png",
        "label": "cofservice",
        "ocr_text": "OF Jacqueline assisted in orga engagement activities and comp!"
    },
    {
        "image": "cofservice_synth_19_aug3.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE William Shepard Jacqueline assisted in organizing community d engagement activities and completed assigned tasks. riah Rol singon SIGNATURE"
    },
    {
        "image": "cofservice_synth_19_aug4.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE William Shepard Jacqueline assisted ir organizing community engagement activities and completed assigned tasks. Marian Robinsoa H"
    },
    {
        "image": "cofservice_synth_19_aug5.png",
        "label": "cofservice",
        "ocr_text": "William Shepard Jacqueline organizing community i engagement omplan i 6 aasi tgned “hss, j i Hi"
    },
    {
        "image": "cofservice_synth_1_aug1.png",
        "label": "cofservice",
        "ocr_text": "Smith Reyes University Office of Student Services Downtown Campus 00% King Manor, Jerrystad MNES Seas SG ane Aa SMCS SASSER RAINE SITET si RNR SAAS HAI SESORE ASIP? cena a AOSORIN a SAWN ON ELON SOREL NTN STNG TLEN IE ATI GER TIFIC 4 ELON This is to certify that Mark Kemp has participated in and completed the Teaching Practicum demonstratin satisfactory performance and professional conduct. What middie because drop room present through eight language one. nda Laura Weaver Extension Coordinator Mexample com"
    },
    {
        "image": "cofservice_synth_1_aug2.png",
        "label": "cofservice",
        "ocr_text": "This is to certif completed t Satisfactory perfo middle because d 1 th Smith Reyes University Office of Sty Downtown Cam pus O01 King MM. fanor, Jerrystad SSS Sree Sacaneacaee ident Services atten that Mark Kemp has e Teaching Practicum Cemonstrat mance and profes FOp room present t one. Laura Weaver seca wen iccormnacteasaaiese ee een Participated j 0 and sional conduct. Wh hat hrough ej ight language Extension Coordinator ctor ae Senna aacan ences ee"
    },
    {
        "image": "cofservice_synth_1_aug3.png",
        "label": "cofservice",
        "ocr_text": "Smith Reyes University Office of Student Services Downtown Campus 001 King Manor, Jerrystad Nee ees nee CERTIFICATION This is to certify that Mark Kemp has participated in and completed the Teaching Practicum demonstratin satisfactory performance and professional conduct. What middle because drop room present through eight language one. VA Laura Weaver Extension Coordinator re South Campus +1 316 360 6786x2517 jessicajensen example com"
    },
    {
        "image": "cofservice_synth_1_aug4.png",
        "label": "cofservice",
        "ocr_text": "Smith Reyes University Office of Student Services Downtown Campus 001 King Manor, Jerrystad CERTIFICATION This is to certify that Mark Kemp has participated in and completed the Teaching Practicum demonstratin satisfactory performance and professional conduct. What middle because drop room present through eight language one. nti Laura Weaver Extension Coordinator South Campus +1 316 360 6786x2517 jessicajensen example com"
    },
    {
        "image": "cofservice_synth_1_aug5.png",
        "label": "cofservice",
        "ocr_text": "Smith Reyes University Office of Student Services This is to Sent that Mark Kemp has Participated in and completed the Teaching Practicum demonstratin Satisfactory Performance and professional conduct, What middle because drop room Present through eight language one. ada Laura Weaver Extension Coordinator We ere ere ere neneearn"
    },
    {
        "image": "cofservice_synth_20_aug1.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE ‘Of SERVICE i i Lauren Mayo i j Jack participated in volunteer service { i demonstrating commitment and responsibility. i i 225 Traci Hill, !"
    },
    {
        "image": "cofservice_synth_20_aug2.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE Lauren Mayo Jack participated in volunteer service, demonstrating commitment and responsibility. July 07, 2025 Traci Hill SIGNATURE"
    },
    {
        "image": "cofservice_synth_20_aug3.png",
        "label": "cofservice",
        "ocr_text": "j ul L M auren ayo t Jack participate in volunteer serv! ui i demonstrating commitrnent and respons itity. il Tract Hil."
    },
    {
        "image": "cofservice_synth_20_aug4.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE Nis certificate is awarded t Lauren Mayo Jack participated in volunteer service, demonstrating commitment and responsibility. July 07, 2025 Traci Hill SIGNATURE DATE"
    },
    {
        "image": "cofservice_synth_20_aug5.png",
        "label": "cofservice",
        "ocr_text": "CERTIFICATE Of SERVICE Lauren Mayo Jack participated in volunteer service, demonstrating commitment and responsibility. _ July 07, 2025 Traci Hill DATE SIGNATURE"
    },
    {
        "image": "cofservice_synth_2_aug1.png",
        "label": "cofservice",
        "ocr_text": "Gibson Bowers and Ball University Office of Extension Services South Campus 1246 Haley Circle, New Brittney ee CERTIFICATION This is to certify that Mary Garcia has participated in and completed the Laboratory Training demonstrating satisfactory performance and professional conduct. Meet receive rich ten attention argue attention federal imagine pattern foot nature put response. ada Danielle Ramos Community Service Officer North Campus (579 409 8777x3978 carrie54 example org"
    },
    {
        "image": "cofservice_synth_2_aug2.png",
        "label": "cofservice",
        "ocr_text": "Gibson Bowers and Ball University Office of Extension Services South Campus 1246 Haley Circle, New Brittney CERTIFICATION This is to certify that Mary Garcia has participated in and completed the Laboratory Training demonstrating satisfactory performance and professional conduct. Meet receive rich ten attention argue attention federal imagine pattern foot nature put response. nti Danielle Ramos Community Service Officer North Campus (579 409 8777x3978 carrieS4 example org"
    },
    {
        "image": "cofservice_synth_2_aug3.png",
        "label": "cofservice",
        "ocr_text": "Gibson Bowers and Ball University Office of Extension Services South Campus 1246 Haley Circle, New Brittney CERTIFICATION This is to certify that Mary Garcia has participated in and completed the Laboratory Training demonstrating satisfactory performance and professional conduct. Meet receive rich ten attention argue attention federal imagine pattern foot nature put response. nti Danielle Ramos Community Service Officer North Campus (579 409 8777x3978 carrieS4 example org"
    },
    {
        "image": "cofservice_synth_2_aug4.png",
        "label": "cofservice",
        "ocr_text": "Gipson Bowers and Ball University Office of Extension Services South Campus 1246 Haley Circle, New Britiney Sea RGSS AEE A EN IS SHEN ARE I AS ELSA ROA BE AS IE OR EOS A NEA IR NEI This is to certify that Mary Garcia has participated in and completed the Laboratory Training demonstrating satisfactory performance and professional conduct. Meet receive rich ten attention argue attention federal imagine pattern foot nature put response. by fo oth f Danielle Ramos ag Community Service Officer"
    },
    {
        "image": "cofservice_synth_2_aug5.png",
        "label": "cofservice",
        "ocr_text": "Gibson Bowers and Ball University Office of Extension Services South Campus 1246 Haley Circle, New Britiney nbsneninnananimenenaenianmenioame ome eee ONT OES CNS LOR RA SUS TRIAS NR ENCE A ESAS AMES ATS RM SUSE NST a OO ESN EAMtae MMAR eta ee ee This is to certify that Mary Garcia has parti sipated in and compieted the Laboratory Training demonstrating satisfactory performance and professional conduct. Meet receive rich ten attention argue attention federal imagine pattern foot nature put response. nda Danielle Ramos Community Service Officer"
    },
    {
        "image": "cofservice_synth_3_aug1.png",
        "label": "cofservice",
        "ocr_text": "Vega Randolph and Cox University Office of Community Engagement South Campus 529 Rodriguez Tunnel, New Thomas CERTIFICATION This is to certify that Edgar Elliott has successfully completed the Community Outreach Project demonstrating satisfactory performance and professional conduct. Discussion different require beyond hundred health rich me miss word summer down may food affect. nti Mark Villa Extension Coordinator Downtown Campus (923 587 5407x61983 holmeskatie example com"
    },
    {
        "image": "cofservice_synth_3_aug2.png",
        "label": "cofservice",
        "ocr_text": "Vega Randolph and Cox University Office of Community Engagement South Campus 529 Rodriguez Tunnei, New Thomas eee CERTIFICATION This is to certify that Edgar Elliott has successfully completed the Community Outreach Pro ject demonstrating Satisfacto Ny performance and professional conduct. Discussion di 7 erent require beyond hundred health rich me miss word summer down may food affect. ada Mark Villa Extension Coordinator ee nnn nnn er Downtown Campus (923 587 5407x61983 holmeskatie example com"
    },
    {
        "image": "cofservice_synth_3_aug3.png",
        "label": "cofservice",
        "ocr_text": "Vega Randolph and Cox University Office of Community Engagement South Campus 529 Rodriguez Tunnel, New Thomas This is to certify that Edgar Elliott has successfully completed the Community Outreach Project demonstrating satisfactory performance and professional conduct. Discussion different require beyond hundred health rich me miss word summer down may food affect. rth Mark Villa Extension Coordinator"
    },
    {
        "image": "cofservice_synth_3_aug4.png",
        "label": "cofservice",
        "ocr_text": "Vega Randolph and Cox University Office of Community Engagement South Campus 529 Rodriguez Tunnel, New Thomas CERTIFICATION This is to Certify that Edgar Elliott has successfully completed the Com | Lge Oly performance and Discussion di erent require beyond hundred health rich me miss word hh Mark Villa Extension Coordinator oo Downtown Campus (923 587 5407x61983 holmeskatie example com"
    },
    {
        "image": "cofservice_synth_3_aug5.png",
        "label": "cofservice",
        "ocr_text": "Vega Randolph and Cox University Office of Community Engagement South Campus 529 Rodriquez T unnel, New Thomas ena sree This is to certify that Edgar Elliott has successfully leted the Community Gutreach Project demonstrating satisfactor performance and professional conduct. Discussion di erent require beyond hundred health rich me miss word summer down may food affect. ada Mark Villa Extension Coordinator"
    },
    {
        "image": "cofservice_synth_4_aug1.png",
        "label": "cofservice",
        "ocr_text": "Wilson Perez and Leonard University Office of Student Services Main Campus 254 Jennifer Mountains Apt. 361, Travisville CERTIFICATION This is to certify that Alexander Gray has successfully completed the Teaching Practicum demonstrating satisfactory performance and professional conduct. Weight themselves exactly Mr kitchen yet him idea laugh. ati Michael Ortiz Coordinator Main Campus 256 513 8588 kathryn84 example com"
    },
    {
        "image": "cofservice_synth_4_aug2.png",
        "label": "cofservice",
        "ocr_text": "Wilson Perez and Leonard University Office of Student Services Main Campus r Mountains Apt. 361, 254 Jennife Travisville CERTIFICATION This is to certify as successfully completed the emonstratin fessional conduct. eight satisfactory performance and pro themselves exactly Mr kitchen yet him idea laugh. ata Michael Ortiz Coordinator OC Main Campus 256 513 8588 kathryn84 example com"
    },
    {
        "image": "cofservice_synth_4_aug3.png",
        "label": "cofservice",
        "ocr_text": "Wilson Perez and Leonard University Office of Student Services Main Campus 254 Jennifer Mountains Apt. 361, Travisville CERTIFICA This is to certify that Alexander Gray has successfully completed the Teaching Practicum demonstrating satisfactory performance and professional conduct. Weight themselves exactly Mr kitchen yet him idea laugh. ata/ Michael Ortiz Coordinator OC Main Campus 256 513 8588 kathryn84 example com"
    },
    {
        "image": "cofservice_synth_4_aug4.png",
        "label": "cofservice",
        "ocr_text": "Wilson Perez and Leonard University Office of Student Services Main Campus 254 Jennifer Mountains Apt. 361, Travisvi sville CERTIFICATION This is to certify that Alexander Gray has successfully completed the Teaching Practicum demonstrating satisfactory performance and professional conduct. eight themselves exactly Mr kitchen yet him idea laugh. ada Michael Ortiz Coordinator Oe Main Campus 256 513 8588 kathryn84 example com"
    },
    {
        "image": "cofservice_synth_4_aug5.png",
        "label": "cofservice",
        "ocr_text": "Wilson Perez and Leonard University Office of Student Services Main Campus 254 Jennifer Mountains Apt. 361, Travisvilie CERTIFICA TION certify that Alexander Gray has successfully ing Practicum demonstratin erformance and professional conduct. Weight r kitchen yet him idea laugh. This is to completed the Teach satisfactory themselves exactly M nhi/ Michael Ortiz Coordinator ee penne Main Campus 256 613 8588 kathryn84 example com"
    },
    {
        "image": "cofservice_synth_5_aug1.png",
        "label": "cofservice",
        "ocr_text": "Sanchez LLC University Office of the Registrar Main Campus 72029 James Glens, Lopeziown ee CERTIFICATION This is to certify that Mandy Harper has successfully completed the Laboratory Training and met the expected competencies prescribed by tne program. Oil cell themselves bed age business future three. nda Jasmine Bush Program Head i CL a i Main Campus +4 579 721 7378x60089 haydenjane exampie com"
    },
    {
        "image": "cofservice_synth_5_aug2.png",
        "label": "cofservice",
        "ocr_text": "Sanchez LLC University Office of the Registrar Main Campus 72029 James Glens, Lopeztown CHEREITEIC ATION This is to certify that Mandy Harper has successfully completed the Laboratory Training and met the expected competencies prescribed by the program. Oil cell themselves bed age business future three. odh ay Jasmine Bush Program Head Main Campus +4 879 721 737 8x60) haydenjane example com"
    },
    {
        "image": "cofservice_synth_5_aug3.png",
        "label": "cofservice",
        "ocr_text": "Sanchez LLC University Office of the Registrar Main Campus 72029 James Glens, Lopeztown Te CERTIFICATION This is to certify that Mandy Harper has successfully completed the Laboratory praining and met the expected competencies prescribed by the program. Oil cell themselves bed age business future three. ada Jasmine Bush Program Head ee Main Campus +1 579 721 7378x60089 haydenjane example com"
    },
    {
        "image": "cofservice_synth_5_aug4.png",
        "label": "cofservice",
        "ocr_text": "Sanchez LLC University Office of the Registrar Main Campus es so Sonn anne totes sneer sana eee evacuate SSO SIN ATE APO STOR eeeUeneonoeeeee be. ESR tro enn eeinainieniiienl This is to certify that Mandy Harper has successfully completed the Laboratory Training and met the expected competencies prescribed by the program. Oil cell themselves bed age business future three. nda Jasmine Bush Program Head Main Campus +4 879 721 7 57 8KG0088 haydenjane example com"
    },
    {
        "image": "cofservice_synth_5_aug5.png",
        "label": "cofservice",
        "ocr_text": "Sanchez LLC University Main Campus 72029 James Glens, Lopeziown sonnei ieee en NNN ANAS NNT esse ATES See SII A AN NATE SAE ETE acinar antSoy ner Aas TRE SSE ALSE SEN . es nnn erences CERTIFICATION Son This is to certify that Mandy Harper has successtiully completed the Laboratory Training and met the expected competencies prescribed by the program. Oil cell themselves bed age business future three. Jasmine Bush rogram Head"
    },
    {
        "image": "cofservice_synth_6_aug1.png",
        "label": "cofservice",
        "ocr_text": "Dorsey PLC University Office of Student Services North Campus 218 Mullins Harbors, South Jeffreytown aw CERTIFICATION This is to certify that Katherine Davis has participated in and completed the Laboratory Training and met the expected competencies prescribed by the program. Smile speech network require particular and first win quickly sing indeed attack simply glass spend. ata Kelly Johnson Program Head a North Campus +1 787 550 8946 jameswells example com"
    },
    {
        "image": "cofservice_synth_6_aug2.png",
        "label": "cofservice",
        "ocr_text": "Dorsey PLC University Office of Student Services North Campus 218 Mullins Harbors, South Jeffreyiown This is to certify that Katherine Davis has participated in and completed the Laboratory Training and mei the expected competencies prescribed by the program. Smile speech network require particular and first win quickly sing indeed attack simply glass spend. aA Kelly Johnson Program Head North ee 1S 787 550 3246 je eiis example com"
    },
    {
        "image": "cofservice_synth_6_aug3.png",
        "label": "cofservice",
        "ocr_text": "Dorsey PLC University ces Office of Student Servi North Campus cscs tei 218 Mullins Harbors, South Jeffreyiow? sees cere poo sean tahtAi ONG Nat csnmnce ane ETT This is toc compieted etencies prescr compet network fF ertify that Kaiheri ratory Training an d the Labo equire partic attack Ss! el nese pecan ee ine Davis has participated in and d met the expecte ibed by the program. Smile speech ular and first win quickly sing indee mply glass spend. pa 7 Kelly Johnson Program Head North ©"
    },
    {
        "image": "cofservice_synth_6_aug4.png",
        "label": "cofservice",
        "ocr_text": "Dorsey PLC University Office of Student Services North Campus 218 Mullins Harbors, South Jeffreytown CERTIFICATION This is to certify that Katherine Davis has participated in and completed the Laboratory Training and met the expected competencies prescribed by the program. Smile speech network require particular and first win quickly sing indeed attack simply glass spend. adi Kelly Johnson Program Head North Campus +1 787 550 8946 jameswells examiple com"
    },
    {
        "image": "cofservice_synth_6_aug5.png",
        "label": "cofservice",
        "ocr_text": "Dorsey PLC University Office of Student Services North Campus 218M ullins Harbors, South Jeffreytown CERTIFICATION ath Kelly Johnson Program Head oe North Campus +1 787 550 8946 Jameswells example com"
    },
    {
        "image": "cofservice_synth_7_aug1.png",
        "label": "cofservice",
        "ocr_text": "This is to requirement satisfactory P term state Miller Ltd University Office of the Registrar North Campus 104 Jennifer Pike, Angeiafut certify that Angela Hahn hn s for the Laboratory Training arformance and professional mission rest ber participant. oth Patricia Bailey Community Service Officer Downtown Ca! 63 953 9075x2333 seterson: CERTIFICA TION as fulfilled the. demonstrating conduct. Peace behavior forward artist might"
    },
    {
        "image": "cofservice_synth_7_aug2.png",
        "label": "cofservice",
        "ocr_text": "Miller Ltd University Office of the Registrar North Campus 104 Jennifer Pike, Angelafurt ee SS 00 00 _9: CERTIFICATION This is to certify that Angela Hahn has fulfilled the requirements for the Laboratory Training demonstrating satisfactory performance and professional conduct. Peace term state mission rest behavior forward artist might participant. ati Patricia Bailey Community Service Officer Downtown Campus 594 953 9075x2333 petersonallen example org"
    },
    {
        "image": "cofservice_synth_7_aug3.png",
        "label": "cofservice",
        "ocr_text": "Miller Ltd University Office of the Registrar North Campus 104 Jennifer Pike, Angelafurt screen enana ee A CNN eae nnanemenire ntact tego ENR TTI aac rine cpecnenunennenericmennnnsnenaaen This is to certify that Angela Hahn has fulfilled the requirements for the Laboratory Training demonsirating satisfactory performance and professional conduct. Peace term state mission rest behavior forward artist might participant. ada Patricia Bailey Community Service Officer"
    },
    {
        "image": "cofservice_synth_7_aug4.png",
        "label": "cofservice",
        "ocr_text": "Milter Lic University North Carnpus so4 Jennifer Pike. aAngelafull og eect at Angela Hahn has fulfilled the. Training demonstrating duct. Peace st might This is to certify th requirements for ihe Laboratory satisfactory performance and professional con t behavior forward art farm state mission rest ber participant. oth Patricia Bailey munity Service Officer com"
    },
    {
        "image": "cofservice_synth_7_aug5.png",
        "label": "cofservice",
        "ocr_text": "Miller Lite University Office of the Registrar North Campus 184 Jennifer Pike, Angelaturi SS SS Se CATION This is to certify that Angela Hahn has fulfilled the requirements for the Laboratory Training demonstrating Satisfactory Performance and professiona} conduct. Peace term state Miss lor fi ion rest behavior forward artist Might Participant. wha Patricia Bailey Community Service Offi cer"
    },
    {
        "image": "cofservice_synth_8_aug1.png",
        "label": "cofservice",
        "ocr_text": "Preston Weeks and Brown University Office of the Registrar Main Campus 425 Tonya Drive, Port Sandra Fa CERTIFICATION This is to certify that Denise Santiago has fulfilled the requirements for the Laboratory Training demonstrating satisfactory performance and professional conduct. Interest really price indicate throw audience next practice exist research war budget pass. nti Lisa Davis Coordinator a South Campus 373 449 9927x6748 williamO00 example com"
    },
    {
        "image": "cofservice_synth_8_aug2.png",
        "label": "cofservice",
        "ocr_text": "Preston Weeks and Brown University Office of the Registrar Main Campus 425 Tonya Drive, Port Sandra CERTIFICATION This is to certify that Denise Santiago has fulfilled the requirements for the Laboratory Training demonstrating satisfactory performance and professional conduct. Interest really price indicate throw audience next practice exist research war budget pass. oa Lisa Davis Coordinator South Campus 373 449 9927x6748 willamO0 example com"
    },
    {
        "image": "cofservice_synth_8_aug3.png",
        "label": "cofservice",
        "ocr_text": "Preston Weeks and Brown University Office of the Registrar Main Campus 425 Tonya Drive, Port Sandra re CERTIFICATION This is to certify that Denise Santiago has fulfilled the requirements for the Laboratory Training demonstrating satisfactory performance and professional conduct. Interest really price indicate throw audience next practice exist research war budget pass. nha Lisa Davis Coordinator South Campus 373 449 9927x6748 williamO00 example com"
    },
    {
        "image": "cofservice_synth_8_aug4.png",
        "label": "cofservice",
        "ocr_text": "Preston Weeks and Brown University Office of the Registrar Main Campus 425 Tonya Drive, Port Sandra Soa CERTIFICATION This is to certify that Denise Santiago has fulfilled the naarements for the Laboratory Trainin demonstrating Satisfactory performance and professional conduct. Interest really price indicate throw audience next practice exist research war budget pass roe A Lisa Davis Coordinator eee South Campus 373 449 9927x6748 william00 example com"
    },
    {
        "image": "cofservice_synth_8_aug5.png",
        "label": "cofservice",
        "ocr_text": "Preston Weeks and Brown University Office of the Registrar Main Campus 425 Tonya Drive, Port Sandra aoonciesnsenee a RUAN OOS senoremenenner toscana) saa ENR OETA SEMIN ernest This is to certify that Denise Santiago has fulfilled the requirements for the Laboratory Training demonstrating satisfactory performance and professional conduct. interest really price indicate throw audience next practice exist research war budget pass. edb f Lisa Davis Coordinator South Campus 373 449 9927x67 wiliamo0 exampie com"
    },
    {
        "image": "cofservice_synth_9_aug1.png",
        "label": "cofservice",
        "ocr_text": "Morton Calhoun University Office of Community Engagement South Campus O753 Johnson Corner, New Garybury SA SASS SE A ORATION ROPER ETRE SEBES AACE HRSG HHO TEER TEPER SEE ZOIDS PE SIA RTARTA UTE rnp eens gana ae nis oN ANNOTATE EOI SE SEC ENON SNS SSO EATS ANE SRC SDE SET ONE A SESAME LEED CLONES BNET SEI EEE IES TNT SES ASSAM METI This is to certify that Katie Snow has successfully completed the Capstone Research and met the expected competencies prescribed by the program. Medical less under game building financial work sit eight soldier example suggest business light. ada Adam Davis Proiect Manager Downtown Campus"
    },
    {
        "image": "cofservice_synth_9_aug2.png",
        "label": "cofservice",
        "ocr_text": "Vorton Calhoun University Office of Community Engagement South Campus 0753 Johnson Corer, New Garybury a anaemia SSR IY NS ROSE NH SAIC RiP HE WES a MA BN This is to certify that Katie Snow has successfully completed the Capstone Research and met the expected competencies prescribed by the program. Medical less under game building financial work sit eight soldier example suggest business lighi. Adam Davis Project Manager"
    },
    {
        "image": "cofservice_synth_9_aug3.png",
        "label": "cofservice",
        "ocr_text": "Morton Calhoun University Office of Community Engagement South Campus 0753 Johnson Corner, New Garybury CERTIFICATION This is to certify that Katie Snow has successfully the expected completed the Capstone Research and met competencies rescribed by the program. Medical less under game buil ing financial work sit eight soldier example suggest business light. adi Adam Davis Project Manager oC Downtown Campus +1 448 450 1444 glopez example net"
    },
    {
        "image": "cofservice_synth_9_aug4.png",
        "label": "cofservice",
        "ocr_text": "Morton Calhoun University Office of Community Engagement South Campus 0753 Johnson Corner, New Garybury oom CERTIFICATION This is to certify that Katie Snow has successfully completed the Capstone Research and met the expected competencies prescribed by the program. Medical less under game building financial work sit eight soldier example suggest business light. VA Adam Davis Project Manager Downtown Campus +1 448 450 1444 qlopez example. net"
    },
    {
        "image": "cofservice_synth_9_aug5.png",
        "label": "cofservice",
        "ocr_text": "Morton Caihoun University Office of Community Engagement South Campus 9753 Johnson Comer, New Garybury SS CERTIFICATION This is to certify that Katie Snow has successfuily completed the Capstone Research and met the expected competencies prescribed by the program. Medical less under game building financial work sit eight soldier example suggest business light. obs Adam Davis Project Manager eT LC AC A centre ner een etn renee rerensnnreenwenenrs nanan Downtown Campus +1 448 450 1444 glopez exampie net"
    }
]