[
    {
        "image": "collegesyllabi1_synth_10_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "Renatic of the Phippines BAVIO VIL Salage of Bustin SYLLABUS COURSE RUMEER 2OURSE DESCRPY: COURSE PRotEssoR” COURSE SRE THE DURA Tit Busse aA _ COURSE DESCRIPTION: mprehensive st salions essentai agement, covets \"al practice ang savan, 8. SCOURGE OMec VES: pon com SPs CoRCOptS. ADDY mares Uenonston fe Braviciency Ad methodciogies, and com o LEARNING COMPETENCES: Abely cndea! twrking and analytion! Coiaborate when, yin tea Detionsvats mastory of 3 picloe TE PONCiDes an em and nt Deer i Foundational theo Polessional seul seenent tne 9. COURSE soDuLe Module t Research tees Ratings Chon at nar GrOUD exereiRas, Gut Fy keg TABOR BAe rans RaDIW: 4. swlact oat es Bsc Bea: 5 selected ya in arte SSCA forurn, 9 600885, reflection pasar Moduie 7 Capstone Project semen Rei clan ioumel articiay Aetisit ‘oliscton pape"
    },
    {
        "image": "collegesyllabi1_synth_10_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines DAVID VILLE COLLEGE Setege of Buniians Astrrtenson SYLLABUS *CURSE NUMBER ausHss, COURSE DESORURTION —: Strateor Menage COURBE PROFESEGH 2M Kevindogen, PO. COURSE CREDIT ust TIME CARR TI TTPH ROG 1006 A, GOURSE BESCHIPTION: a comprehensive suey of sineegie weanagarasnt, covering thearateal foundatios 1 practical applications essentat tor profrswona’ practice ans anwanced shady COURSE OBJECTIVES: Upon compiction, shateats wit Be able to: anciyze key concepts, amply iheoretica! Rnowladge fo real Ako scenains demonstine proficiency i zolovent sis and methudoiogies, and comunumeate fr eterivety. C. LEARNING COMPETENDIES: «Aap eal aking anaiyical skis bp soivs complex probierss. atiectveiy is Seam baved majects an peas tearing aclvites mastery clove prinelpias and foundational iheones in sivatagic managerient Rott on nerionat gow sion JeReionmant Mewughout ts CoAT 5, COURSE MODULE Rockies $: Rasaarch Methods and Ethical Consiaeraions Rasadings, Chapier 4, selected jue aa Axslies: Discusnicn forum, stun exercises, ratlecson peper Module 2: Capstone Proioct ard Fiat Assessment Readings: Chapter 2, selected journal aries Aathaties: Cistussian Iorum, group wxarcions, quiz Modiie 2: Technetagy integration and minevation dings: Chapter 3, saieciad jaune! articles Activites: Ciecuasies tonm, group exercises, quiz Module 4: Contemmorary seuez and Giabat Perspectives ~Resdanga Chapter 4 40 ite Activites: Dascussion forum, grour exercises, it i@ 8: Contemoorary tssues and Gloval Perspectives Readings: Chanter §, 32k artes ~Actelfes, Dacuesion forum, grub exo i, tatection goer Readings: Chapier 6, sevected jours a iansegion forutn, group erercises, rePouton meOeT B Capstone Project and Final Aasessenent Readings: Chapter 7, selacted journal articles vssion forum, group aassoises, 7 S00 paper"
    },
    {
        "image": "collegesyllabi1_synth_10_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines DAVID VILLE COLLEGE Colege of Busnes Admnsvraton SYLLABUS COURSE NUMBER eustss COURSE DESCRIPTION: Svatege Management COURSE PROFESSOR Kevin Logan, Pn COURSE CREDIT nts TIME DURATION A. COURSE DESCRIPTION: This course provides a comprehensive study of strategic management, covering theoretical foundatons ‘and practical applications essential for professional practice and advanced study B. COURSE OBJECTIVES: Upon completion, students will be able to. analyze key concepts, apply theoretical knowledge to real world scenarios, demonstrate proficiency in relevant skills and methodologies, and communicate findings eftectvely C. LEARNING COMPETENCIES: Apply critical thinking and analytical skills to solve complex problems. Collaborate effectively in team based projects and peer learning activites. Demonstrate mastery of core principles and foundational theories in strategic management Reflect on personal growth and professional development throughout the course D. COURSE MODULE Module 1. Research Methods and Ethical Consideratons. Readings Chapter 1, selected journal artcies Activites. Discussion forum, group exercises, reflecton paper Module 2. Capstone Project and Final Assessment Readings Chapter 2, selected journal artcies ‘Activites. Discussion forum, group exercises, quiz Module 3: Technology integration and Innovation Readings Chapter 3, selected journal artcies ‘Activites. Discussion forum, group exercises, quiz Module 4 Contemporary issues and Global Perspectives Readings Chapter 4, selected journal artcies ‘Activites. Discussion forum, group exercises, quiz Module 5 Contemporary issues and Global Perspectives Readings Chapter 5, selected journal artcies Activites. Discussion forum, group exercises, reflecton paper Module 6 Case Studies and Applied Analysis Readings Chapter 6, selected journal artcies Activites. Discussion forum, group exercises, reflecton paper Module 7 Capstone Project and Final Assessment Readings Chapter 7, selected journal artcies Activites. Discussion forum, group exercises, reflecton paper"
    },
    {
        "image": "collegesyllabi1_synth_10_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "Republi DAVID VILLE COURSE NUMBER COUNSE DESCRIPTION COURSE PROFESSOR COURSE CREDIT TIME DURATION TH 80816. 90 A. CGURSE DESCRIPTION: This course provides a comprehen cracieal a sional prac edge to ceal worid profirienc, communicate tine thinking and rate affect Oamerstrate mastory nal 9¢¢ DB. COURSE MODULE Es i a Methods ana oun overcises. quiz Module 4: Contemp: 4nd Global Perspectives, Reavlings: Chapter é, selected toumat aricies Activnias Dise sien) feu, groun exercise quiz nc Giga! Perspectives Project end Eine A er tatu, gre"
    },
    {
        "image": "collegesyllabi1_synth_10_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines COURSE NUNBER COURRE DESCRIPTION : Srawze Manage GQUASE PROFESSOR Mr Kevintogan, Phe COURSE CRED 2 nas VME DURATION JTRS 00 1800 A. COURSE DESCRIPTION: “This course and practical rovides a cumpratensiv tion essential te agement, covaring theoretic nd advanoad sleay. be able te. analyze key con yy if talavani shiis and metho eH gles, and communicate findings word LEARNING COMPETENCIES: “Apniy critical inking at a lig fo Solve complex 9 Cotaherate attecively in le ‘jects and pee? i lems, 1g aciistes, Damonctrate mastery of ‘dations! Ineores in suatsgic management «Reflect on personal groath and profesviona\\ development throughcut the course, BD. COURSE MODULE Modula 1 Reseach Mathods aaa Ethical Considenatic: Readings: Chapter 1, selected oumal anucles Actiulies: Discussion fora, group exarcis Mauule 2: Gapstane Projent andl Fina! Assessment Resaai haicies Actos: Discussion forum, group exercises, un oeive 3: Tachnokagy integralion ans innovation Readings: Ohapse! 3, select jouraat artistes Dis forum, group exercises, guiz antemporary issiies 2nd hapnr 4 Actvitiog: Diseussion fo¢ Wortute 5: Contomaar Readings Anivines: Discussion forui Module Caso Studies snd A Shoda 4 Readings: 0 Readings’ Chaptar 8, selected jo Activites: Discussion forum, group exercises, reflection p Modul React Acinmies: Dist forum, group sxarsisas, ation paper"
    },
    {
        "image": "collegesyllabi1_synth_1_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines NATALIE VILLE UNIVERSITY College of Education SYLLABUS COURSE NUMBER +: EDU292 COURSE DESCRIPTION __: Research Methods in Education COURSE PROFESSOR _: Miss Morgan Knight, MS COURSE CREDIT nts, TIME DURATION MW 13 00 11 00 A. COURSE DESCRIPTION: ‘This course provides a comprehensive study of research methods in education, covering theoretical foundations and practical applications essential for professional practice and advanced study. B. COURSE OBJECTIVES: Upon completion, students will be able to: analyze key concepts; apply theoretical knowledge to real world scenarios; demonstrate proficiency in relevant skills and methodologies; and communicate findings effectively. C. LEARNING COMPETENCIE:! Demonstrate mastery of core principles and foundational theories in research methods in education Reflect on personal growth and professional development throughout the course. Collaborate effectively in team based projects and peer learning activites. Integrate technology and digital tools to enhance learning and professional practice. Conduct independent research using appropriate methodologies and ethical standards, Apply critical thinking and analytical skills to solve complex problems. D. COURSE MODULE Module 1: Professional Standards and Best Practices Readings: Chapter 1, selected journal articles Activities: Discussion forum, group exercises, quiz Module 2: Contemporary Issues and Global Perspectives Readings: Chapter 2, selected journal articles Activities: Discussion forum, group exercises, quiz ‘Module 3: Introduction and Historical Context Readings: Chapter 3, selected journal articles Activities: Discussion forum, group exercises, case analysis Module 4: Contemporary Issues and Global Perspectives Readings: Chapter 4, selected journal articles Activities: Discussion forum, group exercises, case analysis ‘Module 5: Technology Integration and Innovation, Readings: Chapter 5, selected journal articles Activities: Discussion forum, group exercises, case analysis Module 6: Contemporary Issues and Global Perspectives Readings: Chapter 6, selected journal articles Activities: Discussion forum, group exercises, quiz ‘Module 7: Introduction and Historical Context Readings: Chapter 7, selected journal articles Activities: Discussion forum, group exercises, case analysis Module 8: Theoretical Frameworks and Models Readings: Chapter 8, selected journal articles Activities: Discussion forum, group exercises, case analysis Module 9: Contemporary issues and Global Perspectives Readings: Chapter 9, selected journal articles Activites: Discussion forum, group exercises, reflection paper"
    },
    {
        "image": "collegesyllabi1_synth_1_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of tha Philippines NATALIE VILLE College of COURSE NUMBER COURSE DESCRIPTION COURSE PROFESSOR COURSE CRED THEE QUBATION A. COURSE DESCRIPTION: sive si ‘ris cgurss provides soundapons ane practcal apnicalons 6386 8, COURSE QBJECTIVES: oi be able to ana Luger completion, duden seonanigs, demons 2 of sency i ve Cc. LEARNING COMPETENCIES: ny OF COTS HUDEDICS 3 ~Bemonetrate mat an parsonai we \"eotiaborate eflectivaty ia wartebases prOle a tntaepraie technotngy and scanductesepondant inning aed anit p. COURSE MODULE Modula 1. Professt Readings. Chaplet 1 cup axe Module 2. 00rd crgeatings. onaler 2, selected jo pglentios, Discussinn Yorum, Group exRIC inpaduction ana Historical 3, gelaete acliviies: Disgussion form, ors Madule 4 Cantamporary [58% iecied jour “Readings: Chapter 4 Activities: Discussion ft 9 5, Tacnniaioy Readings: Chante §, “assent paodule 6: ConPenor “Readings Chapter &, salected Acemigs: Discussion paowuie 7 eroduction end Histo! saieciog jours a er 7 eatected sggion forUth, ches: Os Haodule &: Thestetcat fioy 8, setentes journal esi RUM, GUD 2 i Activities: Dist semporary issues ant ore, evant skit cytal tools 9 enhance apropdiats met nial Standants and Bast Pa selected tourna’ astcles aim, grap OAetCE srtegration and innovator journal aricles geen exaroises, Frameworks ane Mose! olor 9, seteried journal airs ‘group exercises, UNIVERS! Eoucation in education, caverta tneareteat advanced sty age rn reaiwons synigate fneteg? eoretica! yan vey concepts apety fo 6 cine methods tn 2a foangations 2, deuiagamenit 10 is andi gear tearing actives 1g anc profepsionsl prastiog. aiogies ard efricat niandare: ghaattne 20% ‘eompion problens. 5 i z ands Giobat Perspectives cles next saint articies ies case analy arbctes: ges, case analysis ee sat Perec tion paper"
    },
    {
        "image": "collegesyllabi1_synth_1_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines NATALIE VILLE UNIVERSITY College of Education SYLLABUS COURSE NUMBER eDU282 COURSE DESCRIPTION; Research Metross w Eaucaton COURSE PROFESSOR —: Mss Morgan knight. MS COURSE CREDIT dunes TIME DURATION Ny 13 001 00 A. COURSE DESCRIPTION: This course provides a comprenensive study of research methods in educaton, covenng theoretcal Soundatons and practcal appicatons essenbal for professional practce and advanced study 8. COURSE OBJECTIVES: Upon completon, students will be able to analyze key concepts, apply theoretical knowledge to real world Scenanos. demonstrate proficiency in relevant skills and metodologies, and communicate tingings eftectvely C. LEARNING COMPETENCIES: Demonstrate mastery of core pnnciples and foundatonal theones in research methods in educaton Reflect on personal growth and professional development throughout the course Collaborate eflectvely in team based projects and peer leaming actvibes Integrate technology and digital tools to enhance learning and professional practce Conduct independent research using appropnate methodologies and ethical standards Apply critcal thinking and analytical skills to solve complex problems D. COURSE MODULE Module 1 Professional Standards and Best Practces Readings Chapter 1, selected journal artcies Actvites Discussion forum, group exercises, quiz Module 2 Contemporary issues and Giobal Perspectives Readings Chapter 2. selected journal artcies, Activites Discussion forum, group exercises, quiz Module 3 intoducton and Histoncal Context Readings Chapter 3, selectea journal artcies ‘Actvibes Discussion forum, group exercises, case analysis. Module 4 Contemporary issues and Giobal Perspectives Readings Chapter 4. selected journal articies, Activites Discussion forum, group exercises. case analysis Module 5 Technology integraton and innovabon Readings Chapter 5, selected journal artcies Actvibes Discussion forum. group exercises, case analysis Module 6 Contemporary issues and Giobal Perspectves Readings Chapter 6, selected journal artcies, ‘Activites Discussion forum, group exercises quiz Module 7 intoducton and Histoncal Context Readings Chapter 7, selected journal artcies Actvibes Discussion forum. group exercises, case analysis Module 8 Theoretcal Frameworks and Models Readings Chapter 8 selected journal artcies, Activites Discussion forum, group exercises, case analysis Module 9 Contemporary Issues and Giobal Perspectives Readings Chapter 9, selected journal artcies Actvibes Discussion forum. group exercises. reflection paper"
    },
    {
        "image": "collegesyllabi1_synth_1_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines NATALIE VILLE UNIVERSITY College of Eaucation SYLLABUS COURSE NUMBER 2 EDuz82 ESURSE DESCRIPTION: Researsn Metnoos in Eaveation COURSE PROFESSOR tise hisnantomen nee COURSE CREDIT 3units TIME DURATION Nw 13 00 11 00 A. COURSE DESCRIPTION: IThis course provides a comprehensive Study of research methods in educati ‘oundations and practical applications essen) ion, covering theoretical Val for professional practice an d advanced stuay 8. COURSE OBJECTIVE: Upon completion, student scenarios. demonstrat effectively tS will be able to: anal Ivze key concepts; ay 'e proficiency in relevant PPIy theoretical knowledge to real Skills and methodol world 'og es, and communicate findings C. LEARNING COMPETENCIES: {Demonstrate mastery of core principles anc foundational als to enhance learnin, ‘ent research using appropriate 199 and analytical sills to solve D. COURSE MODULE Module 1: Professional Standards and Best Practices 7 Readings: Chapter. selected journal ates incites: Discussion forum, group exercises quiz Module 2: Contemporary issues and Globar Perspectives 7 Readings’ Chapter 2, selected journal arncies Activites: Discussion forum, group exercises, quiz duction and Historical Context Readings: Chapter 3, selected joumsl anretes Actiuites: Discussion forum, group exercises, case analysis Module 4: Contemporary Issues and Global Perspectives Readings Chapter 4. selected journal ates Actes: Discussion forum, group exercises, case Module §: Technology integration and Innovation Readings: Chapter 5, selected journal ace Actes: Discussion forum, group exercises, case analysis Module 6: Contemporary issues and Globat Perspectives Readings: Chapter 6, selected journal articles {ctivites: Discussion forum, group exercises quiz '9 and professional pract methodologies and ethical sta complex problems. tice, ndards Apply cntical thinki analysis Activites: Discussion forum, group exercises case analysis Module 8 Theoretical Readings: Chapter Fiameworks and Models 8. selected journal articles patties: Discussion forum. group exercises case analysis Module 9: Contemporary Issues and Globur Perspectives _Resadings: Chapter 9. selected journal articles Activities: Discussion fon UM. GTOUD exercises, reflection paper"
    },
    {
        "image": "collegesyllabi1_synth_1_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "COURSE NUMBER DOURSE DESCRIPTION COURSE PROFESSOR 20% ng theors foundations and practical applications eesental for professional practice and advanced stay B. COURSE ron completion, E ORVECTIVE! will be able te: analy 6: demonshois arch ©. LEARNING COMPETENC! Demonsiraie mastary of core princinles and Sundational theories in research meshods in enucct professional dev soughout ihe cours Readings Activites Discus n Foluth, group exereises, case analys Module 4: Contemporary ees Readings. Activites: snelysis Module 5. Techn: Readiny Act Moule 6. Readings: Chap Acti group Mogute 7 1 and Historical Context Readings: Chapter 7, setecteu journsi srl Discussion forum, o1oup Moduie entemporary"
    },
    {
        "image": "collegesyllabi1_synth_2_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "qubiie of the Philippines HARY VILLE STATE UNIVERSITY nage of Computer Seienee SYLLABUS COURSE NUMBER ord QGURSE DESCRIPTION : Ariicie Intense COURSE PROFESSOR <hr Edw Pa COURSE CREDIT Ants TIME DURATION COURSE DESCRIPTION: 7 mprehansive study of 2 2. COURSE OBJECTIVES: ons wil be als profaency al jects and peer feaining activites, aming ana craieasionel p ‘onal Gevelopment inroughout the course. reatiodoiogies aed st ‘ional theuries in arificial inietigenc “research using astery of core prneiplos an emonstiaie m 0. COURSE MODULE Module 1: Techn 98, reflection paper e Project and Final Assessment ings: Shapley 6, sstected j torumn, qrtup axersises, qute and Glotal ved foumal arises due 7: Centar Readings: Chapter 7, sels nnclogy imegration and"
    },
    {
        "image": "collegesyllabi1_synth_2_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines ‘ZACHARY VILLE STATE UNIVERSITY CColege of Computer Science SYLLABUS COURSE NUMBER comt69 COURSE DESCRIPTION : Artficialintespence COURSE PROFESSOR —_ M*. Edward Lynch, PRO. COURSE CREDIT units ‘TIME DURATION {TH 16 00 15 00 A. COURSE DESCRIPTION: 1s and ‘This course provides a comprehensive study of artificial intelligence, covering theoretical foundation practical applications essential for professional practice and advanced study. B. COURSE OBJECTIVES: Upon completion, students will be able to: analyze Key ‘scenarios; demonstrate proficiency in relevant skills and methodologies; an effectively C. LEARNING COMPETENCIES: sjiaborate effectively n team based projects and peer learning actives. “integrate technology and digital tools to enhance learning and professional practice. Retizcton personal growth and professional development throughout he course BShaut independent research using appropriate methodologies and ethical standards. ~Pomnonrate mastery of core principles and foundational theories in artificial inieligence ‘concepts; apply theoretical knowledge to real world 1d communicate findings D. COURSE MODULE ‘Module 1: Technology integration and Innovation Readings: Chapter 1, selected journal articles 7 Activities: Discussion forum, group exercises, case analysis ‘Module 2: Contemporary Issues and Global Perspectives Readings: Chapter 2, selected journal articles Activities: Discussion forum, group exercises, quiz Module 3: Professional Standards and Best Practices Readings: Chapter 3, selected journal articles Activities: Discussion forum, group exercises, reflection paper Module 4: Capstone Project and Final Assessment Readings: Chapter 4, selected journal articles petivities: Discussion forum, group exercises, case analysis ‘Module 5: Case Studies and Applied Analysis Readings: Chapter 5, selected journal articles Activities: Discussion forum, group exercises, reflection paper ‘Module 6: Capstone Project and Final Assessment Readings: Chapter 6, selected journal articles: Activities: Discussion forum, group exercises, Quiz Module 7; Contemporary Issues and Global Perspectives Readings: Chapter 7, selected journal articles: activities: Discussion forum, group exercises, reflection paper Module 8: Technology Integration and Innovation ‘Module 9: Case Studies and Applied Analysis Module 10: Technology Integration and Innovation"
    },
    {
        "image": "collegesyllabi1_synth_2_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "public of the Philippines sity ‘COURSE NUMBER COURSE DESCRITION COURSE CREDIT TIRE DURATION COURSE DESCRIPTION: secnpiehensive tidy of arvinial intatigence. co seifessionat practice ans act cal foundations ard ng neoret shy This course provisies a ical appueatons es: 6. COURSE OBJECTIVES: pon comsieton sudeite wi be able anatyze Key concep: appl enatios, bes oficieeiny in relevant seis an Cc. LEARNING *Eoiabeiate offecavely i tearr base course, standards sntasigenee. ident ravearch using anpropriaie exanoioiogies and eft ve praepiag arid foundatonat i ast “Demonstrate mastery 0 co! G. OOURSE MODULE aula 1 Technetogy Iplagration ark! Innowstion Readings’ Cheater 5, ssiecied journal erties Maduie Provessh Readings: = pativitios: Dis ission forum, grap exercises, eefiection Stone Proje jaa Asseasmient 10° Chapter 4, selected tournal artic Discussion frum, grows exer Se Shutias and Applied Analy hanter 5. selecied ournas armas sum, giOuE euercises, reflection paper Capstone Project and ve Fina! Aste Readings: Chapter 6, sain ral arteles 9, grOUP exer Activlies, Disessio: 8 Technology integravan and ini 9: Cage Stucies ane Applica -snology Intoaration and tanovation"
    },
    {
        "image": "collegesyllabi1_synth_2_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "Repubiic of the Phifing ZAGHARY VILLE STATE UNIVERSITY “age of Conguter Sense SYLLABUS COURSE NUMBER conn CQURSE RESCHIPTION —: Arttont inesgence COURSE PROFESSOR if. Boers Lene P SOURSE CREBIT hunts TIME DURATION TH 100. A. COUBSE DESGAIPTION: This course provides 4 comorehensive suidy of arificial intaligence, covering practical applications essential for professional practice ans advanced stu 1300 181 foundations 8, SOURSE OBJECTIVES: completion, stuients wit be able to: analyze kay concepts, apply cenaties, domonstale aroficiency in relerant exits and metodolagie: chvely knowledge to seahwwand nical ining ©. LEARNING COMPETENCIES: Colieboraie etiechvaty in team based proiects and pees +s integsate iechoaioyy ce loaining and protessinnst praction Refiect on personal growth and professional development zroushaut ine cours Conve! independent re roprigle metodalagies and etnical standards, Damonsiraie matory of foundational theories in astiicial mtatigens ote principles G. COURSE MODULE Moqule f: Technatogy integraten Readings: Chap Activiting: Discussion wary issues and Giokat P: Chapter 2, solecte: je4; Distseesion foram, 3 Innovation g5 Chaplet 3, selected journal arises Activites Diseussion forum, group exercises, cofiection paper Module 4: Caps Land Final Assesstnent 98: Chaple: ied journal aetices AeSvises: Discussion forum, gtiniy oxeTises, case analyst Module 5: Gase Studies and Agatied Analysis Readings Chapter §. selecied journal anicies jon vehi Capstone Project ang Final Assessine! Chapter @, eslecled journal aract ctvitdes: Discussion toi, group exareiees, quiz se emporary Isaules and Glove! Perspectives Rend ngs: Chapter 7, selected journai oriies Actullies: Discuesion foruin, group exercises, reflection paper Mastuie Technelngy intngration ang innavatton Module 9: Case Studies eral Apptied Anatysis: Module 10: Techaolugy integrator and Ineovation"
    },
    {
        "image": "collegesyllabi1_synth_2_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "Fepuilig of the Piviippines ZACHARY VILLE STATE QOURSE NUMBER COURSE DESCRIPTION CQUESS PROFESSOR COURSE CREO A, COURSE DESCRIPTION: fhunsree sudy of ariicio’ ibis ides. a sanpre “This couse P prsetion! applications essential fo g. COURSE OBSERTIVES: ‘will be aie wo: arvalyas Key upon scenarios; demonstrate fre coe cian ef C. LEARNING COMPETENCIES: Collaborate etectvety in 18K saith a ah persona! + Conse dependent rsaasc U5) pastery of ore pancipies ans foundat Demise COURSE MODULE ule 4: Technoingy integra T Readings: hapier 1, selec Agtetins: Discussion thse Hagdu e 2 0% Readings: Chap ies: Discussion fn ~AC nadie Readings: Chant Actinies Dizeussion fost, faodute S Case Saidies and Readings’ CP autvities: D odula 6; Gapstone Project Readings: Chapter 6, selec! _achyities Disguscion tors, Mogule 7: Conienporaty Readings: Chanter 7 Axiviie: Discussion fo Monuie &: Technology intesi 4 Module 15 7 sion forum, group exeveise' yorary fesuas and Gl et 2, selected joumal sfices pinfnesiona! Skandzids and Seat Pract 23, solonied journal arkales ar 5, setacted jt 10, O89 ee re SHEVERSITY SYLLABUS SS i etwegonce rao Lynah, PRE nce and advanced slutty, or igen; apply theo and cate fncinge: 1 in rosowann ils anid mat ‘ane projects and peer iearratey activites mois to enharice fearnings and picteswonal oracles. ant inroughoust ne cure odonigies and ethical standards in grifetal intetiigeno® aan onewation ae anaizss ‘grouy exercieas, rafection Pape inal Assezsmen article ‘Apgivad Anaiy st grt EXEICISS! 1 Figsal AssO8STH tog journal articles: group exercises, gute yee an Gicbal Perse: ation an RONSON gator and inne"
    },
    {
        "image": "collegesyllabi1_synth_3_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Phifinpines BARBARA VILLE COLLE College of Conputer Steno SYLLABUS OURSE NUMBER 2 Somes COURSE SESCRIPTION : Somouier Networks. COURSE PROFESSOR 0\". dati Fioner. SA, COURSE CREDIT Sunits THRE OUHATION HW 16 00 42 00 &, COURSE DESCRIPTION: ‘This course provides a comprehensive study af computer networks, cavern practical apslications excenbat i acivanone star thearelloat foundations and COURSE ORIECTIVES: Linon complation, starlents willbe able to scana ioe: demonsieate proficiency i retawant ax etechvely. key cancel piy Pesratical krawleugs ts rosst waikt ologies, and cominanicate findings ©. LEARNING COMPETENCIES: Conduicl insependan! research using 3p Cattaber aly in toaermnasec pe vate echnoloay ard aigital ols ta «Aoply chiical thinkeng and analytical ski methodologies an 18 and! poor warning activ aming att prewessonat oraatice oiitead stanaa: D, COURSE MODULE Module 3. Cese Stonies and Arphed As at 1, saleciad Journ Readings, Chapter 2, selected jouinat artic won onan. GeoUR exercioes, qt 21 Stangantis and Besi Preciicas Module 4 Readings Chapter 4 tivities Moduis Rasemeh Met Readings: Chapter 5, 4 Activites: Ds Activites: Discussion forum, gisup exercises, quiz Modwe 7. Research Methods ang Considerations selecied journal enides forum, group exercises, POSEY IsSIEG AN lot papar"
    },
    {
        "image": "collegesyllabi1_synth_3_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "COURSE HUMBER COURSE DESCRIETON ZOURGE PROFESGON COURSE CREB Tame puURATION A, COURSE pescri pronstag LIers ‘ais ouurse practical apt stot LEARNE jenendent rese3t efiectively mS ~integratt fe sy eto KI ae 6. ine pagel OF DAGTESSION ingy ane St id rsatyven NS COURSE MODULE 1g Analyst srigive stusly of Commoutes 7 al practice am Pa COMPETENCIES: sho using anoraotiate neta Oe spi topta 1 6 Apple Howat Case Sucies 308 Resckngs, Chaplet seiectad Put at artis Aches: tun, group anercises, FAC tipaule 7 Togsrebeal Pramas ane arid Mode! a ACHES Chapt aigeussion fom! wow Reasines beaivitns: DS AF AGEING: Acti odtute 5: Be asin o5 DBC prodtuin oat Readings CNA aeburies: DIS! piscuseton K sg0i07 wm creases. OF pewvties: DH wodule PRgadings: Chaplet sion pens: Se meaaie Readinge ciwiies 2, setae ch Methods apter 3, 32 fora, grOUe peers, sexected sion Tarvin, gO\" pustnods ahd Contamontayy 19, 010 natn, GFAP a) hea GOR evied journal at xan nef sstavical Content wert acces selected 19 gr, UD anit Gob yeurnatl att 0s, a tgsues gowdied tewum, group eee cand Innovano 1, geo: ener ig ard gest tear vompies prob sao 20895 erat ws, eae g awvane gard ion paper one Nes sandy ciomine and thio® Arte g ovoies 0 8 jeaning meoretical FOU\" coneat newies jasiations a to raaiwerid ‘communicate fini dara. pract"
    },
    {
        "image": "collegesyllabi1_synth_3_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines BARBARA VILLE COLLEGE ‘Colege of Computer Science SYLLABUS COURSE NUMBER COURSE DESCRIPTION : Computer Networks COURSE PROFESSOR Or Joel Fisher, MA, COURSE CREDIT 3 unts TIME DURATION MW 16 00 12 00 A. COURSE DESCRIPTIO! ‘This course provides a comprehensive study of computer networks, covering theoretical foundations and ractical applications essential for professional practice and advanced study. COMES3 B. COURSE OBJECTIVES: Upon completion, students will be able to: analyze key concepts; apply theoretical knowledge to real world ‘Scenarios; demonstrate proficiency in relevant skills and methodologies: and communicate findings effectively C. LEARNING COMPETENCIES: Conduct independent research using appropriate methodologies and ethical standards. Collaborate effectively in team based projects and peer learning activites. Integrate technology and digital tools to enhance learning and professional practice Apply critical thinking and analytical skills to solve complex problems. D. COURSE MODULE Module 1: Case Studies and Applied Analysis Readings: Chapter 1, selected journal articles. Activities: Discussion forum, group exercises, reflection paper ‘Module 2: Theoretical Frameworks and Models Readings: Chapter 2, selected journal articles Activities: Discussion forum, group exercises, quiz Module 3: Professional Standards and Best Practices Readings: Chapter 3, selected journal articles Activities: Discussion forum, group exercises, quiz Module 4: Professional Standards and Best Practices Readings: Chapter 4, selected journal articles Activities: Discussion forum, group exercises, case analysis Module 5: Research Methods and Ethical Considerations Readings: Chapter 5, selected journal articles. Activities: Discussion forum, group exercises, quiz Module 6: Introduction and Historical Context Readings: Chapter 6, selected journal articles Activities: Discussion forum, group exercises, quiz ‘Module 7: Research Methods and Ethical Considerations Readings: Chapter 7, selected journal articles Activities: Discussion forum, group exercises, case analysis Module 8: Contemporary Issues and Giobal Perspectives Readings: Chapter 8, selected journal articles. Activities: Discussion forum, group exercises, quiz Module 9: Technology integration and Innovation Readings: Chapter 9, selected journal articles Activities: Discussion forum, group exercises, reflection paper"
    },
    {
        "image": "collegesyllabi1_synth_3_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "COURSE NUMBER COURSE DESCHRETION orks COURSE PROFESSOR COURSE CRED: THE DURATION A, COURSE DESCRIPTION: peovites compre) sin! FoF BB coreqater Neti «ge dont Famer, A San 00 evening eran! ToURTRIONE BPE ay, comiputer nb 4 Batra! ise yhis seu siege 0 entrar OBUECTIVES: sie able to: anaiyze Key concerts apy the oy reieant a methosiog upon arta segnarias; demo\" afacheey: etnical Handards motnodiegies yegrning actites. og anc penioesionst prarice con LEARNING COMPETENCIES: ceinaependient vosea7ch USING seprantiats Mocarvnty ih woaen based poe Conti siniaarrate Appi enitioal gp. COURSE MODULE Spode 1 Gast Ssiaies and A aings chautat *, sevectod feu nctndes: DISUSE’ SHUT, ono oxBics 1 Framentarts ad HOGS jour BESS grog 28 Syandards 200 BES rocked ours art grup exercis cefeciion DBOeE ceiges, ue Prantices ys, Canter 3, netivities: Discussion AIT, Jaoaute 2 Professional StANESe egaings: Chapt 4, stores es: Dageassieh fOTUT GOES i Regwarch tetas ane ES: eeempter 5, savecies iourtal aicles eps: Discussion Toru gTaEE AN ises, GUE inoue 8 Readings. Apivites: 0 Moduie 7: Reveae dings: CED! i010 iseverted journai 3 80 exe Einical C yarn atch ses, £252 jon Sarum jon methods ere ‘eaten JO ip 9 Fecrnostayy MNearAHON 2 ter 9, sclaeted owinal STHCES jan farurn, Grou e et oRaninas: CN “adiviies: Giscussl scoreigas, resection 230%"
    },
    {
        "image": "collegesyllabi1_synth_3_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "Republe of BATA WE tho Phikpolses VALLE COLLEGE Mubeoxtes Soc cece SYLLABUS COME COURSE MURBER COURSE DESCAIRTION COURSE PROFESSION A, COURSE PESCRIPTION: sass cxarae prostsen a COMBE! sai eppiicanons esee prac COURSE ORIRCTIVES: Uipen sorretetion, sadets ya be a eenawins, demonstrate AGS atosteety. G LEARNINES COMPET nguet independent mans yo attactunty i Ba vpregrate mcrrosogy and Sigal BSS o ‘spot cxtical muntang ae analyaca’ 36 COURSE MODULE Maun 1: Cave Skates ane APH wpaadings. conepter *, Select 7 ‘petnating: Oxseessiod 1O7Us arcane 2: Tearatioa! FANE Meadings: Ctapler 2, ees Tectia: Dicssaion fore, AM paodute 3: Profession Stondards a Siaeaaings: Chapt 3, 586 anes: Disce sagan fore Profession group ea Reaper 4, s3tect Pigcassion Foc, OE Fescern Methe® ees, ete FO 19, OH Module 4 F “Readings: Acti 0 sacancie 6 He “Readings: C aces TscoSstOn FOCI, erences HEROGS oates? Acnvibes: Bt tsoenae 9: Tannokogy meoE Fecatnge: Chants acoesins. Hiseasso kal tos pane sain STENCES: ny apprott group oxercaee sy and Noes jouinai ste exgreses, ne ari vy ance and CY sna scicies conay ORR anid Innate? ert, Fo ERE Jo tp: analy bo is enhance i to S08 ere ang Best Pract gegen eabcie® ssarct ne Ethical righ BCE 568, qt 0 Ae aie mannodeiah aetwetes, cavenng heoralt qoivanced sUsy copy rocentioat ¥6 jp concents, 8 ote ne meshadoleanes: a6 1g pees teniming actos coring ane eronessiana! Ha vg cOATPHER BIUTIETS, case anabreit raicteratons cd cap uridations ame satecige to raaWONS cate INS yr otra OM <0."
    },
    {
        "image": "collegesyllabi1_synth_4_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "Repub SAMUEL ViL OOLASE NUMAEE 2 BD COURSE DESC! SOURSE PROF COURSE CREE TSE DURATION IP TON S8G8 Set 2 of the Philippines LE STATE UMVERSITY Coltege of Education SYLLABUS Asseusment and Evian ‘gen Stor, Fi Santis ME 1800 91 00 A. COURSE DESCRIPTION: SOUNSS provides a compres ane pret asive study of assessment 3 nd evaluation, covering theared advan B. COURSE OBJECTIVES: Upon comptation paring; dame artective! shidents ili be abi strate profwien ulavant skits end mathadolagias, and communicate finda G. LEARKING COMPETERCIES: Cobacorete ef Conduct independent research using appropriate oetnodsingies ant Reflect on pemonal growth and professienal dewinnment rouge imegrate technw Domanstes mastery of core cilvely in tear logy ane digital 30! G. CGURSE MODULE Modula t intradvellon and Historical Context Resi pec 5 Discussion Modute 2: Treorete sme works a neiplea an and pees leaning aclivites nical Sanderds st ha i 0 enhance leaming ana professt sional theories i ao ssemient anu evaluat ings: Chapter 1, selected jeuraai arian 9, QrsID EXERINBS, Case AnSt PB Readings, Chapter 2, salectad jownat arlicies Reagings: Chane 6 32! Modute pate: todule ®.C: Feadings Adivites: Des seer 4, seiscte jon Fonam, group exereises, Quit Activitios: Drscussion f jadule 8 Tachinulogy Integration and innovation acted ston fore, smeWOIKS a yevion forum, ioup 2056 ied suena a rafiection paper ana innovation case vf Motels ‘Analysis to: unsiyze key concepts: apply thooreteal knowindgs to wear wond"
    },
    {
        "image": "collegesyllabi1_synth_4_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines SAMUEL VILLE STATE UNIVERSITY College of Education eee SYLLABUS COURSE NUMBER EDU‘ COURSE DESCRIPTION: Assessment and Evataton COURSE PROFESSOR —_: Logan Stone, Pn. COURSE CREDIT Sunes TIME DURATION [MWF 1600 1100 A. COURSE DESCRIPTION: ‘This course provides a comprehensive study of assessment and evaluaton, covering theoretical foundations and practical applications essental for professional practice and advanced study. B. COURSE OBJECTIVES: Upon completion, students will be able to: analyze key concepts; apply theoretical knowledge to real world ‘scenarios; demonstrate proficiency in relevant skills and methodologies, and communicate findings ‘eflectvely. C. LEARNING COMPETENCIES: Collaborate effectively in team based projects and peer leaming actvites. Conduct independent research using appropriate methodologies and ethical standards. Reflect on personal growth and professional development throughout the course, Integrate technology and digital tools to enhance learning and professional practice Demonstrate mastery of core principles and foundational theories in assessment and evaluation D. COURSE MODULE ‘Module 1: Introducton and Histoical Context Readings: Chapter 1, selected journal articles ‘Module 2: Theoretical Frameworks and Models Readings: Chapter 2, selected journal artcies Activites: Discussion forum, group exercises, reflecton paper ‘Module 3: Technology Integration and innovation Readings: Chapter 3, selected journal articies Module 4: Introducton and Histonical Context Readings: Chapter 4, selected journal articles ‘Module 5: Technology Integration and innovation Readings: Chapter 5, selected journal artcies Activibes: Discussion forum, group exercises, quiz ‘Module 6: Technology Integration and innovaton Readings: Chapter 6, selected journal articles Module 7: Case Studies and Applied Analysis Readings: Chapter 7, selected journal artcies Activites: Discussion forum, group exercises, quiz ‘Module 8: Theoretical Frameworks and Models, Readings: Chapter 8, selected journal articles Activites: Discussion forum, group exercises, quiz Module 9: Case Studies and Applied Analysis Readings: Chapter 9, selected journal articles ee"
    },
    {
        "image": "collegesyllabi1_synth_4_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines SAMUEL VILLE STATE UNIVERSITY College of Education SYLLABUS COURSE NUMBER EDU360 COURSE DESCRIPTION —_;: Assessment anc Evasion COURSE PROFESSOR =i\" Logan Stone PhO COURSE CREDIT 3unts TIME DURATION MWF 16 00 11 00 ‘A. COURSE DESCRIPTION: ‘This course provides a comprenensive stu foundations and practical applications ess ,dy of assessment and evaluation, covering theoretcal ential for professional practice and advanced study. B. COURSE OBJECTIVES: willbe able to. analyze ke) ¥y concepts. apply theoretical knowledge 10 real wor d ficiency in relevant skills and methodologies; and c Upon completon, students scenafios, demonstrate prof communicate findings effectively C. LEARNING COMPETENCIES: “Collaborate effectively in team based projects and peer learning activites «Conduct independent research using appropriae methodologies and ethical standards \"Reflect on personal growth and professional development throughout the couse vJptegrate technology and digta tools to enhance learning and profession@! practee. _Dermonstrate mastery ofcore principles and foundational heories in assessment ‘and evaluation. D. COURSE MODULE Module 1: Introduction and Historical Context Readings Chapter 1. selected journal articles activities: Discussion forum, group exercises, case analysis Module 2: Theoretical Frameworks and Models “Readings Chapter 2, selected journal articles ‘Activites. Discussion forum, group exercises, reftecton paper Module 3. Technology Integration and Innovation “Readings Chapler 3, selected journal articles \"activities. Discussion forum, group exercises, case analysis Module 4 Introduction and Historical Context Readings Chapter 4, selected journal aricles Actvibes. Discussion forum, group exercises, Quiz Module 5: Technology Integration and Innovation “Readings Chapter 5, selected journal articles ‘Actives. Discussion forum, group exercises, Quiz Module 6: Technology Integration and Innovation “Readings: Chapter 6, selected journal articles achuties: Discussion forum, group exercises, case analy: Module 7: Case Studies and Applied Analysis Readings. Chapter 7, selected journal articles «Activities: Discussion forum, group exercises, quiz Module 8: Theoretical Frameworks and Models vReadings Chapter 8, selected journal articles Activities: Discussion forum, group exercises, quiz Module 9. Case Studies and Applied Analysis “Readings Chapter 9, selected journal articles ‘Activities Discussion forum, group exercises, case al sis nalysis"
    },
    {
        "image": "collegesyllabi1_synth_4_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "Rippines: INVERSITY Republic of the P COURSE HUMBER SOURSE DESORIETION COURSE PROFESSOR SGURSE CREO TE DURATION A, COURSE DESCRIPTION This course provides a commpretaaave jourrdationa ana practice! appliestons esse B COURSE OBUECTIVES: Uipon sorption, students wit eo able (9 28 ronstraie prasency in relevant hi oti eal knowledge {0 ining p s; apply theote! ies, and £21 alyza wey co cis ane 1 reeruonicate FABHING COMPETENCIES: Spovate sfiectvely in warrebases prciecss Tndependent esearch using aDPTODNSTE netnedat anal gout ad professional cuvetoprTent Fes fo enhance ianmning and pratessic 6h pt stngkogy and digits! 19083 nd poor eesraing activihes ‘and sthicat standal phic the cows zk peace aiid everuaion, Cond +e stearate 2 Demonstrate mastary oF ‘foundation: COURSE MODULE Mioguie intaduetion ans Hiioical Gentes ecaignge, chaprer 4, soiscied jamal Areas Aativ senion ORM, OUP EABTASES, Howie 2 Treostical works aria Modats sg Chapier 2, seteciad journal ares analyss Reading cee iiros Discussion frum, group masrtoes, tector HSPSE “g Techmoiagy stearation 290 ier 3, getected [9 analysis sant, GeOUD EXETISS, CABS Gon aod Higarical Context tec jounal athe exercises, Gute Readings: Chae sO 6, selected yourniat aticles am, group exercises Sctivinies: posule 7 Case Stati “Rwedings: Cawsier aetigties: Discussion Module 8. Thaoretcal Fremewe 1g Chapter 8, s iectes JO group enerel cs and Nauels jorma aries 2, quiz redies an tor 9. selected 1ourr aroup exercises, chap! i articies Actiatieg: DescHasion fOHUEE"
    },
    {
        "image": "collegesyllabi1_synth_4_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines SAMUEL VILLE STATE UNIVERSITY College of Education SYLLABUS COURSE NUMBER EDUS6O COURSE DESCRIPTION _ Assessment and Evaluation COURSE PROFESSOR Mr. Logan Stone, Ph D. COURSE CREDIT 3 units TIME DURATION {MOF 16 00 11 00 A. COURSE DESCRIPTION: This course provides a comprehensive study of assessment and evaluation, covering theoretical foundations and practical applications essential for professional practice and advanced study. B. COURSE OBJECTIVES: Upon completion, students will be able to: analyze key concepts; apply theoretical knowledge to real world scenarios; demonstrate proficiency in relevant skills and methodologies; and communicate findings effectively. C. LEARNING COMPETENCIES: Collaborate effectively in team based projects and peer learning activities, Conduct independent research using appropriate methodologies and ethical standards. Reflact on personal growth and professional development throughout the course. Integrate technology and digital tools to enhance learning and professional practice. Demonstrate mastery of care principles and foundational theories in assessment and evaluation. D. COURSE MODULE Module 1: Introduction and Historical Context Readings: Chapter 1, selected journal articles Activities: Discussion forum, group exercises, case analysis Module 2: Theoretical Frameworks and Models Readings: Chapter 2, selected journal articles Activities: Discussion forum, group exercises, reflection paper Module 3: Technology Integration and Innovation Readings: Chapter 3, selected journal articles Activities: Discussion forum, group exercises, case analysis Module 4: Introduction and Historical Context Readings: Chapter 4, selected journal articles Activities: Discussion forum, group exercises, quiz Module 5: Technology Integration and Innovation Readings: Chapter 5, selected journal articles Activities: Discussion forum, group exercises, quiz Module 6: Technology integration and Innovation Readings: Chapter 6, selected journal articles Activities: Discussion forum, group exercises, case analysis Module 7: Case Studies and Applied Analysis, Readings: Chapter 7, selected journal articles Activities: Discussion forum, group exercises, quiz Module 8: Theoretical Frameworks and Models Readings: Chapter 8, selected journal articles Activities: Discussion forum, group exercises, quiz Module 9: Case Studies and Applied Analysis, Readings: Chapter 9, selected journal articles Activities: Discussion forum, group exercises, case analysis"
    },
    {
        "image": "collegesyllabi1_synth_5_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "COURSE NURBER COUESE DESCRIETION SQURSE PROFESS: cOUASE CREBTT HAE CABATSON A, QQUASE DESCRIPTION: cornet ‘gations pasenti fof sig course provices ane practice 6 QOURSE CBIECTIVES: Upon complation, stud scenarios cemonstate effect ¢. LEARNING COMPETENCIES: “Soanorte effect Conduct indepaniar integrate echnviogy sanity D. COURSE MODUL Module +: Research Motions and Ethi [Autivties, Blecussion: forum, ar reine feadatia 2 Readings: Acivibes: Discassion Medias 3 Gon Readings. Shaper Aelita phustule 4: Cace Stori caster piscussion forum, 9roUD exsress rshcat Frameworks and Medes Discusex apter ing and 3 pastor 1, selected journal rary Digcussion fon Discussinn fon Contemporary tssues and te Trgaratica Prasaworks and Mow Republic of the Pallinpines STEPHANIE VILLE COLLEGE College of Eaucalion SYLLABUS or Davetopeient iss, Raymond Hatin, HAL Sens Tenia ponsive study af profese snal orautes and sovance nig nil ba abe to: analyze aay 80% ee yin teari nased nvoients and aaer ieaming act craaaich using appropriate metnadaiogiet ae aqtal tools te enhance tececning, cat Considaratios ip oer ry igaues ars Global Persped 2. selected iawtnal articles 1 tora, growin SHC ues aiid Gioval Perspectives cye9 journal arictes refiehoo p and Applied Ar atuchod oun! attic group 9x nal a seiveted journal aricies 19a farm, group enercises, someon a Ty selmi jourTal IES OUE exe Ethical Considerations tac journal atbctes isrimn, aitup exersiags. nase analysis ancy in relavant oxils avai meMiodaiogion: uluea davetogerant, covering tesrebca suid toyncetons ji"
    },
    {
        "image": "collegesyllabi1_synth_5_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines STEPHANIE VILLE COLLEGE Castege of Education SYLLABUS COURSE NUMBER ou ‘COURSE DESCRIPTION COURSE PROFESSOR SOUNSE CREDIT TINE DURATION A. COURSE DESCRIPTION: ‘This course peoviges a compre ang pra Jinn Devasecimes es, Raymane Hater, Bs 20TH 12: 200 ity of curricuiurn development, covaring t fessional prae foundations val applications essortia! foro) &. COURSE OfEcrives: lon, students will be able by: anwiyze key consents; apply os; demnenstrale moficisney in relevant skils and mathadoiogs ge to raai woris nmunicate findings C, LEARNING COMPETENCIES: *Dollaborats effectively in teain based pisis Conduct independent essa doles kitegrate technology and digitat ois to enhance learning ant Soply eriical thinkany anc analyticar 28a 0. COURSE BODULE t: Research Metis ard Ethical Considerations: Chanter 7, selected journal manvary insuas and Global Pi ‘Ghapter 2, sstected jaurnat a f forum, group exsrtises, reflection panes idodule Contemporary ismues and Global Perspectives Readings: Chapter 3, suiected joumal aricia: Activities: Discussion forum, group exercises, quiz Moule €, Ca ss atal Applied Anaiyels Rowdinus: Chapter 4, seloctarl journal articies Acthities. Discussion tou, group axersises, quiz ‘Module 5: Contemporary Issues ane Gobai Ferspactives Readings: - Actas: Discuseion forum, roup exerciser, quiz smeworks and Moda s ings: Chapter 8, setected joursal articles Actvitias: Discussion tr 3, rafisction paper douiuie 7: Theos Readings: Chapter fed journal articles Activites: Or f0UG BaercIseS, cf Readings. Chapter &, cetectad joural art Activities: Bin srases, cage analysis Conair Readings: Chapter 9 selected joumai atcies Activites: Discusstve lorum, group exercises, cass anatysi"
    },
    {
        "image": "collegesyllabi1_synth_5_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Phitinpines STEPHANIE VRLE COLLEGE College ut Education Discusion Exum, Qrou0 wroycites reBecton paper Moduie 7: Theoretica! Frameworks end Medets Readings. Chapter 7. celected journal Aciivibios: Discuseton team Soup exercises, reflection paper Modute $:Thecratcal Framawarks and Models Resoings: Chagser 5. ueiectod jourres artctes To"
    },
    {
        "image": "collegesyllabi1_synth_5_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "of the Priippings STEPHANIE VILLE COLLEGE Cofege of Oe sy men UD Course pescmeTin :ceneum Onn COURSE GpESSOR the. Sarmenstntea ‘aes cREDN $114 1200 1200 a COURSE DESCRIPTION: Z evelopmant coveding esata! outetaBone acvenced stidy teciute 7. Trscretical Framenctss and Wests ~Readingy. Chaplas 7, setecied jour artcles Retetaes: Oracuiseion on\", group eamecnses Readings. Chaplet 8, aelectes joumsi ances pabaies. Dacuselen forum, grou anereises, cae anuj"
    },
    {
        "image": "collegesyllabi1_synth_5_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "of the Philippines STEPHANIE VILLE COLLEGE ‘College of Education"
    },
    {
        "image": "collegesyllabi1_synth_6_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Phitiopines SANDRA VILL 3 Sollege of Engineering SYLLABUS ena COURSE DESCRIPTION «; Trewecaynentes CODASE PHOFESSOR 2M. Veen ving, 4S COURSE CREDIT ae THREE DURATION i; A. COURSE DESCRIPTION: This coainse provides conmpranariaive study of thernadyraniice, covering timaretic practica: noplicatons esnaes! for probissioral practios and advanced study, B. COURSE OBJECTIVES: Lures complet, stucsnts 9 be able to: aralyze key concepts, anpiy thenestioat keoswtedige fh real world ratios; Gamansliale prooency in reiavant shits and mathedotogles, and aammmanicate Fruings efiectvety G. LUBARNING COMPETENCIES: Dercunatrate nsestery of core prosipien atte foundational tmsurieg thermodenansics Aply crticas thinking ancl analytical axis to soive conpiex probleme sIniegrsty mctnelogy and sigitet wots enhance ieaming and professional graces Collacorsie atiketoely in taarnbesed roiacts and ser loanizg wetivites t. CGURGE BOSULE Masta 1: Cupetane Pregect and Fiaat A2ansansent Reeasings: Chapie! +, ewiactes cna arinicn selva: Oascunedet forum, oun exeremes, a Wicstule 2 Case Ginter ane Aptid Ari ain Rasainge: Chaps 2, ented oorn aitches Rares: Daouaninn forum, group aera, rofectan asper Reoai 5: Iniexsacton and Ngtora n Cestent Rewringe. Charter 2, seecind ean aries Retwits: Deecusmon forum, grou aceecibee, reierton paper spi &: wirasuctien ond Hierorce: Cotes -Resangs Shoots 4, nelseaed iow ations Acti: Decusaion forum, gen mxercaee, clint Meduie 5: Tews Premnpeorks 2 Nets eating: Chapin smiecten warns! artcina Actutizs: Dicusnion thru, @oup axersaee, cose anctyelt Neue Reseainn Botha ser Eten! Gorecerations, ‘acts: Chale, ected ua ares tik: Orcuscion forum, cro wrercices, eae am ice 7 Contemerary lass se oa Pe species Ranges: Ghopies 7 setected pura aeticies fictew Divcassion forum, grup exerciees, cae eonly ye auf 8 Itroctctaon ars HaxSoioad Cortex Reatinge: Chapter wetected muznas aeceea Actietina: Ciscimain fore, group axereiues, case analysis Moule Contomgoray neues eexi Chains! Prrepseiivee nar grou easccnes, cities Dae iMociee 11: Sepstona Peet and Fl Aapowncoere"
    },
    {
        "image": "collegesyllabi1_synth_6_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "SANDRA VILL College of Engineeting SYLLABUS OGURSE NUMBER SOURSE DESCRIPTION cour ROFESSOR COURSE CREOT TNE CURATION A, COURSE DESCRIFTION: kromeage undatlonal theones in teimorynarnics proilente, ‘ana digital tcots te er leamn pased project ard Final Aaseseinent Perera ea += Aone: Uisetsssion forum, fue, groun exercives, vane anaiysie Readings’ Chapt Aobrties: Discus"
    },
    {
        "image": "collegesyllabi1_synth_6_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines SANDRA VILLE COLLEGE College of Engineering SYLLABUS COURSE NUMBER 2 ENG213 COURSE DESCRIPTION _ Thermodynamics COURSE PROFESSOR Mr. Valerie Livingston, MS. COURSE CREDIT 4 units TIME DURATION MW 11 00 12 00 A. COURSE DESCRIPTION: This course provides a comprehensive study of thermodynamics, covering theoretical foundations and practical applications essential for professional practice and advanced study. B. COURSE OBJECTIVES: Upon completion, students will be able to: analyze key concepts; apply theoretical knowledge to real world scenarios; demonstrate proficiency in relevant skills and methodologies; and communicate findings effectively. C. LEARNING COMPETENCIE: Demonstrate mastery of core principles and foundational theories in thermodynamics. Apply critical thinking and analytical skills to solve complex problems. Integrate technology and digital tools to enhance leaming and professional practice. Collaborate effectively in team based projects and peer learning activities D. COURSE MODULE Module 1: Capstone Project and Final Assessment Readings: Chapter 1, selected journal articles Activities: Discussion forum, group exercises, quiz Module 2: Case Studies and Applied Analysis Readings: Chapter 2, selected journal articles Activites: Discussion forum, group exercises, reflection paper Module 3: Introduction and Historical Context Readings: Chapter 3, selected journal articles Activites: Discussion forum, group exercises, reflection paper Module 4: Introduction and Historical Context Readings: Chapter 4, selected journal articles Activites: Discussion forum, group exercises, reflection paper ‘Module 5: Theoretical Frameworks and Models Readings: Chapter 5, selected journal articles Activites: Discussion forum, group exercises, case analysis Module 6: Research Methods and Ethical Considerations Readings: Chapter 6, selected journal articles Activites: Discussion forum, group exercises, reflection paper ‘Module 7: Contemporary Issues and Giobal Perspectives Readings: Chapter 7, selected journal articles Activites: Discussion forum, group exercises, case analysis, Module 8: Introduction and Historical Context Readings: Chapter 8, selected journal articles Activites: Discussion forum, group exercises, case analysis, ‘Module 9: Contemporary Issues and Global Perspectives Module 10: Theoretical Frameworks and Models Readings: Chapter 10, selected journal articles Activities: Discussion forum, group exercises, reflection paper Module 11: Capstone Project and Final Assessment"
    },
    {
        "image": "collegesyllabi1_synth_6_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "epsbtc of the Philippine SANDRA VILE COLLEGE Cotiege of Engineering SYLLABUS COURSE HUMBER SQURSE DESCRENON : Pemed nani COURSE PROFESSOR 19. Volos Lisigsion 4S SOURSE GREET 4 un DME QUA TION aeihedineed A. COURSE DESCRIOTION: ‘This couse orondes 2 coinpeanennive stugy oftheemodyramice, covesing th practical applications esoartiak tor aroiessional practive and advanced sty. sorutead loureations aoe B COURSE OBJECTIVES: Upon compiotiun, stagante a9 oe able Wo: analyze key conoants: apaly theoretical Knowiedye ts feabwiontd Stenases, danorsirate profelency in meizvant exits and metadoiogien, and commnuricate Secings revel C. LEARNING COMPETENCIES: Bersoastale masiny af core gwincinios wid touniationss theories in Patteodyramics. Apply eribcal thinking an¢ analytics axils io solve complex grobiems, integrate technology and digéal pols to gnhance taining anc profeasians! practice. J Collaborate Okocnuvly in teanehaved projects and nese fe ‘ition b. COURSE MODULE Hodis §: Canatene Project and Fina Asean arent Bondage Chapter 1, selzcled juin! wicles ACB: Dacor tora, grog everene8, gone bheste F Case Sudo erat Aagted Anas Pieadrg: Chanter 2, yolected jours arteine Actisbies. Datcuasise forute, grup oxercess, etienton paber Mekia berecction are rintovtad Contest “Peadge. Chapa 3, eter porn! totes Aciviies. Dagunston fnum. group excrosees, roiaction pane ners intezazcton ond Hsteica’ Contest Reselnwgs: Chaise 4, neiecton porns ates ctivikes: Danaseinn forum, group axetcines, foflesdon wane Hecke 5: Thgorsieat Frameworks ard Wee SRaasiogs: CAYSET 6. wanted Sua! asta Reatng Chapier 7, aaiacted jours articles 199, case analyatt URasengs, Chegier 8, petcertd cornet arcciee 1 dctivters: Dascvasin forum, grow avernines, cane analyst Mivka 8: Comtemnsrary taanen wid Ghivel Perepecties ‘oss 19 Thaceetical Peasmasorts ant Moos Resins. Gnagier 10, slectes jurat artis Reliving: Cascussion Keres, grown exerotue, reentia naHer ease 4: Copatane Project ae! Fra Aaeansonect"
    },
    {
        "image": "collegesyllabi1_synth_6_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "COURSE NUMBER COURSE DESCHIPTION CGUASE PROFESSOR NOUNS CRED ones TIME DURATION i AWTT 90 4200 A. COURSE DESCRIPTION: This pours prowdes a comprehensive shady of ier practical applications escent for prote tty %. COURSE OBJECTIVES: pon coy AMING COMPETENCIES: Demarstrats mastery of core principles apd tounttational theanes in thonmodyuamics Apply critical thinkteg and anaivicsi skills salve connlex problems, ‘earals technology and digltai lois t enhavice learning afd professions! practice Collaborate atfectively in team based po ning activi &. COURSE MODULE Nida V Capstone reject an Feat Ansezsmect Reacinge: Stasier 1, selected jounal aries im, gb exsrCiBs, pes and Spied Realy, et 2, lected Jeurnat aricion sain Forum, group sxercises, reliection separ 2 tntioducton ae vie 4 etracteny ane Reasinge: Chapioe 4, seleten 5 Module 5: Theeseoe! Shaper 5, Pascingss: Shenker &, weiscled jos Atiiters: Diaevenien forum, yeti axercises, catecton pape: néule 7: Contemporary laser a3 Giobat Perapecives Reotioge: Chapter 7. eeiscted jowaal avinies vasion Sonn, geup ercicises, cate anise intioducton mat Histor Reaginga: Chanter 8 30 TUN Group exereines, reacts purer tie 1: Capstone Propel ane Fal Asawasmient"
    },
    {
        "image": "collegesyllabi1_synth_7_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "@ of the Phiiopines ERIE VILLE INSTITUTE SYLLABUS COURSE HuMSER COURSE DESCHIETION COURSE PADFESSON COURSE CREDIT TIME DURATION 8 comprsiwensive study 4 practis! applications essantia r dations 5. COURSE ORY OTVES: Upon comolalon siudents wit be abe to: analy Scanerios: cemanstrate prosciene etlectively *C2p8, apply relevant skills ana matiodot theceatical knot fagses; ara 9 jedige to rel “Demansirae Conduct insepensent researc) Apnty crt C. LEARNING COMPETENCIES: tery of eae nai id foundation ing ehorapriate matacio% 2 NG analytical skits in suave theories in organuzatenat wenawoe es and ethical standards plex prepians ‘based projerts aivd peer fearing WOKS to enhance leering And professional aractice 8 Aptiod Anatyss ings Chapier ¢, selected joumai articles nai Assaasingsit Caapies 2, selected journal atic ctiviter: Discussion Modus 2 TIM, G0U exeicions, quiz atch Hethods and Ethieas Consiasrations ings: Chapter 4, selected journal asticnrs Activites: Discizasion forum, group exersise ‘eles aa! Ap Readings: Chapter 5, se eciou! jou Actives: Disct SOup exercises, case anaiys Btodute Hod and Ethical Considerations Readings: selecied loumai arieios Activities UM, GUM exercises. case an Nou chiology infegraton and innovation Readings’ Chapter? ioumal etcies Aclivites. Discussion forum, group exercises, Module 2: Case Skities and Applied Angie:"
    },
    {
        "image": "collegesyllabi1_synth_7_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "Rlepubtc o! the Phikppines: VALERIE VILLE INSTITUTE pasar ASPECT a SYLLABUS COURSE NUMBER 2 Sus COURSE DESCRIPTION: Susaneaicns Berane SOUNSE PROFESSOR tes. fem Coun MS COURSE CREDIT ote THE DURATION PANES COED A. COURSE DESCRIPTION: oatewor, covering Dhecwetica founseiiors hws couitoa rorides compte! ang pracscat appacston’ 8 COURSE OBJECTIVES: upon compivten, staan scenanos, demonstra sresciancy execrve y yneasiva stuty ol oxganizationst tal by protessional practice and advanced SCY 5 eset vrs be abie 0 analvae kay conc, anily tweoredoa knewingg8 real word vr ronevart naire Sr rmethodDiC ges aNd ComMTAAMIC ats HNSADS 6. LEARNING COMPETENCIES: peat ingonms in arpanizadonal neha “enenssaie astery Vcondactindependent resaaich using sonreprate me Appty critical ininkiny Contaparate flectve! sintegrale technviogy and col core panaphes and kaundate sradoingies and wihucal starcants. ‘and anatyacal suis 10 seive cometer prvpler tam baced wrojncts and peer iamnng aches dapat ais to ahance wariig and protassonal HOME D. COURSE MODULE Module Case Sardios and Appuns Analysis Readangs. Chapter Achitos Modute 2 Canzio Readings cnn 2, veleciet jou Acaenner Discussion Mocula 3 Capstone Proyect and Final Assessnent Rawaings Canter 2 soiecied youmnat articles Discussion tonum, @ouD avarCiaes, TeReCtON PADS ne Project and Fina! Assessment at arteior furan, group exwrcises, case analy is selec usr accies Tactates Discusion forum, gcOup enereses. Quit mrecaute 4 Se2a\" Readings. Chaplet Actrates Discu2sion forum, grout Modula 6 Reseann “Readings Chaplar é, seiecied journal artes ssion Forun, group exerave Aawviter: Os toouie 7 Yecheote Reacings: Chante’ Acavinos Disrussion forum, group err arch Mines and Etvical CONsicaraSons Readings Shaplas 4, slecked yourTial artcles Petes. Gescuasion frum, OPDUP OxeTIse8, octane 5 Cee Saxdies and Applied ANaiYSS retection paper 5 setecteg jowirnat witicles exercises case matyss 3 .gnIeFaIONS Menods aa Ems 5, cADe BORIS ietegration and Sracration 67 savectes JOC BLA 8. reflection nape’ Module 8 Cese Stuces and Auphed Analysts ne"
    },
    {
        "image": "collegesyllabi1_synth_7_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Phitipoines iINSTAG fe SYLLABUS COURSE NUMBER BUSS COURSE DESCRIPTION izsional Reteviee OOURSE PROFESSOR reeny Benster, 8. oREDT sSunts TIME DURATION [HOW 13 00 46 00 A, COURSE DESCRIPTION: ous pie ons and practical ve study pplical B. COURSE O8J S: up: fon, sluctenls wit ore scenaries; daronstrale prof effectively 6. LEARNING COMPETENCH 5 sdatiunal theories in organizationai behavior ropmiate metnedoiegies and ethical standards, ssionat practice, tudies and Applied Anal ler 1, satecioe journal atti um, GrOUp ex Morte 2: Capstone Project and Final As Readings. Chapter 2, journal al sat Assessment curral articles -aper nai articles 23, THUR ex sion paner"
    },
    {
        "image": "collegesyllabi1_synth_7_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Phiippines VALERIE VILLE INSTITUTE Cotes ot Burned: Mommavaten tesbordel {hee 300 1809 A. COURSE DESCRIPTION: This course provides 9 compranensive study of crganatona! behavior, covenni dheoretica! loundatorss 27d practical appscutons esserba’ Rx Drofessiondl proctea anki advanced uty 5. COURSE OBJECTIVES: Upon completion, stucents wit be able kn: analyze hey concepts; apply inuccetica! knowledge to real world ‘eanarios; demonstra proficiency in velovant suits and mehodaloges, and communicate ndings oecvely D. COURSE MODULE Moduie 1: Case Stites and Appitud Anatyats Reauings. Chapier 1 seiectad joumat artcies Antvities. Otecussion forum, group axerones, efetton p2per Module 2: Capstone Project ane Fina! Assessment Readings: Chapter 2, seiecied journat anions Activides: Discussion forum, group exercises, coee analysis ‘Module 3: Capsione Project ang Fingi Assesement Rewsings: Crsptwr 3, selectea journal anicies Activites: Discussion forum, group exercises, quiz Module 4: Research ifetnods and Ethical Consioerations ~Roasings: Chapter 4, smocied journal aiices Actiites: Discussion forum, group exeicises, roliecton paper Module &: Case Studias and Anpied Anatysis ~Feanings Chaptot 5, emected joural arictos Activites: Discussion forum, group exercises, case analysis: Monuia 6. Researct: hiainods and Ethical Consideratons Readings: Chapie 6, selected journal arvcies ‘Actrdtns: Discussion forum, group exercises, caso analysts Modute 7: Yechnotagy inwegrabon and Innovation: Reagings: Chapter 7. saiected journa: arictes Adtivites: Dlecussion forum group wewcises, ceRecton paper Mocuie 8 Case Studios and Applied Ansiysts"
    },
    {
        "image": "collegesyllabi1_synth_7_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "Rennie of the Philippines VALERIE VILLE INSTITUTE Schege ct fuss aamncinton SYLLABUS COURSE NURBER 2 Busasy COURSE DESCRIPTION : Oxperieninnee COUHSE PAOFESEOR Hee Sry Gens 3, COURSE CRED reds TIME OURa fio PME 160 18 00 &. COURSE DESCRIPTION: This cose pepvides y comprenansive study of aryantzatona! behest, covering egrelical imundabone 4d practior apptications essential to: protussinnal practice and advanced study 8. COURSE OBJECTIVES: non eamploton, studaots eh Seeranes, deme! efactvet, be aide mena te Zeolovency IM relewsn spiply thearetoal xnewtedize to reat work His and metnorologtas, ged communicate fdings nastory of core principias 2nd hundaticnat ty sin organizational be Conducl independent researc using aprraprate metagcioging and athicn siancarde Puinkieis and snatyticat ski s to solve oninwies arobiseras Coitanersie efwcuvely is haa cased piojece and peer maming sotvibes integrate technology and digi! footy te anhance ieaming and profession! practice 3, COURSE MODULE Module 1: Gaze Studien ang Spolied Anatyais Readings: Chapter 7, estectad journal erties Activites: Discussion foruin, grnup oxercises, refleeion paper nstone Project ang Ping Asucosnsent Seierted Journal articias tee Discussion tour, group exercises, case ans Module 3. Gapatune Projaci and Sinai Assesoment adings: Chapter 3, selected joumnal ariices Activities: iiscuasion foram. group axescizes, 5 oduis 4 Research Methods ang Einleai Considerations Readings, Chapter 4, selected iowa? avtcles Antivitias: Discussion forum, group exanzses, retectian paper Mogile 8 Case Studies and Appiiod Anatysie Readings: Chapier £, selected journal attvies forum, group exercises, cay analysis Module Researot Methods and Ethicai Connderahons Readings: Chanter €, setacied jownal articles Antivibas’ Discussion forum, qsoup everoises, cass anaiirsis Moduie 7) Techingtogy inegrston and imavaton Rinadings: Cigzter 7. selected joumral artickes Acdwides, Biscrasion trum, group exercise Modula Case Stisies and Applied Analysis acon eaper"
    },
    {
        "image": "collegesyllabi1_synth_8_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines DYLAN VILLE UNIVERSITY College of Nursing a SYLLABUS COURSE NUMBER NURE30 COURSE DESCRIPTION : Fundamentals of Nursing COURSE PROFESSOR: M s. Kristopher Perez, E80 COURSE CREDIT nits TIME DURATION MNF 13 00 16 00 A. COURSE DESCRIPTION: ‘This course provides a comprehensive study of ‘and practical applications essential for profession: fundamentals of nursing, covering theoretical foundations al practice and advanced study. B. COURSE OBJECTIVES: ‘Upon completion, students will be able to: ani scenarios; demonstrate proficiency in relevant skills and methodolos effectively. LEARNING COMPETENCIES: “Reflect on personal growth and professional development throughout he course “Demonstrate mastery ofcore principles and foundational theories in fundamentals of nursing falyze key concepts; apply theoretical Knowledge to real world .gies; and communicate findings Apply critical thinking and analytical skills o solve complex problems. D. COURSE MODULE ‘Module 1: Introduction and Historical Context Readings: Chapter 1, selected journal articles 7 activites: Discussion forum, group exercises, QU ‘Module 2: Capstone Project and Final Assessment Readings: Chapter 2, selected journal articles 1 petites: Discussion forum, group exercises, reflection paper Module 3: Research Methods and Ethical Considerations “Readings: Chapter 3, selected ournal articles petviies: Discussion forum, group exercises, reflection paper ‘Module 4: Research Methods and Ethical Considerations Readings: Chapter 4, selected journal articles 7 Activites: Discussion forum, group exercises, reflection paper Module 5: Contemporary Issues and Global Perspectives Readings: Chapter 5, selected journal articles Activities: Discussion forum, group exercises, case analysis Module 6: Contemporary Issues and Global Perspectives. Readings: Chapter 6, selected journal articles Activites: Discussion forum, group exercises, case analysis ‘Module 7: Contemporary Issues and Global Perspectives “Readings: Chapter 7, selected journal articles 7 pctiviies: Discussion forum, group exercises, reflection paper Module @: Introduction and Historical Context MReadngs: Chapter 8, selected journal articles \"Activities: Discussion forum, group exercises, quiz ‘Module 8: Professional Standards and Best Practices Readings: Chapter 9, selected journal articles activites: Discussion forum, group exercises, case analysis ‘Module 10: Technology Integration and Innovation Readings: Chapter 10, selected journal articles 7 Activites: Discussion forum, group exercises, reflection paper"
    },
    {
        "image": "collegesyllabi1_synth_8_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "SYLLABUS COURSE NuRBEE 2 HuRexe EGURSE DESCHIOTION ; Funtaneniae of rainy HOURSE PROFESSOR Urs. Keintaphes Parez, B80, SCOURGE CRED es TIME DURE TaDN Ma 90 1800 4. COURSE DESCRIPTION: ThiP courte proeigas a comsxonensive chudy of tundameei Gadd precstcat apasications essential for protoesional pra &. COURSE OBJECTIVES, Si compieiton, students wit be able to: anaivzo vay concoots: a Scenanosi, Semonslete proficiency in relevant salle and met etinctivesy. foundations oly theoretical knowledss ts vase) detOgieS, avd comenunicate Seainge CG. (EARRING COMPETENCIES; “Refect on personal growth and nroteesio 0! developmen throughout tee course 7 Bemonskals mailer of cre pricipisa ana kamndationat heaves in ndarene is of brojacts and pie: teaming scuvitee thinking and anatytical skis solve complex probieine ning. B. COURSE MODULE iagute 1 inirociacinn are Henorie Caszeat Readhge: Caaaler |, seietet Pant arias Aetivisen: Discueston Sorat, gimp enarcines, Qe Machin 2: Capstone Project and ui Ausesamere Riaadioge: Chapter 2, calecenet anon article, Acitetios: (sscwasion torn. group exercans, sdtentin ages Mose 3: Rennsees kevtnscis ane Ethie’ Consiterstions Rrosings: Chagiee 4, selected jrurna: artoine fitiies: Dacian teu, yop aerewey, retestaan peter a <: Resenrch hiethasy ard Ebice: Comstieratons Pisadinge: Chaple: 4 eile ceri ariesee 7 Holi: Giscumsion frum, Sram esercines, raliction waspee oie S Comtoniparary inssies and Sion Feraractins Readings: Chepter 8, salzcter iaunal arcing Actives: Discussion tum, group everaives, £368 anulyaiy Modele 6 Guntemsceary sesuen ans Ginhal Peranectivos Rieusings: Chapter @, setectes ound arsine Actiitien: Ocuspien forum, grep sxerchas, save aoaysia Hock 7: Contamparary lessee Bn Binksl Parsiptcieon Reowings: Chapter 7, sclartes purr! aris Acting: Discusien tera, groug auercines, elleasnn paper Stoke A. etrotuctian and Histor Canes Steaaings: Chapter 8, nciecten gurns artes Aetivites: Diseuson fonian. group evascinee. qt Maatie 5: Krefuslbne tenkecs ard beet Preckcen Readings: Cheptar 9, selected pairnal arscien Actiniicn: Dsecsasn fora, group ames, nee 23h Ni Nasuie 1S, Technciogy inlaycation ars tnyaten Readings: Chanter 10, aetocted wre tees Acting: Giscusein forum, grav exurciees reliectom oases"
    },
    {
        "image": "collegesyllabi1_synth_8_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines DYLAN VILLE UNIVERSITY College of Nursing SYLLABUS COURSE NUMBER +: NURA30 COURSE DESCRIPTION: Fundamentals of Nursing COURSE PROFESSOR —_: Mis. Kristopher Perez, E4 D. COURSE CREDIT TIME DURATION i MF 13 00 16 00 A. COURSE DESCRIPTION: ‘This course provides a comprehensive study of fundamentals of nursing, covering theoretical foundations, ‘and practical applications essential for professional practice and advanced study. B. COURSE OBJECTIVES: Upon completion, students will be able to: analyze key concepts; apply theoretical knowledge to real world ‘scenarios; demonstrate proficiency in relevant skills and methodologies; and communicate findings effectively. C. LEARNING COMPETENCIES: Reflect on personal growth and professional development throughout the course. Demonstrate mastery of core principles and foundational theories in fundamentals of nursing, Collaborate effectively in team based projects and peer learning activities, Apply critical thinking and analytical skills to solve complex problems. D. COURSE MODULE Module 1: Introduction and Historical Context Readings: Chapter 1, selected journal articles Activites: Discussion forum, group exercises, quiz Module 2: Capstone Project and Final Assessment Readings: Chapter 2, selected journal articles Activites: Discussion forum, group exercises, reflection paper ‘Module 3: Research Methods and Ethical Considerations Readings: Chapter 3, selected journal articles Activities: Discussion forum, group exercises, reflection paper Module 4: Research Methods and Ethical Considerations Readings: Chapter 4, selected journal articles. Activites: Discussion forum, group exercises, reflection paper ‘Module 5: Contemporary Issues and Global Perspectives. Readings: Chapter 5, selected journal articles Activities: Discussion forum, group exercises, case analysis, Module 6: Contemporary Issues and Global Perspectives Readings: Chapter 6, selected journal articles Activites: Discussion forum, group exercises, case analysis, ‘Module 7: Contemporary Issues and Global Perspectives. Readings: Chapter 7, selected journal articles Activites: Discussion forum, group exercises, reflection paper, Module 8: Introduction and Historical Context Readings: Chapter 8, selected journal aries Actives: Discussion forum, group exercises, quiz Module 9: Professional Standards and Best Practices Readings: Chapter 9, selected journal articles Actes: Discussion forum, group exercises, case analysis, Module 10: Technology Integration and Innovation Readings: Chapter 10, selected journal articles Activites: Discussion forum, group exercises, reflection paper"
    },
    {
        "image": "collegesyllabi1_synth_8_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "Fepublc ot the Phiiguines DYLAN VILLE unin ERSITY College of urss COURSE NUMER SOURSE DESCRIENON Fuses of Hasieg COURSE PROFESSOR ats. kusupner ee COURSE CREDT 4 on THAE DURATION 2 AWE 73 00. 76 50. A, COURSE DESCRIFTION: This couse provides 2nd practic. nipiehonsive slay of fang. epblications essentia! tar profes ‘amentals of musi 9, cavering the: ai rae! 12 shuty ca! Reundtations 8. oounse OBJECTIVES: Upon compilation, shidarss will be abe Scenarlos; Gemsnsirals preclenicy in raters etectivaty i Knowledge te reatwoitg imatnlcaie fneings LEARNING COMPETENCIES: Reflect on perscnal growin and provsactonar evelopment throughout the sourve, «eat tate menstory oF onre sxinciles and foundations theoriss in fundamental Rutlstorate attctivety in team tiasod erejocts ane Pees leaming acbvines ApotY cntica inking and ansiyial axils to eave comeiex problems 9 oF nursing Course MOOULE Modis Inbodctoes and tatcrieg Comuert 7 Reasings; Chater i, weicted inna one Jaana Dlesunion foam, gasp exercinte, Mote Canstone Project sei Frat Maxeneroene Readnge: Chanter 2, esiectoct cenaierfites Magoo: Discusshn tone grain exorcnas cebscsen Paper Module 3: Reseacen tiaiinde said biticat Canstiecatine Nawtiere Cisaster 2, acected sented aries Potetiee: Diecuscim toe, group axercaes, refiscuan caer Moshi 4: Resmaech Netheds sn Finca! arsieatons Reaktoy Ch fet uma sites ‘on forum, gre i088, refit paper feennarary leaues ant Gibboi Pesepectives Winos: hates, eelectnd ean ttle sues: Sacusskn joven, meu marca, cave snatyaia ‘aun 6: Canterraoraey lemies and Global erence Reuseige Chapter 8, seincted pasa atten Acinrten: Dascussin forsm, group excronan case anasis Meikle 7. Cotterorany tnsuew and Gisbal Parspocin Readings: Chapter 7. selected vcr area pAititien Oiscunsion forum, grcup axerciee, re? osu 8 téveneno Baaduga: Crt ee Fe Hisloiezk Cantey sat artes 4, 2eiected jour sin fa Modkae 9: Protesniera Recsings: Charior a Active: Ciacy Moduis 10 Toemnetogy tnt ~Roaxinas: Chater 12, ees Series ans Innovation tected jours as fission Forum, cup eeercites, retketen aer"
    },
    {
        "image": "collegesyllabi1_synth_8_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines DYLAN VILLE UNIVERSITY College of Nursing oo SYLLABUS COURSE NUMBER NUREIO COURSE DESCRIPTION _ Funcamentats of Wursng COURSE PROFESSOR —: *® Krntooner Perez, £30 ‘COURSE CREDIT shunts SIME DURATION {MAW 1300 16 00 A. COURSE DESCRIPTION: “This course provides a comprehensive study ‘and practical applicatons essental for professional of fundamentals of nursing, covering theoretical foundatons practice and advanced study. Upon completion, students will be able to: ‘scenarios, demonstrate proficiency in relevant ‘efiectvely C. LEARNING COMPETENCIES: Reflect on personal growth and ‘development throughout the course “Demonstrate mastery of core principles and foundatonal tears in fundamentals of nursing D. COURSE MODULE Mode 1 Introduction and Historica ‘Readings Chapter 1, selected journal articles actviies: Decussion forum, group exercines, GAZ Module 2 Capstone Project and Final Assessment \"Readings Chapter 2, selected journal artcies ‘ebrtes. Discussion forum, group exercises, reflection pape Module 3 Research Methods and Ethical Considerations MReadngs Chapter 3, selected journal articles pctrtes. Dacussion forum, group exercises, reflection paper Module 4: Research Methods and Ethical Considerations “Readings Chapter 4, selected purnal articles pcbries. Discussion forum, group exercises, reflecton pape Module 5 Contemporary Issues and Global Perspectives, Readings: Chapter 5, selected journal articles Module 6 Contemporary Issues and Giobai Perspectves, “Readings Chapter 6, selected journal articles pctwiies: Discussion forum, group exercises, case anaiys Module 7 Contemporary Issues and Global Perspectives, Readings: Chapter 7, selected journal articles Actvites. Dacussion forum, group exercises, reflection paper ‘Module 8: Introduction and Historical Context MReadngs Chapter 8, selected purnal articles pctwiies: Dcussion forum, group exercises, QUE Moode 9 Professional Standards and Best Practices “Readngs Chapter 9, selected journal artcles pctvites: Dacussion forum, group exercises, case analyse Module 10: Technoiogy Integration and innovation “Readings: Chapter 10, selected journal articles pctrites. Decussion forum, group exercises, reflection paper —"
    },
    {
        "image": "collegesyllabi1_synth_9_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "of the Philippines DAWN VILLE COLLEGE Cotage of Buanens Admnseato” SYLLABUS COURSE NUMBER eer Busmess Anaiytes COURSE DESCRIPTION \"Excanem Ketey, MS COURSE PROFESSOR a, COURSE CREDIT {1TH 1000 1100 practcal B. COURSE concepts; apy theoretical RNOwINSGE eS ‘students wit be able to: analyze Mey ‘and communicate pon compledon. ney sails and methodologies,"
    },
    {
        "image": "collegesyllabi1_synth_9_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "COURSE HUMBER COUAGE CESCRIATION COURSE PROFEESCR COURSE CREDIT THE CURATION Ropub s of the Philippines DAWH VILLE WLEGE alege of Business hemnstaton SYLLABUS 5 BUSES Bucviens Seats COURSE DESCRIPTION: batons essential nn comepantion, sistent will scenaivig: demonstate penficiercy in relevant vfteckealy prehensive shity of businges an: fox professions! COURSE OBJECTIVES: be sbie ier ans tie Eizabew Holey, 3S 77H 108 11 00 coeuring theoretical foundations ang practice ang advanced study, peat knewingge to a3} seid Angings nae hay concepts, worl fis ant metiadotogies, ang commey ©, LEARNING COMPETENCIES: i inaisjrendant essay Soy entcat i professional cof ena principles and foundational mmones in business ary 1 using Soest OD. CGUREE MOGULE Hloguie 1! Case Shutios and Apped Analysis Raadings tae, Sone aun arele neti aghast the ont g methodologies and ethicsi standards ellaciuniy in taani basee projects an paar Weaning activites kang aed anaiylical skis te sive camgiex probiems, Aaivies: Caseustion foram group exercas, case anaivsis erste 2: Theoretical Frasna a ceamings: Chapa: 2, celac’ aNd sr a bats _ Actes, Discussion forum, ofoun axcecines, quiz long Proves Final Assorstoant ~Reanings: Chapter, setncied journal aricies Actisties: Discusion f groin exercises, retierton pape? edule 4: Contemporary Rauas ane Blobas Perspoctiees -Raasiogs Activities: Descasseiens one, Moctie 9; Protexiona’ Stan Achwitee: 3. Chaphes §, saincted jou group ewarehons ters and Gast Practices Readings: Chapie: 8, saiecing tna articies, scuRSiON TRUM, croup Ramiele, GE Nloduis 7: Techneisgy intagreticn and insovesen Ress neti. Be sénge: Chabler 7, patented inuma: a tiies OES TONE, ID culy 8: Continpoiars Iasuee and Ginoal Parpoctves: cine, qe Readings: Chaptir 8, selected journal gitictes ~Acheites: Wancunaion Maun, grows exercises, matection paper odite 9: Proleysional Siandarss ana Suet Practices"
    },
    {
        "image": "collegesyllabi1_synth_9_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "SAW! VILE Sotece ot Suen COURSE NUNBER COURSE DESCRIETION COURSE PROFESSOR Ae Exeter hades 5 SOURSE CREDIT THE DURATION TIN tue 1900 A COURSE DESCRIPTION: hes Course prowcies a commrenen: sive Shey of usu Drectcal anpheabons essutiia! Sr 8 COURSE OBJECTIVES: UPOR completion, students wil be abie te aatyze ke, sranatius, demonstrate profcsency in talwvant shale a sMecivney C. LEARNING COMPETENCIES: *Re Geh on personal grows and notassisn al deat Demonstrate master of rare arn Conduct ingepancent ase nc Covaborata ee sap 1983 ANG CouNGa very i leo based al thinking ar ara, Deal Sits ani co: D. COURSE MODULE Wodvtat Case Roayings Ch, ‘acted Achanes, Discussion true Mosuie 2 Nuereieat Fa Readings Charter Ourmal arscies Actinbes Discussion forum, S129 exerersns, quiz Mogul 3 Can siune Project ant Fina: Agvesement ott selacto 3 tees Srsuusson fon, Mosule 4 Contemp iat artes ‘OUD exercise coer 1 ues and Cabat Perspect Rewsingy Chapter 4, selector oulnal antcos Actaibas Discusuion tomute, gtoup exercises, Moauie S Capstone Pr Readings #09 Final Azeessment NADIE 9 selseted jours ies Diecussior tau group ax Noda Priassiona: Ste dais aid Reaargs nants Actrites Disrussion trum, group e gte Moone 7 Yecrimory itegratan and inny Paadings Chapter seers seiebes Ducuseon forum, grup exatones guile Mowe Cont Dotary 156 tora’ Perspectyes iactes inuina! artctes Co1d6 ond Best Practices Frotrewons ana toca! ao Histoncal Conte SF Frofexsional practioe and a6 Using appIOpH sty inetned a, ects and B90 Foarning active cunts of the Priippines COLLEGE Rarciatec PES BETTIE cover anion stuciy meorenca: founge 1 CINCEES af my Meccutes! enawege f rethodakogie3. and comnvuntcate gr oe ngs STAR MesughOU! he course IrecciMs in Des rese ana! Dies and op standarss wiley mowlens WOLD UKErCILDS Case araives 20 Dene: GILG OAMEEDAs, He chOR paper"
    },
    {
        "image": "collegesyllabi1_synth_9_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "Republic of the Philippines DAWN VILLE COLLEGE Colege of Business Administration SYLLABUS ‘COURSE NUMBER +: BUS498 COURSE DESCRIPTION : Business Analytics COURSE PROFESSOR —_:. Elzabetn Keley, MS. COURSE CREDIT nts TIME DURATION 2 TTH 10 00 11 00 A. COURSE DESCRIPTIO! ‘This course provides a comprehensive study of business analytics, covering theoretical foundations and practical applications essential for professional practice and advanced study. B. COURSE OBJECTIVES: Upon completion, students will be able to: analyze key concepts; apply theoretical knowledge to real world ‘scenarios; demonstrate proficiency in relevant skills and methodologies, and communicate findings effectively. C. LEARNING COMPETENCIE: Reflect on personal growth and professional development throughout the course, Demonstrate mastery of core principles and foundational theories in business analytics. Conduct independent research using appropriate methodologies and ethical standards. Collaborate effectively in team based projects and peer learning activities. Apply critical thinking and analytical skills to solve complex problems. D. COURSE MODULE Module 1: Case Studies and Applied Analysis Readings: Chapter 1, selected journal articles Activities: Discussion forum, group exercises, case analysis ‘Module 2: Theoretical Frameworks and Models Readings: Chapter 2, selected journal articles Activities: Discussion forum, group exercises, quiz. Module 3: Capstone Project and Final Assessment Readings: Chapter 3, selected journal articles Activities: Discussion forum, group exercises, reflection paper Module 4: Contemporary Issues and Global Perspectives Readings: Chapter 4, selected journal articles Activities: Discussion forum, group exercises, quiz. Module 5: Capstone Project and Final Assessment Readings: Chapter 5, selected journal articles Activities: Discussion forum, group exercises, case analysis Module 6: Professional Standards and Best Practices Readings: Chapter 6, selected journal articles Activities: Discussion forum, group exercises, quiz. ‘Module 7: Technology Integration and Innovation Readings: Chapter 7, selected journal articles Activities: Discussion forum, group exercises, quiz Module 8: Contemporary Issues and Global Perspectives Readings: Chapter 8, selected journal articles Activities: Discussion forum, group exercises, reflection paper Module 9: Professional Standards and Best Practices Module 10: Theoretical Frameworks and Models ‘Module 11: Introduction and Historical Context"
    },
    {
        "image": "collegesyllabi1_synth_9_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "SYLLABUS COURSE HUMBER 2 Buse COURSE GESDRIBTION Sucrose aneyios COURSE PROPESSOR 04. Exeanwn Ante COURSE CREDT fants THiSE DUA TION TH tae. 08 COURSE DESCRIPTION: This course provider a comprshensive study of business snaiytics, coverng thearstcal Soundations and a1 anpicatons essential ior professions! practice and avanced COURSE OBJECTIVES: Upon compieton, shidents 9% be able ie analsre hey concepts, af onairate prafcuency 2 relevant slits and metwacin is heoratical knowledge io real werk sand communicate drding Resact roughout tre couse, e sass anaiyiica ana independot rosea ng appropiate metiodcloginy anc sihicat stands, Colatorala efectisiy in eae based projects an peer eeming ackvites ialyScat okibs i soive complex manten D. CGURGE MODULE fodule 1” Case Seusies ctod sural artcies vussion torn, (aun exeraioes, Quiz odie Capsions Pmyect and Final Asamssrmant arings: Chaplet 3, salectes joume! atcias Actuitles: Discussion foram, group exetciees, refisction raper Module 6. Contemporary issues and Global Perspectives Rentdiogs: Chapter 4, selected tsumal article Actitiow Discusion true, 9 cise, quit Module Cagstane Peject afd final Assaesmen Resitings: Chaptes 5, selected journal artic -Activiter Bisewssian forum, giotp exe Hodis B: Professions! Sia rach hapior G, solciad journal arti inties: Discuszion forum, group exarcives. gaz Rule 7 Tecrewingy integration and inawvatios papier 7, selected joumat aiticies Activities: Discussion foam, group exercises. Hooule 8 Contemporary issues and Caobal Perspectwes Reashous: Chater 8, seionied joa atta forum, grolin exercises, ratlaction paper Nectint mes nat Stansiarcs and Best Pracheas Module 10: Thecetcat Framunoks ene Models Module 14 tottoascbon and Hisronea! Content 8, coe anysin"
    },
    {
        "image": "collegesyllabi2_synth_11_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "Morey VILLE COLLEGE Boparent of ffiration Ferhnolory fangse Syllabus Seusrsn ities Cloud COMPILE essentials Canarsie Caries 83 phansver of Gredite: 380 ernsbecs 8 Sem AY 2D jrotructer sB dis James Ayal, PR Bb Phone: got 258- 1675 Nr al course Doacripiton “Fae ena ovina redo excuse loud computing envertisi, integrating Ch vein praties aprcations, Stunts wi SAS fey cares, matoeicigies, 9! LOPE iesaes vera a the Hid. Erman #6 Paes a6 SHES ng, ansiytica! sala, and collaborative pander solving. Jona, ease studies, erxi nanda oF: Got ‘tas, learners wit! dawelop apatenc Prerecniisite tnowedge foundations! courses 1 Through tectures, discuss! eszentiat for academic 6x04 recommnsrsies. nee and profonstorel prwcice. Expected Learning Gviceines is cxnrote, aDaRieNS APE aexpanted 1: stsannanice wearing 2nd of gor: suena coreg eninge ergy ane srotal He a pergonsh and pectessuonal Sevelanient identifying aaas rr reatg an analy ss wo east COMES probleme ang propass 8 reat, sano wabon, and acapintiny 9 essaNSN0 eeranaing 2ands 2nd HUY soe onersianding of erisaracnval cencinien abe hoodies in cloud cnoib ier eopents, ofa presentations, aF16 7 saranda Torta vivey in team enue prajects, comonsesang readership ant pines wo sarees inoruscininay Satan s SS appsrenties ropnigia meetnostoioges, Wola, ANG RINICS! staneiands ofegaional raducth S fos continu imps ete! at shaved ssivtions sencanes jing essentans 3 Sythasia Fuge 105"
    },
    {
        "image": "collegesyllabi2_synth_11_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "TIMOTHY VILLE COLLEGE Department of Information Technology Course Syllabus Course Title: Cloud Computing Essentials Course Code: inr36+ Numb er of Credits: 3 unts Semester: '# Sen AY 20262025 Instructor s} Mrs. James Ayala, Ph D. Phone: 904 966 1674 Email: ebecce kennedy @tmety edu pm Course Description This course provides an in depth examination of cloud computing essentials, integrating theoretical frameworks with practical applications. Students will explore key concepts, methodologies, and contemporary issues relevant to the field. Emphasis is placed on critical thinking, analyti -al skills, and collaborative problem solving. Through lectures, discussions, case studies, and hands on activities, leamers will develop competencies essential for academic excellence and professional practice. Prerequisite knowledge in foundational courses is recommended, Expected Learning Outcomes Upon successful completion of this course, students are expected to 6. Integrate technology and digital literacy to enhance learning and professional productivity. 7. Reflect on personal and professional development, identifying areas for continuous improvement, 2 Apply cnical thinking and analytical skills to evaluate complex problems and propose evidence based solutions 10. Exhibit creativity, Innovation, and adaptability in responding to emerging trends and industry demands, +. Demonstrate comprehensive understanding of fundamental principles and theories in cloud computing essentals. 4. Communicate ideas effectively through written reports, oral presentations, and multimedia formats. 5. Collaborate productively in team based projects, demonstrating leadership and interpersonal skills, 9. Synthesize knowledge across disciplines to address interdisciplinary challenges and opportunities 3. Conduct independent research using appropriate methodologies, tools, and ethical standards Page 1 of 5"
    },
    {
        "image": "collegesyllabi2_synth_11_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "TIMOTHY VILLE COLLEGE Department of Information T Course Syllabus Course Title: Cloud Course Code: Number of Credits: 94% Semester: 1 Sem AY 2262005 instructor s} Mrs. James Ayala, Ph D. Phone: 904 966 1674 Email: ebecce kennedy iimaty 2cu 9n Course Description in depth examination of cloud computing essentials, integrating theoretical frameworks and contemporary issues This course provides anit ‘Students will explore key concepts. methodologies. analytical skills, and collaborative problem solving with practical applications. is .ed on critical thinking, professional practice. Prered Expected Learning Outcomes pon successtul completion ofthis COurs=, 6. integrate technology and diaital literacy to enhance les 7 Reflecton ‘and professional devel +2 Apply efitical thinking and innovation, and students are expected 10: 40. Exhibit creativity, “Gnderstanding of tundamental principles ‘writen reports, oral presentations. leadership inary challenges and of 4. Demonstrate Collaborate productively in team based projects, demonstrating ‘disciplines to address interdiscili propriate methodologies, Page 1 ot tools, and: jelop competencies dies, vind hands on activities, leamers wil dev te knowledge in foundational courses IS ‘ethical standards."
    },
    {
        "image": "collegesyllabi2_synth_11_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "TIMOTHY VILLE Co: anient of infomation Ty Course se Tithe: Clous Comp Course Cod Namb er Semester instructors): pies Ph fines Ayala, Pip, 8860. 985- 4073 mails meveces x Course Beseription entals, inteaeating ta doloyies, and cones king, anaivtical shiis end hanes. afessions essential for academi commended fspected Learning ute omes 8 Imegiota y solutions ang edaptat Wa industry damanas. seins of funda nivale ideas ete S80, ors! pe Alahons, ana muRimedia formats Collebosate productively onstraiing loa vel sks vnlhesice knowin a8 ares3 mieroisey aly Chastenges ane opoottiniies S100i8, and ethical standards opiate neti"
    },
    {
        "image": "collegesyllabi2_synth_11_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "Semester pretrucior s} Mis, Jeroen AY Phone: coca. see 1674 Femi: venue vere 2, PAD. gpcomey coe Syoavee Conauct naanendent e20Ma SD eooognate* Page tots"
    },
    {
        "image": "collegesyllabi2_synth_12_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "JENNA VILLE STATE UNIVERSITY Department of Information Technology Course Syllabus Course Title: Mobile Application Development Course Code: n287 Number of Credits: 3 unts Semester: 't Sen Ay 2022 2028 Instructor s): Mx. Pamela Barton, Ed D. Phone: 0928 871 8290 Email: martha ward jenna edu ph Course Description This course provides an in depth examination of mobile application development, integrating theoretical frameworks with practical applications. Students will explore key concepts, methodologies, and contemporary issues relevant to the field. Emphasis is placed on critical thinking, analytical skills, and collaborative problem solving. Through lectures, discussions, case studies, and hands on activities, learners will develop competencies essential for academic excellence and professional practice. Prerequisite knowledge in foundational courses is recommended. Expected Learning Outcomes Upon successful completion of this course, students are expected to: 2. Apply critical thinking and analytical skills to evaluate complex problems and propose evidence based solutions, 5. Collaborate productively in team based projects, demonstrating leadership and interpersonal skills. 4. Communicate ideas effectively through written reports, oral presentations, and multimedia formats. 6. Integrate technology and digital literacy to enhance leaming and professional productivity. 3. Conduct independent research using appropriate methodologies, tools, and ethical standards. 410. Exhibit creativity, innovation, and adaptability in responding to emerging trends and industry demands. 9. Synthesize knowledge across disciplines to address interdisciplinary challenges and opportunities. 7 Reflect on personal and professional development, identifying areas for continuous improvement. 8, Demonstrate awareness of social responsibility, ethical considerations, and global perspectives in the discipline, Page 1 of 5"
    },
    {
        "image": "collegesyllabi2_synth_12_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "ENING VILLE STATE UNIVERS? of Infomation Techooy Course Slabs Course Tithe: Mobile Armication Bovalep Course Code: mezer ent of Credits: Sunts Semester; is San av 223 2020 instrsetor s). yy Phone: sg2a 071 32 Eniait: marta waias Pamela Barton, Edd, donna 2du pts Conese Description This HSE provides an in depth examin: (atiowatks sit peacticat applications. Statents oi Ee msthodoiogios. and center SSUGS olovant Lo the field. Erophas nalvtical skits a Problem solving, Thiough iectures, discussions, suse studies, ond hands on aetiviie. fumipelencios easentia fer acanteraic excellence and Professions foumiational cewses is recommended Hon of rnablie application daveinoment. integating theorasie 9 places on cuiticat thi pay d collaborative tearm Expected Learning Outcarses Upon su H completers 2, Anly crtival tvinking 3 8 Caitaborate prod Of is Course, shistents are expected to nd analyncal sk 2i¥ in teampas 4 Communicate eas ai te cOmpEx labiems and wropase eviaens cecbased s ating leadership, and mteicersonal stilts Sh writes report, oral crasentatione, ate multeseda “omen 5 airing 2nd pivisssionat proauictyity Methodologies, tals, and ethical standart ets, deo stone, hog ane digit ite 2 Conduct muepencant research using 4 18. EXbiBH ersatiity, innovation, and adapiatty as certye 2c7085 diseiptin 7. Retlect on parsonst and pr 8. Demonsuate awareness of fering tends and incus vorheate know rallenges ‘eaitfynay Breas tor conn 600 ty Geman opportunities Wwous ‘mprovament St pers, Serial responsinitiy, ein derations, and gi caves in"
    },
    {
        "image": "collegesyllabi2_synth_12_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "STATE UNIVER JENNA VILLE Denarinent of inforrtation Ferheolegy Course SyHabas Course Title: Motile Apaieation Dev Course Corte: 20 Faunsb er of Credits: Semester fastrectort: Phone: 23 871 final: martha pax. Pamela Barton di ujermna ook. Bh ni, integeating theoretical Coarse Deserigtion vides an insiegih exo apgtication y concept. 1 co skills. 2 ination of motile Students wi explore‘ al thinking analy ands on act oplications. Emphasis 's pl sith practic sities, leans val selevant to ivough tectur watial for academe exc igsuies m ornpetencies uises is renpmimend melationst Expected Learning Outcomes aia expected 10 iconce based sanitions upon suocessful com ox promems anal propose rip ane intorparsonal SENS woimedia Formals thinking and anaiviee! teame ha! 2. Apply cal Conanoiate pros soguctity snnotagy and diate! pret us metroxtiogh anid aciaptabiy wh respcnding 12 MEAG fertge aCrOSe M85 to auarass inierdiocinsinary aller vat ano prowessronal ceveiopmnent Ge songibily, emical 8 tntegrate b trenos a1 2s and appottun: 5 Cansuet Indepennent city, innova 4 Syntnesize Wve 7 Ret 6 Demonstrate ear nage of social 1280 page 08S"
    },
    {
        "image": "collegesyllabi2_synth_12_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "SENNA VILLE STATE UNIVERSITY event of {informa Course Sylabes Mobile Application Development Coarse Titte: Course Code: sere Nusab ar of Credits: Sunes Semester: im Sen AY 22 instucer(: jax Pamela Barton, Ed O. artha ward ienna ede ph Course Description en in depth examinatiog oF mobile apie ident. will expione hey sete s fe placed on ont selons. cae sti problem: ise competence foundational cowses is cecommonded pected Learning Outcomes e based solutions. 388 y inYOUGH wellen cepoms_ sual presentat grate ‘echnoiogy and digital Meracy to enhance teaming end piotessional pmauntioty poriale methodologies tools, and ethiow! standards 3, Comfuct independent researc eiging Honds anc industy demands, itty in responding to 2 ‘tivity, innovation, ana edapta 28 keowiedlge 2 988 disciplines te address interuisciptinary challenges and epportinites potsenal and professional ge ni, klentifying aleas ter cunireaus immoveren onstrate awareness of soo! espon etnical consideratons. and global eerspectves in Me discipline,"
    },
    {
        "image": "collegesyllabi2_synth_12_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "JENNA VILLE STATE UNIVERSITY Department of Information Technology Number of Credits: 3 uts Semester: ts Sen Ay 20232028 Instructor s} Mx. Pamela Barton, Ed D. Phone: o928 871 8290 Email: martha werd jenna edu ph Course Description This course provides an in depth examination of mobile application development, integrating theoretical frameworks with practical applications. Students will explore key concepts, methodologies, and contemporary issues relevant to the field. Emphasis is placed on critical thinking, analytical skills, and collaborative competencies essential for academic excellence and professional practice. Prerequisite knowledge in foundational courses is recommended. Expected Learning Outcomes Upon successful completion of this course, students are expected to: 2. Apply critical thinking and analyScal skills to evaluate complex problems and propose evidence based solutons. 5. Collaborate productively in team based projects, demonstrating leadership and interpersonal skills. 4. Communicate ideas effectvely through writen reports, oral presentatons, and muitmedia formats. improvement. 8 Demonstrate awareness of social responsibility, ethical consideratons, and global perspectives in the discipline Page 1 of"
    },
    {
        "image": "collegesyllabi2_synth_13_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "PMGTRY VILE Conte Mund ep Se of Cred MELTED Ie Se sen eiption Ourse provi Ks with practical appvican integrating thecrat fista Ems and contemper: Expected Lear: ing Outcomes cesstu omnia tadeniying lex on He nicihonalapies hieiaey te ona y Brougn Ws reerisive 98a effoctve cerstanging oF wiedge actoss plines to ack Page vers"
    },
    {
        "image": "collegesyllabi2_synth_13_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "TIMOTHY VILE con EGE Dopartonent of Information 7. iriekegy Coarse Svitahay Course Titie: Ota Anaivtice and Vis selizstion Course Cader ines: Memb of Coedtin: 4 umes Semester: 200 en ay scene Instrectartsh pe pgoy Phan feat Hendin, Ee. p, ti ay Souree Description This course provides an indent erscarks with practical Sues telavant to the field Emphaste i Droblemsclving Trou Petencies eset Sourctations’ analy 29 and viewatt at ‘dents will explore ey con applications, s 108, intersting hooves thocciogles, and nic exealionces anc Teco mended, Brcfessions! pra in Expected Learning tmteames SES ful Complation ost this couess, sivdents ahitet raat are expected i: W aaptabity in reporting ta emecging te fessional dexetopenens isentibing a GOuS improve: A skis fo oveiuate comrgien protienss ane iMODCSE evisenee nasee g Ske ing agciteiate methoucloglas, lon Mt Sthical standards and Cigtta itersey i eeharce ising fevsionai product iis eas offctvely trough water repens Oral Beesentation Demaristrate seine Buna ty, Sonovation 9% persona Bee BF AIS Coal tink 138 She ndusty somanes, for sity AS IP formats ‘nt princioles sng ineories in Understanding of ‘ats anaiytios snd S19 astass interaisciptineny chatienges 2nd conn rtantt 96 1 O55"
    },
    {
        "image": "collegesyllabi2_synth_13_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "COLLEGE ioe FIMOTHY VILLE Bepartinent of information Techno Course Sy tte: Dota Analy’ cawrse Gade: F492 viiabass ies and Visualization Course 1 Mandier of Credits: duets Semester: Instrwctor s} Br. Monica Hendiz, E60 Paone: oss2 setamy Banail: ann hogtimotty. edu. ph Course Description sideplh enaminetion of data anaiytics end visualization, integrating theoreti This course provides an frameworks ath practical ax ues relevant io the field, Emphasis '5 par resolving. Through lectures, discussio iis) Fos academic excellence ard prok ots, mathedslogies, and contemporary i vallabpiative ors will dovelop fications, Students will explow: ey 2 cod on creat Bi case studios prot compatencies esse foundational cou Expected Learning Outcomes nace, stuaent pen successtd completion af this gto ersenging tendls and industry demands, adaptabitty in resnor Sdeatifying e098 for contAUeLS ImBFaVEMeRE ny inngvation, a exhibit czgnal and proiassional deveropmer 7. Rafiectan 2 Apply cnuical tanking and anabye 4. Conduct indenendet i2seare technology and cigitat te ased so resatogies, to ce warning apd lations, and uttmsia formats ata analy sing jugh writien repos, nial Hrese: poagmmantat pet ios ard theo se intoraisciil ary chatenges and"
    },
    {
        "image": "collegesyllabi2_synth_13_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "TROTHY VILLE COLLEGE 9 Tectnoloay apartment ot 4 Cenrse Seiabut Cauese Tinie: Dato Ane Course Code: 849% lization Number of Oredite #98 228 8 Hendiix, £48. Semester?” graracter S Oy Monice Firons: 0352 98 1225 Emalk: ann. poGtimetl iy chp egeating thee guurse Beseriztlo® ‘his couroe provides an invonsh exornination of data analytes anid ‘Students wil exptone key conse ad coMterienaey _ ang eattaooralive decal applications fromeanarks with PES is placed on ortical thinkin, aoaly 3, learnore wil develop qgaues miovart to the field. Ernphias penbinrn solving raze, eiacussicns, 2250 Studies, and vcasjence aext profesevanal prace. FTE fee knontedlge nies g courses 1s rorcmmended arning Hutcomtes Bupected che te cignis ae OD Lipon success consziaten ofS cones 3 vo Exaubit creaiy, nsevaion, ane adaptabity in cesponding reveiegenent, s2cctving areas se problems a0 ‘wards and indussy inning aiNprevesne -ajase eviiens Refect an personal and oom °2 apply este thinking anc a eis to evatuaia complex 2 04 5. Corset indopendant reveare erate methodatogios, 1 signet Wareoy jearning and orotessic! vegans, ng rutenedka formas ia date anaiyiion 29 analogy a fe ideas attoc ‘comprenenisive wncestls of fancamnertat cgcose sniersiesionary challenges anf oppann sts, of@ principles and thead 8 paearate to 4, Commi jany euoUgN We 4 Demonsirat ysailzeton paige aornss siscinnries 9S 5, Sunbiesize wnat page tot"
    },
    {
        "image": "collegesyllabi2_synth_13_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "PMO THY VILLE COLLEGE. “f information Technology Deporte Conese Syabus aiyties and Wisuaiizator we Piste: Dale A course Cod eae paumab er of Grea Semesters? peatructor S Dr Mi Prone: 19325801322 “getouaization, integrating there? ecepts, enetrosstagies, and oon nd neltaboratee of data analytics vit explore Key Course Deseripsioss 2 examination sions, Student an indent! analytical sitils searmanworks, with practical apps see rokawant tu the field. Eaphasis 1 PSE ij oy critica thin ch tectires, Gipcusstons, CBSE pudios, and ands 20 acta, ATA ii dewsion ot presaionad practice. Pree outage in ing Guteanes Eypected Learn co eunect2t te. gg and dustry demores is wproversent iene non oF NS una acapial esional dé sonatins 10 emHETTENS Joping 24a Hor CONTRO piems and pronase ane oneal StancaTes: sina} produ sty in ves sak ares prote 7 Ratiecton oe al nnn is to evaluate 295 sqediaiogies. aid ate sigtions, ere lag and heaves ang analytes yapenite! na aparepnate sermotgny art cig wiry Ws eA iearning communicate idaas atectvely SUD fitter 29H suonstrate comprel ranaing of amuamenta BA research usi simmacia torwats and ensive unatatst"
    },
    {
        "image": "collegesyllabi2_synth_14_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "KIMBERLY VILLE COLLEGE of Social Sciences Course Syllabus Course Title: Political Science and Govemance Course Code: socs7s Numb er of Credits; 2 unts ‘Semester: 2~ Sem av 2023 2005 Instructor s}: js, lots"
    },
    {
        "image": "collegesyllabi2_synth_14_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "KIMBERLY VILLE COLLEGE Department of Social Sciences Course Syllabus Course Title: Political Science and Govemance Course Code: s0c475 Number of Credits: Semester: 2 Se\" *Y 2023 2025 Instructor s Ms, Mary Washingt Phone: 0958 953 3384 n, PhD. ‘Email: wiiam alen kimbertydu 9h Course Description “This course provides an in depth examination of political science and governance, integrating theoretical Tone, Students wil explore Key concepts, methodologies, and contemporary ills, and collaborative frameworks with practical applicat insuse relevant tothe field. Emphasis is placed on er problem solving. Through lectures, discussions, CaS studies, and hands on activit Prmpetencies essential for academic excellence and professional practice. Prerequ foundational courses is recommended. tical thinking, analytical s ies, leamers will develop site knowledge in Expected Learning Outcomes this course, students are expected to: adaptability in responding to emerging trends and industry demands. to address interdisciptinary challenges and opportunities tal principles and theories in political scien Upon successful completion of 40. Exhibit creativity, innovation, and 9. Synthesize knowledge across discipline ‘comprehensive understanding of fundamen! yee and, 4. Demonstrate governance 2 Collaborate productively in team based projects, demonstrating leadership and interpersonal skis. ‘nce learning and professional productivity. 6. Integrate technology and digital iteracy to enhar analytical skills to eval 2. Apply cfitical thinking and Demonstrate awareness of social responsibility, 3. Conductindependent research using appropriate methodologies, to Communicate ideas effectively through writen reports, oral presentations, and multim Toate complex problems and propose evidence based soluion® tical considerations, and global perspectives in he discipline. ols, and ethical standards. yedia formats. Page 1 of §"
    },
    {
        "image": "collegesyllabi2_synth_14_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "KIMBERLY WitLE COLLEGE Bepartrsnt of Social Sciences Course SyHiahas Course TiBe: Potitical Science Bourse Cade: soos Bovamance Number of Credits, 2 osu Semester: ds Sen Ay zac RSTO MORES b pss Macy Washingion, rho. Phones aosa g53 s906 Binal: wien tenance eta 90 Course Deseription This course proses ar in depth, examination of frormasaecks with practic ssus relevant to the Bald problem solving, Threwgh corepotencios on fousvbtiamat oxy neg thapratica’ methodsiogies, ard contemeesary ie, Learners wll develop Wlbite Kreatesige in pues Is phar oo lectins, discussires, casn studies, ae han Serta for acsciomis wrcetene and professions wraciice Prepay sIBeS fa vecommendsed Expected Learning Outcomes Spon suceossny: 9 OFS coures, student are euperied ty 10. Eahibt creativity intemtion, a1 2captatesly it tespondieg fe emargin 2 Serinesize knowiodys sommes sian Bie: 8 ates inteedsciphnary et 1. Dinronstrane comgsabeneive waderstaning ot una comntat ne Petits and insusey semmanag Henge and epparienitiog '6 thaeties mn povical science ang hati koaeresed products, demnnst 8. msograte tacky OOTY HE ital tterscy ty enn ‘atING Headiorah 200 Interrerssnal skis {erieg 30a weotessienat araduetity 2 Aunty ontical thinking and anan eat eke SY eNakuate Comex grotianss and prapose enience based sohutions Bemonstaley axarcness ofgssiy, sib. acai consiserstons, ana gabe Berspactves in the discesttee vnas cath ing exproctias mathoanonies ‘OIs, an witical stancants ate hieas stacey thecwsh wm \"SPONS, Sai presentations, and multimacia foxmats Page tot"
    },
    {
        "image": "collegesyllabi2_synth_14_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "iM Rs BERLY VILLE COLLEGE ariment of Social Sclenne: Course Sviatas Cuurse Tie: Poltical Science ans Governance iaurse Code: 504 Band er of Credits: Seraesien: 2247 Av dnstrwcarta} ve. any on, PhD Biovail tan slrspeecty eo Sourse Deserigtion This coursa provides an in depth examination af political science ant gavemance, integrating theocetinal frameworks with practice! agplications. Studocts wil explore key concepts, m vant fo ths field. Emphasis is pieced on critical thinking, analytical ski s, and co civing, Through lectures, discusisiev competencies essential inv academi tional causes is recommended studies, anc hands ce: activities, isomers will davelon sxcellence and prfessional practice, Prorequisite hnowiedge ir Expected Learning Gutcomes pon succenstui commtstion is couse, students are exper iy tn resnonai atidiess intent Hanging of fronds and inclasiry demands 68 and apport es and tones in poles scienae and 1. Deinonatrate comprehensive unde: e einanee Goltaborate productively in feamebased pink iy, 6 evaluate complex srobiems end propose evidence 8, Demonstrate awareness of sociat respanaibiiy, eltinal considaraiions, and alobal parscect 3. Conduct indenengent research using anpropriate methooniogias, touts, atl 4 vely through wntten reposts, oval pres: 38d rotations, Si the ciscinting 4. Communicate ideas ete Page tals"
    },
    {
        "image": "collegesyllabi2_synth_14_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "KIMBERLY VILLE COLEGE Deparinect f Soci Se course Tithe: Nuuny er of Credits: 2% Semesters28 0 BOE Instrwctorts} Ms Mary Washington, 7D. Phone: 9958 55085 Esai ad Course Syabas Poikical Science ana Goverrsares Course Cade: Yoo! ompeemncien excential for ac acbanic ferdationas courses is ecomecndd Expected Learning Owcomes yom ences cont tes cri, ud a NEMA Sen rasp 0 woe Wend 26 ESN oN chabenges 2 Daemons governs? praiects, P jaaderanig and interpersanel SS. wa wom vase or ning ane prcanaskna! prouiey gone. Ce aren) an nS meget ne 2 ie pwnrenans 4a HONEY, ANS nt perupectves in the Cpe, no oois, and ethical sendares. eer esesteneniia epost, 0 reset INS, sen mstumecna formats Paget oS"
    },
    {
        "image": "collegesyllabi2_synth_15_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "DYLAN VILLE STATE UNIVERSITY Department of Accountancy Course Syllabus Course Title: Management Accounting ‘Course Code: Accts5 ‘Number of Credits: 4unt* Semester: 1s Sem AY 20252024 Instructor s}: Mx. Shawn Chapman, M. A Phone: 0927 619 2710 Email: matin femandez van eduon rating theoretical frameworks Course Description ‘This course provides an in depth ‘examination of management accounting, integr Students will explore key concepts, ‘yethodologies, and contemporary issues cal skils, and collaborative problem solving with practical applications valevant tothe field. Emphasis is placed on cetitical thinking, analyti Through lectures, discussions, case ‘studies, and hands on activities, ‘essential for academic excellence and professional practice. Prerequisite recommended. Jeamers will develop competencies ‘knowledge in foundational courses IS Expected Learning Outcomes Upon successful completion of this course, studer 2. apply eftical thinking and analytical skils to evaluat +10. Exhibit creativity, innovation, and asaptabilly in responding to emerging ends ‘and industry demands. a communicate ideas efectvely through write ‘epors, oral presentations, and multimedia formats. 3, Conductindependent research using ‘appropriate methodologies, tools, and ‘ethical standards. 6 integrate technology and dita iteracy 19 ‘enhance learning and professional productivity. 9. Synihesize knowledge across disciplines ‘o address interdisciptinary challenges and ‘opportunities. Collaborate productively n team based projects, demonstrating leadership and interpersonal skills. Demonstrate comprehensive understanding ‘of tundamental principles and theories ‘management accour 8, Demonstrate awareness of social esponsibility ethical considerations, and global perspectives in the discipline. nts are expected 10\" se complex problems and propose evidence based solutions. Page 1 01 5"
    },
    {
        "image": "collegesyllabi2_synth_15_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "DYLAN VILLE STATE UNIVERSITY Department of Accountancy Course Syllabus Course Title: Management Accounting Course Code: acctss Number of Credits: 4 units Semester: tst Sem AY 2022 2024 Instructor s): Mx. Shawn Chapman, M A. Phone: 0927 619 2710 Email: matthew femande2 dyian edu 9h Course Description This course provides an in depth examination of management accounting, integrating theoretical frameworks with practical applications. Students will explore key concepts, methodologies, and contemporary issues relevant to the field. Emphasis is placed on critical thinking, analytical skills, and collaborative problem solving Through lectures, discussions, case studies, and hands on activities, learners will develop competencies essential for academic excellence and professional practice. Prerequisite knowledge in foundational courses is recommended. Expected Learning Outcomes Upon successful completion of his course, students are expected to 2. Apply critical thinking and analytical skills to evaluate complex problems and propose evidence based solutions. 10. Exhibit creativity, innovation, and adaptability in responding to emerging trends and industry demands. 4, Communicate ideas effectively through written reports, oral presentations, and multimedia formats. 3. Conduct independent research using appropriate methodologies, tools, and ethical standards. 6 Integrate technology and digital literacy to enhance learning and professional productivity 9 Synthesize knowledge across disciplines to address interdisciplinary challenges and opportunities. 5. Collaborate productively in team based projects, demonstrating leadership and interpersonal skills. 1. Demonstrate comprehensive understanding of fundamental principles and theories in management accounting 8. Demonstrate awareness of social responsibility, ethical considerations, and global perspectives in the discipline Page 1 of 5"
    },
    {
        "image": "collegesyllabi2_synth_15_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "OYLAN VILLE STATE UNIVERSiTy 'ment of Accountancy Course Syllabus Course Title: Management Accot unting Course Code: ccias Number of Credits: 4 nts Semester; ts Sem ay 20232004 Instructor s): yyy Phone: Email Shawn Chapman, M A 0927 619 2710 mattew temande ayian edu pn and contemporary issues 123: analytical skill, and collaborative roblem solving Will develop competencies tice. Prerequisite knowledge in foundational courses is Page 1 of 5"
    },
    {
        "image": "collegesyllabi2_synth_15_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "DYLAN VILLE STATE UlVERS! Department of Acesurtancy Coitese Sytiabas Course Tite: Management Account Conirwe Caden sosses Renuber of Credits: Semester, ‘x See As 2a a8 fastractse s iy, Shawn Chapman, MA, Phone: cer eig 27i0 Binal: wanda Senrsndesthhen ate oh urse Description This cutee provides an indepth examination of mienagement accounting, integrating theoretical hameanshs oth pmectical anpileations, Statents sil exranrs hey concepts, methexktagies, and contemporary issues tha figid. Emyhazis is placed on critical inking, analytical skis, and collaborative problem solving, lectures, discussions, cate studies, ard hands on activities, iaamers will develop competencies sontis for ecademic sxeaiionce ang profrssiusa! practine, Preimadate knowledge in foundational courses is recoremended. Expected Learning Outcomes Uipen sucessful completion ot ts coutee, shadenis are expecind 1 Ante writes! hinieng and enalytiosi skits 19 evahiete complex nrcblams ane propose evidence based solutions, 15, Exhibit ceatinty cnnersion, and adaptatiity In responding te emsiging herds and intushy demands lammiaunicats hinas eftecively through writen reparte, oral presentations, and mules foernals onduct independent esearch using appropriate methodologies, lous, and elhieal standards. integrate technolngy and digital lneraey enhance learning erat professional producti Seninesine knowledge across disciplines to acces interdiscintinary Shasanges and apnonunitias, 5. Coltaboraie praduchvely in teag nazat presents, demanstaiing keadershin ang interparonal shi 4 Demonstrate comprohensive understanding of tundamental principtes anc theeries in managemen ascot! 8, Cemonstrats awareness of soniat rseponsibtty, ethical considerations, and glabs! perspertves in the ci Page tt"
    },
    {
        "image": "collegesyllabi2_synth_15_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "ovuate VitLe STATE UNIVERSITY Dernartrant of Recoumaney cowrse Course Title: Management ALCOUNTES Code: s00 8* Waunab ec of Creda. eal som 89 20ND Semester\" jostrncdor s} Mx, Shaan Chap Phame: og7 010 7710 an MR Email: ee panto Course Description Tris course provides an ION mcaninaicn of manerpnsaet BCID irtegyating tececiee HaeTeNNS tte Shatente wit explore way COnCEE. erences, BE CONEEMPOEAY (SSA ae ot to tne Fad Exmohania aco\" veal tring, analyica 6, cokuboratis probler sori Thenugh fectures, cscussians, CASE ese td anc on SNS ATTEN Gasrehap CORNET HN Srtowtik tor acaoric excelance at peokepaicnal prate mainte teenebecge 0 fouratinst courves reconenat Page tol"
    },
    {
        "image": "collegesyllabi2_synth_16_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "JOHN VILLE STATE UNIVERSITY apartment of Humanities Coarse Sy Babes Course Tite: Crealive Writing Workshop Coarse Code: wis 25 Number of Gredits: Semaster 2 Sen AY 210zce Insrsdtorsh ind Ce Phone: o977 1 a Email: cart shepraré john edu ph Course Bescription This course provides an indeath exam with practical appiications Students wilt mlavant to the fale Through lectures, ion of ciwative wilting wurkshop, integraling thecretical Xplor Key concepts, mat ‘phasis Is placed an critica thie and collaborative protlern solving fons, case studias, and hands on activities, leameis will develun compatenc esvertig for acasemic excellence and professional practice Prerequisite knawedge in foundational courses is recommended. cainennirh Expected Learning Outcomes von su complnton offs course, shionts are ex fed 4 Communicate eas erect through watten reports, oa! presentations, and multime Synthevize snowiedge aerass dive 2 Apety envca! thintang, Domains! formats portant, ose evidence based solutions, neipies and theories im cseatve wate workshop ‘ating Ieatership and ierpeesal siiis 9 areas tor continua dersvons. aca gh ios fo aadinss interaisciplinary chaltesxjas and op ‘Sn2hyic! shits to evaluate complex problems and gr nprehensive uncerstancing of tindamental 5 Solla orale productively in eamtases yajects. temon Reflect o0 personal and professional de velapunent, ident Domonevate awarenees of: nsibiity, eae n3 be diseistine Page tot §"
    },
    {
        "image": "collegesyllabi2_synth_16_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "& SYATE UNIVERSITY nent of Humanities LOHN WALL par Cause Syllabus Course Tide: Creative Waiting Course Coder Hxee Number of Credits: 9 Semester? Restrectoris nd Prone. gop? 108 imal: carl snepparé jahn ods ph ystal Collins, RL Course Deseription with practical applica relovast to the field. Trice essential for acs sulving cal thicking, ansltical skills, and collaborative proble end hands on oe Pronostic knowied rhasis is placed ners will dewslop competencies fractures, discussions, ca. csllence and profes recommenced Expected Learning Outcomes ts are expected psn suscesstal compievon of tis course, wath fo isciptinary challenges and opportunities propose based J Shenries in cxeotive writing workshop. 4 Communicate eas ns, anit ‘kis to eval iplex Brobiems: fundamental principe: 15, demonstrating leagersiyp and interpersona sills emt tihng areas for co ss impran g global perspectives in the disci. asi gratons, a"
    },
    {
        "image": "collegesyllabi2_synth_16_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "VLE STATE UiveRsiry iment of Fy ur nities Course Svitabes Crealive Writing Worsshop Cartes Code: sures Course Tite: Numb or of Credit: Semester: 22 sox ay fn structorts >, Phone: ogy. Email: oi, “OvCS® Description This course provies “th practical ansticatien ‘invent ty th ng weorkshoy *oting theomvica! kameworks 5, methedsiogies, ang NG, analytical skills, and 8 hands on sctivitieg, 4 nal practice, Pr comempore Aaborative anes wil l0p competencies Sqsisite knoatadge in toxmneational cours Probiern. are expected ta GP Miten repcts, oat pressntations. a terciscigi uals comptes problems a Jamental primer \"80 projects, demonstrating fenders ‘ertihying 8 adress j OASIS ueturstant productively in tesim ba 7. Refect on 2eissnal ana prot 4D Soria in creation yi DIP an Interpersonal seis 288 fOr continous improvement MSI carsiaorations, ant atc! passpeuh al development it ‘cia! responsibitity, Smionstate awareness of Page tors"
    },
    {
        "image": "collegesyllabi2_synth_16_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "JOHI VILLE STATE UNIVERSITY Deparment of Humanities Course Syfabus Course Title: Creative Writing Workshop Course Code: ouier Nunib er of Credits: 2m Semesters 2d bow av 2nates Instructor s} ind, Crystal Cotling, M A. Phone: guz7 700 8671 eval: cari sheppard @jote ed. ph Course Description This course oravides an iniepth examination of creative writing workshop, integrating thocretical frameworks, with practical applications. Studants will explore key concepts, mothodoiugias, ard contemporary issues ‘relevant to the field. Emphasis is piaced ox cntical thinking, analytical skits, and collabvative problem solving. Tivcagh lecturas, discussions, case studies, and hands on activites, lamers vst develap competuncies essantia for acadonic excelionce ard prcisesional practice. Prerequisite knewleuge in foundational courses is recommended Expected Learning Outcomes Upon succenstut completion of tus courre, stadents are expected to 4. Communicate ideas etectvaly mrcugh writen reports, oral praventapor s, and muttmedia fora. 9. Syntnesiza mowindge across ctscpiines tp address inuertisciplinary challenges end opportunites. 2. Appty eriticat thinking ated analytical ski s» evaluate complex problems and propose evidence based solitons. 4. Daconstrate compretensstve understanding of fundamental principles and theacies in creative wating workshop. 5. Ccilabormie cracuctively in teant based projects, demonstaing ieadersh p and tnterpervonal sis, 7. Raflect on personal anc professional davolopment identifying areas for contnuvus impioverent 8. Demonstrate awareness of sociss rosponsicily, extica! censideratens, and global perspectives in the crscipling. Page tots"
    },
    {
        "image": "collegesyllabi2_synth_16_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "JOHN VILLE STATE UNIVERSITY Department of Humanities Course Syllabus Course Title: Creative Writing Workshop Course Code: Hunio: Number of Credits: 3 unts Semester: 2>¢ Sem ay 2024 2005 Instructor s} ind. Crystal Collins, M A, Phone: 0927 700 8474 Email: cari sheppard john edu ph Page 1 of §"
    },
    {
        "image": "collegesyllabi2_synth_17_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "DAVID VILLE UNIVERSITY Departnent of Enginesiig Comer course Titie: Engnestt Canrse Come: 86575\" Humb er of credits: Semester: jnsteudor s} D, Karen Rasmussen Pome: 2285S Bmrail, connew potts davl MA. areew os integrating theoretic! temporsiy -a problem -sovin wpotencies 89se Caurse Descrtation This course provides: ar in tapth examina ve. Staxients will explore key £068! seed on ofiical think of angineating desig”. pts, cetio gud collaborativ nats ait develop vee, diususstons, nase steve, and Handsoe activities, lea academic excellence and profess re prorequiste krexsiodge if Forsdational COUSEE rocamnmers Expected Learning Outoomes on ofthis course, UGE pie anectvniy trough We wa understanging of under 7 exis i evaluate complan propiet conte metnadoiegins, 20! ce earning and professional p1ouue aitangas ane o qhanal perepactives im Be oH intergersonal sas ovement Ligon succes sate fepatts, renal princiolas and 3 ana pronase evider _ ang ethical stances, 4 Comesunvecate it ener poty cities 3 Conductins pandentresearsh pnoingy ard digit yarage across aisepiines ty ads ‘aus of socal responsieitty, corbased prossets, demon inet, idamiilying aba age interaineignrney wueat considerations. 8 pung ieadertin abd scptinwous mor intone Wie 8, Demaonstate m2 5, Qoliaboraie prosuctvely 7 Rehect on personal ane profess aeeione Page tot"
    },
    {
        "image": "collegesyllabi2_synth_17_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "Cousse SyBabus Titte: Engineering Dasign se Case: Cou NozO sets Fea on AY oa Rratractor s} pr k 2, MA david edu ph tion n in desth examination of engireering design, integrating theoretical fraineworks w! s. Studants will explore key concepts, methodoiogies, and contemporary issues retevant to placed on critical thinking, analytical skills, and collaborative oroblem solving and hands on activ sile knowledge ins studies tea ore ‘ill develop comp jonal pra n successful completion, of this course, sit 4 offaciively iro: 1 fompretensive understanding of furdamental prin 2 King ated analytical sis to evalu: 4 ni research using eppragdate methoduion a. ‘and dita iteracy i enbanes learning ari pr 9 2 knowledge a: slerdiscipt 8 to awareness of social iespaasib’ ana glo) ves in 5 5 te iy in team based prui adershio 7. Rettect on personal and professional éevelopn"
    },
    {
        "image": "collegesyllabi2_synth_17_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "DAVID VILLE UNIVERSITY of Engineering Course Syllabus Course Title: Engineering Design Course Code: exa200 Numb er of Credits: 2 unts ‘Semester: 2~ Sen ay 2023 2028 Instructor s} Dy Karen Rasmussen MA Phone: o9s2 esesi5 Email: connor pots @david edu ph will develop competencies essential for professional practice Prerequisite knowledge in foundational courses is recommended Expected Learning Outcomes \\UPon successtul completion offs course, students are expected io. Communicate ideas efectvely trough writen reports Fal bresentatons, and multimedia formats 1 Aaa crea nae ae nse ot tndanena pncer an hasten hooper esgn 2 Cenc nape a is eran cngie pions one opone Seecee a ang 3 Conduct independent: Page 1 of §"
    },
    {
        "image": "collegesyllabi2_synth_17_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "Namber of gemester: e788 MA egy ph es sth scription 1, tategenting elevant desig dourse De theoretic pe provides an in depth ea This co! practical apyiications. St nis will expiore Key wg Emphasis is placed on ical AKT ‘analyticat skills, and collabora petiviies, Keuners te tectures, discuss Prerequisite liance an} profession academic recommended ane sume ferret saineenny Se8! 4 Sommunicate wieas ene teH Demanstrate comere! Jt evatuate comple 38903 priate met pesearch vais oie\" oapenae! atsuy axinthe cial responsi se: ship aa seating 16a\" fo: eon"
    },
    {
        "image": "collegesyllabi2_synth_17_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "DAVID VILLE UNIVERSITY Daperrasnt of Engineasing Conese Sp Course Tuite: Engin Conese Cod Babes ore Number of Credite: 2nis lastrastor S} tr, Karen Rasmussen, MA Phone: oos2 esiasis Beall: connor ports @david od is ph Lnurse Description This course provides an in depth examination of engines ny design, integrating theoretical frameworks with Slusents wil explore key concepts, methadoigies, and contemporary issues relevant te placed on critical thinking, analytical skitls, and colisborative prehletn salving Through lectures, discussions, cave studies, and hands on activitios, Jeamers will develop compatencies eszantial fer academic excellence and prc practice. Proteguisite knowledge in foundatts recommenda nal courses fs Exyected Learning Suteomes Upon suecesstul coms un ofthis coume. students are expectad te 4. Coinmunicats ideas aftectively through writer (apo Betnonsirate comprehensive undersianding of kadar 2. Aopiy entical inking an 3. Gonductindapen oral presentations, and muttinedia formats sal principles and theonas in engineering design valuate compiex problema and provese eviience based solichons. ent research using appropriate methodologies, loots, ang ethics! standards 6. Integrate technology ang digital Heracy ty ennance fesming arid professional productive. Synihesize knowledge across diaciptines io augrasa wherdiscialinary enatienges and oppertanities, 8. Demonstrale awareness of socrai resnonsinitty, etnical consierations, and gickat verspariives in the diseipting 5 Collaborate oroduciveiy in team based protects, demonstrating leadership and infersersnnat shits, 7. Retisct on pai ssional development icentiving areas for continunus improvement,"
    },
    {
        "image": "collegesyllabi2_synth_18_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "JERRY VILLE C0) Department of Engine Course Syllabus Course ithe: Contial Systems Eng Course Cede: estes Mamb er of Gredits: 2 unis emmestinn ‘st Sem av zane 2008 insteuctors} ind. Tay Envait: keith perk Hobbe, Ph D. Course Deveription pravides an Indepth ion of contre systems enginessinn, integrating theoretical frameworks with proctica! applications. Students wt explore key concepts, mathosiniogies, an issues relevant to the floid. Emphauls i don critica! thinking, anwivsical skills, ans collsborattes problem saiving. Through lectures, discussions, case stuies, and leomers 1 competencies essential for academir: exesilance and protessisnal pra site Koowlsdas in founkiatiena! courses fs reccnirmancied This cow es. Preresut Expected Learning Gutcomes Upon suconssful completion of tls rourse, students sxonclad to efect an personal and protassional development, idendtying areas fr continuous i nductindepandent research using aporanciais methodslogies, tools, and ellen! slandaras, 8. Synitiesize knowiedge 2cmss discintines to aur pppartunities, cial responsi consiserations, and gions! perspectives in aly in iRore based pecjeets, demenstratiag in jemenstate compreansive unclerstan 6 integrate 4 Communicate ideas aft 2. Appiy orticat proven Sciptine iS. al presentations, and multimedta formats, compiex probioms and n opose evidence based solu! Page 1015"
    },
    {
        "image": "collegesyllabi2_synth_18_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "JERRY VILE COLLEGE Depaterent of Engine gonese Syitaao Canarse Titer (oH SYSIENE Engineering Cade: credits: 2\" tereaten: 99308 AY 2S jnsrectorts? ind, Taylor Holts. Pel. Payee: ys TOs Se Fant: wolth parkins ie Posaber of adapt Course Desorption “This courue provides. an in depth axerrination of contre systems engineering, ieograting thosvaticet eames wit prscticn’ appCANI ‘Shades wi elon Ray COTTE aihodciagies, and Cakemnearery qasues relevant to the Seid. Emphasis 1s Racal on otis skier, analytical Akl, ao potaboriive proeon coke, Treg ERE vdeciazions, case studies, ott panat on activins, fearers wl develog ae wosental for acadertic oxo? ‘gad professions! practice. Pracoslsite erxentectye compet foundational courses §S recomended, Kspecied Learnlog, Datcomes et nig 9106 cael ofthe couree, tds ces for CoHUMRes APOE spon succenstal compieson 7 Reecton personal 260 pyofeestonal doveluproant, arse SLeeganreh Using BOZO petradelagins, tis, und eB sina ve saneriscinany cnaenges AA pester. yeh inane ne robot perspectives in fie deor2ee pesos cupciobnes 1 adksre ‘g, Syninaeize ROMIEIO® cra of 3st cesyeatily, RCE! ‘eancesatons, es demonsiatng waders Ri enssrnerucnat wots ‘compel evataren anngneaahS g bamenseate awa 2 comatornte sroauctively Denanshate comereners A pmorate wecnnnkony aoe! eg! (RENEE enhance emmunieste wens efectvely BON nite copes, oF8t DM a pgp estat rervreg sid anata sien in eearuae compe proviemss 3 ana preortos IS ‘profesatonat progsceiy abn, ans rebenia oes snd propose swsaence Bast $1 pram tases m0 se onmrnncsdigy O sf pancraeneniat 6 ng HS jutions. page 18 8"
    },
    {
        "image": "collegesyllabi2_synth_18_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "JERRY VILLE COLLEGE Department of Engineering Course Syllabus Course Title: Control Systems Engineering Course Code: Enc ss Numb er of Credits: 2 unts Semester: 1s Sem AY 20242025 Instructor s): ind. Taylor Hobbs, Ph D. Phone: 0934 701 116 Email: keith perkins jery edu ph Course Description This course provides an in depth examination of control systems engineering, integrating theoretical frameworks with practical applications. Students will explore key concepts, methodologies, and contemporary issues relevant to the field. Emphasis is placed on critical thinking, analytical skills, and collaborative problem solving. Through lectures, discussions, case studies, and hands on activities, learners will develop competencies essential for academic excellence and professional practice. Prerequisite knowledge in foundational courses is recommended Expected Learning Outcomes Upon successful completion of this course, students are expected to: 7. Refiect on personal and professional development, identifying areas for continuous improvement. 3. Conduct independent research using appropriate methodologies, tools, and ethical standards. 9. Synthesize knowledge across disciplines to address interdisciplinary challenges and opportunities. 8. Demonstrate awareness of social responsibility, ethical considerations, and global perspectives in the discipline. 5. Collaborate productively in team based projects, demonstrating leadership and interpersonal skills. +. Demonstrate comprehensive understanding of fundamental principles and theories in control systems engineering, 6. Integrate technology and digital literacy to enhance learning and professional productivity. 4. Communicate ideas effectively through written reports, oral presentations, and multimedia formats, 2. Apply critical thinking and analytical skills to evaluate complex problems and propose evidence based solutions. Page 1 ofS"
    },
    {
        "image": "collegesyllabi2_synth_18_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "JERRY VILLE COLLEGE Partment of Engineering Course Syllabus Course Title: Contro) Systems En gineering Course Code: encass Number of Credits: 2 unts Semester: 's! Sem av 20262008 Instructor s}, |nd. Taylor Hobbs, PhD. Phone: o934 701 1 s69 Email: keith Perkins @jerry edu ph Page tots,"
    },
    {
        "image": "collegesyllabi2_synth_18_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "JERRY VILLE COLLEGE Department of Engineering Course Syllabus ‘Titie: Control Systems Engineering Course ‘Course Code: eNo 55 Number of Credits: 240% vemecter om AY SS jnstructor s} ind. Taylor Hobbs, Ph O. Phone: 934 701 1169 Email: keith perkins @jery edu. Ph Course Description integrating Cae ren on cath exarntn ot carl syste SO ‘contemporary frameworks with practical applications. ‘Suadents wil explore key concepts, methodclowes, tert tothe fl Emphasis is placed on cic ANS secunsions, case studies, and hands on actives, Prmpotencies essential for academic excelence and Pole foundational courses is Page 10S"
    },
    {
        "image": "collegesyllabi2_synth_19_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "CAROL VILLE COLLEGE Department of Humanities Course Syllabus Course Title: Philippine History and Culture Course Code: Humi28 Numb er of Credits: 4 unts Semester: ts! Sen aY 20252028 Instructor s}: py. Darrell Higgins, Ph D. Phone: o916 495 1302 Email: jennifer cruz carol edu ph Course Description This course provides an in depth examination of philippine history and culture, integrating theoretical frameworks with practical applications. Students will explore key concepts, methodologies, and contemporary issues relevant to the field. Emphasis is placed on critical thinking, analytical skills, and collaborative problem solving. Through lectures, discussions, case studies, and hands on activities, learners will develop competencies essential for academic excellence and professional practice. Prerequi foundational courses is recommended. Expected Learning Outcomes Upon successful completion of this course, students are expected to: 2. Apply critical thinking and analytical skills to evaluate complex problems and propose evidence based solutions, 3. Conduct independent research using appropriate methodologies, tools, and ethical standards 9. Synthesize knowledge across disciplines to address interdisciplinary challenges and opportunities, 8. Demonstrate awareness of social responsibility, ethical considerations, and global perspectives in the discipline. 10. Exhibit creativity, innovation, and adaptability in responding to emerging trends and industry demands. 4. Communicate ideas effectively through written reports, oral presentations, and multimedia formats. 1. Demonstrate comprehensive understanding of fundamental principles and theories in philippine history and culture 6. Integrate technology and digital literacy to enhance learning and professional productivity. 7. Reflect on personal and professional development, identifying areas for continuous improvement. Page 1 of 5"
    },
    {
        "image": "collegesyllabi2_synth_19_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "CAROL VILLE Departimens TOLLEGE Course Syitabus Course Title: Philippine History an 8 Cultures Course Code: ws29 Raimber of Credits; unt Semecier. ‘2 Sen 405 Inatructor s ry, Carel Hagin, Ph Phowe: og16 ags s262 Email eri fer cruz sare exiy gn Comrse fesevintion Ths course provides an indepth examination of phipgine histor ramnencrks wlth peach 5 Ad Cultura, tegrating theor nents, methodologies, and at issues eelevant to th prcblem sotving competencies essential fe foundational courses is rac onternporary skills, and collaborative Hands on activities, teamers will devatop Plenaquiite knowledge N OF RIS Course, Sludents are expected to ca 9 and analyticas siiiy 3. Conauet indesencient ia fe evaluate comptes grobiaens J 2omephate meinow: tedge actos discipines te aazies: 8d DOWOSE Mudence asad Nala, tons, a intersiscipteaty Syntnesize ar 8 Demonstra Standards 228 399 opportunities ical considerat nd global narspectives ig to eMEIgNg Hands a fy osgh weiten repors, ora present sbate comprehensive understanding of hy teohinoiogy ane digita! Htorany Dersanal and professional cevein 35 of sorts wgpensitinty 4 Communicate ioe: revallGn, Bnd asaptabsey is roe on 1 Daw ameniat principies 8 tate 7 Raters on learning and protessien oman ident nal productivity 628 for contruous Pago tot §"
    },
    {
        "image": "collegesyllabi2_synth_19_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "CAROL VILLE COLLEG: Deparimont of Humanities Course Syilabes Course Title: Phtippine History Course Costes suse ons re Mum er of Credits: 4 units iene, Ph 1302 Conrse Bese: This cou ption 6 aN itecopth examination of philippine fremenorks with practical applicst ‘seues relevant te the fied ius, and contemporary ts, and collaborative problem solving Then compotene: ures, ise essential tor scademic excct E is recomnmendied Expected Learning Gutcames Upon successtut completion of stuoents are expeck 2. Apply entice! thinking 3. Sonductindenens 9. Syrshesize ang analytical Nils te evatuate cornotex problems an Hesearch using eupropriata medadaicgies, ge ac siseiplinary challenges ane epgerten social responsibitity. eticay opal nerenact A, ant aosptantit dHtends ang intustry demas, 6, and msitimedia formats, \\damerial principtes and theories «n ptilinpinn hance tearing and protessior chopmest idennty nigats Wdaas eactiv 4. Demonstrate com integrate tecnotogy and aigiiat story and cusbue, iieeraey to ect on persenai ar ots tor ing 21806 for Nnuous improver Page i of"
    },
    {
        "image": "collegesyllabi2_synth_19_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "CAROL VILLE COLLEGE Department of Humanities Course Syllabus Course Title: Philippine History and Culture Course Code: Humi28 ‘Numb er of Credits: 4 unts Semester: st Sem Av 20252004 Instructor s} Dy. Darrell Higgins, PhD. Phone: 0916 495 1302 Email: jennifer. cruz carol edu ph Course Description This course provides an in depth examination of philippine history and culture, integrating theoretical frameworks with practical applications. Students will explore key concepts, methodologies, and contemporary issues relevant to the field. Emphasis is placed on critical thinking, analytical skills, and collaborative problem solving. Through lectures, discussions, case studies, and hands on activities, leamers will develop competencies essential for academic excellence and professional practice. Prerequisite knowledge in foundational courses is recommended. Expected Learning Outcomes Upon successful completion of this course, students are expected to: 2. Apply critical thinking and analytical skils to evaluate complex problems and propose evidence based solutions. 3. Conduct independent research using appropriate methodologies, tools, and ethical standards. 9. Synthesize knowledge across disciplines to address interdisciplinary challenges and opportunities, ‘8. Demonstrate awareness of social responsibility, ethical considerations, and global perspectives in the discipline. 10. Exhibit creativity, innovation, and adaptability in responding to emerging trends and industry demands. 4. Communicate ideas effectively through written reports, oral presentations, and multimedia formats, 1. Demonstrate comprehensive understanding of fundamental principles and theories in philippine history and culture. 6. Integrate technology and digital literacy to enhance leaming and professional productivity. 7. Reflect on personal and professional development, identifying areas for continuous improvement, Page 1 of 5"
    },
    {
        "image": "collegesyllabi2_synth_19_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "COLLE CAROL VILE eperiners Course Syllabus Course Title: Philippine History anc Culture Course Coder vance arab or af Credits: 4usts Phone: oots s2t 138 Eval: jennifor cour® Coarse Hescription This course provides ith practic ficid, Emph piohlein solving. Through i on ot philigpine history in clepth exs nd culture, integrating thecretical applications Students wit! exp placed on entical ciures, discussions, case sities, framewor key coneopts, methodologies, and emporary issues relevant to aborative inking, enelytical competencies essential for academic excellence and prvfeasio une tional cou 63 is recommende: cted Learning Outcomes fue Upon su mmpietion ofthis is are expected te: 2. Auply eiical thinkin complex pro mnethoaologies, fouls, ana etaical lines fe audiess inlerais plinary challenges and opbor sans Industry dey at in phtingine history and culture, of social responsibily inieal eonsigeraiions, and g repectives a6 adaptaniity in resanding to emerging iren: jogs Willer repurts, orsi presentator mettimesia for landing of uundamente! principies and thear nd iuseliying areas for continue n enhance learning fessional pracuctvily improve Paga 10! S"
    },
    {
        "image": "collegesyllabi2_synth_20_aug1.png",
        "label": "collegesyllabi",
        "ocr_text": "MORGAN VILLE UNIVERSITY it of Humanities Course Syllabus Course Title: Creative Writing Workshop Course Code: Huusrs Numb er of Credits; 2 unts Semester: 2 Sen AY 223 2024 Instructor s) Mise. Scott Lee, M A. Phone: 0912 851 7124 Email: steven chen morgan edu ph Page 1 of 5"
    },
    {
        "image": "collegesyllabi2_synth_20_aug2.png",
        "label": "collegesyllabi",
        "ocr_text": "MORGAN VILLE UNIVERSITY Department of Humanities Course Syllabus Creative Writing Workshop Course Code: #uMs75 Course Tith Number of Credits: 2 unts Semester: 294 Sen AY 20222024 Instructor s): Misc. Scott Lee, M A. Phone: 0912 851 7124 Email: steven chen morgan edu ph Course Description “This course provides an in depth examination of creative writing workshop, integrating theoretical frameworks with practical applications. Students wil explore key concepts, methodologies, ‘and contemporary issues vars to the field. Emphasis is placed on critical thinking, analytical skis, and colaboratv® problem solving. ‘Through lectures, discussions, case stugies, and hands on activities, learners will develop competencies croral for academic excellence and professional practice. Prerequisite knowledge in foundational courses is recommended. Expected Learning Outcomes Upon successful completion ofthis course, students are expected to: 5. Collaborate productively in team based projects, demonstrating leadership and interpersonal skils. 9, Synthesize knowledge across disciplines to address intedisciplinary challenges and opportunities. 6. Integrate technology and digital teracy to enhance leaming and professional productivity Demonstrate comprehensive understanding of fundamental principles and theories in creative writing workshop. 8 Demonstrate awareness of social responsibility, ethical considerations, and global perspectives in the discipline Communicate ideas effectively through writen reports, oral presentations, and ‘multimedia formats. to. Exhibit creatiiy, imovation, and adaptability in responding to emerging tends and industry demands. J conduct independent research using appropriate methodologies tools, and ethical standards. Page 1 of §"
    },
    {
        "image": "collegesyllabi2_synth_20_aug3.png",
        "label": "collegesyllabi",
        "ocr_text": "MORGAN VILLE UNWeRsH Separinent of Humeniies Souese Setabus Course Titin: Creative Writing Workshop Course Code: se Nembor of Credits: 2 uve Semester: 29 260: ascenctor( sy ay Phone: Chaerwe Description This couise provides sn ng workahon, integrating thecroticat itemowarks vith practicad applications. Stud Car melhowielosies, sr contemporary nouns Isher to the felt. Eraphasis is plsced on critica! thinking. Through Gissuesk hands on pmiessions! pasting isborative orobiem soiving oeth tes, leamers wil develop competencies Protequisits kravatedge i foundation courses Expected Learning Qotearaes non succesetut ox ©. Synins ofthis cour Sioduetvely in tram baned anowiedgs across csc) 8. fategrato rechrrology ane dig Semonstrate comprehen 8. Bema i, demonstat ROS 10 AciaiOSS i ‘iteracy te ennsnss sive undieistanesin, ‘S0SIR aateNees oF so. 19 leadership and i istiptinary cram, tempemonat sbi 88 AM OFN64 featonal prowuct ornate and meerioy mente 'e Geative writing workshop aRCNIbIY, stn: Si3tera. ano givbal perspectives is me svn 4 Conwreunicate ais etscivedy {risugh anitien resarts, oral presentation a ‘i soultmae 10. Bxiihit ceeatvity, iapevation, an saptatitty i P Fesponding to emorinn tends Conshict etepardont teseae S hetiodologias, toots, ch using appro Page tors"
    },
    {
        "image": "collegesyllabi2_synth_20_aug4.png",
        "label": "collegesyllabi",
        "ocr_text": "Bum er of Crostizg: 2unes Beraesten: ne Sen ay ong instruct Frome: ggizastria Berit: steven ciang Course Bascription precticat applications. 8 relevant to the fied. E recommended cours provides an in capth ax agrin ential for acedemis azcetience and pyolessicnal pres MORGAN VILLE Un Deparment of Hurnaniies Eysrse Sylisbus Course Tithe: Creaiive Writing Worksio; Course Code: nacrs SR Wilse. Scott Lee, MA rat edugn lon af creative siting wor theoratica! fremenork dents will explore key concepts, methodologies, mad contemporary lesues ced en critical thinking, analy and collaborative p n@ studies, and hands on activ Expected Learning Qutcomer 8, Demonstrate 2. Coaduet independant reseatat Jnon succes shui compiotion ef th Ceilaborate productreety ie ter 3 synthesize 5. intagrate Demonstrax eas etectvely aliviy, innovation, ans a iS Catia, tas nebased projects, demonstrating 'sadarstig and! interpersonal skits, isciptinary cha Ward pictessionat np of fundamental principles and thecries in creative writing workshao. sat responsivity. etica farstions, and gichsi persnactivas in ih hrovgh writen enor asentatona, and multmasia formals ptanllty im responding is emerging bends and indusiry demands, using apprepitate metnadaiogins, foots, and eihiost wanders Page 1 ofS"
    },
    {
        "image": "collegesyllabi2_synth_20_aug5.png",
        "label": "collegesyllabi",
        "ocr_text": "Course dytlatus Creative veriting Workehop ‘Conese Codes Hasett Cowrse Tithe: Number of Credits: 200 easasters 24 Sun AY RERERIE jaateuctorfsh Misc. Sectt Lee, MA. Pome: ogta 06t 7124 TEavaths vieven crenggerossan eas of ourse Destinos “Tis couse provides 2 ite wath prectical apalications ftv relevant to the fide, Emphasis ip placed 29 cf Through feclures, discussions, case studies and bends on activ qeacntiat for academic axcotience and prckessione practice, Prerequisite as examination of eredive wring rahe, integrating Hreonelical Iramevraks arts ait explore Fey concepts, nesting, ‘end cemternpoeney issues gh thdniing, ancsysies! 2 ive prublenn coWving toamars alk devalap competencies naskedga in foundational curses secamnmended Expected Learning Getcores completion of his courte, ehsti sgarshap and inbergervarsal Skil, sepects, GgmOneE SENG 12 rose wtorgisczpimaly chatenes aned epparsucibes east. tipon aucesvatlt ate expacted 5 Coftaborane nroturively it team based oe Gynthestza knowledge acrose diaciptne W 2 6. integrate technotosty 200 cia! Werwcy W enaes learning aed ooobrasio s 1. Demenetaie opmpreduensive understanding qe eendamental pracapies ave theories concave SRS swortshop F Demnratals asorceess of sonal exponsitaty, ice! consicerasons, an glota perspactizes tthe displ tf commenvonte ideas etscively trough wsiten F300\" peal prasentatons, anet nieaecia Tas =r Gant erent, enciton, and euantabiny We raepenaina ve eeasaggng tena ond indus Campane 19g, taOks, sre ethics! standards F conuet independent ses arch asing anOrOntate auotodotoat page 1085"
    }
]