[
    {
        "image": "collectionpolicy1_synth_10_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "LAURA VILLE STATE UNIVERSITY LIBRARY Troster iefcemation Herncy repources S programs end curicua offered and graduate levels. exsiuntion, woading, ond raplacecnert of otdntes by the inattution neross vgequsnons ts apprxsmatey #1 480 597, Sores ces, Subscriptions, &C rentiryesia consutaiion PRINT BOOKS Print Books: is are evaluated against ine same selection aechned not angnes sec copies may Be acre HTN \"preference fer authoritative PUBKSNeTS: wes. pcan ny nom ors rem aS"
    },
    {
        "image": "collectionpolicy1_synth_10_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "FOSTATE UiIVERSIT Y BRARY COLLECTION DEVELOPMENT POLICY Nard POLICY STATEMENT 1 PURPODE DE THE COLE TCT! mse ch he Catia tow si balancer cosine ton greath figeagiiones bane: an ubeqe otclittics and tae tecommeentit evens to ster fet dena ATT lites g meaming the MS EVAN AORN ate nuplar erent ot attned 3 PRINT BOOKS. RAO SM ie Sate ngnetenand 1 OS beer even: Ww"
    },
    {
        "image": "collectionpolicy1_synth_10_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "LAURA VILLE STATE UNIVERSITY LIBRARY COLLECTION DEVELOPMENT POLICY March 2024 POLICY STATEMENT This Collection Development Policy provides guidance for the acquisition, maintenance, and weeding of library materials to support the academic programs and research initiatives of Laura Ville State University. The policy ensures systematic development of resources aligned with institutional goals and accreditation standards. 1. PURPOSE OF THE COLLECTION Purpose of the Collection: Ensure balanced collection growth across recommendations. Foster information literacy and lifelong leaming through diverse formats and accessible resources Support the instructional programs and curricula offered by the institution across undergraduate and graduate levels. Maintain relevance through continuous evaluation, weeding, and replacement of outdated materials. Provide access to current and authoritative information resources in all fields of study. Facilitate scholarly research and creative activities of faculty, students, and institutional partners, ines based on usage statistics and faculty 2. ACQUISITIONS BUDGET Acquisitions Budget: The annual budget for library acquisitions is approximately 1 499 597, allocated across print materials, electronic resources, subscriptions, and multimedia collections. Budget distribution is reviewed annually by the Library Committee in consultation with academic departments to ensure equitable resource allocation, 3. PRINT BOOKS. Print Books: Donated materials are evaluated against the same selection criteria and may be declined if not aligned with the collection scope. Multiple copies may be acquired for high demand titles based on circulation data Preference for authoritative publishers, peer reviewed works, and award winning titles. Laura Ville State University Library Collection Development Policy Effective March 2024"
    },
    {
        "image": "collectionpolicy1_synth_10_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "LAURA VILLE STATE UNIVERSITY LiaRARY COLLECTION DEVELOPMENT POLICY March 2024 POLICY STATEMENT ‘This Colection Development Plcy provides guidance foe the acquisition, maintenance, and weeding ct Rorary materials to supmct the academic programs and reswerch initiatives of Laura Ville State University. The policy ensurss systematic development af resources aiigred wrth institutions! goals and accreditation standards 1. PURPOSE OF THE COLLECTION Purpose of the Collection, Ensuse balanced collection growth across discipinas hesad on usage statistics and taruity recommendations Foster Information literacy rnd tetong learning through diverse fornets snd accessible resources. Support the instiuctional programs and curicuia cftured by the institution scross indorgeduate anc grackuaie toveis, Mairtein relevance through contiwous evaluation, weeding, and replkcement of outdated materials Provide ecewss (0 cizrent and authorttative information rescurcees in al fieide of study Facittate scholatly research ard creative activitiee of fecutty, students, end institutional partners, 2 acQuIsmoNs BUNGET Acquisitions Budget The annual budget tor sbrary acquisitions 1s approximately #1 499 597, allocsted across print materials, electronic resources, subscriptions, and multimedia cotections. Budget disiribution ts reviewed annually by the Litrary Commuter in consuation with acaiemic departments to ensure equitanle resouree allocation. 3. PRINT BOOKS: Print Books: Donaied materials ate evatuated against the same seiection crtena and may De destined not aligned witn the eniiection scope Multiple copies may be acquired fcr high demand tities based on cicutation data. Preference for autnontative publishers, peer reviewed werks, and award winning tiles. Laura Ville State University Library Cotecton Development Policy ERtectve March 7024"
    },
    {
        "image": "collectionpolicy1_synth_10_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "LAURA VILLE STATE UNIVERSITY LIBRARY COLLECTION DEVELOPMENT POLICY March 2024 POLICY STATEMENT “This Collection Development Palicy provides guidance for the acquisition, maintenance, and and research initiatives of weeding of library materials to support the academic programs Laura Ville State University. The policy ensures systematic development of resources aligned with institutional goals and accreditation standards. 4. PURPOSE OF THE COLLECTION Purpose of the Collection: “Ensure balanced collection growth across disciplines based on uSa9e statistics and faculty recomt ming through diverse formats and accessible mendations. Foster information literacy and lifelong lear resources. TeSOUrCeE pe instructional programs and curicla offered undergraduate and graduate levels. vainain relevance through continuous evaluation, weeding, and replacement of outdated materials. Provide access Faclitate scholarly research and cr partners. 2. ACQUISITIONS BUDGET Acquisitions Budget: “The annual budget fo library acquisitions is approximately P1 499 597, allocated across print materials, electronic resources, subscriptions, and multimedia ‘collections. Budget distribution is reviewed annually by the Library Committee in consultation with academic departments to ensure equitable resource allocation. 3. PRINT BOOKS by the institution across ation resources in all fields of study. to current and authoritative inform: of faculty, students, and institutional reative activities Print Books: Donated materials are evaluated against the same sel declined if not aligned with the collection scope Multiple copies may be acquired for high demand titles based on circulation data. preference for authoritative publishers, peer reviewed works, and award winning titles. jection criteria and may be ‘Laura Vile State University Library Collection Development Policy Effective March 2024"
    },
    {
        "image": "collectionpolicy1_synth_1_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "JULIE vi INSTITUTE OF TECHROL &, COLLECTION DEVELOPMENT POLICY cerbe: 6 POLICY STATEMENT maintenance. aed ves oF The policy ens HES systematic Jevetspmant of regen acexiditation standarrs LECTION $u fered by the uedergraduate ang grad: Epsure batan: dations, grow 5 discptine: faculty recone Of Usage Statstics ang through cor MOUS eval outdated avmie te current ang autnont materials 2 ACQUISITIONS BUDGET ALTOS print mate ‘ais elect on, distinity ith scaaes PRINT Races. ai sitimed) ably Dy the Libr, On Bunget sevlewer anny: te ary Commuter Tite cepartnent Sure equita HES Based on ewrcisaton data EXLEDE for classic Preterence a ay awed work"
    },
    {
        "image": "collectionpolicy1_synth_1_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "JULIE VILLE INSTITUTE OF TECHNOLOGY LIBRARY COLLECTION DEVELOPMENT POLICY December 2024 POLICY STATEMENT This Collection Development Policy provides guidance for the acquisition ‘maintenance. and weeding of library materials to support the academic programs and research initiatives of ule Ville Institute of Technology. The policy ensures systematic development of resources aligned with institutional goals and accreditation standards 1. PURPOSE OF THE COLLECTION Purpose of the Collection Support the instructonal programs and curricula offe Undergraduate and graduate levels Ensure balanced collection growth across disc faculty recommendations Maintain relevance through continuous evaluation. outdated materials Provide access to current and author study fed by the institution across ‘iplines based on usage statistics and weeding, and replacement of ative information resources in all fields of 2, ACQUISITIONS BUDGET Acquisitions Budget The annual budget for library acquisitions 1s approximately 973 277, allocated across print materials, electronic resources, subscriptions, and multimedia collections. Budget distribution is reviewed annually by the Library Commitee in Consultation with academic departments to ensur 3. PRINT BOOKS Print Books Multiple copies may be acquired for hi Materials must be published within historical references Ponty 1s given to tities recommended bj Preference for authoritative publishers, titles fe equitable resource allocation igh demand titles based on circulation data the last five years, except for classic texts and y faculty and aligned with course syllabi Peer reviewed works, and award winning Jute Vile nsttute of Technology Library Collecton Development Policy ERectve December 2024"
    },
    {
        "image": "collectionpolicy1_synth_1_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "BRARY JULIE VILLE INSTITUTE GF TECHNGLOGY COMLECTION DEVELOPMENT POLICY December 2024 POUCY STATEMENT ~rovides guidance for the avquistion, maintenance, anc mcoding of library materisis to supeor the academe programs ard research irdtiatives of “pie Vio instinute of Tachneiogy. The pulley ensures ayaiamatic devsiors Hamat quale and accreditation standards ‘Thie Celtaction Development Fiokey 7 PURPOSE OF THE COLLECTION Purpase of the Collection: ots CFOS pport the Inetructonal pf ogra aN ct undergraduate and graduate S2ve s. Enguie balanced collection growin acrass disciplines based recommendations. vance Iirough contiaucus evatuabon, weeding, and repincen ant ni usage statis ment oF ecouicas 18 all fakes OF Wwe intormatt ACQUIBTIONS GUDGET se apnuat budget for ary acquiations i approximately P273 277, shouted scriptions, and mmaihmed: by the Lbraty Gommittee if hie res uroe alecation. across print materials, electronic rescusyces, Se collections, Budget distribution is reviewed anruas conguttation win academic departments to enesre 3. PRINT BOOKS Print Books: Mutipie copes may be acquired for Mi Materials must be published within the iast five ye igh demand tiles Based on cikculat Jars, excapl for classic texts and historical references. _ Prohy is given {e fates recummenciad by Preference for authoritative publishers. Jacutly and aligned with course syabt eer reviewed works, and awarcasinrnny tive Decsenber 2024 instiule of Technology Library Collection Development Pesicy Ea dette Ve"
    },
    {
        "image": "collectionpolicy1_synth_1_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "JULIE VILLE INSTITUTE OF TECHNOLOGY LIBRARY"
    },
    {
        "image": "collectionpolicy1_synth_1_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "JULIE VILLE INSTITUTE OF TECHNOLOGY LIBRARY COLLECTION DEVELOPMENT POLICY December 2024 POLICY STATEMENT ‘upport the academic programs and research initiatives of ule Ville Institute of Technology. The policy ensures systematic development of resources aligned with institutional goals and accreditation standards. 1. PURPOSE OF THE COLLECTION Purpose of the Collection: Support the instructional programs and curricula offe undergraduate and graduate levels, Ensure balanced collection growth across di faculty recommendations, Maintain relevance through continuous evaluation, weeding, outdated materials, Provide access to current and auth: study. red by the institution across isciplines based on usage statistics and and replacement of loritative information resources in all fields of 2. ACQUISITIONS BUDGET Acquisitions Budget The annual budget for library acquisitions is approximately ®973 277, allocated across print materials, electronic resources, subscriptions, and multimedia Collections. Budget distribution is reviewed annually by the Library Committee in consultation with academic departments to ensure equitable resource allocation. 3. PRINT BOOKS. Print Books: Multiple copies may be acquired for high demand titles based on circulation data Materials must be published within the last five years, except for classic texts and historical references, Priority is given to ttles recommended by faculty and aligned with course syttab Preference for authoritative publishers, peer reviewed works, and award winning titles, Julie Ville Institute of Technology Library Collection Development Policy Effective December 2024"
    },
    {
        "image": "collectionpolicy1_synth_2_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "COLLECTION DEVELop, February 2024 POLICY STATEMENT Purpose of the Collection. Facilitate scholarly institutional partners, accessible resources, Ensure balanced c; faculty recommendations Support the instructional Program: undergraduate and gradu late levels 2, ACauisiTions supcet Acquisitions Budget 3. PRINT BOOKS. Print Books: ‘ollection growth across ‘MENT POLIcy PURPOSE OF THE COLLECTION d sciplines based on usage statistics and S aNd curricula offered by the institution across"
    },
    {
        "image": "collectionpolicy1_synth_2_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "JOHN VILLE STATE UNIVERSITY LIBRARY COLLECTION DEVELOPMENT POLICY February 2024 POLICY STATEMENT This Collection Development Policy provides guidance for the acquisition, maintenance, and weeding of library materials to support the academic programs and research initiatives of John Ville State University. The policy ensures systematic development of resources aligned with institutional goals and accreditation standards: 1. PURPOSE OF THE COLLECTION Purpose of the Collection: Facilitate scholarly research and creative activities of faculty, students, and institutional partners. Foster information literacy and lifelong learning through diverse formats and accessible resources, Ensure balanced collection growth across disciplines based on usage statistics and faculty recommendations. Support the instructional programs and curricula offered by the institution across undergraduate and graduate levels 2. ACQUISITIONS BUDGET Acquisitions Budget: The annual budget for library acquisitions is approximately 2 603 171, allocated collections. Budget distribution is reviewed annually by the Library Committee in consultation with academic departments to ensure equitable resource allocation. 3. PRINT BOOKS Print Books: Donated materials are evaluated against the same selection criteria and may be deciined if not aligned with the collection scope. Priority is given to titles recommended by faculty and aligned with course syllabi Materials must be published within the last five years, except for classic texts and historical references. «Multiple copies may be acquired for high demand titles based on circulation data John Ville State University Library Collecton Development Policy| Eftectve February 2024"
    },
    {
        "image": "collectionpolicy1_synth_2_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "Standards 1. PURPOSE OF THE COLLECTION Purpose of the Collection memmat® $holany research and create actives o acu, students, ang institutional partners 7 Zoste formation Meracy and telong earning trough ana Ensure balanced collection ‘Jone Vite State University Library Colecton Development Policy| Eectve February 2024"
    },
    {
        "image": "collectionpolicy1_synth_2_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "JOHN VILLE STATE UNIVERSITY LIBRARY COLLECTION DEVELOPMENT POLICY February 2024 POLICY STATEMENT 1. PURPOSE OF THE COLLECTION Purpose of the Collection Facilitate scholarly research and creative institutional partners. Foster information literacy and litelon: accessible resources Ensure balanced collection faculty recommendations Support the instructional programs and undergraduate and graduate levels activities of faculty, students, and ig learning through diverse formats and Growth across disciplines based on usage statistics and Curticula offered by the institution across 2, ACQUISITIONS BUDGET Acquisitions Budget The annual budget for library acquisitions is approximately 2 603 171, allocated a ross print materials, electronic resources, subscriptions, and ‘mutimedia collections. Budget distribution is reviewed annually by the Library Committee in Consutation with academic departments to ensure equitable Tesource allocation 3. PRINT BOOKS Print Books Donated materials are evaluated ag declined if not aligned with the collect Prionty is given to tiles recommended by faculty and aligned with course syllabi Materials must be published within tt Ne last five years, except for classic texts and historical references. jainst the same selection criteria and may be tion scope. Muttple copies may be acquired for nigh demang titles based on circulation data Zohn Vile State University Library {Collecton Development Policy Eflectve February 2024"
    },
    {
        "image": "collectionpolicy1_synth_2_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "JCHN VILLE STAT! NIVERSITY UBRARY COLLECTION DEVELOPMENT POLICY Febuary 2024 POUCY STATEMENT This Cottection Daveionrivert Paiey provices quidance tor tew acoutsition, maintenonce, and weeding of Hoary matoriats to suppor the aradamic programs and esearch initiatives of Job Villa State University The policy ensures systematic deveiooment 91 -evcurtes ttgred with insitutional gouls ard accrodiaiicn standarcs 1. PURPOSE OF THE COLLECTION Purpose of the Cotection Facials schotary research ane creative actizhes of acuity. shut insttuonal partners, Fosier information leracy and idelong rearning through diverse formats and accessible resouices Ensure Balanced cotection growth across ciscipines based cn usage statistics and Tacutty recommencations Support the mstructonal prugrams and curricula Gitered by the wnskiuhon across undergraduats: and graduate levers SAE 2 ACQUISITIONS BUCGET Acauismions Budget The aenuai budget for ibraty acquisitions is approxrnately 2 603 177, atlocuiea across print matertais, elechonic resources, subscriptions. and mutimedia collectisns Gadget distribution is tenewed annuany vy the Liprary Committee in consultation wilh academic departments to ensure equilabis resource allocation, 3 PRINT ADOKS Print Books Donated materuls are evaluates against ihe same selection criteria and may be Ceciiwed not algned with the colection scope. Ponty fs given to titles :ecommendes ty tacuty and aligned with course sytaot ateriats must De published wattin Ue last tive years, except for classi texts ay hsto ical reterencs Mumps coptes m y be acquired for high demand ites based on cvcutaton data John Ville State University Library Goliectun Davelooment Poixy Efecive February 2028"
    },
    {
        "image": "collectionpolicy1_synth_3_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "DAVID VILLE INSTITUTE OF TECHNOLOGY LIBRARY COLLECTION DEVELOPMENT POLICY October 2024 POLICY STATEMENT ‘acquisition, maintenance, and David Vile Institute of Technology. ‘The policy ensures Dav Ve rad wth intone goals and acreation standard 1 PURPOSE OF THE COLLECTION Purpose of the Collection: programs and curicula offered by the Inston 2083 materials. Provide access to current and ‘study. SO scotty research and create aces Fay, GENS, 29 institutional partners. Donated Gectined if not aligned with the collection SCOP sec tp wn he ws ve yar ence or ase a 28 historical references. oa va ann tran come peacrm PA) ete =en2"
    },
    {
        "image": "collectionpolicy1_synth_3_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "DAVID VILLE INSTITUTE OF TECHNOLOGY LIBRARY COLLECTION DEVELOPMENT POLICY October 2024 POLICY STATEMENT This Coliectlon Development Policy proviktes guidance for the acquisition, mainienancss, ond weeding of lary meterials to suppott the academic programs and! research initistives ot David Vili Institute of Techrslogy. The policy ensures systematic development of resources aligned with institutional goals end sccrexitation standards 1. PURPOSE OF THE COLLECTION Purpose of the Galiection: Support the instructional programs and curriculs atfered by ine institution across undergraduate and graduate levels. Mainiaie relevance through continuous evaiualion, weeding, 3nd replacement of outdated materials Prowice access 16 current and authoritative information resources in ai elds of ‘sluey, Factitate schoiarty research and creative activities ct faculty, students, and tasstutonal partners. 2 ACQUISITIONS BUDCET Acquisitions Budget ‘The annual busiget for iidrary acquisitions Is approximately ®2 283 696, allocate actocs print materials, electronic resources, subscriptions, and muttimedia collections. Sudget cistnbution is reviewed annually by the Liorary Committee *n consuitation with academic departments to ensure equitabie resource allocation. 2. PRINT BOOKS Print Books: Preference for authoriative publishers, peer rewewed woiks, and award winning tities. Donated materiats are evaluated against tre same selection cnterta ang may be dectined nut aligned with the collection scope. Materiats must be published within ine last five years, except for classic texts ang histonicat references. ‘Ouvid Vile institu of Tecrnciogy Library j Collection Development Pesicy Etactive October 2026"
    },
    {
        "image": "collectionpolicy1_synth_3_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "DAVID VILLE INSTITUTE OF TECHNOLOGY LIBRARY COLLECTION DEVELOPMENT POLICY October 2024 POLICY STATEMENT for the acquisition, maintenance, and ‘This Collection Development Policy provides guidance f weeding of library materials to support the scodemic programs and research inatives of David Vile Insitute of Technology. The policy ‘ensures systematic development of resources aligned with institutional goals ‘and accreditation standards. 4. PURPOSE OF THE COLLECTION Purpose of the Collection’ «support the instructional programs ‘and curricula offered by the institution across undergraduate and graduate levels. Maintain relevance through continuous evaluation, weeding, and replacement of outdated materials. Ofrovide access to current and authoritative infor study. Facilitate s institutional partners rmation resources in all fields of chotarly research and creative activities of faculty, students, and 2, ACQUISITIONS BUDGET ‘Acquisitions Budget get for library acqul: jectronic res ibution is reviewed annual ents to ensure sitions is approximately P2 283 696, allocated sources, subscriptions, and multimedia ly by the Library Committee in equitable resource allocation. ‘The annual bud: across print materials, collections. Budget dist consultation with academic departm 3. PRINT BOOKS Print Books: ishers, peer reviewed works, and award winning preference for authoritative publ n criteria and may De titles. «= Donated materials are evaluated against the same selectio declined if not aligned with the collection scope. Materials must be published within the last five years, except historical references. for classic texts and ction Development Policy| Effective October 2024 avid Ville insttute of Technology Library Cole"
    },
    {
        "image": "collectionpolicy1_synth_3_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "DAVID VILLE INSTITUTE OF TECHNOLOGY LIBRARY COLLECTION DEVELOPMENT POLICY October 2024 POLICY STATEMENT This Collection Development Policy provides guidance forthe acquisition, maintenance, and ‘weeding of library materials to support the academic programs and research initiatives of David Vile Institute of Technology. The policy ensures systematic development of ‘resources aligned with institutional goals and accreditation standards 1. PURPOSE OF THE COLLECTION Purpose of the Collection: Support the instructional programs and curricula offered by the institution across undergraduate and graduate levels, Maintain relevance through continuous evaluation, weeding, and replacement of ‘outdated materials. Provide access to current and authoritative information resources in ail fields of study. Facilitate scholarly research and creative activities of faculty, students, and institutional partners. 2 ACQUISITIONS BUDGET Acquisitions Budget The annual budget for library acquisitions is approximately ®2 283 696, allocated collections. Budget distribution is reviewed annually by the Library Commitee in consultation with academic departments to ensure equitable resource allocation. 3. PRINT BOOKS Print Books: tiles. Donated materials are evaluated against the same selection criteria and may be declined if not aligned with the collection scope. Materiats must be published within the last five years, except for classic texts and historical references, David Ville Insttute of Technology Library Collecton Development Policy Effectve October 2024"
    },
    {
        "image": "collectionpolicy1_synth_3_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "DAVID VILLE INSTITUTE OF TECHNOLOGY LIBRARY COLLECTION DEVELOPMENT POLICY October 2024 POLICY STATEMENT This Collection Development Policy provides guidance for the acquisition, maintenance, and weeding of library materials to support the academic programs and research initiatives of David Ville Institute of Technology. The policy ensures systematic development of resources aligned with institutional goals and accreditation standards. 4. PURPOSE OF THE COLLECTION Purpose of the Collection: Support the instructional programs and curricula offered by the institution across undergraduate and graduate levels. Maintain relevance through continuous evaluation, weeding, and replacement of outdated materials. Provide access to current and authoritative information resources in all fields of study. Facilitate scholarly research and creative activities of faculty, students, and institutional partners, 2. ACQUISITIONS BUDGET Acquisitions Budget The annual budget for library acquisitions is approximately 2 283 696, allocated across print materials, electronic resources, subscriptions, and multimedia collections. Budget distribution is reviewed annually by the Library Committee in consultation with academic departments to ensure equitable resource allocation. 3. PRINT BOOKS Print Books: Preference for authoritative publishers, peer reviewed works, and award winning titles. Donated materials are evaluated against the same selection criteria and may be declined if not aligned with the collection scope. Materials must be published within the last five years, except for classic texts and historical references, David Ville Institute of Technology Library Collection Development Policy Effective October 2024"
    },
    {
        "image": "collectionpolicy1_synth_4_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "CHRISTOPHER VILLE INSTITUTE OF TECHNOLOGY LIBRARY COLLECTION DEVELOPMENT POLICY July 2025 POLICY STATEMENT ‘This Collection Development Policy provides guidance forthe acquisition, maintenance, and weeding of brary mateials to suppor the academic programs and researy jatives of Christopher Vile Institute of Technology. The policy ensures systematic development of resources algned with institutional goals and accreditation standards, 4. PURPOSE OF THE COLLECTION Purpose of the Collection: Facilitate scholarly research and creative activities of facu! institutional partners. ensure balanced collection growth across disciplines based on usage statistics and faculty recommendations. Foster information literacy and lifelong learning accessible resources. aprovide access to current and authoritative information resources in all fields of study. Maintain releval outdated materials. ity, students, and through diverse formats and ince through continuous evaluation, weeding, and replacement of 2. ACQUISITIONS BUDGET ‘Acquisitions Budget: “The annual budget for library acquisitions across print materials, electronic resource collections. Budget distribution is reviewed annual consultation with academic departments to ensure equitable resource 3. PRINT BOOKS is approximately 708 931, allocated .s, subscriptions, and multimedia ily by the Library Committee in allocation. Print Books: Donated materials are evaluated against the same selection criteria and may be declined if not aligned with the collection scope. Multiple copies may be acquired for high demand titles based on circulation data. Preference for authoritative publishers, peer reviewed works, and award winning titles. w promty is given to titles recommended by faculty and aligt ned with course syllabl. Christopher Vile Insttute of Technology Library Collection Development Policy Effective July 2025"
    },
    {
        "image": "collectionpolicy1_synth_4_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "CHRISTOPHE COLLECTION DEVELOPMENT POLICY. July 2 POLICY STATEMENT ition, maintenance, this Coliection Daveiopment Policy provides guidance for the weeding of Hibrary matuials to support Christopher Vile institute of Fachrclagy. The rescues aligned with institutional gadis and ove: y answes systematic devel ation stondards, 4, PURPOSE OF THE COLLECTION Purpose af the Co wities of faculty, students, atid ie scholarly research and create it Fact ingtitutonal Ensure bai tacully recommendations er information itterscy and kite SOUrERS, coass to cuivent ang authorliaiive information r og collection growth actoss disciplines based on usage statistics ar parse forrnals art 096 in ail fields oF Provide study. ie ough continious evaiation, and repiacement 2. ACQUISITIONS BUDGET Acquisitions Sbraty acquisitions ts approximately P7O8 934, aiiocated cFiptions, and muitimedia ly by the Library Committee in fy ensure equitzbte resource allocation. The annual buck materiais, electronic resources, sub et distribution is review academic department rina Print Books Donated materials are evaluates against the same selec declines i not aligned with the catiechen scope. Multipie co 20 Tor fagh- demand ttt Preference for author! peer reviewe: teria and may be ton cf es hased on circulstion daa yOrkS, AN award winning iailve publisher tn course syitabi es recommended by faculty and aligne: Cheistooher fa ott 07 Coltecton Developmant Policy Efiectve Jity 2025 ‘nology Un)"
    },
    {
        "image": "collectionpolicy1_synth_4_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "CHRISTOPHER VILLE INSTITUTE OF TECHNOLOGY LIBRARY COLLECTION DEVELOPMENT POLICY July 2025 POLICY STATEMENT 1. PURPOSE OF THE COLLECTION Purpose of the Collection: Facilitate scholarly institutional partners, ‘Cy and lifelong learning through diverse formats and accessible resources Provide access to '9h continuous evaluation, weeding, and Teplacement of outdated materials, 2 ACQUISITIONS BUDGET Acquisitions Budget:"
    },
    {
        "image": "collectionpolicy1_synth_4_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "CHRISTOPHER VILLE INSTITUTE OF TECHNOLOGY LIBRARY COLLECTION DEVELOPMENT POLICY July 2025 POLICY STATEMENT “This Collection Development Policy provides guidance for the acquisition, maintenance, and vveeding of library materials to suppor the academic Progmars and research initiatives of ‘Chistopher Vile Institute of Technology. The poicy neko systematic development of recoutees aligned with Institutional goals and accrestation standards. 4. PURPOSE OF THE COLLECTION Purpose of the Collection: Facilitate scholarly rese institutional partners. Ensure balanced collection gf faculty recommendations. Foster information literacy accessible resources. aprovide access to current and authoritative information resources in all field study. Maintain relevance through continuous evaluation, weeding, an outdated materials. 2. ACQUISITIONS BUDGET Acquisitions Budget: “The annual budget for library acquisitions Is approximately 708 931, allocated across print materials, electronic resources, subscriptions, and multimedia collections. Budget distribution is reviewed ‘annually by the Library Committee in consultation with academic departments 10 ‘ensure equitable resource allocation 3. PRINTBOOKS arch and creative activities of faculty, students, and rowth across disciplines based on usage statistics and and lifelong learning through diverse formats and is of \\d replacement of Print Books: Donated materials are evaluated against the same selection criteria and may be declined if not aligned with the collection Scope. Multiple copies may be acquired for high demany Preference for authoritative publishers, peer reviewed wor titles. Priority is given to ity and aligned with course syllabl. \\d titles based on circulation data rks, and award winning titles recommended by facul Library Collection Development Policy Effective July 2025 ‘Christopher Ville Institute of Technology"
    },
    {
        "image": "collectionpolicy1_synth_4_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "CHRIS? PHER LE INSTITUTE OF 7e; HNOLOGY LIBRARY COLLECTION DEVELOPMENT POLICY uly 2025 POLICY STATEMENY Tas Cotlectiog weeding of thes Christ for the p academic prog siinolegy. 1 acquisition, maltsnance, to supper F208 Bid et Ville Institute of Tex URPOSE OF THE ComLecTiOn Faciitate se fihution Ensure balanced cottecion gros faculty recommendations Foster inte: raat ESAIEN Ana creative actaties of faculty. ot partners, pa OSS oh ciples based atislice enc Haaton Wteracy ang tteiong ie mou ble resources t diverse kvmats i] HFeNt ane auth tative sntormation resaure teids of BiaeGiN relevance theo: R canting: evatuation, weedy ahent of 2 ACQUISITIONS unger urstions Burger Tre anny: ae 08 FOP O88 print eaieriais tions. Bus S abpronmatery B708 951, atocateg SHES, SubSEABENS, ang muitimedia HON IS rey dy the Library wath academic separ re equitabie 3 PRINT BOOKS electronic res: a et orstrie ved anna tents to ensis fansutation mmealtioe iy Fesource g Pr t Books. Bonar i materiat decined net al Maltip e Pretere; ‘S38 evaitated against tye INES Wi the colecion May be acquired 4 ice tor authoritam Pigh cemana ties based on cists ve publishers. peer reviewer bhatt of Technatogy 107 Development Paley Pe ly"
    },
    {
        "image": "collectionpolicy1_synth_5_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "RONNIE VILLE COLLEGE LIBRARY COLLECTION DEVELOPMENT POLICY April 2024 POLICY STATEMENT This Collection Development Policy provides guidance forthe acquisition, maintenance, and weeding of library materials to support the academic programs and research iniatives of Ronnie Ville College. The policy ensures systematic development of resources aligned with institutional goals and accreditation standards, 1. PURPOSE OF THE COLLECTION Purpose of the Collection: Ensure balanced collection faculty recommendations. {Provide access to current and authoritative information resources in all elds of study. Foster information literacy and lifelong learning through diverse formats and accessible resources. Maintain relevance through continuous evaluation, outdated materials, growth across disciplines based on usage statistics and weeding, and replacement of 2, ACQUISITIONS BUDGET Acquisitions Budget The annual budget for library acquisitions is approximately 1 562 967, allocated across print materials, electronic resources, subscriptions, and multimedia Colections. Budget distribution is reviewed annually by the Library Committee in Consultation with academic departments to ensure equitable resource allocation 3. PRINT BOOKS Print Books: Priority is given totes recommended by faculty and aligned with course syllabi Preference for authoritative publishers, peer reviewed works, and ‘award winning titles Multiple copies may be acquired for high demand titles based on circulation date Materials must be published within the last five years, except for classic texts and historical references. Donated materials are evaluated against the same selection criteria and ‘may be declined if Not aligned with the collection scope. Ronnie Ville College Library Collection Development Policy Eftectve April 2024"
    },
    {
        "image": "collectionpolicy1_synth_5_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "RONNIE VILLE COLLEGE LIBRARY COLLECTION DEVELOPMENT POLICY April 2024 POLICY STATEMENT ‘This Collection Development Policy provides guidance {for the acquisition, maintenance, and ind research initiatives of Is to support the academic programs a policy ensures systematic development of resources aligned with weeding of library material Ronnie Ville College. The institutional goals and accreditation standards. 4, PURPOSE OF THE COLLECTION Purpose of the Collection: «Ensure balanced collection growth across disciplines based on usag faculty recommendations. Provide access to current and al study. Foster information literacy and lifelong learning through diverse fo accessible resources. avaintain relevance through continuous evaluation, weedin outdated materials. ye statistics and utnoritative information resources in all fields of mats and .g, and replacement of 2. ACQUISITIONS BUDGET ‘Acquisitions Budget The annual budget for librar across print materials, electronic re: collections. Budget distribution is review consultation with academic departments to ensure 3. PRINT BOOKS ry acquisitions is approximately 1 562 967, allocated sources, subscriptions, and multimedia ed annually by the Library Committee in equitable resource allocation Print Books: Priotty is given to titles Preference for authoritat Multiple copies may be acquired for hat Materials must be published within the last five years. exc historical references. iso ed materials are evaluated against the same selection criteria and may be declined if rot aligned with the collection scope. recommended by facuity and aligned with course syllabi ive publishers, peer reviewed works, and award winning titles, demand titles based on circulation data. pt for classic texts and Ronnie Ville College Library Collection Development Policy Effective April 2024"
    },
    {
        "image": "collectionpolicy1_synth_5_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "Hite LE COLLECE LIBRARY COLLECTION DEVELOPMENT POLICY Apr POLICY STATEMENT Tha Collection, Develunerant Poiicy orovictas guadane ee acctusitien, maintenance, wid He intorals to sgn the ocadanve pecgraens apn! resnais® intlatives Roomve Vie Lcbage The potcy wesuees systema: develeprcent of msourres wig with osilhtint ynats anal sccindtahon stardods 1 PURPOSE OF THE COLLECTION Purose of the tion, sure bala’ Om £0 Cone CHON youth across declines Dased On LAGE Slatatics ara scavons, 288 {6 Current and aumartanve Isto maton resent: Wd of Fosier avformatinn steracy and wetory atcessile resources Manton: retevance Ihtouan conbnvous evaluation weeding, ana repiacement of outdated matenais 2 formats atet arning inraugt ane: 2 ACQUISITIONS BUNGET Acquesions Sugget sage for sbeaty acquis 2108s Bint matenals, eiectrons re Ss doproenatety P1562 SEP atoca: uICeS LUDSCHOMONy and mutmnedia Covections Sudeui aisinbution js reviewed annuaity by biaty Commniige in Comsattation with a: Guitadle (eseurce mocation 5 PRINT BOOKS: to ensute Bart Becks Poicsty 8 grven ty Lites emcommended by tae hy and aianed wth course sy tate Preteens for autrenistive publsiess catr tevinwed week, Matisse wed sacar waning t Mt titles Gesed on Gite talon date ren the last five vane encegs hey Clarsi lente anal FS May be AcQLit for high de leriths mun! be pRashed Nastonical fereeces Cxrated matectas, ae wvatunied ag: ret aligrad at the same sulectwn 2 levta an may be declined it O79 Library Codmcnon Devtiogment Poitry Ctecave apn!"
    },
    {
        "image": "collectionpolicy1_synth_5_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "POLICY STATEMENT Thit Collection Development Paliy ‘weeaing provides gui npr the ecadam Sf fibrary materials to au \"SIE Bystemalic lesstituti ation standards goals and accra, 4 PURPOSE OF THE COLL EcTiCns Purpoue of the Cottectinn: taeuity reco, Provi Stay, 2 statistios ang formation resources in all el ster informnation titer thie resources, #1 1Bievance th ouldated CY @nd elnng teamnin ng through rough coni 8 evaiusiton. weedtig, ACQUISITIONS BUDGET or The any ua! Budget for Bbrary acquisitions j i Malevials, electrons Soproximately 8S, SuNSttiptions. ana x ihution 1s reviewed annua ‘omic departments to ens limedia Library Committes in '@ equitable resource aiiccation, 3 PRR saOKS Petra Books, Peority is given to tes recommenclad by facuity and aligned with course sylent hers, paerreviowad works, be eequtrad fo fas must be publisher historias cafes nd eewardovisting tte. ies based on ota sie texts ans sire except fox 282 evaluated ageinet the collection scape, the seme vel of criteria and may ie declined ff Ronnie vitle Cotte ‘brary Cation Sevatonment p y Bective Apa 2024"
    },
    {
        "image": "collectionpolicy1_synth_5_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "RONNIE VILLE COLLEGE LIBRARY COLLECTION DEVELOPMENT POLICY April 2024 POLICY STATEMENT This Collection Development Policy provides guidance for the acquisition, maintenance, and weeding of library materials to support the academic programs and research initiatives of Ronnie Ville College. The policy ensures systematic development of resources aligned with institutional goals and accreditation standards. PURPOSE OF THE COLLECTION Purpose of the Collection Ensure balanced collection growth across disciplines based on usage statistics and faculty recommendations. Provide access to current and authoritative information resources in all fields of study. Foster information literacy and lifelong learning through diverse formats and accessible resources. Maintain relevance through continuous evaluation, weeding, and replacement of outdated materials. ACQUISITIONS BUDGET Acquisitions Budget: The annual budget for library acquisitions is approximately ®1 562 967, allocated across print materials, electronic resources, subscriptions, and multimedia collections. Budget distribution is reviewed annually by the Library Committee in consultation with academic departments to ensure equitable resource allocation. 3. PRINT BOOKS Print Books: Priority is given to titles recommended by faculty and aligned with course syllabi Preference for authoritative publishers, peer reviewed works, and award winning titles. Multiple copies may be acquired for high demand titles based on circulation data, Materials must be published within the last five years, except for classic texts and historical references. Donated materials are evaluated against the same selection criteria and may be declined if not aligned with the collection scope. Ronnie Ville College Library Collection Development Policy Effective April 2024"
    },
    {
        "image": "collectionpolicy1_synth_6_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "SARA VILLE INSTITUTE OF TECHNOLOGY LIBRARY COLLECTION DEVELOPMENT POLICY December 2024 POLICY STATEMENT This Collection Development Policy provides guidance for the acquisition, maintenance, and weeding of library materials to support the academic programs and research initiatives of Sara Ville Institute of Technology. The policy ensures systematic development of resources aligned with institutional goals and accreditation standards. PURPOSE OF THE COLLECTION Purpose of the Collection Foster information literacy and lifelong learning through diverse formats and accessible resources. Maintain relevance through continuous evaluation, weeding, and replacement of outdated materials. Ensure balanced collection growth across disciplines based on usage statistics and faculty recommendations. Support the instructional programs and curricula offered by the institution across undergraduate and graduate levels. Facilitate scholarly research and creative activities of faculty, students, and institutional partners. ACQUISITIONS BUDGET Acquisitions Budget: The annual budget for library acquisitions is approximately 671 344, allocated across print materials, electronic resources, subscriptions, and multimedia collections. Budget distribution is reviewed annually by the Library Committee in consultation with academic departments to ensure equitable resource allocation. 3. PRINT BOOKS Print Books: Multiple copies may be acquired for high demand titles based on circulation data Priority is given to titles recommended by faculty and aligned with course syllabi Preference for authoritative publishers, peer reviewed works, and award winning titles. Materials must be published within the last five years, except for classic texts and historical references Donated materials are evaluated against the same selection criteria and may be declined if not aligned with the collection scope. Sara Ville Institute of Technology Library Collection Development Policy Effective December 2024"
    },
    {
        "image": "collectionpolicy1_synth_6_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "SARA VILLE INSTITUTE oF TECHNOLOGY LipRany COLLECTION DEVELOPMENT POLICY December 2024 PURPOSE OF THE COLLECTION Purpose of ne Cetlection, Foster information Meracy and Deiong Ramin tuougn diverse formats ang aCcessDie Tesources Maintain rerevance though: continuous evatiation. weeding, ay Outdated nigteriats Ensure batanced collection growth acrosg “isciplines Desed cn usage statstics ang faculty recommenaations Supoctt he istructiona’ programs and Curneuits oMered by the insttutsyn across undergraduate ang weduate wevets, Factitate scnotari Pra tevleons works on ewarc winrws ites Materials must 20 published! historical references, Donated mate s are avatuoted against ‘the same selection citera and may be dectinod 10% aligned vith the collection eccpe Seta Vise usta ct Tochnoiony ieary Cotection Deveiounant Poicy Etecave Oocombe: 2024"
    },
    {
        "image": "collectionpolicy1_synth_6_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "{OLOGY LIBRARY SARA VILLE INSTITUTE OF COLLECTION DEVELOPMENT POLICY De pber 2024 POLICY STATEMENT nt Paliay provides quidance for the acquisition, maintensnce, and 0 supptet the academic progeams and research iniatives of systematic development of resources Sara Vile instiivla of Technology. Tha policy ens ancards attr alignad with Institutlenal guais and accred! 4. PURPOSE OF TNE COLLECTION Purpase of the Collection. siverse formats anc Foster information teracy and ifelong i essible resourk vance through continuow als 2d collection gro culty recommendations, ional programs and curr ng ted evaiiation, weeding, and replacement of n actoss discipines based an usage statistics and offered by the institution across Suppoit the instr certs an ities of Facaatty, 3, ACQUISITIONS BUDGET Acquisitions Bus rary aoquisiions is apor ectronic 1230 bscriphons, and mult ibutfon is reviewed annually by the Library Committee in naure equilable resource The aimual budg across print cotection consultation with acasemic deparme 3 PRMIT BGOKS ni Books Multiple copies may be acquired for highslemand tiles based on clreuledinr Priority is given to files recummensied hy faculty and aligned with courte sya Preference for auihoritative publishers, paerzeviewsd works, aved award Matesiais must be published within the last five years, except for classic texts and historical roferener Donated materials are evaluated agatnst th erterla snd mre see -y Effective December Sara vite Institute of Tecknvlogy Linrany Coliecton Deveicnment"
    },
    {
        "image": "collectionpolicy1_synth_6_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "COLLECTION DEVELOPMENT POLICY December 2024 POUCY STATEMENT acquisivon, maintenance and 3s guia ec adensc poyuuns 5 Sy Blemiate Oevetperont of aes ces This Cedection Deveiopmment Poley prow to wuppet waecion of flyay mate a ath wnstitubanal gorts end arcieditation standaids, 4 PURPOSE OF THE COLLECTION pose of the Ce sot accessible fesOvILES lain fatevance throrgts outdated mai Epsure atten, wemdng, BAT fe ris anced cotecion gow nes and eased on usage sta! facuity recommencater iN acres Suppert the nstuctonal programs and cu aig ‘eves undergiaduate and gr ents, ane feseaien out Geatve act ona Sane S 2 ACQUISITIONS BUDGET dequstions Burg Fy ATGUISHIORS 15 AL ET The annaie ude 1 aciuss pra maieneis @cetrone TesoUTEeS +L chiens Buaget distntutoin s reviewed arn nts too PRINT BOOKS, Ort hooks nis copes may be at ws geno we sacning hi Praficurace Tor authentative publish wee wer within the yt fire years Ecegs Mateniais crust bo pada o salvetion crit and may be dec cnet psithe t Donated materiale ate nya ated no. signe with the collectwn eoore on Dewslyoment Petry Eifgrtye Oecemmaat 2024 Sata ihe Inabeuhe at Techy Library Co"
    },
    {
        "image": "collectionpolicy1_synth_6_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "HHOLOGY LIBRARY COLLECTION DEVELOPMENT POLICY December 2024 pOUCY STATEMENT ty provides Guidence for the ancien snaintenstict, ad coding of sry roaictals to supper 8 nridienie prograrns and reste HERES of Sere vig inatiute of Tesbnelngy. The paley SoS systernatic davaiograné of 980418 igigned with itittional gras an ponradtation standards “tids Doligetion Bavetopment 4 RURBOSE OF THE SOULROTION Purpose af the Cotlection Foster information Haracy and iF accessible resources ytaintain relevance MarOuGe outdated materi. Mengure balanced colecion Growin ACTOS aseiplines 63 scully recommensdaticns. Support the ingtructonsl pregrarns ond curricula oftered by the WsHnMINT BFTOSS undergrnouate and gracias levels w Raniate scholeny research and creatine 3¢ tutions! HAERES. come teartiens through diverse fOFTaIS and son, weaning, and replacement oF contingaus ev sadn usage statistics and ie3 of faculty, studenss, apd 2, ACQUIBEDNS BUDGET a Acquisitions Gi acquisitions is approxiriately PST1 244, allocale 2 regoutces, eubscriptions, anc moivnedia exiewed aneually oy the Library Commies cmare equitable cezoures allocation The annua! euaget for hb! across print aaiesials. elecits entections. Suaget distribution fs consuation with academic depacmen s | PRR BOOKS Paiet Book Mustgto coplea may be acquired for high demand titles bared 29 cuity as signned watts ocr hase, peerreviewed sarki, and aval clasgic texte and Penference Sar acshortative pubis swinning ies Hatwriste must be pudalishad hin the toat five years, cxcapt for téotarical roterances, ated materials are evauated against the sae J with the callactinn scope selection caters and may be dactnod Geramber 20% st sare \\giio notiete of Tertalogy Uubraty Gollection Development"
    },
    {
        "image": "collectionpolicy1_synth_7_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "MARY VILLE STATE UNIVERSITY LIBRARY COLLECTION DEVELOPMENT POLICY December 2023 POLICY STATEMENT ‘This Collection Development Policy provides guidance for the acquisition, maintenance, and weeding of library materials to support the scademic programs and research initiatives of Mary Ville State University. The policy ensults systematic development of resources aligned with institutional goals and ‘accreditation standards. PURPOSE OF THE COLLECTION 1 Purpose of the Collection nt of Maintain relevance through continuous outdated materials. Support the instructional programs and curricula offered by the undergraduate and graduate levels a pacttate scholarly research and creative actives of faculty, students, and institutional partners. v provide access to current and authoritative information resources in all felds of study. Foster information literacy and lifelong accessible resources. evaluation, weeding, and replaceme institution across learning through diverse formats and 2. ACQUISITIONS BUDGET ‘Acquisitions Budget ‘The annual budget for library acau! across print materials, electronic resources, Sul collections. Budget distribution is reviewed anni Conguttation with academic departments to ensure equitable re 3. PRINT BOOKS sitions is approximately 602 145, allocated Ipscriptions, and multimedia ily by the Library Committee In ssource allocation. Print Books: Donated materials are evaluated against the same selection criteria and may be deciined if not aligned with the collection scope. reviewed works, and award winning tiles Preference for authoritative publishers, Peer red for high demand titles based on circulation data. Multiple copies may be acqul «Prony is given to titles recommended by faculty and aligned with course syllabi Materials must be published within the last five years, ‘except for classic texts and historical references. Policy Effective December 2023"
    },
    {
        "image": "collectionpolicy1_synth_7_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "MARY VILLE ST UNIVERSITY LIBRARY COLLESTION DEVELOPMENT POLICY December 2025 POLICY STATEMENT Coltee weeding atlemic, programs an avy Ville State Univarsily, The policy ensuing syst alignes wits netizios ravesroh initiatives of opener of ra rontinuous evalu tion, weeding, and replacement of wort the insiuctional programs ie and graduate ievels ang curr ula offered by the mstitution actos ay activities of facutty, students, ang Provige access to current and autho! shidy Fosier information ater accessinie resources. ative intommation resources in ail fietds of learning through diverse formats and 2 ACQUISITIONS BunGET Acqui ‘The annus ions Budget budlget for ep aeross print materia cated iy by the Liprary Committee in bie resource aiiocatlon Bent Books, Gonatad matatlats ate evaluated auain not aligned with the rence for asihoritative pads tion criteria and may he destined if shears, pearraviowed aurky, and awardwinning tities Buttiple copies may be acquired for highkdemand tiles basad on circulation dat Priodty ie given to titles eecoinmanded by faculty and aligned with course sya Materiats must be published w yeas, ance! for classic texts and ristoeical Fes taasy Vile S University Li aection Development Policy EMectiva December 2023"
    },
    {
        "image": "collectionpolicy1_synth_7_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "MARY VILLE STATE UNIVERSITY LIBRARY COLLECTION DEVELOPMENT POLICY December 2023 POLICY STATEMENT This Coliection Dewalopment Paticy provides guidance for the acquinition, maintenance, and wescing of lorary materials to support the academic programs and researc’ initethves of Mary Vite Stata University. The policy ensures systematic development of rescuers aligned wih institutional goals arvS accredization standards 4. PURPOSE OF THE COLLECTION Purpose of the Collection: Maintain relevance through continuous evalyation, weeding, and replacement ot outdated materiais Support the mstructonai programs and curricula offered by the institution across undergraduate and graduaie ievals, Fachitate schotarly research and creative activities of faculty, stutents, and ‘nsittuliona partners, Provide accuss to curtent and autnortiative information resources in alt felds of study. Foster intormation Mteracy and kfeiong learning through diverse formats ang accessible resources 2 ACCANSITIONS BUDGET Acquisitions Budget The annua’ budget for brary acquisitions is approxmately PE02 145, allocated cross print materiais, electronic resources, subscriptions, and multimedia collections. Budget distribution ts reviewed annually by the Liorary Commumtee in consultation with academic departments to ensure equitable resource allocation 3 PRINT BOOKS Print Books: Donated materiais re evaluated against the sume selection crtteda and may be dectined it ot atyned with the collection scope Preference tor authoritative publishers, peav reviewad works, and award winnang titles Multiple copies may be acquired for high demand ties hased on cheulation data Prlcetty is giver to tives recommenced by faciity and aligned with course syPabi Materials mut be published within the tast five yaars, except for classic texts ard Ristorica! raferencss Mary Vike Sizia University Library Coecton Devaingment Poicy tective December 2073"
    },
    {
        "image": "collectionpolicy1_synth_7_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "MARY SiLLE STATE Univ LIBRARY COLLECTION CEVELOPMENT POLICY December 2023 POLICY STATEMENT ction Developement Policy gravida weetbng of fbrary matatlats to suppet the academic programs and research Mary Vile State University. The puicy ensures ie develo aligned wi onal goals end accreditation standaits sti 1. PURPOSE OF THE COLLECTION P TpORe of the Cokection: Maintain relevance thew outisted maisriats. structional p gh continuous evaluation, weeding, ang reptacemet Po ane cuaricula offered hy the insiitutton ac ative activities of tacuily, students, ana Provide access to current and authoriat study Foster infor a e resource: ity infermation reseurces in ail hells of ng fearing t ough diverse formats 2 ACQUISITIONS BUDGET Acquisitions Budget S ot Tor library acq S. electronic resou anprosimately 802 148, alecates: C25, SubSCriBtons, and mullimes Budget Hon 8. reviewed annually by the Library Com Consumation with academic departinents to enaure eq 3 PRINT BOOKS lee in ejuilabie resource allocation Print Books Donated mat als are evaluated againat the same sol ined with the collection saps Prafemance fay authoritative publionen Mialtipie series may be Paiotty is given to tides Mat historical ref Mary Ville State University | Collection Deveiopment Poticy wer 2622"
    },
    {
        "image": "collectionpolicy1_synth_7_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "sty mete 0 nitiatives of fetevaw y Stl vtion resources ip all fieles of y aceuisitions Is ap: PADZ 140, allocated electronic resources, subs cally by the Library on vith acadern quitabie resout NY BOOKS Donated i ed on olrculat ‘ommended by fe. sd aligned wit cour last five years. except fi ‘opment Poitey Et"
    },
    {
        "image": "collectionpolicy1_synth_8_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "DEBBIE VILLE COLLEGE LIBRARY COLLECTION DEVELOPMENT POLICY November 2025 POLICY STATEMENT ont Policy provides guldanee for the ac: 5 nar weeding of lasary materials wit the sc natives of Debi Vile Codege. The paley ensures systematic devetonmont af Hionet goals and wexredtation stondars reseurces aligned wil 4. PURPOSE Gf THE COLLECTION Purpose of the Collection Sopport the instructic oat cola offered by the inntitutia undergraduate and graduete level in relevance throug coniinunus evaluation, weeding, and replavement of outdated 21083 fy search and creative ac fecully, students, and inet partners, youre bala recommendations Prowisia ace collection growth acs Statistics and faculty rant and a ie at elds of stay Aoquistions The annw i mucige? for library acquisitions is approxamnaiely 2 729 534, allocated fs sources, subscriptions, and mudtemodia ons “ouecet disiributton is reviewed annually by the Liorary Cor consuilalion with acaderic depacmments te ensure euuitable resgures atocation 2 PRINT BOGKS Print Books: (ke, and awardowinning tabi y and aligned with esurse hig relemana ties based on circulation data fon cnieria and may “Donated materiais are eva deciined nat aligned wth the collection s0 Debbie Vile College bil ection Development Policy Sfiactive Moversber 2028"
    },
    {
        "image": "collectionpolicy1_synth_8_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "BRARY DEBBIE VILLE COLLEGE COLLECTION DEVELOPMENT POLIcy Movember 2023 POLICY STATEMENT dor the acquisition, maietanarce, an) statiees of setos cpacdances and raseare foe, Darvetopmnent Pelizy pro Tis Coflectl vterisis Yo supped the academic BrOgisers vie Collage Tha povey snus systerntic SOY opener of escurces alge Tunaiona! qoeke arc accreditation stactiers 4. PURDOSE OF THE COLLECTION Purpose of the Cofection +Su poems ane castes cred oy th yerass undergraduate 5 te ive oi, on sepiacermens of oxigen Mainteln reievance Beougt continusae evaluation, _ otudents, and inattuttorat mnafesiane Facial stvties of te partsts Eee balanced calles! recommendations. Prewide eosse to curt = Eogiee information tewacy 8° gohelarly rexearcl and creative A! vas banod cn unage statistan and fecly sian gown actos disc cawomices in ati Heads of ately. mais and accessine cof authoxtiative infcrrnation slgeg tearring through diners for segues 4. RRQUISITIONS BUDGET acquisitions Beoget sage for Borary Requisitions 1 APPE onmately 2 729 934, aftecated int inaterials, cbeetrorde TeSstCe iguriptions, and mutimeda? distyibunon #3 reviewed anally Dy He jieary Commitigs 0 rapartinents io ensare aculsyle FeSO? afineation, acs cotectons. Bud saat awordewing Print Books: Preference for suthenit ative papnishers, peer reviewed WOES, 3 sty and atigned ith course syab ees based OF on data Hietig and may be uhes. Promiy is given 10 URES atin copies may be aca Donaied materials ave evaliated agaist thE Sae vdecunes it not aligned sath tne collection 82006, ommended by Yee seed for highstemand me smection of Jitee Comege Libraty Cater:"
    },
    {
        "image": "collectionpolicy1_synth_8_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "BBIE VILLE COLLEGE LIBRARY COLLECTION DEVELOPMENT POLICY Heavember 2023 POLICY STATEMENT -y provides guidance for the a enals to Suppo the acaden ne policy ens institutional goals standards 1 PURPOSE OF THE COLLECTION recomanennatior sb cess te cunent and au 2 ACQUISITIONS BUBGET Acquisitions Budget The annual budg across pi Hbrary acqurisitians ronic 18: 's approviinately PZ 725 324, allocated Hl mais 28, Subscriptions. and multimedia ution iS reviewed ar’ ademic depe 2% sani lly by the Library C: sre equal th ay 3 PRINY BOOKS rments to ie resource alloca Pri Books Preference for autneritative pt blishers, peel revioweu works, and awardowinning ded by fact id for high demal net a wi urSe Syl ne (ites Dased on circulation dat ay Pe opies may be ac y materials evi ned i not aligned with Policy 1 Bfectve Novemieer 2"
    },
    {
        "image": "collectionpolicy1_synth_8_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "DEBBIE VILLE COLLEGE LIBRARY COLLECTION DEVELOPMENT POLICY November 2023 POLICY STATEMENT This Collection Development Policy provides guidance for the acquisition, maintenance, and ‘weeding of library materials to support the academic programs and research initiatives of Debbie Ville College. The policy ensures systematic development of resources aligned with institutional goals and accreditation standards, 1, PURPOSE OF THE COLLECTION Purpose of the Collection: Support the instructional programs and curricula offered by the institution across undergraduate and graduate levels, Maintain relevance through continuous evaluation, weeding, and replacement of outdated materials, Facilitate scholarly research and creative activities of faculty, students, and institutional partners. Ensure balanced collection growth across disciplines based on usage statistics and faculty recommendations. Provide access to current and authoritative information resources in all fields of study. Foster information literacy and lifelong leaming through diverse formats and accessible resources. 2. ACQUISITIONS BUDGET Acquisitions Budget: The annual budget for library acquisitions is approximately 2 729 334, allocated across print materials, electronic resources, subscriptions, and multimedia collections. Budget distribution is reviewed annually by the Library Committee in consultation with academic departments to ensure equitable resource allocation. 3. PRINT BOOKS Print Books: Preference for authoritative publishers, peer reviewed works, and award winning titles Priority is given to titles recommended by faculty and aligned with course syilab|. Multiple copies may be acquired for high demand titles based on circulation data Donated materials are evaluated against the same selection criteria and may be declined if not aligned with the collection scope. Debbie Ville College Library Collection Development Policy Effective November 2023"
    },
    {
        "image": "collectionpolicy1_synth_8_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "VILLE 1 DEBBIE COLLECTION DEVELOPMENT POLICY yarnber 22 seY STATEMENT PO and provides guidance for the the academic progr research initiatives of with woes aig PURPOSE OF THE COLLECTION the Coltection emmendat ons. Piowige access to cumtant at QuiSiTIONS BUDGET istlons Budget 729 384, a age! for Rhrary acals timer ¥y COND gocation reviewed a parents to =f Print Books aterence for avin 1s, peer reviewed Works, and award winnihy Donated mater tineg I not aligned wi are eveluaied against ihe same Sele: nthe cel ge Livrane {Gate Detivie Wt"
    },
    {
        "image": "collectionpolicy1_synth_9_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "BENJAMIN VILLE COLLEGE LIBRARY COLLECTION DEVELOPMENT POLICY dune 2025 POLICY STATEMENT ‘This Culiectiun Developinent Policy provides guidance for the acquisition, maictenance, and wording of ibrery meteriais to suppost the academic programs and research initiatives of Benjamin Vike Celtoge The poicy ansures systernatic developenent of resources aligned wth inatitional goals ard accreditation standards 1. PURPOSE OF THE COLLECTION Purpose of the Collection: Fuster information literacy and ifetong leeming tough diverse formate ane! acceasitie \"Faciitate schoiany reseerch and creative actviies of facuily, etuferts, ard institiensl partners, «+ Provide access to Curent and suthortative infesmation resources in all fields of study Ensure balanced collection groath across disciplines based on usage statistics ond faculty recommendations, Support the instructional programs snd curricula offered by the inatitution across undergraduele and graduate levels Maintain relevance through continuous evaivation. weeding, and replacement of eutdsted maona s 2. ACQUISITIONS BUDGET Acquisitions Budget: The annuat budget far Worary acquisitions 1s approximately 1 653 015, allocated _actass print materials, electronic resources, subscriptions, and mutimedia collections. Budget distribution Is reviewed annually by the Library Comnidiiee in consutiation with academic deparimen s fe ensure equitable resource akocation 2. PRINT BOOKS Pring Books: Donated materiais ave evaluated against the same eelection criteria and ray be dectined it ot aligned with the collection scope. Wuttiple copies may be aceaived for Kighdemand tides based on circutation data Meterials must be pubiished within tho iast tive years, except for classic teats and Nisiecicat references. Proference for resthoritetive publishers, peer reviewed works, end award winning tithes Prionty is given tc ttles tecommanded by faculty and atigned with course sylats, Bonjarian Vike Cotiege Library Cokecton Devaionment Policy Ettective June 2025"
    },
    {
        "image": "collectionpolicy1_synth_9_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "BENJAMIN VELE COLLEGE LIBR. COLLECTION DEVELOPMENT POLICY pe 2025 POLIGY STATEMENT acauisition, melnten guidance for th re pragrams ane resenrc’ initia ie davelopmant of sescurces aligned This Collection Development Polley provi weeding of Bbraiy matedais to eupgen the ec Benjarin Wille College. The policy ensures syste ath institutional goats 8 reditation standards ives «PURPOSE OF THE COLLECTION Purpose of the Cet nnals and acces sh diverse f og Foster infarmation literacy and ielong Inaming the resouices. TTolitale schelady research ond creative activities of faculty, students, ar to current and authoritative infornation resources in all Hekds of study ch acsao disciot we batanced col anmandiaiions Suppit the andargaduate ard gradves Maintain relovance thou nates, fection gry and cunficuls offered ional pogian outdated 5 evaluation 2, ACQUISITIONS BUDGET Acquisitions Suriget locntert nately 81 553, The anny, acraSS print materiats, ef jectlons. Budi consukation with academic 2 PRINT BOOKS pudget ior dbrary acquisitions is appre sources, subsciipt jac anpiuallv by the Ubrary Committee ih are equitable reo! Ss, and mut uepartinents fo e635) Print Books. Donated materials are evaluated against the same setectt: sad with the collection scope. may be acrid fos Righdemaad tith ed on tire ibe published wihin the last flve yenrs, except f 2 aeciined ion crftaria and may cA al dation Hat xis and Ratedials mu: stories! referer efevence t Biloty is given t authoritative publishers, peerreviewed works, and awantwinring tves: fab titles reconianenstad by feculty and aligned with cour ment Polley Etleckve june 2025 snip Vale Cailege Library Collection Des"
    },
    {
        "image": "collectionpolicy1_synth_9_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "LIBRARY NEN JAMIN VILLE CS COLLECTION DEVELOPMENT POLICY June 2025 POLICY STATEMENT and ce fur the aequisivon, maintenant Be vetopenant Policy provides Qu io te sunnort the ar aden. 1H NE0S development of rascuccns signed Tis Coit wosding cf itrety molen Lenjnnin Vile Cefiege Tha pulley enstuas sysiemalie davis nstizutionsl goals ond! aes standards and rusearch i 4 PURPOSE G7 THE COLLECTION Purpose oft “penta integmatin bec 1 otcey laren tag diverse amas 26 Sfactiate se sy, stuter a and patos de aces 19! ure balanced collec gations tractional POERAMS oF ro levels tinyouss evaive! aeative actinitign fae: hay researc an Tied of oturiy tacufty ior Febonces so usage Statist es oh rent ant aut ocitatire tt apliners Based tio geerat across dive roconnt Suppot ingutntion 2c vaderpackane ant 9 Maintain telavance though oon ered yt neue tion weeding ais redacement of outcatet materials 2. ACQUISITIONS BULGET 2 erated 15 appt caimately 183i cpscipions ang mulumedia Library Committee it The annual ouage! for worry acyUrstO”: across print materials qigcirome resuurees, rons Budgel detioubon 1S reviewed ant ents 10 EN s3tly by aquitacie resource all cow congutlailon wan academic dep 3. PRINT RGOKS in ana may oe Cecttnrd evaluated agains! the same selvcten cite ‘not alignod aith ihe collection 009 1 be acquiced tor tagh conan pubbaned aithin the ast five yeas, eNoept ary teased cat coresaations al classic teats ond natncal retarances e preterence tor authantatere PuDkshers, pase given ta wiles vecomanarehet by tt reviewed works, anid anwaed winrar ties vile arc) athe ite oo8! Posey {Eerie bemarin Vile College bras Collachen Deveion er"
    },
    {
        "image": "collectionpolicy1_synth_9_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "SENJAMIN VILLE COLLEGE LIBRARY commendations. Support the instnaciional programs underyratiale and yrachuate lreats. Maintain fe vance through conta evaluation, weeding and replacement uf cutdaied Piateriats ans curicula otfared by the institution acroas 2 acQuISMONS BUDGET Pree Socks Dapince! al Se evokusted against the sane selection citera and may be a ct aligned wit the cotsction scene Sectnad i Copies nity Se scoured fo high damond thes based on crcioten dat, jiornls mast be pusished within the ast five your, excect for can Nislorcal references texts Pesleronce for suthodtatve puttshers, peor reviewed was, unt Wes Priority is given to ties fevomananndad ty faculty and aligned with cnurse syitaht Bervamin Vite Cotege Liar Coterton Development Potcy 1% ay"
    },
    {
        "image": "collectionpolicy1_synth_9_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "BENJAMIN VALE COLLEGE UBRAR COLLECTION DEVELOPMENT POLICY hate 2025 POLICY STATEMENT “his Cotaction Devetoamant Poliey weeding of Every matatiais to Banismin Vite Goi wath ine! vidas quidance for the acqpisition, maintenance. Support the academic programs and regasec Hiegs. The policy enewae sysiematk: develope a goals andi accreditation standartis, ant Riatioae of ment of esscuces aligned 1. PURPOSE CF THE COLLECTION Purpose af the Collection Foatar information literacy sei ffelor a lnwtring through diverse formats and cemssitle Resour; * Facilitae scholarly resmerch and creative axtivites of faculty, students, and institut! partners Provides access te current ard avthoritathve i Ennurt balencad calluction great mcommeydadions, Support the testasctional progams and curioy ancergraduate and graduate tovets Bisinialn relevance through continunus evaduation weeding, and repiacament materials ricm mation resources in aif fisics 8 discipiinas based on usage statin stacy, Hc and faculty 0 offered by the institution acroas dated ACGUISFIONS suDGEr Acquisitions Suaget The annual bodget tor itary acquisitions 1s approximate 1 559 018, atincated across print mat h Chals, sectranic resources, Subscriptions, and muttimedia <ofeclions. Budget distioution is reviewed annuaty By the Lorary Commitiee in consutation with academic departments tc ensure ‘equitatie rescurce atiocation, 2 BRUNT 8ocEs Peing Basics Donstedt wiateriais aro evalunted aguinst the sane SHoction cHtela and may be Seclined if fot algned with the collection oc iMiple copies may be acquired for high emand ties hesed on C Materials must be pabliched within the last sstorinal references Preference for auth Paton insulation data, pit for cisesic txts ard worttative publishers, prer reviewed wks, and aweid winning tities is given to titles recommenda ty i Sy and aSigeed with course syaty, Benvamin Vite Cotege Uorary Conection De Beclive June 2925"
    },
    {
        "image": "collectionpolicy2_synth_10_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "JOHN VILLE COMMUNITY QE SRA Library COLLECTION DEVELOPMENT POLICY This policy establishes the framework for acquiting, and maintaining library materials to support the academic mission and research goals of the institution. ensures balanced collechon growth aligned wah curricular demands, accreditation standards, and emerging echotaily trends Be SELECTION CRITERIA Donated mat Selection emphs a, POSE Materials must directly support the curriculum and aliga with institutions} learn >» Budget aliacation is raviewed arinualy im consuilation wih the Library Advisory Com Progiy is given te resources recommended by faculty and academic departments 4 2. INSTRUCTION RESOURCES Textbooks and supplementary readings fisted in official course eytiabl receive highest priorty labors For neww programs ace acquired at teast one sementer priar to program launch Foreign ianguage matetvis arm actulred to suspert langusge deparinents end intmnational Multimedia reso sing OVDs, nleanting madis, and interactive twols ara selected to enhance leeming Mutiinie eapias are acquired for high enrulimerit courmes based on usage statistics and faculty mauasis 1aily guides, test proparaiton materials, and carear development :esovinee mre avoitubie far studant muccese. Open edicatione! reauues (OER) are promoted enc integrated whee quailty and relevance are verified. Facuity aro encowaeged to subvait acquisition esquosts vie the lbrany portal at lawst 62 days in advance. Comse reseces art undated ach semsater in coudtinstion with deparimant heads and couse Instruciors, nsdies programs 2 2 RESEARCH MATERIALS conference proceedings, and spaclalized databases is core or niche or varetyused materials, The library suppots. ite the dissemination of tacutty schokaeships Research nolisctions anghasize peorevinwed jearnats, sicclotlngs. tnterBbrazy Ina sppisment holdings span scones inidatives and inelitutional reswsttosies to mae nes"
    },
    {
        "image": "collectionpolicy2_synth_10_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "JOHN VILLE COMMUNITY _ Library COLLEGE LIBRARY ON DEVELOPMENT POLICY senor for selecting, accessing, and Man rng liorary materials 10 of the intmutic itensures balanced c Hector ads, and emerging scholay Hends COLLECT! ine {13 sion and research goa radiation This policy establishes support the academic growth aligned with curricular SELECTION CRITERIA ce criteria a3 purchases Rema owed content, and awardwinriis works. ag auticomnes. tee inst the 2 publishers, peereyl renee ano align with institabonal earn station wth tre Lincary Advisory Cores vy and acerernie departments. Donated materats ere Selection rpNasiZes authori Maleriais must directly suDpOr the cu «Budget allocation is 7 annwally #8 C Priority ded by f AL RESOURCES 1 official COUTEE 5: one 20 B42. INSTRUCT 10M: pramtary ‘eK sebi veceive highest pretty gram launch. ral shuts programms, leaving. i st tee 9 suppnit ianguage dece tin Foraign tong reneaticnent curses based of 529° sarge devalapment i j winere quality xd role wy portal at inaat 68 days Nuttipie copies 2 Study guides, test 5 department heat encouraged 1 gre updated each Berm jection wa Faculty 2 Course reserves cin coal SH MATERIALS: in cora ots jon emphasize bat ices suppiament hots rarely emination of fecul ings for riche jy seholarsbip. tarlibrary oar, auives ans instil"
    },
    {
        "image": "collectionpolicy2_synth_10_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "JOHN VILLE COMMUNITY 4 COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY policy establishes port the growth aligned wit of the institution. Ite: jon stancar fs SELECTION ©) Donated maierials are evaluated agains ne criteria as purchased items ion emp: 5 auth iitaiive pablisne s, peer reviewed! con fine curriculum ar nwt instil Materi Budge Prior 2ate INSTRUCTIONAL + Textboot «Mate oF inter sig language matariais sre a Multimedia resource: DYDs, steaming med tools are selse Muitiple coples are acquired for high enrollment courses based on usage statistics ond tacuity requests. s, tes tion metetials, and career dev 8 aie ovallatle for student su ducati ality and relevance eve ver si reseui R) are promote: anulty are encouraged te submit acquisition requests via the library portal af least G0 days in advance, Courne are undated eauh semester in dings, and speci ely used materi income 8 for niche or is. The fbr supports dissemination of faculty sch"
    },
    {
        "image": "collectionpolicy2_synth_10_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "JOHN VILLE COMMUNITY COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy establishes the framework for selecting, acquiring, and maintaining library materials to ‘support the academic mission and research goals of the institution. It ensures balanced collection growth aligned with curricular demands, accreditation standards, and emerging scholarly trends. 1. SELECTION CRITERIA Donated materials are evaluated against the same criteria as purchased items. Selection emphasizes authoritative publishers, peer reviewed content, and award winning works. «+ Materials must directly support the curriculum and align with institutional learning outcomes, Budget allocation is reviewed annually in consultation with the Library Advisory Committee. Priority is given to resources recommended by faculty and academic departments. 1 1. INSTRUCTIONAL RESOURCES Textbooks and supplementary readings listed in official course syllabi receive highest priority. Materials for new programs are acquired at least one semester prior to program launch. Foreign language materials are acquired to support language departments and Intemational studies programs. Multimedia resources including DVDs, streaming media, and interactive tools are selected to enhance leaming Multiple copies are acquired for high enrollment courses based on usage statistics and faculty requests. Study guides, test preparation materials, and career development resources are available for student success, Open educational resources (OER) are promoted and integrated where quality and relevance are verified Faculty are encouraged to submit acquisition requests via the library portal at least 60 days in advance. «+ Course reserves are updated each semester in coordination with department heads and course instructors, 1 2 RESEARCH MATERIALS Research collections emphasize peer reviewed journals, conference proceedings, and specialized databases in core disciplines. Interibrary loan services supplement holdings for niche or rarely used materials. The library supports open access initiatives and institutional repositories to maximize the dissemination of faculty scholarship September 2025"
    },
    {
        "image": "collectionpolicy2_synth_10_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "JOHN VILLE COMMUNITY 7 COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy establishes the Suppert the academic mission and research growth aligned with curricular demaneis, ace brary materia ISurES halaniced cole Stardands, and emerging senoiay a. SELECTION CRITEE MEA ERA ing works ourcones y Advisory Committee lowed content, and award w! and align with E ym consultation with the Priority is given to resources fecomimended by faculty and academic deparimonts 4h INSTRUCTIONAL RESOURCES Texibonks and s: ino dings bs acquired at leas acquired to sug resouces incheting DVDs Multiple copies ave aun Study guisies, test pres. Gpen oducational re Faculty ore oy international ate cools are seiacted tee) ey meds, and inter ‘ollinent roursas be rvatadais, and cai nea for high: sed un Usage sietistics and feculy requests Course reser 2 RESEARCH MATERIALS earch ¢; ations emphasize peorreviawad discipines, intetiikary ian services supsiom OPA acceds inistives and Institution! 1 S, conference piccecuitigs, and specialized astaba: Rolin for che ora corte to msi is. The library 51 of tacully scholar mber 2025"
    },
    {
        "image": "collectionpolicy2_synth_1_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "COLLEEN VILLE STATE COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY YE ScquIting, and mamntaiung library materials to enaures balanced collec tion mission anid research goals of the ins ar demands, accreditation standat¢ cholarly trends, 2. ACQUISITION GUIDELINES Jed annually =5 authontative guibl rewew and awa: winning works Priority ss giver oes recommended by facuily and ac ete Is aie avait 1c deporte Donated maten unst the san tena 2 purchased teins COURSE RELATED MATERIALS: ft covwer de eciiabie for stugent sus in cociinatios P department hearts andl course instructors faced with coment versions as budget permits program: end suppiementar language materials aitenents and international st avallnbisiy 0” high ceculation d xd whee ligensing allows simuttangous multiuser ac at least 69 days in a: ed where quahly and relevance BAZ RESEARCH MATERIALS: as and rare ra Served’ and digitized where possible to taciitale recite itinegaahie lect spcutisty to assist baih nowee and demu dnpartment ty identi gaps and stergtien cot"
    },
    {
        "image": "collectionpolicy2_synth_1_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "COLLEEN VILLE STATE yee ges SOLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY fe trarneenerk for selecting, acting, ane maintaining BTY As serials search goals of fe ewstiuton b ensures balanced CREST saris, anc emesging scholarly tends, i poliny establishes 4 Ladernic MISSION a growth airgreed wih currcatat demnarits ACQUISITION GUIDELINES Library Advisary Gomenit wed anwally in consutation with the avin Weak. Budget aocation is review Selection emphasizes authortiafive puiaishers, peer 1 s jewed content, 20d * pronty ig given to rescaurces recommeded by faculty and academic departments Donatad materiais are evaiuated against the same crterin 3 purchased tems HE -RELAT Study guides, test preparation m: Course reservne are updated a0 Caadiated catty wes Hhuinmedia resources iveluding EVD, streonting media, tele 1 ators for now programs are acquired at feast one Semest7e BIO Textbooks and supplementary readke I ourae syilald rec priodtiy Forign eztreents and international szudieg programs. paeanrve colections ave mointainnc fr matacats wa lined eveisii ce high clrendation demand Ble! creteired whore Vcensing lions vinnAtanmcts mulher A636 chvautaned to subrit ascuisition rents via the Hany pane! inast 69 days in advance: ay and relevance are vanes. ara precoated ard intiagsstedt were ust 18+ COURS MATERIALS eriats, snd caveat development repources are avaiabie far star 8! ResR. vrpavdinedien th eepextenent reweds aad course inasuctors deutiget pent, acters te enhance earning cemtestat add aret replaged vat cuzent weeatons aS tive toate art sel to pagrams laurels sitions are systems ARCH MATERIALS: ves, nnd agen moneciats ane pressor and \\gSizor wham poseitas t faciilate cemots thy subject apaciatats te assist both novice ans experanced ts io aontty gave are strenginen ceiectian dapit 2. RESE Peimacy sources, stotical a7ch ‘acousy, Research guides and Nintiographies are Ob win acadernic donates Qetper 2)"
    },
    {
        "image": "collectionpolicy2_synth_1_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "Library COLLECTION DEVELOPMENT POLICY policy eotablisives the frat support tne academic missio growth aligned with curricu This work vand research go. 5» ACE F den 3. ACQUISITION GUIDELINES: uitation with the Libr shySpUN Gia FETA CAO Rs on is reviewed ann asizes authorit Budget allocati Advisory Commi career develey sources are avaliable for vent heads and cous success. dination with dep Ouidated editions replaced with cuneniv Mattie and Infaractive tools as ester prior te program launch, readings fisted in official course syltahi eceive highest a is are aca Foreign ta Hesene collection paintained f preserved and uigitized where possible to faciltats ramote by subi and experienc"
    },
    {
        "image": "collectionpolicy2_synth_1_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "STATE Y yray Librar 1g lbrary materials to slanced collection ewark tor selec mission and research goa nds, accredit INES. be WISITION GUID: the Library Advise aI ¥y in consultation viewed ar Budget allocation i mphasizes authotitalive publishers, Pee ded by aw vipwied Cont fty and academic depart election given to resources feCO™ ority nated materials are evaluat LATED MATERIALS BE CQURSER vest preparation ives ale updated 8 ace maintained tor meaterals with n demand 12 prefered whe euibentt acay the tbrery portal of sin fon requests vie ly and ielevance are veri regeared wre Faculty ae cational rest digitized where pussible t0 farsttate ch guid) nies are curated by subject S004 Gctoi"
    },
    {
        "image": "collectionpolicy2_synth_1_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "COLLEEN VILLE STATE COLLEGE LIBRARY Library COLLECTIGN DEVELOPMENT POLICY This policy est ishes th the academic miss growth signed with curr rework for selecting, acquiring, ind maintaining libiary materials to an aid research goals af the insifution. tt ensures balanced collection far demands, accreditation standards, and emerging scholarly trends ae ACS ISITION GUIDELINES Sudget allocation is reviewed annually in consultation with the Library Advisory Committer Selection emphasizes authoritative publishers, peer reviewed conient, and award winning works Prority is given to sesources recommended by faculty and academic departments. Donated materials are evaluated against the same ciiteria as purchased ilems bebo OURS Shualy quid tlon materials, and carer developrent resus Course reserves are upstated Outdstad adit Hultivadis es are aval ble for student success. ent heads avd course instructors, ns as budget peimits 2 tools ate selactod to enhance teaming h earting meus, and interact Ww programs are acquited al least books ane supplementary seattir guage materials are aca ster prior te progam ahi receive highest pricity. eg departments and Intemational studies progras ctions are rasintalned for materials with limited availabilty or high circulation demand. Electronic versions fered ethene Negus muliasser eocess. woiad and integrated where 4 a at tweet GO days tn sity and relevance ave verified 438 RESEARCH MATERIALS, Jeol specialisis to assist bo novice resents ts identity nape and aberegthan mn scadentin den ‘October 202!"
    },
    {
        "image": "collectionpolicy2_synth_2_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "STEVE VILLE COMMUNITY zi COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy establishes the framework for selecting, acquiring, and maintaining library materials to support the academic mission and research goals of the institution. It ensures balanced collection growth aligned with curricular demands, accreditation standards, and emerging scholarly trends. 1. SELECTION CRITERIA Priority is given to resources recommended by faculty and academic departments. Materials must directly support the curriculum and align with institutional learning outcomes. Budget allocation is reviewed annually in consultation with the Library Advisory Committee. Donated materials are evaluated against the same criteria as purchased items. Selection emphasizes authoritative publishers, peer reviewed content, and award winning works. 1 1. INSTRUCTIONAL RESOURCES, Outdated editions are systematically weeded and replaced with current versions as budget permits. Faculty are encouraged to submit acquisition requests via the library portal at least 60 days in advance. Electronic versions are preferred where licensing allows simultaneous multi user access. Course reserves are updated each semester in coordination with department heads and course instructors. Study guides, test preparation materials, and career development resources are available for student success. Multimedia resources including DVDs, streaming media, and interactive tools are selected to enhance learning Textbooks and supplementary readings listed in official course syllabi receive highest priority. Reserve collections are maintained for materials with limited availability or high circulation demand. 1 2 GRADUATE RESEARCH SUPPORT Electronic journals and e books are preferred for research materials due to accessibility and space considerations. Print acquisitions focus on landmark works, reference texts, and materials unavailable in digital format. The library participates in patron driven acquisition programs to ensure relevance and immediate availability. July 2025"
    },
    {
        "image": "collectionpolicy2_synth_2_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "STEVE VILLE COMMUNITY COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy establishes the framework for selecting, acquiring, and maintaining library materials to support the academic mission and research goals of the institution. It ensures balanced collection growth aligned with curricular demands, accreditation standards, and emerging scholarly trends. SELECTION CRITERIA Priority is given to resources recommended by faculty and academic departments Materials must directly support the curriculum and align with institutional learning outcomes. Budget allocation is reviewed annually in consultation with the Library Advisory Committee. Donated materials are evaluated against the same criteria as purchased items. Selection emphasizes authoritative publishers, peer reviewed content, and award winning works 1 4. INSTRUCTIONAL RESOURCES Outdated editions are systematically weeded and replaced with current versions as budget permits. Faculty are encouraged to submit acquisition requests via the library portal at least 60 days in advance. Electronic versions are preferred where licensing allows simultaneous multi user access. Course reserves are updated each semester in coordination with department heads and course instructors. Study guides, test preparation materials, and career development resources are available for student success. Multimedia resources including DVDs, streaming media, and interactive tools are selected to enhance learning. Textbooks and supplementary readings listed in official course syllabi receive highest priority Reserve collections are maintained for materials with limited availability or high circulation demand. 1 2 GRADUATE RESEARCH SUPPORT Electronic journals and e books are preferred for research materials due to accessibility and space considerations. Print acquisitions focus on landmark works, reference texts, and materials unavailable in digital format. The library participates in patron driven acquisition programs to ensure relevance and immediate availability July 2025"
    },
    {
        "image": "collectionpolicy2_synth_2_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "STEVE VILLE COMMUNITY COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy establishes the framework for selecting, acquiring, and maintaining library materials to support the academic mission and research goals of the institution. It ensures balanced collection growth aligned with curricular demands, accreditation standards, and emerging scholarly trends. SELECTION CRITERIA Priority is given to resources recommended by faculty and academic departments Materials must directly support the curriculum and align with institutional learning outcomes. Budget allocation is reviewed annually in consultation with the Library Advisory Committee. Donated materials are evaluated against the same criteria as purchased items. Selection emphasizes authoritative publishers, peer reviewed content, and award winning works 1 4. INSTRUCTIONAL RESOURCES Outdated editions are systematically weeded and replaced with current versions as budget permits. Faculty are encouraged to submit acquisition requests via the library portal at least 60 days in advance. Electronic versions are preferred where licensing allows simultaneous multi user access. Course reserves are updated each semester in coordination with department heads and course instructors. Study guides, test preparation materials, and career development resources are available for student success Multimedia resources including DVDs, streaming media, and interactive tools are selected to enhance learning Textbooks and supplementary readings listed in official course syllabi receive highest priority Reserve collections are maintained for materials with limited availability or high circulation demand. 1 2 GRADUATE RESEARCH SUPPORT Electronic journals and e books are preferred for research materials due to accessibility and space considerations. Print acquisitions focus on landmark works, reference texts, and materials unavailable in digital format. The library participates in patron driven acquisition programs to ensure relevance and immediate availability July 2025"
    },
    {
        "image": "collectionpolicy2_synth_2_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "STEVE VILLE COMMUNITY E LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy establishes the frarnework for selecting, acquiring, end maintaining library materials to suinpart the academic mission and research goais of the institution ft ensures balanced collection accreditation standards, and emerging scholarly trends owth alignes! with fe SELECTION CRIT nd acide Priority is given to f Maierials must directly su Budget allocat Donated materials are ev ection emphasizes auth se amended by faculty mic depariment port the curriovlum and align with irestitutional feat ation with the Library Advis criteria az purchased tems sr reviewed content, anc asarchwinr works: obs INSTRUCTIONAL RESOUR: i eultions ave systeniatically weeded and replaced witt Jons as duciget perry st $0 days in Out Faculty are encouraged to subir advane Electronic versions are preferred where licensing ach sermaster in ni neads and cour 2 simultaneous muitiix ecination with departm: liable for student development resau nals are eelected to treaming madia, and interactive te hest priority demand. or high cicutat! reference texts, 2nd materiais unavailable in mnediste duly 2628,"
    },
    {
        "image": "collectionpolicy2_synth_2_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "STEVE VILLE COMMUNITY COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY 1. pos 1 2 GRADUATE RESEARCH SUPPORT Electronic joumals and e books are preferred for research Print acquisitions focus on landmark Participates in patron driven acquisiti materials due to accessibility and space considerations. works, reference texts, and m: iaterials il July 2025"
    },
    {
        "image": "collectionpolicy2_synth_3_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "DAVID VILLE UNIVERSITY os Pena Library COLLECTION DEVELOPMENT POLICY with curricular rem: nds, accremiation standards, and emerging scholarly ends, 3. ACQUISITION GUIDELINES Selecton eraphasizes authoritative publishers, peer reviewed content, and award wineing weeks. Bixiget allocation is seviewed anrarally in consultation with the Littary Advisory Committee, Donated materials ate evalvated against the same criteria as ca ad Hers, ority given to resources recommended by faculty and academic desariments, Materials must dieectly suppor the curriculum and align with institudorat learning outcomes 44s INSTRUCTIONAL RESOURCES laterals for new programs are acquired at least one sem 28 including DV! ster prion program launch, media, and interactive tools are selected to enhance learning. seme colections are mvainiained tor materials with trted availablity or high cxculation demand Study guides, test prepara success Course reserves 2 instructors Foreign language materials area Progra, Faculty are encouraged ta submit acquisition requ advance. Electronic versions are prefered where beensing alows simular: piment resources are avaiable for student lated each semester in coordination with des arene h ds and course qqited $9 suppnet tanguage departments and intematonal studies sts via the lawary por sous mull user access, B 2 SCHOLARLY RESOURDES Electronic js umels ated ebocks are proferind for easzarch mater lity anal space considarations, Dequeitions Focus on lancinark works, roferance texts, ant matavials unavatabia in dtl oemst, The ibrry ‘pales. pabordiven acquisition programs ts enaure ralevence and immediate valabitty"
    },
    {
        "image": "collectionpolicy2_synth_3_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "DAVID VILLE UNIVERSITY P LIBRARY Library COLLECTION DEVELOPMENT POLICY 4 1. INSTRUCTIONAL RESOURCES Materials for new programs are acquired at least one Semester prior to program launch. Multimedia resources including DVDs, streaming Media, and interactive tools are selected to enhance learning 'als, and career development resources are available for student success Course reserves are updated each semester in coordination with department heads and course instructors. Foreign language materials are acquired to support language departments and international studies programs Faculty are encouraged to submit acquisition requests via the library portal at least 60 days in advance. Electronic versions are preferred where licensing allows simultaneous multi user access. 1 2 SCHOLARLY RESOURCES July 2025"
    },
    {
        "image": "collectionpolicy2_synth_3_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "DAVID VILLE UNIVERSITY LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy establishes the framework for selecting, acquiring, and maintaining library materials to support the academic mission and research goals of the institution. It ensures balanced collection growth aligned with curricular demands, accreditation standards, and emerging scholarly trends. 1. ACQUISITION GUIDELINES Selection emphasizes authoritative publishers, peer reviewed content, and award winning works Budget allocation is reviewed annually in consultation with the Library Advisory Committee. Donated materials are evaluated against the same criteria as purchased items. Priority is given to resources recommended by faculty and academic departments Materials must directly support the curriculum and align with institutional learning outcomes. 1 1. INSTRUCTIONAL RESOURCES Materials for new programs are acquired at least one semester prior to program launch. Multimedia resources including DVDs, streaming media, and interactive tools are selected to ‘enhance learning Reserve collections are maintained for materials with limited availability or high circulation demand. Study guides, test preparation materials, and career development resources are available for student success Course reserves are updated each semester in coordination with department heads and course instructors. Foreign language materials are acquired to support language departments and international studies programs Faculty are encouraged to submit acquisition requests via the library portal at least 60 days in advance. Electronic versions are preferred where licensing allows simultaneous multi user access. 1 2 SCHOLARLY RESOURCES Electronic journals and e books are preferred for research materials due to accessibility and space considerations. Print acquisitions focus on landmark works, reference texts, and materials unavailable in digital format. The library participates in patron driven acquisition programs to ensure relevance and immediate availability July 2025"
    },
    {
        "image": "collectionpolicy2_synth_3_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "DAVID VILLE UNIVERSITY LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy establishes the framework for selecting, acquiring, and maintaining library materials to Support the academic mission and research goals of the institution. It ensures balanced collection growth aligned with curricular demands, accreditation standards, and emerging scholarly trends. ACQUISITION GUIDELINES Selection emphasizes authoritative publishers, peer reviewed content, and award winning works. Budget allocation is reviewed annually in consultation with the Library Advisory Committee Donated materials are evaluated against the same criteria as purchased items. Priority is given to resources recommended by faculty and academic departments Materials must directly support the curriculum and align with institutional learning outcomes. 1 1. INSTRUCTIONAL RESOURCES Materials for new programs are acquired at least one semester prior to program launch Multimedia resources including DVDs, streaming media, and interactive tools are selected to. enhance learning Reserve collections are maintained for materials with limited availability or high circulation demand. Study guides, test preparation materials, and career development resources are available for student Course reserves are updated each semester in coordination with department heads and course instructors. Foreign language materials are acquired to support language departments and international studies programs Faculty are encouraged to submit acquisition requests via the library portal at least 60 days in advance. Electronic versions are preferred where licensing allows simultaneous multi user access. 1 2 SCHOLARLY RESOURCES Electronic journals and e books are preferred for research materials due to accessibility and space considerations. Print acquisitions focus on landmark works, reference texts, and materials unavailable in digital format. The library Participates in patron driven acquisition programs to ensure relevance and immediate availability July 2025"
    },
    {
        "image": "collectionpolicy2_synth_3_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "DAVID VILLE UNIVERSITY 7 LIBRARY Library COLLECTION DEVELOPMENT POLICY the framework for setectng, aequiing, nd itensures balanced coflecton ‘This poticy establishes support the acadernic ‘mission and reseerch goals of the growth aligned wit: curricular demands. ‘accreditation standards, and emerging scholarly trends 2. ACQUISITION GUIDELINES Jontent, and award winning works. ves authottative pubishers, peer reviewed Sth the Library Advisory Comenities Selection «= Budget allocation s reviewed anwwally “Donated matenals ere evaluated fhe same criteva as purchased ners Due ie gested Oy ean «+ Materials must drecty support the cumeulum ‘and alge with institutional eaening outcomes. 1 1. INSTRUCTIONAL RESOURCES Matenals for pew programs ye acquired at east one semester prior to progsaen launch, Mattimedia resOxkces including DVDs, svezring media, and interactne tooks are selected to enhance learning are maintained for materials with ited avaiadity or high circulaton demane, jaitabie for student vats ord career development rescuNces sre 2 ter in coordination with depariment Reserve cotections Study guides, fest preparation #n success. SUCCESS. eserves mre updated each somes mmestractors: Fran language materia are acqured 1 2 cequesis via te brary poral atleast 09 aye programs. Faculty ve encouraged to submit scquisivan advance. Edactronic. versions are preferred where ficensing: allows simultaneous muty user access. £.2 SCHOLARLY RESOURCES hectuonde ours and o vacke ora orale? Pant acquisitions focus cn isnameti works, reference con oquasition programs 19 67s foc resaarch matvins due te accassibty and space considerations. ey and mates unavasabie in tal fara The ieeary vtovancee and immediate evaibiehy uaty 2025"
    },
    {
        "image": "collectionpolicy2_synth_4_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "JENNIFER VILLE STATE COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy establishes the framework for selecting, acquiring, and maintaining library materials to ‘support the academic mission and research goals of the institution. It ensures balanced collection growth aligned with curricular demands, accreditation standards, and emerging scholarly trends. 1. ACQUISITION GUIDELINES Donated materials are evaluated against the same criteria as purchased items. Selection emphasizes authoritative publishers, peer reviewed content, and award winning works. Materials must directly support the curriculum and align with institutional learning outcomes. Priority is given to resources recommended by faculty and academic departments. 1 1+ ACADEMIC PROGRAM SUPPORT Electronic versions are preferred where licensing allows simultaneous multi user access. Faculty are encouraged to submit acquisition requests via the library portal at least 60 days in advance. Course reserves are updated each semester in coordination with department heads and course instructors. Open educational resources (OER) are promoted and integrated where quality and relevance are verified Materials for new programs are acquired at least one semester prior to program launch. Textbooks and supplementary readings listed in official course syllabi receive highest priority. Reserve collections are maintained for materials with limited availability or high circulation demand. Multiple copies are acquired for high enrollment courses based on usage statistics and faculty requests. Foreign language materials are acquired to support language departments and intemational studies programs. Multimedia resources including DVDs, streaming media, and interactive tools are selected to enhance leaming, Outdated editions are systematically weeded and replaced with current versions as budget permits. 1 2 RESEARCH MATERIALS Electronic journals and e books are preferred for research materials due to accessibility and space considerations Print acquisitions focus on landmark works, reference texts, and materials unavailable in digital format. The library participates in patron driven acquisition programs to ensure relevance and immediate availability, April 2025,"
    },
    {
        "image": "collectionpolicy2_synth_4_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "JENNIFER VILLE STATE Library COLLEGE LIBRARY N DEVELOPMENT POLICY and maintaining library materials t© tion. It ensures balanced collection 1g scholarly trends. COLLECTIO ‘This policy establishes the framework for selecting, acquifing support the academic mission and research goals of the institu growth aligned with curricular vemands, accreditation standards, and emerai 1. ACQUISITION GUIDELINES inst the same criteria as purchased items viewed content, and award winning works wutcomes. rn with institutional learning O yartments. jals are evaluated agai coritative publishers, peer te port the curriculum and alg recommended by facuity and academic dep Donated mater Selection emphasizes auth: Materials must directly SUP Priority is given to resources M SUPPORT re licensing allows simul sts via the dination with department heads an ed where quality and relevance 2 launch 4 4. ACADEMIC PROGRAI re preferred whet fed to submit acquisition requ: ed each semester in coor (OER) are promoted and integrat acquired atleast one semester prior to Progra i sings listed in offical course syllabi recely® highest priority Timited availabilty of high eeulation demand e pased on usage statistics and faculty requests ‘ge departments and intermational stusles programs “interactive tools are selected to enhance leat\" current versions as budget permits multi user access days in advance 1d course instructors. re verified Electronic versions a aneous Faculty are encourag ‘ibrary portal at least 60 Course reserves are updat Open educational resources Materials for new programs ate «Textbooks and supplementary 1834 «Reserve collections are maintained for materials with Multiple copies are acquired for high enrollment course’ \"Foreign language materials are acquired to support languat utimedia resources including DVDs, streaming media, ani Gutdated editions are systematically weeded and replaced with RESEARCH MATERIALS books are preferred f landmark works, ref jsition programs to ensure ind space considerations aterials due to accessibility a digital format. The library Is unavailable in J immediate availability for research Mi ference texts. and material relevance an Electronic journals and e Print acquisitions focus on participates in patron sfiven acqu April 2025"
    },
    {
        "image": "collectionpolicy2_synth_4_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "JENNIFER VILLE STATE COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy establishes the framework for selecting, acquinng, and maintaining library matenials to Support the academic mission and research goals of the institution It ensures balanced collection growth aligned with curncular demands, accreditaton standards, and emerging scholarly trends 1. ACQUISITION GUIDELINES Donated matenals are evaluated against the same criteria as purchased items Selection emphasizes authoritative publishers, peer reviewed content, and award winning works Materials must directly support the curnculum and algn with institutional learning outcomes Phony 1s given to resources recommended by faculty and academic departments 1 1. ACADEMIC PROGRAM SUPPORT Electronic versions are preferred where licensing allows simultaneous multi user access Faculty are encouraged to submit acquisition requests via the library portal at least 60 days in advance Course reserves are updated each semester in coordination with department heads and course instructors Open educational resources (OER) are promoted and integrated where quality and relevance are verified Materials for new programs are acquired at least one semester prior to program launch Textbooks and supplementary readings listed in official course syllabi receive highest priority Reserve collections are maintained for materials with limited availability or high circulation demand Multiple copies are acquired for high enrollment courses based on usage statistics and faculty requests Foreign language materials are acquired to support language departments and intemational studies programs Multimedia resources including DVDs. streaming media. and interactive tools are selected to enhance learning Outdated editions are systematically weeded and replaced with current versions as budget permits 1 2 RESEARCH MATERIALS Electronic journals and e books are preferred for research materials due to accessibility and space considerations Print acquisitions focus on landmark works. reference texts. and materials unavailable in digital format. The library participates in patron driven acquisition programs to ensure relevance and immediate availability Apnil 2025"
    },
    {
        "image": "collectionpolicy2_synth_4_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "JENNIFER VILLE STATE COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY 1. ACQUISITION GUIDELINES «Sonate materials are evakated against the same criteria as purchased tems Selection emphasizes authoritative publishers, Peer reviewed cx 1 2 RESEARCH MATERIALS Flectronicjounals and ebooks are prefered for research materials due Print acquisitions focus ronaccrark works, reference texts, and materials unavaabe in gta eon The library Participates in patron criven acquisition programs to ensure rele April 2025"
    },
    {
        "image": "collectionpolicy2_synth_4_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "JENNIFER VILLE STATE _ COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy estabishe: \"8, ACguTING, and mainta: Subpot the academic mission and research goals of the inst growth aligned with currie tation standards ing library materi ensites balanced emerging scholarly ection nds. a. ACQUISITION GUIDEUIN vahiated against t authontative publishers Uppnt th ne crtena as purchased eer reviewed Cont ent, ond awardesenin Srnculutey and alan with institutions 2 FesOUICES FeCoInmended by S given te facuily and academic departments FE ACADEMiC: PR RAM SUPPORT nic versions, are pre 2cus ru -Go8S1S Via the bear user access, ly ate encouraged port ‘sti in Coordination with departinant he ees (OER! are promel Rdotetiats tor neaw programs Course resem to subenit acquisition a 1 EO days in advance are up Open educaifonal rase “ads and course stmuciass ually and relevance are vert oF 10. program faunich, st one semester Textbooks ard sunplemer sive highest priority NS. ee 7 ed avallahitity of sh circulation d talistics and Maitimedtio teens studies programs Outdated 18 enhance ie tematioaily weeded and rang replaced with 1332 poemity ESEARCH MATCRIALS ‘ecivonis jonas and e. Print ac bs due to oe ate preteced for reseael: n focus on tandmark works, rel Paticipates in patrontev fbiity and space considerations silabe in di ais una al format sition programs to a iibrary ure relevance and jen ciate avaitsbility"
    },
    {
        "image": "collectionpolicy2_synth_5_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "ERIC VILLE STATE COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY establishes the framework for selecting, acd nd researe lar demands, acci TERIAL ACQUISINION STANDARDS Selection emphasizes authoritative publisher reviewed and award w ne aiocation is reviewed annually in consult ation with the Library Advisory Committee. erials are eval. 4 3. INSTRUCT! INAL RESOURCES Mate he ed with current versions as budget pe ighest pric ents and international studies mis are is for new proc Ouidated quires pester prior te program faun 18 are systematically weeded and repi supplementary nd faculty ate preferred where g cilows simuitaneous mul 2) are promoted and integrated where quali Oper educational i irces (OF vertied 2 maintawed for tetas managen supports vom! ne, egnensig, and"
    },
    {
        "image": "collectionpolicy2_synth_5_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "ERIC VILLE STATE COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy establishes the framework for selecting, acquiring, and maintaining library materials to support the academic mission and research goals of the institution. It ensures balanced collection growth aligned with curricular demands, accreditation standards, and emerging scholarly trends. 1. MATERIAL ACQUISITION STANDARDS Selection emphasizes authoritative publishers, peer reviewed content, and award winning works Budget allocation is reviewed annually in consultation with the Library Advisory Committee. Donated materials are evaluated against the same criteria as purchased items. 1 1. INSTRUCTIONAL RESOURCES Materials for new programs are acquired at least one semester prior to program launch. Outdated editions are systematically weeded and replaced with current versions as budget permits. Textbooks and supplementary readings listed in official course syllabi receive highest priority. Foreign language materials are acquired to support language departments and international studies programs. Multiple copies are acquired for high enrollment courses based on usage statistics and faculty requests. Electronic versions are preferred where licensing allows simultaneous multi user access. Open educational resources (OER) are promoted and integrated where quality and relevance are verified Reserve collections are maintained for materials with limited availability or high circulation demand. Multimedia resources including DVDs, streaming media, and interactive tools are selected to enhance learning 1 2 RESEARCH MATERIALS Research data management services are provided to assist faculty and students in organizing, preserving, and sharing datasets. The [Brary supports compiance with funding agency mandates for open data and research transparency. Specialized databases in law, ‘medicine, engineering, and sciences are maintained to meet professional accreditation standards, March 2025"
    },
    {
        "image": "collectionpolicy2_synth_5_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "ERIC VILLE STATE COLLEGE LIBRARY Library COLLECTION DEVELOP PMENT POLICY aining Worary ater ned culaction ag scholarly trends. syework for setectng, vais el thes ens STON STANDARDS he gent, ad award ginning works. sens. authoritative publishers, peer reviewed yy in consult sainst the same criteria as pL Selection ent Budget allocate sert materials Library Ach jon wath aed RESOURCES A Materials tor new pre Quidated editions are systeniaucaily wee vexthooks anc cuporementary rescings ted Is oFTEEH 6 are acquired to 5 lage Gepariments ae are preferred whi ‘outers (OER) are promoted and negra are maintained fr coteriate wih limsied availabilty or high ecules on dems and interactive 100 lected te ing medi Muhinedi anhance learning ARCH 3 6% RESE research sata maragemast 2¢ mugone, eng nets, The sy are statent i organzng greverving, ane anny dats sm ysnaparensy, Soecsaiees dateboees"
    },
    {
        "image": "collectionpolicy2_synth_5_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "ERIC VILLE STATE COLLEGE LIBRAR’ COLLECTION DE 4d. MATERIAL ACQUISITION selecton emphasizes authoritative pubiahers is reviewed annually 1% CONS olyated against the same crhena 3% Budget atiocation Donated materials are ev aL. INSTRUCTIONAL RESOU! Materials for pew programs are acquised at least ally weeded and replaced with Cu programs. Mitite copies are accused 10\" Tih requests. Electronic versions are prefer Open educational resources verited We ection are marines for materois wih Se i Dis, streaming mecia, and ineractw? Muttinadia resources ne! enhance learning. 1 2 RESEARCH MATERIALS eovvices ate proreed 10 208et Resemc® oats ooops wih ture MORASS erary sports rregnawers, enc ences are maceaen we odor, red where licensing OER) are promoted and integrated were Library VELOPMENT POLICY STANDARDS peer reviewed content, and award. winning works, citation with the Library Advisory Committee purchased tems. IRCES one semester prior to programe faunch. srrent VErSIONS BS budget permits sabi recetve highest pnority. readings tsted in official course S eparterenis and wternataona Studies veevsiment courses wased cn usage statics an fACY allows smuitaneous imuuhiiaser access. avaiabilty of high circutation demand. tools are selected te satya stot eso, RUN Od wD he ‘Spacietzes cuiabases OM, eandaten tec Gata ae ener EAPSDISTSY oe March 2025"
    },
    {
        "image": "collectionpolicy2_synth_5_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "ERIC VILLE STATE COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy establishes the framework for sele: Support the academic mission and research growth aligned with curricular demands. accr ting, acquiring, and maintaining library materials to Qoals of the institution. It ensures balanced collection editation standards. and emerging scholarly trends 1. MATERIAL ACQUISITION STANDARDS Selection emphasizes authortative publishers, peer reviewed content, and award winning works Budget allocation is reviewed annually in consultation with the. Library Advisory Committee Donated matenals are evaluated against the same criteria as purchased items. 1 1. INSTRUCTIONAL RESOURCES Materials for new programs are acquired at least one semester prior to program launch Outdated editions are systematically weeded and replaced with current versions as budget permits Textbooks and supplementary readings listed in official course syllabi receive highest priority Foreign language materials are acquired to support language departments and international studies programs Multiple copies are acquired for high enrollment courses based on usage statistics and faculty requests. Electronic versions are preferred where licensing allows simultaneous mult user access Open educational resources (OER) are promoted and integrated where quality and relevance are verified. Reserve collections are maintained for materials with limited availabilty or high circulation demand Multimedia resources including DVDs, streaming media, and interactive tools are selected to enhance learning 1 2) RESEARCH MATERIALS Research data management services are provided fo assist facuty and students organzing, preserving. ang snarng datasets. The lerary supports complance with funding agency mandates for open data and resea/ transparency Specializes catabases law medene engneerng and scences are mantaned fo meet professenal accreataten stancaras March 2025"
    },
    {
        "image": "collectionpolicy2_synth_6_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "JOSEPH VILLE STATE COLLEGE LIBRARY Library COLLECTION DEVELOPM (NT POLICY Tivs policy establishes the framework for upport the acadernic m growth aligne: 8107 and lesearch goals of the anced collection tandars, and emerging scholarly ainst the same criteria as purchased ‘921 atocation is reviewed gonually in constitation wah te Library Advises ‘orlty IS Given io resources recommended by faculty and ac. ademic deparimen Foreign language snateriats aia abe aequined fe Matetiais for new prograins fmants and Iniemational ies progten based on usage statistics a fe aeGuited at least o ER) are promsted a deme an Fey 8s via the f DuIees ine! Is, star Tonia versions ere lows simuitenecs, Textbooks and sup d in officiate: Guidaiod adit ns are systematically weeded andr ut gests le for Suuxter Stu prepatation materials, success L2 RES ARCH MATERIALS one jour int cquisitions terials unevaitall padicipaces in pat August 2025"
    },
    {
        "image": "collectionpolicy2_synth_6_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "SEPH VILLE STATE 7 iosteny VaRARy Library PMENT POLICY pracy mauerals 10 COLLECTION DEVELO and maintaning eaution. ensures cds, and emerging se exnork for selecting, aca goals of tye jkation stander sabiches the arn sipn and research gemands, aecred Tris policy support the academic rt vex with curTiculas de SELECTION CRITERIA est WG OMS sor revised content, and 2 eno orieria as purchased Bem ‘oath the Library Aabisory Cominatet arademés: depariments iadlshers, pF 2s aunhertative agamat ihe in corsuitation oy fecutty ane Selection emphasia Bonatad materiais ae ev atutes 1 udget alocation is revnewed annus Prony is given to FescuTces recammende: STRUCTIONAL RESOURCES sre acgpited fe Suppo? igh enrollment Cours seeks. fake «+ Fonaign tarcqasgee matexdals 1 Multiple copies are acquired For Maketals foe nek pDGrEMs Speen eviscationnl essences OI and intomational nxt facuity 1 poguage dapartznents ls based an usage statletic® rapitad at loast are semestor peo” 12 POAFS auch cies promeded art nngratas ware quay 22 AN aoe volves are maintain fr mates Yh Irnaeo avalubiity Tigh circulation demand Pecalty ane encouaged #6 submit accensitian O00 via the iseery portal t leant 60 days in advorsa Mutinedis res ouees Shitie, skeanming mocks, ane interoutica tots Se spigcied to enhance learn Tectonic wera. are prefered wens Hcerein A 2 stinnecnrs Hwstser ACCESS ses ana ospeuorventary readings voted in cl CO! 1e syabi cecalve highest priotty ning editions are systematically weeded 2% replaced wich current wersions preparation eaaterias, and career Hav eie os are verified oT +> Study guides, test 2 HESEARCH MAT ERIALS arch meterials dun to aecensibllty ans opoee caraiderations. 1a and ebooks ave proferrad for 1686 vad sneteriais unaesiiebe in cgital format The Bbrasy fandrnark works, reference quisition programms to ensure PeI ANEe A amunediate aveliataity Blectronie journal Pons acquistions fous of puaticipctos in pation? August 2028"
    },
    {
        "image": "collectionpolicy2_synth_6_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "JOSEPH VILLE STATE COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY the framework for selecting, acquiring, and maintaining Worary materials nd research goals of the institution. It ensures balanced collection This policy establishes ands, accreditation standards, and emerging scholarly trends. support the academic mission ai ‘growth aligned with curricular dem: 1. SELECTION CRITERIA itative publishers, peer reviewed content, and award winning works «Donated materials are evaluated against the same criteria as purchased items. Budget allocation Is reviewed annually in consultation with the Library Advisory Committee. Pronty is given to resources recommended by faculty and academic departments. Selection emphasizes authori 1 4. [NSTRUCTIONAL RESOURCES Foreign language materials are acquired to support language departments and intemational studies programs. Multiple copies are acquired for high enroliment courses based on usage statistics and faculty requests. acquired at least one semester prior to program launch. Open i quality and relevance are verified Resurve collections are maintained for materials with imited availablity of high circulation demand. \"Faculty are encouraged to submit acquisition requests via the library portal at least 60 days in advance. Multimedia resources including DVDs, streaming media, and interactive tools are selected to enhance learning, Electronic versions are preferred where licensing allows simultaneous multi user access. Textbooks and supplementary readings listed in officlal course syllabi receive highest priority Outdated editions are systematically weeded and replaced with current versions as budget permits. study guides, test preparation materials, and career development resources are available for student success 4 2 RESEARCH MATERIALS Electronic journals and e books are preferred for research materials due to accessibility and space considerations. print acquisitions focus on landmark works, reference texts, and ‘materials unavailable in digital format. The library participates in patron driven acquisition programs to ensure relevance and immediate availability, August 202"
    },
    {
        "image": "collectionpolicy2_synth_6_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "JOSEPH VILLE STATE COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLicy Roliiy establishes the tramework for selecting, ace ang, ond maintaining trary materials to Upto the academic mission and research gozls of the institution ensures balanced collect Srowth aligned with curricular demands, accreditation Stanvigeds, art emer 'y vend, tg SELECTION CRITERIA Selection enpnasizes Gonated mater Bixiget alos Prion thortative publishers, peer reviewed content, and award winning works ais Ure evaluated against the samie criteria as purchased items, Han is reviewed annually in consultation with the Liby nv 1S given to resexy SMES recommended by faculty arc academic de Bede INSTRUCTIONAL RESOURCES Foreign language materials Ruitinie copies are acep Materlais for nes Acquired fo support ranging rad (or bighveneoliert cosanes Programs are aquired at loust ge er peor fo progearn lauren Oren educationat rescurces (GER) are prometad ane integnited where quality and rolwvance are vested, Reseive cotections an mziniaind lr matexiais with ties swalibility of high circulation demand Faculty are encouraged to stint acquisition requuste via the ary p ast G0 days in arteane: Multimscta rasaveces including DVD, streaming radia, ane Sseoractive tos ove solectad 2s enhance faensing fectroriis versions 9 where licenoing atiows simultaneous multluses acceny Textbooks are supplementary raaidgs Hsted in piiaity Ouldstes editions ar fed coves sys mcnive highs Sytlematicaliy wnedad and replaced with current varelana an budget paris Tent rescincen are available for stadent susccuty apartments we internat based on usage statistics and faculty request e sem onal studies pegrams, Sfeparation matetiais, ant camer develo 12 RESEARCH MATE i Electrooic jeumals and e books ave prefovted for Print acquisitions focus on fences aticipates In catinn driver, research mae “ark WOKS, cater ale diss to accesstbitty aed ens are aortas unawaitakio in digits auisition preranis ta ensure mlevance and imenustate avatinbicy considerations ‘cemat. The library Pasgust 2025"
    },
    {
        "image": "collectionpolicy2_synth_6_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "Library OLLECTION DEVELOPMENT POLICY raumna stacey ale 1. SELECTION ORFTERIA and orate ad ttn Liwary Adtas ee sons"
    },
    {
        "image": "collectionpolicy2_synth_7_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "UIE VILLE COMMUNITY COL Library This goticy support the acariemic 1 growlh aligned with cquiring, and my: 's of the institution. Ht en trends Re MATERIAL ACQUISITION S {DARDS directly support the curicukan and align with institutional learning ary Adwisory Ci 12 a8 purchased items. consultation with the mmities, isi the same crite blishers, peer reviewed conte inrung works. commended by facuity and ax current version Woe to peogram ib of materials wilh limited availabilty oF high circulation demand ad to submit acquisition via the library portal at fa maint and Inlagrated where qu od in oft priority rational studies px and fi rain. Multiple copies are Multimed! y Fequests 2 selector fo we The Inavizine, engineering, and sciences are 1 2025"
    },
    {
        "image": "collectionpolicy2_synth_7_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "JULIE VILLE COMMUNITY 7 COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY ‘This policy establishes the framework Stipe the academic mission and raseas growth atggned wath curie #. MATE ‘AL ACQUISITION STANDARDS Materials must directly suppcat the currictdum and align with inst Budiget sttacation is reviewed annually im consuitation wit Denied miatsrists are evaluated against the same crteria ae purcivascel terre 7 Selection emphasizes authorisive publishers, ves sevkewed content. and awash ineINg works, Prony ts given to rezources recommended by facully and academic departments iuinnal earning cutcomes, the Library Advisory Committee 446 COURSE RELATED MATERIALS Out o Intec exttions ae +h i and replaced with curent versions as budget permits nS dee Bcqisrad at iewel one seminar yea ts Faculty are escouraged to subma sex Reserve sergiara taunch al of tons! 80 days in acvano od few matestats. swiths Himinad anyedinti’ ty or high cination demand reer dovelnement resources are available for st 1 lows simmuenetus mtiuser access lectronic versions ae profeedd atere heensin Oper educational cesources (OES are pramatel ate integmies where quaity ase 0 levance are vesitiad Fexthocks and suppismentany readings sted in effcial course syiati veceive tagmnt pon Foreign linguage matecais are acquired ta support leegionge Hepastinents ard eten nal sturdes erogams, Mastigie copies ane usage statistics and faculty requests el for high ansoiirent courses based ce; tocactive touls are selected ta enhance teaurit Mulinasdia resources lachading DVDs, stomarning meta, a ng 2S RESEARCH MATERIALS RISER de munsgene sareny ane roves asst HLURY a Rents seganshy, ease at woemng damasts The oenay Taniaes for Soen dats arsé research tragcarany, Soecisinas eutaosses in inv, Rains, engmaring, ard selene ave tatnined p eset Oley sin! acateetesim startaos August 2025"
    },
    {
        "image": "collectionpolicy2_synth_7_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "JULIE VILLE COMMUNITY 7 COLLEGE LIBRAR’ Library COLLECTION DEVELOPMENT POLICY This policy establishes the support the academic sr ahged with curiclar demands, accretion standards 1. MATERIAL ACQUISITION STANDARDS 1 4. COURSE RELATED MATERIALS Outdated edtions are systematcaly weeded and replace ‘August 2025"
    },
    {
        "image": "collectionpolicy2_synth_7_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "JULIE VILLE COMMUNITY RARY Library COLLEGE LIBI DEVELOPMENT POLICY .quiring, and maintaining institution. It ensures balanced collection indards, and emerging scholarly trends. COLLECTION framework for selecting, ac ion and research goals of the ands, accreditation stat This policy establishes the support the academic miss Growth aligned with curricular dem MATERIAL ACQUISITION STANDARDS «Materials must directly support the curriculum \"Budget allocation is reviewed annually (0 consultation with the Library Donated materials are evaluated against the same criteria as purchased items. Selection emphasizes authoritative publishers, peer reviewed content and award wi Priority is given to resources Tecommended by faculty and academic departments. 1. tutional leamiing outcomes. and align with insti Advisory, Committee. jinning works. RIALS weeded and replaced wit jred at least one semester prior to ‘program launch. 60 days in advance. ts via the library portal at least imited availability ‘or high circulation demand. yelopment resources are available for ‘student success. Ade COURSE RELATED MATI «= Outdated editions are systematically Materials for new are acquit Faculty are encouraged to submit acquisition FReverve collections are maintained for ‘materials with tr Study guides, test preparation materials, and career dev Electronic versions are preferred where licensing allows ‘simultaneous multi user access. Open educational resources (OER) are promoted and integrated where quality and relevans® are \"Textbooks and supplementary readings ested in oficial course sylabi receive highest priority quired to support language ‘and international studies programs worse based on usage statistics and faculty requests. media, and interactive tools are ‘selected to enhance leaming th current versions as budget permits. verified. «= Multiple copies are acaul «+ Multimedia resources inc SEARCH MATERIALS services are provided 19 cy ang sce cg, ee TE The or open data and research ransparency ‘specialized databases 912, esearch data management weary ee comprare wih ng SBE A ing, and sciences are mantaned net prctessiona acrectaton stand 1 2 RES! medicine, engineer August 20"
    },
    {
        "image": "collectionpolicy2_synth_7_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "JULIE VILLE COMMUNITY COLLEGE LIBRARY Library COLLECTION DEVELOPMENT POLICY This Macy estabashes the trarnework for sek subbed the academe: assign ard research ge growth aligned wath ng, SCGUINNY. 20d Matta ng Loe ky n. cals of the mstituttan. Iensures bal ands, accreat MATERIAL ACQUIS STANDARDS Miatenats pus! cwectly support the cumncubin’ Budget abe ation chatted mateials are evaliaied against Sele tor emphases auty Prenty 1s given to res align with mSMUtond! leariang outcomes, Hon wits same cetena as reveneed annuaiy comy inary Advisory Comintt purchased iter SNES, poer revewed ontent, amt Aces recommended Dy factity and a ademnte dep tive pat 4g works BA COL RSE RELATED MATERIALS, Qurdated cate ake syctematicaiy weeded and replaced with cicten’ verses an badges» 2 aie Actua? at east ons sarnester prior ty rogram lauren vo ihvary postal @! ioast BY itays 19 ratverces Ps aFe Hntsines tor matanats with limited avallase ty oF hgh cin ulation demand Pi test ompcaration cvateris, Arsen ec ommert res cusces hore licensing miloun Here guivity ard relavanca are vated! Tyran ede 1 28 protawied + Textncoks anit sunpiementary raudings sisted wy atticial sow SyBabe receay taghast pr 5 act Sater a oruich anquage materials are arquted te supowt la quage recqurests Pio wntance leaning ALS EAROM MATEL ewan) sevens rte Gc4mMiC 1 BEEN lant) any atacer nth Nae BENE: mienailes bn Coe aat2 AN eae eneS Bre arta rast Urctessea! a cteckaton Bae"
    },
    {
        "image": "collectionpolicy2_synth_8_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "FRANK VILLE POLYTECHNIC INSTITUTE Library LIBRARY COLLECTION DEVELOPMENT POLICY This poly establishes the fram ew K for selecting, acquinng, and mamtairang trary m c mission and research goa s of ihe institution. t ensures halanced demands, accrediation standards fats to cotectsn etserging schoiatiy tre Be ACQUISITION GUIDELINES serity Selection nants. peerrey port the curiculuns a ually in wed content, and award winning High with aistitutional learning Advisory Co: oftena as purchased ems vor Matenals mus! 4 T- COURSE RELATED MATERIALS Electronic versions a efeited where licensing allows siniultsnesus multiuser 1 lod Texth Suppiomentiny readings listed in offi Course roserves are upe! ent heads and coviese insteuctors eive highest pa efais, and career deve ate avadlable tex student success ly weeded and repiacad with evrent versions as bud «permits 2 supper af studies timedia resouices inctudieg DVDs, streaming media, Reserv armen afi oat id interactive toot lected to enhance fearing Promoted ana integrated where qu ‘56 maintained for materials with lie ty and relevance ai ed od avail or high circulation demand one Semiastes prior to progran lau for new programs ave acquired at hs 4 2 RESEARCH MATERIALS fetence proceadings, for niche ot raieiy used mate als ‘The library supports, pen accoss ini masirize the “mination of facuby scholarship, March 2028"
    },
    {
        "image": "collectionpolicy2_synth_8_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "FRANK VILLE POLYTECHNIC INSTITUTE Libra LIBRARY COLLECTION DEVELOPMENT POLICY are maintain fution. teansures bals qj schoiaiy sereis Wg, acquiri fa goals of the ins ation standards, and ener This policy estat ‘the academic mission ani curricular demands, accredit up growth aligred «i ACQUISITION GUIDEL INE! recommended by fC! ets, Be: resources izes authoritative pt curriculum and align with inst Burget allocation is reviewed anne: fy in consultation with the Liorary Advisory Commitee. Donated materia s are evaluated against the chased wens, 4k. COURSE RELAT enutangous wultieuser reqvedt white Soens aronent heads and course instructors ive nighest pionty 5 are available for Student Success eetronie versions are pr purse meserves are ariated gach samester in cecréination wh Festbooks end supple Study guides, test prepara pinent resqurce nimaterials, and ty weeded and ren riiangua current versie srments and fi edlifons a2 2 rage materiais 21 ‘ding cces (OER) are promoted fais with tited ave ast erie semester pris fulumestia Gpan educational se collections are ral rated where quality an shitty o« bigh ci Jimalnedt for a re acquired at to prod grams jewved journals, costes dings toe nigha te rarely used materels. The library scholarship iatives art ins arch"
    },
    {
        "image": "collectionpolicy2_synth_8_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "FRANK VILLE POL YTECHNIC INSTITUTE IBRARY Library COLLECTION DEVELOPMENT POLIC su pest th arty trends +» ACQUISITION GUL Protity is given te resources recommenied by faculty and academic depariments es authoritati Selection emphast oh v2 punlishers, 7 steriais em urricut in consult {the 52 Buriget allocation is reviewed annui Donated matenals a =-RELATED MAT: pre eed where licensing altows simuleaneous mutts are updated each ination with department h {course syilatl rece! 1 preparation mais, weatied and replace nee lea Open educa relevance are verified integrated where quailty an ve eattectior mana vials with itawility or ta! ion leant one sem ipports March 2028"
    },
    {
        "image": "collectionpolicy2_synth_8_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "FRANK VILLE POLYTECHINIG INSTITUTE tyrar: LIBRARY Library COLLECTION DEVELOPMENT POLICY 1. ACQUISITION GUIDELINES «Saeco rao Fescurces recomend by fait and scan departments, Selection emphasizes atooraive PEEr reviewed contert, Materia must derecty Support the cumicutum and akon wath sstin: Budget atocation is reviewer anviuaty v1 consultation Donated materials are evakiated against the 11+ COURSE RELATED MATERIALS Electronic versions are profuered whee Se, March 2025"
    },
    {
        "image": "collectionpolicy2_synth_8_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "FRANK VILLE POLYTECHNIC INSTITUTE LIBRARY COLLECTION DEVELOPMENT POLICY This policy establishes the framework for selecting, acquiring, and maintaining library materials to support the academic mission and research goals of the institution. It ensures balanced collection growth aligned with curricular demands, accreditation standards, and emerging scholarly trends. 1. ACQUISITION GUIDELINES Priority is given to resources recommended by faculty and academic departments Selection emphasizes authoritative publishers, peer reviewed content, and award winning works Materials must directly support the curriculum and align with institutional learning outcomes. Budget allocation is reviewed annually in consultation with the Library Advisory Committee. Donated materials are evaluated against the same criteria as purchased items. 1 1. COURSE RELATED MATERIALS Electronic versions are preferred where licensing allows simultaneous multi user access. Course reserves are updated each semester in coordination with department heads and course instructors. Textbooks and supplementary readings listed in official course syllabi receive highest priority Study guides, test preparation materials, and career development resources are available for student success. Outdated editions are systematically weeded and replaced with current versions as budget permits Foreign language materials are acquired to support language departments and intemational studies programs Multimedia resources including DVDs, streaming media, and interactive tools are selected to enhance learning Open educational resources (OER) are promoted and integrated where quality and relevance are verified Reserve collections are maintained for materials with limited availabilty or high circulation demand Materials for new programs are acquired at least one semester prior to program launch 1 2 RESEARCH MATERIALS Research collections emphasize peer reviewed journals, conference proceedings, and specialized databases in core disciplines. Interlibrary loan services supplement holdings for niche or rarely used materials. The library supports ‘open access initiatives and institutional repositories to maximize the dissemination of faculty scholarship. March 2025"
    },
    {
        "image": "collectionpolicy2_synth_9_aug1.png",
        "label": "collectionpolicy",
        "ocr_text": "JOHN VEL POLYTE! LIBRARY LE INiG INSTITD Library COLLECTION DEVELOPMENT POLICY sur groveth align sport the acade: ied witts itee, jarials must directly support the curriculum and align with institutional earning ouicomes, Donated mater waisted against the same criteria as purchased items, Is ae 33s INSTRUCTIONAL RESOURCES, us? reser heada sre cour high enrailmont courses based ies avid Faculty reacts. via the fibrary portal at faust 60 days in advance: aie avalleble for student s rive highest prin cidineiion with departenes insteuctore, Multlipe copies are acquired for on usage stat Faculty are encouraged to submit sequis Study guides, test pre Texitiooks for naw programs are acquired at leasi one: semester prior te pragrarr laury qulied to seppan language departments and international studies programs ined for materials with limited availability o: high circulation demand, for as puxiget permits, und relevance are vertiod ‘ainar development react Mater Fou ign ienguease materials axe are mel ‘una ere systematically weeded and replaced with cutunt ional reseurces (OE! omoted aiid intagts SEARCH SUPPORT Reet needings, ard specialized databases in raraly used risterlais, Tha library supports tories to maximize the dissemination of faculty scholarship, wed jownals, conference pe ‘open access inilatives and inetituiional repos Apri 2025"
    },
    {
        "image": "collectionpolicy2_synth_9_aug2.png",
        "label": "collectionpolicy",
        "ocr_text": "NOVILEE ECHNIC INSTITUTE trap BRA oe Library COLLECTION DEVELOPMENT POLICY MATERIAL ACQUISITION STA ARDS"
    },
    {
        "image": "collectionpolicy2_synth_9_aug3.png",
        "label": "collectionpolicy",
        "ocr_text": "JOHN VILLE POLYTECHNIC INSTITUTE LIBRARY Library COLLECTION DEVELOPMENT POLICY This policy establishes the framework for selecting, ac Support the academic mission and research goals of growth aligned with curricular demands, accreditation quiring, and maintaining library materials to the institution. It ensures balanced collection standards, and emerging scholarly trends. 1. MATERIAL ACQUISITION STANDARDS Budget allocation is reviewed annually in consultation Priority is given to resources recommended by facul 1 1. INSTRUCTIONAL RESOURCES Course reserves are updated each semester in coordination with department heads and course instructors, ~* Multiple copies are acquired for high enroliment courses based 1 2 GRADUATE RESEARCH SUPPORT Research collections emphasize peer reviewed joumals, conference Proceedings, and specialized databases in core disciplines. Interlibrary loan services supplement holdings for niche or rarely used materials. The library supports ‘Pen access initiatives and institutional repositories to maximize the dissemination of faculty scholarship. April 2025"
    },
    {
        "image": "collectionpolicy2_synth_9_aug4.png",
        "label": "collectionpolicy",
        "ocr_text": "ON MILLE Librar i YTEGHNIC INSTITUTE COLLECTION DEVELOPMENT POLICY the frameware for £cr ad mie research Go 5 policy establisn mnie migsion a iar he acade: qrennth aligned with curt Be MATERIAL ACQL ADS won with and acad with 1s nes «Mate snatad mate Reb INS roe reserves are Ul pies are co re oagautaged submi: est pieparation ired ed to suppor engu simaitangsus eilluset Jj databases in core ceedings. and speci"
    },
    {
        "image": "collectionpolicy2_synth_9_aug5.png",
        "label": "collectionpolicy",
        "ocr_text": "JOHN VILLE POLYTECHNIC INSTITUTE Library LIBRARY COLLECTION DEVELOPMENT POLICY This policy establishes the framework for selecting, acquiring, and maintaining library materials to support the academic mission and research goals of the institution. It ensures balanced collection growth aligned with curricular demands, accreditation standards, and emerging scholarly trends. 1. MATERIAL ACQUISITION STANDARDS jewed annually in consultation with the Library Advisory Committee. recommended by faculty and academic departments. rt the curriculum and align with institutional learning outcomes. ed items. Budget allocation is revi Priority is given to resources Materials must directly suppor Donated materials are evaluated against the same criteria as purchas* 1 1. INSTRUCTIONAL RESOURCES Course reserves are updated each semester in coordination with department heads and course instructors “Multiple copies are acquired for high enrallment courses based on usage statistics and faculty requests. “Faculty are encouraged to submit acquisition requests via the library portal at least 60 days in advance. Study guides, test preparation materials, and career development resources are avaliable for student success. “Textbooks and supplementary readings listed in official course syllabi receive highest priority «Materials for new programs are acquired at least one semester prior to program launch, “Foreign language materials are acquired to support language departments and intemational studies programs «Reserve collections are maintained for materials with limited availabilty or high circulation demand, Outdated editions are systematically weeded and replaced with current versions as budget permits, Open educational resources (OER) are promoted and integrated where quality and relevance are verified Muttimedia resources including DVDs, streaming media, and interactive tools are selected to enhance Teaming Electronic versions are preferred where licensing allows simultaneous multi user access 4 2 GRADUATE RESEARCH SUPPORT ‘onference proceedings, and specialized databases in core for niche or rarely used materials. The library supports ize the dissemination of faculty scholarship. Research collections emphasize peer reviewed journals, c disciplines. Interlibrary loan services supplement holdings ‘open access initiatives and institutional repositories to maxim! April 2025"
    }
]