[
    {
        "image": "consultation1_synth_10_aug1.png",
        "label": "consultation",
        "ocr_text": "City ef Michael Ville STUDENT CONSULTATION Pome STUDENT REQuE: TROY WF é Buk bs Qdet tsar RODGER, poo assmate. mentber of pievc Community | i i jee me"
    },
    {
        "image": "consultation1_synth_10_aug2.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES RICHARD VILLE COLLEGE City of Michael Ville STUDENT CONSULTATION FORM STUDENT handel To be filled out by the stu Subject: ResearchMetnods vt Sem [J 24 Sem AY 20 23 -20 24 Areas of Concem: Please tick the box of the specific concern [_] Academic Performance (grades, performance ratings) [¥] Personal grievances (faculty, classmate, member of Ricvc Community [_] Recent social changes affecting studies (family, peer relationships) [-] Other concems. Please specify __ __ _ Date of Request October 07, 2025 Signature Troy W. Rodgers"
    },
    {
        "image": "consultation1_synth_10_aug3.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES RICHARD VILLE COLLEGE City of Michael STUDENT REQUEST rn 7 be fits ate of Requ Encoteennminmonnnnnseta"
    },
    {
        "image": "consultation1_synth_10_aug4.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES, RICHARD VILLE COLLEGE City of Michael Ville STUDENT CONSULTATION FORM STUDENT REQUEST To be filled out by the student Name TROY W RODGERS Student Number. 2022 81670 Course. AB English Section: 2 Subject: Research Methods v 1 Sem_ [J] 2° Sem AY 2023 20 24 Areas of Concem Please tick the box of the specific concern [-] Academic Performance (grades, performance ratings) Year. 1st Year [Vv] Personal gnevances (faculty, classmate, member of RicVC Community {-] Recent social changes affecting studies (family, peer relationships) {_] Other concems. Please specify Date of Request October 07, 2025 Signature Troy W. Rodgers"
    },
    {
        "image": "consultation1_synth_10_aug5.png",
        "label": "consultation",
        "ocr_text": "REPU! s RICHARD VILLE COLLEGE City of Michael! STUBENT CONSULTATION FoR oo STUDENT REQUEST fa be filed out by the student Name TROY WROSGERS Au"
    },
    {
        "image": "consultation1_synth_1_aug1.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DAVID VILLE STATE COLLEGE City of Richard Ville STUDENT CONSULTATION FORM taps Loptapaickl Name: MARTHA H MENDOZA aks Number 2021 18593 Course BS Civil Engineering Section: c Subject: Data structures [L Sem_ v 2\"* Sem AY 2023 -20 24 Areas of Concem: Please tick the box of the assis concern Year: 2nd Year Academic Performance (grades, performance ratings) Personal grievances (faculty, classmate, member of DavVSC Community Recent social changes affecting studies (family, peer relationships) [¥] Other concems. Please SPecify Request for academic advising on course selection Date of Request: September 27, 2025 Signature Martha H. Mendoza"
    },
    {
        "image": "consultation1_synth_1_aug2.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES. DAVID VILLE STATE COLLEGE City of Richard Ville STUDENT CONSULTATION FORM To be filled out b Name: MARTHA H. MENDOZA Course: BS Civil Engineering Year. 2nd Year Ei Subject: Data Structures Dt nA a 24 Sem AY 20 23 -20 Areas of Concem: Please tick the box of the specific concern the student Student Number. 2021 18593 [_] Academic Performance (grades, performance ratings) (_] Personal grievances (faculty, classmate, member of pawsc Community Recent social changes affecting studies (family, peer relationships) [¥] Other concems. Please specify Request for academic advising on course selection Date of Request September 27, 2025 Signature Martha H. Mendoza"
    },
    {
        "image": "consultation1_synth_1_aug3.png",
        "label": "consultation",
        "ocr_text": "PHILIPPIN LLE STATE COLL ‘ity of Richard Viie STUGENY CONSULTATION form pon meaner nineteen aire STUDENT REQUEST ssmaantrnuetinm ramen OE TiS Out try By Name MARCHA HME! FIBOZA sien j fate, mem ST Dawvsc Community | Pisase spe Martha H. Mendoza"
    },
    {
        "image": "consultation1_synth_1_aug4.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DAVID VILLE STATE COLLEGE City of Richard Ville STUDENT CONSULTATION FORM STUDENT REQUEST Tobe filled out by the student 8S Civil Engineering UbJEct Data Structures Areas of Cone em. Pleas 2ection c ‘Sem [wv] ar Sem AY 2 cific concern 0 23 -20 e tick the box of the sp Academic Performance (grade performance ratings) Personal gnevances (fac ulty, c ssmate, member of Dawsc Community Recent social changes affecting studies (family, peer relationships) v Other concems Please SPecify Request tor academic advising on course selection Date of Request September 27, 2025 Signature Martha H. Mendoza"
    },
    {
        "image": "consultation1_synth_1_aug5.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DAVID VILLE STATE COLLEGE SityotR sand Ville SYTUGENT CONSULTATION FORK pose 9. MARTHAH. MEN mic Performan"
    },
    {
        "image": "consultation1_synth_2_aug1.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES MICHAEL VILLE STATE COLLEGE City of Brian Ville STUDENT CONSULTATION FORM STUDENT REQUEST Jobe filled out by the student Name: REBECCAA MARTIN Student Number 2022 26463 Course: BS Computer Science Year: 3rd Year Section: 0 Subject: Database systems [ivi Sem [_Jar¢ Areas of Concem Please tick the box of the Specific concern Sem AY 2025 2026 Cc] Academic Performance (grades, performance ratings Personal gnevances (faculty, classmate, member of micvsc Community 1 Recent Social changes affecting studies (family, peer relationships) [-] Other concems. Please specify Date of Request September 17, 2025 Signature Rebecca A. Martin"
    },
    {
        "image": "consultation1_synth_2_aug2.png",
        "label": "consultation",
        "ocr_text": "5 Lic OF THE IPPHES MICHAEL VILLE STATE Ct of Bran Ville STUDENT GONSULTATION FORM sensei eet SE ~ “srupEnT FRaguEST is |"
    },
    {
        "image": "consultation1_synth_2_aug3.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES MICHAEL VILLE STATE COLLEGE City of Brian Ville STUDENT CONSULTATION FORM STUDENT REQUEST Tobe filled out by the student Name: REBECCA A. MARTIN Student Number: 2022 26463 Course: BS Computer Science Year: 3rd Year Section: D Subject: Database Systems [iviiSem [J 2\" Sem AY 20 25 -20 26 Areas of Concem: Please tick the box of the specific concern [_] Academic Performance (grades, performance ratings) \\¥| Personal grievances (faculty, classmate, member of micvsc Community Recent social changes affecting studies (family, peer relationships) Other concems. Please specify Date of Request: September 17, 2025 Signature Rebecca A. Martin"
    },
    {
        "image": "consultation1_synth_2_aug4.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES MICHAEL VILLE STATE COLLEGE City of Brian Ville STUDENT CONSULTATION FORM STUDENT REQUEST Tobe filled out by the student Student Number. 2022 26463 Subject: Database Systems ivji Sem_ [_} 2\"* Sem AY 20 25 -20 Areas of Concem: Please tick the box of the specific concern [_] Academic Performance (grades, performance ratings) [¥] Personal grievances (faculty, classmate, member of micvsc Community [_] Recent social changes affecting studies (family, peer relationships) (-] Other concems. Please specify Date of Request September 17, 2025 Signature Rebecca A. Martin"
    },
    {
        "image": "consultation1_synth_2_aug5.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES MICHAEL VILLE S STATE COLLEGE City of Brian Vilie MSULTATION FORM STUBENT CO e student Shon Sem A m AY 2028.- 5 20 28 i Namie. REBECCAK MARTIN Course BS Computer Science Subject: 9 ‘Doabase Sys! Areas of of concen: Pt [7] Academic performance (9 deS. Pp nerfonmance ratings} Personal gevances 4 (faculty, Ch tfassmate, member of MicvSC Community anges affecting studies ifarmily, peer reiationships} 1 Recent social ch L concems. Pieas¢ specify f7] Other C4 Rebecca A. Martin Signature Date of Request. Septamber 17, 2025"
    },
    {
        "image": "consultation1_synth_3_aug1.png",
        "label": "consultation",
        "ocr_text": "MARY VILL STUDENT CONSULTATION FORM STUDENT REQUEST ‘nrecumme enemies"
    },
    {
        "image": "consultation1_synth_3_aug2.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPRIES MARY VILLE STATE COLLEGE City of Timothy Vitle STUDENT CONSULTATION FORM STUDENT REQUBay 0 be filed out by the studert Student Number ozo. 18831 Cj Academic Perfomance forades performance ratings} {\"} Personal gnevanc S (faculty, Classmate, Member of marvsc Community [¥] Recent Social changes affecting studies (family, peer relationships} Other CONnCEMS. Please Specify Date of Request September 12, 2025 Signature Tracey ©. White"
    },
    {
        "image": "consultation1_synth_3_aug3.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES MARY VILLE STATE COLLEGE City of Timothy Ville STUDENT CONSULTATION FORM STUDENT REQUEST To be filled out by the student Student Number 2020 18831 Course: AB English Year. 1st Year Section: 0 Subject: Research Methods [LjtSem_ v] 2\"? Sem AY 20 25 -2026_ Areas of Concem: Please tick the box of the specific concern {_] Academic Performance (grades, performance ratings) {_] Personal gnevances (faculty, classmate, member of Marvsc Community [v] Recent social changes affecting studies (family, peer relationships) {_] Other concems. Please specify Date of Request September 12, 2025 Signature Tracey C. White"
    },
    {
        "image": "consultation1_synth_3_aug4.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES MARY VILLE STATE COLLEGE City of Timothy Ville STUDENT CONSULTATION FORM STUDENT REQUEST Tobe filled out by the studert Student Number: 2020 18831 Course: AB English Year. 1st Year Section: D Subject: Research Methods L 1 Sem 2 4 Sem AY 2025 -20, Areas of Concem. Please tick the box of the specific concern —] Academic Performance (grades, performance ratings) [] Personal grievances (faculty, classmate, member of MarvSC Community [¥] Recent social changes affecting studies (family, peer relationships) Other concems. Please specify _ September 12, 2025 Signature Tracey C. White Date of Request"
    },
    {
        "image": "consultation1_synth_3_aug5.png",
        "label": "consultation",
        "ocr_text": "REPU! MARY VIL Classmate, mombe"
    },
    {
        "image": "consultation1_synth_4_aug1.png",
        "label": "consultation",
        "ocr_text": "REPUBL THE PHILIPPINES SCOTT VILLE STUGENT CONSULTATION Pomaq ‘“venanntentniennanta animate neue STUDENT REQUReT i i) Acad faculty, ch TOT Scorn Community i Date of Request"
    },
    {
        "image": "consultation1_synth_4_aug2.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES. SCOTT VILLE COLLEGE City of Natalie Ville STUDENT CONSULTATION FORM STUDENT REQUEST Tobe filled out by the student Name: TONIB. BROWN Student Number: 2024 16536 Course: BS Civil Engineering Year: 4th Year Section: D Subject: Statistics [[iSem_ v] 2\"! Sem AY 20 25 -20 26. Areas of Concem: Please tick the box of the specific concern v| Academic Performance (grades, performance ratings) Personal gnevances (faculty, classmate, member of scotve Community Recent social changes affecting studies (family, peer relationships) Other concems. Please specify Date of Request October 27, 2025 Signature Toni B. Brown"
    },
    {
        "image": "consultation1_synth_4_aug3.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES SCOTT VILLE COLLEGE City of Natalie Ville STUDENT CONSULTATION FORM Name: TONIB. BROWN Course: Bs Civil Engineering Subject: Statistics [J Recent Social changes affe: cting studies (family, peer relation [-] Other concems. Please sp ships) ecify Date of Request October 27, 2025 Signature Toni B. Brown"
    },
    {
        "image": "consultation1_synth_4_aug4.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES SCOTT VILLE COLLEGE City of Natalie Ville STUDENT CONSULTATION FORM STUDENT REQUEST Tobe filled out by the student Subject: Statistics 2\"¢ Sem AY 20 25 -2026_ Areas of Concem: Please tick the box of the specific concern [¥] Academic Performance (grades, performance ratings) [_] Personal gnevances (faculty, classmate, member of scotvc Community [_] Recent social changes affecting studies (family, peer relationships) [] Other concems. Please specify Date of Request October 27, 2025 Signature Toni B. Brown"
    },
    {
        "image": "consultation1_synth_4_aug5.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES SCOTT VILLE COLLEGE City of Natalie Ville STUDENT CONSULTATION FORM STUDENT REQUEST To be filled out by the student Student Number: 2024 16536 Course: BS Civil Engineering Section: D Subject: Statistics L \\18Sem 2 4 Sem AY 2025 2026 Areas of Concem: Please tick the box of the specific concern ¥| Academic Performance (grades, performance ratings) Name: TONIB. BROWN Year. 4th Year [—] Personal grievances (faculty, classmate, member of Scotvc Community Recent social changes affecting studies (family, peer relationships) Other concems. Please specify Signature Toni B. Brown Date of Request October 27, 2025"
    },
    {
        "image": "consultation1_synth_5_aug1.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILPP IVES TIMOTHY VILLE STATE COLLEGE City of Heidi vilie STUDENT CONSULTATION FORM STUDENT REQUEST Tp be flied out ny the studert ction: C a IL Se \\_ly} 2\"! Sem AY 2025 -20 26 —] of the specific concem Name. Cours INDY K. BARNES (CJ Academic Per formance (grades, berformance ratings} [\"} Personal gnevances (faculty, classmate, Member of timvsc community [¥} Recent social changes affecting studies family, peer relationships) Other concems Please specify _ Date of Request October 18, 2025 Signature Cindy K. Barres eed"
    },
    {
        "image": "consultation1_synth_5_aug2.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES OTHY VILLE STATE COLLEGE City of Heidi Ville TIM STUDENT CONSULTATION FORM STUDENT REQUEST Tob O be filled out b the student Cou! TS@: BS Information Technology Student Number. 2021 15449 Section: c Subject Programming Fundamentals [Dt Sem |v] ana Areas of Concem Please tick the box of th Sem AY 2025 -20 26 Specific concern. oO Academic Performance (grades, Performance ratings) Name: cinby x BARNES Year: 1st Year Date of Request October 18, 2025 Signature Cindy k. Barnes"
    },
    {
        "image": "consultation1_synth_5_aug3.png",
        "label": "consultation",
        "ocr_text": ""
    },
    {
        "image": "consultation1_synth_5_aug4.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPA TIMOTHY LE STATE COLLEGE City of Heidi Ville STUDENT CONSULTATION SGRM pos STUDENT Rneauier ze Name nib VK BARNES performance ratin Personal gre Recent social c"
    },
    {
        "image": "consultation1_synth_5_aug5.png",
        "label": "consultation",
        "ocr_text": "STUDENT CONSULTATION FORM STUDENT REGUEOT To be flea gut by he sedent a sel ine ades, performance f eric Performance dies (far peer relator i obs ares Phy ed Signature: Cindy K. Barnes i L ececansnaaimasranscsmanancacer sameness"
    },
    {
        "image": "consultation1_synth_6_aug1.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES JEFFERY VILLE STATE COLLEGE City of Alan Ville STUDENT CONSULTATION FORM STUDENT REQUEST To be filled out by the student Student Number. 2023 45973 Course: BS Psychology Year. 2nd Year Section: 2 Subject: Physics for Engineers [L1tSem_ v] 2\"? Sem AY 20 24 -20 25 Areas of Concem: Please tick the box of the specific concern Academic Performance (grades, performance ratings} Personal grievances (faculty, classmate, member of Jefvsc Community Recent social changes affecting studies (family, peer relationships) ¥] Other concems. Please specify !nauiy regaraing internship program requirements Date of Request: September 09, 2025 Signature Cody W. Andrade"
    },
    {
        "image": "consultation1_synth_6_aug2.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES JEFFERY VILLE STATE COLLEGE Cliy of Alan Ville STUDENT GONSULTATION FORM STUDENT REQUEST Tobe filied out by the student Narne: Cony W ANDRADE Student Number, 202345973 Course! BS Psycholcgy Year 2nd Yeer [\"] Academic Performance (grades, performance ratings) Personal grevances (laculty, classmate, member of Jetvsc Community Recent sacial changes affecting studies (family, peer reiationships} Other concems. Please specify ew regarang intemsrip program requrements ne ee ne nem ne ne an Signature Cody W. Andrade Date of Request September 09, 2025"
    },
    {
        "image": "consultation1_synth_6_aug3.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES JEFFERY VILLE STATE COLLEGE City of Alan Ville STUDENT CONSULTATION FORM STUDENT REQUEST To be filled out by the student Student Number 2073 45073 Course: BS Psychology Year. 2nd Year Section: 2 Subject: Physics tor Engineers [L1 Sem_ v] 2? Sem AY 20 24 -20 25 Areas of Concem: Please tick the box of the specific concern Academic Performance (grades, performance ratings) Personal grievances (faculty, classmate, member of Jefvsc Community Recent social changes affecting studies (family, peer relationships) Other concems. Please specify !nauiy regaraing internship program requirements Date of Request: September 09, 2025 Signature Cody W. Andrade"
    },
    {
        "image": "consultation1_synth_6_aug4.png",
        "label": "consultation",
        "ocr_text": "“PINES °Y VILLE STAI Te CLLR City of Alan Vite STUuSEnr CONSULTATION PGRM STUDENT Ri uaey nee RRC LE Hed out"
    },
    {
        "image": "consultation1_synth_6_aug5.png",
        "label": "consultation",
        "ocr_text": "HE PHILIPPINES. REPUBLIC OF T COLLEGE JEFFERY VILLE STAT City of Alan Ville STUDENT CONSULTATION FORM NT REQUEST the student ou BS Psychology ubyect Physics! 1 Engineers academic Perfont ance (grade’ performan e ratings) | Personal gnevance (facult assmate, men ber sf JetvSC Community | 4| changes afte ting studie (family, peer relationships} pecit y te9s Please SF Cody W Andrade ignature"
    },
    {
        "image": "consultation1_synth_7_aug1.png",
        "label": "consultation",
        "ocr_text": "STU RENT SORSOLTRTION FORM STUDENT Ra Rea 20 be tilted nemceneranr sentra near Mid. HOLLAND {grades, perforna member o mV Communt dies (farily peer pel ationsinips} i ture Adam J. Holland i"
    },
    {
        "image": "consultation1_synth_7_aug2.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES TIMOTHY VILLE COLLEGE City of Luke Ville STUDENT CONSULTATION FORM STUDENT REQUEST To be filled out by the student nt Numb Name ADAM J. HOLLAND Course BS Computer Science a Subject. Financial Accounting [sem iv ofConcem Ple of the pecific concern lemic Performance (gra erformance rating y, classmate, member of Timvc Community v| Recent social cha affecting studies (family, peer relationships) Other concems Plea’ specify Date of Request September 13, 2025 gnature Adam J. Holland"
    },
    {
        "image": "consultation1_synth_7_aug3.png",
        "label": "consultation",
        "ocr_text": ""
    },
    {
        "image": "consultation1_synth_7_aug4.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC oF THe Pi t STUDENT R oo Community Recent social changes aft HES (farrit P8sr relations! hips) i"
    },
    {
        "image": "consultation1_synth_7_aug5.png",
        "label": "consultation",
        "ocr_text": "REP OF THE pegy TIMOTHY Vit LE COLLEGE CY Of Luke Viti STeRgey CONSULTATION FORM a Ta he Fite; 20 O18 by the 2 St Le Me ADAM oe aimee cademic Party MANGE (grade 8S (faculty, classmate, fosmber of tinve Sominunity I My, Deer relations| Olner conceme oe | eptember 13"
    },
    {
        "image": "consultation1_synth_8_aug1.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES MARK VILLE COLLEGE City of Kimberly Ville STUDENT CONSULTATION FORM STUDENT REQUEST Tobe filled out by the student Student Number. 2021 36490 Course: BS Computer Science Section: 1 Subject: Programming Fundamentals 1 Sem _ v] 2°! Sem AY 20 24 -20 25 ‘Areas of Concem: Please tick the box of the specific concern [_] Academic Performance (grades, performance ratings) Name: ASHLEY A. CLARK Year. 3rd Year Personal grievances (faculty, classmate, member of Marvc Community ¥1 Recent social changes affecting studies (family, peer relationships) [-] Other concems Please specify Date of Request September 12, 2025 Signature Ashley A. Clark"
    },
    {
        "image": "consultation1_synth_8_aug2.png",
        "label": "consultation",
        "ocr_text": "STUDENT CONSULTATIGN FORM sae mannan ine om ~— “‘eTuDENT aequEST ley A. Clark"
    },
    {
        "image": "consultation1_synth_8_aug3.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC STeBEnT GONSULTATION FORM for eeeererntonnnonennnntnn tnatnnnntenenar, STUBENT REQURgp"
    },
    {
        "image": "consultation1_synth_8_aug4.png",
        "label": "consultation",
        "ocr_text": "= PHILIPPINES REPUBL MARK VILLE COLLEGE Sity of Kimberly Ville STUBENT CONSULTATION FORM seen enmntnmsnrraninescemnaitenarr ENT RUST 2027 3h4ae eee tings} fl roi Marve Community mer e (larly, nature Ashley A. Clark ee nnd pocwnanneenennanesmnannennesse ninth SOAs"
    },
    {
        "image": "consultation1_synth_8_aug5.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES, MARK VILLE COLLEGE City of Kimberly Ville STUDENT CONSULTATION FORM STUDENT REQUEST To be filled out by the student Name ASHLEY A CLARK Student Number 2027 36490 Course Bs Computer Science Year 3rd Year Subject Programming Fundamentals Areas of Concem Please tick the box of the Section 4 Sem _[¥] 2 4 Se, m AY 20 24 -20 25 Specific concern Academic Performance (grades, performance ra tings) Personal gnevances (faculty, Classmate, member of Marve Community iv) [] Recent social changes affectin 9 studies (family, peer relationships) Other concems. Please specify Date of Request September 12, 2025 Signature Ashley A. Clark"
    },
    {
        "image": "consultation1_synth_9_aug1.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES BRADLEY VILLE STATE UNIVERSITY City of Kathy Ville STUBENT CONSULTATION FORM STUDENT REQUEST Te be filled out by the shiderét Student Number. 2023 71496 Course AB English Year, 306 Year Cf. Research Methods Concem: Please the box of the specific concem [7] Academic Performance (grades, performance ratings) {¥] Personal grievances (faculty, classmate, member of Bracvsu Community [-} Recent social chariges affecting studies (family, peer relationships} Other concems. Piease specify __ Date of Request September 02, 2025 Signature Lisa H. Fernandez"
    },
    {
        "image": "consultation1_synth_9_aug2.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES BRADLEY VILLE STATE UNIVERSITY City of Kathy Ville STUDENT CONSULTATION FORM STUDENT REQUEST To be filled out by the student Student Number. 2023 71406 Section: A [¥] 2 4 Sem AY 20 24 -20 25 specific concern 1 Academic Performance (grades, performance ratings) Name: LISA H. FERNANDEZ Course: AB English Subject: Research Methods 1* Sem Areas of Concem: Please tick the box of th Year: 3rd Year [¥] Personal grievances (faculty, classmate, member Of Bradvsu Community [-] Recent social changes affecting studies (family, peer relationships) Other concems. Please specify Date of Request September 02, 2025 Signature Lisa H. Fernandez"
    },
    {
        "image": "consultation1_synth_9_aug3.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES BRADLEY VILLE STATE UNIVERSITY City of Kathy Ville STUDENT CONSULTATION FORM STUDENT REQUEST Tobe filled out by the student Student Number _2023 71496 ‘Course: AB English Year. 3rd Year Section: A Subject. Research Methods [oSem_ v) 2\" Sem AY 2024 2025 Areas of Concem. Please tick the box of the specific concern Academic Performance (grades, performance ratings) Name: LISAH. FERNANDEZ YZ] Personal grievances (faculty, classm ate, member of BradVSU Community Recent social changes affecting studies (family, peer relationships) Other concems. Please specify September 02, 2025 Signature Lisa H. Fernandez Date of Request"
    },
    {
        "image": "consultation1_synth_9_aug4.png",
        "label": "consultation",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES BRADLEY VILLE STATE UNIVERSITY City of Kathy Ville STUDENT CONSULTATION FORM STUDENT REQUEST Tobe filled out by the student Name: LISAH. FERNANDEZ Course: AB English Year 3rd Year Section: A Subject: Research Methods 1 Sem_ v] 2\" Sem AY 20 24 -20 25 _| Areas of Concem: Please tick the box of the specific concern Academic Performance (grades, performance ratings) \\v] Personal gnevances (faculty, classmate, member of Bradvsu Community Recent social changes affecting studies (family, peer relationships) Other concems. Please specify Date of Request: September 02, 2025 Signature Lisa H. Fernandez"
    },
    {
        "image": "consultation1_synth_9_aug5.png",
        "label": "consultation",
        "ocr_text": "SRADLEY VILLE ST! ahi ar fadVSU GC"
    },
    {
        "image": "consultation2_synth_11_aug1.png",
        "label": "consultation",
        "ocr_text": "Republic of the Philippines MICHAEL VILLE UNIVERSITY Adrienne Ville, Luzon College of Business Administration THESIS CONSULTATION Consultation No. Major Topic s: Proposal Defense Preparation Name of Student —_ Jessica W. Smith Thesis Tite: ‘Machine Learning Applications in Healthcare Data Analysis Location: brary Research Area Date of Consuttation: October 10, 2025 Time: _12 30 13 30 COMMENTS: Reviewed statistical analysis results and interpretation. Clarified proper presentation of ‘quantitative findings. Discussed implications of results and their contribution to the field. Advised ‘on preparing for defense presentation. Mr. Ashley Cooke, Ed D. Name and Signature of Thesis Consultant"
    },
    {
        "image": "consultation2_synth_11_aug2.png",
        "label": "consultation",
        "ocr_text": "Republic of the Philippines MICHAEL VILLE UNIVERSITY Adrienne Ville, Luzon College of Business Administration THESIS CONSULTATION Consultation No 1 Major Topicis Proposal Defense Preparation Name of Student Jessica W. Smith Thesis Tite, Machine Leaming Applications in Healthcare Data Analysis Location: Ubrary Research Area Date of Consuttation October 10, 2025 Time _12 30 13 30 BO COMMENTS: Sis results and interpretation. Claried Proper presentation of Ghantitative findings. Discussed implications of results and their contibution to the field. Advised ©” Prepating for defense presentation Mr. Ashley Cooke, Ed D. Name and Signature of Thesis Consuttant"
    },
    {
        "image": "consultation2_synth_11_aug3.png",
        "label": "consultation",
        "ocr_text": "Republik ofS oe MICHAEL VALE UNIVE! \"aarienme wate, LUZ\" college of Business Resriiattation “PHE RI COAULTATION Sonsatation 82 Proposal Deforse: Peeparetion saajer Topic s javaica W. Seeith 8 Mame ot Studere Heaithoare Bata Anais Thess Te pisckene Leaning Apaticatens {.gcaon. Libeary Senzarch Ave Tene AER en trate ot Consutaon. Qetabes 38, ee COMMENTS: tation. Clantind proper peesaration é Reviewed utatatieat analyze sedis ara hsorpre quantal findings. Discusseeh realtors of sos ad tle combmON the fiald. Advised nso prasetation on preparing for deters"
    },
    {
        "image": "consultation2_synth_11_aug4.png",
        "label": "consultation",
        "ocr_text": "Ha Repubte aiopines HAEL VILLE UNIVERSITY Adrienne vile, Luzon College of Susinans Administration THESIS CONSULTATION ‘Consultation Na n Mager Topics Proposal Gefense Preparation Name o Student dassica W. Seniths Thesis Tite ‘Machine earning Appiicavons ir, Hesitecare Date Aniaiyeis Locate Library Research Arma ysis remuin Guantitative findiege. Diccussed imp (0A preparing for tefemae aresectation Nsine and Signatee of Thesis Consutant Of Consistation October 19, 2625 and ieteepretation, Claitied proper seenantation af Cations of reaults and their conmmbution to the flold. Advised"
    },
    {
        "image": "consultation2_synth_11_aug5.png",
        "label": "consultation",
        "ocr_text": "Republic of the Shppines MICHAEL VILLE UnIvERSrry ne Vie Lu: won FESS fone TATION Proposal Dsiense Preparation Thesis Tse Machine Leaning 4 lie nate Data Anatysis Location Ubrary Research Atay / conmeers: Ri Wed Statistical analysis resuits quanti We Firings. Discey On preparing for defense pease: nd Interprotation, Clarion ations of esstits are t Proper presentation of Soeribution ta the field, Ao atation, sect Mr. Ashiey Cooke, ea"
    },
    {
        "image": "consultation2_synth_12_aug1.png",
        "label": "consultation",
        "ocr_text": "Republic of the Philippines STEVEN VILLE UNIVERSITY Mario Ville, Mindanao College of Nursing THESIS CONSULTATION Consuttation No 1 Major Topicis: Statistical Analysis Procedures Name of Student: Michelle F. Hughes Thesis Tite. Financia Literacy Programs for Young Professionals Location Faculty Office, Building A Date of Consuttation; October 29, 2025 Time: _9 30 10 00 COMMENTS: Examined draft chapters and provided constructive feedback on content organization and Coherence, Discussed improvements needed in introduction and background sections Emphasized importance of maintaining consis Mrs. Barbara Balley, Ed D Name and Signature of Thesis Consuttant"
    },
    {
        "image": "consultation2_synth_12_aug2.png",
        "label": "consultation",
        "ocr_text": "ipnines N VILLE UNIVERSITY. Maris Ville, Mindanao Cottage of Nursing THESIS COMBULTATION ‘Commrtation No. 4 Siajor Topics: Stelistical Analysis Procedures mation: Tine: COMMENTS: camnined draft chapters and provided coheranca, Olscussedi fn Eniphasized importance o structive feedback on content erqinizaiion and vovarenis needed in intmdsction and background see fintaining consistency in lartainology throughout the maresscript fone."
    },
    {
        "image": "consultation2_synth_12_aug3.png",
        "label": "consultation",
        "ocr_text": "hari Ville, Micaanae Cetiege of Nursing THEMIS CONSULTATION Statistical Analysts Precedums Cansutaton inelio Hughes erscy Programs for Young Ora Time _8 30 5099 COMMENTS: on content ciganization and coherence. Discuasad linprorsments needed in intraducilon and Background sections Emphasized impartannie of maintaining consistency iv tenwinology throughout the manuscript Name ang Signature ot Thests Constant"
    },
    {
        "image": "consultation2_synth_12_aug4.png",
        "label": "consultation",
        "ocr_text": "Repubss ot tte Prismpines STEVEN VILLE UniveRStTy Mario Vite, ¥y Cotoge of Nursing THESE CONSULTETION: Consuttatin 4 Bigjor Topless Statistinal Analysis Pracedurns Naine of Shigent Michels F. Hughe: Theme Tite Pinarciat Lisiecy Programs tor ¥ey ong Pretessionaly Locetian, te ot Covsiattation: COMMENTS: Examined draft chapters 386 provided congtnss Feerlback on content sigonization and Sted improverneets teeedad in introduction and background suet porsace of rreintaining consistane. Cy In terminology tircuagnaut the Ecphesignd ivy Franusciipt, MIS. arbara Batley, gap, Name and iS Comite aprahine ot They"
    },
    {
        "image": "consultation2_synth_12_aug5.png",
        "label": "consultation",
        "ocr_text": "Ss Ss Michelle Financial Ls COMMENTS: Examined dreft chaptacs zoherence, Discuss Emphasized iinpetance of ma provided const Improvements need: ab ieoines TEVEN VILLE UNIVERS? Mario Gane College of Musing YHESIS CONSULTATION Statistical Analysis Procedures Hughes acy Programs for Young Prot TY"
    },
    {
        "image": "consultation2_synth_13_aug1.png",
        "label": "consultation",
        "ocr_text": "Reputite of re Pp og MARIA VILLE STATE COLLEGE Avthur Vite, Mindanao Cohege of Education THESE CONNULTANON Cansuttaton No 3 Major Topiers Pasearci Ethics and Preto Hare of Studer Johnathan Magee Theds Tee: Cornmiunity- Besse Tourism Develepmein Seatnies arabe Research Center, Und Foe Qete of Getower 34, 2026 Tame: CoRMENTS: Reviewed siatinical analysis results and Intospratation. Chated emper presentation ef quantitative findings. Discussed implications of resus and thee sorinibution fo the field Advised (Gn prepsiing tor defense presentation, Ak Lee Wailase Name and Skyisture of Thesis Consuttant"
    },
    {
        "image": "consultation2_synth_13_aug2.png",
        "label": "consultation",
        "ocr_text": "Rega the Phiopines MARY A VILLE STATE couy EGE Attbur Vite, Minganas College oF Education THESE SORSUL TATION Reseach Ethics and Protacels scimettan 0. Stegee esis tae Communisy Rasast Fourism Secotopment sie Latation: Dale of onsstation Time 1399 4139 conmMRNY: Reviewad Siadstice analysis residis Reestitatls findings. Discusnedt 89 foparing foe detecse ones 6rd INetpratation, ‘rophcations of restits erties, Claeified proper pos Bertetion of and thee “onthitaiion to the Ral Advised"
    },
    {
        "image": "consultation2_synth_13_aug3.png",
        "label": "consultation",
        "ocr_text": "apc Of the Prainpines MARIA VILL Artin Ve THESIG CONRULTATION Consuitation ia, 2 Rar Togicds, Reseach Ethos seg Prstocs Nara ‘Student: Jolmathan D. Mogan Thesis Tite Conersinily Based Tourism Develogmen Strtegiog Location Sate of Consutaton COMMENT: Recinwsd slatistical analysts revaite and inleqrotation. Ciatfled Srantiiative finding. Kscussed implications of results gavt oF praesating for dofense presente SrOpE! pmgeontion eb their contiitution to the fiakt. Advice 3a Lee Wallace, 8. Eng Name and Signature of Thesis Conzunane"
    },
    {
        "image": "consultation2_synth_13_aug4.png",
        "label": "consultation",
        "ocr_text": "Republic of the Philippines MARIA VILLE STATE COLLEGE Arthur Ville, Mindanao College of Education THESIS CONSULTATION Consuttation No, 9 Major Topics: Research Ethics and Protocols Name of Student Johnathan D. Megee Thesis Tite: Community Based Tourism Development Stategies Location: Research Center, 2nd Floor Date of Consultation: October 24, 2025 Time: _13 30 11 30 Swentitative findings. Discussed implications of results ‘and their contribution to the field. Advised ‘on preparing for defense presentation, Mx. Lee Wallace, Eng, Name and Signature of Thesis Consuttant"
    },
    {
        "image": "consultation2_synth_13_aug5.png",
        "label": "consultation",
        "ocr_text": "Republic of the Philippines MARIA VILLE STATE COLLEGE Arthur Ville, Mindanao College of Education ‘THESIS CONSULTATION Consultation No. 9 Major Topics Research Ethics and Protocols Name of Student _Johnathan D. Mcgee Thesis Tite ‘Community Based Tourism Development Strategies Location: Research Center, 2nd Floor Date of Consuitation: October 24, 2025 Time: _13 30 11 30 COMMENTS: Reviewed statistical analysis results and interpretation. Clarified proper presentation of ‘quantitative findings. Discussed implications of results and their contribution to the field. Advised ‘on preparing for defense presentation, Mx. Lee Wallace, D Eng. ‘Name and Signature of Thesis Consultant"
    },
    {
        "image": "consultation2_synth_14_aug1.png",
        "label": "consultation",
        "ocr_text": "Republic of the Phitipgines KAREN ViLLE UNIVERSITY Bret vite, Luzon Soliege of Businers Admivisyation THESIS CONSULTATION ‘Consuitzion Ry, 4 Saajor Togenss Propoual Dulanse Preparation Name of Student Conatray V. Perex Thesis The Financiat Literacy Programs jor Young Professionals Research Center, 25 COMMENTS: Evaluated conciusions and reccmmendations chaptye. Suggesier mprovaments ip etvengthen relbution to knowhodge, Discusasd practical implications end futur research dections Crorall wogues is satiol faciasy aed a ic. Henry Orezce, 4D. fame and Signature of Thesis Dew"
    },
    {
        "image": "consultation2_synth_14_aug2.png",
        "label": "consultation",
        "ocr_text": "Republic of ine KAREN VILLE UNIVERSITY Brett Vile, Luzon College of Business Administiation THESIS CONSULTATION Consustabon 0 1 Major Tooker Propose! Delonse Preparation Name of Student —_Courtnay V. Perez Thesis Te Pnancal Literacy Programs for Young Professiona s Time: 12 0017: COMMENTS: Evaduated conclusions ond recommendations chapter. Suggested improvemerus to strengition contribution to kewodge. Discussed crectical implications and futwre researc directions, Overall progcess is satisfactory and on schwchse. Mt Hensy Orozco, Ed D Name and Signature of Thesis Consutant"
    },
    {
        "image": "consultation2_synth_14_aug3.png",
        "label": "consultation",
        "ocr_text": "Republic of the Philippines KAREN VILLE UNIVERSITY Brett Ville, Luzon College of Business Administration THESIS CONSULTATION Consultation No 1 Major Topic s: Proposal Defense Preparation Name of Student' Courtney V. Perez Thesis Title Financial Literacy Programs for Young Professionals Location: Research Center, 2nd Floor Date of Consultation: October 14, 2025 Time: _12 00 17 30 COMMENTS: Evaluated conclusions and recommendations chapter. Suggested improvements to strengthen contribution to knowledge. Discussed practical implications and future research directions. ‘Overall progress is satisfactory and on schedule. Mr. Henry Orozco, Ed D. Name and Signature of Thesis Consultant"
    },
    {
        "image": "consultation2_synth_14_aug4.png",
        "label": "consultation",
        "ocr_text": "LE UNS Bren Ving, Luzer Conleste oF Brcinmas Admioastration THESIS CONSULTATION Eagema’ Dedanse Preperation ame at tune Cautiner Perer Thetis \"Me Fina) y Programs te Young s Hersch Conte ona Agasied improvements to sirenathen sumctions nciusiass and recarinendations cheoter na Ye rnoadadye Cisccrsgest peacticas empic ations ant frre rw. Ovesal poaguns 18 setista: tery and on echecie A denry Orozco. FAD ws Surat"
    },
    {
        "image": "consultation2_synth_14_aug5.png",
        "label": "consultation",
        "ocr_text": "Rapubitc of the Pritippines KAREN VILLE UNIVERSITY ‘Brett Vile, Luzon Catioge of Business Adminietratias THESIS CONSULTATION ‘Consuitation No. 1 Major Topicls Proposal Defers Preparation Name ct Stisent Courtney V_ Perez Thess Tite: Finvenccas toraey Programs fo: Young Professnn ait per Reseerch Center, Znd Floor COMMENTS: Evaluated conclusions end recommendations chapter. Suggested improvements to strengthen contuibuion to knowiedge. Discussed practics! implications and future research direcilons, ‘Grrovall progress is satisfactay and on schedule tr. Henty Orozce, Ed. Name and Signature of Thesis Consutart"
    },
    {
        "image": "consultation2_synth_15_aug1.png",
        "label": "consultation",
        "ocr_text": "Repubtc of the Pruippines JULIE VILLE UNIVERSITY Zachary Ville, Luzon College of Education ‘THESIS CONSULTATION Consuttation No 5 Major Topic s: ‘Statistical Analysis Procedures Name of Student Donna V. Snyder Thesis The: ‘Mental Health Awareness Among College Students Location: Research Center, 2nd Floor Date of Consuttation October 14, 2025 Time: _10 00 14 30 COMMENTS: Examined draft chapters and provided constructive feedback on content organization and ‘coherence. Discussed improvements needed in introduction and background sections. Emphasized importance of maintaining consistency in terminology throughout the manuscript. ‘Mx. Nathan Perry, D Eng. Name and Signature of Thesis Consuttant"
    },
    {
        "image": "consultation2_synth_15_aug2.png",
        "label": "consultation",
        "ocr_text": "c af the Philopines WILLE UNIVERSITY: y ville LUZOR college of Education YHESIE CONSULTATION is Procedure Donna ¥. Sayder isi Higelts Awarsarass Arnot Theva THe ate of Canguitation COMMENTS: Examined diaft chapters and provided constructive cohevenas, Discussed improvements neaded in intigduction an bes of maintaining conwisteney in terminology throughout the sedveck on content organization ane chegramd sections. manuscript"
    },
    {
        "image": "consultation2_synth_15_aug3.png",
        "label": "consultation",
        "ocr_text": "Regubis of ne Paligeines: JULE VILLE UNIVERSITY chary Ville, Luxor Coliege of Education THESIS CONSULTATION atabon Ro. 5 n Topicts: Statistical Snalyais Procedures Name of Student Denna V. Snysar Yeats Tate: Rental Health Anareness Among College Students Location Research Contes, Znd Floor Bate of Consigtaion, Cctobar 14 SOWMERTS: amined daft chapters and provided corte sherance. Discussed lingrovement v8 feedback on content fod in intensiaction anid backgrou: sistency int srizat sections. nology throughout the roar Mx. Nathan Per esis Consutant Name and Signature of 7"
    },
    {
        "image": "consultation2_synth_15_aug4.png",
        "label": "consultation",
        "ocr_text": "THESIS CONSULTATION Consuitatien No. 8 aasjor Tepicis, Statistical Analysis Procedures Name o sent, Donna V. Sryctar 8 THe: Lacasion tate of Consuatation COMMENTS; Examined daft cl pters and provided constructive feedback on content organization aed coherence. Oiscussed Improvements neesied it introduction and bac Emphasized imporiance of maintaining"
    },
    {
        "image": "consultation2_synth_15_aug5.png",
        "label": "consultation",
        "ocr_text": "Repulte of the Ptvippings JULIE VILLE UNIVERSIry Fachary Vite, Guzen College of Education THESIS consi Tangy Cansuitation re Analysis Prncedures Berna ¥. Snyder Monts! Heat Awarenoas Arcorg Colege Students Researe! Ge h Center, 2nd drat chapiors anc rn vided consinictives Dissiusved impcoren Rents needed ins int “Importance of ssaintaining eRSisteney ton sexi Sections Toughoust the man, ‘oduction and backgrowy in teeminsiogy ¢"
    },
    {
        "image": "consultation2_synth_16_aug1.png",
        "label": "consultation",
        "ocr_text": "Renubite of tra ALAN Vil LE STATE UNIVERSITY Viffany Ville, Luzon ge of Computer Science HESS CONSULTATION Consults Malar Topics Statistion! Analysis Pescedures Community Saxe Tousiem Developer uses Ultice, Recm 201 COMMENTS. Discunsed progre D. bie. Shannon Dixon, £"
    },
    {
        "image": "consultation2_synth_16_aug2.png",
        "label": "consultation",
        "ocr_text": "af the PREDpIO STATE UNIVERSITY Tiffany Vite, Luzon Rep ALAN VI Collage of Computer Science THESIS CONSULTATION Consuitabe 18 Statistica! Analy Robert Naive of Shute Yess Tate Conymunity- Based Tourism Develonreent Skategies Location: Date of Consul COMMENTS: Discussed progress on literature review and identification of rosesrch gaps. Provided guidance on synthesizing existing studies and developing conceplual framework. Stuient shiz expand on theoretical foundations n nent sat Me, Shannon Dixon, Name and Signature of Thesis Consus"
    },
    {
        "image": "consultation2_synth_16_aug3.png",
        "label": "consultation",
        "ocr_text": "Reputuc of tr ALAN VILL Ti lany Vile Luzon College of Computer ence THESIE CONSULTATION Rab NO tg Statistical Analysis Procedures Robert Flo Thesis The Communiy Sased Touran: Devsi ment St ication of research saes, Provived quidsnce on syathes' i Fraenemens, Student pand or thectett 8 and develop I foundations in next daft Mr. Shannon Don. Ed D"
    },
    {
        "image": "consultation2_synth_16_aug4.png",
        "label": "consultation",
        "ocr_text": "Reputtic ALAN VILLE si “Tifany Vile, Goiege of Computer SENCE sia Prowedures name of Thesis THe iacaton Dale af SORNENTE: ricqussed progress on oaratere FENCE apd Identification of developing concern! feamawank Stsgent sho jating stuties 205 pi, Shannon Buon, ED ‘gna Signature af Thesis onsumtant Narn"
    },
    {
        "image": "consultation2_synth_16_aug5.png",
        "label": "consultation",
        "ocr_text": "Republic of the Philippines ALAN VILLE STATE UNIVERSITY Tiffany Ville, Luzon College of Computer Science THESIS CONSULTATION Consultation No. 13 Major Topicis: Statistical Analysis Procedures Name ot Student __ Robert F. Flores Thesis Tite: ‘Community Based Tourism Development Strategies Location: Graduate Studies Office, Room 201 Date of Consultation: October 25, 2025 Time: 15 30 16 00 of research gaps. Provided guidance on Discussed progress on literature review and identification Student should expand on synthesizing existing studies and developing ‘conceptual framework, theoretical foundations in next draft Mr. Shannon Dixon, Ed D. Name and Signature of Thesis Consultant"
    },
    {
        "image": "consultation2_synth_17_aug1.png",
        "label": "consultation",
        "ocr_text": "Republic of the Prippines SEAN VILLE STATE COLLEGE Alicia Ville, Luzon College of Business Administration THESIS CONSULTATION 15 Consuttabon No Research Ethics and Protocols Major Topic s Ashley R. Thompson Thesis THe sustainable Urban Development A Case Study Approach Name of Student Location ‘Online via Zoom Time _930 17 00 Date of Consultation October 26. 2025 COMMENTS: ‘Examined draft chapters and provided constructv Coherence, Discussed improvements needed in introduction Emphasized importance of maintaining consistency in termi 1e feedback on content organization and ‘and background sections inology throughout the manuscript Mrs. Jonathon Cobb, 0 Eng f Thesis Consultant Name and Signature"
    },
    {
        "image": "consultation2_synth_17_aug2.png",
        "label": "consultation",
        "ocr_text": "Republic of the Philippines SEAN VILLE STATE COLLEGE Alicia Ville, Luzon College of Business Administration THESIS CONSULTATION Consultation No. 15 Major Topicis: Research Ethics and Protocols Name of Student’ Ashley R. Thompson Thesis Title: ‘Sustainable Urban Development: A Case Study Approach Location: Online via Zoom Date of Consultation: October 26, 2025 Time: _9 30 17 00 COMMENTS: Examined draft chapters and provided constructive feedback on content organization and Coherence. Discussed improvements needed in introduction and background sections. Emphasized importance of maintaining consistency in terminology throughout the manuscript Mrs. Jonathon Cobb, D Eng. eS Name and Signature of Thesis Consuttant"
    },
    {
        "image": "consultation2_synth_17_aug3.png",
        "label": "consultation",
        "ocr_text": "Republic of tre Pruinpines SEAN VILLE STATE COLLE! Alga Vite, Lazer Golloge of Huxinoas Adninisiration THESIS CONTULIATION Consutatien No 18 Soar Topscts: Raweasch Ethics and Protocols Hams of Studers Ashley 2. Thompson ‘Thesis Tite: Scatainatie Umass Davelonment: A Case Stity Aneta on Gang sia Zoom srutation Crtober 2 Date COMMENTS: Exatnined draft chaniors and provided conutuctive feedback on osnten coherence, Discussed improvements neadad i introduction ang bec organization and nd seations Emphseized impactance of maintaining consistency in tarninology throughout te manasesipt Name ana Signature of Thesis Cansuft"
    },
    {
        "image": "consultation2_synth_17_aug4.png",
        "label": "consultation",
        "ocr_text": "Republic of the Philippines SEAN VILLE STATE COLLEGE Alicia Ville, Luzon College of Business Administration ‘THESIS CONSULTATION Consultation No 15 Major Topic s Research Ethics and Protocols ‘Ashley R. Thompson Name of Student sustainable Urban Development: A Case SI Thesis Tite tudy Approach Location: Online via Zoom Time. _9 30 17 00 Date of Consuttation: October 26, 2025 COMMENTS: Examined draft chapters and provided constructive feedback on content organization and Coherence. Discussed improvements needed in introduction ‘and background sections, Emphasized importance of maintaining consistency in terminology throughout the manuscript Mrs, Jonathon Cobb, D Eng. Name and Signature of Thesis Consultant"
    },
    {
        "image": "consultation2_synth_17_aug5.png",
        "label": "consultation",
        "ocr_text": "SPitgnines FE COLLEGE Alice: Vite, Luzon College of Bustiese Administration THESIS CONSULTATION 18 esearch Ethics and p, ‘ocels Astiey 8. Thompoor NC HMan Bovetapman: Ssae Siucy Approaciy ined drait cha nee. Discuss: Empasizsd muon, pier nt Onganization are) ‘ound sections, Menninclogy thraugheet the foduction sind be ing consistency aoe OF rPalnta Pranuscript"
    },
    {
        "image": "consultation2_synth_18_aug1.png",
        "label": "consultation",
        "ocr_text": "Repuciec of the Pretippines MICHEAL VILLE UNIVERSITY Bian Vite, Mindanso ‘Coftoge of Business Admunistration THESIS CONSULTATION Consumaban No Ww Staqor Topics Urerature Review and Theoretical Framework Name or Student Mare R Madina Thesis Tee Penewacts Energy Syn for Remote Communiees Location Usary Research down Date of Consumaban October 13 2025 Fee 160016900 cosmasnrs: Discussed researci mothodniogy and sampling procedures. Student needs to revise the ‘theoretical framework to better atign with research objectives. Recommended additional iterature sources for cornprehensive review. Hhext consultation schedulad to review revised metroslogy chapter. Mx. Jamie Cunningham, E 0 Name and Signature of Thesis Consutant"
    },
    {
        "image": "consultation2_synth_18_aug2.png",
        "label": "consultation",
        "ocr_text": "Republic of the Philippines MICHEAL VILLE UNIVERSITY Brian Ville, Mindanao College of Business Administration THESIS CONSULTATION Consultation No. 4 Major Topic s: Literature Review and Theoretical Framework. Name of Student. Marc R. Medina Thesis Tite: Renewable Eneray Systems for Remote Communities Location: Library Research Area Date of Consultation: October 13, 2025 Time: _16 00 16 30 COMMENTS: Discussed research methodology and sam theoretical framework to better align with research objec sources for comprehensive review. Next consultation sc! chapter. ipling procedures. Student needs to revise the tives. Recommended additional literature heduled to review revised methodology Mx. Jamie Cunningham, Ed D. OO Name and Signature of Thesis Consultant"
    },
    {
        "image": "consultation2_synth_18_aug3.png",
        "label": "consultation",
        "ocr_text": "Republic of te Priippines MICHEAL VILLE UNIVERSITY Brian Vile, Mindanao College of Business Administration THESIS CONSULTATION Consuttaton No W Major Topicis Uterature Review and Theoretical Framework Name of Stugent Marc R Medina Thesis Tite Renewable Energy Systems for Remote Communities Location Ubrary Research Area Date of Consuitation October 13, 2025 Mx Jamie Cunningham, Ea D Name and Signature of Thesis Consutant"
    },
    {
        "image": "consultation2_synth_18_aug4.png",
        "label": "consultation",
        "ocr_text": "Republic of the Philippines MICHEAL VILLE UNIVERSITY Brian Ville, Mindanao College of Business Administration THESIS CONSULTATION Consultation No Major Topic s: Literature Review and Theoretic Name of Student Mare R. Medina Thesis Title: Renewable Energy Systems for Remote Communities Location Library Research Area Date of Consuttation: October 13, 2025 Time. _16 00 16 30 COMMENTS: Discussed research methodology and sampling procedures. Student needs to revise the theoretical framework to better align with research objectives. Recommended additional literature sources for comprehensive review. Next consultation scheduled to review revised methodology chapter. ‘Mx, Jamie Cunningham, Ed D. Name and Signature of Thesis Consultant"
    },
    {
        "image": "consultation2_synth_18_aug5.png",
        "label": "consultation",
        "ocr_text": "Republic of the Prulippines MICHEAL VILLE UNIVERSITY Bran Ville, Mindanao College of Business Administration THESIS CONSULTATION Consuitabon No Major Topic s Literature Review and Theoretical Framework Name of Student Marc R Medina Thesis The Renewable Energy Systems for Remote Communites, Location Library Research Area Date of Consutation October 13. 2025 Time 16 00 16 30 COMMENT! Discussed research methodology and sampling procedures. Student needs to revise the theoretical framework to better align with research objectives Recommended additional literature sources for comprehensive review Next consultation scheduled to review revised methodology chapter Mx. Jamie Cunningham, Ed D Name and Signature of Thesis Consuttant"
    },
    {
        "image": "consultation2_synth_19_aug1.png",
        "label": "consultation",
        "ocr_text": "Republic of the Philippines JILL VILLE STATE COLLEGE Brian Ville, Luzon College of Psychology THESIS CONSULTATION Consultation No 12 Major Topic s Research Methodology and Design Name of Student Timothy B. Gregory Thesis Tite ‘The impact of Social Media on Consumer Behavior Location Online via Zoom Date of Consultation October 05, 2025 Time _12 00 13 00 COMMENTS: Examined draft chapters and provided constructive feedback on content organization and coherence. Discussed improvements needed in introduction and background sections. Emphasized importance of maintaining consistency in terminology throughout the manuscript Mrs. Briana Blair, Ph D. Name and Signature of Thesis Consultant"
    },
    {
        "image": "consultation2_synth_19_aug2.png",
        "label": "consultation",
        "ocr_text": "Republic of the Phivippines JILL VILLE STATE COLLEGE Brian Ville, Luzon College of Psychology THESIS CONSULTATION Consultation No 12 Research Methodology and Design Major Topic s: Name of Student: ‘Timothy B. Gregory Thesis Tite: “The Impact of Social Media On ‘consumer Behavior Location: Online via Zoom time _12 00 13 00 pe ot consutaton, osha 0, 2025 constructive feedback on content organization and sections. 'S: ‘Examined draft chapters and is ements needed in introduction and ‘background rs. Briana Blair, PrD- Name and Signature of Thesis Consultant"
    },
    {
        "image": "consultation2_synth_19_aug3.png",
        "label": "consultation",
        "ocr_text": "ve of the Prappine ALLE STATE Bran Wile, Luz ALLY Coilege of Psychology THESIS CONSULTATION Timothy 8 Sieger Name ot Seudent nan on content exyaniza! ons, piers and provided sega in initeduetion and becky! ney Ih tenninciogy threaghe nents nearing manuscipt"
    },
    {
        "image": "consultation2_synth_19_aug4.png",
        "label": "consultation",
        "ocr_text": "Republic af tne PrAIDDINES STATE COLLEG THESIS CONSULTATION Consutaton Ro 2 earch Methadology and Beslan: saajor Tonicés Timathy 8. Gregory mame of Studer “tne bmpact of Socia Media on Gongumer Bekavior neais THE Loca ate of Gonsuttation OMMENTS: Exarcined draft chapters and provided constnicine feadback on content organization ar conmence, Discussed Improvements needed a introduction and background sections Emphacized importance of maintaining renninetogy throught the manuscrirt soeaistency Mes. fi ana Slat, &n D. Name ans Signa consi of Thesis"
    },
    {
        "image": "consultation2_synth_19_aug5.png",
        "label": "consultation",
        "ocr_text": "Republic of the Praippines JILL VILLE STATE COLLEGE Brian Ville, Luzon College of Psychology THESIS CONSULTATION Consuttabon No 12 Major Tapicis Research Methodology and Design Name of Student Timothy B_ Gregory Thesis Tee ‘The Impact of Social Media on Consumer Behavior Locaton Online via Zoom Date of Consuitation October 05, 2025 Time _12 00 13 00 COMMENTS: Examined draft chapters and Coherence Disc: Emphasized Provided constructive feedback on content organization and usSed improvements needed in introduction and background sections Importance of maintaining consistency in terminology throughout the manuscript Mrs. Briana Blair. Ph D Name and Signature of Thesis Consuttant"
    },
    {
        "image": "consultation2_synth_20_aug1.png",
        "label": "consultation",
        "ocr_text": "DAVID VILLE STATE THESIS CONSULTATION Major Topic s Boia Collection and Analysis Name of Stutent Kimbody R Chavex Thesis We Sivsts Urban Development, 4 Case Stury Ap Faculty Office, Building A uy and 1 batter aign with research objectives, Recon tation sot rohensive raview. Next cons uted to review 1m Cr Gran Cooper. Ph D sultant"
    },
    {
        "image": "consultation2_synth_20_aug2.png",
        "label": "consultation",
        "ocr_text": "Cooper Pr Frese DAVID it Le STAT 4 iigetinn and Analysis Kimbeny 2 OR Schedule to 4 nenIEd dain, ley revised methage!"
    },
    {
        "image": "consultation2_synth_20_aug3.png",
        "label": "consultation",
        "ocr_text": "Regubee af the Pate DAVID VILLE STATE UNIVERSITY Angela vibe, Visayas Colinge of Engineering THESIS CONSULTATION Data Coliaction: and Analysis Kimboty R. Cravez thesis THE systamnavie Urban Devetopment A Save Stay AnnG ats kame of Student Faculty of Location cect consuxanc time 19, 200% Con RAENTS: Piacussad research methodalagy and sampling Oca sSs Student seeds to ravine the theoretical (ramawork 19 bettas align with research objec 8 Recommancied ecditions! Heeraere coos fr comproteensive review, Next consultation scheduled to review revised methodology so sis Gonsuttart"
    },
    {
        "image": "consultation2_synth_20_aug4.png",
        "label": "consultation",
        "ocr_text": "ESTATEL ei Ville, Engineering THESIS CONSULTATION lIsction and Anatysi ly R Chavez Time _46 00 27 30. COMMENTS: Discussed research rn ical tramewark te ig procedufes. Student needs to revise the h objectives. Recomin athodelogy and sain ext rodelogy Dy, Brian Cuore consultant"
    },
    {
        "image": "consultation2_synth_20_aug5.png",
        "label": "consultation",
        "ocr_text": "DAVID VILLE STATE UNIVERSITY ville, Visayas THESIS CONSULTATION Consultation Ne 4 spicls Date Collection and Analysis Name of Stade: Kimberly 8. Chavez ra Shudy Appian re"
    }
]