[
    {
        "image": "coursesyllabus1_synth_10_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Manda, Metro Manda Course Syllabus Department: Desarment of Engh and Ltertie Date: First Semester, AY 2028 2028 1. Course Prefix and Number: ENG 103, Course Name: Academic Writing and Research ‘Credit Hours and Contact Hours: 3 unas (3 hours lecture) Catalog Description including pre- and co requls ‘This course develops students’ academic witing and research skis essential for colegeevel work. Students willeam to wiie clear, coherent, and weborgenized ‘academic exsays and research papers folowing standard conventions. Emphasis placed on catia! thinking, proper ctation, research methodology. and ethical ‘scademic practices. Prerequistes: ENG 101. Co requiste: None. Course Outcomes and Objectives ‘Student Learning Outcomes: 1. Compose weltorganized academic essays demonstrating clear thesis statements, ‘ogical development, and etfective argumentation, 2, Conduct systematic esearch"
    },
    {
        "image": "coursesyllabus1_synth_10_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Mania, Metro Manda Course Syllabus Department: Deparment of Engish and Lteatze Date: Frat Semester AY 2025 2028 Course Profix and Number ENG 103 ‘Course Name Academic Wriing and Research Credit Hours and Contact Hours. 3 unts (3 hours lecture) Catalog Description including pre- and co requistes: ‘Ths course develops students’ academc wring and research sts essental for colege evel wort. Students willeam to wrte clear. coherent, and weoranced ticademe essays and reseaich papers folowng standard conventions. Emphasis placed on ert thnkng, proper ctaton, esearch methodology, and ethical scademe practees. Prerequistes: ENG 101. Covequate: None, ‘Student Learning Outcomes: 1 Compose wel organized academe essays demonstrating clear thesis statements logeal development. and effectve argumentation, 2. Conduct systematic research sng approprate sources nctudng lbrary databases, scholaty jumals. and cradle fonine resources, 3, Integrate sources effectively through proper quotation, araphrasing, and ctaton folowing APA or MLA style guidelines, 4, Demonstrate crtical thinking skis by analyzng, synthesizing, and evaluating information from multiple sources. 5. Apply ethical academe practoes meudng proper attrbuton, ‘avoiding plagiarism, and mantainng academe ntegrty all writen work"
    },
    {
        "image": "coursesyllabus1_synth_10_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Mania Met Manta Course Syllabus Department: Oesarment of Engish ang tertce Date: Fest Semester. AY 20252028 Course Prefix and Number: ENG 103 ‘Course Name Academe Wring and Research ‘Credit Hours and Contact Hours: 3 unas (3 hours lecture) Catalog Description including pre and co requites: ‘Tha coure develops students academe wing and esearch sks essential for colegeseve! wom Students wi eam to wrte Gear coherent and weboranced academe essays and research papers folowng standard conventions Emphasa placed on etal thnking, proper ctaton, esearch methodology, and ethical ‘scademe practoes, Prerequates: ENG 101, Covequiate: None 1 Course Outcomes and Objectives ‘Student Learning Outcomes, 1. Compose wetorganed academic essays demonstrating clear hess statements, ogee! development and etectve argumentaton 2 Conduct systemate research ‘sng appropnate sources moudng leary databases, scnolary pumas and credoe nine weiources 3 Integrate sources etectvey tough prope! quotation araphvasng. and ctaton folowng APA or MLA styie gudeines 4 Demonstate ertecal inkng sks by anayang. smntheszng. and evatuatng nformaton fom mutes sources Anply etvea! academe practoes neudng prope’ atvbuton, avodng plagaram and mantaning academe ntegrty nal weten wort,"
    },
    {
        "image": "coursesyllabus1_synth_10_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Mania, Metro Manis Course Syllabus Department: Desariment of English and Literature Date: Fest Semester, AY 2025 2028 1. Course Profix and Number: ENG 103 Course Name: Academic Wriing and Research ‘Credit Hours and Contact Hours: 3 unas (3 hours lecture) Catalog Description including pre and co requisites: ‘This course develops students’ academic witing and research skis essential for colege evel work, Students willeam to wete clear, coherent, and web organized academe essays and research papers folowng standard conventons. Emphass placed on esta thinking, proper etaton, esearch methodology. and ethical ‘academic practoes. Prerequistes: ENG 101. Covequiste: None. Course Outcomes and Objectives ‘Student Learning Outcomes: 1. Compose welkorganized academic essays demonstrating clear thesis statements, local development, and effective argumentation. 2. Conduct systematic research sng appropnate sources inciuding lbrary databases, scholary joumals, and cradle ‘onine resources. 3. Integrate sources effectively through proper quotation. Paraphrasing. and ciation folowing APA or MLA sive uidelnes. 4. Demonsiate ‘emteal thinking shits by analyzng. synthesizing, and evaluating formation from ‘muitisle sources. 5. Apply ethical academic practioes including proper atbution, ‘voiding plagiarism and maintaining academic ntegrty in all witten work"
    },
    {
        "image": "coursesyllabus1_synth_10_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": ""
    },
    {
        "image": "coursesyllabus1_synth_1_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSm V OF SANTO TOMAS ance, St ana Couto Sytistug of aihamaten Shot Senet ay sumone Berantmont: De parmens Baie: 5 Conse Prats on ris Conte Name Ca TH 205 wih Sosivee Seomeiry Hours Scat Hous god Contest Fours festa) ‘Setcea Hencrten inka are and corequsany, Dre 20 cova steresel sed otegas ea ta of erm vant Ln ma eal wd conpcatcan sey Tepe £409, enloasns of dena wagts inotate ts, ecru SU, ac srpbcacans of Satins todertanng and wantin “stage Aira a0 Teromesy, Geet: None Gewes Sitceres ane Objsnines Stet Leaening Outcomes Sentaon Setrivaton arobiaers tng toate ain? sting, and maton anatan tne Be ood narnia tingrainn teenies meme na 208 pata Ruston SHON By S, Aen dane iegiv to ead parpiane Svnhing am, hee, a3 igh, Hrd we in varus osresie"
    },
    {
        "image": "coursesyllabus1_synth_1_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SARTG TOMAS: bear, eno as Sourse Spliakos bosertuant: Canaan af Matnemates esse: ase Sumeriee, WY DDB 1 Seems Prfic ane tumor MATH 26; ourne Hama: Casi eth Analytic Geomaty cent ewes and Gomtact Mowrs. gus B Rou Hecker) ‘patatog Bescrption tort 1g es and artwanssies Tou neue coves deri a otagia sais of hntions of one wosatie wth lenphas 29 anaytea a onnastanera ode Tupi Haute oes, ean ‘Seovaiwes, aan ef soma, vtagaten tects. ane arenes begs, To sauna emahaueet Bath eure! urdacctanng ano peat prscnchins Prceantes: Cotte Ages and Teigersmety Covecesae: Hsce tees i. coures Outsonion one Cbjeceos ‘Suduat Laaméng Dutra +. Bradgate fini of enone us vaca “eshgae istceing 3 aniailation, Reptats wa, ene gresivoal anayes. 2. Campace deceives of dant, bigenamatis, ompunentel, Art epaniimie functors usng efareatiston fons exe testrumves 9 Aap daeruetiwe sencepts to salve ostentzaion grazie, luted rales, seve adeiGting, nd minke analjs problems 4, Eemaene ee gras Jeing tundernents iteginten tecinaues uaa yrs ta cobra pradienme ineniving eee, voums, arsiengtn, 2nd wose in vations camsanty snathasnn, mtagoatenn Sy Bae, rns pare bat 5 bol dann"
    },
    {
        "image": "coursesyllabus1_synth_1_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": ""
    },
    {
        "image": "coursesyllabus1_synth_1_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Mania Metro Manca Course Syllabus iment of Methematos Date: Fest Semester ay 2028. Course Protx and Number Sepantment: Denn 8 MATH 201 Course Name Calculus wth Analytic Geometry 1 Gre Hours and Contact Hours. 5 ng g hours lecture) eluding pre and co requisites Otter! and mney negra To '\"-Course Outcomes and Objectives ‘Student Learning Outcomes MAUS nedng algebrae VSS 2 Comput and logartnm tunctony 8 conceats to soive spn ‘else rates, cure stetchng ana sing fundamental meg raphe ana! fe dervatves of ‘wes and tecnnques. 3. Apoy donee sng atferentaton tmeaton problems,"
    },
    {
        "image": "coursesyllabus1_synth_1_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Manda, Metro Mansa Course Syllabus Department: Department of Mathematics Date: Fast Semester, AY 2025 2028, 1. Course Prix and Number: MATH 201 ‘Course Name: Calcul with Analytic Geometry ‘Croat Hours and Contact Hours: 5 unas (5 hours lecture) Catalog Description including pre and co requisites: ‘This course covers ferential and integra! cals of functions of one variable with ‘emphasis on anaiyteal and computational skis. Topic include iis, cont envatives appications of derivatives, intepraton techniques, and appleations of defeite Integrals. The couse emphasizes both theoretical understanding and practical ‘Problem -slvng. Prerequisites: Colege Algebra and Trigonometry. Covequste: None, 1 Course Outcomes and Objectives Student Learning Outcomes: 1. Evaluate limits of functions using varous techniques incuding algebra ‘manipulation, L Hopita s rule, and graphical analysis. 2. Compute dervatves of algebraic, igonometre, exponential, and logarthmic functions using dferentiation rules and techniques. 3. Apply desvative concepts to solve optimization problems, ‘elated rates, cure sketching, and moton analysis problems. 4. Evalvate integrals Using fundamental integration techniques including substiuton, tegration by parts, land partial fractions. 5. Apply definite integrals to solve problems invoWing area, ‘volume, arclength, and workin varous contexts"
    },
    {
        "image": "coursesyllabus1_synth_2_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "arate, $s eres Prvegsnbes Hore, OFA: HS gorse renner sat Oat erst aera Ooteaensts sonctagint ines Bae 0 ecrne axpheng notre watirint soon ep, oo wae TT aoe nanan aowee 2 Messen, 2 see nncarctand averyian Dense SFE rox sina wed aU ‘ounaeng sts, 5. ferenstose ro na pratt: SoHE pevspectisns 078 Bs benare ester 88 vara pemances. 2 ©"
    },
    {
        "image": "coursesyllabus1_synth_2_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTS TOMAS Santa, Shes Mess Sourse Sytichss aseriowiot: Gemarsnent of Corman ft (Bate: en Semenne, 67 200 08 i ouize Peat rnd Sra PSY 1 nstal Paycretogy et Hou aot Contact Hee grote sus eT) axa Denton lining pms Ao ene! spa cose ponvdns a szenpeanaeicy pleats: othe sama wast of aan eet ded emma peonasaen Tes se Hsia ves aba, <a Fico ening animes meeyase ued acs, sence MPH ree pevchgenn encoders SuuSoes tein ae payacutew eanees Ant cRonath setts Pasmnonites Nove. Gomme: None Goce Baers Senses Catone at Garson tn Laating Mareen buses wane pomengion: pectpactions and Shuck mpeg 6uMAN SAIS a rencatasprosevans. 2 Bin sre neg cage ms erie Is se de ponean devesngrnert. tect, foe aaa rae Pe asa 9: APY verayeas aonangts won proxies ie eeauniad aveying DEEN Peon aereencee a oral iractons. Acai rebwnr seus ona went eererres amen sewrnewansoring ard extant meting sts, Sears cee or etna exnsceraeno in ysvonaiopeal researc on pais MAE aos aeonely ae Sioary 9"
    },
    {
        "image": "coursesyllabus1_synth_2_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": ""
    },
    {
        "image": "coursesyllabus1_synth_2_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY GF SANTO TOMAS vcs oo Ma Course Syiabue Oopartment: Gepasses of Samnsevaien Ads ‘Sate: at Simei A 222506 5. Gaweae Pain aed Member PSY 122 ogy Csi Hours and Conte Mena’ y uote (3 ews ected Sour Kase G onera Pye Leataivg Desert clades er oral cement een pier 2 exngeabamiie iaerinn ve inte stat of Ma Danae one sere yaciiaen. Toles lace Uaioe caves of beavis, senate ad fsepion lnaseng ed meng, mab eaGon HO mot, areal. ON pest ond paycholagne Anenter, Sufacts wi ecanca a pay thalet Fats AHS ceuitws: Nene. Coverite: Fore. sien sioes BY 1 Rouree Quioserse st Oecticon ‘ron Lawrning Outeores 4, Dateebe ineior pchntagiol aarscectives ane thaoties explaining Mian bwho dar and omnta! gnuesses. 2, 2upied the binge, ogrtve, and sacs! factors that -aming, snd cenavnt aermse the daseea. 3. ApDIy ee i nuiortand evaryduy Nahewnr, persona! rpenenens, gn sone! ntaiautans 4. Svalyne researc sides and eva eusienoy isi seuntie reasoaing ang Swan! thgking as. 5. Daewenstate ipearaness cf hea ounssoraans in paycholoiza esaesch and practen scting ‘cohural srsninty aod aloes es ychotogKar consasts ard wi"
    },
    {
        "image": "coursesyllabus1_synth_2_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SAS shonin Sours aba course Syilabee operons of Cressi AAS gree, AV BORE IE epactmest: ate: Fest Ser prac ana tortor PSY 202 3 ces omen torn: Genera PayetOlOsy oat uve nvr HT Sta anos SEAS) cating Cvs ncaa HSS a pores x omgrt UT NS serena tan) ena Fe ete nore, Tapes TE MNS eave, sacs a oe a 8 TY PT se pense ese EIT fee gr cnt. as WT Sees tases tt a ts nes Mee Cosa Ne NS sn Gouna Cxtocmmns and beetNE nd heart 200185 ope vietage gn, 2S an penn acts te HEM anyday een vr apeiak ntwrtions. 4, NS eran sas cea esbesth 2 cg wc eset 29 SE ing shia. Dennett amy gonacenions 7 paTeoDGH veg an ebay UE. tosis it pan 3 ASE cays poyenceaies parioectves 2 urate"
    },
    {
        "image": "coursesyllabus1_synth_3_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Mansa, Mace Manda Course Syllabus Department: Desarment of Cut Engewerng (Date: Feat Semester, AY 20282008 1 Course Protx and Number CS 101 ‘Course Name: introduction to Computing ‘Cred Hours and Contact Hours: 3 unt (3 hour lecture) Catalog Descrtion including pre: and co equites, ‘Tha couse etrauces stent to hdamertal conceth of computing nehcing computer systems, proyamneg loge, poben saiveg achat. and bane pean conets, Stents wi eam computational Piting an Geveley smpie programs wing 2 nerieve sayamnng anquage Tones mckse cat werenereaton Bom oan sermare Gevtcpmert bass, Prewgantes: None. Cowman CS 10%. 1 Coure Outcomes and Objects ‘Student Learing Outcomes 1 Oemonstate understanding of fundamental computing concepts ncuding hardware, sofware and dats representation 2 Apply comeviatonal Pinkng and probemtoimng soateges to analyze and sole waiword problems systematcaly 3 Oesgn rpement and debug sel computer programe ving prope’ programming constucts and loge 4 Evaluate te effcency and comeciness of agorthra and programs tough tesing and anaiysa Demonstate profowncy n ving development too and envronments for Bagram creaton and execution"
    },
    {
        "image": "coursesyllabus1_synth_3_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF gan Mania ave Baia Course Sytishuy Department: Genarmiand 2 Cit Enact 0 FoMas ate: Fort Sameetar AY Desscane i Reume Peas act Nentree oy ot Computing ene WOME 3 ante £2 hots ectutes Grsiog Bascrtoren inctating pre ant eavagunsites, ‘ae courte imac stucens ws tuntameran ‘ystems, soyanmog ose, Cotes Mame intrauluation to re Hours si 29 take Sepang ugtisne segrereing imguana “sthewe sevmnemes tarot Prowettes 1 Coteee Dutcosnes on Objective ‘Sedat Lowning Ovteniaeas Sanding of tundanants! coma hestwar, cattnare, end cobhamauhina strategies te anahy Semen, woienent, oni debug nla ‘sonstinets and a sntatcn. 2. Appin computational kong (14 Sohn whens geitlems syaremasee nem 4. Batiste tv aon browraras tough tessug and snshas. 3 bone Soames too and eniactssois fos prow iM\" Braginses wthNg soe\" wgeamning S04 sections of agostions snes erate profomey vag swore ane! exeoutinn"
    },
    {
        "image": "coursesyllabus1_synth_3_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "y GANT TOMAS Universi? woansn tre aS Cause Sytlatiers upwment of Crt grees pepsi ante Fost Serene ge trans ono rarer 9 104 py BSE bse ganar name, (raror outing csiva t COM ymana ana coetasa ons 2 ts pos and cop errant at ooreang nenieg Zone rus, nS BBs: crest ciaaiog Deecrintin HO 2 ne pe, ae HG IE sana eT oon epee area ee cece ant BED PME se coarse Datconns ane ONE sous Levin Outer 1 tandarerss’ come es mips. 2 puis oT! ee grt se OR DOTS sy undersoodiea o ng Sete ert 2 Ce mara ame a2 ENO\" enn evant 6 ONE OE erecmase of agers ona youn were &E ogee"
    },
    {
        "image": "coursesyllabus1_synth_3_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SARTC TOMAS tora, taro Sta Gourse Syitabus Departraeon: Navanmt vi Oa Bremer Boo: Fest Saesuie, OER 1b Couns Pretin aeat RbEr OS SOF ‘Seura Hume: fatroduction fe Computing ete Kann soe Cantons Hoo S unas Ca tate cuts Quscriation Inching oa ane covrnmseies! Ths caaroe ernest ts feasts covets oF semeubiny acai const inns, pagrmening i, seoesating cecheiques, on asie SORIRINNG consist. Silents wi ia cenanaiceral Hung aM Save Sata BAG BS naptlnrer egemnog ngoame. asics cate ies amenasiation, agian Sta a soltnare ovation Bese, Pomextctye. tone, nemeste OS HL, 1 Goeuy Datounen and Copectaae ‘oasdard Learning Gueeonies Gamgatiote undantansing oF undemante ssrputieg sonowats meson esews, sofhanon, 2 Sata onreaantaton, Aagty eoequtelnnel wariing se peoemiusheng raaingien anwhan sed mite Seabed anion spent Desgn, molar ene cebuy UyR SuRRule: ongraNE UNAR OTS pA Senuin is and ing. t, Bwunte Se eThowsey end coneciners of sigan and Dragrsine thaugh teeing and gnabyse, 8. Dymanatane ooaisanan ming car etwaan? trae and eomrnttnn Pt pogeUe NEON ANS peti,"
    },
    {
        "image": "coursesyllabus1_synth_3_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Manda, Metro Manda Course Syllabus Department: Deparment of Cia Engneeng Date: Fst Semester, AY 2025 2028 1. Course Prefix and Number: CS 101 ‘Course Name: Introduction to Computing Credit Hours and Contact Hours: 3 units (@ hours lecture) Catalog Description including pre- and co requisites: \"Tis course introduces students to fundamental concepts of compuing including computer systems, proglanming lope, problem solving techniques, and basic programming ctntoste, Students wit eam computational hnking and develop simple programs using Fghlevel popramming language. Topics inoude data representation, algartim design, and oftware development basis. Prerequisites: None, Covequsite: CS 1011. i. Course Outcomes and Objectives ‘Student Learning Outcomes: 1, Demonstrate understanding of fundamental computing concepts incuding hardware, software, and data representation. 2. Apply computational thinking and problemsohing ststegies to analyze and solve real word problems systematicaly. 3 Design, implement. and debug simple computer programs using proper programming onstiucts and logic 4. Evaluate the efficiency and correctness of algorthms and programs through testing and analysis. 5. Demonstrate profeiency in using evelopment tools and environments fr program creation and execution."
    },
    {
        "image": "coursesyllabus1_synth_4_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": ""
    },
    {
        "image": "coursesyllabus1_synth_4_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES omeocey Merete Course Syllabus Department: Desarment of Commarncaton Arts (ate: Feet Semester, AY 2025 2028 placed on erties! tinting, proper ctaton, esearch censemne practces, Provequates: ENG 101 Comquate, None 1 Course Ovtcomes and Objectives"
    },
    {
        "image": "coursesyllabus1_synth_4_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "Linegce ST OFT Date Fen temeate 8 comaye Mars Acguere Hey eas Meee ne anatog Bescimnits enueng O eres Courae Sylabes 4 cou ye Coco nme and Os eetieet tutem beacene Ota"
    },
    {
        "image": "coursesyllabus1_synth_4_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES Course Syllabus Department: Capacinent ct Commune Course Nome: Avageinie Wing ane Research ‘Great Hours ond Contans Moors! 2 nts (2 ours ecto Catalog Desorption soeteding wre al eo Wig, Stsiunie ws lnm to wits sleer, eohenint, and wes npanives placed on enon! ining. aroner ceston, wearch mthadaiogy, en ethos! aquisies: CMG 101, Covenuiske: None R Cource Ouicenias and Gbjactivar Susdons Lowrsng Outesmes! raniuten, 2. Onadcer systamnds resasic lagion developer, ad efiectve si Jeng spnptiate cous hlasiag Waray aataoavas, sciatyoumse, snd sedis efaphrasi, and chatan folowing APA cc NLA style quidetnes, 4. Demenstita ton hanna st By anaiyang, evr _aveluatng infomna eeing, 0 nage wvarees, aga since! enadamon antes hodatang proper aseinuton, avoiding iagiarans, ecul matusining ucedero integity es ak writen wom"
    },
    {
        "image": "coursesyllabus1_synth_4_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF THE: PHELBANES nannies Coures Sytatus Beplenment Sasa of Cecumaeaton Ay (ate: Font Soman, Re Ra 2UIR Bouse Broen amd Homer ENG 103 Gere Mame: Acscomic Wiking and Reseach Genie towve and Cunack HWE sos (5 mbes 0s) ‘Cutateg Davatstion hasan po and eovtagias: ‘Toi seu tori students ania stony ast menses aie veventas tor eobece ewoi ware, Faecsuts wilinae te ake dees ceemiek and weer acasiorun errs a remeron prom tudowing onda meaner, Ena planed on extn ing, pice: otatan, msaaseh sacanolys. a9 ec ease nacevisen. Prmasistan ENE 10%, Cente: Nine i. Hocrse Duties ars Dhaene Susent Leaning Catcomes: 1 Conmose wsihurpaniad azedanin eatays derminsuatiy sar thane cistamests logical tevahyprsent ana eRhctive smurnaitation. 2, Contra! sysevatis reagan Leen appropskte suites Zikating Birt GOORONERS, AiiEty Ral, er eee ovine mazauees. itugrate tevions effectively tes grape” suatston, nissinaing, ane Den fnissing APA oo MLA view guebnas. €, Gamerenm cen thinking SAS by anaipng, ayeestvg, Wn ewtuaing atomneten tee “eins oun. 2, Aspiy situs acacheons pmcicen tekuding prone: anes, Benda ORG ae mentainnng acaiieme sag i ah wen A"
    },
    {
        "image": "coursesyllabus1_synth_5_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "SOLYTECHINIG UNA ERTY OS THE vat His ce Course Syiiagas Rowarteewt: Dnpsrmnent ot Engle at Unrate Baie: Fist Semestox, AY 2008 2008 4 Courne Prats ant soar BUS 295 euros Heme. Principles of laniagement red ore and Contact Hours 3 ynte seenres ‘xising Benenition iackating pe un eoceniias: is ceune tanecuces funtamectst managniees epht, scnsees, ant prance ke motor eracizatont, Sudan: wi explore th four naj managers fe arg, ating, a casesng. Teoma Soke gare ear ethane. dest, come ves: panei, ato, ad cmtensray avant ate ges 8 Course Ceisonnes oni Bayectives Beast musing vtec: 1. Eeriain tendemanta: managansentineuries, piicinas, an funetoae spine ‘a vances enganiesios! NKR 2. Aneizee evgancationss ssninures, zuhuced, at ‘Sawsonments to Wiersty eftocice maneigcinans seniagees and foantices 2. Rooiy Stunna and daowionsneking t s ard ian sotve menage previa gaa Achiew ospanizatunei anjahres. 6 okute tezershin shies, seieian teanes fone comminienton srstegis for Mectve sere arngner er angagerent, 8. Bavansizaye undemionding of ORY menage neat eS iy, wobaseeton, und susoonabity e hownead steven"
    },
    {
        "image": "coursesyllabus1_synth_5_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "POLVTRCHNK® UNIVERSITY OF THE Course Syilains epertmont: vy mega eto: Bist Sener Sarse Prot ams Harbor BANS 206 Coors Mame Principles ef Manag nent resi Hees ane Contact HOU 5 une 13 nour aster) Catetog Desenioten inctusing pond eowranaisiten ‘The nue imnovtas insarenial managenent poneites, cone. and ons ar argon pang. ranting eng, ad acco. Tein hele ganizations! capaieoineng, Cone Ouicomine end Gnfonioes Suan Laaoning Dutooen Basan Surdamnentsl management thaaess, whewien, are lanstine senate te vanous omamentiona! sontesis 2. Anutze 2 eneionments ty identty effestie management stateyies and practcns. 2 App! piaenng and desiven mating ‘anis and mohatjuas te salve matiayeriai oer: ond ‘crjanicatunal atsacives 4. Bugle adarie nes, stein ineoeae, id emplonse and cormunicuiton sestagios fr eFentne toum management engayament 5 Bevnnstate unidesta eianan, and sustaneoity i busines spertinns"
    },
    {
        "image": "coursesyllabus1_synth_5_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "poLYTECHNIC UNIVERSITY OF THE pees war. Mi Course Syllabus pepartment: Dearest of Engish and ease ‘pate: Fest Semester. AY 2025 2028 1. course Profix and Number, BUS 205 ‘course Name: Principles of Management cri Hours ana Contact Hours: 3 nts nours lecture) catalog Description including Pre 298 7 ne couse eunbuces treament a pneaies, concept, ar Stes modem onganaatons rome Canines parsing, mesenger TOPS SE cory, decisionmak: en Neen communcain, we SONS management nalenges Prarequstes: None, coveauste: NOM. st Course Outcomes and Ob ectve® ‘student Learning Ovteomes: 1. expan fundamental management Neon prncaies, and functions appteabi Ties orgencxtona conten. 2. ANI fe Rzatonal sutures, Cotes, and secre manager seats #4 spractoas. 3. ABBY sca problems and to solve manage’"
    },
    {
        "image": "coursesyllabus1_synth_5_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "pote: HNC UNIVERSES OF THE wae: Mote Maras Course Syllabus Deparment: Daparmns of Engi ant ese Date: Sos Sameer 8 20 at S Soune Pies Wesiose G15 205 Course Nave Principles of Manage! went {root Haury and Contact Hou® 3 ues (8 howe ech Gatsieg Descente wncatiog pro set cenmneuistes: Foe Rawse minutes Gndamintl maanienns gene ons, coesate and acti snouen sqpsoaaates Siteis wl exalts te sor Mace me ayaniee Fuses AON, Sohstan, Reenbe communeaton ane ammtenparny mucapmen ong Sea Dutcontes ara Cayeetions iar Lewetg Chutes +. Eaplnin urdamensst maranennent tnenres, panecles, ang Snchne aapleabie fa ni 17 sanity offer manesiinant setepwe and amcones 5. App y pisnnng aie deosnnioanng to s gal teehecnive 9 pal sera csveens 4) doves wancastonal abpcbeas. 4, Evaluate adeno ayes muiwason tapes gas 91 ASavivs team mevepemenl and ensioys ssgagamert. 6. Danor sate usdersanuing of syntenguneey anne gereane sea"
    },
    {
        "image": "coursesyllabus1_synth_5_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "POLVTECHWS UNNERSTY OF THE mat ieee Se Course Syiabus (Copariment: Oepannsn of Srgith and Aware ote: Fn Senter, 2 a0s ant8 1» Covree Pete and hunter BUS 205 (Courve Meare: Principiog of Management nee Vere and Contact Yess: 5 woes 2 nouns teste) Ths emene reese ‘Pekadio pres ec em coer tes. Cataiog Deepen"
    },
    {
        "image": "coursesyllabus1_synth_6_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LASALLE UNIVERSITY ‘Mania, Metro Manta Course Syllabus"
    },
    {
        "image": "coursesyllabus1_synth_6_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERS! sar, Mewo Manis course Syabst eioerne napartawa: Davarine of sures Prafic ene tatear, CS TOT on COMPLE, course name: Intvostci sa howe ecto ie seed Conte HOUTRE Sve creat ang Devcon inching sr a crea ee se gaan wus 0 uromerts CSTE cf econgetiny incang om re ge ae Hy Ta ar ogo gt, te Sd ES Ar ORIN SES wi Mores, OLIN TOT. ‘covozaute. 09 307 «personae neessaccing of fortaeet esting eoreests SEES neon dan eezreneciaion 2 rut ving 8 taaene agvcaraticay 3 roenoarong rowan SmI 70 eee 95 ae EE ST De ge. Eueet Os OTT sean cg testing an nen 6 emonst Sere ppm woos and eneronmens per pengrarentn rages won 66 Grama of gest"
    },
    {
        "image": "coursesyllabus1_synth_6_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY Mons, Bow Misa Course Sytabus Seperaront Destro Chi Expecting ewan AY 2282028 Course Profs ant Buawiber C5 304 Shiu Ham: iotreduction to Computing Cena Hous an Comet Hone 3 ants now s Renu) ‘Satoioy Onccripton tciadion pre and cenrequten: This wane traces ohudiras ro fauameetal connants a computing mele snpat suysten, pear mining ge, ersem saving tchcguns, aad bate gem int, Sealine oH tear tompastiora Disany as dovaey sense wcgraws sing 2 bevel orang lnpuege. Taps Susuze cae acceneutaten, agen devin, sd sollaare Soveicemant naize. Preremistse: Norm. Corequtie 06 101 Ni. tounse Gatonenas azul Objector Statent Leasing Outesewe: 1. Demonsiate citeritanding of findamente: eoneutng concepis mauding faacivee, aafoenrs, a8 dans mepwesaritaian. 2. Angi computation nai Besioa. emeeonen snsbioets e feo debug smpis eoneviay otaiWvne using Rinoes pngrammang 1, Suolusve tae ettssency ane sareotnese af sigamine ats sinqiame through taxing und snmlyia. &, Dawvansimte profiiency ung davassginoes tno s an whncenmeniss progres sreatann and axavutinn,"
    },
    {
        "image": "coursesyllabus1_synth_6_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY Hons Meus sansa Course Syllabus Desestaonts Deptt of ia Engegery ie: Feat Sameten AY HELE L Caurse Preis and Meera 8 101 Sowee Hama intoducton Yo Computing rec Hosre et Gomes Haun 2 wos (@ Howry coher (Coisiog Beas uition lochetiny por aed eevee: ‘Tis cena wmtaces shabu 1s fanfamentl cercezte i ounking ig reser -ysen. prayaninng ape, en zacing 2A papain =, Seis wil tans sorngotatial Nani ane denon single pagina wing 3 gine onegraminang onguage, Tapes ihe Sata stceaertation, garam design ah scooiens sasiae, Prowguies: Sate, Covegasive 2 Wt pwd bees 1 Ganeoe Cadeoncn ns Golovin Ssratert Lezoring Catron: 4 Ramaoaiaie sdersteniong of fndamsenna: gamut handame, soviae, and data mowsenteten. 2 Anyi vamputsonn teiing sed seobieaneaiong aralegies te ahaijan and soe osteants proieyn onvaate oats iene en samactees OF sigarei amok sesgeams tusugh westng and annie Denondtiate pevfeaney 4 develogment tn0ik vad emvorments fa program Gewton aa! ayaciion"
    },
    {
        "image": "coursesyllabus1_synth_6_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY sania, Mev Mana Course Syllabus partment: Decor of Cv Eger Date: Fest Semester AY 20252028 1 Course Prefix and Number CS 101 course Name Introduction to Computing reat Hours and Gontact Hours 9 uints (3 hows weeture? on including pre and conreausites ee seg student 0 fundarenta Coreen of COMBA G cues 3d BE TIT wy ona gevece sompe OATS 792 then agorthm ge59\". 38 catalog Deseret “Ths course rewong comes systens 08 Clnmerats Stents 3 6 Rgeave spanning area Tohnnve sececomert tases Prevegustes NOE vena ge eben ang EN 1h Course Outcomes and Objectives Student Leaming Outcomes pamonstate understanding af fundamental comoutng coneeass 2 79 2 eet ep nnd ate eprvercaton Z App} coresavona! 10 03 28 varrmrscteng svateges 1 anaiyze and sove raion Obes 1 aaa ent ant dooug sore coveweoaaTsusng H09e! BOUT See ye a Exavate te eflcwney an coresnesy of agortns #76 programs hough testing and ana pore $5 Demanstiate profeen development wor program creaton and #x 5u10\""
    },
    {
        "image": "coursesyllabus1_synth_7_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY Mania, Mato Manta Course Syllabus Department: Oesarment of Buscess Aomnsaion Date: Fest Semester. AY 20252028 Course Prefix and Number: ENG 103 Course Name Academe Wring and Research ‘Credit Hours and Contact Hours: 3 unas (3 hour lecture) Catalog Description including pre and co requiten: ‘Tha cove develops students academe wing and esearch sks essential for colegeseve! wom Students wi am to wrte Gear coherent and weboranzed scadernc essays and research papers folowng standard conventions Emphasa placed on etal thnking, proper ctaton, esearch methodology, and ethca! ‘scademe practoes, Prerequates: ENG 101, Covequate: None 1 Course Outcomes and Objectives ‘Student Learning Outcomes 1. Compose wetorganzed academc essays demonstrating cear hess statements, logeal deveooment and etectre argumentaton 2 Conduct systemate research sng approprate sources moudng lerary databases, scnolary pumas. and cedeie nine resources 3 Integrate sources etectvey tough prope! guotaton araphvasng. and ctaton folowng APA or MLA stye gudeines 4 Demonstate ertecal inkng skis by anaiyang. syntheszng. and evatuatng nformaton fom mutes sources Aspiy etiea! academe practoes meudng prope’ at buton, rodng plagarim and mantanng academe ntegrty nal weten wort,"
    },
    {
        "image": "coursesyllabus1_synth_7_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY Manis Mav Mania Course Syllabus Department: Oesscment of Busness Aamastraion Date: Fs: Semester, AY 2026 2028 1. Course ‘fix and Number: ENG 103, Course Name Academic Wing and Research Creat Hours nd Contact HOUrs 3 unts (3 nours lecture} Catalog Description including pre- and co requisites: ‘Ths course develops students’ academe witing and research sks essential for colege evel work. Students willeam ta wite clea, coherent, and wel organized fcademc essays and research pape s folowing standard conventons. Emphasis placed on ortical thinking, proper etaton, research methodology. and ethics! ‘academe practoes, Pretesuistes: ENG 101. Covequiste. None 1. Course Outcomes and Objectives ‘Student Learning Outcome 1. Compose wetorganzed academe essays demonstrating clear thesis statements logical development. and etfectve argumentation. 2. Conduct systematic researen using approprate sources including rary databases, schalary oumals, and cede nine resources. 3 Integrate sources effectively trough proper quotation, paraphrasing, and cation folowing APA or NLA style gudeines. 4, Demonstrate c teal thinking skils by analyzing, syathescng, and evaluating informaton from muktple sourees. 5. Apply ethieal academe practoes meudng proper attrbuten, svaring plagarim and mantaning academe ntegnty i allsitten work,"
    },
    {
        "image": "coursesyllabus1_synth_7_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY Manda, Metro Manda Course Syllabus Department: Department of Business Adminstration Date: Fest Semester, AY 2025 2028 1. Course Prefix and Number ENG 103 Course Name: Academic Writing and Research credit Hours and Contact Hours: 3 units (@ hours lecture) Catalog Description Including pre- and co requisites: “This course develops students’ academic witing and research skils essen! for cotege evel work Students willeam to wite clear, coherent, and wetorganized SRademe essays and research papers folowing standard conventions. Emphasis placed on erica thinking, proper ctation, research methadalogy, and ethical Seademis practices. Prerequistes: ENG 101. Co equiste: None, i. Course Outcomes and Objectives ‘Student Learning Outcomes: +1, Compose weltorganized academic essays demonstrating clear thesis statements, logical development. and effective argumentation. 2. Conduct systematic research ong sppropaate sources ncuding Rorary databases, scholaty oumals, and cedie nine resources. 3, Integrate sources effectively through proper quotation, paraphrasing, and ctation folowing APA or MLA sive guidelines, 4. Demonstrate rtcal thinking shas by analyzing, synthesizing, and evaluating information from trultiple sources. 5. Apply ethical academic practoes including proper attsbuton voiding plagiarism. and maintaining academic integrity in all writen work"
    },
    {
        "image": "coursesyllabus1_synth_7_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UMIVERSHTY eanta ee Mars Course Syitabees Aigetcant: Deparment of Bens Adininate ‘Ber Fest Saas AY SDH ust Preis at Herder ENE TES owe me: Acastennis Wri a Resesrel esses art Cotas Hare carving Dewsintion tachtire pee se ow coq: Troe anu ewan usin’! accutane end seceaet in eer ft canee tev tess Seagate wo Ream tube svat oes, aed wang seem aveeve and mceatan sepa: foloany wandara conan, Eephas serneat tuning, cempar amaton, een coetracishgy. an ee! sine, ENG 101, Comaquitte: ons 16s «4 rm ene nase eminse aractons. Pree Comer Seasons and DENIES racer Lacening Ceo aopaier webonganiasd seeders nesays Syensmalny cons Haws satnments cegeotumnrvananr and ote argumecate 2, Contact seiteate etna) aren ppmmare aewes nckntng Piany datsiraseh, tataty eine, we ete cae monenuns. 5 intupeate sirsces tictinlyseouy pees assaben sreamaciay, anu emi fobowing APP or MBA spe gueinas. Onnsnshaie cron making ak hy ananite, synteny. al erohartng afemanen Me canoe weuioes, 3. Apney ean coats praiees inating reper wim, sree piagemor, andl amma axucere argh i eter"
    },
    {
        "image": "coursesyllabus1_synth_7_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY Mania, Metro Mania Course Syllabus Department: Deparment of Business Adminstration Date: Fest Semester, AY 2025 2028 |. Course Profi and Number: ENG 103 Course Name: Academic Writing and Research Creat Hours and Contact Hours: 3 units (8 hours lecture) Catalog Description including pre- and co requlstes: “This course develops students’ academic wrting and research skils essential for college level work. Students wil leam to wrteclaer, coherent, and wellorganized ‘academic essays and research papers folowing standard conventions. Emphasis is placed on crtical thinking, proper ctation, research methodology, and ethical ‘academic practoes. Prerequisites: ENG 101. Co equiste: None. Course Outcomes and Objectives Student Learning Outcomes: 1. Compose weltorganized academic essays demonstrating clear thesis statements, logical development, and effective argumentation. 2. Conduct systematic research sing appropriate sources including lbrary databases, scholarly joumals, and credible lonine resources, 3 Integrate sources effectively through proper quatation, paraphrasing, and citation folowing APA or MLA style guidelines. 4. Demonstrate citical thinking sials by analyzing, synthesizing, and evaluating information from multple sources. Apply ethical academic practices including proper atbution, ‘avoiding plagiarism, and maintaining academic integrity in al writen work"
    },
    {
        "image": "coursesyllabus1_synth_8_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Manda, Metro Manda Course Syllabus Department: Department of BOIOGY (Date: Fest Semester, AY 2025 2028 1. Course Profi and Number: CS 101 ‘Course Name: Introduction to Computing Credit Hours and Contact Hours: 3 unis (3 hours lecture) rete data representation ager Sasi. a4 Nove. Covequsite: CS 101L. tighievel programming language. TePeS sofware evelopment basics. Prerequisites: hardware, software, and data 'e strategies 1 anal “debug simple computer Progra te the efficiency and comectness o ayes, 5, Demonstrate proficiency uShG program creation and execution problem soWvng Design, implement, and. constrets and loge. 4. Evatua programs through tesing and Gevelopment tools and enveonments for"
    },
    {
        "image": "coursesyllabus1_synth_8_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Manta ae Mas Course Sylabus acareent: Department of BOOBY ‘Date: Fest Samet AY 20282028 1 Courne Prefs and Membr CS 101 Course Name. Inroducton to Computng room Hours and Contact HOU: 3 wnt own echo) casiog Deseriton inchting pre: and co reesae See erences tn to hnamertn cones of eomeng meng Same cone. 28 Ba POE systema prramenng ge. oben aer@ a aces vutnencompamena thing i Green SP POTS PG 8"
    },
    {
        "image": "coursesyllabus1_synth_8_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "Date Fest Semen AY SITY OF SANTO TOMAS Mania Mavs Manis Course Sytlabus UNIVER! Course Prefs and Number CS 101 Course Name_Introducton to Computng Crean Hours and Contact Hours 3 unte 3 nove wctU) Catalog Description including Bre: stems ag ENTG OF Nyune pagans aoe rave savecomert panes Pree 1k Course Ovacomes and Obyectves ‘student Learning Ovicomes peronstate undentandng of funaament riven ana sate ea ore 2 yrouie' ogra programe ough 1 comeuing concepts NMI 2 Avy core. coowes vysteratcaty 2 ng prope’ programed"
    },
    {
        "image": "coursesyllabus1_synth_8_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Mania, Metro Mansa Course Syllabus Department: Department of Biology Date: Fest Semester, AY 2025 2028 Course Prefix and Number: CS 101 Course Name: Introduction to Computing ‘Credit Hours and Contact Hours: 3 unis (3 hours lecture) Catalog Description including pre and co requistes: ‘Ths couse ioduces students to fundamental concerts of computing inching computer systems, programming loge, problen sohving techniques, and basic programmag constuets Stents wil lar computations! thnking and develop sie programs wsng 2 Inghieve! programming language Topes nde data representaton aigorthm des. and software development bases. Prequsites: None, Covequsie: CS f01L. Course Outcomes and Objectives ‘Student Learning Outcomes: 1 Demonstate understanding of fundamental computing concepts ncuding hardware, software, and dats representation. 2. Apply omputatonal thinking and prblemsoivng stateges to analyze and solve rea uord problems systematcaly, 3 Design, implement, and debug simple computer programs using proper programming Constets and logic. 4. Evaluate the efficiency and conectness of algorthms and programs though testing and analysis. 5. Demonstate protisency n using evelopment tool and envronments for program eweaton and executon"
    },
    {
        "image": "coursesyllabus1_synth_8_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "SRIVERSITY OF Santo TOMA acts 2 Ma Couse Byles Pxburimec: Scarce of Siuy Fite Fie Segmes AY Soe Gowen Bete at ty or yng Sone Kew: introduction ia Commsting S08 Hos Conk ye oy ow etn Sn esottnncee Sintec srgrarong ong Bhewe dveeeman! pony Cour Suess 898 Tense coke Dhjectns Sruders Learsing Bitecmes: 2, Bittosstese une eetoeuin €ftandeoment acinont, sate, aod date wteesonne brobien auling thategics ts ansinee a nie. miclewast, ws datum perpio n srogreate theo tay oevebypmien tort any LOmEUR NeEsts metuding Brg anc 2. Apap cxmputainy 200 seo 7"
    },
    {
        "image": "coursesyllabus1_synth_9_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY Manta, Mabe Mania Course Syllabus Department: Deparment cf Compute Seance ate: Fest Semen. AY 2028 2008 1 Course Prefix and Number: PSY 102 Course Name General Psychology ran Hours and Contact Hours: |S units (3 hours lecture) Ctatog Description inching pre and co requnites: ‘Ths coave proves 3 comprabenive mosucton to he siete stuty of onan beaver ard mental processes. Tops clase bologeal boven of behav, seraatan ane ‘cepten earn and memary. metvaten and emeten personaly, secs poychigy sd payehlogeal orien. Sheers wl examine mae peychaeges ecten ond ‘mseaeh matte. Peequntes: Nore. Comune None"
    },
    {
        "image": "coursesyllabus1_synth_9_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY Mania, Metro Mania Course Syllabus Department: Desarment of Computer Science Date: Fest Semester, AY 20262028 |. Course Prefix and Number: PSY 102 Course Name: General Psychology Creat Hours and Contact Hours: 3 units (3 hours lecture) Catalog Description including pre and co requistes: This couse provides a comprehensive introduction tothe scent study of aman behaviee and mental processes, Topics include Biological bates of behavir, sensation and erception, leaning and memory motivation and emotion, prsonaiy, soci psychology. and paycholgical sorters, Students wil examine major peychologial theories and research methods. Prerequisites: None. Covequsite: None Course Outcomes and Objectives ‘Student Learning Outcomes: 1. Describe major psychological perspectives and theories explaning human behavior ‘and mental processes. 2. Explain the biological, cognitive, and social factors that Influence human development, laming, and behavior across the lfespan. 3. Apply _sychological concepts and principles to understand everyday behavior. personal ‘experiences, and social interactions. 4. Anayze research studies and evaluate evidence using scientfe reasoning and e ical thinking skits. 5. Demonstrate ‘awareness of ethical considerations in psychological research and practice including ccutural senstivty and dversty issues,"
    },
    {
        "image": "coursesyllabus1_synth_9_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY ‘arta eo Mant Course Syllabus upertment: Deparment of Compa Sane ‘ae: Fast Semester, AY 2282028 1 courne Protx and Member: PSY 102 course Name: General PSYCHOIOSY and Contact Hours 3 unts hows ctr)"
    },
    {
        "image": "coursesyllabus1_synth_9_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "GELA SALLE Lnevensery Merde Move Hanis Soures Staves sis Sears ete Seas Benen AY zat oye Certs Orofic ent amnen py 50) Creme Keats: Genarst Paychalagy Hwan Deysvings of 2 ret Roure a8 emer HEE ues cs heen lava) ‘Soisioe Bosra antag pre set sewn: Zs Sosenecrois 9 senaebavis tne ie went Sale aan bahar Be asl ecm. Tis hay Besse Nokes of Beane. Lesanten ene Green, ANS ae ena, etn me RR satay, sec apg ans pashan Seceies Gucaty wh srt ae” paaubnten Benton one 888. Hoe Cosel Nae 1B Sauron Setcomes ond Shem Wet arenes Outen: 5 Desciie major ouythongieat sersctos and thsaen eipiaing buen benaiiee nt mania comsaas. 2. Een iy bicinpkad, Uogntne, ane! sae Sartos ter “his tain dasbivgoen, Waning. anG tener AEmas Oe Motpan, host Besshonyeon: escape and sencivs se crdentane! evaqedey Sabevne benerer SASeRRINA. sd Laci Marstons 4 Anson euuSrh Wedes and nuatione ‘eslomor wsing aseitilo masening wd eal ticker white eenamen, smeees ofthat onenauons m gnesnsioge manent wit pncine Hebiag ‘uur sonst at esreay eae"
    },
    {
        "image": "coursesyllabus1_synth_9_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY Mania, Metro Mania Course Syllabus Department: Deparment of Computer Science Date: Fest Semester, AY 2025 2028 1. Course Prefix and Number: PSY 102 Course Name: General Psychology Creat Hours and Contact Hours: 3 units (8 hours lecture) Catalog Description including pre- and co requistes: This course provides a comprehensive introduction to the scenic study of human behavior _and mental processes. Topics include biological bases of behave, sensation and perception, learing and memory, motivation and emotion, personaly, social psychology. and payoholopcal orders. Students wil examine major esyehologalthaaes and research methods. Prerequisites: None. Covequsite: None. 1 Course Outcomes and Objectives ‘Student Learning Outcomes: 1. Desoribe major psychological perspectives and theories explaining human behavior ‘and mental processes. 2. Explain the biological, cognitve, and social factors that Influence human development, leaming, and behavior across the ifespan. 3. Apply psychological concepts and principles to understand everyday behavior, person ‘experiences, and social interactions. 4. Analyze research studies and evaluate evidence using scintiio reasoning and ercal thinking skits. 5. Demonstrate _awsreness of ethical considerations in psychological research and practice including cultural senstvty and diversity issues."
    },
    {
        "image": "coursesyllabus2_synth_11_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "POLYTECHRIG U UNIVERSITY OF THE PHILIPE COURSE SYLLABUS Soriet Sciences RIATH 201 OSfarenti! Equavors “Tre ae mA FDP February 24, 28 Suits hours wee} Brevequisiters) Swelcome and tstvodustion Wer: You wit seveiog skis i soins science ard engneering Comme Theiste cotinary eterente silences, 308 Cearse Cieats stonene we deveise 9 Methods of fastrsction Janey nag ques, neato HemeHO ESIGN Course Coamysonent Specifics cenren uaper 96 aczicetins oF di and Attendance and Make Up Wa osence wo eau wa 2 deiacwen Onfeventat Equations) Tos cours ns types of dffeventa! equations 2 es ta nodal and aasivz toons ine fut aie, Stacenis ate respon fo eeroratar’ are wale brentowters Bs appicatons of oucnary ste Je sxpiorss the theaty 20 anpiying hein tp teab vont seing pryce: phenomena hence Giteremtot squaticnss ard anbiy veder. 3 st608 aieat pesote, preuiewrscinig seasons enpnassng 2 soy toe rotor ana amnatone we deans may rise up ty tour di asses wthout pansy Beyond thes i, oath Fenny aasves inci tes 7 iepcevted by the denartnert Spray sah eacumentad erengen sputetoaat ma"
    },
    {
        "image": "coursesyllabus2_synth_11_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPEN COURSE SYLLABUS Caliege of Socia MATH 201 Dlferentiai Equations rezuseaase Tha con 338 iadusie sing, Rooms 180 esober 2, 20 Feorary 2 erequuisitets? 20808 venti! Equations! This cowsee a You wit develop skis mn solving varias types at ron the theory and spolications of ontinary GNerertist squat avert ey lepiyny them to rater poutine is Coarse T This course examines crcinacy Glferentia equations, tha soltione, and aypleations to moising physical phenomena natural solewees, sd acononen Course Geaty seeing profi Heaton, to moe! ana anahre cea worl! onder are ig Mothads of Insirxetion ss Uiearsve! eters With tgorous mathematad peste, prebienaahing sessions emphasing rouistionet techniquns, we ey Romewnrs semgiimente, atu sieouessons on apie ulations using Cour ies sing fe base! on ently oreblens sate mponent Spex ste ox sed 9 receacch poperan lng (998, A st enue damansiqoue Gear atari aso Aifendance and Mate tip Work nviresuitin 8% nates, Nskawue avemination ave eumieble any wih dncu i fin the Fa co inning tise tad emergeaciag aparaved ny Hie aapsvine"
    },
    {
        "image": "coursesyllabus2_synth_11_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "SITY OF THE PHEIPPINES POLYTECHIAS UNIVEF COURSE SYLLABUS rem Peters oftuge of Social Selennes patos MATH 20¢ Dilerores PTH ge a EA caneiuate Soros! Babaang, Reem 6% font peteregparaty 6a ocintae 27, BOS Petruary 24, 0006 Saat (bene iets) Prereqptsitels? sect appiecstens ecsinary dtlerertal 2880\" Welemar and Introduction ‘gu We ae DRS peor ts Usierartas Bramonnl Tis curse ears (ne OO “ati Nig sub exng ons Yes OF der sseions Bd SPE uinece are engioneri Conese Thame ci cise earns excary Shes cn, te Gokaans, a4 SHERRIE ny een piysicik Brennen Jongg, CHURGE ACME, HS SONIA, Course Goats Games wi cry cece och rsh ete, AAR pigs onder Soret eonaberss, 2H ‘enrique ong 2 ANT THA MYA Metbeids of lnstraction denne pourie eer’ ehuns wt rgorise mainemasoar waste AEH SAT enphsnaing comnuiatinnt! Serncrere meaiy hemes asiennnts, grou eaetsinak a Fie ene AT NO matnaeracal soReWee plentans, ana computes Coaxse Sonspancent pectic rang baad on wey pris sete RE) eee a maven soper an epocatans 2 dBterandial 3 st propa rier Je ricienn exavainatrons 20% each}, camomhansiee ta esas EF nari 28 vesons Bin vara meow Socrates cae a Attendance gad Makstip Werk ce moana fo et dee seein: SSeS may Me atari Stetert Mtouap evamantrs a8 2sraabie omy wth decamenne ean tg tone ey doves tnt pana Batt 2 sy epaae tn sbaaveg sass ero tH yencies angonved by fhe depatment unnne ath regut. 22 22% dedurten fase 9 piven"
    },
    {
        "image": "coursesyllabus2_synth_11_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COURSE SYLLABUS College of Social Sciences Brent Peters MATH 301 Differential Equations 0943236954 TH 1 00 PM 3 30 PM Gmauate Seno Buting, Room 198 (October 27, 2025 February 24, 2028 brent peters university edu ph ‘Sunts (S hours tecture) Prerequisite s) ‘Welcome and Introduction Wetcome to Differential Equations! This course explores the theory and appications of ordinary differential equations ‘You wl develop skits n solving varous types of differential equations and applying them to real world problems ‘science and engneering ‘Course Theme ‘This course examines ordinary dfferental equations, ther sokitons, and applications to modeling physical phenomena In engineering, natural sciences, and economics Course Goals ‘Students wil develop proficiency in solving first order, second order, and higher order differential equations, and apply these techniques to model and analyze reat wortd systems, Methods of Instruction Instucton meudes eoretcal ectures wth ngorous mathematcal proofs problemsoivng sestons emphaszng computatona! tecnnques, weetiy homewon asagnments group dacussons on appicatons, and computer based numencal smulatons ving: mamneratcal software Course Component Specifics Crmding based on weehiy problem sats (25%). two midi exsmnatons 20% each) compmensie fal examination 20%} tnd a esearch paper on appteatons of dferetal equatons (5%) Al won must Genonsoate ea mathematica! atonng th proper notation Attendance and Make Up Work Asandance requeed fora class sestions Students may mss upto four 4) dasses wenout pansy Beyond th it. ch sbtence wi wut na 26 deducton tom te tna grade, Students ave mwaponsbie or obtaring maued incur notes tom ciosemetes. Mche up exeminatone or eveluble ey wih deeumented emargenses approved by the depertrant."
    },
    {
        "image": "coursesyllabus2_synth_11_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIEEINES: COURSE SYLLABUS Collage of Social Sciences Bron Pasere Fabs Bot. Citarartiae uesizoree TenizI8Re TH 1 80PM. 339 eu Gaehvaie Sabon Butts, Rane (98 October SRO Februsey 24, 2008 Seent peteredharioessty ge 8 Sune £8 ture tg Presequistieiey Welcome ang totradustion eran fo Diterentis Equation Ths couse explores the heory and apesesioce ann st ection ke mn sabrina varie Pontnary cacetey equations Sia of dttacent ecrntene and apeiyirg, Brine snd enghercting, tom te raabwcetd pears in Conver Theme Ths cesses mxamioes recy erent gear, ra ahi, a eopscatoe to waning rtspoic pharma ‘A eoghaerng, catursl skeen, sed ecceemicn Course esis FR Meant protec 9 actrog rat ortar, senor ender, sn highs onine dente emtons, aed apy ‘rene techniques to covet uns analyze reahnceld syste Methads of tanirnetines vinstin inSsdon tnearatens tates ih tnctriaues, weety nomena wexijarnente materiel eAtesse rou mathnosie! esuafe, pro piensahing teseions soxghasttig asoputatonat pRatNe, wed cumpetacLed motes tnatatnns cag Coarse Coniponena Specifies roving i basen saat gai and 9 r8a10° eoynt en anptantang and prope rosaie ani MSteen exacsnotone 2% emsh) covariance fina axaminttion GO: Seecentas autos 53 AB se emit emancin aio seinem: enrong Attesbsiecs wed Muke tlp Work ‘bers resus fc eane sana atsence went 8 2 deacon ss Stedants may mae ie Makeain wnumiascna ae ewes oe 1 four (8; slomey wiheont wenaity Raye da St, andy sat, Sticasis re weseansible fr tame mina ese nates toms ‘eh outed emmmencies seiprovsd Br tne sepectonce,"
    },
    {
        "image": "coursesyllabus2_synth_12_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS COURSE SYLLABUS College of Science Justin Curry (C5 201 Data Statues and Algorithms 09374123648 MW 10 00 AM- 11 30 AM Engineering Bulding, Room 136 October 28, 2025 February 26, 2026 Juste cury @universty edu ph ‘units (2 hows lec, 3 hous lbertory) Prerequisite s) Course Theme This course focuses on the design, analy and implementation of fundamental data structures and algorithms used in ‘computer science applications, Course Goals ‘Students wil master essential data structures ‘appropriate algorithms for problem solving, Methods of Instruction including arrays, inked sts, stacks, queves, trees, and graphs, and apply ‘Course Component Specifics sarees et nctides week programing assignments (20%) mite examination 20%) fa examination 5%, Ianageren ene Se Paeeaton Al rogrnmning ssegnmens mt be sibmed ough he cron cng management system Attendance and Make Up Work Regular atten:"
    },
    {
        "image": "coursesyllabus2_synth_12_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS COURSE SYLLABUS: Callege of Science sat Curry (98 201 Dita Severnen and Mertens owners MF 10 00 AN 11 20 Abt Ergheemng Suiting. Root 196 Ortober 29, 2025. Feruary 26, 2926 pote. caryQuntversby 2au ph Dees (Bros tnt, 8 hones eran) ‘Prevequisiteds) Welcome and Introduction Wetvore to Data Suvetares and Agorirena! This course wil bocce you bs fandemenual concepts of organizing and rnanpaivtne dete eticsenty. You wit inarn various Ohte SHUChTES and aigurirenc Yechnquse exaenti or sefbare eevetapmen. Course Theme Tlés course fosines on the doce, ana compete seunce epplctone Couese Goats ‘Seadente wi master eacnba’ dara sricturer nchaing an ays, ed Katy slacks, queues, Meet, an grape, ANG BEN Sporopeate agents tor protiem scieng, Methods of Instruction ‘The mouse eras? someeweion ot iersctee ketU 8 het yn abnor ARRAS BOgITTINS BASEL EAEEOTIE deve popes, ane cate Rue: anayAS 3 MINN Neer corempIS WO parton! emearersaten He ad enptamention of ndemencnl data winuchres and algerie Used Course Compooent Specifies une ssaesunat ncadas wraiy pregreneng suspnect 20% nears anenineton CON) fo emirate 2981, repr pan 2%) an cds paterton OM) At prganning abnman matt be aie ENOUGH Orne WBTHNG Sunageraot tem Attendance and Make Up Work Rirguta atenaerce merdviny, Staderns om aloomed mexinum cf we (2) auseroe pat vamasten, Creating Os Ser we crit automa faluce, Lain emivns (mace than 18 mets} we be mae as alseet, Sokeaip wok prunes 92%) for encased berth win veld dosumoninion subrntes uitin $8 naw. ALtgrunert maced Gut [D LneNaste! EoNeNCat reaRteR Ze Cate"
    },
    {
        "image": "coursesyllabus2_synth_12_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS COURSE SYLLABUS Collage of Science van cry Dea seeteen ont Mert onsranz36ee tne 10 00 AM 11 30 AM Engrearng Butte Room 138 Octover 29. 2025. February 26, 2026 pate cary Gurmersty 00 panes Drawn exten Down boron Course Goals deer a eanter exverta sata arches nctang arrays. wes aE aces queves Tees and gracns, and AO pooroorate agentes tr problem: 8G Methods of Instruction Neuve export a comenaton of nierectre casa vady enatyn to entorce meow cans progrrenng auegrments conanersit Me lecures nenae on aboraton ove pone tees enammaton 28% any Course Component Specifics cncasdes oven programma snsgrments 3 rene penconton SS) Al pogrermnng om oN, matter examnaton 20%! negumants must be submis Provan me OA Couns assenrent mop promct 2S) menegerent ersen Toon Aaagnments mate"
    },
    {
        "image": "coursesyllabus2_synth_12_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY GF SANTO TOMAS: COURSE SYLLABUS College of Scien Jonte Cory 25 20t Oa Destine ae eno oua7anaases JaNF soop aM 130 8 Enpineenns Buti, Ream 138 Getober 25 26 cary 26, 2028 sin oorreuniverety ect ph ‘Suds hous tata, tows laberatany? Prerequisice s) Weleame ani iniraduetion Welcome fe Gola Stractires and Algorithms! Thiz course wif intratace yeu funcament rarioulatie data eficient y You willeatn various data sinsetases snd algoslonis tectrsaues evetcoment cones of orpieszing 2nd sarin for software: Conner: Thee ‘Th course focuses on the design, an comneatr sevence appteatons, Corie teats ‘Students wi nantes eenentia data eiractur corsopriate aigortiene for protiem aeivig Methods of faxivction: “The eouise eegioys a cumbeton of eteracire onus, reap proieuin, end sae sty anata 8, and eoedemenitation of Sumestal data shunturen ard algorithens tsud in irokiding arrays, Ged fala, euicke, queuss, ees, sd gran, an apy ree i, nabsbowatirn sass, poyraaing wesigon: ems wth practical Urplemntain kts, Course Component Specifics Sues wasiy wogremming absignmente SO), witierm wrarnvabinn (720%), Rast sacington niapr pect QI\" snd elees purteieution (7) AR usogracuing Secgnments ual hs uunsed thesngh te aniye nagement system: a idence and Make tip Work, Regula: atendsnoe mandatory Shilents are etownd a caninum of thoes (2) abemaces oer semester, Exceeding tit Gra resol in eutamstisfation. Late aniars (ove then 1S unhules) WO be tasked w8 ateAn, Moks up sak io pormiied en far excused sShzences wth sald avmumeniafion subnet wihis 48 hows, Avagamame nirted due Se urgacusnd sbasnces mosive em aeth"
    },
    {
        "image": "coursesyllabus2_synth_12_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "URIVERSITY OF SANTO TOMAS URSE SYLLABUS College of Science shanti Curry eaaratasset AAW 4900 AES 18 90 6 preety Bulking. Fawn 136 Setober 28, 2025. Febvesmy 28, 2026 pete CD ‘ectire, 3 econ Provequisiie s) ‘Wetcume ead intradaetion Weeicome to Data Structures aod Agoctnss! Thun cours wil itracuce you te furdeamertal conceple ot erqarening arid seaninutating date aticieiy. You wiiteaen vaous deta Sructaros ard aljorttwmac technigues essen for softer uvrogment Course These “This course tosuses on the Usign, gnalysle, and ingen ‘computor acience appicatens. Course Gaal ‘Stutionis we miata seental dar shuctures chiting atraye, Ged Hats, aoprupriat sigarktis fr probs calve ‘Methods of fustrweten The course s pieys 9 cobisation vf ntuspoine lesan, honden inevainry anutioes, pmpraciminy wieignments, cubatoree Qioup pes, ana ene choy analysis to minvoroe macrareal eensepte wen praise! emsmamanbaton GbE ertaton of tardacesnis! eta einichiwea und aboritine vee es, Gemuee, tea, and graphs, and arly Cour: Component Suseifies ree asa esonst hhies weekty SUR er emjact (20%, ane inns \"y Bomar (0), maka axamination (A). Sl examwratin 2S) einai (984), At gregamiming essigrsaeks muh! be sunitled Scsian me cae touting ponegeman! Attundence and Make tip Word ogular sttandance ma ty Stionts ara atest w maximus est in atoreti flora Late ahs fone than 13 sors wth vibd Socuimentstion suming within 48 oun. Aasignear sree dnc uneneveed eigweces eu"
    },
    {
        "image": "coursesyllabus2_synth_13_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF THE NLIPPINES DIL ont COURSE SYLLABUS Wie Matern nesta BALD 06 Om 30 Fe tice Tamaes, Henm Ase November 24 S Maren 14, anes wee tenatepuivetnty soy Sums (3 Pours ecture) Peovequsisitets) one aod fetveduetion Shier iterates Th Tes fo contemporary works, Ye Bre cuits stage “SOMES Surveys Tne i tecary easiest te by whe: fe nerse yearn, th Vibes toes pre cobra Se 0088 Wal ote Fano taray men Cones Teme ‘This course estates Price i Now Pre wrters exgress cute @ourse Goats Shitents we ule vero ems Mehusng poety, ttn REN tera expermrcis, sa soci ren SIE, Bn essay 2 camry ee SN abiLe Moe Works of Prkegine arate OF Fipino aterary wasiona ena Methods of instruetion The coors utions oe Sree tard histones 208 esis sorters, sos Seveine rena: Contenrscrary expressions 98 e000, mptenne B98 esate tas WO vse! 208. and guns Senge et28 LecKue, FSI thorn wd amany Course Compenent Spesifics Paseo onsmingtors tay Attendance AG MakeLe Wark Str! aancanse a Me 86030 gate: Shianns ae penn Must ba commend Sania Ae PR astorsate tenn Rea SCE MNS be amegést wedin one wane tore"
    },
    {
        "image": "coursesyllabus2_synth_13_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN COURSE SYLLABUS College of Engineering we witcha ENG 201 Philippine Literature 09669455205 MW 2 00 PM.- 3 30 PM. Science Complex, Room 444 November 11, 2025 March 11, 2026 ie micheturversty esp 3 units (3 hours lecture) Prerequisite s) Welcome and Introduction ‘Welcome to Phiippine Literature! This course s times to contemporary works, You wil explore. and cuitural consciousness, urveys the rich Rerary traditions of the Philippines from pre colonal ‘diverse genres, themes, and voices that shape Filpinoiterary identity Course Theme {Ths course investigates Philppine erature in various forms including poetry, fcton, drama, and essays, examining how Filipino writers express cultural dentty, historical experiences, and social reaties, Course Goals ‘Students wil analyze major works of Philppine erature, understand historical and cutural contexts, and develop critical ‘appreciation for Filipino iterary traditions and contemporary expressions ‘Methods of Instruction ‘The course utizes close reading and Iteray analysis of texts, seminarsiye discussions encouraging rca dalogu creative wring exercises, mutimedia presentations integrating fim and visual arts, and guest lectures from Fino nuthors and nies, Course Component Specifies Assessment nctudes partopation in dass discussions (15%) two analyical essays 20% each), midterm examination (15%), {nal examination (20%), and a creative or research project (10%). Al writen work must folow MLA format and demonavate sophisticated lerary analysis, Attendance and Make Up Work Consistent attendance and active parspation are essential. St absences requie medical assignments must be compl idents are permitted three (3) absences maximum. Additional offal documentation. Missing more than six(@) sessions resuts in avomatie fake. Reading ated before class, Make up work for excused absences mist be aranged within one week"
    },
    {
        "image": "coursesyllabus2_synth_13_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "PIES QILIMAN UNIVERSITY OF THE PHE IRGE SYLLABUS ‘vote 8 Gattage of Enginendog ENG 201 Srsipine Utara elas Canpian, Romm 4e% 252 00 PA 339 PE ‘Nerpewmmns 41, 2925 Maced 11, 2028 tte marrahionesaeshy ae sure (fete torte Precoqainisels? ove Bhaainen fram pree Welcome ant Jatresiesction Ssrepe Piping avery erty cdyooeca te Bhar: (trate! Tee Cure SUED are ee conveanpuracy wus You wi wxpiore eres ana cured conaniounre et aarry sarsts OF gon, Brera. une wie (OE Cperee Theme pris courne swantigatee Phare Berane 1 ese, sem, 208 88, AMES Te paras erases expres aba wnt, Rates sarinat ne cued oath Caarne Goats paxatare, eriecetan MiDe sgaaconts wa ctu rages works of Phisane Bae enmeieion he i Bees MMAMESRIEY CATES. ‘paging Saray treaaior ntetinads af tnaermctent cleve macdeng ao wera aon ia puevanceacss nsagrate _patcne foro Weed BOE merece, 22k SOA THE in, wee ocean tes cients, sendnasetin sioasenond anseurg SES SSI ss coun Pepe avian and 2% “tm easieva ete ad aunts, ed th WCU cing ane. ae ae ancient nena 0% one caster examination CARE ees wc untae MLA fore an Seana Course Component Specifier ste 088 220 crete rman cit puncsons 585 we server ee restaancsnais 0) sesphasested RENE Attendance and Mater tip Wort aacreerpaciipatos wn evsanon Btsnis 29 OTM eanscas aver. ni x Brad 0 Fy sesions onsen seats 808 Ena sped ation ace 20 consistent ineaso a Saran rogue seins om He sagnments susie camped bate? paseeatnn ta ats en rn Makeup wn te mac RE"
    },
    {
        "image": "coursesyllabus2_synth_13_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN COURSE SYLLABUS. Cotegn of Enajreting Yee int ENG 201 PRippen iterane EARESSI tow 220 et) 5 20D Sewce Compt on 4 Hoverter 19 2005. lawe 11, 2028 eipactgevuctsategh ‘Ds (3 mows leche) Prerequisites) Walosone aad totrodection Wawra to Prigcome \\eratunt The cows woreeys the rh Werary battins of he Pragcines bein pre teens ter8 to cunterrporay works You u expacee Gverve genres, Deans, ara vee Yat shane Plewe Merary Kentty ond cutieal eonscousness. Course Theme ‘The courne fvesagttes Propane Weratere m varus tone ekg pontry, Neton, drama, an essays cram how Fira eters expres CNW! onmy Malones experiences 3 cecal temties, Course Coats ‘Stoseets mf anwyte mags wert Of Pisin ROSKIe, cBHTNNANS MERC and Cahiee Cites ane Coven ental enprecatasi ts Figen itera! vasiiens and cortwrgarmy expressnrs, Methods ef taatraction ‘The courne thant co renceg an Haren analy Of Wert, Sem ansiia Geoumlens emoUNE RS Sas Selapes. craton erty ereranas, metmertin sreseristions mayntng #9 and vaya! ate, ve guest chines Som Papin wvtvom and won Cease Component Speritics Aavernicont wnees permits m sass haouteers 19%) two aneiytem eneys (10% ean mem exaranetien (12% Saat enemmater (20%) sn 9 oeutee ormaern port (10%) AS arate” wed ant Kore LILA teret and dumentoate vphaented wean eoabes Atteadouce and Vieke Lp Work ‘Cera artendanne ind action pareeoutnn are vaterte! Shen bev Ennead cuss (Es sOeeras maemmen ANNE! abterses eure mero! cfg! Coesmw maton. ane ree then iF neneOne me OLtemate Soon Paresing avcommnam must be ceompinted iebora Gate Weteaip wee fer @ccvied ADEENIRS \"RAAT BD Lenawd WANN ome mae"
    },
    {
        "image": "coursesyllabus2_synth_13_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERS) PHIUPPINES DILIMAN COURSE SYLLABUS Wile Sitch Movember 11, 2025 are Sos (3 hours tetusn Prereqoistig s; Welcome ard fsevuduction \\WKeinoone tw Phuiocine Lieraliza! aes ateve te Fh Herary Nodes of fe Fesines tem pre cotanies ‘Si esvive diverse gowwee, themes, snd voives thot mene Filting Rerary tiertty Tv courve inveatig 1S och goat, fet en, orn, and essay, exon total nenerionces, and soc ing site Course Geale Start att nays majce works of Paippne iteranwe, nen Sperectalo fer Pleine Rerory tretiane ard or Methods of testruction wit steric a ture cents, ar dev eop efi tre utlaas cose senring and asary saniyis of tec ‘wba encties, cutineda oaseutatons Megratng We art a5 guest taaturen fig wes dave. ometie Fe uly 80 etic. Companen’ Specities Aatenatrent cites partivaton i cies dtcussione (16 aera esta 6% wach, satan ensingtn (45%) Soe Leminaton (208) a6 a cestve cresentch paged AE ition oor must feioW 1 8 foreland de mer state Attendance and Makedip Wark Cutsittent atendanoe os od sate saripation ane assu stisenoes requita madloe! er ative SrSariemis must De camped otone ts. Suente wentesen. tkssing mone tan 859. este up wo to Ne ported tne 18 as serena maxioum Aadian SSE resus ate ma bur Reading WRG nDseroRs sust be eeongas rnin"
    },
    {
        "image": "coursesyllabus2_synth_14_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "THE PHILIPPA POLY TECHNIS UNIVERSITY COURSE SYLLABL Coltege of &: Nenoas Haren Engneanng Buiing, Roem 282 nenolas nasengtun and impismertx hportnns used Course Goats fudlents wit raster ate algoranms for gratin song Methods of Lnstreetion mosneton af aleractve ectores, nandsen gh Course ‘ies enent Sp raja: pings (20%), a2 cine unctematan (SE) 8 sgiecr ranagecnent system Miteudanve anc Meke tip Sark Rese s fe rhanisiary, Sacienis we abosed a menu sf thiee id) absences yer samesier Excoesieng ths ina we A) x bie nae as BSE, I soy fore"
    },
    {
        "image": "coursesyllabus2_synth_14_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "THE PHILIPPE COURSE SYLLABUS College of Sclence Nichole Haagen, 201 Dt Sinatwres and Aigcttene 96 RENE 10860 ANN 14 50 AM Engines Nowamber 03, 2025 Maren oi, 2026 jain maeeeuawersty eu ot Sates (6 ores mete, 2 mrs ney) Prevequlsiets) Welcome and Intraduction Weicome ty Data Siruolures and Agentur Thie course ws inkoduce you fe Reviaments! conceote of acgansring and maniouisteg dala etteionty, You wiliear vara Gata uctures and algerdion: ecliniguoe eusertialfor safest development, Pours Phone ‘This course formes on the eesipn, analysia, sent implementation of Rundamecial data staastures and aigoritne sed a congpuiar anience applications Course Gants Shdents ai master covendal cote structures inchweg arrays, tokew Inks, stocks, queues, tees, ad graphs, and apply appropriate agora for prebler enkng Moethads of Eastruction ‘The nourse ansioys w sorsbination wt incarectiva inte, _pbup projects, an! exee stisy an niyiz 20 meiore sneurnsee! sanpepts with pructxal mesamentnting sxe Lon tabovatary anessinet prngniceing agsinieenss, oasabsaative Caerse Component Specifies Cine ausersrnrt nkses weehly oragiacmitg asagyenents (80%), nistena uuntemation *2O%) Haws eracrnction (26%), mas eet 20%), (Ste) Ab pmgenconmny aanigamants mast be sneited trough te anne sean managesant yam Attendance and Make Up Werk Rexuler attendance in maendatoey. Sascunte a atloored a omnxereom of tvs (2) absoinzes vor serrester, Exc vanues iain guid dovemontation rubies wide 58 Hows. Assiranwats aecred du to unexcused A0z6rices repeve za cei ye en a"
    },
    {
        "image": "coursesyllabus2_synth_14_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "oO NTECHNIC UNIVERSITY OF THE PHILIPPINES COURSE SYLLABUS College of Science Neholas Hansen ©S201 DataStuctees an Agntng o9s2se63163 Course Com Course assessmen Engineetng Bulking. Room 283 PONeNE Specifics includes span uN a38gnments (0%), mien examina and eiess partopation 5%) Al programming ‘management system. Attendance and Make Up Work Regular attendance"
    },
    {
        "image": "coursesyllabus2_synth_14_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "POLYTECHIIC UNIVERSITY Coltage of Science C5 301. Sata Deonees ae Aarts BAF TO QU AM. C50 aa Movember 09, 2025 Mach 09, 20: dewe pot Kets Trews weerrey) Prerequisites) OF THE PHILIPPINES, COURSE S i LABUS Heratse Hansen estusee3192 Eegneecng Berg, Soom 209 Ocho harwendiuniessty eau st 8 vou In Lnateneraa Concepts of crganeay ens crear Ne eee You wd eatn vacua cute tuctues we aocrene Womaquen eteenta ter veteare orvetoxrent Conese Teence Th courne foxes on the dese, anata, IM erpeercmaton of Rarer cata seuctures ant abgxthens wand ns SOmpuIO” scikone opiate Coarse Guats STM ot nso caveat ona ava need nckiceg sete, nd is, SOLS, GuRLeD, oes. ond Grats, an ang SECO ie air I foe Bre BOG Methods of iavtruction The eure amatays oomnatnn a mp: WER erat en Obed) aredyun oo Couree Companent Specifies Cowne arsensinent ckisas ww Se metres Marites meto1ee Mente SCN NM cractcn! moiecnematon sate ny breoies p aeranereng Berge: Atteodance and Maket p Wark Ae yuo: we niance x mentary, Stedent, wen eotanaie tee woee iO WWD ccrenwntaton $ismred Ate acvels mane nan nome 4 D6) ob tances 2 et wares Enowescrg tha tn st aensse mA parates oy te arcane Wineries aniancms raters tare mer"
    },
    {
        "image": "coursesyllabus2_synth_14_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COURSE SYLLABUS College of Science thehlay Hareen 65 201 Sraotes mad Agron conssents3 WWF 10 09 A. 11 90 AE Evanson Bening, oom 288 Movember 08, 2028 Marth 08, 2026 peepee ey 3 ents howe acne hes abormory) Prereguistie s) Wctcome and introdactian \\Vewicome e Data Siructuine aed Agoriiome! Th course wi kircduce you ty hincamenial concepts of ongancing a inarnadoteg tate etterenty, You wl nar various date eructures are sigerivunss echniqurs exsenta for softaare seveborere, ‘Course Theme Tide courte focuses on tre design, analysis, ard enplemertaton of Kinéamenict data wtixctures and alporthare nerd 9 computer science apptcationt Course Goals ‘Statens wil manter essenca! data structures metading arrays, inked kis stacks, comer, Wena, and graphy, anc avy onecogeiate sigur Dune for probier ecting Methods of tustrmetion Tha unnte emenvs w cx rO nate? oF ranrarie mctanen ande cn WboretOy eneonet, programa Basi mNS, Lolebuaee gue vrata, rd ca BN Sau ana yAe te Merion Warcre EW! eOnEHELS WER Drecteal Eepiminmatano® AEE Course Component Specifics ‘Coune nusenmict ncitas weekly pegraming exsigarmnes (30%) idiom exametinn 20%) fine anarination (28% maine payee 020%). wd Cvs paneepaton (ts) AE prgremmeg axgronrts suet be gubtied FMougn te ating foaming enepecrent ster Attendance aad Make tip Werk Hague atendonce 9 mandaiony. Stuterts ame anaes a maximim of Yee (2) abeenons per vammter Ereeneing tis Ke at renin avtemote twfvre, Late antasi fro than 16 eamaeg) wl be mashed a> anon Makeup wrk» parnaed oni for exaused inoseres wih walt Guoumertaton wilmeind wine 48 hav. Ausiienants minsed dim we uneneatnd atseneas motire Buns edt,"
    },
    {
        "image": "coursesyllabus2_synth_15_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "ELA SALLE UNWvERS Ty COURSE aVLL agus School of information Tecinetogy omy Siar ATH S01 Deterantsy sunny eoa0a8ec 769 TH FOR Pi. 3 96 one Memeston fishing. Fewin 179 Howeenbe 0, M25 tore 26, aes S288 (3 tives Sachem onto Prereqsiviteras oti quatre, AS seus doe acetir9 thom to nas Wort orn Comrie Tee PS S08 exarces cxcnary ter matay eg MH BOS, and sapkcanne tp O03 ey sic2i er cengeng A Saher, oaRirw cure se any sconces Cassie Ceete SEIN We ders motes x 5 BON ea, a8 nape. 18 aye, CHa atone, ant arg, af tnstrsetiogs ‘Satan metitoy P92% 5 retest: HOTS, OUR ABeVzBhne oo Rothamice! estinene Frat sxamscetion 30%; 8 manta: wasn Attendances anes eraen Season fabotin Work, ‘me or 8 288 68% tor esau stay seine gS Heston minis atyee THEE Mateo exarinaner see"
    },
    {
        "image": "coursesyllabus2_synth_15_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "A SALLE UNIVERSITY QURSE SYLUA ergy OER oazo960 yan Buisay. asnont nny claraepunnversgy 280 9 ben Prerequinitetst srpebuction hang veins types of diferente ry ant aggicatons of orarar inem lo real woe PESAETS F Sweteome and foo wi G20 BE SHI 8 rege exgienes We DS wens ae! IDOE 1 eniotng prsical SeenON Conese Pawnee na. ans Boob guary afterenta eqeatrs, HEE SE Th gouge exams oF sterentat guste, it BOY Coarse Goats ancy wigonng festonaer, secontarciet soa nape otter ag anaizze vos worid System™ estriado Genans emohasiing oom outatens nanan evades Necrarca! 6 13 a ace waatly Noreen a BTNT, 7 fed namanca MINIS SETS Course Component Specifies Attendance aid Mabe p Work cgoie ty oavening sesoe st"
    },
    {
        "image": "coursesyllabus2_synth_15_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "‘Schoo! of Information Technology MATH 301 -Diterentia Equations TTH 1 00 PM. 3 30 py November 05, 2025 March os, 2026 S units (S hours lecture) Prerequisite s) Welcome and Introduction ome to Diterental Ea Ry homework assignments. grove ‘mathematical sofware Course Component Specifics Grading is based on we Nd research paper 9 429d proper notation, \"KY Broblem sets (25%), ta SPIcatons of diferente Attendance and Lake Up Work DE LA SALLE UNIVERSITY COURSE SYLLABUS Emiy Clark 09289960762 ‘Administration Buidng, Room 178 emi. clark @universty edu ph"
    },
    {
        "image": "coursesyllabus2_synth_15_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY COURSE SYLLABUS ‘Emiy Clark (09283960762 ‘Administration Bulking. Room 178 ‘School of Information Technology MATH 301 Diflerenial Equations ‘TTH 1 00 PM 3 30 PM November 05, 2025 March 05, 2026 cemiy carke universty edu ph 5 units (S hours lecture) Prerequisite s) ations of ordinary differential equations. jg them to real world problems Methods of Instruction Instruction inchudes theoretical ectures with gorous techniques, weekly homework assignments, QU mathematical software ‘emphasing computations! mathematical pots, problem solving sessions {ncussions on appicatons, and ‘Course Component Specifies Grading is based on weelty problem sets (2 ‘on appleations of diferent each), comprehensive fal examination (20%), 155), wo midterm examinations (20% Ndemonstvate cast mathematical reasoning inl equations (5%). Al work must ‘and a research pé ‘and proper notation. ‘Attendance and Make Up Work Atendance is required for al class sessions ‘Suadents may miss upto four (#) classes without penay. Beyond this Wns. S8ch wsble for obtaining missed lecture notes tom Iuction from the fre grade. Students are respon Table on wth documented emergencies approved by the department sence wl resutin 2 2% ‘Gassmates, Make up examinations are ava"
    },
    {
        "image": "coursesyllabus2_synth_15_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY COURSE SYLLABUS ‘School of Information Technology Emiy Clark MATH 301 Differential Equations 09293960762 ‘TTH 1 00 PM- 3 30 PM ‘Administration Buiding, Room 178 November 05, 2025 March 05, 2026 ‘emiy clark @university edu ph 5 units (5 hours lecture) Prerequisite s) Welcome and Introduction Course Theme TT course examines ordinary dferental equatens, ther soliton, and applications to modelng physial phenomena in engineering, natural sciences, and economics. Course Goals Methods of Instruction Instruction includes theoretical lectures with techniques, weekly homework assignments, ‘mathematical software Course Component Specifics Attendance and Make Up Work ‘Attendance is required for al cass sessions Students may miss up to four (4) classes without penalty. Beyond this imi, each ‘absence wil result in 2% deduction from th final grade, Students are responsible for obtaining missed lecture notes fom able only with documented emergencies approved by the department"
    },
    {
        "image": "coursesyllabus2_synth_16_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "OE LA SALLE UNIVERSITY COURSE SYLLABUS College of Arts and Letters Agar hie BAG 261 Pranpine Uterus sar aes tue ane 200 FIA 3 30 Senos Compas, Poor 404 November 3, 2025. Marc Duns £5 haute etre) siamaergunbverey 20g Preveqaisitets) Welcome and Infrantwstiox ‘ieicume to Philonina Lasraturs! Tees course surveys the rich Rerary tations of tine Phiioainas tem procotor tn conlemparary works. You nib erste dveene qenmes, tans, aod voices that shave Falpna Serary kiery cufaral cornsiousness Course Theme ‘Yris course investigalea Phiprine erature m soraus hums mousing poeiry, fetion, dams, and evsays, examsing how Flipho writers exncene cxstwar dently, nateriza aupestencen, and sora) yeadtion Course Goats Students wil analyze moter aarks of Phiiopiow erature, scaterstand heserica ea ouoral corasats, and develop crite _anprecinton fr Fin Berary tra iema ana contemporary exnreaions tethers of Imsaructioa ‘the couine uttines cee seeding asd Morons aoessin of toms, seminar isle decwetans ensneaging eine Salogue, cwatise wring exerci, Fa ihovaria ancenntatsts wingiating fe ain kul wk ane guest ee course Component Specifier Awssvanertntises parispetinn i ates dcuasins (1%), 40 3 soph ure aire aa, mistne exsorination (15%), eae ANA Tost ae aeneeeemts Attendance aud Make tlp Work ‘Danneenl serene ao acine pargatan tre eter! Sudents ox parodied twee (2) esrences menu, Adetiena! abeanses teqsea nese otto detumantsen. Sasing so ham wt (8) wcvions resus in mvtornte todo, Reng ersqnants mut he scirsoted Defers ies. Uaka up work Kerowoistd sbsences ncst ie manger ain ce week,"
    },
    {
        "image": "coursesyllabus2_synth_16_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY COURSE SYLLABUS College of Arts and Letters ‘Adam Miter ENG 201 Philppine Literature 09873851092 ‘MW 2 00 PM 3 30 PM Scence Complex Room 401 November 09, 2025 March 09, 2026 adam mer @universty edu ph 3 unts (3 hours lecture) Prerequisite s) Welcome and Introduction Welcome to Prippine Literature! Ths, times to contemporary works. You wil and cutural conscousness Course surveys the rch iterary tradtons of the Phippnes from pre colonsal exote dwerse genres. themes, and voices that shape Fiipno Merary Wdentty Course Theme Ths course nvestgates Phicone iterature m varous forms: nclud row Fapino writers express cutural dentty, historical exoenences, Course Goals Sudents wil anatyze mae works of Phippne Merature, understand hora and cutural contexts, and cevetoe critical -92reciation for Flip erary traditions and contemporary expressions Methods of Instruction ‘THE course utizes cose reading and Merary ana wrtng exereses, mutmeds presentatons ing poetry. fcton, drama, and essays, examnng ‘and soci realities ys of texts, semnar stve dscussons encovragng entcal distogve, ceatve Wearing fem and visual ans, and guest lectures fom Fiipma autnors and cates Course Component Specifies IIIREmeM nsudes sercoaton m cass dncussans (15%), two anaycal essays 20% each) mater euameaton 5h tral Gramaaton 20%), and a creatve or esearch project 0%) Al ween work must olow MLA force sophisticated iterary anaiysis snd demonstrate Attendance and Make Up Work Consistent atendance and actwe pancoaton are essen absences requre medical oroffcal ta! Students ave permed three (3) absences maxmum Adatonal Gecumentaton. Mssng more than si (8) xess ons fesuts n automatic teore Reading"
    },
    {
        "image": "coursesyllabus2_synth_16_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY COURSE SYLLABUS College of Arts and Letters darn Maer ENG 201 Philppine Lterature 09873851092 MW 2 00 PM 3 30 PM. ‘Science Comex, Room 401 November 09, 2025 March 09, 2026, Corey 3 unis (3 hours lecture) Prerequisite s) Welcome and Introduction ‘Welcome to Philppine Literature! This course surveys the rich lerary trations of the Phiippines from pre colonial ‘times to contemporary works. You will explore diverse genres, themes, and voices that shape Filipino literary identity ‘and cutural consciousness, Course Theme This course investigates Philippine Iterature in various forms including poetry, fcton, drama, and essays, examining how Fiipino writers express cultural identty, historical experiences, and social reaities Course Goals ‘Students will analyze major works of Philippine iterature, understand historical and cuitural contexts, and develop critical ‘appreciation for Fpino Rerary trations and contemporary expressions. Methods of Instruction ‘The course utes close reading and iterary analysis of texts, eminarsiyie discussions encouraging erica dialogue, creative \\woting exercises, multimedia presentations integrating fim and vial ats, and guest lectures from Fiipino authors and erties, ‘Course Component Specifics Assessment indudes paricipaio in lass discussions (15%) wo anaytcl essays (20% each), midterm examination (15%). final examination (20%), and a creative or research project (10%). Al itt work must folow MLA format and demonstrate sophisteated Rerary analysis. Attendance and Make Up Work ‘Consistent attendance and active parcipation are essential Students are permed tree (2) absences maximum. Addtional sbsences requte medical of offal documentation. Masing more than 33 2) sessions rests n automat fabue. Reading ‘assignments must be completed before las. Make up work or excused absences must De ara wahin one week"
    },
    {
        "image": "coursesyllabus2_synth_16_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY URSE SYLLABUS. College of Arts ant Letters ee ENG 211 Pivippre Laeratury soersacioer Nt 280 Ped 3 50 PM Seimice Contes, Roum 201 CTE aioe lon guciven sty. ce pt Suns (3 hours fee Poeroquelsita s? Welcamne and tniroduction Wokzoiae to Phitpeine his course surveys the teh aerary tradition of the Pritinnes tron pre cosonis! lines to conoerporary works, You mi evpkre divorse goes, themes, and vomen that uhage Fle erary iat send cuter ceemoiousnces, Course Theme ‘This ccurss Mwentigaies PhSepne teal i varies forms inching poehy, fete, stame, and expays, examine ow Fépine writs exscens cuturat Monty, hatarieal exoecancey, art ance sai Course Goals ‘Students wif analyze maze woeKe of Phagpine ter otare, unerstans histo at apprecistion to Fano Serary ‘tations and nentenoonary expansions Methods ef fnotrartion al Contents, ane detesae srt! thers cose readeng are Berar 208 4 2 tents, secina syle Unisninns aororweging eitne dingue, caste weling enenvina, matinedia erxesiatons ning wing fim and Wess! aie, and gust wchures heme Fapinn minors and once Courve Component Specifies Assessment eludes panivpntion 7 ise disesuri 2 ‘av epammation 2086) anprisnied Hers ta aneipia! essa (5% seen ssiean eaumtnation £158), 48 cute arceserrnn prnjest (ISL A wien neck mitt tow MLA Formal aed da arsine Attendance aad Muke tip Work Cansistentatenance snd acive panier a ensenial Shdents rw panto oseaens regu ei ree (8) absences ranseims, Adelina 2) aHinin desemeninton. Mittin mow Han giv 8) saxaians wenuis in automate talure. Reacg sasignments mint bw samninied below lass, MANUS wirk lor excssid absenses wel be avenged usin one waeh"
    },
    {
        "image": "coursesyllabus2_synth_16_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVERSITY COURSE SYLLABUS College of Arts and Letters ‘Adam Miler ENG 201 Philippine Literature 09473851082 UATE ASIEN ‘Science Complex, Room 401 November 09, 2025 March 09, 2026 ‘3. units (3 hours lecture) ‘adam miler @university edu ph Prerequisite s) Welcome and Introduction Welcome to Philippine Literature! This course surveys the rch iterary traditions of the Philippines from pre colonial times to contemporary works. You will explore diverse genres, themes, and voices that shape Filpino Iterary identity ‘and cultural consciousness, Course Theme This course investigates Philppine lterature in various forms including poetry, fiction, drama, and essays, examining how Filpino wrters express cultural identty, historical experiences, and social reaties. Course Goals ‘Students will analyze major works of Phlppne iterature, understand historical and cultural contexts, and develop critical appreciation for Filipino literary traditions and contemporary expressions. Methods of Instruction “The course utizes close reading and iteray analysis of texts, seminar tye discussions encouraging tical dialogue, crestive iting exercises, mulimedia presentations integrating fim and visual ars, and guest lectures from Fipino authors and eis. Course Component Specifics ‘Assessment ines partpation in cass discussions (15%) two analycal essays (20% each), midterm examination (15%) final examination (20%), and a creative or research project (10%). Allwitten work must folow MLA format and demonstrate sophisticated iteray analysis. Attendance and Make Up Work Consistent attendance and active paricipation are essential, Students are permited three (2) absences maximum, Addition: absences require medical or official documentation. Mising more than six (6) sessions results in automatic falure. Reading ‘assignments must be completed before class. Make up work for excused absences must be arranged within one week."
    },
    {
        "image": "coursesyllabus2_synth_17_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS COURSE SYLLABUS College of Arts and Letters Prep Roberts 8US 201. Statege Management 0934222127 TTH 1000 AM 11 30 aut Oraduate Senco! Busing, Room 317 November 06, 2025 March 06, 2026 ho roberts Gunwersty eau ph Sunes (3 hours tecture) Prerequisite s) Welcome and Introduction come fo Seatege Management’ The course rte ates You busness knowledge to adsress complex expancatona chatenges You wH lear statege teking, anatyse, tormaston {or eflectve teasershe ang 2° mplementaton skits neces ecwon making m dyname busness envecrmerts"
    },
    {
        "image": "coursesyllabus2_synth_17_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS COURSE SYLLABUS College of Arts and Letters Pate Ronee US 301 Seaiegk: Wanagement wssnazz2i77 TR Ou aM 11 90 AM Oretunte Son! Obie, Rae 317 Nowamber 08, 2228 Murch 06, 2026 pnt ee edu gh Sure (3 hn helen} Prereguisitets) Weicome ud Introduction \\Welconwe to Stratage Management! The course miagrales you Dustiese Kremsdge to adarees comaiex orpancatonal cnatenges, You wilnacs ckutege tinting, an2iysie, formes, and enplenenttin she necessary ee ottectee tacershin 4 decision making in tynani: business arvkonments. ‘Course Theme ‘This courne fzcuses on etvatege panning ar: molementaton procenens, competitive analyse, corporate yovernance, 2nd suntanahle twannes practices i the Phéppine and goal content Course Goats Statante wi cevnioy strains: thrking capable; onabjze compettne tsvecnments. formulate eftecive svaiegies, and understand Imphcraeniaion chateages lacing contemporary Dysticatees, Methods of Justruction euston conmina: cane stuty analvet ef PvApoine av o tinalre! companies Gunmen Emulation and leglaneng crmenat, guest teenies tem nusin Radars, oMabO at ve GIOVE \"TRS davedoning salegD HME Bnd bid ROR sacar eamiege eae, Course Compeneat Specifics Evetaion martes cane winyss pasarinsas QM). grave stotegis len oft 304 stam teams OM fat screen 20%) pr Snowe’ ratiston parent) Prconenne asentaten 2h snd buts Sunmsieatn ae emchaised trough Attendance and Make t Paguier oteraiance expected far at yescicins Sucdents may have up 20 thine 3) atouencen Cate yawseniatons cacinet U# made kp Fabuent ethan prot approval Stun procl nok gules eandeaber Outside Uass tow Panupeur: ehbe Jdeutwane rnd acing cnieany pas YoU grvim Vall docuramtation revive er any abcenwn erewertng He eat"
    },
    {
        "image": "coursesyllabus2_synth_17_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS COURSE SYLLABUS Collage of Arts and Letters Php Roberts aus sei Straingks Management psswazaesar POH 1000 Ade MO Bae Seastente Senoot Budsing, Soo 377 Hovenher 98, 2005. wrarcn 06, 2 Sune Gnowre ctr ohity ober Qunbreay edhe sh Peeveqaititets) Welcome aud introduction Wisicome te train Managersnot! This course mlegrates your busbeNe Kenedy io aetirass compien lerganizationa chosengen You vat own strateg tnking, analyte, formulation, sd imnlomanisliin shag Necessary ve naiters ép one dlecwion. mating i dyrizinis Baskigey env on mens, tori Course Theve “The nourse tocuse on stranugic piznniny ev baptsenantaton proceeses, tormatiee anntyats, cxporate guy ‘und vustaviehie busters pracizes in the Patipine and hiss costent Coarse Gsats toientn wa Gavin etraegis inky capatiiiey, ansinze emnapettive ennvaniauns, ferme eft ister implementation chatemsss facing Contemporary argeaszations Methods of fastewrtion rte se 18 vid anetysa 3! Phéoping ead imemaionat oaniparins, busbuess stations nid mop ie par, ed enchant, Course Compound Specifies hides case analysis presenta sartnaben (0h), and ineiideatrenacton 59, grou states plan project ‘S04, rattan saan oer (0), Provessiona pmiamatatn Ss and husinons oomnuniaton we hitumdance and Makelp Werk Roguisr attendance is ovpestad tore sossions, Stesenty may ive up te thse Gi abserses Case omsentations exnnet mada LB S absent winaut pipe gum, Sean prejact work segues exentnntcn culsae cass tne, Paignton i ease sd stb signtionnly aseanne you aad, Va dcacreta se BxcOSING ek ‘requ foray aes"
    },
    {
        "image": "coursesyllabus2_synth_17_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SaNTO TOR OOURSE SYLLABUS College of Arts and Letters Fist Roberts BUS 201 Svainge iMunagement spseaanteT TPH 10 08 ai 14 30 amo Orrduste Shoe) Bunting, Resin 217 Heweraber 08, 2908 arch 98, 28 hip reas Gniversity ads eh units (3 roc tere} Presequisiteys) Welcome and introdueties scent Sicttegis Managem! This curse micgrtes your tecens knowinye tastes comiken Pee Shalsnses. “ou wittewmn states: dunking, onsite, trmutstin, and mptemantaton seg neceesiry for elective leasorciie and Gustin making m dyrninie leben, emnizonrnancs, eure Viewtay This couse focuses on stategic pls rang ait implemenietin sroceases, compative ensivess, corporate govarnanes, Be susksinabie Business rracines 8 the Phere sex. ghobs! rantent Coarse Goats Stasieu s wi dvelnp strates Urey eapsnities, an eatecsiae snpinmectinon Chadengee fickg Methods of Insernetion stnicie combines case mucy analais af Shkoc exercises, guest apn akers fom Mdusy omer, om euneos rusts inves, sre compeltice on contempsiary ongsnigations, 8 aed intesnesonat compe ootabacation go 8, buna Sorutions and iolesinying rivets dewwloning, stat Sin, ans etnadua! sesh Course Component Specifies Evehieten neudes sane eebsis pmcentater ns GB), gms sowing oi st end inca eating posere emphases tort n priors (85) Prutezaiana! presenta 9), mitvenn axamrnseass GAP), 7 SAN ant uLinass seomimcnisation ‘oe Atiendanve and Make ip Work we ‘sempesied tr 65 sesans Dhudenis may hava up fo un Fsbuart athe por aperees. Grove arin snd evinins spits ere lay standea"
    },
    {
        "image": "coursesyllabus2_synth_17_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO Tomas COURSE SYLLABUS College of Arts and Letters Philip Roberts BUS 301 Strategic Management 09384222127 TTH 10 00 AM- 11 30 am wnat Petentatons 25%). group statepio cmpnenang 0%) and indiual rtacion pepe oy Professional ‘emphasized throughout. Attendance and Make Up Work Regular attendance 1 H absent without nd aces. ‘Graduate School Buking, Room 317 Philiproberts @university edu ph lan project (20%), midterm,"
    },
    {
        "image": "coursesyllabus2_synth_18_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "MAS UNIVERSITY OF SANTO T COURSES Caitege of Engineating py 34 Aamosral Pa scion? ‘posters Caster, Raeen 101 if 9 08 ANE «RAB sancaruty 22 Fronequisitets) welcome and Introduction greene to Ronse Pasenosgy| sourue sxanines posers! fe mtia, EH CMS spre a rl neath aries, sagnoave yrecessen, AC peepee creo unceraiate cores reverie te Poppe Somer remiments Yous perverts vate casera and oe Canes Pete ‘hin courar sapere ‘erate, gesssnathy, and developmental senghanizing ei aye enyenossgva S8Cides NAMING STAT se BY oaanansaeret a een BERTIER: sce sa, ond see facies peor, caseese Goats Ce eyo ears A! TOTES sgaocane, sserntand gin BEFENIETE mar nen, ave cee TS OS nen aagrcnis ant renee Methods of insereetars etna pes oan ones omens 2 na ces csr cages ars SE ies aren tom i prctanes mes se an sana nd eel A coe owns oseesssen tit Course Componcat Speckies eines we nennsinns 28 oa oy wry sree BEvETEN OS ee oy taco ees GH ast eso Goons 5%, tes aqui at 08 mes none nasi tis Soot pereted. arneniaton vate oniversty gute and Mate tip Work parma sora 1 na cours, Faroe GpaBSETONS 7 re amnadonss mst prods ronda Toei 24 a. OK Sane Wom Attoudance tarcbnnes 2 mens3toey fee cvsvtsian om te wens ween ccon and erties MSS"
    },
    {
        "image": "coursesyllabus2_synth_18_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY Ol F SANTO TOMAS URSE SYLLABUS 25Y 201 Abnorvaat Pays oni xan 5 08 AM 10 00 Ait rosderee Contes, Room 161 ner 14, 2025 Mossi 14, 2026 poets Provesaisite s) Welcome and inivedestio: Welcome 1 Atmarmal Pay sin nurse examines vsyencogica! dsoraers, thei teztrenie, You wll devaion uncerataviing of mental heat eeusa, diagnestic p interventions with the Priippine ann sthical eam Coure The course exper 9) xiaty, O98. De cisoraars, emphasizny evidence based arsesemant and ireabment ansraaches. psexrongic ‘aed appreciate cut od bieisga, nyc soni a treatment Metisorls of Snstrnctica om presentations ans view anaes, 5 yractianars, ume: arate revients of etn Jesus, quett ertures fom oi usnronststing sssensment rechniges Course Component Specifics Grading ihiles ino exariatizns (289% wach), 2 commamensn este sue (03%) ss nereipation Attendance aad Make Up Work sven i ania ce th foe period, Anza 25 beyond this frit"
    },
    {
        "image": "coursesyllabus2_synth_18_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY O1 SANTO TOMAS SYLLABUS venet Sma headin ianel smiteQentveratty. 2 ph sth ‘e2ues, ciagnestir processes and trerapeutic ten, 128, symplorrs, ant vena vitence besel azaenement sing anxiety 1050, nd devsiog Csirse Geals icant wit ecty contesting te nd describe mar payenoiogical disorders, utd st nase, aed ane Ors dings Methaus of fast Joree erplave sutineds onze piteenintins and vis enable, massive due practioner, ane bis. sal ars sania psyehek otetia aid efiiew’ tins on sg: ain veins oF ouat Atfendaes nad Make tiys Work Fintona a mantatory due sue 7 fe (9) absences or yunitan Abeereae Gey the ont ine must yd matical Sacurimtatan witha 24 magne, Clase srseng ere pask patn and grelecsions! Nehuvilv aa siteginl te iesinng outonmns, Maken work posioes {thw usHansty gesetnRs."
    },
    {
        "image": "coursesyllabus2_synth_18_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SenTo TOMAS. COURSE SYLLABUS College of Enginaart SY 201 Abnonnal Poyehatoge spat Somth 5002 67S ANF B00 AM 15 0000 Pestamric Caries, Bons 194 Hovember $4, 2038 etary 14, 2028 anctonetugenserety wae 5A Sunte (inoue metus) Proregetsite s: Wrteoaie aal introduction Wricone to Abvermet Prychotioz! This course nvamnes psyehaiopesl Snow, Seek es Taxtesnit You wal deseiog wtserstnding of manta haath enue, Sagronte rerventions ats cultural end ethical remanent cesnvaii te tne syrwtoems, ant Preessees, and taerapsie Prine contest Courts eee Gib carats explores (oar pe ehokspet saardeO wakaing analy, ond, Beychote, personally, and devekegmencl ‘Shordere, emphanting Besence tatH? eases ein ara iresttinn megewacone Cassese treaty ‘Shicots wi ents sit describe na pay Ponty fo mania one, ant apes Methods of tnatveesion ‘ha sowse amoioys mutimacs so59 sresentnions und vide enue SBESYA. gues mesunte Sr geal jase emonssnsting ascent sechnigues. eeara Seawcters, mines Blakes, pay chehegioas, ad soil fuckers coh caraiterstions m Gagroeia at treatment veractice dlesvutioms on aiagnoate amare end athe! ek a tee teas Sure GME, ens espRCSE nebien Course Component Specifies Gracies nies tao eran aiars 2S ca, w seenpitshshn oe38 thas ana OMe hurses (AES), cess partoiatun end gultsan (:6'%% and cefavn jamais [aay Ebace setae wanes an agen wee sey And prntassens: eal Attendance aed Make tlp Work Alteran omc detory ux tthe ntenamtng nature ef tno ene. Thee ranuey conchstion wt ip enteter Bh patemoton and orctesenas hehe a iobsences are sacnted. Assenons beyond she Em Werte musing axseirstions mix pase Sethca! das namtasn we 2 me Gass Higgs aiming cuNratNG, Kk ack potas foo anna gobner"
    },
    {
        "image": "coursesyllabus2_synth_18_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "JERSITY OF SANTO us COURSE SYLLAE Janet Set College of Enginenting SY 26% Aniormat Payot rane an ate 10 00 AM annie Canter, Roi 15 spat emthcpenivorsiny op Hovember 18, 20 ‘itn (3 tcurs tecture) Peorequbsitets) yohminegsal sorters, tase causes, syranion’, on Teoues, cagnuatic procestes, and therapent so the Praivgine content Wricome and isnradivet “véoieomes fo oneal Peyonaingy! TH treoivects, You witdevsip uoderstanning of maria aa arvana. wethan causal and tice ramensks (SHY a Course Theme laevis rs course exolores major 20y°) distwdnra, emhaslting ovsisnea tated aszeanTien 3G Coarse Linnie shdents wa ently and desorbe ‘conivtnting t monies ons, ard mopeciete SMothuds of tustrection fs anne presentations woe enpiet dinsers waka ancy pepsi, Cer20NaY, 326 eaten apeoaees, siogieal, ane cis factor’ 5, anuieiwtand tologics!, Pe ‘Suge anc Beaitnert sae art attest veawo vents, etonectoe Ganuasians on diag ie engecrantial acts ete mates 2h CL OETA. run eric stand gue’ Hee caving aeeassment cachoiques: pes msaeror aparnn 8 Reece a preset onus Course Compnaent Specitics sa eats 25% ageh) 627 er wn ant sateen UN ND BH oasiea dieorder (354), sass yaroaneton 378 fm eequted at of Sets Attesdance nad Make tip Work vw is epnedaery dus to the interaction natant vrewmer, Saabaci weang snaminesons rst Tntegratsa meting autzarns. Make up 00 9 tne onan. Thc (2) ances ae paeatin’, Aocenees gayord INGE vrpoaa necions dzcutreriatic! win 26 Rows. CaS anaeese vos tau unary gueees. equiv sonia sts he virvenodae acl astesnet HEDEU 6"
    },
    {
        "image": "coursesyllabus2_synth_19_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "Ubivens RSITY OF SANTO TOMAS SOURSE SyLLaBug College of arts and Letters Siestey Goi SUS 301 Statege Management snersezre e TOW IO ARR 30 aay Nowamber a6 5 Macok 66. 3625 Semis (3 how tecturay Poevespisiters: Ft steome ane tteoduertian Biscotre to Strate Managemann \"tha couse, ‘easement chasengen vz fot tiectve leaders ares toot strategie tin deta mung cengenie Carthate Bernat Busing, Rom 164 Snaty arttecdeunveeny ty ge men tt YOO\" Beslonss krestadgs 9 eeteay comptes Nene eTUSHeD ehdtremeninn spay necessary oscars onvecceneats SEES, cei \"SMALE, sorserats govesrance, Course Goals Sudaets we sevedip a ‘onsereleetirRinwsemigten clase Methods of fustetcticn Course Componans Specitios Evatustin mca sane racine 04) 2a tmehastad ormughoet Sess prasemiasiena ‘dhesiustrainesinn papas ie, Attendance and Make t) Repos mttwriosen is eects for. kn aban? athe, Bark, eo snsiatons and seeing Ie Na. 52 is) sagan S209 wong ota prt 3 Pfetsane Srtartovan mis an ousiess moore “0 BO, erie ecomenaion 5s Be: Seon wisi eH sequin Nt wstivins sii"
    },
    {
        "image": "coursesyllabus2_synth_19_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "ANTO TOMES COURSE SYLLABUS, tee of Arts and Letters Destiny Setain BUS 301 Shaan: Management cas7senTBes Th soe aM aise an Grasviate Semmct Bushey, Mein 828 iovesrhar 86, DHS Marah 06, 2026 destiny gribiegguniversty edu ph ‘Site (O baw teluee} Prevequisietsy Weteume aud Intendvetton Wintcome to Strsteges tanayernent Tus curse mnegiates your iuiness kicrsdge to addvese conpler ‘orqaestonal chalengos, Youu 2B tee, strategie thiecing, costes, formula, ang sepienvenaion skis nsre8s2ry toc atecsve leasershp afd hes conree focuses on strategie lamang ane impiamecniatnn sand gustenabie Susinass sracties i tie Pn Igoteta Course Casals ‘Siucente wt develo atzctag thinking cmpabiites, analyze compatins anuecmente, formutate effeclne aategies, ar uncetstand inplementation changes frcng conteenporayy onpanizaiong Nietinads of Instrnetion insruation comin cass i i tematana) compininy, Gusness eimaletions and mie giving ercheR gust speakers tam erhasty esses, taburatve gruus ymieers aveloing raRtayis plan. and reve! waar ‘on rum atrategie aus, recesses, compettive analysis, caro Cr yoreenssce, atysis ot Pripsine ‘Courte Covsponest Specifics Eventi sckides: exeminatin [0% ant inihuet een ners (58h Pos acrpnartzed DUI 3070) wise exammravas (208), oe! suinne) prasensaven S46 and bueers rrownstan oe Aitensianes eal Makolg Work Fasgulas wzomin 6 H abamat whew! aero ‘958 aouras naneingnly spaets sec ts a naseians, Bhodwots pay have up te thes D) abaenues Case pmaneistons eavactioe mage rovnl, Croip anciast os sequins sourtinaton watts slags to Pa be Wali doousantiion 2 aquired Suc ey asance excebrieg tne ert"
    },
    {
        "image": "coursesyllabus2_synth_19_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF ‘SANTO TOMAS COURSE SYLLABUS Destiny Grit (09375827848 Graduate Schoo! Bukding. Room 158 destiny grtfa university £34 Ph This course integrates your business knowledge to address complex “You wat lear strategic thinking, nays, “ormulaon, and implementation skils necessary decision making in dynamic business 6” “Tris course focuses on strategie planning and implementation processes, competve analysis, corporate overnanse: a ce spe bunese practzes nthe Pipe and geal cones, ee ang cats, yan cose rant me ee a <thallenges facing contemporary organizations. spi of Phappine and intemuttonal companies, Pannen simulations and roiepiay 9 reas geweopng seat ans, and ndaual sean ‘colaboratve GFOUP (90%), midtem examination 20%). fl ‘Course Component Specifics ims ond business comenunicalon are tations (25%), group stategie plan profect vauaton nudes case anys preset eon GON) end ius fection papers (6%) presentation cronaszed thoughout ‘Attendance and Make Up Work vee 8) Students may have up 10"
    },
    {
        "image": "coursesyllabus2_synth_19_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS COURSE SYLLABUS College of Arts and Letters Destiny Greten BUS 201 Strtege Management ons7sez7ese TTH 1000 AM. 11 30AM Grmauate Schoo! Buking, Room 158 November 06, 2025 March 06, 2026 est ttn guriversty edu ph Prerequisite s) Welcome and Introduction Wecome to Stratege Management! Ths course ntegrates your busness knowledge to address complex ‘organzational challenges. You wil earn stratege thinking, analysis, formulation, and mplementation skis necessary {or effectve leadership and decision making mn dynam business envronments Course Theme ‘Ths course focuses on stratege planning and mplementation processes, compettive analysis, corporate governance, and sustanable business practices in the Philppine and giobai context, ‘Course Goals ‘Students wil develop stratege thinking capabltes, anaiyze compettive environments, formate eflectve strategies, and understand implementation challenges tacing contemporary organgatons Methods of Instruction Insructon comenes cate study anaivas of Prappne and niematons) companes. busness smulatons and ol. playng “ererones. guest sweaters tom movaty aden colaboratve grove promcts develoong sratege plans, and ndwdual search ‘on cument sratege maves ‘Course Component Specifics Eveveton meudes case anaiysa presentations 25%) group shatage plan project (20%). madtern examnaton 20%). tna! ‘srammaton 20%) and ndivdual acton paper (SN) Protessonal presentation sil and buaness communeaton sre eronanaed Provghout Attendance and Make Up Work Regula atendance expected fra sessions. Scents may have upto tee (3) absences. Case presentations cannet be made up absent woot por approval Group prict work mqures coorinatton otede dass te. Portopaton m css decutsons nd scovaes sgnteanty mpuct your grade. Vahd documentation requeed for any absence exceeding te mt"
    },
    {
        "image": "coursesyllabus2_synth_19_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS. COURSE SYLLABUS Cebioge of bats and Leiners Deriny Greer ALIS 201. Seaieue Management omrrsaztet TT YO 0D AML 1 DARE mde Senay Buin, Room 138 Weevserme OF 252. Maren 96, 206 es Dunas (2 hous teciare) Prerequisites Weteeme and Intradection \\yurune b Stalege Managemen! Ths comve nengrates your Beamees Anceradye th afkress compen mepwerstcnal cheberges You wa lnarn atatege (iawn Bawa, Kamadainn und mpmmentatan ee Nee7 y tee etectee nucenng and cac cransens yarn business emevarenes es Coorw Theme rig course Secunes on Seatege ANN) 28 enolemertaten RODEENES, Corp aneiyt ect sunaniabe puters Ursctces i Sie Pravone an gisbes contest Coerve teats Stutante wh geevang Wwstege Yang CAUIDIENS. aNe 24 Compre envesemarts Kerrudabe Mecive SERGRS, BS crerstard molerren atn cages 166g COMME EY O INESE I Merheds af Lastrection nerscucn semen cove sists anaiyna of Poagene BYE etamaiumel asmaar at busravs wrusatnns ord Tie 9478 vertapatten tom acer, moder, colabera e group peels develenty Miawpe 2Ene And delve HeE Gn moment mintage 24969 creer ate governance Coprar Coonpament Specifics Eennes svacsen cone neal goetarratas 29%) oun siege ei Minne Gent ona vtestoe rteaan paper St) Pndenanrs esartatan she segrancod wocumrent pegest OM) women eapenritean BO fr en) Waneent eomenasicatern £8 Aitendaves and Make tip Work eputw enursarcn n enpeciad tera} sonwans DALoam ay ave ut wo vows (2) eons Cane pronaniers see! Me St ieee cece t pox espn. Group pact wan mune conan” euctie devs tra Renapeuan cess cunniens deerme reecnes weeces vee pane 08d dovamaniaton sequen fur any atterse enenedeg f= re"
    },
    {
        "image": "coursesyllabus2_synth_20_aug1.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVEREHTy COURSE SYLLagUS Cottage of Enginasting Babe thovsean 864180283 ENG 201 Prsicaioe Lterabirs Hemems Cems, Room $29 M20 Pe a 30 6 Somin Cerise, Reams 22 Hosecstee 13, 2925 awe 3 ante (3 hour tecture) 3, 2608 ih cares Scere. ate: pe TES Sours rvestinstes Pritzoine Susser Now \"ions wikers exprene o i varioun tort iekalong ne a esi, c s Sstoreal ecommnces, ae sia re SEN WA mye mace nore ct Pagsing Reratte, siddratant histor an cect, oMtats, oo drat cna ‘Svs eCoabe f° Fue Wer ary endian 06 contemparany sseceencen Methacts of Lostreetion ‘he cour weirs dos Coerie Component Specitios ‘Ascasemats metisex paricenaten 1 Roteramenton Gott e Suphatincted Seray anahoe, Attundsace and Make Up Wark, Snaet tendons ad wate caseoag 78 eszeniay 8509005 meso ma Pa ant 2 enn tees 6) nusenoes. SH AS honed cence Meet, Lg nnme oa Sraneaite waste secbitad tater cane Mass ws 0 8a esta ay"
    },
    {
        "image": "coursesyllabus2_synth_20_aug2.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UnivERsiTy COURSE SYLLABUS Cablage of Ereinonring Beebe Tarpon ENG 201 Phieping Lteratice one 165 Hes 220 98 3 39 Phe Aine Oars, Remy. Rowena: 19, 2005 wares 19, 2058 Pest nempscouckesesty ac on Jones (ure etre) Prevwquinitogsy ‘Websane and atrudvetion ‘Were te Phtesine LAeraterat ees te contmorary works 6 cuore: ‘Thde courte aur veye the ici tarary tance wi exciore Swerse yances, hermes, x03 GF he Frosieas trom pre cemnniat Yobes Haat hase Pgpinn Kerary isenity sree Course Thomas [ie Rots eeetgaike Php Bacar 2 varios fos PeMeNg potty, Teton, ame, and canny, entering ‘Se Pino wee waa cua edly. Madan expenmmene 278 socal eating Caer Coxiy Soe MP ines we Of Phbnoine feet, uidersana Sisto and aut Somessien be Fisito Neri backer and comtamgotay enpven Mithwts sf tasrwetion Zee cots lors scte nacteg ns Sacey anaes ex soca SAeOWNERING CGa! Setogun WNG onmcines mctarani Beventen eyeing ti ted oe Course Component Specitios FAST to arate axsuys 20% ancy Bn ewwatis se eanaach 5), Aa wise wees ‘idiom eanenination (1886 rapid tee Ti fobow M A roman and aamansiain Mtendance sad Mats tip Work Serio tence so este pet srvenaos rege dine ‘xe yanesic oe! Be om"
    },
    {
        "image": "coursesyllabus2_synth_20_aug3.png",
        "label": "coursesyllabus",
        "ocr_text": "BELA SALLE Univengery COURSE SYLLagus College of Erginestig: Breatet Terrason ERE 201 Pho Lierance PeetaKa9e9 v2 00 4 90 res Acaveric Santas, Reo 333 Sovemibes 13 2005. aren 93 2 ‘itsbit Pameonffeniveraty ey pe 2 te hours cre Prerequbdie s) Welcome sae lotreduetion Veron i ‘soe to samemparary works and cukira cosnciovatae, Course Peeame Phitnpive Lteraturel Tie 7h courws investigates Bitpsane \"e Barahare 4 vars oom ncutine pat fio Fano miter expres out Canrse Goals eprecieten Methods af Lectructiog ur caus vanes 8 anaise ae wceks ‘Seo Rerery Seco ane va Rantay, tecnica manerisrcis, aos Povo te atire, arsorstane Santen exsreesions 9 Decay Nel of tte, se sane svegraing ‘ran vais! ons, os quest netoee Ceerie Composer Specifics Bssacomant mstiden sarmepetinn tne exammation (951, sephetesied tera even Ateadance and Muke4) Gonssiens asamtenea and as sSsanoen mune wedi ot eter esa 2 usa Kaewvsen (25% or rusmarcn aieet ow anita essay 20% 82 Ab tte week ma Pp Wark Five, seam, se we eink aches a 7s auton aneourag fem sis, weasog My wit viegce, ote Figure authors end eat S434) wins wascrinasina (Eee RCW NES tamer se serrate"
    },
    {
        "image": "coursesyllabus2_synth_20_aug4.png",
        "label": "coursesyllabus",
        "ocr_text": "DE LA SALLE UNIVER! COURSE SYLLABU! ceri Ekeabeth Theresa\" callege of ENG 201 Phin Lert oupttaaseat cnduane Canter, Pin 323 sew 200 jacch £3, 2028 eizatelnSoomnpeongQunirer iy AEA Mowerober 13, Prencqusisivets? Weironse sua Luiradction Jyewome to Prafppne Ulerassral This coarse surveys He D Craes ty canterngorsry works, You wi eaaisre averse GETS aed culmar eh COASCISUSNEES. say wemions of ts Pi hemes, ad vor that stage Paces oerary OMY Coarse THERE ra, vt e3aye, EXE “Thin courne nenatiates Pola ow Fagung vires re Coneese Gonks susan wih anaiyae resize works of ‘aopenciation for Fog Rerary Wats’ poetry, Seba, a on eae. mic ro arate in wares seedy, tantra exon and cevesop cnttead srotopie erature, understand histo and eaten comes sas eramternpOrety GAEDE, Rdethoals of Instraction “The uourse wigan ole Ceevresses, maranatha Bm a nnobrte ot ants, seman Sons 4 urs ons, an Guest nes aed cetuees Ors PANS er a arias integrate sn 3 1799 oom) dion exasinatie Course Component Speekes tas putiignven rats sions “Seatee oceans prceat 00 gs, tae osuarical eye seven ate est TORN Rh Hea! are apsesconert rat sxarsvation OW) and ovivstenied Harary anes. Attendance and Make tp Werk fa paricnetun are zetia Si ers saan 3 Tor aceuved ansenses runt Gunicent etandance ord sti seats nna pranioed cee (3) eonenoes novia, AHO ceieaes remare nacen’ or ofits dacumantaten, W7 py secaions casas in mciomate saburs, RATED werghenents unt be eompiated Before as, Makedp WO fecorged wins a7 week"
    },
    {
        "image": "coursesyllabus2_synth_20_aug5.png",
        "label": "coursesyllabus",
        "ocr_text": "OE LASALLE UnVERsiy COURSE sy; BUS College of Enginsering Eieabea Tromecn ENG 207 Poin taecaure o9esiseaans 402 00 ons 3 90 op Aowaere Senin. tn November 13 2025 tiacch 13, 2576 wet (2 noe tectine} Prevequisise sy Welcome Sted tnivoductiog Sec, pili Uierateat THis couse ‘oe i coniempcreey Pi Couns investigates Pipe te atious fers ctatng poetry fe ow Fiche witets express sumuret ig Ratonices experiences, and soci ‘sae orks ION for Fbing ecany Methods of tastructian Te cotnse ust eto opting amar abet Herter Norcal ang “u scons ated revtaerpe, Pure wont, a BY fxpreaaions 8 ing nd there says ot ikea sresanistone nega Course Assessisent EEO Specifics Seokdos pecan 9 one Hen 208) ang S0phistseind vary anagns SUA 1598) S00 sain! os fea excemin eae ots 8 (0% At weton iad: LG 8890 mitten cxeniraton 185) ‘tt into MLA Samat and demons Aitondanece sad 44 Cantiinat atidance sb sees eave Se8mante oat ake Work Acs ace patsipstin ace mention \"eSi04! 07 Sail decane De competed setae cnes fat tnese £3] ebsences mace hs bs mica snare, st Ds aang vane then 4 Biokean wat tr cron Reuters 18 hes oe va,"
    }
]