[
    {
        "image": "courseoutline1_synth_10_aug1.png",
        "label": "courseoutline",
        "ocr_text": "University of the Phiippinss: Cobege of Eragnocring Cibnan, Ouazon City PHILIPPINES: COURSE OUTLINE SY. 2024 2025 COURSE TITLE Business Anayics and Dats Mawng COURSE CODE BA SOT mammons tor anat zing DUNES Cas 1 predictive Todwbing, Class Acsv0N, eee roves, andiaxt marung Siucerts wit learn 1 Use arviycs iOols Beet WacTINERUe 2 Stoport easeress deewsicn eaking. EMRDAMS GAECRC On BrRCECA! ADORCETONS wRinD \"eA DUETS COURSE ODUECTIVES Understand ine role of o siness anaiyies 19 orgaruTasenal GAcwOn- TAIN] 2. Apply Coscrettve statistics and vituekze9un lachnigues explore Laxarst ae 2. Bull preictve modets using regreenan analysis ard kee sates Torecasheny 4 rrotemant iassdication sipentens for custnenar segmentiaton and cum: predictor 5. Appiy ckastenng mechmques for market secmeniaton and pater Cscovery 6 Use exsociation ruin mining 10 identity castor purchasing patterns 7 nnahyze text data using nnkural tanguage processing ans senimant anniyes 8 Communicaie acisivecal Boctings aMlectvely Sviough raparts ond prasentatons UTERATURE +. \"Bumineas Anaiysce. Cals Anaiysis Dacaien Mating’ by ADNGn 2 “Data Moning tor Business Analytics” dy Shue, Brvee, and Patet (4 Eaten) 3. Preaictive Anatyies” by Evie Srage! (Revised Ean) (6. Rand Priton documontaton fer cals tomnce Hbraries ypandat, scikitlean, Kyra\" te) Ana Winston (710 Falko) COURSE GUTLINEITOPICS: Wieee 12 Decanter te ausneed anaytes see pmaeOn eoperatny Be anaT “hen 54 aspen atecence Pinan Dating, centnnen eter ‘heat 48 Une gen SOU URAC, I Meas eek 7 agen manna seni eee, eanntaanan meen Vieek BE Chantemg mere Sanya Cust fram (0 2 Aasce aon tae meg, MAPK Dawhal 2 fieek 104 Fane sere anya, teaming enters"
    },
    {
        "image": "courseoutline1_synth_10_aug2.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippine: Coltage of Engineering Diliman, Quezon City PHILIEPINES COURSE OUTLINE SY. 2026 202 COURSE TILE Business VASE CODE 8 and Late nd BA S04 fs statistical and computational methods for al Topics incivele dascrigtiva analytes, preich Y, asSociation rules, and ‘ext min learh io use anslytigs to dateney an8SS decistor maizng, Emphasis is plaoad on prachea! applictter vatasets, COURSE OBJECTIVES 4. Understand the role a aiyics in organizatiana} secision tsaking statistice and visustizntion tc 3. Batid pradiouve modets using va 2. Apply descriptive ques to explore business data aression analysis ang 8 forecasting 4 tnipiement el ication algorthens for custorn mentation ang crissy prediction Say hy clisteving lent wokwuee foi market segmentation and patie dicen very Usk easocition nite mining to Wnty customer purchasing patems 7. Anryze tent data using rata ismainge procassine ane senimwny analysis 8. Communicate snalytion! Sndings ettectvely tucugh ro LITERATE io\" by Albright and Winston (7th Eton) 2 \"Data Minin for Business Anaivties\" ky Shenueil we Analytics” by Ene Siege! Rav +R and Pyinon documentanon, Bruce, snd Patel (ath Bein 3. Prada 0 Eattion) ata sex fio Horatiss (pandas, seikit 1, dyvarsey COURSE OUTLINEFTOBICS- kmadasan i oerens mes, data wepation emery data wets Weer 34 steal naan, Spree Sy cowsence wienate Week 5° tia ene 8, tine epession. ate season Woah 7: Levis regression, wat Weak sete Tet sores sr, lamang retnose"
    },
    {
        "image": "courseoutline1_synth_10_aug3.png",
        "label": "courseoutline",
        "ocr_text": "COURSE TITLE; Business Analytics and Data Mining COURSE CODE BA SOT Course Description: This course cavers sabSca! and computatonal maiiads fot analycing business date and wilracktey ackonaote insights. Topics inclute ooscriptve analyies. presicwe lasuificuton, Clustering, sssociuton mies, ond tent wening. Students wit earn 10 use analytes eis and techniques 19 dean business cecison making, Emphasis s placed on practical anptications weing read business COURSE OBJECTIVES {Understand tre tote of business anatyice in organizationa! dscision making 2 Apply Gescriptve siotstics and visualization icnniques to explore business date 4. Butd predictive models using regression analysis and time series forscusting 4 ioiement clansitcation sigorinims tor customer segmentation and chum peasicton 5. Anply clustering techniques tor machal segmentation and eat decowery Use asscctation rim mining to itantty custorer curcnasng Eaters 7 Anaiyae wt data using naturat languags procrsing and sentiment anatys 8 Communicate analytical tndwgs etactveiy trough repores and pi ventatons UTERATURE 1 \"Business Anaiyics: Dato Anstysis Decinion Maing\" by Atiright and Winston (7th Edition) 2 \"Data iining tor Business Analyte” by Shunvell, Ervoe, acd Patel (ath Enon) 12 Predicts Anaiytcs\" dy Ene Steps! Revises Eston) 4 8 and Pyinon documentation tor data scsericn invaries (pandas, sodi eam, boyversa) COURSE CUTLINE TOPICS: Week 1: nmeton to Bonnans soayut ota pearaton arpa site rahe Wat 34 Geter rterene Sipemwnn tring onl uence wen oy Werk S48 imax gence mutate pense “ote! eomste eee Logie ngertsion, Groen tes. clanetentn sctony heat 218 Chaney eaten soncone, tarhe! cea, See SHAD Aesonanen at ming HOO eke arairan eae 124 Tee sees ayes, Seerantiny tos"
    },
    {
        "image": "courseoutline1_synth_10_aug4.png",
        "label": "courseoutline",
        "ocr_text": "Univer Gottage o' Giliman, Quezon PHILIPPINES: ty of thes Philippines Enginecing COURSE OUTLINE SY. 2024 29; COURSE TITLE Business Anaiytics and Data Minag COURSE CODE BA 501 Course De: toanniquas #9 clustering, a8 soot busin soppert fusiness aecielon making, Emphasis tg paced on practical aap! oatans s SURSE OBJECT 1 Hngetatand ine role of ousiness analytics In eryanizatiowal doesion making lquies to sxplore business data 2. Appiy descrntive statistics and visualization toe 43 Quid predictive models using regression analysis ana tine series forect 4 implement classification aigorithas tar customer sagmectation and churr prediction ing fern discovery Apply eh niques for market segmentation and Use ans customer purchas! ing pattems 2 mining !9 de: timont at tural language provessing ant 7. Anslyes text dts using ors and presenations 8. Communicate anaiytical fncings effectively though LITERATURE Winston (78 Edition \"Business Analytics: Data Analysis Decision Making’ by Aibrigh! 2 Data Mining tex Business Analytica” by Shmuel (ain Ecker 2. \"Predictive Analytics\" by Erie Slogel Pevised Eo! aR ont Python documentation for seranies (panday, sckiHenm, tyverse) COURSE OUTLINEITCPICS: pratpinn, date emperor, ator Sota sys Weel 55: Stet ohemce nyeran lasing, conitance interais ‘leek 64 Linas racresica, mute regression, mos evaluates Was 7: Louis resin, ey week Assccumion sy mining, meet at soy Wee 1 54; Tine naies assy, Seneaelng meters"
    },
    {
        "image": "courseoutline1_synth_10_aug5.png",
        "label": "courseoutline",
        "ocr_text": "University ofhe Pirinpines Comage of Engines fatiman, Quecun ty PHILIF PINES COURSE OUTLINE SY 74s COURSE TITLE Business Anatytes and fata Minny COURSE CODE Descratan Tha course covers 1aDKbea 2 bod exiacty acvonabia insights. Tos nckade CORNER ANE 5 a8 bes recta Sto sneha fo abe Ziyic2 Yoois aN MAchMNGL MS ko Aen On DEKA apricayy us using Tea husnens OB IECT 1 Undderetane ne pia uf buEness at \"Nace 6 oganaatanat eomoN many 2 Abby descintve sunistes ang auansutun techniques te @apione SuEm ss dab re sues aca 5 Bun pradietve mnadais uesy “egresmon an atts ar “g oo stats A emprement c aesiiicator aaguranins toe customer $8770 Apply ciusienng echo guns bar madrat aegmeniager an patere dscavery 6 pe associatsa tule sarang erty customer parcha weg pate 1 heal 3 las Guage processing ans senbrert an row aats unre 2 Cornouiicale araiyeca! Aounas @HOCDYRY TrougA teas ane Bresentat NERATUPL “Rourass Anaiytes Data Anaiyste Gession Mtanng’ by Abagn anit thnston 7: Feator ani fensn “Dota Sheng ty Business Anavics Cy Showa Puce, and Pe 4 Precictve Anaeys ori tented Laer 4 Race Pyton cocumenuton ot data sence lioeares ipa COURSE QUTLINEITOPICS Foes Ar reeves aeSae epee Tone mscates"
    },
    {
        "image": "courseoutline1_synth_1_aug1.png",
        "label": "courseoutline",
        "ocr_text": "Polytechnic University of the Philippines Coleg of Business Administration (Sty Mera Manta PHILIPPINES: COURSE OUTUNE SY. 2025 2028 COURSE TITLE Analytical Chemistry COURSE CODE CHER 401 ‘Coures Deecnnaon: This course covers princes and tachnioues of qushintve and quantlatve cnemicat ananyss. Topics incude taraping meade, saRsRca! keament of dale, gravime ic analyen, volumetric 9. BE RCHCSKO?, Chromealograpny, afd elwctochemecai meinods. Laboratary Component HOMES hands on experience wih anatytca) instrumsns ang techoiques. Empl asis i placed an accuracy, wreension, end quality assurance im chemical analysis, COURSE OBJECTIVES: 1 Apoly siatestcal met ods ip anahy2o and intanwel anaiytical data 2. Pertorm gravimetr aneiys using greapiiston and veiamizaien metats 3. Conduct votumetic Urations motuding scid bate, redox, ond complexorwtic Birations 4 Use spectroscopic techniques inciudeng UV Vis. IR and sinmic absorption spectuscopy 5. Pertorm chromatograpie separations using GC, HPLC, and TL ©. Apaty slecimchamcal methods inchiting polentomety 204 roltnraty 7 plement quaity assurance and quaitty contro! procedures in anarytcx! tatoratories: Trowmethont anery teai maods anc vakdate anaiytca! staceaurus UTERATURE 4 “Ousntiasve Cremical Anaiyeis” by Daniel amis (10th Editon) 2. “Analy cal Chemsety” by Gary Crutsian and Purnendu Dasgupta (7h Editon) 3. Fundamentals of Analytical Chemisty” py Skoog, West, Hoer, arid Crouch (Mtn Editon) 4 Laboratory ninual ang stands operating procedures for anciytcas inetrumects COURSE OUTLINE TOPICS: ‘Won TE Semnestn Us metre Sema. SatetCN Sans ant meen re Ik Sanping maths, nape opaacn, cata echninaes oe $2 Craurnine saben, jecrtee mumoes <atndanent Wee 1 sachet enuiton ranma. pt edewsions Wet 619: ton wens, compasametir Heatom, DTA Peek ND Spstoncume wmircen. Bee Une, LV Spreng Yueh 13 14 Cremetayraphie mushees, CC. ALS, angus fhery"
    },
    {
        "image": "courseoutline1_synth_1_aug2.png",
        "label": "courseoutline",
        "ocr_text": "Polytechnic University of the Philippines Collage of Business Adininistration ‘Sta Mesa, Manda PHILIPPINES: COURSE OUTLINE S Y. 2025 2026 COURSE TILE =: Analytical Chemustry COURSE CODE ‘CHEM 401 Course Description This course covers principles and techniques of auelitadve anc quantitative chemical anatyss Topics include sampling methaas, styistcal teaimsnt of data graviwebic enaiysts, volumente ‘anslysis, spechoscopy, chiomategmphy, and elacwochemical metrads. Laboralory component provides hends on eaperience witn analytical mszumants snd techoiques. Emphasis ts placed on accuracy, prucavion, and quality assurance tn chemical analysis COURSE OBJECTIVES +. Apply statsoca moods to analyze and interpret anatytical cat 2 Pertorm gravimetic analysis using precicilation and volabizaton mattiods 3. Conduct volunipic tations including acid base, redox, and compiexomennc baasons 4. Use spessroscoptc tachmaues including UV Vis 'R, and atomic absorption spectooceny 5, Perform chirornate graphic separations using OC, HPLS, and TLC 6. Anpyy alactocheracsi methods inckuaing potentiometry and voltanmety 7 ienplement quabty assurance and quailty contre! orocestures bi. anatydca) ‘edoratorios 8. Troubleshoot anatysical methods and vatidate anatyicai procedures LITERATURE 1. “Quanttative Chemical Anaiysis\" by Ganiel Hanis (19% Eaton) 2 \"Analytics! Chemisty’ by Sary Ciutetian ang Pumendu Qasqupte (7th Edition) 2. *Fundamentais of Analytical Chemisty” by Skoog, West, Hoiter, an Croucn (St Edition) 4 Laboratory mnanus! and standars operatng proceoures for anaiyteat instnanents COURSE QUTLINEITOPICS: ‘freak 1 bevncanten 10 aatytea cheraty, stsbates, war ans premier eck 34 Sanging meted samete sraparance. <aiiatin chee \\Wieeh 34. Sense ana, piacpater meen, erations fraek 74 Retone maton, vats, pH canes ‘Wek 10 Ave omens, commincamaie Heaton, EOTA sanctoutopis moeness Soars Be UHH srecemeony Wire 13 28: Coramanmrapens masts, OC. HPLC, sepwnaton eer Wet"
    },
    {
        "image": "courseoutline1_synth_1_aug3.png",
        "label": "courseoutline",
        "ocr_text": "Polytechnic University of the Philippines College of Business Administration Sta. Mesa, Manila PHILIPPINES COURSE OUTLINE S Y. 2025 2026 COURSE TITLE Analytical Chemistry COURSE CODE CHEM 401 ‘Course Description: This course covers principles and techniques of qualitatve and quantitate chemical ‘analysis. Topies include sampling methods, statistical teatment of data, gravimetric analysis, volumetic ‘nalysis, spectroscopy, chromatography, and electrochemical methods. Laboratory component provides hands on experience with analytical instuments and techniques. Emphasis is placed on accuracy, precision, and quality assurance in chemical analysis. COURSE OBJECTIVES 1. Apply statistical methods to analyze and interpret analytical data 2. Perform gravimetric analysis using precipitation and volatilization methods 3. Conduct volumetric titrations including acid base, redox, and complexometric trations, 4. Use spectroscopic techniques including UV Vis, IR, and atomic absorption spectroscopy 5 Perform chromatographic separations using GC, HPLC, and TLC 6 Apply electrochemical methods including potentiometry and voltammetry 7 Implement quality assurance and quality control procedures in analytical laboratories 8. Troubleshoot analytical methods and validate analytical procedures LUTERATURE 4 Quantitative Chemical Analysis\" by Daniel Harris (10th Edition) 2 Analytical Chemistry\" by Gary Christian and Pumendu Dasgupta (7th Edition) 3. \"Fundamentals of Analytical Chemistry\" by Skoog, West, Holler, and Crouch (9th Edition) 4. Laboratory manual and standard operating procedures for analytical instruments COURSE OUTLINE TOPICS: Week 1 2: Introdueton to analytieal chemist, stasis, ener and precision ‘Week 24: Samping methods, sample preparation, caibraton techniques Week £6: Gravimetne anaysis, precipitation methods, eateuatons Week 7 8 Acd base equltra, tratens, pH ealcustons Week 6 10: Redox trations, complenometne tratons, EDTA ‘Week 11 12: Spectroscopic methods, Bees law, UV Vis spectroscopy Week 12 14 Chromatographie methads, GC, HPLC, separation thery"
    },
    {
        "image": "courseoutline1_synth_1_aug4.png",
        "label": "courseoutline",
        "ocr_text": "polytechnic University of the Philippines Caliage of Business Administration Sip, Mesa, Mera PHILIPPINES COURSE OUTLINE SY Hi2s 2024 COURSE TITLE COURSE CORE CHEM 401 principles and seein fs, stauetical bealment of aati, Cav! f mathocs. Laborato mss 1S Deserintion: This ovetse nude sempling wet rematogrershy, and 3 inans and IRChwes, rane anatyss iy connnecznt meanes 2g on autUretY, analysis Topics iM ysis, spesieascany. idg on axperiance wih anaivt i, ane asaity 28T3 08 iN CH COURSE GHJECTIVES: _Agpty stastical metho rotanciytical dats s to analyze ane inte voigtization mettods aiysis using precisitalio 2 Pertorm graviinatic af pase, (e 45, condunt votumatie erator maucing 2 and complaxonsetnc trator {Use spackoscopie techniques motuing UWS, FR, 208 atomic abewrition spachorcopy ising GE, HPLC, and TLC 5, Parionn ehromaiographic separations Juggle potentionetsy ane vei syochemical meteods inch weanimiety 6. Appi 7. tnplement suatity |ssura mations yocat laboratories roe abd quality cont! mmocaduures i 2 ana validate anaivtioal procedu @, Troubiesnoot analytes’ LTERATY jet Haris (10th Beton ard Pursancu Dasgupta (7% Edition) 5 Crmach (ih Baitony ysis’ by DS 4 \"Quantiative Chenucat A sry\" by Gary Getstiant 2 “hmatylica: Ch 3. \"Pumnaamentats of Avabvtes nana! and standaed operates Skoog, West, Hol woos fox aratyical instru Chemis” 4. Laboratory ag pence ts AGE, OUTLINESTOPRICS: agoeann, cabernet CO Ws EE Intent sc, anes a pce weak ba: Samay tee, sorte Fe pigs 68: Groves asobsi, sige” cei, sacs ‘soe 7 5: assenans ena Reson ates, co ste, BoA? bo, eae poet 1314: Chromtagagae mertods, 98, NPL"
    },
    {
        "image": "courseoutline1_synth_1_aug5.png",
        "label": "courseoutline",
        "ocr_text": "\"alytechnic University of the Philippines College of Qusiness Administ Sta. Mesa, Manita PHILIPPINES: COURSE CUTLINE BY. 2628 2026 COURSE THLE Analytical Chemisiry COURSE CODE ‘Course Description: This course eoveis principles anu technigues of qualtaeye and quantitative chemical anaiysis, Topics inciude sampling metheds, slateleal featuent af date, graurmemic analysts, vokenetr Soactoscopy. chromategiaphy, and electosnenues! mainods Lacomiary companeM provides hands on experience wiln anaiyiical instruments ahd techniquss, Emphasis is plnosd gn accuracy, Bretision, and quraily assurancs in chennica! analysis, M404 COURSE 08, vES 1 Apply statisticnd inethonss analyze and interpret analy eal gata 2 Pestorm gravimess analysis using precio’ a and voiatileation mots 3. Conurt volum 4. tise spactascopic teciniques i §, Periorm chromatographic sep: ly elechochernicet 208 incliding potentureetry and volizwarnety 7 implement quatity ossursnee aod quatiy convo! procedures in analytical labavatosie: 8. Troubieshout enalytea! motods ard validate an: iytica! praceduios ure |. \"Guantitetive Chemica! Ansiysis’ by Danial Hamris (3bin Beit 2. “Analytical Chemistry’ by Gary Christan and Pumendu Dasgupta (7th Edie “Funriannentais of Analytical Chemisty” hy 90g, West and Grouch (Oth Eatifan) 4. Laboratory nisl and standard onersiing proved Jyticat mains nts COURSE QUTLINEITOPRICS: eek bo: Sanydng metas, amok pepsin, eneston ietriaves Mined B44 Geseimnien anys, ecciaton sath, esetinos Work 7: Aessaase agitiis, eaten, st Seaek 2G; Ruane trans, eoraiexnexeas tests, BOTA Wise 152 Spectencagts melnads Ree’ i, Us sprcbasseny Wiaek (2l4. Ghiomateyracive methods 8G, HELD, napucatn ear"
    },
    {
        "image": "courseoutline1_synth_2_aug1.png",
        "label": "courseoutline",
        "ocr_text": "iversity of the Philippiae Cae of Engineering ian, Quezon Oty PHY IPPINES COURSE OUTLINE SY. pon6 2027 ia Equations GOURSE TU COURSE CODE sand their applications in sofance af equations, LpIaCs ean analytical ana in physics, equato is second ainericat metnods, Studenes wi esr sneering Tovies 4 equations and spaly mein alanis COURSE OBE Yyoe aration of vata 4, Clasaily efierential equabons by order, binges, 2 ance’ ations using {2 gohe hietoxuer difteronta ith constant coer order neat differential equatio® rm techanques te solve initial votve probienns 4 Apply Laplace tre erated lems oftinvar aiferantial equations wang M3! enem ffanstan ons for aferential equations with Bef 6. Use series sotuhans fo mnods guch as Euler s method ara Runge itte raethoos 6b. Mode! reat wortd phenomena using ciasendial equations ei ERA Probie and Boundary Value “Elementary Dif fons with Appucayons and Historical Notes” by Siew 2 Deferental hors’ ay Dents 2th hal equation sevens COURSE OUTLINEITOPICS: roche e atten RUINS ines esters, a6 ace F cheek 0) Mer of sexed som face 1 14 Syst of atten aquatonn"
    },
    {
        "image": "courseoutline1_synth_2_aug2.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippines College of Engineering Diliman, Quezon City PHILIPPINES COURSE OUTLINE S Y. 2026 2027 COURSE TITLE Differential Equations COURSE CODE MATH 401 Course Description: Tis course introduces ordinary ferential equations and thelr appicarons in science contee Kneening Topicsinctude first order dferental equations, second order linear eauabare, Laplace an oe toms of ferenval equations, and numerical methods. Students will leam anal and eal iecnniques for solving diflerental equations and apply them to real worte problems in physics, ‘engineering, and biology. COURSE OBJECTIVES 4. Classity differential equations by order, linearity, and type 2. Solve frstorder diferenial equations using separation of variables, integral equations 43, Solve second order linear differential equations with constant coefficients ‘4. Apply Laplace transform techniques to solve inital value problems 5. Analyze systems of linear differential equations using matrix methods 6. Use series solutions for differential equations with non constant coefficients 7 Apply numerical methods such as Euler s method and Runge Kutta methods 8, Model real world phenomena using differential equattons and interpret solutions Ing factors, and exact LITERATURE, 4 Elementary Diflerential Equations and 2 Diferental Equations with Applications and Historical Notes\" by Simmons (3rd Edition) 3 A First Course in Differential Equations” by Dennis Zill (11th Edition) 4, MATLAB Python documentation for numerical diflerential equation solvers Boundary Value Problems” by Boyce and DiPrima (11th Edition) COURSE OUTLINEITOPICS: Week 1 2: Introdvetion to Sierenta equations, Srecson feds, equrum sohtions Week 34 Festorder sepaatie and near equations, appicatons Week 54: Exact equations, integrating factors, substivion methods Week 7 5: Second order inear equations, characterise equations, amogeneous sohtions Week 6 10: Method of undetermined coefficients. variation of parameters Week 11 12: Laptce transfooms, inverse transforms. siving VPS Week 13 14: Systems of itferentit equations, matix methods, phave plane anys"
    },
    {
        "image": "courseoutline1_synth_2_aug3.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippines College of Engineering Ditiman, Quezon City PHILIPPINES COURSE OUTLINE S Y. 2026 2027 COURSE TITLE Differential Equations COURSE CODE MATH 401 Course Description: This course introduces ordinary differential equations and their applications in science ‘and engineering, Topics include first order differential equations, second order linear equations, Laplace transforms, systems of differential equations, and numerical methods. Students will eam analytical and, ‘numerical techniques for solving differential equations and apply them to real world problems in physics, engineering, and biology. COURSE OBJECTIVES 1. Classify differential equations by order, linearity, and type 2. Solve first order differential equations using separation of variables, integrating factors, and exact, equations 3. Solve second order linear diferential equations with constant coefficients, 4. Apply Laplace transform techniques to solve initial value problems 5. Analyze systems of linear diferential equations using matrix methods 6. Use series solutions for differential equations with non constant coefficients 7. Apply numerical methods such as Euler s method and Runge Kutta methods ‘8. Model real world phenomena using differential equations and interpret solutions LITERATURE 1 Elementary Differential Equations and Boundary Value Problems\" by Boyce and DiPrima (11th Edition) 2 Differential Equations with Applications and Historical Notes* by Simmons (3rd Edition) 3 A First Course in Differential Equations” by Dennis Zill (11th Edition) 4, MATLAB Python documentation for numerical differential equation solvers COURSE OUTLINEITOPIC! Week 12: Introduction o erential equations, rection fis, equiium solitons Week 24: Fist onder separable ad near equations, applications Week 54: Exact equations, integrating factors, substtuton methods Week 7 8: Second order near equations, characteristic equations, homagentous solitons Week 0 0: Method of undetermined coefficients, vation of parameters Week 11 12: Laplace transfoms, inverse transfoms, sting IVP Week 13 14: Systems of ferential equations, marx methods, phase plane analysis"
    },
    {
        "image": "courseoutline1_synth_2_aug4.png",
        "label": "courseoutline",
        "ocr_text": "University ofthe Phitipn Collage of Engine PHILIPPINES COURSE CUTLINE 226 2027 COURSE THLE COURSE CODE Oitferentiat Equations Course Description: n inliuchines ercinaty aitferentiat ie hyStordar avfieve erential og ing. Toles te ‘ations and their appticatons in scence S cder linear equations, Lapiace eeuatios Fd numesica! met its tl lea anaiytica’ and hianvercad techniques for sulving Tents! equations ang apmly them to eaal worid p engineering ane pice» Foblems ie physic S equations dy on ef, linearity, are bye Hereabal squatons using seperaten af va Sh conslant costicienis value ereblem hae systems of tinea crterental an sing matic meted hnon const ical eho Fo method ang Ruy 8 Mode! rsctwor paenomoena Laing git ial equation ERATURE lementary Ditierentat Equations arch joundary © Proplems by Bo 13 DiPama (4 ttn Feiton; Simmans (93 fa ferential Equations with opi ‘ORE nd Histories! Notes\" ion! “A est Course iy Diterent 4Ma 7 Dennis 2H (44th Euiiony LABEymon doe ai equation solvers COURSE OUTLINE TORICS: NO ttre! ugeatcns, tins He Marder saparaba and inate nats, auteatare Era equations, stegnang 18, Suerte menses i 90: Maine of nasternnes oe SHEE STAD Lapsca tanatees, overt sacsioms gtheg ita WH VET Sens of eterantlequssons grate mnt hodh. phase ntane anata"
    },
    {
        "image": "courseoutline1_synth_2_aug5.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippines College of Engineering Diliman, Quezon City PHILIPPINES COURSE OUTLINE S Y. 2026 2027 COURSE TITLE Differential Equations COURSE CODE COURSE OBJECTIVES *-Classity diferential equations by order, lineanty, and type 2 Sole frstorder diferential equations using separation of variables integrating factors, and exact equations 3 Solve second order tinea diferential equations with constant coetcients 4 Apply Laplace transform techniques to solve initial value problems 5 Analyze systems of linear aiferenial equations using matrix methods 6 Use series solutons for aiferental equations with non constant coeficlents 7 Apply numerical metnods such as Euler s method and Runge Kutta methods 8. Model real world phenomena using aiferential equations and interpret solutions LITERATURE \"Y Value Problems” by Boyce and DiPrima (11th Edition) 'storical Notes\" by Simmons (3rd Edition) nis Zill (11th Edition) ‘4 MATLABIPython documentation for numerical diferential equation solvers 2. Differential Equations with Applications and Hi 3 A First Course in Differential Equations\" by Des COURSE OUTLINE TOPICs: ‘Week 12 Invoducton to Herenta equaters. Section fells, equitrum soutons ‘Week 34: Fest orger separable ans ines equations. aopteatons ‘Week 54: Exact equations, integrating factors, substtution methods Week 78: Secor: ina eavatons, cavacteate equatens, homopeneos suitors Week 910; Mathes of undetermines coettcints vanatin of parameters Week 1 12 Laplace varstoms, averse vanstoms, song VPs Nese 1218: Stems of steer equators, mata methods, pase pane ays"
    },
    {
        "image": "courseoutline1_synth_3_aug1.png",
        "label": "courseoutline",
        "ocr_text": "University Agiicuiltu COURSE GUTLINE Sy. COURSE THLE COURSE CODE CHEM 401 ent provides hands on expaiien acy precision, snd quealdy cai methods bal natvtical orm gravimetric analysis using precipitation and tin adel yo! ‘irenon aoid tasy, fedoa, and compisxomeine trations 4. Use 3p) uv: IR, and ator HPI srpiton spestos 8, Perform cnmomatogras 7 implamnay auch (it Instruments"
    },
    {
        "image": "courseoutline1_synth_3_aug2.png",
        "label": "courseoutline",
        "ocr_text": "Cental Philippine University College of Agente sare Bail City PHILIPPINES: CQURSE OUTLINE BY. 2028 2027 COMASE THLE Analytical Chemisiry COURSE CODE CHEM 404 ‘Course Deseriokan: This couse covers orinaoles and techriyuas of quailative anu quanittatve cherweat analysis. Topics inclurle sarspling matnoss, siaistical veaimord af dala, grameirs anaiais, vokumeric ahatess, speceesceny, cromatagrayny, and Sactecheica! melnads. Latoratury congenent provides ‘nants on anpeience wih analyhca! inskumants and tecnnigues. Emphasis i planed en acowacy, recon, ane QUASTY asTANGE oh chemical analyse St OBJECTIVES aoa 2. Anply statistical ewatods We anatyze and interavet an +2 Pertonn gravmetic analysis using precpitaion and volatinalon mamods ie tirwtans 3, Conduct volumeme Rishons ineiuuing acia haee, redex, and coinalex and alors abacention sp 4. Use apectasconic lsenniquas inctuding UVAM 5 Pert shromelngranhic separakens wing GG, HPLO, aad TLE 6. Apely slvcruchanuea! methods inching pavertomaty and voltamenetty ant quatty contro! provediurea in analyte’ validate analvics! procedures iabaratonies 7 plement qualty assur 8, Tewibleshoot anuyitea mathods 3: LUTERA TURE \"Chesttative Chornicat Analysis\" by Daniel farts (06th Eston) Jy\" by Gary Cheistinn une Pamenda Daspupts (7th Bethany so Crouch (Bh Eien) 2 avatyorat OI 43. \"Fundainenia s of Ansiytical Cheraushy ty Skoog, West Heber, 4. Laboratory mamsat and standard operating procsoures Tor anaiyital metranent COURSE GUTLINGITOPICS: es 6 loot te mee ie. inne 4 ping mihats, sare pmearsten, eben estes con eines, eatsiabons oti, sae aad sae eee 9. raveeine cay, rest ann 7 Aeatinane nse, Hrpbans, 9 valet saree uae 1 ne Hee, corgteccots cewetrcceie bbs, Su iw 1 vestae, GC, APLC, sepnttnen #ers Poet 2 oes 11 18 Chroot"
    },
    {
        "image": "courseoutline1_synth_3_aug3.png",
        "label": "courseoutline",
        "ocr_text": "Central Phitippine University COURSE OUTLINE BY. 7026 COURSE THLE SGURSE CODE CHEM 404 aiyticg Course Dasengts analysis Papies Thi shade samwiio hands on expenence wilh an Ad Gualify 355 suse covers prime ethads, stat COURSE OBL apply datsical mplhods ie analyze and interpret a dala n methods 6 Aoly electrochemical ms lonient quay assurance a 4 Laboratory manual and standard op COURSE OUTLINEMTGPICS:"
    },
    {
        "image": "courseoutline1_synth_3_aug4.png",
        "label": "courseoutline",
        "ocr_text": "Contral Philippine University Colege Agrndtst $a10, Hoo OF PHILIPPINES COURSE OUTLINE SY. 2oee2027 COURSE TLE Aratytical Chamistry. COURSE COUE CHEM A0t covers primes and vochniins of quattatos ne ause tists chy matrads, watiohicel Beabeent oF 420s, grawiness ah sponicsie epatoscony, tacmamgraney, aed giscwrochemicat senda. Laboratory componant aaa aperenes wats arivicalioshsrans and ecineguss, BDHASS 3 janes on BUTTS, pradision, und quaity assurance #8 chernital ANaS purse Dagerinton: This saw angiysis. Topica mnctote sere COURSE OBJECTIVES s Aepty stattcet methods lo unalyze and intergretanatyscdt Galt qravinetic ancivus wong oxeciitabon ans velatieation reinods pate, ravine, and comalennmatnc EabOn A, git atgeast DSI DHON PESTER 2. Pent 4. Conauer volumetric tuations inctoting Beet 4. Use spectroscopies wachninues including UY 4. Perorn enramatogeanik separations using GE, HPLE, aad TRE 6. Agply slectrocnemivat metnogs inctunig patentoreny ane wokarmely iat procedures in analytical faborasores asouranc acid nucilty vavdiaie analytical procedure? 7 bnataent quai A. Yraubisehont anatyticat mathiaes a ur ATURE scgsantiatinn Chuemical Analyst” by Ganiat Hains om Editon {anata Chemisty ty Gary Shiai ana Purmndta Basgupte (7 sition} sot anakaicn Cnecteny be bn, Want, Hees, ad Gren (in EAN? ovatieng procaahaes ter anyicat instants tory veamual an sisndard ape we oi smoedattnn te mit ee penis 44: Sensing sete, xample paseo, easton erhnnatt hea $46 Goavemetas 203974, Belk pas i, tates, oH eens reine mete, eats co: fetes Statins, waopmnomreic tts, SOTA sears st: Sparc een, Qa 60, AL V8 20, HPL, saparatin D heer UL14 Chncesatogeniie medhats"
    },
    {
        "image": "courseoutline1_synth_3_aug5.png",
        "label": "courseoutline",
        "ocr_text": "ontral Phfipping Une Coltege of Agicuilure Jara, joie City PHILIPPINES versity COURSE OUTLINE Sy COURSE THLE COURSE CODE CHEN 401 ‘yt. Chemistry ques uf qualiaive and quai Pt of dats, gravimetric analys) foal panier p say! vaigueal data iwakon metnods sae, redox, and complaxometie Mrabons us niques including UVIS AR, WS atomse at crpton si 5 Perform 90, HELO, ans TAC 8 Apply oie methods including sotentometry and vollammetry lanplement euabty assusan es 8. Troubl weal metiuds anc vi LITERATURE ibtatve Cher ai Analysis” by 0. jel Mars itty\" by Gary Chnistan ang Pure men s"
    },
    {
        "image": "courseoutline1_synth_4_aug1.png",
        "label": "courseoutline",
        "ocr_text": "PHILIPEINES COURS: sy. COURSE THLE CGURSE CODE Technical ¥rnag ENG 304 SanDUS teche cal and professional audiences and ethica, caninurs \"Se, Bupese ang content tor technical oacuments 2 Wiie lear cones ols mEoductons, memods, ang 5, and ietters using visual aias serim mesbon are dacumentaty Seiber 13th Eamon munication’ py Rzabeds re aun ans by Darlene Semitn ioe, i300 and Sue Jerterse tats COURSE ou"
    },
    {
        "image": "courseoutline1_synth_4_aug2.png",
        "label": "courseoutline",
        "ocr_text": "Central Philippine University College of Agriculture Jaro, lilo City PHILIPPINES. COURSE OUTLINE S Y. 2024 2025 COURSE TITLE Technical Writing and Communication COURSE CODE ENG 301 Course Description: This course develops students’ technical wnitng and communication skills essential for professional contexts. Topics include technical documentation, business correspondence, proposal writing {technical reports, presentations, and visual communication. Students will eam to write clearly, concisely, ‘and effectively for various technical and professional audiences. Emphasis is placed on audience analysis, document design, and ethical communication COURSE OBJECTIVES 1. Analyze audience, purpose, and context for technical documents 2. Write clear, concise, and well organized technical documents 3, Design effective document layouts using typography, graphics, and visual elements 4. Prepare comprehensive technical reports including abstracts, introductions, methods, and conclusions 5, Write persuasive business proposals and grant applications, 6 Create professional business correspondence including emails, memos, and letters 7 Develop and deliver effective technical presentations using visual aids 8 Apply ethical principles in technical communication and documentation LITERATURE 41. Technical Communication” by Mike Markel and Stuart Selber (13th Edition) 2. \"The Essentials of Technical Communication” by Elizabeth Tebeaux and Sam Dragga (4th Edition) 3. “Technical Writing for Success” by Darlene Smith Worthington and Sue Jefferson (4th Edition) 4, APAand IEEE style guides for technical documentaton COURSE OUTLINE TOPICS: Week 1 2 Introstin to tachnca! communcation ausence anayss. wring process Week 34: Techncal style and esting, curty. conciseness, gamma rene Week 58: Document ces. typography, vita ements, page layout Week 7 8: Technea! cescrotions dafintions, nstructons, procedures Week 6 10: Busewss comespondence. emais, memos, lates, resumes Week 1112: Techneal repens, structure, sectons. documentaton Week 13 14: Proponas, rant wetng. persuasive technaves"
    },
    {
        "image": "courseoutline1_synth_4_aug3.png",
        "label": "courseoutline",
        "ocr_text": "Cental Phitippine Univ date, Holle City PREIPPINES COURSE CUTLINE SM. 2026- COURSE TITLE Technical Writing COURSE CODE ENG 207 Course De: professinna« twehnical ape anil effectively for various techeucal et acument nuricatnn stiis esental fe Nation, business corraspanderios, nraoe ust coaimisnication Skvgante wit leain ts wiite Geaity, cont nd profesional audiences. Emphasis is p lyn. und ethical communicauen SURSE OBS Ty 4 Ansiy26 audienioe, nurpose, ad context tor techn eocumants 7. Wile ctear, concive, anes wet igavinee teennicat soouawnis 3. Design effective de umant layouts uring typography, aianbios, and visual semente 4. Prepare comprenenst technical renoits inciuding abstracts, introauections, methods, and conelush 5. White persuasive business pmposats and grant ap fications 6. Creaie orofesstonal tus 38 comeanondance including emails, memos, and tetors 7. Deveion and seiner affect Keehnicsi presentations using visual aids 2. Apaty ethical pancipies i technica: cenaunication nd docummactation 4. “Tectinieal Co munication y Mike Markel and Stuart seiner (13 tien) 2. \"The Eesantars, nt Dagga Cth Eeiion) ungton ana 8 nleai documentation vetersan (Sh Edition) 4 AP Aang e style aviges for RSE GUTLINEITOPICS. Week 12 iacahetn ‘Se commiscaton. tiene ani, watig genoeas Week 30: Yeates ste ace acting. city, conlneness. game seine sek GS: Dosurecs sovign, trowgrae, waka womends, kage layect, Wasi 78 Teomees Storm, Suet esractone, secatcus aT, manos, tes. sues Wook 3652 Tactical pais, ene, ntans, aoimimtaton eek t ce aon, ga"
    },
    {
        "image": "courseoutline1_synth_4_aug4.png",
        "label": "courseoutline",
        "ocr_text": "HBbIRE Universiay 8 oF Agron PO. Raita ity PHILIPPINES. GOURSE OUTLINE BY 2a28 SOURSE THLE Redcal Weiting are Communica COURSE cong Q ENG 30 Course Descnston, Thy Bratesstona: contoxs ehinical rencets, pre id Blleckively top varie, document Aeveleps students ecswice! wang ang elite lechnvcat acamantaton DustneSs ooMtesponcance aical stat Sommmurncapee, Shisems on ein to wr Oia ans pa ences, Emphasis isp Communicat MINCBROP Skilg ecsen tat toy OBS writs ia cleatiy. concisely, 8 on Budiance an fessional au Cesar, ang em, O88, att contest for teenanat ap Comyn ate ORY, GaBhCr, and visual somante 4. Prepare ey ‘$ abstaets, ntoguenons 5. Me perstasive pein IS 209 many appl 1898 rons metowts, ane Leatans USES ConspoRsence meting spiny 990 deter atteetivg Apaty ettue 8, and Je. Si VSUAI ais ION and cies tect ai preseniatons aI Brcsps i te nical communicas naka, MUNCRHON by ake Marc sng Stet Saiger eH8 0 Veena Commrscaban” ay Heabeti Foheaue ang nical iing txt Su SAN Simi APPR 20 REE Sie goten wo wciminay curmentation 63% Eaton; ICCaSS By D. Sam Bagge va th Ean) COURSE oy TUNETOPICS. MATES Peas, Bano, sisinggtinns"
    },
    {
        "image": "courseoutline1_synth_4_aug5.png",
        "label": "courseoutline",
        "ocr_text": "Gontrai Phitippine University Collage of Agiloutiure claro, foto Sty PSLIPPINES COURSE OUTLINE S Y. 2024 2 Technical Writing and Comesunicahon COURSE THLE COURSE CODE: ENG 304 ops shaders technical wong anc conmneavosien otis seri ronan, istiness carsanchaan ee, Propose! welg, ‘Saaenis wit ions to waite dearly, counciaety, ‘ihasia is planes oP aueence BBS, ton: This course devel sis. Tonks inches technica: sacam vaibnes, ard au COMETS ‘nd profession’ audience. 6 Course Besint prnfepeional conte Yaciinlcas repens, NET aad atigchvely or eauaus wchatea! ocumant design, and stnice! camminicalion, COURSE CBAECTIVES Ananya aintionce, purrase, an6 cankaxt tor eechsist socunents 2. Wile clear, concize, god wetraxpaninad worncscal tonnes cegrepiny graphic, andi visual olarak: inbontucnons, snelnoste, seid conmelzians sign efioctive dorama tayanss woe siprebwnive wedatiet meOnS pusingss groposats and grant apeticadons sorranponaqnice ‘aching aes, 4, Prepare oo 5. ite persmasive 6, Coemis pratessia 7 Develop and deliver atuctve iecinices presen\" 2, ngply strical puincigtes txrnical camemanicalon and documentation ing absbracts, st Dusinags o mersios, and errs ao using visu! alts LITERATURE 4 Technical Communication’ by BRE: 7 Tne Esveniiats Tecnica! Corsmunication’ cess by Dariene S Ntarkal aned Shvart Setter (13% Eaitton) icabeds Yoteaun ant Sve! seaanptrangon and Save gaterson (ati diaant ragga (4h Ecition} 4. \"Tecnnlea! wirting for she guides for iatnnica! dreunnentaaae 4, ABA ang IEEE COURSE QUTLINEITOPICS: reek 1 nce oti one on, boten sos, STARTS “aon 4 Tess oe a iin, eae, SERSBEMAS AIR ren 54: Douce Sep aR ET. eins, aes, aN re Teoma semen enn 49, Bc comangetsas, OTH, AEH, EY HET as mets, muss, Se vss ‘ycagh 187: Toate"
    },
    {
        "image": "courseoutline1_synth_5_aug1.png",
        "label": "courseoutline",
        "ocr_text": "University of San Cartes, Cabu City, Cats PHILIPPINES COURSE OUTLINE: Sy. COURSE TILE Oitierentad Equations COURSE CODE MATH 20% Course Description: This scourge intieduews orcinary diiorentat aquatons and theit anctications tp veiwnce and engineering. Topics include frstordar ditferenta! eau 8a equabies, Laplace anions, sysinnt: of diferentiai aguatins, and cumurcal maieds. Sidents wit iaara analytical and umeitcal iechmigues for solving Siferentai equations and apply tem to real warel probes phvalcs, epinaerlng, and Biology. OURSE CHIECTIVES +, Clamely Serantial squations by oeder, tneatty, and tyre 2 Salve fr equations 2 Solve second order iineai clierznsat equations with constant coatictents j arage aiterantio! equblons ising seperation of variebins, integrating factors, and exact 4. Apply Lapiann transtonn techoigues ts 2otee initia! wate problenss, g makin methods shar contests 6 Beauzy sistem oftnea: eterenta equnanns uh ar sitherentia ovations wit ee series setations Apoly numerical enethods such ax Eulore method and Rurge Rutta methods 8, Model real world phenomena wsing shiferentia! equations and inigmant gohitions RATURE 14. \"Eismentary Ditixential Equatons ant Soundary ahaa Probies” by Beir “Oitierentat storiont Notes” by Senmone (ic Eko} 3 7R First Couran i Dittoventiat Equations’ iy Dennis 4 MATLAB Pion documonlation tor numerics digrantal equation selves no Sirona (4 te Ete) joations eth Apphoatens af «41h Eaitiand COURSE OUTLINETOPICE: ‘ras tmeeteton ss CBee ean, nts al, ean aeons ‘Yooh 2 4 Peron sera ae Sster emake ery taney. seston es ‘wiwk BE: art omens, 28 Wee 78 Guages ances fine wesabion, shea matte, Sommyunetas NS ‘snes 16: Mato! of undetnoingd oatiiets, yaa of pened 12, Lat ioeh 12 04 Mysto of aa Sea nator, eee anata, ing VPS Week neta, phase ane ays"
    },
    {
        "image": "courseoutline1_synth_5_aug2.png",
        "label": "courseoutline",
        "ocr_text": "University of San Carlos Schoo! of Enginaering Cebu lly, Zane PRILIPPINES COURSE OUTLINE SY. 2026 cour Difterentiot COURSE CODE: MATH 401 Course Description. and enginsening. Topics ransfonn nbreduoes o sie trst ordar didsentai equat eins af diferente! equations, ans numeseal methods, igus fot solving aiforenital equations an apply them to me piace sal ang omy in physics, earn anatyic “ord pi CQURSE OBJECTIVES Giferentios uations hy onder, ineanty, and tyne 2. Solve trstonier dite enuations austin Laing Seperation of variahies, integrating factors, and exact 3. Solve eseor seoraer naar rentist exuators, stant es eis 4. Apply Lagi 5 Analy ransform jecholgwes to oolve iniial yale problem systems offinear di jing matrix niatoods 5. Use wanes a edifterential equations with non conslant cosficen s 7. Appiy auniay nisthoos suri as Eviers way aed Runge Kutta methods 8 Motiel cea woria onenonicna using diflerential euuations and mtequel seiutians LITERATURE \"Gremeniary Di 2. Diltovental as cena Eau ‘ary Value Problems\" oy Bo sors with Appiicatios Difereetat nd Historical Notes” by Sienna 3 A Fits! Course 4 MATA cons\" by Dennis Zit (41th Ea documentation fer numens in entiel equation solvers CGURSE OUTLINEITOPICS: Wes acetal iene’ watson, scion this, sedrkaysokciont ‘Henk 34. Fender sapansie and ress agsshors, cesbcaies Week 66 cl eins, iegrang Ster, sitesi meters Hoes 72. Seconds fous esha, chats etn nomigereska tahtone 939 Mates of araeernied Wick £142 Lata os, mate madinds, shane lane alee"
    },
    {
        "image": "courseoutline1_synth_5_aug3.png",
        "label": "courseoutline",
        "ocr_text": "University of San Carlos School of Engineering Cebu City, Cebu PHILIPPINES COURSE OUTLINE S Y. 2024 2025 COURSE TITLE COURSE CODE COURSE OBJECTIVES 1. Classity diferental equations by order, inearty, and type 2. Solve first order diferential equations using separation Of variables, integrating factors, and exact equations 3. Solve second order linear diferential equations with constant coefficients: 4 Apply Laplace transform techniques to solve inital value problems 5 Analyze systoms of linear diferenial equations using matrix ‘methods Week 94: Festoréer separate and inea equations, apleatons Week 58: Exact equton etegratingtacton, ststiten methods Week 7-: Second ender inear equations,"
    },
    {
        "image": "courseoutline1_synth_5_aug4.png",
        "label": "courseoutline",
        "ocr_text": "University of San Caries School of Engineering Cebu city. Cebu PHILIPPINES COURSE OUTLING SY. 202 S COURSE TITLE Differential Equations COURSE CODE MATH 404 Course Description: This course sitodioss ortinary diferential equations and thelr applications ardi enoinaering, Topics ineiuts frst tanstorms, eyatems of citterentiat ea; for saiving ditferentai equaturs and agpiy engineering, and piology COURSE GBIECTIVES: 4. Ciaastly ditferanial eq afters ay order nearly, and hype 2. Solve frstorcar using senaration of va: equatic rental equation and exact 3. Solve secont mter inear aifiarential ov ans with constani ficients 4. Apply Laplace vanstorm te niques te solve initial value probiems 5 Analyze westerns of a ditfereniat equations using mabie eatads 8. Use snes soltitons for diforential equations with nen constantevatficiants 7. Apuly numerical methods such as Euler s method an Runge Kulta 8 Modal real world pnenomeng using differenital equations and imerpret soiulions NTERATURE 4. Elemantary Differential 2Ditte uations and tions with Appia indary Value: Problems” ky Bayes and Dievina (Mth Easton) ne and Historical Noles” by Gimmes Card Saitions Mig! Rquations\" by Dennis 2 (14th Eaton) 4. MATLABIPyinen documentation for numerical difterental ea) COURSE OUTLINEMOPICS: tens £8 oct to aera equations, doesn tas, wyatt soksene Weak Sok: Firct ater separate Sen equations, epotuatone equations. iageaing aston, seth methods Week 72: 5 et Osea eqices, charactetst eqvaiens temogaraves 2 ‘Wet Bt Sth of evacerencaa cattniets. vahatn of mennetios Week 184 Laponsetansftems, vee wanton, song {Va Wass ‘Syste oF cera mento, sete bec. phase pace ens"
    },
    {
        "image": "courseoutline1_synth_5_aug5.png",
        "label": "courseoutline",
        "ocr_text": "University of San Carlos ‘School of Engineering Cebu City, Cebu PHILIPPINES COURSE OUTLINE S Y. 2024 2025 COURSE TITLE Differential Equations COURSE CODE MATH 401 ‘Course Description: This course introduces ordinary diflerental equations and their applications in science ‘and engineering. Topics include first order differential equatons, second order linear equations, Laplace transtorms, systems of diflerental equatons, and numerical methods. Students will eam analytcal and ‘numerical techniques for solving diflerental equations and apply them to real world problems in physics, engineering, and biology. COURSE OBJECTIVES 1. Classify difterental equatons by order, linearity, and type 2 Solve first order diflerental equations using separaton of variables, integrating factors, and exact ‘equations 3. Solve second order linear diflerental equatons with constant coeficients 4. Apply Laplace transform techniques to solve inital value problems, 5. Analyze systems of linear diflerential equatons using matrix methods 6. Use series solutons for aiflerental equations with non constant coefficients, 7. Apply numerical methods such as Euler s method and Runge Kutta methods. ‘8. Model real world phenomena using diflerental equatons and interpret solutions UTERATURE 1. \"Elementary Differential Equations and Boundary Value Problems” by Boyce and DiPrima (111th Edition) 2 Diflerental Equations with Applications and Historical Notes” by Simmons (3rd Editon) 3 A First Course in Diferental Equatons” by Dennis Zill (11th Editon) 4, MATLAB Python documentation for numerical diflerential equation solvers COURSE OUTLINE TOPICS: Week 122 inowavcton to sterol equaters. Grecton tics equine setters Week 3 4 Ft oner separate an inear equations, appleatons Wee $2 Exact equtons rtayatng actos suenttuton methods Week 7 Seconc onsrinaw equations, charactente equations, homageneaus tokens Wa 6 10 Mero of mamamnned coettowts varaton of parameters \\Weet 11 12: Laptce tanstoms, inverse transforms, sciving VPs ‘Week 1214 Systems of sttererta! equations natu metnoss, phase pane ays"
    },
    {
        "image": "courseoutline1_synth_6_aug1.png",
        "label": "courseoutline",
        "ocr_text": "Mindanao State University College of Education Marawi City, Lanao del Sur PHILIPPINES COURSE OUTLINE S Y. 2024 2025 COURSE TITLE Analytical Chemistry, COURSE CODE CHEM 401 Course Description: This course covers principles and techniques of qualitative and quantitative chemical analysis. Topics include sampling methods, statistical treatment of data, gravimetric analysis, volumetric analysis, spectroscopy, chromatography, and electrochemical methods. Laboratory component provides hands on experience with analytical instruments and techniques. Emphasis is placed on accuracy, precision, and quality assurance in chemical analysis, COURSE OBJECTIVES 1. Apply statistical methods to analyze and interpret analytical data 2. Perform gravimetric analysis using precipitation and volatilization methods 3. Conduct volumetric titrations including acid base, redox, and complexometric titrations 4. Use spectroscopic techniques including UV Vis, IR, and atomic absorption spectroscopy 5. Perform chromatographic separations using GC, HPLC, and TLC 6. Apply electrochemical methods including potentiometry and voltammetry 7. Implement quality assurance and quality control procedures in analytical laboratories 8, Troubleshoot analytical methods and validate analytical procedures LITERATURE. 1 Quantitative Chemical Analysis\" by Danie! Harris (10th Edition) 2 Analytical Chemistry’ by Gary Christian and Purnendu Dasgupta (7th Euition) 3. \"Fundamentals of Analytical Chemistry” by Skoog, West, Holler, and Crouch (Sth Edition) 4. Laboratory manual and standard operating procedures for analytical instruments COURSE OUTLINE TOPICS: ‘Week 1 2 ntrodseton to anaytial chemistry, statistics, ers and precision Week 34: Samping methods sample preparation, caibration techniques Week 54: Gravimetric anayss, precipitation methods, caleuations Week 7 8: Acid base equi. titrations, pH eleuatons Week 610: Redox trations, complexometie trations, EDTA Week 11 12: Spectroscopic methods, Beers lav, UV Vis spectroscopy Week 13 14: Chromatographic methods, GC, HPLC, separation theory"
    },
    {
        "image": "courseoutline1_synth_6_aug2.png",
        "label": "courseoutline",
        "ocr_text": "Aindanac Stal Jriversity College of Educatio Maral Oity, Lanag cei Sur PHILIP EAN COURSE OUTLINE COURSE THLE COURSE Cam ripiion’ This course cavers icles an statistics matogeapay. and el Panithticas ins aloe amncal serie in URSE OBJEC TES Ap stical meth anatylicat da OTE gravimmett Siatibzauon methods 3 Conduct ‘bie trations ing 9 Gi DaSe, tar3n ans complexometric tr 4 Use spectrascenic te mie absorption saeco: 5. Peston chromatograpnic se; bly electiochemtical methods in ing potentiomey ah contro! proceduigs in analytical ‘ad validate analytical pe Shemustry” by “ion tals oF Anatytic: ‘81, ani Crouen 19th Eaition} 4 Laboratory manual nel ical instrarnents COURSE OUTLINENTOPICS:"
    },
    {
        "image": "courseoutline1_synth_6_aug3.png",
        "label": "courseoutline",
        "ocr_text": "Mindanao State University College of Education ‘Marawi City, Lanao del Sur PHILIPPINES COURSE OUTLINE S Y. 2024 2025 COURSE TITLE Analytical Chemistry COURSE CODE CHEM 401 Course Description: This course covers principles and techniques of qualitative and quantitative chemical analysis. Topics include sampling methods, statistical treatment of data, gravimetric analysis, volumetric analysis, spectroscopy, chromatography, and electrochemical methods. Laboratory component provides hands on experience with analytical instruments and techniques. Emphasis is placed on accuracy, precision, and quality assurance in chemical analysis. COURSE OBJECTIVES 1. Apply statistical methods to analyze and interpret analytical data 2. Perform gravimetric analysis using precipitation and volatilization methods 3. Conduct volumetric titrations including acid base, redox, and complexometric titrations 4. Use spectroscopic techniques including UV Vis, IR, and atomic absorption spectroscopy 5. Perform chromatographic separations using GC, HPLC, and TLC. 6. Apply electrochemical methods including potentiometry and voltammetry 7. Implement quality assurance and quality control procedures in analytical laboratories 8. Troubleshoot analytical methods and validate analytical procedures LITERATURE 4 Quantitative Chemical Analysis” by Daniel Harris (10th Edition) 2. \"Analytical Chemistry” by Gary Christian and Pumendu Dasgupta (7th Edition) 3. \"Fundamentals of Analytical Chemistry\" by Skoog, West, Holler, and Crouch (9th Edition) 4, Laboratory manual and standard operating procedures for analytical instruments COURSE OUTLINE TOPICS: Week 12: Introduction to analytical chemist, statsies, ors and precision Week 24: Samping methods, sample preparation, caftatontechiques Week 54: Gravimetric anaysis, precipitation methods, ealeations Week 7 5: Acbase equa, trations, pH ealetatons Week 610: Redox trations, complexometic trations, EDTA Week 11 12 Spectroscopic methods, Bers law, UV Vis spectroscopy Week 12 14: Chromatographie methods, GC, HPLC, separation theory"
    },
    {
        "image": "courseoutline1_synth_6_aug4.png",
        "label": "courseoutline",
        "ocr_text": "Mindanao State Univar: fara Ory, Lana del Sex PRILIOP INE: of Education COURSE OUTLINE SY. 2022 2025 COURSE THLE COURSE CODE ical Chemis: Moy SOE bilnciptes ang tecrmisues of matitagy 2 Sairating meloods, satshcal weatmentot dees msiograiy, a9 slactrn once With anaiyical insiniments and lect mica anauyis Gnd evantistive cme, Hottie analysis, yolusmetie Sompsnani provides hands on expe Precsion ang 65. EmpNasiS is plac ually assurance in che COURSE OBJECTIVES Auply stuns 2 Peston teal methods fp anay i ghiavimeteie anal 7 and volatiizaion motos including acid base. Compiexomettic tations, *S ICING LAVVi8, IR, snd atornic absorption sorevose: 5B on crromatugrapiti 6. Apnty an “ay paraien HY GO, HELC ang Tee chemicat OSS tainting cote mary anc DEEN re oliatnwiatyy 7 implement quaity susurance and qu ites! utes in analyticas aboratariog at an matnod: 290 vatiaate anatytic UTERATURE 4. “Quantistive o} cat Analysis\" by Gan 2 Rtalipice! Chemistry Hy Gary Ch 07 Anutyticat Chay Istin and Purnensiy Dasgupta in Eni BY BRO], West, Molter a Nndamantay if Crouch 120% Euiton) ratory oe anal an ston oper 19 pine SOF Anlst instumenie COURSE OUTLINE: Topics Yet i statantne to ana cham 3 MaLUELS eons ae ree Wee 94 Nees 7: Aeistate agus 1 Wee 40. Redon certens Wowk 12 Soactonses meted, due NENTS Cremstoaugte netuts, £6. 10, sepution ey"
    },
    {
        "image": "courseoutline1_synth_6_aug5.png",
        "label": "courseoutline",
        "ocr_text": "Mindanao State University College of Education Maram City Lanao del Sur PHILIPPINES COURSE OUTLINE SY. 2024 2025 COURSE TITLE Analytical Chemistry, COURSE CODE CHEM 401 Course Description This course covers principles and techniques of qualitabve and quanttatve chemical analysis Topics include sampling methods, statstical veatment of data gravimetic analysis. volumetic analysis spectoscopy chromatography, and electrochemical methods Laboratory component provides hands on expenence with analytcal instruments ang techniques Emphasis is placed on accuracy Drecision. and quality assurance in chemucal analysis, COURSE OBJECTIVES. 1 Aopiy stabstcal memods to analyze ang interpret anaiytcal data 2 Pertorm granmetnc analysis using precipitation and volablizaton methods 3 Conduct volumetnc ttrabons including acid base, redox and complexometnc trations 4 Use spectroscopic techmaues including UV Vis IR and atomuc absorpton spectroscopy 5. Pertorm chromatographic Separatons using GC. MPLC. and TLC 6 Apply electrochemical metods including potentometry and voltammetry 7 implement quality assurance ang quality contol procedures in analybcal laboratories 8 Troubleshoot analytical metnods and validate analytcal procedures LITERATURE 1 \"Quanbtabve Chemical Analysis* by Danie! Harns (10% Eaiton) 2 “Analybcal Chemistry\" by Gary Chisban and Purnendu Dasgupta (7m Eaiton) 3 “Fundamentals of Analytical Chemistry’ by Skoog, West Holler and Crouch (9th Editon) 4 Laboratory manual and standard operatng procedures for analyteal instuments COURSE OUTLINE TOPICS: Nee 34 Samoing mecoy samoe prcwator cmerwter ectngues Nee 54 Ganmerre mayan pacptaton metros cacuaters Nees 4 Aes ane wast Meee 03 Seectonsene memory Baw 8 oe UL spectoacony Nees 1214 Crromaogacne mamact OC HPLC secwater tery"
    },
    {
        "image": "courseoutline1_synth_7_aug1.png",
        "label": "courseoutline",
        "ocr_text": "Mindanao State University College of Education Marawi City, Lanao del Sur PHILIPPINES COURSE OUTLINE S Y. 2026 2027 COURSE TITLE Database Management Systems COURSE CODE CS 301 Course Description: This course provides comprehensive study of database concepts, design, implementation, and management. Topics include data models, entity relationship modeling, relational database design, normalization, SAL programming, transaction management, concurrency control, and database security, Students will gain hands on experience in designing and implementing databases using moder database management systems, COURSE OBJECTIVES 1. Understand fundamental database concepts including data models, schemas, and instances 2. Design databases using entty relationship modeling and relational database design principles 3. Apply normalization techniques to eliminate data redundancy and ensure data integrity 4. Write complex SQL queries for data manipulation and retrieval 5. Implement transactions with proper concurrency control and recovery mechanisms 6. Design and optimize database performance through indexing and query optimization 7- implement database security measures including user authentication and access contol 8. Develop database applications using programming interfaces and frameworks LITERATURE 1 Database System Concepts” by Silberschatz, Korth, and Sudarshan (7th Edition) 2. Fundamentals of Database Systems\" by Elmasri and Navathe (7th Edition) 3 Database Management Systems” by Ramakrishnan and Gehrke (3rd Edition) 4. Online resources: PostgreSQL documentation, MySQL tutorials, Oracle learning materials. COURSE OUTLINEITOPICS: ‘Week 12: Intogveton to aatabass, data models, database architecture ‘Week 24: Ertty Rlaonship modeing, ER saprams, design sencnes Week 5 Relational model reatonal algebra. SOL fundamentals Week 7: Asvances SQL, jos, subqueries, viens sored pocaakces ‘Week 910: Nematzation theory. funcional dependencies, noma foes Week 11 12; Transaction management ACID proparies concurency conta! ‘Week 12 14: Database secury, backup and recovery, perfomance tuning"
    },
    {
        "image": "courseoutline1_synth_7_aug2.png",
        "label": "courseoutline",
        "ocr_text": "Mindunae State University Eahiage of Education PHILIPRIRES COURSE OUTLINE SY. 2028 2027 COURSE TITLE Database Management Systems COURSE CODE: C8401 ‘Source Disscription: This onuree pouiaes comprenonsive st nplementaton, and management, Topics insude data tn a1 st database design, nommatizaion, SAL preyrennmring, ta agement, concurrency consol, amd database serunty. Shatanis wil gain hands on experience ts Cesgning at mutiem galebase management systens. oftiatabase concepts, design, COURSE OBJECTIVES 1s derstand tundames database concay achoding dats models, schemes, an 2 Design datebases usinis enhiy relatianshia modeling a nal database design principles 3. Apnny normalization t chniguets to eliminate date reduncancy ane ensure oaia integniy Bombiex SOL quer 8 far data manipulation and resi 5. tnglement transactions very mechanisms 6 Design and optins arormance ig and query optin ation suthentcation and access curticl Develss datst ions using prayramming interfaces ane sreHoTkS, LITERATURE 1. “Ditahase System Concepis\" by Sifberschate, Kun hana Sudarshan (7th Baio} 2. Fundlatnoniais of Oaiaoase Systeme” by Eimasri and Navathe (744 Editon) 3. Datstase Management Systeins” by Ramakiiutnan and Gehtke (r 4 00 Esition} ree: PasgieSGL document 108, My SOI. tularist Gracie teaming materiais COURSE GUTLINEITOPICS. Wet 2 inc faeaiobacee a mete, dates setae nee ot Entity Sataionsnn madaog FR cerame, Sega ies Weer Be Hations mot sina gra 8, tao Ds, BARRUErES, lent, estes oceans Ya $20: Nowa thay, futons Sepandanie, pcm fons Wek Vile: fremaastion marayemens, 01D srpetties wosewresny ect ty. Bachna reer, smvkamnen 9"
    },
    {
        "image": "courseoutline1_synth_7_aug3.png",
        "label": "courseoutline",
        "ocr_text": "Mindanao State University College of Education Marawi City, Lanao del Sur PHILIPPINES COURSE OUTLINE S Y. 2026 2027 COURSE TITLE Database Management Systems COURSE CODE Cs 301 Course Description: This course provides comprehensive study of database concepts, design, implementation, and management. Topics include data models, entity relationship modeling, relational database design, normalization, SQL programming, transaction management, concurrency control, and database security. Students will gain hands on experience in designing and implementing databases using modem database management systems. COURSE OBJECTIVES 4. Understand fundamental database concepts including data models, schemas, and instances 2. Design databases using entity relationship modeling and relational database design principles 3. Apply normalization techniques to eliminate data redundancy and ensure data integrity 4. Write complex SQL queries for data manipulation and retrieval 5. Implement transactions with proper concurrency control and recovery mechanisms 6. Design and optimize database performance through indexing and query optimization 7. implement database security measures including user authentication and access control 8. Develop database applications using programming interfaces and frameworks LITERATURE 4 Database System Concepts\" by Silberschatz, Korth, and Sudarshan (7th Edition) 2. \"Fundamentals of Database Systems” by Elmasri and Navathe (7th Edition) 3, \"Database Management Systems” by Ramakrishnan and Gehrke (3rd Edition) 4, Online resources: PostgreSQL documentation, MySQL tutorials, Oracie learning materials COURSE OUTLINEITOPIC: Week 1 2 Inroduetion to databases, data models, database achtectre Week 3 4 Entty Reationship modeling, ER diagrams, design pincipes Week 56; Relatonal model, relational algebra, SOL fundamentals Week 7 8: Advanced SOL, joins, subqueries, views, stored prosedies Vieek 8 10: Nomaizaton theory, functional dependencies, nama forms Week 11 12: Transaction management, ACID properties, concurrency contol Week 13 14: Database secunty, backup and recovery, perfomance ting"
    },
    {
        "image": "courseoutline1_synth_7_aug4.png",
        "label": "courseoutline",
        "ocr_text": "Mindanao State University College of Education ‘Marawi City, Lanao de! Sur PHILIPPINES COURSE OUTLINE S Y. 2026 2027 COURSE TITLE Database Management Systems COURSE CODE cs301 COURSE OBJECTIVES 41. Understand fundamental database concepts including data models, schemas, and instances 2. Design databases using entty relatonship modeling and relatonal database design principles 3. Apply normalization techniques to eliminate data redundancy and ensure data integnty 4. Write complex SQL queries for data manipulation and retieval 5. implement transactions with proper concurrency control and recovery mechanisms 6. Design and optimize database performance through indexing and query optimization 7. Implement database security measures including user authentication and access contol 8. Develop database applications using programming interfaces and frameworks LITERATURE 4 Database System Concepts” by Siberschatz, Korth, and Sudarshan (71h Editon) 2. \"Fundamentals of Database Systems” by Elmasri and Navathe (7th Edition) 3. \"Database Management Systems” by Ramakrishnan and Gehrke (3rd Editon) 4. Online resources: PostgreSQL documentation, MySQL tutorials, Oracle learning materials COURSE OUTLINE TOPICS: Wee 12 noetucton to aaabane, data mode, database aehteche Wee 34: Ent Raatonsing modeling, ER Sagem. Senn pres Wee $4: Reena made iatons agen, SO fenamentas Week 74: Agreed SOL js, subqusen. vows stored process Week 6 10: Nomatzaton tory Nnction! Gependencas, normal fom Wee 11 12 Trrsacton managemest ACIO operas conmareney const ‘Wet 13 4 Dabo secrty bochup an recovery, paremmance Nang"
    },
    {
        "image": "courseoutline1_synth_7_aug5.png",
        "label": "courseoutline",
        "ocr_text": "Mindana Stale University College of Education Marae: City, Lanao dei Sur PHILIPPINES COURSE 0! COURSE THLE Databa COURSE COOE cs3 Management $: Course D: ng, ieiatonsi tee and gaan; nty Stuenis wil! gaan 5 OBs ant anstances Unaerstans tunsar ding gata miosis, Josige atin 2 Design dat g any relationshie modeling apd velstonal 3 Apply earmalicaton techevgles io alimnate data redundancy and ensure dat Write comples SCL. queries for data maingulaion and retneval gh indexing and query eplimzatian WTERATURE \"Database System Concepis” by Siberschaig, Korth, and Sudarsi 2 Fundamentals of 2 ns\" by Eimiasil any Navas (Tih Edition) 3 Database Management S ny Ramanrishnan anc Genrke (3rd 408 HySOL tutorials. CF toa sources, FasiyieSai voours COURSE OUTLINEMORICS"
    },
    {
        "image": "courseoutline1_synth_8_aug1.png",
        "label": "courseoutline",
        "ocr_text": "university of ihe Pht pes: college of Engines PruLIPRNes OURSE GUTLINE SY. 7026085 Business Analytics ao Data Mista COURSE WE qourse CODE BASGT cura feossiption: ris CORTES sianeteat and commen ethos tor saivzin UN Sad extracts srsnente Oe eA dowcrere 02070, NETS sendaiing, as are feng, #30 HORS TAB. OA rani, ceusers well ioe analytics 2 Seppo taainnge TRISTAN tenga ts lao rcabons van asasets eaten ug aed ecnicues agg at Eos EQTVES COURSE OB! oftbusinmss antes #9 5. Understand ne noe pee wate erganizalena! cecision 1a03 pouaitzation secnnigued to CBSE pusinass datz ansiysis ana ins sans 1 eCHS NF and cram graticton 2. apply Sete 3. Bud predic 4 motement aessiication 2907S Apply ctateng ecnigues FAVELA fsa agsccation rae moring 20a customer puch asid asetyes tonata wsing naturel AGUA nh Brn ebictvety BOUG TOP 2 madtein using s2res8On jor qustorner segment ai pater discovery pases, ibrar anaes sg gipeeseing and ay 3 preset 8. Coramusicate aa gn (7a Eaton LITERATURE 4 Seeamesn Aralytice a. Deaelon Waking’ ny ABATE SNE fats Analy meas analyies oy ShmaaH, Bes, wwe Pet iain Belton sy Ene Sagat (Revised Eston? sox data sian ocaion cpandns, SCHIERT: pepaere? 2. “Trate Mining fos Be 3. Freaictve Anaivtcs 4. Rend Python documenston CORIRSE OUTLINETOPICS: enn sons args, WM ADEA, SEIT pana 4, Seni are pS AED. yen $46: ane ses baton ES sempre, Snean ea, eae 1 Lg sents EH. ES poomeiation we wing, whe wath! ya gene 13. Tae sin enti, tase TEN Kee O16 econ Cte weve"
    },
    {
        "image": "courseoutline1_synth_8_aug2.png",
        "label": "courseoutline",
        "ocr_text": "COURSE THLE COURSE CODE and computational ig, Studente will fear to use anaiit don Lapotications us datasels COURSE, OBJECTIVES le of business anaivt wzaliona Ge onemaking Sig expinre ousine atime sera -gsentation ane chur prediction 5. Apply clistenng segmentation andi natlem discovery 6 Use assacation rule mining t 7, Analyze tect veto using 5 comnts ion aking” by Alb Business Anoivt ie Sie 4 Rand Python decun"
    },
    {
        "image": "courseoutline1_synth_8_aug3.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippines College of Engineering Diliman, Quezon City PHILIPPINES COURSE OUTLINE S Y. 2024 2025 COURSE TITLE Business Analytics and Data Mining COURSE CODE BA 501 ‘Course Description: This course covers statistical and computational methods for analyzing business data and extracting actionable insights. Topics include descriptive analytics, predictive modeling, classification, clustering, association rules, and text mining. Students will learn to use analytics tools and techniques to business COURSE OBJECTIVES 1. Understand the role of business analytics in organizational decision making 2. Apply descriptive statistics and visualization techniques to explore business data 3. Build predictive models using regression analysis and time series forecasting 4. implement classification algorithms for customer segmentation and churn prediction 5. Apply clustering techniques for market segmentation and pattern discovery 6. Use association rule mining to identity customer purchasing patterns 7. Analyze text data using natural language processing and sentiment analysis, 8. Communicate analytical findings effectively through reports and presentations LITERATURE 1. \"Business Analytics: Data Analysis Decision Making” by Albright and Winston (7th Edition) 2. “Data Mining for Business Analytics” by Shmuel, Bruce, and Patel (4th Edition) 3. Predictive Analytics” by Eric Siegel (Revised Edition) 4. Rand Python documentation for data science libraries (pandas, sciki- in, tidyverse) COURSE OUTLINE TOPICS: Week 1 2: Introduction te business anaiytes, data preparation, exploratory data anaiyis Week 34: Statstica! ference, hypothesis testing. confidence mterais Week 5: Linear regression, mutiple regression, model evauaton Week 74: Logstc egssion decision tees, classeaton matics Week 0 10: Chasterng anaysis, keeans, herarchca caterng Week 11 12 Associaton ne mining. maet basket anys Week 12 14: Time seres anaiyss, forecasting methods"
    },
    {
        "image": "courseoutline1_synth_8_aug4.png",
        "label": "courseoutline",
        "ocr_text": "orsity of the Philippines Caitege of Enginesting aliman, Quezon Cy EMILIPPIRES OURSE OUTLINE SY. Ie8 usiness Analytics and Data Mining COURSE THLE OGURSE CODE: BAST courye Cescrptign: Tris nurse covers stustioas and computational met ce arging actonabie nsigrts. Tepes ictus See note analytice, Be! Sustering, asseication fies, axed fant ais will ncn 1 ese BAS sropert pusiness decsiositaking. Emphasis apebcedons usted datasets, sata 9, chasiteation syoes toais and iectinia96 1 reel businest SES ASE OBIE! anaiytica in organizational seo Ri60 1SNT sechniques to explore be ies forecasting 4 understand the rie of DULINAS yy descriptive Haestes and 2 808 yiguatizaton einses date sen anal predictive movieis using rou\" comet segmentation end chum preaicion mantelagsteation algae ncaquss for mat at naymentation and pater: GIscovery chasing pattems 5. apply catering rn rule runing 16 ent custom 8. Use asso imam analysis 159i BIS 8 atyral language bo anatyacal fruings tfeslively rou rene 7 Analyze went sseritations a. Gamat LIfERATURE 4 *Bugaess Ana 1g for Busine sion Maing” by Abst cata Anaiysis 6 Dee nj Pbel 4th Bic! yy Somme, Brute, AD anatics” 2oDaia Min seve Anaiyaes” by Ee ot Bae iggal (Revisad Reiiion) 2a a documenta 4. Rand Py COURSE QUTLINE TOPICS: ire, Saka eegsssten. AEE can ess weak ue art ins 2 ean scnce, tinea west, eben SHEN rear reention Soh eB DA eat teak 73 Legis grein, gedan ee, alee sees 4 aseng anais, evens, aaeie ea asia sats se: ngesisc im ming Rr on spy te Tiny et ays (Oreos ng RS"
    },
    {
        "image": "courseoutline1_synth_8_aug5.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippines College of Engineering Diliman, Quezon City PHILIPPINES ‘COURSE OUTLINE S.¥. 2024 2025 COURSE TITLE Business Analytics and Data Mining COURSE CODE BASO1 Course Descnpton This course covers statstcal and computatonal methods for analyzing business data and extractng actionable insights. Topics include descriptive analytcs, predictve modeling, }. classification, }. association rules, and text mining. Students will learn to use analytics tools and techniques to ‘support business decision making. Emphasis is placed on practical applications using real business: atasets COURSE OBJECTIVES 1. Understand the role of business analytics in organizational decision making 2. Apply descriptive statistics and visualization techniques to explore business data 3. Bulld predictve models using regression analysis and time series forecasting 4. Implement classification algorithms for customer segmentation and chum prediction 5. Apply clustering techniques for market segmentation and pattern discovery 6. Use association rule mining to identity customer purchasing pattems 7. Analyze text data using natural language processing and sentiment analysis: 8. Communicate analytical findings effectively through reports and presentations UTERATURE 1. “Business Analytics: Data Analysis Decision Making” by Albright and Winston (7th Edition) 2 Data Mining for Business AnalyScs\" by Shmuel, Bruce, and Patel (4th Edition) 3. Predictive Analytics” by Eric Siegel (Revised Editon) ‘4 Rand Pyinon documentation for data science libraries (pandas, scikiteamn, tdyverse) COURSE OUTLINE TOPICS: (Week 1 Itrasucton to butinass analytes. ata preparation. exploratory data anaysis Werk 34 State ntwence, hypothesis tesing. contsence intervats ‘Week 54 Linear mgression mite gestion mode! evahation Werk 74 Lagate mgrwssion section tees. clasiicaton matics Week 90: Cktenng anys. koneans eras csterng Week 1112: Aasociaton ne mining, martet basket anys Week 12 4 Time sees anuj. forecasting methods"
    },
    {
        "image": "courseoutline1_synth_9_aug1.png",
        "label": "courseoutline",
        "ocr_text": "Central Philippine University College of Agriculture Jaro, lilo City PHILIPPINES COURSE OUTLINE S Y. 2025 2026 COURSE TITLE Business Analytics and Data Mining COURSE CODE BA501 ‘Course Description: This course covers statistical and computational methods for analyzing business data ‘and extracting actionable insights. Topics include descriptive analytics, predictive modeling, classification, lustering, association rules, and text mining. Students will lear to use analytics tools and techniques to ‘Support business decision making. Emphasis is placed on practical applications using real business datasets, COURSE OBJECTIVES 1. Understand the role of business analytics in organizational decision making 2. Apply descriptive statistics and visualization techniques to explore business data 3. Bulld predictive models using regression analysis and time series forecasting 4. Implement classification algorithms for customer segmentation and chum prediction 5. Apply clustering techniques for market segmentation and patter discovery 6. Use association rule mining to identity customer purchasing patterns 7. Analyze text data using natural language processing and sentiment analysis, 8, Communicate analytical findings effectively through reports and presentations LITERATURE 1. \"Business Analytics: Data Analysis Decision Making” by Albright and Winston (7th Edition) 2. \"Data Mining for Business Analytics” by Shmueli, Bruce, and Patel (4th Edition) 3. \"Predictive Analytics\" by Eric Siegel (Revised Edition) 4. Rand Python documentation for data science libraries (pandas, scikitJeam, tidyverse) COURSE OUTLINE TOPICS: Week 12: Intreduction to business anys, data preparation exploratory data analysis Week 34: Statistical inference, hypothess testing. confidence interats Week 54: Unear regression, mutile regression, model evauaton Week 78: Logistic regression, decision tres, classification metres Week 0 10: Chsteing anasis, Kemeans, hierarchical eustering Week 11 12 Association nie mining, market basket anaysis Week 12 14: Tine senes aniysis, forecasting methods"
    },
    {
        "image": "courseoutline1_synth_9_aug2.png",
        "label": "courseoutline",
        "ocr_text": "Central Philippine University, College of Agriculture ‘Jaro, ilo City PHILIPPINES COURSE OUTLINE S Y. 2025 2026 Business Analytics and Data Mining BASO1 statistical nd computational methods 1 ‘analyzing business data able insights. Topics nciude describe ators predicive modeling, 1assincaton. Canining. Students will learn t0 USE Phalytics tools and techniques f° jications using real business yg, and tex! Emphasis is placed on practical PP COURSE TITLE COURSE CODE Course Description and extracting action ‘lustering, association rule Support business decision making datasets. COURSE OBJECTIVES snd the role of business anal jsion making Jytics in organizational dec! re business data 2. Apply descriptive statistics and visualization techniques to explo\" 3, Build predictive models using regression analysis and time series forecasting ‘implement classification algorithms fr ‘customer segmentation and churn prediction {for market segmentation and pattern discovery to identity customer purchasing patterns tanguage processing and sentiment analysis jugh reports and presentations 1. Understa 5, Apply clustering techniques 6. Use association rule mining 7 analyze textdata using natural ‘8, communicate analytical findings effectively thro LITERATURE ition) 4 Business Analytics: Data An “Analytics” by Shmuel, Bruce, 1 (Revised Edition) ies (pandas, sckitiearn, idyverse) alysis Decision Making” by Alba ‘and Winston (7th Est 2 Data Mining for Business ‘and Patel (Ath Edition) +, \"Predictive Analytics” by Eri Siege ‘4 and Python documentation for dat science librar COURSE OUTLINEITOPICS: trducton to business analy. 208 “eh 14 Satin tence, pas Wenig nT intents von, mute regression, model erahaton ek 78: Lote eesson cecion wees, CASS? mettis leans, hierarchical cute Weak 12 1 pepacton, exploratory data a5 weak 0 10; Chsterng ans Ka ene 1 12; ase na ming: matt bask 2 ne 1 14 Tne sees nays forzasing MeO"
    },
    {
        "image": "courseoutline1_synth_9_aug3.png",
        "label": "courseoutline",
        "ocr_text": "Central Philippine University PHILIPPINES ‘COURSE OUTLINE S Y. 2025 2026 COURSE TITLE Business Analytics and Data Mining COURSE CODE BA501 Course Description: This course covers statistical and computational methods for analyzing business data ‘and extracting actionable insights, Topics include descriptive analytics, predictive modeling, classification, ‘clustering, association rules, and text mining. Students will learn to use analytics tools and techniques to ‘support business decision making. Emphasis is placed on practical applications using real business datasets, COURSE OBJECTIVES 41. Understand the role of business analytics in organizational decision making 2. Apply descriptive statistics and visualization techniques to explore business data 3. Bulld predictive models using regression analysis and time series forecasting 4. implement classification algorithms for customer segmentation and chum prediction 5, Apply clustering techniques for market segmentation and pattern discovery 6. Use association rule mining to identity customer purchasing patterns 7. Analyze text data using natural language processing and sentiment analysis ‘8, Communicate analytical findings eflectively through reports and presentations LITERATURE 1. Business Analytics: Data Analysis Decision Making” by Albright and Winston (7th Edition) 2. \"Data Mining for Business Analytics” by Shmueli, Bruce, and Patel (4th Edition) 3. Predictive Analytics” by Eric Siegel (Revised Edition) 4. R and Python documentation for data science libraries (pandas, scikitteam, tidyverse) COURSE OUTLINE TOPICS: Week 12: Inveduction to business analytes, data preparation, exploratory data anaiysis Week 34: Statntca inference, hypothesis tenting, confidence ters Week £4: Linear regression. mute regression made evauaton Week 7 8: Logste regression, decision ees, classfeaton metres Wek 10: Custering anys, keneans, hierarchical chusteng Week 11 12 Assocation nde mining, marat basket ants Week 12 14: Tine sees anaysis, forecasting methods"
    },
    {
        "image": "courseoutline1_synth_9_aug4.png",
        "label": "courseoutline",
        "ocr_text": "Central Philippine University College of Agriculture Jaro, lilo City PHILIPPINES COURSE OUTLINE S Y. 2025 2026 COURSE TITLE Business Analytics and Data Mining COURSE CODE BA S01 Course Description: This course covers statistical and computational methods for analyzing business data and extracting actionable insights. Topics include descriptive analytics, predictive modeling, classification, clustering, association rules, and text mining, Students will learn to use analytics tools and techniques to support business decision making, Emphasis is placed on practical applications using real business datasets COURSE OBJECTIVES 1. Understand the role of business analytics in organizational decision making 2. Apply descriptive statistics and visualization techniques to explore business data 3, Build predictive models using regression analysis and time series forecasting 4, Implement classification algorithms for customer segmentation and churn prediction 5 Apply clustering techniques for market segmentation and pattern discovery 6. Use association rule mining to identify customer purchasing patterns 7. Analyze text data using natural language processing and sentiment analysis, 8. Communicate analytical findings effectively through reports and presentations LITERATURE 1. Business Analytics: Data Analysis Decision Making” by Albright and Winston (7th Edition) 2 Data Mining for Business Analytics\" by Shmueli, Bruce, and Patel (4th Edition) 3. Predictive Analytics” by Eric Siegel (Revised Edition) 4, Rand Python documentation for data science libraries (pandas, scikit learn, tidyverse) COURSE OUTLINEITOPICS: Week 12 Introduction o business anaytes, data preparation. exploratory data analysis Week 34: Stats! inference, hypothesis testng, confidence intervals Week 58: Lnear regression. mutele regression, model evahation Week 78: Lopste regression, decision ree, classfcation metice Week 610; Custerng anayss, keane, hrarchcal custenng Week 1112; Associaton le mining, market basket analysis Week 18 14 Tee senes anaiysis, forecasting methods"
    },
    {
        "image": "courseoutline1_synth_9_aug5.png",
        "label": "courseoutline",
        "ocr_text": "antral Phitippine University Caliege of Agrcultere a0. alla City PHILIPPINES COURSE OUTLINE S¥. 25 2026 COURSE TITLE Busi COURSE CODE: BABOT ‘Course Oescntion, This course covers slafisical and compulsiiens: matiods fe ansiyzing business aata and extracting sights Topics include descrptve analytes, predictive snsdat clestenng, 2336 joa, and text muning. Gtudenis will leam ip use analytics toois and techniques 10 support business decision making, Enipnasis 1s placed oA araches! aupicanans Using real Business, aaias 8 Analytics and Data Mining RSE OB JE) ES 4. Understand the mis of business anafyies in axganational declsen eaking forecasting 4. lnplament elassitication aigontias tation and ch sn prediction custome segins usteving techniauas tor market segmentation and pater discovery inining t9 iently customer ing pater usa nelural ‘anguage pocesning and seatinent analysis anaiyticat fnainge eftactven LITERATURE 1 Busi (th Enter! 2 Data Nining the Busi 3. \"Predicive Anaty nalysis Si sion Making” by Albaght and Winns 9s Analyies: Data se Snalytics\" py Shia Esition} hy File Stoge 4, Rand Pyinen dacumaniplion far data science tbraries (andes, scihitseatn, heyy COURSE OUTLINEITOPICS: ‘ons 12: inoue to Soamane asin, data propa, emacs dae ati Week 26 State easee typeineni toating, ect Wat SO Une rpeession, sega geasion, neces acvnctin Wee 7 Logis epession desi 04 ‘vise 818: Chaterog wsiysic, toneaes, nea Wine S152 Associaton ae mis, seach Basket ane"
    },
    {
        "image": "courseoutline2_synth_11_aug1.png",
        "label": "courseoutline",
        "ocr_text": "De La Salle University Mar nila, Metro Manila ‘nquiry dlsu edu pn Catalog Number: ENG 40; Year: 2025 2025 Instructor: or Jenna Roberts Office Hours: ww 10 0 ane11 00 ay 1. OBJECTIVES OF THE CouRsE OBJECTIVES OF THE CouRSE 1 Develop advanced research ski 2 teatse Raven EXAMPLES OF STUDENT WoRK Exam 1 Course Title: Advanced Academe Wrting Semester: Second Semester Office Location: Room 526, agmn Blog, OMPLETION OF THE CouRSe: course"
    },
    {
        "image": "courseoutline2_synth_11_aug2.png",
        "label": "courseoutline",
        "ocr_text": "De La Salle University janie, Metre Marcia ryQarsa ctu nh Advuneas Aecoente Wit Catalog Nupiters ENGAOT Year. 2025 2025 fasteueRer: Or, Jara Roberts tice Hours 11 50 AME Semester: Send Semester fifiee Lacatien: Room $26, Acirin Ska. Nei 108 THE COURSE 1 RE CTIVES OF ORIECTIVES OF THE GOUR: rata adcnncat research sua ricky at rei, gure akan, at scauenie Sabasae NIE 2 construct eangter axgumnonts suspartad by evidence, fopcalreaesriny, ANS SESH sc egeaya Gonronetrsting ota analysand synthesis 5s aod corenatenty is uoadlemis wring traoretica! remarks 5. sNiis clear, coherent, and we stractured aoe {5 apply spcemsste ctadon sivas (APS MLA, Chiesa} aevorsit £E Revise nnd ec wring effectively fr larly, coberesce, grammar, and iyi tpaserttand aeoonsc wintry teciee and avi pagina ecuay eee wraadan 304 paEEnN A 1 felagh witing stye to stfvent anaes gen vrseal sueays roludig research papers, arate reelawe, an neough eee 12H STORENE 2. Provide and revelve constructive foe 2. PROCEDURES FOR ACCUMPLISHING THESE O2GECTAVES: PROCEDURE JORPLISHING THESE OBJECTIVES: eee voivne amaizes warty a 2 racatsiee process invoking anning, craig, “eT, a oe Stusents i TS tenis tng annie sath oniuetins for oven cane 0 SSE\" So) et teneoact, Eg aces bn apeete oid such as ss dexckopmen, aargyreDh oni, 28 See ES level aang werkigh WE oes Oe pave orion easy a eestor shi, insea conberences ai Se \"ae preville a ee ence Rowing asnaemants wt axncse staves te exemolay acacamic wring 27S Sucindnes. 1Om OF THE COURSE: 9. STUDENT RECHITREMENTS FOR COMPLE we oau8e SENT REGUREMENTS BOR COUALETION ope says semonnting ast 89 rlengapiy with rumesatins sed evans 4 AOS resenish on seth top 8 ve anak apse nnn. Sem pect wig 248 sobeiaty seaes reigns OH) Comrainennte [5 erase tevin (20%) BG gage eprtbeis f ot gage ona enen2h oooee WA 0 tia engegemet rversiog Sirens Sd 5, Bar Ran Patesoainn (10%) A nates eat 1, Poet (es Complation cf saaved ee ih aston essay ot ang Saestese Examples: EXASIPLES OF STUDENT V4 sa Poney «diate nator tongqabared ln ‘ones nisumenen nous nuggared By toons agro 1 Reseenh Pane! on Language Eeuoatir atin rgsamsnntati 9 Pg seb AD eonpeinel die staat Mei egeane Comprehension wv snineiing cesoacen on eet ol 29501 Een, mene ve ccetion Hatori ame EAT RE. segs 2. Users Reine ar peur Paying aluiescant act nea sri haenas m9 contsergsey loypine Lteerone olan examination of wa eh nears me ‘emai sratars, and angagemest aarp $: CNinal Anatrsit of Fleona neve, censnuteting dose reading 348,"
    },
    {
        "image": "courseoutline2_synth_11_aug3.png",
        "label": "courseoutline",
        "ocr_text": "De La Salle University Manila, Metro Manila inquiry disu edu ph Catalog Number: ENG401 Course Title: advanced Academe Wirtng Semester: Second Semester Year: 2025 2025 Office Location: Room 526, Admin 849 Instructor: Dr. Jenna Roberts Office Hours: tv 10 00 AM 11 00 AM 1. OBJECTIVES OF THE COURSE: (OBJECTIVES OF THE COURSE: 1. Develop advanced research skils including terature review, source evaluation, and academic databases navigation 2. Construct complex arguments supported by evidence, logical reasoning, and appropriate theoretical frameworks +3, Wite clear, coherent, and well structured academic essays demonstrating crtical analysis and synthesis ‘4 Apply appropriate ctation styles (APA, MLA, Chicago) accurately and consistently n academic wrting 5, Revise and edit wrting effectively for clarity, coherence, grammar, and style 6, Understand academic integrty principles and avoid plagiarism through proper attrbutton and paraphrasing 7. adapt wring style to diferent academic genres including research papers, erature reviews, and critical essays 8, Provide and receive constructive feedback through peer review processes 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVE: PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: “The course emphasizes wring as a recursive process involving planning, drafting, revising, and editing. Students wit cUinplete multple wring assignments with opportunties for revision based on instructor and peer feedback. Writing Sernshops wil focus on spectic skils such as thesis development, paragraph organization, and sentence leve! editing Perea rees sessions wil develop critcal reading and feedback skis. Individual conferences wih mstructor wit provide personalzed guidance, Reading assignments wil expose students fo exempiary academic wring across discPines, 3, STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: 1. Shon Essays (20%) Fou 3 page essays demonstrating mastery of speci 2. notated Bidbography (10%) Comprehensive BBsography with summaries and evaluations of 10 15 scholarly sovces 4. Lterature Review (20%) 810 page syhesis of research on selected topic wih entcal anaysis 44 Research Paper (20%) 12 18 page orginal research paper with proper dosumentaton and formatting +5 Peer Review Parcigaton (10%) Active engagement in workshop dseussions and constrctve feedback 6, Porto (10%) Complation of revised work wih reflective essay on wring development ie wring Si Examples: EXAMPLES OF STUDENT WORK: Example 1; Research Paperon Language Educa [NTBLULE) mplementaton m Philppine schools with paicy re emprcal data Example 2; Lterature Review mnedia usage on Fipina adolescent men +: Ceical Analysis of Phisppine Literature In depth examination of postcolonial themes in contemporary vcs, demonsvatng dose reading sks, textual analysis, and engagement wih Merary erties. ston Policy Analysis of mather tongue based multingual education commendations supparted by educational research and ‘on Social eka Impact Comprehensive review synthesizing research on effects of social Wa neath and wellbeing. Incudes theoretical Fameworks and research gaps. Example Fapno no."
    },
    {
        "image": "courseoutline2_synth_11_aug4.png",
        "label": "courseoutline",
        "ocr_text": "De La Salle University Manila, Metro Manila inquiry disu edu ph Catalog Number: ENG 401 Course Title: Advanced Academe Wet Year: 2025 2025 Semester: Second Semester Instructor: Dr. Jenna Roberts Office Location: Room 526, Admin 819. Office Hours: Mw 10 00 AM 11 00 AM 4, OBJECTIVES OF THE COURSE: OBJECTIVES OF THE COURSE: eepevelop advanced research skis inchadng erate ev: source evakaton, and academic databases navigation every ederce, gen esenig, an peop here aneweNt wes academe essays cemonstaing crteal analysis and yet jatentty in academic wring 2. PROCEDURES FOR [ACCOMPLISHING THESE OBJECTIVES: QUIREMENTS FOR COMPLETION OF THE COURSE: JoMPLETION OF THE COURSE: “demensteaing mastery of speefe wing SxS aot evasion of 1015 sebaiany HUTS 3, STUDENT RE! ‘STUDENT REQUIREMENTS FOR C ‘4. Short Essays (20%) Four 3 5 page 25278 Review on Social Medial \"adolescent mental neath Example 2: Literature media usage on FPR ‘Example 3; Crical Analysis of u Exar 2 ge, demonseatng dove meding AS it"
    },
    {
        "image": "courseoutline2_synth_11_aug5.png",
        "label": "courseoutline",
        "ocr_text": "De La Salle Universtty Manila, Metro Mania inauiry disn eds ah Eeunse Title: reancad Acetone viata Semester: Second Semester Oifice Lecation: tone 528, Adme: B02, Catalog Nauiber: ENG AST Years 2426 2028 Insteuctort Gr, Jenna Rovers Office Hours: new 1903 a 1h00 ait 2, OBIECTIVES OF THE COURSE OBJECTIVES OF THE COUR: 4, Develop edvanced revearct skits 1. Ceacstnist come arguments suapgtat oy eYISEN Wie caw, cohesent, and wobsbuctured seatemis say +s Aoply nepropiiat ciation sian (AER, MLA, Chicora} acsivataly ae consinenty i sation Wad 5. Race snc exh wing eoctvon for clarhy, cunerenet sratans wants een pases ar avo: pigjninr ena proper saan asd petapNa fiarenk aracleec gatas ‘ntkating resonteh pages, Werabare cee, Bet CES! essays nstugiy near review procenoes laksakon, ang aensetnie database navigation oresica cant ching wacsture review, Source 2b, egies reas ning. aod aporeoriate ss Gomenstrotng sitios analysis wet anthesis sen, and sty 7. eat ing che a Brovise ane receive constructive fends 2, PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: PROCEDURES FOR AGQOMPLISHING THESE OBJECTIVES: se vruros emphasizes wi aa arecureieseocess RvOvina ang, cating, revsiog end eteg Sten w2 Fa oe ring arskynnats wit opexbusti fo evi bans on erctor Sv ass Inet, SON Ser eign agate nie och as Hews oerotspona, pare ah oxganttian and wethane Ue 0 ro aa govtig ea tending ane Yao aks he coneconces wih mire 6S SSS Ree a eee gen Posung asstyints wel apes Shaan 9 eeTUBrY ade: WERE HETONS ECE 4. STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE grupeny SEALIREWENTS MOR COMPLETION OF THE COURSE se envy aemanatitong msn “6 $08 sweh siennaes sod evakanoany of OE sebaiay 30 te weang shits 1 gran Eenays BONE Conpatenee ing 2. sontated Sarno neceorh en select ep wth ert sma bess Reve (QOH AD page spate oh page cpa aceaceh pe 0 Soeur ar TEN cs sd eerie foetanch Aatve apagewant a werches cernpinic af ened ees Wh Bec ay VN Gen A Exaneptest 5 OF STUDENT wa Bea Enarqie 1: Renown Pneac an Langunge Eduectian Poly Ae PITRE) mulanentaton n PhEppeve schaos ol paaey weatene barge late ‘example @: btaratare as uvayge Pann adawacont mental 6 1 pine Lierstura -Inatepin examination t poet dose sensing sks, ous sri, and engage: tris of onties longue bused nating acento elaine napa Dy eAilcecons eeaTS ANS a1 an Sons edie topant Comprehensive review serbasisng mesegteh on aft of sare SE saben, incon taagsveaa Wesneaich ana mare\" Bees saiociak remes n 2cteME OT eth Herery tien wea 2: Cries Anais o gre navel, eurenatating"
    },
    {
        "image": "courseoutline2_synth_12_aug1.png",
        "label": "courseoutline",
        "ocr_text": "University of San Carias Cebu City, Cabs Peistrar use sun Catalog Number og Ceurse TMte: So Year: 2026 292 Semester: instrwetar prot ndsay Thomas Office Hours: yaa 100 San S09 ay 84 fae igs Summer Term OMICS Lacatinn: oss 228 Fac oe, 2. 08, JECTINES OF THE comes. CTWES OF 7 Yderenn sorte sevelspert ie aya CI motets arc wontnacbapne cg Meteo), Age, an 2 Aol mauverments en 208 ONES srcauHe A, eratze, boomin, ai vate software reeniemmants fom Mere Using aktectetanted sesige pn 85. ee pata, ated UAL diagrams Hae omoetsetecinely using a 8. Wid ancapionen \"Seto. $04 coabonton patton 81 298 norisemancw Shy suis incising mestanabicy wkahéey soe 1 n soRooe evens ans waiter saraee 5. Mo afte 3 sups00t lenge Snot tens wg stator sabcace davai softmace sustaseaseye Wat practi an iow 2. PROCEDURES FoR Ace PRICED ee RES FOR ACCOMPL IeHnie The course wi em Y Sere, case stucies, 3 bertuipate m weet Deeg tha cet Labora Pitais on experence win wotiare lool nokiing Bi, JIRA, ane auton SA Sract ag MOB Hoan peje we rence sheteae scat 4 worapicte sottvare system intone, Bracties, Regular sede Stn aernaiatratons wi 9 BausIry srd fneitale seer earcng ana tose ASHING THESE OMccrive: 3. STUDENT REQUIREMENTS FoR COMPLETION OF Tay UOENT SEQUIREMEWrS som go, (ON OF THE coy 5. nara Aspe F COURSE: 88, asp, “plemeeaton, tettng, aos 2 SAY S086 (6 he ess sent any Shae wpeeneey 4 Se Piet aoe, Pee meseemans anpeptscg. ane 2 eth Seeamnsstatlen. ene Paisano a comp ofa ey Penton am toes wstng, axe TS we ate evedatons matGtmeee 388 stay eurince iP tess ad mec tpn. an anes a aS shepping Spte er mateo Be neta Hi RNa ses “hs eqsroment soenceares Beane 2 2 sranisemers. pone desge, 8, me st cometanee on"
    },
    {
        "image": "courseoutline2_synth_12_aug2.png",
        "label": "courseoutline",
        "ocr_text": "University of San Car Cebu City. Cebu ogee Course Title: 8) amb wa Catalog Year y 027 Ser 202; ert Summer Fein 25+ instructor prot Lindsoy Tromas Oifice Locations HGUTSS MENT 10 00 AMA3 00 Ent 1. 08. CTIVES OF THE COURSE. ORIECTIVES OF THE COURDE, 1 rturte sotware duveloonient Ste eye s (SDLOjrwniels end! mato: Ueniga prasinies, dasinn potas, and UM bs vasing, system testing, and seveptance oan prantoer ty suppadZeng tar sof 1) colwonsatve setare davslavinant toe sysiens foiaeing ‘iustry starntara ney and foeaback, fa). Fe egranning meee lemeriaton, ehteg, 3 ane Ussneas 8"
    },
    {
        "image": "courseoutline2_synth_12_aug3.png",
        "label": "courseoutline",
        "ocr_text": "University of San Caries rity. Cab Catan Oi sirarguscees a regi catatoy ABTEBET years 2026 2027 gemestest Surmmer instracter: Prof Lindsay momee office Lovathast: Office Hourst Mar 1000 son 225, Facuty B99 aastzig Wate, fait, aod DONE JES OF THE COURSE 0 0) models wr eons cd scwere eowatapernn Me 62S cera Foe 1 Unters eporasoues ones ot, ene, desumant 6 siete safer ane UME ise sip. cate asin pay, inhale rage ates eran 208 STE AAT atperctented desar #Y etna teu tenn sees HAAS aoe, neon wes, aera: SA acceptance 380 ig prajeck cose see, es ocr OT coy, 8 SFO eigets ehacenis scy, 207% a. tonage settooce sabsae sent aramanes nenatine mentee? seas BUDO auaty 2 7 apeh a, eh teats sofiwacr 00% asin xa nrg 20H op, RECOMPLISHING THESE oBIECTEVE owes pase wt PROCEDURES FF FoR ADCOMPLISHI ante ees, CATE casey Sts, rr acres canceaes ONES Teaporatar# 8 8 covet jevatomna tooks nesting ap, evs autores teat 7 a pa nese SOHAD 2 PE oloware SyeteO ser ean WS ate Pe! ES an tose ena grav prope. St oui 8 ovis resorks. RICEDURES “phe course nel ome porteioate m reeity HN Mendon eaperenece wit 8 Semester rg greens OTOH! Seprieon. Rater code eviews a7 7° ot Fon COMPLETION OF THE COURSE: is 98 THE COURSE: ror comrcEt Fae ropraneing 35% see wing senate Gree nen. estar es onseneasens. 18 4, STUDENT REQUIRE MENTS: tes eats an rare pcan ee rey Faeries (An) Wee ao a sen 894 Commer pevnepeen of a cosa 2808 eat i oer agenvassnh ay REET pee chaos sing oct ome aur tnentn. 1000 otra soe 57 es eee pe aes seems nde, ATE aqcososed syn fe cos emcee SO Se nanan, EA HO bourse Ragatnion Syl pa esate: earte 2 ste Sears, gate eS pes ste apse pe Hemtows to nue neck appt, MEE scent nie xphesbon te 3 cesar. 0t8 2 ayner 3 ing weer soos eT"
    },
    {
        "image": "courseoutline2_synth_12_aug4.png",
        "label": "courseoutline",
        "ocr_text": "University of San Caras Cabs City, Coo recisirsr Gus au pp Estalog umber: os yoy Susiese Ntke: Sotaare gy Year: 2026 2027 Semester: Summer instracter: prot intsey The OFEG® Locatinn: ecm 2 5 Fry Oiflee Hewes: nave soy any 20 Py nesiing Peni mas 1. OBJECTIVES oF THe COURSE: “Avebnmet We sot (S C model and mst SOE WS neti tral Ag, and evony tins Losing stntsgin &. Menage sohence stajecs etfection, 8 ty any ies meet nes WA oegcome Msg unt eae, testo tein. et asenptance tenting ane cstanorston wag omiest merge Eeuate sotasre gu \"e9 icy mainioinat vols. version eonina eta Poms A, MLE. secur: 30d pectonsay Prost te suep0% ongetone WP tottaare dsceinpmeot practws sothwu sary 808 2. PROCEDURES FoR ACCOMPL ISHN Hyves, PROCEDURES FOR ACCES ishing THESE OBVECTIVE: Tea eb wl exeioy 2 combination of fartowars em waety wetives son Hee BS 90% prokects, Coates wie Laboratory sesatcas wit porcine Puree wth echinacea gaveinen RA, S78 astarcaiea testing Semester tong Sripie uekovars sysiem fotowing& ‘wetate paer lasing und fessor 7 REQUIREMENTS con COMPLETION oF Fug COURGE: PEGHIREVEITS 208 CoMETION 08 THe neue “PS Fe oprsomeg acre sveng Peaureraens any 2 Saboratoy Beers ROS 1S atites a tne arnt oom ans 3 Miseeen Beams ey mh covey 8) 4. Soup Priect Od es ans Boy ssasnanae SxAELES oF 6 TUDE wee eR OY shasng sy8ten wt usec ute ‘mansjein een ar eepcym gee ton erases wena si, ane 9 Soectine an, snompemart eee ‘rity, Prost cegwos a Bevmtesncot a re EEG Systac tr ceutoe enero, sehen SI Hm ESTA sevacenaa Sent nee ez Nestea Scenitnee Syst S002 ainiviien tr tenting mesings SRE Pree, ae estat taser carp Manag Bae cesarts mses, Beogtany en seooas"
    },
    {
        "image": "courseoutline2_synth_12_aug5.png",
        "label": "courseoutline",
        "ocr_text": "University of San Sarios Cabs City, Cebu Peolbarguse eeu sn Catalog Nemher: 08 4Gr Feats 20282027 iastesetur: Prot Lindsay Thomas Office Hawes: a see aan sen pes faurse Sitio: Sonvare Engmeeting Semester: summer tom, Offiee Locsin: acas 225, Pac Bley 1 ORIECTIVES OF THE couREE RES 28 me CGUASE WLR HORNE decwteain eee be nesteastes \"AIRS o8e cetaceans orktng Wvwch Agi, ae OavGon «1 OE oecKd deen pati: ‘Pout ek wating, 4 tapiermnt sotones eeting tetegins 5. Stacey vate scnjte etsy Hing pence 0. Evahite sftvave aunty atinutes inetndng nan Aes cotseate min ‘conta spams, and eokeontiey sete anesenant tosis yemon Sr wehty MBONIY seccuty. cad pertommancy than eomaticns to pps tang aon ect Susininatity HRREHN ats2@ deveispnare peachone tnd tom, tenance set 3 lat tainty tame uring. ISHING THESE Onecysyeg: THESE OREOnvES senna eget, 2 Sat, ar group pre s. Seater wi int 2 proce re Core Seco wh OS Reacioes Uaeeiaee eee Sa Sots nCWENg AR grt automunet tee prestons SRE EHO Britt wb renana aecerta tm gente e Complete tofteare 2 srattons. Reguies code rectus amt see STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: BENT REGUIRSUENTS FoR coneTioN OF Tas couse A) Poe wopranreg aan) 2B tabaccoy SOS ecstasy babnrt sb tsg ae Forbes (198). Waakiy aseteace 3 Siem Expose (204) otis ln sete essimarng Exwmptes: DOMPLES OF StCENT KoRn EXEIES 1 Bonmarce ss «uses set 09 inca i ceovsiog GL Sepane San ROMS Be mraon. ae te wanngeaee eee th geass, tse cases, ane psyenn eae Ecaweph Urrarsy Case Rag SaNAREAN, geben sn 26 ms rasporacanens Seat wth ace miscrcetinn pres Ae hie atstonts teaifeaten oe ane, STH 8 wi nme tym tt octets, stein Seow aaviing Si rare Gaasase Bem, RENT AP soveapenes, Fanta ame SEXTES 2 Sestone Anam Syston sie spscaten ty Seng reinckss. ox aseing aching nese ‘eheesnen ews ens. Bn pea sepsis, masageg usta monet, Sha Ge Seo Strcey wciatavn, sae ces eaters"
    },
    {
        "image": "courseoutline2_synth_13_aug1.png",
        "label": "courseoutline",
        "ocr_text": "university of San Garios Gabu City, Cebu regisiranigesceduc Catalog Auimber: ENGAIt Course Titles savunces Acetone dite Wears 2028 2 tostrunter As atfice Hours: ed Semesters Fis! Ser Office Lacatlon: oan av4, Seance tia oe, Prot Cay Mega gw 330 PMG AM 4, ORJECTIVES OF THE COURSE oF THE COURSE: resench ehits nckudeig Raise oalecty 4, Dewalop aavante2a 1, aod ausceme databones manigan rst oomaie sijaruns supported by evidaties, vent, wc wob eiruchirad academe ansnys econ atyleu (ABA MLA, Ghinagey 0 ce qracrmnay, end ate agian thconh proper ation 206 TTARCATINE papers, Herator verons, ol orticat essay aw, eouroa avast reanoring, 2 eppronriate theeretica ieANeMsKe hog eotical abyss ond aynihesas aie: suegtety and consiatantly azavsernas WMHS effectvniy fr cent, conere 5. Revise and est we 5 Unawiand academic integrity pines ane >. ala vrtng sivie te dfornnt wader yooews extveg receaeh 1 provide end rereive couultvetie feeder tinough peer :aeinn processes 2, PROCEDURES FOR ACCOMPLISHING THESE ABIECTEVES: BHOCEDURES FOI ACCOMPLISHING THESE OBJECTIVES etn ae aesrnve eocest recht revs eS Se wa eee pe wnt aaatgoranta wt oppsties ft revlon MAS 2 Te ‘ne pies oadback WHiNG Sit i om pov akdo eur: an fest Gove, GA: TEES Sad genience tose eh works We web cvetog crn] eating a feats #XED. cvs ONS nih SNC WH TONS Petrnatees gudonce, Renny azcspinerss wflextse KUieit 9 CXSUEESY poarinae wrens 22708 CSE HRIAR. EMENTS FOR COMPLETION GF THE COURSE: 1 OF THE TORIASE: mastery of 20 rg IS F, STUOERT REQUIR: msso cows SrROEHT REQUIRE ‘Spon Sesaps 0% Lc ubegapy (1K) Comarenerses RN 00 page ayaa f rence co stiles Be page ried asm paper wit gree decantation ad fr on} bev engagement wastop cesnans mS euatucineFanck cing grea ee 2 pogo essays cams va wanes ot OAS Seba tes 8 ion arabs a Reesece Paper (9%) 1 5 Yous Savi Pariepaien yy Coin of necand wk we 8. Fontowe 0 rafncooa ess Sxampies oF SrUpRERET WORE: Reseenh Paperon Levey en in Phigpine sh age Eucnton Pony Anat of moter tengue nrans meting $0 51899 Ae Ae fate wep by tucbesal axeOH 278 a pry rena Ltemturs Rav on Soc Media monet Comahens mel Sea S LS ot tects sf x00) eae esa ape ndcinzoom cnet haat and vavhieng, Indes near reat mumescss a0 sega arsh D3 smoia 2: Gaia’ Anata 24 Fi opine Liertuse -le depth eunrinnton of pasicteris Drerae sing ods, wstcal ansirs5, os Mi nagegernnn? ait HUI) Fagen nove"
    },
    {
        "image": "courseoutline2_synth_13_aug2.png",
        "label": "courseoutline",
        "ocr_text": "University of San Cet Coarse Tithe: Advauoed Acatonis ening Bemester, Glfice Location: 2 cision Fasteeetar: Assoc. Prat c. ‘ody ton Uitfice Maura: gay: 2 00 PMES3 99 Att Room 981, Rema Bid, L OBRCTIVES OF THE COURSE ORIECTIVES OF THE ocuRSe: 1 Revebae atvanced 2 Consarsct someon ae 20 Aske mening fer ate sevens, seuroe srvents suppatac siuation, ane acai datscases reugaiion ane seroma theme te Rameworhs Pg emtenl anadveis and sy ©) AecUratshy and consistentiy in acaueie witing *WeN Tor clvty, eoterance, wammtr acd iyi egry oriciies and avis playianam thon proper 1 tage wrtiay styee ts dtovent tig 8 Provice set recsive vers muctive feeuback througe by ovtionas, gins rearneg 8 station exsays aemcmt at (RR LI 4. Actty aparoonate otaton etyies its Sn Bc Ring a 8. Understand scant attrouts ue oaraphaatg BBGh napers, Reval reviews, nu BF Cone proces EN 2. PROCEDURES FOR acco PLESHANG TH! 7% OR IRCTIVE ING THESE aN es. Sha ct Bing, dating, revive, s60 slog, Stet wt nee hee ne Set hased on tac aed pox: dbase Yee 2 rn ate SeveoMen paragt uganiesion wee ene i eting mee, Haseley es teMeiiog al ecb ax. induitsa covers ss atiuctr wa previe Ee Reacirs assigns vitesse atisete in ohempiny aces wing across gisewines, Pattie wring ansignmants ei ‘Rorkstiogs wif focus on emacs Powe ooview e043 SiSonae4 gut IHEMENTS FOR COMPLET, AIPLETION OF THE cours Fou 88 page massys Gent 2 Amotaac Bicep, (105) Camp ON OF THE COURSE: \"ng musian; of span ‘king ake \"aire ogranhy wh summaries ane yest of A 290 pape syncs eanaten on 10 sotataty sco, Set ioe Wah emis anya Senge cag ceseiee ape wi 43. Pas Review Partisan (126) 4 Keserien Paper 0, rape Mecumeataen and famating Aatie engaywonct santos Sanus 8. Pattoio toc Exampies: 9 38 contin teach BIND ot etn wade Wh Aan ees 20 wing devdepment EXAMPLES OF SH ADEN? WORK: Gata RnR opts on Language Euenton Mote Aneta of mother torgueiussd OAS MCE) Welerentatn m Enon cespots soley rerdaiens siopo ukngoat adueatiny 9 hy ocuiestione) enaareiy and Estee 2: Uteeatowe Revive on Social Mile tpt Gi Usage on Ene atoms Pome! sea! manta neath and wweenng Eason 3: Ciivel Anais of Php e808 nema, davannsttne ioe cave sysinesitivs exasich on attects ct yaa tnctuses thesretseitamewony eis tench ace SSS Lgeah fenstion of ostentscal menses santeuorace ese mani) skh ecual anatyon ane engagoonentwet enn we"
    },
    {
        "image": "courseoutline2_synth_13_aug3.png",
        "label": "courseoutline",
        "ocr_text": "University of San Carlos ‘Cebu City, Cebu registar usc edu on ee Catalog Number: ENG40t Course Title: Advances Academe Wenn ‘Semester: First Semester ‘Year: 2026 2025 Instructor: Assoc Prot Cody Morgan Office Location: room 391. Seence Be Office Hours: Mw 3 00 PM 11 00 AM OMPLISHING THESE OBJECTIVES: 3. STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE ae cass Gs) Fer 4 page vsays comanstting maniary of ow wg SAE Seer tonne. comets bsagary we nenmare in nmeara 18 wy AY coon Revs) 19 pag naan of nares wh TT a ecco Pap 2%) 2 8 page ongat earch pape wth pre dooms a SNASNS cecuasions and consti teeteack ‘5 Peer Reve Paricigatn (10%) Active engagement washer essay on ting Sevetogment"
    },
    {
        "image": "courseoutline2_synth_13_aug4.png",
        "label": "courseoutline",
        "ocr_text": "University of San Carlos ity, Cebu Cabo registraniuse edu nh Catalug Nembor: Ene 404 Cause Title: Awanced Aonzeme Wording 5 Semester: Fist Semester Instructor: Assos Prof Cody Moran Office Locetlen: ercm 281, seanse Bits Olfice Hours: uw 2 00 Fret1 08 Ait L ORIFCTIVES GF THE COURS OBJECTIVES OF THE COURSE 4. Develop autvanwed researc skis inckcing iterate review. y evidence, lagi! reasorng, and snpinoriete tr! ree evaluation, and srademic datarsses navigati 2. Construct complex arguments suurested 3. Wile clear, coliiete sd wa structured avaeleroi exsays dencastating crtical anayan and synthesis 4, Apoty aporamviete statin otyles (APA, MLA, Coieuge} azcurntaty and consistenty m ze2dentc wing 5, Revive and ai wring Sflective y far viathy, coherence, grammy, at tye attribution and paraphrasi 8, Undorstans acariomic integrty principio sind avoll aisgrisrs Yarough pec 7. picapk woking sive to diferent academns quutex Inchuding ceeearon papers, evalu review, and erica enna 8, Provide ane tensive Gonaircatve Seedtack rough pues eviews processes iF 2. PROCEDURES FOR ACCOMPLISHING THESE 082 PROCEDURES FOR ACOGHPLISHING THETE OBi ‘The course wrnghasiaes wtling a8 a recursive graces meaWing omens, cTaling, raving, ard edtiog Stitents wis comniake cists wtsgg sonighenests 7h apport fer eviaion bases on mestictas and poet fecdback. Vite thortahops wi feos on epacie sku etch at themia sevokerrens, oazagrsye cegaticaton, and sentenne teve! oding Pree revet seasione wit Goveive cincal resting ane fexttsack shes. InsvWual canferennos win mstruciCn wl VEE feryanaized guatanes. Reading segments WS exgoce chiens 1b Bkemelary acisiemic wring across, Serio, 3. STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: 1. Shet Gasaps uta} Fear 6 page extaye Camunitateg mastery of pacts weting Se on of 148 goby sows {2 Armotatet egies (10) Sonnmencenive MOC Sama ond ee 23, Ulrature Review (20%) 850 page syntaie of ropeuts oe salted tops wah ea anys Syage erga veescen Sapa wth page Soourtetatien and frnaing ack esa waskshe Sesuations oa Saaste wiley dooweecvet Exaaspies: EXAMPLES OF STUDENT iNerec 1 of meiner tengue dgzed oattimgus! eduestn Eaamule 1: Peteacch Peas: on Language @sucation Potey Ar onal mssarct and DATS MLE) plemuntatan in Philgsine eahouls win gobsy mournendations sunparted by ad capa ta rompia 2: Last Review on Sucal Modin Ingpect -Camawwhansive revs syothesising verearch an ne Seadis usage a Piisino mivienoemt merit sesh and walsh ing, maiudas meoeniaad MaMeeor AN MESKNSD BAPN Roemie 3: tine! Roaiyais of Prifpna ikecwsure ieaiegts examinsten of nesteoknal thacns m contestant Pipi novels, aamoratoting tam onadeg tide, tus! anabse, and engagement wi iasary ec."
    },
    {
        "image": "courseoutline2_synth_13_aug5.png",
        "label": "courseoutline",
        "ocr_text": "University of San Caries Cob: City, Soin repluberguscequ ch Catalog Number: ENG60t OearSe TRe: Assserns Academe vrtng Year: 2926 2025 Semester: cst sero: Hastrecter Assoc. Prot, Cody Homan Office Lsrativas jos, Office Hours: sw 3 00 PMAt4 00 AM 4, OBJECTIVES OF THE COURSE. ORBOTIVES OF THE COURSE: 2 Dever astvanced research 2am acting Zerenice son aNtheaOn, ane aeortersr: datainaen navigation 2 Gonctruct comoie, arguments ported ty evidence, opie resaaning, ard eoowogriats theoreteal eamsaueree Site inte, coheed web stated acattinns essays damenstatin cite! aayais and aysthean 4: Aobiy soproptinia ofan tives (APA, LA, Chicas accurataly ne! consists me soci wig 5 Revise and act wring eitenevety tor cant, comerenve, graront, and etvie Unsesstand weadonis mnegrky penebies and ave iagtuism Bough proper attain and peragicaeing 1} Rast anting style to ditarent acndemic genus noting eesech paps, erahive ivi vorsinactive Yendeck thiccigh pear iaview ocesees i $0 and orton: aseays 8 Provide and receive 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: PROCENURES FOR acCOMM SHINS THESE ORLECTIVES Suuse errihesiees witing as a recursive proves. involving pigvaing, sanpiete maitels arting anuimnmiechs win appareati tor tarnion baw ahas wi oc on epenke sie such as wee develope Faves sentions Wl develay orical ra Denioneined qukisnee, Koning assigrmenty stating, roving, ane exiting Students wit ‘etuctar ond act fecubacs, ering Paragraph orgsreration, and aaitence level ote. ng ain FRewnk Skil ineivcsd conference win inact wil seo WA axpnee students 12 exemplary aeader wr dey ae 2. STUDENT REQUIREMENTS FOR COMPLETION OF THE Cou! STUDEHT REQUIREMENTS FON ComMaTION OF THE COURSE ). Bret Gisaya (a s). Few 5 page essayx anunataing mastery 2 Aonaties Baska {10% Comprehensive Igy 3. Lmeniee Reson i243 pt awonis erg nes (8 Sumi end evziatons of 19 13 sohutoey tctwcos 850 pape sytabeas of raves er seated 4, Ressarns Papee 18)» 128K age egal sear coe wih tel inj Ds With popes dorama and formating 8 Fear evn Paros (1% Anion asgegemion in wissen Sesusticen and ecenie +e rnc (Pari eret Gametuse ot minal werk ih sectve any en wing evsegonane Examples: EXAUPLES OF STUDENT WoNK Roveersi Faser an targuage OR BAE) arplewainaton Phaneine sohoot ation Haisy «Anatyae of meter tanun tases ntitrqun! etusetion nih Doiny sesemensotan s ex ccrs by adcahonw manatch and legac Goenp veiia usage en Haina acaseecent mental naar sive evista ayntheaiong seach on etiesta of #8 weatbeing. noes tneciatial ternempins aoe toseon tye af Phiippine Lawson -fr death examination vis, damansvang case ‘ead sha, manus ane st gacteaionial ems in sememprie y Bd axgageman wih away mene"
    },
    {
        "image": "courseoutline2_synth_14_aug1.png",
        "label": "courseoutline",
        "ocr_text": "University Of the Piilispines Biman Cuinzon ity, Mato Mande Pegging ea oy Course Tithe; PR Rotem tng A800. Hot Travis Webster PE 80 PRI .00 am, 4 OBJECTIVES oF THE SOuRSE, ORECTIVES OF THE CoURse 1 Davin atvenced ing 2 Conre ee we, Aa) arene Staten Hes taba, 8 hs 8 Bevel 00 088 sek etocteay fr can, Uncerstast acaserne, AS Are 3 to atten acaceme 8 Prowae ara receive g 5 05 Saherence, samen, ane apie nd e088 Dagsattam Se0reu mechan reser atte feedak Sox WOR ones ation amd pacaytasing RAED, Beratone seviews, erat ortcakasaeyy RE review sesceoene 2 PROCEDURES foe age, OMPUSHING THESE O8 we? VES: PROGESURES FOR ACCOMPLISHNG Thee OREOTVES, ‘Ths cease arn srehasions entire a¢ 2 ecu 99, a0 eating Sess ot ss BAA taedbiack. Ning i, aoe aertetct tara ecg, ear prove 228 Sasictren, 3 STUDENT REgurpen STUDENT ReawREMENTS Bono; 5 fom says ca SOR Conte evieny oy BPLETIOH OF THe Couns: Foer 38 page esses tomsmevuing mania, -fomommarnie verse ein, 2 9% page spots oF ceseact BOE an eran, 2. Bausmtet Batasaty (1% 2. Lonsaice Navin 2055) 1 Se uct yay EON Bb esting 3 7336 steeper paper 8 rook ado Pep deccaetiaion 903 tamstting ‘sor sieo Ges th aonsinseing teach OI: Goats ot cevissd wit en S58aY 92 ny beraternene Faainpins: GRAB LES OF Examine 1. ese sch Fret st La Bre hay a SY ANE ot eines tangubased sai, Sanne, Resentaine b Phippine war ea eae erp date Dy educatoaal seen ey Pe ag, tt Kev 2 Slade nget Compehesene Sere stein resoier 9 ence ot ais rin ie or Fa nena ae x wthsera ies ore tan os ee ‘ens vewa Saroraieg coat mang mi mace ageean serteromaney \"OPTION Wt an cre,"
    },
    {
        "image": "courseoutline2_synth_14_aug2.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philly ippines Diliman Quezon City, Metro Manila Catalog Number: ENG 401 Course Titl Advanced Academic Wing ‘Year: 2026 2026 ‘Semester: Summer Term Instructor: Assoc. Prot Travis Webster Office Location: Room 228, Admin Big. Office Hours: ww 1 00 PM 11 00 AM 4. OBJECTIVES OF THE COURSE: OBIECTIVES OF THE COURSE 1 Leo OF Car at ever or 2 Ce i re ee aren ‘and webstructured academic e827 demonstrating ertical analysis -consistenty n academic wring 7, Adapt weting 2. PROCEDURES FOR ACC 1ES FOR ACCOMPLISH! ‘The course emphasizes wring 29 9 seadtipe wring assignments WAN, ts wl penis seveopmert. SATE ter and ‘skis. Individual conferencs ‘academic ‘workshops wal foc Peer review sess! jguidance. STUDENT REQUIRE 4. Shor Essays (20%) Fou 25 2. ponetates Biboghy 13. Laeratre Review (20%) «4 Reseach Pave Examples: EXAMPLES OF STUDENT esearch Paper on Review Paripaton (10%) us on spectic. {EMENTS FOR. (90%) 1215 page 3. STUDENT REQUIREMENTS FOR COMPLETI gage essays demersraing mast 10%) -Comerenensive WORK: OMPLISHING THESE OBJECTIVES: {ING THESE OBJECTIVES: drafting, revisina, recursive process nvoving Panning, for revision based on mstuctOr non, and sentence level esting 3 sons wit develop critical feadog ec mera wn expose stents 1 27 {€ COURSE: of specie witing sk suatons of 10\" Language Educa! oe Ee wth posey recommendations PPO ON OF THE COURSE: 18 schoaty sourees"
    },
    {
        "image": "courseoutline2_synth_14_aug3.png",
        "label": "courseoutline",
        "ocr_text": "University fine Philippines Diliman Quezen City, Metio Manila ran Qund edu oh Cataiog Newber, ENG 495 fourse File: ace Semester summer fan Instructor: assoc Brot Travis Webster Office Location: econ 222, Adu Big Office Hoars: taws 99 PRAT o09 AN 1 ORSRC TIVE: OF THE COURSE THE COURS! 2, Constnict complex a arts supperted tw hewval 5, Wite lear, 2» el, and Weivetructited academe essays demonswateng crtca! analysis ard 8 Sociy eppropriat Sivies (AP&, MLA, Chicago! aoeu aiely and eonsiste iting efecinnty tor char Resswch Faces (SE) D8 gape orga ve UDENT WORK tend essere 9"
    },
    {
        "image": "courseoutline2_synth_14_aug4.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippines Diliman Quezon City, Metro Manila registrar upd eduph Catalog Number: ENG401 Course Title: advanced Academic Wrting Year: 2026 2026 Semester: summer Term Instructor: Assoc. Prof. Travis Webster Office Location: Room 228, Admin Bldg, Office Hours MW 1 00 PM 11 00 AM 1. OBJECTIVES OF THE COURSE: OBJECTIVES OF THE COURSE: 1. Develop advanced research skils including iterature review, source evaluation, and academic databases navigation| 2. Construct complex arguments supported by evidence, logical reasoning, and appropriate theoretical frameworks 3. Write clear, coherent, and well structured academic essays demonstrating riical analysis and synthesis 4. Apply appropriate citation styles (APA, MLA, Chicago) accurately and consistenty in academic wring ‘5 Revise and edit wring effectively for clarity, coherence, grammar, and style 6. Understand academic integrty principles and avoid plagiarism through proper aftibution and paraphrasing 7. Adapt writing style to diferent academic genres including research papers, Iterature reviews, and critical essays 8, Provide and receive constructive feedback through peer review processes 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: ‘The course emphasizes wring as a recursive process involving planning, drafting, revising, and edtng, Students will complete mutple writing assignments with opportunites for revision based on instructor and peer feedback. Writing ‘workshops wil focus on specific skils such as thesis development, paragraph organization, and sentence level editing Peer review sessions will develop critical reading and feedback skils. Individual conferences with instructor will provide personalized guidance. Reading assignments wil expose students to exemplary academic wring across disciplines, 3. STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: [STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: 1. Shor Essays (20%) Four 3 5 page essays demonsraing mastery of specife wring skal 2. Annotated Bibbography (1%) Comprehensive biography with summaries and evaluation of 10 15 scholaty sources 3. Literature Review 20%) 8 10 page symhesisof research on selected topic with etal analysis 4. Research Paper (30%) 12 15 page original research paper wth proper documentation and formating 5, Peer Review Paricipaton (10%) Active engagement in workshop discussions and constctve feedback 6. Porto (10%) -Compdaton of revised work with reflective essay on wring development Examples: EXAMPLES OF STUDENT WORK: Example 1: Research Paperon Language Education Policy Analysis of mother tongue based multingual education {(MTB MLE) implementation in Phiippine schools with poly recommendations supported by educational research and ‘empieal data Example 2: Literature Review on Social Media Impact Comprehensive review synthesizing research on effects of social ‘media usage on Flpino adolescent mental health and wel being. Includes theoretical frameworks and research gaps. Example 3: Creal Analysis of Phiippine Literature In dapth examination of postcolonial themes in contemporary Fupno novels, demonstrating cose reading skis, textual snalyie, and engagement wth Merary eric,"
    },
    {
        "image": "courseoutline2_synth_14_aug5.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippines Diliman Quezon City, Metro Manila registrar @upd edu ph Course Title: As arces Acaseme eng Semester: Summer Tem Office Location: Room 228 Aone Boy Number: ENG 40! Year: 2026 2026 Instructor: Assoc Prof Traws Webster Office Hours: Mw 100 PM 11 00 AM 1. OBJECTIVES OF THE COURSE OBJECTIVES OF THE COURSE 1 Develop advanced research skis nckxdng Merate review 2 Construct compien arguments supported by evdence eal reasoning and approprate meor et 3 Wree clear coherent, and web structured academe essays demonstratng crtical analyse and synmess “4 hoon) acoroprate ctaton styles (APA MLA. Chicago) accurately and consatenty m acadernc arng 5 Revise and edt wrtng eflectvely for clarty, coherence, grammar and sie gies and avod plagaram Bough prover afr Buton and par acre a8G source evauaton and acaseme databases navigation a tamenons 6 Uncerstang academe niegrty pene 7 Adagt wrtng style to dferent academe genres nctsdng 8 Provide anc recene constractve feedback Brough peer review processes research papers, erature reviews, and crtecaensays 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: PROCEDURES FOR ACCOMPLISMING THESE OBJECTIVES ‘The course emphaszes wrtng as a recursve process MYON planning, drafing revang, and edting Students wf cee Soe areng assgrmerts wen copertantes for evaion based on natrctt and peet feedback, WW AD Se ee ccs on apecte sh auch as Dien oevetcoment par ay aoh cigancaten an sentence. 6389 Reet Niitons wa geveoe crtcalreadng and feedback skis Indiveual conferences wer nstructos w# 0 9\" eerccairec gedance Reasng asvarments wi expose students to exemplary acacemc wrtng across daceAres 3. STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE ote Faw 34 gage ennays aemanavatng mastery of soecte arteg 9408 Sper Eonar 2 Aenctaes Bono a0\" 2D teratee Raven 2 Comprererave anager Wem pemnaran end evmuaters of 12 S scmoury Farce cage syotnens of revench on seacted tape AA rte ARVN page vgn research pacer 22h proper soe meraten wns IG Acree engagement 9 wonstor sia artng sevecoment 1 Pew Revaen Panceator ft Ponte ote Complaton of wrens wan wt hah Examples: UOENT WOR ym Language Educator Potcy Anaiyes of moter tongue 2ane EXAMPLES OF Enero Researcn AIBA E| mpementaton n Pragpne hoon Enaroie 2 Ltgrature Raven on Soca aca stage on Fuge aacwscent manta’ Meda Impact -Comprenensne roves syninenzng research on efiects of tone! eres elke Incades mecreten tamewons and search ADs Euarpe 3 Conca! Anaiysa of Priore Lterature 19 cepm Plone noven demonsvenng cove jeaang ti Textual annie."
    },
    {
        "image": "courseoutline2_synth_15_aug1.png",
        "label": "courseoutline",
        "ocr_text": "POMGChi University of tng Phitippines: Sfaniis, Metro Manis inquiraggnun eau ph Cataiag Member: waTH 509 Coarse Title: Munmocsl Anatyais Year: 026 2028 Semesters rest Saraster Anstrusters Asst Prot kryalsiGieares Gifice Lozation: poo $73 Faw Olfiee Hours ave 200 PHA 308 PAE iy Pap 1 ORECTIVES OF THe COURSE omIEGTIES OF TH co 5 Unterand xewars ot mena se cites mdf ans, cava aOR, 28 cDapalon of eners me SenyRtatons mats 8 Aaply ete geome indy Desion mating, Nowa hon seth. sd seca autho te schon esd i 3 pieced epson scent i ys BYRON eee, se MAEM, ean Sah maeots 4 Soke ytaere of ten eps wing dines mates Karsins sSeinaion, Ll dexaencein) en Salve watunts (ieee Geass S40 5 Partum eadresre earl Soeetanion ang atageaon ig Fate dtrance formals, asc ate, Simgsesn ee, 6 ronan: 1, Seen ence atfecenad agustons mimes uting lars nasties, Pangesitts methods, ans savy cathe 7 Aaiyte sommgenen, tents, a aceuay of anedoatageote A ey meer! yoctners wing auming amgvaise tin ws AATLAB, Cyr, se 2. PROCEDURES POR ACCOMPLISHING THESE OBJECTIVES: PROCEDURES FOR ACCOMBUSHING THESE OBLEC TIVES: Lecturen wil arson? thesestiead faint of mun Sempuins tadvratary soraiono we torus on mages Surman cota Sludonte wil vemete programming axsigemenia raguins both atin hgesrnentaton and FQRRaeNs tnwyee if Ultorect metas, Protism aks ait deveioe anaiséea! vei i acron eslimation and agocen Skctn. Guest fetes tum invay rractikonore wa demsanatzaty atcata mx engesmri ant acetic commenting, 3, STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: ‘STURENT REQUIREMENTS FoR COURENON oF THE CORSE *Prstiom Sots ST) igh ansqewmcs ewan eon aaa, aunts 2 Propnmning Projets Pe) Few may gaits bnplemaatns 4. Wistar Eaamiowtion Sign ane cremey selesn, Sein wes 8 MATLAB oe Pham i eeomacae eanzaes Wien Ame oe moma marae any, ec save, 30 agen Getign Fa Prejas (Hj nt niet ata NAR! mais be HOLE eit ce Hngnnng sets Fed Camneaton {i} Comeeneive pease Een 3 cove tao 8 co eterno tia pe ensue eR Za8e, Examples: en eto soatysn. Asan ey Hcy paced MPLS OF STUDENT WORK: aie i tonate Metta» Agpictin of nomereit rw aguas Selves We Wintel esipatve Sonate ao unclet crete pci. Sols 8 eenoeesoeracy ane any Biman ODE towers Bre yas Sopions hoes Brana 2 Swonhira: ansivec Using marine sathogs tao systene ‘Shige etuennes. Payee erscer mesh gerwacan stony ot Exameie 2: Faxarsat Demeatons icing to mio Gnopian ana Annan etre Sea Marte Cat wna ete ttre mess. Anaya ses sievepnce sins fo asncnaoes eam nut ating ae Rte sme ssytk ot satiation. aed Wpeshsatcn esicese aaieadon"
    },
    {
        "image": "courseoutline2_synth_15_aug2.png",
        "label": "courseoutline",
        "ocr_text": "Polytechnic University of the Phidigpines Manite, Metra Karta inguitre pup edu ph Numaroat Analysis Cataieg Number: MATH Year: 2928 2028 Anstructar: asst Prat Heys! ‘Office Hours: save 708 sat Semester carts ihe Location: acon $73, Facony Sip 00 Pat 1 ORIECTIVES OF THE COURSE snvnoatee erin, an pinagatan of ences 9 sammpetnan! metho of naw ances asi net ee 2. hagiy eattningcigrthme Sonsing tactan neti, Nertes Pphsce wales oe sncar mets 9 toe Peniear egustNS a peymans tegen, ani nteplaton, a Wat 58 2. irdomer etapa and soeexinatn eahogin “A Seta ysto of iar auauens unig Sract maa (Gaxeegn aimsnmtn, LA decor powven) sn ratiee vans Parana sunasnal dereatinn an eter ting Hada Senn toons. apes nn, Smasnsy mie, we Gases 0. Sevecninay decent epoahons ounmscaly using Baers method, Runge na, at 7. Analvan cetwespoon, stat, soe Hecurary of cana prim glam ames agers wang mapa lng Buch 2M 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: DURES FOR ASCOMPLISHE OBIECTIVES Lectures wi mesa theoretical foundations of 1 tof analysis see comeeigance sete es realayors prc 8a Conputes ndors ms on knlerantang algae ard serge “plete preprsnining assigrenans vequring tet algorthen snpsemnataton and comparative jaret mations, Promee: sate val develop envi ination and signees 9 ang scenic Seienton, Guast lectures ‘rom musty granti eners wE demenetrate applications ix enojaec oma. SYUDENT REQUIREMENTS FOR COMPLETION OF THE 898: ght ascigienents aero ee SS, ypiten Sean, nsiamantng wane metneds MAYS er Pyttra with patennae samen FoR e0 STUNT REQUIREMENT Pain Ss 2 Progaming rons OAM Fes nee poet 5 ined Basan CR) Wines ea MeN Ma they erable gona ethos to ove 8 renene S spea Or engnaneg ZOE a ende stesso must role pre Cusumantation tet aes, and ane: analy. Beane teary atoy eared. saat (98H) Gomeraeraive exan ences Examples: SEMELES OF STUDENT WORE uaein {: Cimate Yong Arpiatton of omen Gente pattaens. Sheets on someae aese ‘beanie 2: Swat Anaya Vat satan hogs te shee yen of equations siting om fnte amas shai brags tnncaces, Pact naanas ssh penarain ainaye missense, ans qsualzabon ot sess Gabon femntid squaon saves to made acacatare changes Bed Aoinsey of tent ODE covers 9 eciyze rgtem Hab; carpi Ponsa Onceatons Png impnmentaten of nanan eragraton watiass ta wie Ewsepadn ana hecescan cnc seep tote Cae seve ie fave sifeeen natonds, Avy routes cemeapione syns sd compasnars Mais"
    },
    {
        "image": "courseoutline2_synth_15_aug3.png",
        "label": "courseoutline",
        "ocr_text": "Polytechnic University ot the Phiippines Manila, Metre Manila \\nquitatgouo eau ph Catalog Number: HATH SCY Cowrse Tithe: Numerica! Anata Veor! 2028 2025 Semester: Fest temester Instructor: Asst Prot Kiyste! Edeseds Office Location: Rewn S75, Facuny Sy OFFice Hours: NrviF 2 00 PM 3 00 PH 1. OBJECTIVES OF THE COURSE: CRLECTIVES OF THE COURSE Undid srtet f mane Or met RARE Re: MENCATEE OPN DE eRNGHEOR EU BORNE mE 2 hgety tating erens melting tation memo Mewtcmasheen memo, At Rew trate ie ROOT SMS 1 tmstemet sages od AETLeCR AR BemNY cay RO NETIC, WAN SAE A! AON URNS AM eve ayo of Ser eaten tiny Sat retro (matin gomnton LU Geman ane Raraore meBeOS RECHL nae tee etn mre rn eter sae ne tm, pan enews om wt Gowan 8 cee ner Ate squteina mere vomy Edm tas Mengetta meen a onaRBNAG MeO 7 Avayar comers Habit) wd Rowecy of someon Syoreern 1 lars mere pect wg tapering Semygns HA om MATL ON 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: PROCEDURES FOR AOCOMPLISHING THEIE OBJECTIVES. Locires wl preven! taucetcal hurvassuns of nurses! setheds ainig «AN ert aye and convergence DOE Comnde ubceatury sexo sil focue cu smeiacrantng sporstane an woNng rtrd OSD mo) ComURaDOnas some Sasceen eA COLMAN OTF REG APEC ENE TENE DIN GGT ORIEN ae comparatire ene of Pert cwthece Probe sets Seven wea eaf 8hte Meer esterases aint ayer pemeien Gust conan bare MAasy practioner aA demoreual application 1 eEneerng asd Howie comet 2. STUDENT PEQUIREMENTS FOR COMPLETION OF THE COURSE: STUODIT REGUARMENTS FOR COMPLETION OF THE COURSE 1 Prathen Sats GT Dit arenes Goreng ao Br. Rpt BENGE. mH CaNeER MEH 2 Penyametng Pyech CEP) Fore mane pets malamarieg enae matte m MATLAB o Pythan wh pedemnance eemsanase 2 eon Examioaicn HTK) Cae wa Mae ES ery A Ara, ane ager eS 4. Peat Propet (AP) ner eget ainng manana ments We ¥iNe 8 rahe cemcchs er ennamng Brisk Fat aso (V7) Compuameraies mas onary ok ome Mee 25 cate ssronens tn late ou Mkcmantan LaN ek, and cr amy Anim teary Benth stems. Exampins: EAMES OF STENT mR Exsnuie ¢: Chena ttetaing -hestetans a rewire esa savers te me pre SangRE As Bt ‘Sirce porwcnd, Sideoes wd compare messy act thames of Sant ODF Hebron ane anya fngte” NABH, Cuvee 2 Shuman heey «ting Nene mocheds fe whe syste of austore anag tw Sra ane wna ot Satan saree, Pret Potces avh Summ aha, PLN AMEE ERRACIED, a VGUANRRLCR 9 TONE ARS Ensaje t Frasca Devan Pn letemtstatn of maase eteppriin mutate Me ree Lice wel ence eg Sng shone Cats hematon on tre Cerne nthe. Anaya Watcs Conwagnce Sc: we SOMA TRY oeewnet"
    },
    {
        "image": "courseoutline2_synth_15_aug4.png",
        "label": "courseoutline",
        "ocr_text": "Polytechnic University of the Phiippines Hanita, Meno Manis inguire nup edu. Catalog Number: MATH S01 Course Titt Year: 29) Semest s Instention: asst Prot Krysiai Cowarde Offline Lacation: Room 73, Fansty Gely Gifice Hewrs: seve 2 00 PM 2 00 PM. 1 OBJECTIVES OF THE COURSE os ecTIvE2 6 HE COURSE os ohlng oundeiteore, Moming ss, 308 ahs inp Js systers ot fret equation See noiosng Suectau mained ‘ewer Resiaon owned, sia secant mathe to tive onkheae quan ‘erepoatna aed ay sieyaion eanniques Wang semi intaplaten, opine mlemaiaen. ang hess agnnee sg aecetm 15 Pacium munasensdtfeeriston an stegraton ung ite Geen femmes rapes nue, Sonuaeits we, sie Coveninn we Beinaty inal aquations numefaahs vag Hare ated Rurgaststa oethoes, snd nanan matiogs 7. Aeairae senwurgence, salty, sat aceurary oF namesso! lentes syptiois using pezeamering Sagiagas sua #8 MATLAB, Pytbon, Ogee 2. PROCEDURES FOR ACCOMPLISHING THESE GBIECTIVES: URES FOR ACCOMPLUSHING TH! anaaysts an cot orale anni sobvity reabward profves usa rmting assignments recuiing both algorttn implarreniaiken ard leshon, Gast eclures from incustey 3. STULIENT REQUIREMENTS FOR COMPLETION OF THE COURSE: THE COURSE sarang ance aroiyss, agui dene, art LOENT REQUIMEMENTS FOR COMPLETION 0 5. Petia Sets 548). Hate asogen ea ning Pract (Wit Five nner eavatsimpleneing ums tod Me TLAB or Python wth petemanas comparion 2. Miarm Examination (20%) Ninn econ cn minaret eds teary. ee naive gunmen ees st nets $0 4. Fira freer (28% nsec pect apa a reshworé siento) enghusing sooem 5, Frat Gxainaion (OM) coven es one -9pa deaumansation tas cases. ard cor alysis. Anadonie inigtey stot wnlrsed Examples: STUDENT WORK Examate 6 Chinate Ming Ansicatnn of xamsieat Sone pares Shades si tampare aeeuaoy 9 vi Soh wo mee emirates enages ae peek Gey oh forse OU sons and sone ang tern stay esha Suelo Arey sng lange stuctres Fro} Sxeniete st sony Monte Caria auiaian rats i eve ryatenes of equations ansing iu nie elem ana of cides ish yout. aiFee Tnarte oamulaun anu vzogigaton cess Gaiman ‘Pring nplemsstatien ct mumeness svegentan meted fe gnive Eve ane Senetnan ‘te iSteroe methads, Avayns naiasen sowemgunce aser ws competaicon ena)"
    },
    {
        "image": "courseoutline2_synth_15_aug5.png",
        "label": "courseoutline",
        "ocr_text": "Polyteshaie Uni ErSiy OF the PNppings ‘anita, Matro Mania ingens cau oh fataheg Member: wary spy Souree Tiler Rucancal Anan Wear 26762026 Semester: ts somcaer instonctor: Office Locating: GFtine Hears: iysts SL Ot Kivstel Cihwaras MEE 206 Pah a 0g pag 4 OBJECTIVES OF THE CoURse RSE Cau ne tent can pir at Senwcaton sn age ig etn cen, sacionne APHEEGS fe, Sonpsons nie gs oupien Soke wine dient acute penutnahy SARS Te yet wns wn muha nny neo egeitane 2A cron aay ad sco, 2 steer nae sgsttion op SES eng hath 8 ATLA. Ppt, oe 2 OROCEOURES Foy ACCOMP SHENG THege PROCEDURES Fem acco suits Tp Lactores wl preset tor siess E2mivioeiahorsices azeniona vl teres OORT VER FS FOS COMM ETON GF Fe Fesslac Sees (2 Gite assgnctens, stoning ee arate A ot carvers anaiie 5 Rterning tis We) tin nae eainin mpueen BOM A KE Fest setscancesampain 5 tern Exzacreen 2% wets exam ‘snow mats or, 4 Pit Prague 28 sea. A ae Sg “neta chaens ad pret Nest Reais ‘nage ostcnn, Paes E estions asian ton Se aioe ais 24 a es ees tes mates gs ae ee tomes ainsen Sate 8 Bamist etctves Pang mamma 28 Morse Cw somata 80 of eon meget ERS ence rset. kts ase aos ts fe nee Burts un hice pss NS sea not coca haan"
    },
    {
        "image": "courseoutline2_synth_16_aug1.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippines Oilman Quezon City, Metre btanlia register upstedsi oh Course Tite: Physica Chemiatyy Catalag wumber: Year 202 388, Bam Bit, SECTIVES OF THE COMMREE: S OF THE COUR, 1. Apoty laws of thermiosysaerace ts analyze chemwat syatenis and pvedtint spertanes 2. Cobulate thornodyeamic properties eluding enthatey, 9. Understand presley of chanical het nine vate laws, rake Constants, ard activation energies §, Angiy quantum mechancs concepts 10 naqhen stumia sre moizeuia S. Grayne electrociaente 6 Understand ahass egal anc apply phase diagrams io predict system setavex 1. Aggty slabitica! thermodynamics to rote m isto streactons DY, as cr cheneal processes truce and spectroscopy Se am calculate oat oateneals uamg Hemet equation ular properties to macrascopie ehwsrvaee emtry tosis to model malacuiar structures ne prncict plepurtiee 2, PROCEDURES FOR ACCOMPSISHING THESE OBIECTIVES: Leche wit preven theccetes! ptinibies with mashamvatical derivations snd reat word aapieelions. Protken solleg sessions wil device Guantiaive reasoning ans conputaicnal okie. Labstatory experiments Wl gov ekyenzace measureg therm mn mechani phenomena. Stasanis wi ove vunpeaations! caicuite srocerten, Resmarch caper presentatora ws ercose 3. STUDENT REQUIREMENTS FOR COMPLETION GF THE COURSE: srupe7 eae ipemnte With aut analysis, 01 calcu. Paris GSR fe Sty See arpertes sh Catdaive anam oating mma tones tabersery atentarce rvaty isampies: vane oteets mest be fed, Lite reports pend 2 peed OF SPURENT WORK: of Prats Tttans Eero! deeminaon af ethass coricaraen 2 itrsine Mors a taatetcal eens deren charges doing phe Parise 2: Kee i Cramait Ranchers -lnvestatn eaoh Sted Rance en ates aber aay nontions vesing wen te egy 09 reann ecnawms vay Arians Secon Cortese ect Des ones eo ne etary acre De ate cect secretive,"
    },
    {
        "image": "courseoutline2_synth_16_aug2.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippines Diliman ‘Quezon City, Metro Manila registrar upd eduph Catalog Number: CHEM 501 Course Title: Physical Chemistry Year: 2025 2025 Semester: First Semester Instructor: Assoc. Prof. Philip Griffin Office Location: Room 344, Admin Bldg, Office Hours: TF 1 00 PM 5 00 PM 1, OBJECTIVES OF THE COURSE: (OBJECTIVES OF THE COURSE: 1. Apply laws of thermodynamics to analyze chemical systems and predict spontanety of reactions 2. Calculate thermodynamic properties including enthalpy, entropy, and Gibbs free energy for chemical processes +3, Understand principles of chemical kinetics and determine rate laws, rate constants, and activation energies 4, Apply quantum mechanics concepts to explain atomic and molecular structure and spectroscopy ‘5, Analyze electrochemical cells and calculate cell potentials using Nernst equation 6. Understand phase equiibria and apply phase diagrams to predict system behavior 7. Apply statistical thermodynamics to relate molecular properties to macroscopic observables £8. Use computational chemistry tools to model molecular structures and predict properties 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVE: PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: Lectures wil present theoretical principles with mathematical derivations and real world applications. Problem solving ‘sessions will develop quantitative reasoning and computational skils. Laboratory experiments wil provide hands on ‘experience measuring thermodynamic and kinetic properties. Computer simulations wil visualize molecular behavior ‘and quantum mechanical phenomena. Students wil use computational chemistry software to model molecules and calculate properties. Research paper presentations will expose students to current developments in physical chemistry, 3. STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: [STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: 1. Problem Sets (25%)- Weekly assignments invohing calculations and theoretical derivations 2 Laboratory Reports (20%) Documentation of experiments wth data an ysis, enor calculation, and dscussion 2. Miterm Examination (20%) Comprehensive exam on thamodynamies, Kinetics and quantum chemistry 4. Computational Project (15%) Use of quantum chemistry software to study molecular properties 5. Final Examination (20%) Cumulative exam covering all major tpios Laboratory attendance mandatory. Safety protocls must be folowed, Late reports penaized 15% per day Examples: EXAMPLES OF STUDENT WORK: Example: Thermosiynamie Study of Phase Transitions Experimental deteminaton of enthalpy and entropy changes duing phase ‘transitions of erganie compounds with comparison to erature vales and theoretical preston, Example 2: Kinetics of Chemical Reactions Investigation of reaction rates under various conditions incluing temperature concentration, and catalysts. Determination of activation energy and rection mechanisms using Arhenis equation, Example 3: Computational Modeing of Drug Molecules Use of density functional theory (OFT) to caleate molecular geometries ectone properties, and binding energies of pharmaceutical compounds. Analysis of structure activity rlatonships."
    },
    {
        "image": "courseoutline2_synth_16_aug3.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippines Diliman Quezon City, Metro Manila registrar upd edu ph Catalog Number: CHEM 501 Course Title: Physical Chemisty Year: 2025 2025 Semester: First Semester Instructor: Assoc. Prof. Philip Grifin Office Location: Room 344, Admin és Office Hours: TF 1 00 PM 5 00 PM 1. OBJECTIVES OF THE COURSE: OBJECTIVES OF THE COURSE: 1 TN odyenie anys cana sysems a de senna) SE 2. Calculate thermodynamic properties Including 3 Understand princes of chemicalknescs and etre rate BS, 19 4 Apply quantum mechanics concepts to expan stom ast molecular structure and spectroscopy ‘and calculate cel potentias using Nernst equation dagrams to predict system behavior slate molecular properties to macroscopic observables model molecular structures and predict propertios 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: cROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES Fae eee cent ooreiza rns wih mana a 0 5 oars oes and computational skis. Laboratory experiments 9) provide hands on ‘Computer simulations wil vis roperties. ‘tisents wil use computational chemistry software reopments in physical chemist. hanical phenomena. ‘presentations wil expose students to curent ev Salou properties. Research paper 3, STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: senior sets (5%) Weel assignments inohing castors 24 ee ecvations 2 Laveratory Regrts (20%) Documentation of experiments wih da cero caledatin, and Bs0 55i00 4. item Examination (2%) Comprehensive exam on themasinanies veaaona Project (15%) Use of inti ces setae 0 SY molecu properties umuative exam covering af maj Tones must be folowed. Late reports penaized 15% per 62 4 com 15. Final Examination (20%) Ci Laboratory attendance mandatory. Safety protocols Examples: [EXAMPLES OF STUDENT WORK: Example 1; Themadynamic Study of Phase Transtions Experental determination of we inecatoe values a theoretical pretons reaction rates under varius condos ncn tempers cee euon mechanssms using Aeniis equation. theory (OFT) to calculate molecular geometries of stetire activity reitonshies. ‘Example 2: Kinetics of Chemical Reaction «vestigation Exam Joon snd coats. Determination of activation ene Molecules Use of density functional Example 3: Computations! Moding of Ov 0a 7 pnamacedtical compounds, Anas"
    },
    {
        "image": "courseoutline2_synth_16_aug4.png",
        "label": "courseoutline",
        "ocr_text": "University of the Phifppines Oman Qusznn City, Meso Maria reqesrar gpd cts BE Course Tite: Payscai Chemisty catalog hamber: CHEM ET Meat yIh 2025 Semmeuter: Fast Somaster Sitter Locwtine: Aowaikt sane Bale Anstrwctar, Asse, Prot. Praip Gavin Oilica Horst 7F 105 PME00 PM 1. QBIECTIVES OF THE COURSE OBLEC THES OF TRE COUR! 1 ugly ao of atnay nae cata sty orpentag wets URAC, TA ES ph enernices anscs 873 SATIN HE HENS so exci ana and potnsiate veg Nernat ee berets ps st cd mony eee HEAT pest oyun banat emiecuar grapes fo raerepeoge MEET ADTS 2 sy abate secrecy FOIE fee coinpaahoras berry 0 29H SE rnataces we gendint BETES nach preci epemtorntg SST 1 Gian rae energy aie coma, on 950 a ppeetoRcORE 5 ve avatyns chominis sy sign energies +3 Unrgenutand PATE 6 fagty eanctone mectance COMEE A sina sectuchensaal cats ane cai ssts OA oe aru >, PROCEDURES FOR ACCOMPLISHING THESE OBIECTIVES: pApeERUIRES FOR ACOUMPLIGHING THESE CQsgecTWES ‘cechares wh pwr tnaoctinat PHENO srotmarmaneai cure an sr rors ADOT pretaers eng Lee wah che emnSD EDS A ir yond Later, eae SOY ane aasmraace tee 19 eee mae KM AES raperien, Corner seta WB VS rege setae rae greenness pererene SNES OA Sa cecy ese ode eae we Gane proper. nsaCch GE pO 2 Cre SST 9 SETOEK WORT hones esti Lop. COMPLETION OF THE CARRE: 8 ORE: vas a ae SOA sa enat radar, BS SABO 9, STUDENT REQUIREMENTS F eran en REARURENENTE FOR COMPLETES OFT wpa ate SENS eh ensigns NOE nares a enone 820 7 OY 2 nenatrg Rapes GT OOH ren (is) Conpanenct wa oO ATA SERES aed even sry aoe eb unin cum sere may REA EE oven BRE AS 3. min Hs Seances vst canst are oo Sa penne 1 or Feat vpanaeny sore mai. Sess gHeRSD mae MS ene 0 0 Exampies: seauaryes oF TRIBE HERR raion Ragen teen ck mes HDS NEE ory wos reserves se eatin en eg a EN aia Damen a pens seg Ah CEO eves wate oi egret Texas eis Chan ERECT a Tegal caus. DINED SBN SE cee compan wo vy Mama I A een ey OS) a ean we SI tn snes aes a Se aay abs eosin pera,"
    },
    {
        "image": "courseoutline2_synth_16_aug5.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippines Diliman Metre Mania Quezon Cl reise cup Satalog Namiver; CHE SOT Caurse Title: Paysicel herni Year: Semester: Fist Semester Sastrartor: assoc Prot Pntip Gain Cbfice Lacetian: Room %44, pana Bee Oifice Heer TOC PMAS 00 BM 1, GBIECTIVES DE THE COURSE 7 1 opoctaniay of seactoes 42, Cacuinie therrodynamic prapertie Inckaiing erthiny, oalrony, ane GOs Yer enact for chanical srocestes 15 Underetand pencinkss of cheies! erates and determine rate ums, vate censtats, ane acts ation eneegia 4 m meechanon concepts 9 expan storie and meiecutar mivusbne and apecinset amy 6. te col potentiate using Nernst exuston 4. Unsevatend prase atutiei aort apaiy orass diagrams to predict eystemt hehavier crosuopie cbuervattit 7. Anoly slatatica! hermogyracics ip raise metacilar aricesties th 4. Use ceerputationsl chemistry fouis fo modal metiuatar attuctires and preci pxapertine 2}. PROCEDURES FOR ACCOMPLISHING THESE GE IRCTIVES: z 8 CRIECTIVES, Lecnures wd gvenont theoretical pe pins wth me ai shetations and can werst unpicatiane, Probie uoing Fore wit evel quamtantwe rearing 20x compatens! skis, Laboratory exparinerits 28 provite bane inermody raisin and tucsie properties, Computer simulates wit visuaice molrexdar behave eeftwars lo meal meiscues sd ni Sevaingsente bs priya! cheitty es gue phan Salodate promertiee Receareh pagar presentations WE exears suitorse bs cu 2. STLIDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: OF THE CORSE \"UDENT REQUI 1. Praber Ses 25%) Wey algnmenis ching eaeuisions ard Ore Sevstons nee glean snd Ansostice 2. tatonetany Reger (29%) -Oorumertation axpernents wih data syst 43 itary Gvancoon (Ss) Camynebanai gaa om Derma AGTEDS, RRR, 28 Gane ny sro Pre (to) ise of svar eaniaty aftae yo Moy milan Guopaes jing vio toes 3 Fe ecty siaraucce sory Satety petcoeis seat amiion (2%) Coestve ax wet Late vesats sonsisn Examples: atey i ty etamges Sunny se ‘Tournuarane Stats of Prana Teanutars Exponent’ decent oe Remo t SGorations @! gigs covapoards wth Sonate to Wrsire ule MS ere areca. 1 Hew of Charis Resco nuasiga of wegen nes us vats conons eke tener in ane owaye s Deven igen of atnvastn sean ara scan aeworgms wing Avant equates 1) le owouate nee pesnsee egervs oF Souctoesneey PENSE Eran 3 Gceesasona Moeng Sectens pripeces, a15 Bact eneyes EAGAN eANDEN,"
    },
    {
        "image": "courseoutline2_synth_17_aug1.png",
        "label": "courseoutline",
        "ocr_text": "Central Philippine University Hilo City, loilo admissions cpu eduph Course Title: strategie Marketing Management Semester: Second Semester Office Location: Room 209, Facuty Biss. Catalog Number: 8A 601 Year: 2024 2027 Instructor: Dr. Michael Harris Office Hours: jw 3 00 PM 5 00 PM 1, OBJECTIVES OF THE COURSE: OBJECTIVES OF THE COURSE 1 Analyze market environments using frameworks such as PESTEL analysis, Porters Five Forces anaysis 2, Develop marketing strategies based on market segmentation, targeting, and postoning (STP) principles +. Create comprehensive marketing pians including siuaton analysis, objectives, strategies, tacts, and metrics 4 Apply consumer behavior theories to understand customer decision making processes and purchasing patterns 5. Design tegrated marketing communication campaigns across mutiple channels including digtal and tracttonat media 6. Evaluate brand equty and develop brand management strategies to buid strong customer relat mance and RO! 8, and SWOT tonshins 7. Use marketing analytics and metnes to measure marketing perfor 8. Understand ethical and social responsbity considerations in marketing practice 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: ‘The course combines case study analysis, marketing semulatons, and practical projects. Students wil analyze Phiippne and ternational marketing cases to understand strategy formulation and mplementaton Interactwe rarketng simulation exercises wil alow students fo make strategie decisions and observe market responses. Group projets require development of comprehensive marketing plans for eal or hypothetical products. Guest speakers from marketing agencies and corporatons wil share ndustry insights and best practices. Class discussions will encourage ‘tical thinkng about contemporary marketing challenges, 3. STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE 1 Case Anaysis Reser (20%) Four witten analyses of marketing cases with stratege recommendations 2 Markatng Seulaton (15%) -Parscpaton in compete marketing smuaton wih team decision making 4. nevis Marketing Pan (25%) Oevelooment of comerehensive marketing plan for anew prosuet or sarge launch 4. Grou Presentation (20%) -Team presentation of manutng stategy for an assigned Piizone comsany 5. Fina Examaaton 20%)- Comprehensive exam coverng mantng concepts, ramewors, and appicatons -Actve clas partepaton expected. Al wntten work mus flow APA famat. Peer evaluation for grove Wark Examples: EXAMPLES OF STUDENT WORK Examai |: Laren Svategy fr Eso Frendy Posies -Siuerts devegp manetng nla fr sutanave consumer goods txgeing nuvonnenttyconscous Fuge moma’ Ices mare esewth conpettne rays postoncg Svaeyy. ard tegrated, mmarceing sommestons pan Exangl 2 Dita Massing Campaign Loca Townsm Deng comorhensve pt mang conga te premate Prigone Inaat estan te nemo maves rote! coves $a esa Haag. cote! aneing, ArueCe bareshes, 2 petermarce meres Exangl 3: Retrandng Steg for Trastanl Fipre Buscess Araya ese tans seccnmendaons for mosernaing Band mage of ‘established local company while mantaning cultural authenbety and customer loyaty. “e se"
    },
    {
        "image": "courseoutline2_synth_17_aug2.png",
        "label": "courseoutline",
        "ocr_text": "Central Philippine University Woilo City, Nollo admissions cpu edu ph Catalog Number: 84601 Course Title: seatege Martetng Management Year: 2024 2027 Semester: second Semester Instructor: pr. Michael Harris Office Location: oom 209, Facuty Big. Office Hours: ‘vw 3 00 PM 5 00 PM 1. OBJECTIVES OF THE COURSE: OBJECTIVES OF THE COURSE: 1. Anatyze market environments using frameworks such as PESTEL analysis, Porter s Five Forces, and SWOT anaiys, 2 Develop marketng strateges based on market segmentation, targeting, and postonng (STP) prnciples 3. Create comprehensive marketing plans including stuation analysis, objectves, strateges, tactics, and metrics 4 Apply consumer behavior theories to understand customer decision making processes and purchasing patterns 5 eign btegrated marhetngcommunizatenconpugneexrove mative channels ican Cf ond tesona 66. Evaluate brand equty and develop brand management strategies to buid strong customer relationships 7. Use marketing analytics and metrics to measure marketing performance and RO! 18. Understand ethical and social responsibilty considerations in marketing practice 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: ‘The course combines case study analysis, marketing simulations, and practical projects. Students wil analyze Phiippine and international marketing cases to understand strategy formulation and mplementaton. Interactive marketing simuiaton exercises wil alow students to make stratege decisions and observe market responses. Group ‘rojects requre development of comprehensive marketing plans for real or hypothetical products. Guest speakers trom ‘marketing agencies and corporations wil share industry msights and best practices. Class dscussions wil encourage Ccrfical tanking about contemporary marketing challenges. 3. STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: ‘STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: 1 Case Ansys Resorts (20%) Faw wetten anayses of martetng cases wih statege recommendations 2. Martetng Semaaten 18%) Partegaton computive martatng season wah tem decaionmaking 2 inset Martetng Pan (25%) Devetopment cf comprehensive martetng plan fr a new product or nerve imneh 4 Group Presertaton 20%) Team presentaton of martatng stategy for an assgned Phicone company ‘5. Frnt Examination (20%) Comernensive exam coverng martetng concepts tramewarts, and appcations Actve cans partcgaton expected Al wrtten wont must folow APA ormat Peer evauaten ter gous wort Examples: [AMPLES OF STUDENT WORK: Examole Lauren Seaegy fo Eco Frandy Products -Stesets devon mantetng lan fo sustanabe consumer goods targeting ervrormertaly comscons Flpre miler (nests Mane! eseaen conpettve aaa. poutonny Svategy ane ntegated maneing conmacators Ban Example 2 Ota Martetng Campagr for Local Towra Deng comeronensve gta! martetng campagn to promete Pragore tows cestratons to etematona martes Projet covers Soe mesa $ategy cortet manwing rfuance’ Satrerhes, and petomance meres Example 3 Retrandng Svategy for Trastona Fupo Beane Ansiyss and recommendations fr mosemang brand mage of ‘estapiahed ca comsary while martanng cutew ashertcty and customer ey aRy"
    },
    {
        "image": "courseoutline2_synth_17_aug3.png",
        "label": "courseoutline",
        "ocr_text": "Cental Philippine University Holle Chy, Hato adminsioos epu edu ot Cetalag Number aAcot Cemrce Vale: sexy Momeeng Management Yeats 2324 2527 Semester: second Semavter Instructor: pe sachet Hace Oifice Leather: room 293, Fess ey Offlen Hours: an a00 Pie00 Px 1. ORIECTIVES OF THE COURSE: OINECTIVES OF THE COURSE 1. Aiahire mare: wrveenscerts ating tremeszerrs such ae PEST, anata, Prior s Pie Forces, ana, 2 Gevsiey maicoting statecins hased on market eagmoniaiin, tuigal 2 SWOT ahd poattiontng (81) acticin Grashe comprehensive wavheling jane nckitg shuaton analyst, obiatives, stadepins, totes, arc neice 8 Booty camaisnee ienstir thence te anserutand customer deciecaauking pracesees ana purchasing patteons Baton itegraiec marketing ccmmmimicanen caeriaigne acroxs nuilifin channel inckulag gl ane aderat moet 5, Evaluate vaca aauy sn devon brand nunaganen ataiaes to but otcng custnanescalabomatine 7. Use marketing anetyies ao meting 2 neamite rasketing porioirsenne ans RO ©. odersiar atic! ond social cospesORty considerations n neeriatig yractoe 2. PROCEGURES FOR ACCOMPLESHING THESE OBJECTIVES: PROCEOURES FOR ACCOMM SHINS THESE OBSECTY Pa gte Lonnie oe Shey sraiynia, aciating stein, aed pacts Brae. Stxtecbx nA ona Pent and Ktomatonet marketing ceaes to uservtand sualegy faroutston anc mphomattaton, worn eset tinaeton evaeratea wi Stan stodents ti make stratene decinits gout ohsenve musa ceegorae, Grog Baosie teams oncsksmant ot zamprevecrve earkeing stens fo veR youre peDKeS Se Srna ae nt St caxporatces Wi nhere mas sc ls and hawt waco. Cane dacusetton we orccceee Sits tank wow canteeronaary muanketng chalenpes 4. STUDENT REQUIREMENTS FOR COMPLETION OF THE CoUNSE: ‘STUDENT Rao RISRENTE Hat CORMELENON 08 YE CORRS 1. Qe ama Ragas (be) Fe antes analyses of eaten 2 0 oi Lag seaman 2. Naehing Sri. sndaton ih tan sexivonenns I) Bevtiogmct af wampatnave asd ats ps ie 3 re 4: Stowe Prasersize (M4) Tas pression of saetng 3 Fret Examination 22%). Corzine exam S37 Pathan comet arr AOR for musics Pipe eangany Soveing arbesng earapss, Sammut, and apwistees Renate pareiption geet AB ween wth tet bce At mal. Pea ening ha grap eae Gamipios: Seseias oF aru ANF won Secon onc Te eS PRN Shae etin ang He cts sans gs Loge Sone ene Pee nace maser meen, sompionte seas, ooking Toe, aE anes careening fen Ease Disa! Rikaing Comsat fate stsieatons te tossing st sehenarse cates ene \"ecm anes eamoraeoeics gia en ig ene 0 roc Pepe egeat covers case mat sain, eartrt tn eG. hoon Beem. AN Saangte 5: Rescandng Suatgy be Teas! Pome Bases Analy an Srubhska iaal somtane aie aieasing caoeRubentithy aoe mercone te sero Yr mmm brant mage"
    },
    {
        "image": "courseoutline2_synth_17_aug4.png",
        "label": "courseoutline",
        "ocr_text": "Sentral Philippine Unive thse City, Holla sity admissions ieat anu pn Catalog Number: 64391 Course Title: sestusis sawing Management Year. 20247027 Semester: Secons Semester Jesteuetur: or ncnaei Hane ‘lice Location: sac 208 Fanay By Office Homes: sey3 00 Pu su0 Pla 3. OBJELTIVES OF THE COURSE is 1. Analyze makes esvivorments using frinewerhy auen 25 aaa 2. Develop manrsting strategies need 0 market eagn 5 OF THE COURSE: in Poster s Five Forzae, ane SV tien, geting, and postin (1 pclae ‘Create comecshonsive raankeing piens mmiucing sisaian anatyers, obeetwes, stialegie 4 Aoply consumer benavier evies te underetsnd customer denision making eucesses and ourchashig patente Dove nae ated marketing somnunication campaigns acros nauk channels iveksting Catal ane! taco tacts, at metrics stiais brand eauty ana deveion brand management strstosies to buat atreny eustemer eelitensnion use marketing ansiyth sand meircs to measure murkoting cerlwinance ang ROL 8 Undorntand siticat anc social weononeitbty zenoker ations Kea oractioe 2, PROCEDURES FOR ACCOMPLISHENG THESE GB TECTIVE: PROCEDURES FOR AOCOMPLISHING THESE CIS IEE ‘he centse cambios ase slacy ansysis, marketing amuttiinns, a pastes projects, Stutente wi anahze ieane ara itersatooat marketing cases to untarstand siesingy forulacan and mcementaien, terest frarcotng simulatin exnrcices wil anor stucents Io make state denivions and okuarve marked rasponeds, Group repo rogue dey of coinprensasive marketng plana tor raat or hynuihetioal routs. Guest miarkatiny Soensios ere cornovations wa stare acusiry UUs and best practises. Cinen Geciruions we encourage ental eng abot centereperary markateg 3 STUDENT REQUIREMENTS FOR COMP, STUDENT RrquiReMENT VION OF THE COURS FOR coMueTia HE COURSE ase Posies eps 10S) Fost analyses of makeing spaes wih sete secamonenaaians 2 Maketrg mast 605) icpahen A competing manatig senso wth nae decison mating Htaseeing Pa 2H}. Brvelagevent of eorieehensiv raving pla fo ove pot oso bah )- Ta resent ef massing satng Pein ne Coarehenwive anc cmeniny mavaring occas, Hamsescns, ax! snpicetons vs iA parinains axpeue# AS writen work mt low ABA foot Examples: np Prevesti fae sess ey 2 Eracrnnion 2%, ae eiahatnn tee om c0 EXILES OF STUDENT WORK Exargin 1 Lawes Srteyy Stoserts aap matey be for euctanobla seminar govc rgeling Ws sek sews, socal analyse. ersten vetegy, a2 mlepates erthansie da stating sagan te pemane Prange sevaions! mkels. Prac eves £06 OHSS Hemagy, carte artalng whore saroarysne, soe Erangie 2 Retconnig Seatays Sov Traian Heian Ruumees ~Aayus ace ‘estanistad ine? ampany whie maining corn mubectaty ad euaromer yay vateaons for raster Bra mage ot"
    },
    {
        "image": "courseoutline2_synth_17_aug5.png",
        "label": "courseoutline",
        "ocr_text": "Central Pris pine University oti City, s 80u. ph Saeot 24 2027 Bastrecter oe jig O89 Howes: guy Stes testing Monageran Second Semagy Office Lecations: ai Kans, 00 PRS. a0 Pap oe Poona 269, Facssty Bip EOBIECH YES oF yup couRsE ECTIVES OF THE cour, 1} tosivze masts enatisis Westen using Famewarks such ws PEST ey Laat Porters Fe 7 2, Deevsto marten 8 Create cunpeeherce mack 3. Boty cana, one SWOT hove on market segmentation taosting, end poetionieg /$7 Sg DANE ekg oi Princes WSO anesis, steven, gt Doha Beries fs uicerstant custome, eclnien maing pesceases, ape 5 Bee wtoarated macasing SON com poee across i 0 charts oy sda eter teen bt Steg cece Fetincemiss iS Ke PNG MAG peretrtance ang nen SOO Testy comaiterstions i ma eg 2 action PROCEDURES ron a COMI ISBT THe PROCEDURES Fam accom scene THe ihe cowe combines cx SE OB IECT yy CRECTIVES, Frsieets resuare gey, Tanketeg spenewe a Seal aE aby STUDENT REQUIRED ONT SauSEMENN ENTS SO Cony FOR Setar 5 (2%) 2 Micke Seentainn et LET EO NOE THE CUE Re Casa Aosspis Rept 3 Wins Banaing Si 3 a th Year se F manny state 5 Ceteohenase ancy SOE AS te 8 ttn An famoy ny aipies: 8) Ceasinceot ot sara \"0 Pesenate 4) 9 Beste eee math 1 3 een Pete Fat Esa iy 8 Cia racinut BANPLES OF SCENT Wenn: Ess00s 1 Lah Sretegy fz Bec Scvtommaseaty ascacasn tigas eheing cemmicicanon sae Eserote 2 Osu SSSR satan crctne goose peng SURE aire ocean ‘ieuty, et sg tase er Daensatr te es ate cia. Brae Sat et SE a9 arn womany on (PA seis, caan manta poe eel SO Rats Ass nosemensaing Pa sees Stal tease ent ectenes ee"
    },
    {
        "image": "courseoutline2_synth_18_aug1.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippines Diliman Quezon City, Metro Manila registrar upd eduph Course Title: Advanced Academic Wrting Semester: summer Term Office Location: oom 573, Science Sida Catalog Number: ENG401 Year: 2026 2027 Instructor: prof. Lauren Solis Office Hours: Mw 3 00 PM 5 00 PM 1, OBJECTIVES OF THE COURSE: ‘OBJECTIVES OF THE COURSE: 4. Develop advanced research skils including Iterature review, source evaluation, and academic databases navigation 2 Construct complex arguments supported by evidence, logical reasoning, and appropriate theoretical frameworks 3, Wrte clear, coherent, and well structured academic essays demonstrating critical analysis and synthesis 4. Aoply appropriate citation styles (APA, MLA, Chicago) accurately and consistently in academic wring '5 Revise and edt writing effectively for clarity, coherence, grammar, and style 6. Understand academic integrity principles and avoid plagiarism through proper attribution and paraphrasing 7 Adapt writing style to diferent academic genres including research papers, erature reviews, and criical essays 18 Provide and receive constructive feedback through peer review processes 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: “The course emphasizes writng as a recursive process involving planning, drafting, revising, and editing. Students will complete multiple wring assignments with opportunites for revision based on instructor and peer feedback. Writing ‘workshops wil focus on specific skils such as thesis development, paragraph organization, and sentence level editing Peer review sessions will develop critical reading and feedback skils. Individual conferences with instructor wil provide personalized gudance. Reading assignments will expose students to exemplary academic wrting across discipines 3. STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE 1. She Essays (20%) Four page exsays demonstrating mastery of sect wating sks 2 Aenea Boggy (10%) Comprehensive Bogaphy wih summafes and evaluations of 1015 scholar sources 4. erate Review (20%) 810 page synthesis of research on seecte top with eal nays 4. Reseach Paper (20%) 1218 page oral esearch paper wan proper cocumertaton and formating 4. Peer Review Paicpaton 10%)- Active engagement in workshop Sacusions ad consitive feedback €. Pon (10%) Compton of vised wort wih eestive essay on wring devecoment Examples: EXANPLES OF STUDENT WORK Example {: Research Paper on Language Education Pokey Anais of mother tongue based multingual educaton Ee) otmeratonn Pipe snc wen poy ecameencens sipped yedicatana sea and senor Example 2 erature Review on Soca Masia Impact Comprehensive review synthesing research on effects of soca ‘radia vsage on Fipine adolescent mental heat and wel beng Incudes theoretical frameworks and research gaps Example 3: Creal Anais of Prppine trate Indepth examination of postcolonial themes in contempor Fapno novel, demonstaing cose reading sha textual anaes, and engagement win teray esicam."
    },
    {
        "image": "courseoutline2_synth_18_aug2.png",
        "label": "courseoutline",
        "ocr_text": "University of the Phitippines Ditiman Guezon City, Matto Manils repisuar und eau on Catalog Number: enc 407 Year: 2026 2027 IRSHMERGR Prot Lauren Sots OFtice Hours: M94 3 00 8M 5 00 Pa Course Tithe: ssvances acoceme ving Semester: sunmer Term Otfice Location: som ars Saseras Big 1 ORDIECTIVES OF THE COURSE. 3 STUDENT REQUIREMENTS FOR COMPLET EON (OF THE COURSE:"
    },
    {
        "image": "courseoutline2_synth_18_aug3.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philisnines Diliman con City, Metro Manila Catalog Sumber: ENG 40! Conse Title: ssverees asnsome Ying Year: 2026 2027 Semester sume Tein instructor prot Leuren Ses Clfine Locatlan: nos 579, Saence Hig (Qifice Hours: Mw 200 PiA500 Pw 3 OBJECTIVES OF THE COURSE: n, and aesdome datehenes navigation eweorks loncag research wks including ieratten review, Routes eva ease, So appropriate thaoretcal 4. Deval at 2 Sonairuct conwles arguments auowaried by evite cerent, ao webestructused sas assays demonstrating ostical analyse and syrither® acewateyy une consiterdly a acasemin ering 4 key appropiate chation siyles (APA, BLA, Unkxago! yy onecnaiie, gisvera, aed yi phagisriors Snecughs oper arth and eeraptensing 5, Revise ane eo wening effectively tor reteset escent, Rerature reviews, ars cvtaie soap wring stile 1 sfferent 18 Provide and raneive coratructive fondback through eer review proce ses 2. PROCERURES FOR, ACCOMPLIGHING THESE CAIECTAVES: RES FOR ACCOMPLISHING 1 PROCEDY “he cxsne emphasizes wrting 36 8 secorsive procecs invaiey sarang, dealing, cavishsy, and SCRA paige tse wrtng aaskevrenss with opao ints foi even hase on MttuCier and pear Yensback. Wig ‘norkshope wel fous on epentie ski such aa ines Gavetonnens, paragraph ofeanizotia a level edt Peer ieviaw sesziins vaadiny and foeinck ski Indies conferenvess veth iatructor wit round Derasnelses quelance Reaig sbegeenenis we exoose sharers to erenmiary auadarnc wring serous epines Staonts wi 2. STUDENT REQUIREMENTS FOR COMPLEVION OF THE COURSE: NYS HOR COMAETIGN OF THE CM sruceitt REOUIR: 2 Rented Bape (SOM Comerahansice elerapty wth eins an erahations of 1S achat sures a ony tan et erat ae 25 pays mays serorsiaing mastery of 5 Lert Reew 12s) 30 pape spins of ven 4: Baseseoh Pur 9%) 1B age eg sseaten pba w 5, Pate Pei Paseo (0) Att angepenent 9 moses Berto (10%) Gonapnan of wise ack wah reason essay on vg deve examples: BRAMBLES, Esenole 4. Reneonh Pave AAR NE) uiecnantatin evince Exonis th: Lencanee Review on Sosil Maga lenjest Comprchenive sevtw ivhermng neseares on eacs8 a Serta an paging uectervent vevieh neat aid aatpeny, losudes Mooeies taauests and meTeERR GEES -Anaiysis et mother tangue bavas ing re ih poses ecemtnendations supneried By econtonal weRRant wed ccxnmpie 3 Cnteal Arabia of Phippink Litnraten: -in depth exsitination, ot pestonionai thames b cantecrnorey Pinne novela devensturng ous wang sin levtas’ analy, and engagarnen” with Macary eet"
    },
    {
        "image": "courseoutline2_synth_18_aug4.png",
        "label": "courseoutline",
        "ocr_text": "University of the Philippines Diliman ‘Quezon City, Metro Manila registrar upd eduph _ Course Title: Advanced Academic Waiting Semester: summer Term Office Location: Room 573. Scence Biég. Catalog Number: ENG401 Year: 2026 2027 Instructor: Prof, Lauren Solis Office Hours: Mw 3 00 PM 5 00 PM 1. OBJECTIVES OF THE COURSE: OBJECTIVES OF THE COURSE: +. Develop advanced research skis including Merature review, source evaluation, for clarity, coherence, grammar, and style plagiarism through proper attbution and paraphrasing erature reviews, and crtical essays 5. Revise and edit wring effectively 6. Understand academic integrty principles and avoid 7 Adapt wrting style to different academic genres ncluing research papers, 6, Provide and receive constructive feedback through peer review PronesseS FOR ACCOMPLISHING THESE OBJECTIVES: 2. PROCEDURE! ‘ACCOMPLISHING THESE OBJECTIVES: PROCEDURES FOR ‘multiple writing assignments wih, workshops wil focus on specific pnts wih opperenin development, paragraph organization, and Serene eh Wore nope sessions wl develo crBical reading and feedbecs \"wth instructor wil provide personalized gudance. Reading assignments one we students to exemplary academic wring across iBCPAneS 3. STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: +S FOR COMPLETION OF THE COURSE: says demonstrating mastery of specie wing s \"van summaries ad evatztions of 10 15 seholay souces ‘STUDENT REQUIREMENT! 4. Sort Essays (20%) Four 5 page o 2. Annotated Bogr2phy (10%) Compranensi —_ EXAMPLES OF STUDENT WORK: wample 1; Research Paperon Langua Exar i 98 yased mutangual education esearch and"
    },
    {
        "image": "courseoutline2_synth_18_aug5.png",
        "label": "courseoutline",
        "ocr_text": "University of the Pir Dimer regata g Col slog Nembor a Hee LOCAtIOR, je wer CAtice Hours. Ka soo Om sours 1 OBN CHIVES OF IE CouRsE $68 messy to. 2 omar conses vous sepese AR Nee ewe cate seo atten eterna) i onmence renne ae ane SAG AUN ouG oRer atte ene nee erg teens carat PIE Cem PE CE yeaa e OES FOR ACCOMPLISIENS THESE CEH CLIVES. Oe Haass seus Mod irtaroneay whee ute ace, Tita ean ae see acadene wig act SERCO REM ENTS FOR COMBE TION oF THE Course Erawwies"
    },
    {
        "image": "courseoutline2_synth_19_aug1.png",
        "label": "courseoutline",
        "ocr_text": "Centrat Philippine Un versity toile Cay, tee stitisstonsatepy edu gh Cotaing Member ga gat Course Tite: Sree aie tomating Marapemiecs WAAR 226. 2676 SemBStOr: Fest Someta ISSR sostane Yasiannon Cltice Location: scm re Aine 2g Fine Hews: Fe 208 eae apap 4 O838CTi VES OF Tue coun OBIEOTVES OF Tie 4, Anathem creat raven 2 Deveian emai 9. Greats caer 8 Wieatoies tava oss ear 8 SAEEOG Ps cchici staan seudan, Chee RS, et tones acta, end ating Se eeretams customer dnc 5. Deny et Somer, tary 0G, sw neaaioning 1S 8D Ghans meansgeman a stain to hus tong cuatrense sstatinsting 7 Use matting maaytce ani me formance and RO makeing wative PROCEDURES FOR ace, OMPUISHING THESE OMECTivES: PROCENURES FoR ACCORD HANG THES SAW3e Combines case siuy ansias, WECTVES Peet simatic tactew sciets, cent, ei unavce Senne Arete SYOIRLY orn ee tse terete ierdipetdench cine aha oni reanonaes Gres commahensie marnedng rstatialice ovecucts. Caveat eusakern rey reer SO ery eights aon bent eee eae eters WB ercowrage SOMNUENGW oF Te couse. Foss wits sates of rat 2 Scbsieg taneanion (82%). Par 8 Hives teerg Ps 285). Gewiganees 3. Se Pronsetaen 0 3 Foun easminitien tom) Atos nians watson, Exanspte: 1. Sa devo Repos (ares, RBar Saeating commebarsive m AID anf ne pcs Foun giousnesten of na rls nage te me: surared Proce cena coating change SAB wit wi ot fn AOA. whens ecain Wate ONS. and asics om Pee wines er gras wns SAMOS OF STUDENT won Ldoatte derma get taping Sa. skiing sanyo engenes cae SMH Sail manny amos ta eee Prezing entcrninwas Hone cares seit nee ay coe meee loteancw jattnentiee et ete \" smeeetens oc concent bon age ob Coney on GR Flee Busoes «AN sl wememeniion voc aie Senay We tens cute ty ant eaten Gee"
    },
    {
        "image": "courseoutline2_synth_19_aug2.png",
        "label": "courseoutline",
        "ocr_text": "Central Philippine flows Cay, cmiesions cau ediu Calsieg Mamber: ox ga: Fear: 2025 0925 Semester: instracter: bo: sospea witianneon ile Loeathon: ‘Office Hours: TE 2 00 Pia8 08 Px Course Tithe: stotene atetng ttunsgeneat Room 276, Attu Bis, 1. OBIECTLVES OF THE COURSE: CWECTIVES 9F THE COURS: 1. Aowsyze mareat em arate PONDRRS AG Hameersks auch os PESTEL ansivem, Pons Five Forces, and SHOT 1p marketiog statening Daved on markal sepinsntiation, We coereh ante ranking wane ins fi, and pesticeig (ST) py Aa Siuaion naive, chisotives, shrateptes, 8 Aeaby consumer betaviie meores ts indercland customer loninaiing acne His sexs Sanit Mer sed maaine conmunieaten campaigns scruss nate hanmete mowing data ig tesa pea ae ‘atte Dao ely ant dean ane management abateies to le means marketing porfeoman ‘arc soci veaponsivaly ssro0g custome: relat ad Rey Sorstanrators m marketing peutic shen 7 tee macketing analyting ane main COOMPLISMING THESE ORIEL TIVE FOR ACCOMPLICHING THESE OBECT: Je coune sartines case shut arene, nertes rites and atorationa niacietny cases ie uncorstere oe markeliny esmuistion exercives ul atow ales te Soule davetos a or: f HeRasalian and mpiementuts tnlernct ake obiategn decisiona atc cbaerve tnstkel respe crater apenSN Mareeiny sa te rosie Mypeihetod Wovens Caries thors wih anace intusky isighie and beat erscoeee nkng soul cortenperey meeting chaterges F REQUIREMENTS Pow compLE MENTS FOB COMPLETION oF 4. Cane Sante Repere i i spaakars trom 1634 discussions wil encourage HOM GF TRE couse, THE COURSE. Se nti myst of 2 Matai Siraien (95%). Patisnase rating 23888 wih cree vec Pampa mati ems th seam eis riatone isis ikea neste fo 2 20 Bram coneers mtb Sr Fees campany somestt, hamweicets ot acetate: AA Em AON me Hr BOA tert, Pe tn gen nn 5, Fina Eeratin 0%) Comceras Sis carticeston aupactd, Examate ES OF STUDENT woRK: ie, Gath Shatasy be Eecnenaly ssoictentahy cant ee Fhpare mile ‘ating sotenoiatns pee cs Stans Seve mining hn ‘panies abet maaseah lana esonueter geste beyetng rsehica mWhSS yesmemigstwtey. strom Exani 2 Digi Sakorng Canaan Sr ce tent Sestmations te aeons osc A Bictonsaate ete Brame Baicondng Stategy fe: Testers! peo Besueey «tn SSMS a cemsamy WBNS macearis iheN marines aap Toutsm avn ccoensi det 71 Oe soca se Beg atta sams to ramets Piegine Santact nein. hae 80 a sesommotatian te Pinca Sans rage 28 os iy"
    },
    {
        "image": "courseoutline2_synth_19_aug3.png",
        "label": "courseoutline",
        "ocr_text": "Central Philipp! ne University fo City, rmissions epu edu yh Cateiog Number: 2Aeot Course Title: Semester: Fist seme: caving Macvageine chura aamson Gflice Lovation. exon 276, admit Office Hours: 16 2 00 PM S 09 PAE 1. ORIECTIVES OF THE COURSE OF THE COURSE y2e marked environments uoing Kamevoras such 29 PE Five Fovoes, ant SWS? entation, toe 2. Blevetoy markeling strategize based on marker se ies nmorenarsve snark ng customer relatoneriss and ROL opweTiyES: 208 fo under nad st steay foimuaton and amples autor axetC cy stistants serve market fe sat wan aeategie recon nenaators fox a asaaga"
    },
    {
        "image": "courseoutline2_synth_19_aug4.png",
        "label": "courseoutline",
        "ocr_text": "Central Philippine University Holle City, Bosio auimnigsionsgepu edu ph Cotaing hiamber: BASSI Eperse Tithe: sraingi Mesetn nnagement Year: 2625 2028 Semester: First Semester Instrestor py, Joshua Witenes CAfice Location: oom 278, home ty Office Hawrs: TE 2 00 PM 3. OB ACTIVES OF THE COURSE: ing aitulagine based 2a wurkel segmentation, targeting, and pestionass (S77) erences Jen analysts, obivotiven, cbxtagioe, inota, ad mers 3 Create comprehensive marketing pane mouding vite 4. Appi consumer nehswior hears 82 understand cusinmar decwiommahing racesces and ourchasing patterns 5, Desig ilegraied marketing cemmuriction marnpaigne acrese mutioks charmer sian gat ond trasieionsi media &, Eveuzis brane equity sod Geveion brand matagemnn stadigies tuts strong cusiamer coatiansiins 7 ise surketng snaivlen and metrics te measure masketng perfamnanct ans ROT 5. Understare ethzal and social reaponsicity censshioratiana in marketing scactice 2. PROCEDURES FOR ACCOMPLIGHING THESE GRIRCTIVE DURES FOR ACCOMPLISHING THESE OBECTIVES: Lone case study ansivaiy, mackatlng samiations, asd privet! Ghigone and aternanons: markating cases 19 understand sesteqy ferris ane eyplementaicn., btaractive marketing eieudation exercanes wt ucente to ake strawae decease and observe market respaneen, Brose projects semive deveicoment of congresrsive marketing plans To real oF oypetietice saducts, Guect sneakers Wer mravketing mencine al coxporatans wil aus industry walghts 8 ices, Claas docussions wil encowsge citioa! tenons ads conlecrmorary masetioy chase. cis, Students wi analy 3. SPUDENT REQUIREMENTS FOR COMPLETION GF THE COURSE: 515 £OR COMPLETHW OF THE COURSE, eas when anaes of arstating canns wih static reocnnemsatons STUDENT atu! 5. Case Avaiysis Reports 2. ashatg Sorin (124) Parbisgation m2 aompetine madesng sevice 5 revi: Movnaing Pan (254 Developean oF acenentansive mackatcg pin for anes yrabuet or tenses anch 4. Coca Premarin (2%) Peaen ornare of nacketng etategy for ae anton Phnom crewORAY wih eam dacicn sting Pal Eraminntze (20 h« Comprehensive exam exvertg matting Serena, CarNeUONS, SOS asORERO rte sf sastecation espe SO vst: war ant fain API cru, Pte evatuatn fo gue Exompier: EAMES OF STUDENT HOR auras Seatagy Se Eea tvnely Predunts Sudants doves maskatny sian for manta somsueney gto teastng ty covatiass Higing wiarwal, Inehaies eae SAKES, cOMpetaCE anaes, paseng ey, an aya asnoting conininsines 92 cuingeabentive qi macestng campaige ie oomete Ping Tange, coranet kn, DEH Barats 8 Example Digit ataniny Campaign ter Ceeal Tawtem -Fiabgn Denning ashes. jack rovers sce a0 2 Exacigo 1 Rating Siitews tee Trasiewal Pegice Beoans —Aeaiysis ane sacammenaions for madanitog aad rutin ioe! company ve awning extars! acer and euterne sy."
    },
    {
        "image": "courseoutline2_synth_19_aug5.png",
        "label": "courseoutline",
        "ocr_text": "Central Philippine University Holo City, to admissions cpu edu ph Catalog Number: BA601 Course Title: strategic Marketing Management Year: 2025 2026 Semester: First Semester Instructor: py Joshua Williamson Office Location: oom 276, Admin 89 Office Hours: TF 2 00 PM 5 00 PM 1. OBJECTIVES OF THE COURSE OBJECTIVES OF THE COURSE: 1 Analyze market environments using frameworks such as PESTEL analysis, Porter s Five Forces, and SWOT anayss 2 Develop marketng strategies based on market segmentation, targeting, and postonng (STP) prncpies 3. Create comprehensive marketing plans including situation analysis, objectives, strateges, tactes, and metres 4. Apply consumer behavior theories fo understand customer decision making processes and purchasing patterns 5, Design tegrated marketing communication campaigns across mutiple channe s including dgtal and tradttonal media 6, Evaluate brand equty and develop brand management strategies to bulk strong customer relationships. 7, Use marketing analytics and metres to measure marketing performance and RO! £8, Understand ethical and social responsibilty considerations in marketing practice 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVE: PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: The course combines case study analysis, marketing simulations, and practical projects. Students will analyze Phiippine and international marketing cases to understand strategy formulation and implementation, Interactive marketing simulation exercises wil alow students to make strategic decisions and observe market responses. Group projects requie development of comprehensive marketing plans for real or hypothetical products, Guest speakers from marketing agencies and corporations will share industry insights and best practices. Class discussions wil encourage erticl thinking about contemporary marketing challenges. 3. STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE 1 Case Ansys Reseas Fou written analyses of manaing tratege rcommensators 2 Marcetag Senuaten (18s) -Pansegaton 9 com: team cersonmang 23 Inaveua! Marcetng Pan 28%) Devecoment of crarereie mavcging lan fo 9 neu prosuct oe seruce ach 4 Group Presertaten (20%) Team presentation of marketng sategy for an assigned Phipane comsany 5 arvnaton 20%) Comprenensie exam covenng martetng consents, Tamenores and aootsatons Acive sass pancaton expestes Al witten wart mus flow APA format Fear evaluation for rove wort Examples: EXAMPLES OF STUDENT WORK. Lanen Strategy fer Boo Franay Proavets- Suserts avalon mareetng an for sustanabie consumer gooos targeting fevvoormentany sonsceus Fuge moannas, neuses mari researon. somsettve anaes poston srategy ane ntepates eneing conmancaions pan Examsie 2 Dita Marteing Campagy for ova Towsam Design commrenensve ogtal marieing campage to ptomote Pragone Pat cestnatons to sematona manets Progst overs sona masa svtegy. coment Marseing. nivencer pavinershios, ana pedormance metres Exampe 3 Rebeanaing Stategy fr TadtonalFlipno Business -Anays s and recommendations for modernizing rand mage of ‘estabenned seal company une mamtaning evtwal autheniony and custome” ovary"
    },
    {
        "image": "courseoutline2_synth_20_aug1.png",
        "label": "courseoutline",
        "ocr_text": "Ateneo de Manila University ‘Quezon City, Metro Manila admissions ateneo edu Catalog Number: MATH 501 Course Title: Numencal Analysis Year: 2026 2027 Semester: Fist Semester Instructor: Asst Prof Tifany Grant Office Location: Room 477. scence Bldg Office Hours: TF 1 00 PM 11 00 AM 1. OBJECTIVES OF THE COURSE OBJECTIVES OF THE COURSE: Undecstand souces of nmeceal aren neluang round aor, uncaton eo and son methas. Newton Raphyon methes. and secant metnas 18 seve noninear equator propagaten of erork m comavatons nena 2. Aap otingag agortrms even Baee 2. implement wterpaton 2n¢ approximation etnies sng poyromiaetrelaton sehne teraton, and east 4 cove sysers of nea enutons using Sst metheds Gavssan eimaaten LU decomson tian) andteraive mara 90h Gas Ses) 5. Pecorm numerca oerentaton and ntegraton ease 6. Soe organ tt 7 anaiyze convergence, stabity. and accuracy of numeral aigorttas yng anguages such an MATLAB. Fy ng tte ttecance fommuas apezoca re Smosons 148. and Gavssar react equaters rumencaty ving Euers mettos, RungeXurta metnecs, and musstep metnats £8. Implement mumencal agorthms vag erga woe 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: cectres wa present theoetal foundations of rumencal menos along wih eer anayss and convergence rots ces. aeoratory sessions wil focus on mplemeniing algorthms and soNing realwore probes Sec cer oak’ Stagente wl compete programmng assnrments requtng Bam akorthm pT cr na raya of erent metnods Provem sels wa develo anaytcal skis perfor eaMnavar a aigonthm Sea ae aot iuses rom Industry practtone s wil demonstrate appicatons n engnerng and Scere computing 3, STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: ir REQUIREMENTS FOR COMPLETION OF THE COURSE arayss, ager Seng and corvergence yh rnon wth performance comparson sTu0® 1 Probiem Sets 25%): Eght assigoments covenng eo we mage greats mplemertng umencal metass MATLAB of Py! eres ena on numencal mathecs they, eer arai s, ane agerth ogy to save area nord sz ntfc or eognaerng ober 2 Programming Prowets 30 3 Maem Exameaton 20% Inve! rome! s6008 (10%) Comprenensve exam coverng a couse be gre erot nays Acaseme etegty strety eters numarcal metroos 4. Fea Proget 5 Fa Examaaton [hv code submations must noise proper cocumertaton, 18 CaBeS Examples: EXAMPLES OF STUDENT WORK: Example 1 Cimate Modeing -Asshcaton of Elngte patiens. Stents wil comeare accu Exampe 2 Struct! Anais Using nmerca met Shage seuctaes Projet seuces men geeraton.# marca Dervatves Praag -Impamentaton of mera Sein ans inne atterence metnods Arayss “=.2eS 6 mumeneat stent! equator ses to mode: temaaratize changes an west TSS rcerey of otteret ODE sovers anc aayze ongter stabety ods to sve systems of equatens anting fom fete eemect anasto eee es ees compaton and esuaezaton of 88S GABON rgeean and Amescan 25th integration metnoas to pe Es ee Enampie} F vag Monte C lovergence Stes 2S"
    },
    {
        "image": "courseoutline2_synth_20_aug2.png",
        "label": "courseoutline",
        "ocr_text": "Ateneo de Manila University Quezon City, Metro Manila admissions ateneo edu Catalog Number: MATH 501 Course Title: Numerical Analysis Year: 2026 2027 Semester: First Semester Instructor: Asst. Prof, Tifany Grant Office Location: Room 477, scence Bg Office Hours: TF 1 00 PM 11 00 AM 1. OBJECTIVES OF THE COURSE OBJECTIVES OF THE COURSE: 1 Understand sources of mumencal eves melding round f ear, truncation enor, and propagation of erork in computational methods 2. Aepty rot ncing algorthms cluding bisection method, Newton Rachson methed. and secant methed to soWve noninear equations 3 Implement etersciaton and approumaten techniques wang polynomial mtrpoaton, spine interpiaton, and asst squares methods 4. Sova systems of inear equations ving deect methods (Gaussian eimination. LU decompostion) and teratve methods (Jacob. Gass See) ‘5, Pectorm numeral tterentiation and acute ‘tegration using fnte Sterence formulas, trapezoidal nde, Senpton s née, and Gaussian ©, Sowve crinary erential equations numercaly sing Eue s method. Runge Kutta methods, and mutstep methods 7 Aeaiyze convergance, stabity, and accuracy of nemencal agents Implement umerca aigrthos using programming languages such 2s MATLAB, Python. oR 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: 3. STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: 1 Proiem Sets 25%)- Ege antgnments coverng enar ays. agorthm cesign and convergence anays 2 Pregammog Projets (2%) Five mar rots mplemening numeral methods MATLAB or Python wih perfomance comparson 2 Metrm Examnaton (27 Wretn exam on namereal methods thar. ener nays, snd aarti design 4 Fat Prone (15%) India projet sepying mumercal methods Yo solve a rea wot Siete o engrwerng probien 5. Fl Examnaten (10%) Comprenentive exam cover a couse ones ‘5 code submissions must clude proper documentation tes canes. and eror anys. Academic wtegrty stety eferced Examples: EXAMPLES OF STUDENT WORK; Example 1: Clmate Modeing -Aspication of mumerest tere clenate pattems, Statens wal compare acewacy and effec ot Example 2 Stuetura Anayss Us rage structures. Project neces {quaton solvers to made temperature changes and pect Sterent ODE sotvers and aniyze longterm stabaty"
    },
    {
        "image": "courseoutline2_synth_20_aug3.png",
        "label": "courseoutline",
        "ocr_text": "Catalog Number: mati 501 Year: 2026 2027 Instructor: Asst Prof Titany Grant Office Hours: Ateneo de Manila University ‘Quezon City, Metro Manila admissions ateneo edu Course Title: Numerical Analysis Semester: First semester Office Location: Room477, Science Bldg TF 1 00 PM 11 00 AM 1. OBJECTIVES OF THE COURSE: OBJECTIVES OF THE Course: 1. Understand sources of america! erors 2. PROCEDURES FOR ACCi ‘OMPLISHING THESE OBJECTIVES: ING THESE OBJECTIVES:"
    },
    {
        "image": "courseoutline2_synth_20_aug4.png",
        "label": "courseoutline",
        "ocr_text": "HANES OF STLOET Wone ETE Ste Noming «Aachen omne Course Yithe: Numerics: Ansiyag Semester: cist semesse: OMe LCI A sm) Seance eg ‘lem smay Sree man en nen seen sence Baie: mates ots Goren sities manne commasign one ot woes aaminson Seampie a aaa cere sewer sang ME MO se acre ee SFY conanenee ste conan"
    },
    {
        "image": "courseoutline2_synth_20_aug5.png",
        "label": "courseoutline",
        "ocr_text": "Ateneo de Manila University Quezon City, Metro Manila admissions ateneo edu Catalog Number: MATH 501 Course Title: Numerical Analysis ‘Year: 2026 2027 ‘Semester: First Semester Instructor: Asst. Prot. Tifany Grant Office Location: oom 477, scence Bila Office Hours: TF 1 00 PM 11 00 AM 1. OBJECTIVES OF THE COURSE: (OBJECTIVES OF THE COURSE: 1. Uncerstand sources of nanefeal evar inching reund f enor, truncation eres, and propagation of enor in computational methods 2. Aes oot nding algetims including bisection method Newton Raphson method, and secant method to solve nonlinear equations 3. implement interpolation and approximation techniques using polynomial interpolation spine interpolation, and least squares methods 4. Seve systems of Sear equations using dest methods (Gaussian eminatin, LU decompostion) and erative methods (12006, Gauss See!) |, Petom numerical terentiaton and integration using tte ference formulas, trapezoidal ne, Sempson s nde, and Gaussian acre ©. Sowve orsrary steer equatons numencaty using Evers method, Runge Kutta methods, and mutates methods 7, Analyze convergence, stabity, and accuracy of numerical aigorthons |. Implement rumescalaigorthms using programming languages such as MATLAB, Python, or R. 2. PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: PROCEDURES FOR ACCOMPLISHING THESE OBJECTIVES: Lectures wil present theoretical foundations of numerical methods along with error analysis and convergence proofs. ‘Computer laboratory sessions wal focus on implementing algorithms and solving real world problems using ‘computational tools. Students wil complete programming assignments requiring both algorthm implementation and ‘comparative analysis of diferent methods. Problem sets wil develop analytical skils in error estimation and algorthm selection. Guest lectures from industry practitoners wil demonstrate applications in engineering and scientific computng 3. STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: STUDENT REQUIREMENTS FOR COMPLETION OF THE COURSE: 1. Problem Sets (25%) Eight assignments covering ene analysis. algertim design, and convergence anys 2. Programming Projects (20%) Five major projects implementing numerical methods in MATLAB or Python with pertormance comparison 3. Midterm Examination (20%) -Weten exam on numerical methods thecry eror anatysis, and aigorthm design 4. Frat Projet (15%) Individual project applying numerical methods to solve are wordscientfe or engneeing robe 5. Final Examination (10%) Comprehensive exam covering al course topics ‘A code svomiasions must nade proper documentation est cases, and enor analysis, Academic integity sty enforced. EXAMPLES OF STUDENT WORK: Example 1: Cimate Moseing -Aspcation of numeral ferent equation sslvers to mode! temperature changes and prect ciate pater. Students wil compare accurary and eciency of fterent ODE scivers and any long term stay. Example 2 Suuctral Antyis- Using nuneca methods 1o sive systems of equations asing trom fine element anays of ‘age structures, Project ncades mesh generation. stitness max computation, and vsuatzaion of stress aatiovtion, Example 3: Fnancia Deratves Pricing «Implementation of numerical integration methods to pre European and American options sing Monte Caro simulation an fine dtference methods, Anayss clues convergence stuse and compatona! effcency ‘comparsons"
    }
]