[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the leaming outcomes. And, it includes factors instructors will take into account when evaluating performance October 23, 2023 Submit your pf file before 2 35 AM (Elementary 2 4 Submit your Pdf file before 12 48 PM (Ey September 12, 2024 Submit your paf file before RF (| lementary 1 B Grade 9 C? REPORT EVALUATION PRESENTATION EVALUATION CRITERIA SCORE CRITERIA score Organization (title, contents, lists 76 Organization (tite, outline, smooth of tables and figures) 25 transfer of information) Content (objective, methodology, results and conclusion) [arity (sides) J Language and Pronunciation Presentation within the assigned time limits (15 20minutes) 43 Answering questions {only the one who has been called should 1 9 answer) Introduction and literature review 67 Clear objective Methodolog Results Conclusion and T recommendations 1 8 Total Score"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "criteria",
        "ocr_text": "y can der rch evaluating cerformance October 22, 2023 f your pdf flie befe 2 35 AM (Elernentary 2 A5 2 before 49 48 aM ‘Elementary 1 8 2024 ia 57 Langu gage: and Pronunciation 82 Presentation within te assigned io ii Rimits 8 vint"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "criteria",
        "ocr_text": "Critefa make it clear to leamers what they are expected to do. It shows them how onstrate they ve ach they can dem eved the leaming outcomes. And, it includes factors instructors will take into account when evaluating performance. October 23, 2023 ymit your pdf file before 9 35 AM (Elemeniary f file before 42 48 PM ‘Elementary +B? Sub 2A) e =Suomit your pd September 12, 2024 Submit your paf file before RF “Grade 9 C? [as Organization (tile, contents, isis 76 of tables and figures} lnirodoation And iteralure review 67 guage and Pronuncation Presentation within the assigned Results _ ____L time! firnits (15 20minutes} __. Gan Gusion and ‘Answeriig questions {only the one 4 8 who has been called should recommendations answer} OL —— [Yotal Sore"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the leaming outcomes. And, it includes factors instructors will take into account when evaluating performance. October 23, 2023 Submit your pdf file before 5 35 Ay (Elementary 2 A:) Submit your pdf file before 49 48 pry (Elementary 1 B) September 12, 2024 e Submit your pdf file before RF (Grade 9 C? REPORT EVALUATION PRESENTATION EVALUATION CRITERIA SCORE CRITERIA SCORE Organization (title, contents, lists 76 Organization (tite, outline, smooth 25 of tables and figures) transfer of information) Introduction and literature review 67 Content (objective, methodology, 69 results and conclusion} Clear objective 44 Methodology 57 Results 83 Presentation within the assigned 43 time limits (15 20minutes} Conclusion and Answering questions (only the one recommendations 1 8 who has been called should 1 9 answer) Total Score"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "criteria",
        "ocr_text": "_ it she 2 35 AM fa 2 48 PM ‘Elementary 1 5’ September 12, 2024 PA YOUr OC 2¢¢ “Grade 9 0? 4 8 who has been called should"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the leaming outcomes. And, it includes factors instructors will take into account when evaluating performance. October 06, 2025 e Submit your pdf file before 7 54 pry (Elementary 5 B:) e Submit your pdf file before g 9g py ‘Grade 8 E? September 02, 2024 e Submit your pdf file before S07 “Grade 10 B? REPORT EVALUATION PRESENTATION EVALUATION CRITERIA CRITERIA SCORE Organization (title, contents, lists Organization (tite, outline, smooth 71 of tables and figures) transfer of information) Introduction and literature review 68 Content (objective, methodology, 89 results and conclusion} Clear objective 8 arity {slides} 33 Methodology 10. Language and Pronunciation 13 Results 68 Presentation within the assigned 77 time limits (15 20minutes} Answering questions (only the one 57 who has been called should answer) Conclusion and recommendations 49 Total Score"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "criteria",
        "ocr_text": "eit clear to leamers what they are expected to do. It shows them how Criteria mak mes. And, it includes factors e they ve achieved the leaming outco they can demonstrat 0 account when evaluating performance. instructors will take int October 06, 2025 e Submit your pdf file befo! Submit your pdf file before 6 08 PM ‘Grade 8. E> re 7 54 PM (Elementary 5 B:) September 02, 2024 Submit your pdf file before 5: (I _RB) RF ‘Grade 10 B PRESENTATION EVALUATION REPORT EVALUATION CRITERIA re [2 CRITERIA eee Lol of tables and figures) tamfer of information’ [eat and conclusion Clear ob \\Ciearojecive 10 Lae Language Hranguage and Pronunciation __| Hranguage and Pronunciation __| Results Presentation within the rein a time limits (15- rein ‘Answering questions {only the one who has been called should Conclusion and recommendations"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "criteria",
        "ocr_text": "Criteria make It clear to ileamers what they are expected ta do. It shows them how they can demonstrate they ve achieved the learning outcomes. And, it includes factors instructors wili take into account when evaluating performance October 06, 2025 e Subrnit your pdf fie before 7 51 PM (Elementary 5 B:) Submit your pdf file before ¢.93 pry ‘Grade g FE? September 02, 2024 Submit your pdf file before PF “Grade 10 B> [REPORT EVALUATION PRESENTATION EVALUATION is __CRITERIA SCORE CRITERIA SCORE Organization {title, co fists 98 Organization (tide, outline, smooth 71 of tables and figures) i transfer of information) Language and Pronunciation Presentation within the assigned time linnits (25 20mninutes) Answering questions (only the one 157 who has been calied should answer} Conclusion and Salil i recommendations 49 i Total Score H"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the leaming outcomes. And, it includes factors instructors will take into account when evaluating performance. October 06, 2025 e Submit your pdf file before 7 54 py (Elementary 5 B:) e Submit your pdf file before ¢.93 pw ‘Grade 8 E? September 02, 2024 e Submit your pdf file before 07 (Grade 10 B? PRESENTATION EVALUATION CRITERIA SCORE Organization (title, outline, smooth 71 transfer of information} Content (objective, methodology, 89 results and conclusion) arity (slides) 33 REPORT EVALUATION CRITERIA SCORE Organization (title, contents, lists 98 of tables and figures) Tntroduction and literature review 68 Clear objective Methodology 4 0 Language and Pronunciation 13 Results Presentation within the assigned 77 time limits (15 20minutes) Answering questions (only the one 57 who has been called should answer) Conclusion and recommendations 49 Total Score"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "criteria",
        "ocr_text": "d to do. it shows wehiat t they tors will tak Cotober 06, 2025 September 0. 2024, pra your ape Grade 10 B’ rare Soe on clive, ve, metodo 89 results ard conch {"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "criteria",
        "ocr_text": "or ake ft Ht shows thera how arto nal they are they can d hieved the leamin a, it includes fact nonstrate they ve a ctors will take into iInvwhen November 08, 2024 Submit your; Grade 9 C 5 oP 4 02 PM (Elementary 4 A? mit your pdf file be July 18, 2024 e Submit your pdf file before §- op Ugtementary 4 A) AM -” ___ PRESENTATION EVALUATION Ta GuiTynenG: } Answering que E pone ; nS 64 i whe has been called should 96 '"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamears what they are expected to do. it shows them now they can demonstrate they ve achieved the leaming outcomes. And, it includes factors instructors will take into account when evaluating performance. November 08, 2024 Submit your pdt file before 9 34 AM Grade 9 C Submit your pdf file before 4 02 PM ‘Elementary 4A) July 18, 2024 Subrnit your paf file betore 8p (lelementary 4 A? [REPORT EVALUATION __ PRESENTA GRIT ERA __ _— —_ ERITERIA___. Organization itille, contents, lists Organization (ttle, ouiine, smooth wansfer of information) of tables and figures) Thiroduction and Tierature review 91 Content objective, methodology. 66 results and conchusion. Tonguage and Pronunciation Presentation within the assigned 4 2 time Hiits (25 20minutes) —____ ‘Answering questions {only the one 9 6 who has been called should } Clear objective Methodology Results Gonaiusion and secommendations"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the leaming outcomes. And, it includes factors instructors will take into account when evaluating performance. November 08, 2024 Submit your pdf file before 5 34 any Grade 9 C :) Submit your pdf file before 4 99 pry {Elementary 4 A) July 18, 2024 e Submit your pdf file before SPP (lElementary 4 A) REPORT EVALUATION PRESENTATION EVALUATION CRITERIA CRITERIA SCORE Organization (title, contents, lists Organization (title, outline, smooth of tables and figures) transfer of information! idea raittawicmdican) 66 results and conclusion gmcaeae 79 f dart (ades} 3 Results Presentation within the assigned time limits (15 20minutes) Answering questions (only the one 96 who has been called should answer) Conclusion and recommendations Total Score"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "criteria",
        "ocr_text": "2 9 34 AM Grade 9 6 4 02 PM \\Elementary 4A) EPORTE ENS jon (tite, outiine, moc” af uc Onten fabjective, methodology, 7 ari concusion) H ge and Pro we geti i ing ques ions (only who has been called should | answer}"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "criteria",
        "ocr_text": "REPORT EVALUATION PRESENTATION EVALUATION CRITERIA SCORE CRITERIA SCORE Organization (title, Contents, lists Organization (title, outline, smooth 19 of tables and figures) transfer of information) Introduction and literature review Content (objective, methodology, results and conclusion) arity (slides) 91 peeve Methodalag AQ, Language and Pronunciation Results 96 Presentation within the assigned time limits (15 2 Ominutes} Me Conclusion and Answering questions (only the one recommendations 6 1 who has been called should 96 answer) Total Score"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "criteria",
        "ocr_text": "what they they ve achieved the June 28, 2024 sur pdf fle b 3 41 AM 6 Rigs n 3 ; F pal file b ‘Elementary 3 8 December 28, 2024 nwoacH (Clear abje apie i [Meihodot i \"Results ettive, vnethadslowe results Sts and cones ta time “teits Qs. | Ans ering fons nly tF the 6 15 5 who has been called should a"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "criteria",
        "ocr_text": "eamers what they are expected to do. It shows them how Criteria make it clear to chieved the leaming outcome: yy can demonstrate they ve 4 s, And, it includes factors uctors will take into account wh the’ instr en evaluating performance. June 28, 2024 submit your pdf file before 3 41 AM 2fttfésa 9 your pdf file before 3 14 PM (Elementary 3 8) e =Submit December 28, 2024 Submit your pdf file before GRP (| Ppa (aN PRESENTATION EVALUATION CRITERIA Organization (title, outline, smooth 45 Content (objective, methodology, 40 results and conclusion} Language and Pronunciation y Presentation within the assigned time limits (15 20minutes) 49 ‘Answering questions {only the one who has been called should 22 answer) REPORT EVALUATION SCORE CRITERIA Organization (title, contents, lists of tables and figures) Introduction and Tierature review 35 38 4 Clear objective Results Conclusion and recommendations 1 5 Total Score tL"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the leaming outcomes. And, it includes factors e into account when evaluating performance. instructors will tak’ June 28, 2024 Submit your pdf file b Submit your pdf file before 3 14 PM (Elementary 3 8) efore 3 41 AM soca) December 28, 2024 Submit your pdf file before ( SRE PRESENTATION EVALUATION REPORT EVALUATION CRITERIA SCORE CRITERIA SCORE Organization (title, contents, lists 38 Organization (title, outline, smooth al 45 of tables and figures) transfer of information} Content (objective, methodology, 40 Tntroduction and literature review results and conclusion} ee eo eee g Methodolog 8 Results 400 Presentation within the assigned 4 9 time limits (15 20minutes) ve Conclusion and ‘Answering questions {only the one recommendations 1 5 who has been called should 22 answer) iz Total Score |"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to Jeamers what they are expected to do. It shows therm how y ve achieved the leaming outcomes. And, it includes factors y can demonstrate the cco the’ performance. inst ructors Will take into 4! unt when evaluating June 28, 2024 efore 3 44 am a2ai8s A Submit your pdf file b efore 3 14 PM ‘Elementary 3B) e Submit your pdf file b December 28, 2024 «Submit your pdf file before Bi (CRAG REPORT EVALUATION PRESENTATION EVALUATION L CRITERIA SCORE CRITERIA “T SCORE Organization ititle, contents, lists 38 Organization (title, outiine, smooth 45 transfer of information) ective, methodology. 40 Content (obj results and conclusion Cari (slides) Tanguage and Pronunciation r_44_| Presentation within the assigned time limits (15 20minutes) Ts Answering questions {only the one 4 5 who has been called should 22 answer) of tables and figures) Tntroduction and literature review 35 Clear objective Methodolog Results Conclusion and recommendations Total Score"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "criteria",
        "ocr_text": "Criteria make it shoves them how they can demonstrate they ve achieved the learn ng outcomes And, it includes factors evaluating performance. instructors will take into account when June 28, 2024 suprit your pdf file before 3 44 AM a2iRs a ile before 3 44 PM ‘Elementary 3+ 5) it clear to leamers swhat they ae expected to do. it e Submit your pdf fi December 28, Submit your pdf fle before Se in ee Organization itite, transfer of information) Content (objective, methodology, results and conclusion} whe has beer scatied’ \"Should"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "criteria",
        "ocr_text": "0 leamers what they are expected to do. It shows them how achieved the leaming outco| twhen evaluating performance. Criteria make it clear t mes. And, it includes factors they can demonstrate they ve instructors will take into accoun April 02, 2025 submit your pdf file before 42 50 am( Grade 8 A ) Submit your pdf file before 2 33 PM ‘Grade 8 E December 24, 2024 file before TERR Grade 9 D? e §=Submit your pdf REPORT EVALUATION PRESENTATION EVALUATION CRITERIA CRITERIA Organization {title, contents, lists 92 Organization (title, outline, smooth transfer of information} Content (objective, methodology, 93 eview 25 results and conclusion |_35 arity (slides Franguage and Pronunciation Pronunciation 16 __| Language Presentation within the assigned 29 of tables and figures) Tntroduction and literature Clear objective Methodolog Results 88 time limits (15 20minutes) Conclusion and Answering questions {only the one T< recommendations AQ who has been called should 94 answer) Total Score"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "criteria",
        "ocr_text": "April 02, 2025 Submit YOUr pdf file before Submit your pdf file before December 24, 2024 12 50AM Grade 8 A 2 33 PM (Grade 8 F? Submit your Pdf file before 7G AM “Grade 9 p? REPORT EVALUATION PRESENTATION EVALUATION CRITERIA [SCORE CRITERIA SCORE Organization (title, Contents, lists 92 Organization (title, outline, smooth 43 of tables and figures) transfer of information) Introduction and literature review 25 Content (objective, methodology, 9 3 results and conclusion) Clear objective 1 Language and Pronunciation Results Presentation withii time limits (15 20, Conclusion and 1 Answering questi recommendations 49 who has been called should 94 answer all i Total Score"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the leaming outcomes, And, it includes factors instructors will take into account when evaluating performance, April 02, 2025 Submit your pdf file before 12 50AM Grade 8 A °) Submit your pdf file before 2 33 PM Grade 8 E? December 24, 2024 Submit your pdf file before TRF Grade 9 D? PRESENTATION EVALUATION CRITERIA Organization (title, contents, lists 92 Organization (title, outline, smooth 43 of tables and figures) transfer of information| results and conclusion’ Clear objective 35 | 35 Methodolog) bo frontinnna Results 88 Presentation within the assigned 2 9 time limits (15 20minutes} Conclusion and recommendations Answering questions {only the one who has been called should"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the leaming outcomes. And, it includes factors instructors will take into account when evaluating performance. April 02, 2025 Submit your pdf file before 45 59 an Grade 8 A °) Submit your pdf file before 9 33 py ‘Grade 8 E? December 24, 2024 e Submit your pdf file before 7: (| -—? 7 0? “Grade 9 D REPORT EVALUATION PRESENTATION EVALUATION CRITERIA CRITERIA SCORE Organization (title, contents, lists Organization (title, outline, smooth 43 of tables and figures) transfer of information) Introduction and literature review 95 results and conclusion Clear objective arity (slides 35 Methodology 4 Results 88 Presentation within the assigned 2 time limits (15 20minutes) Conclusion and Answering questions (only the one recommendations 49 who has been called should 94 answer) Total Score"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. it shows them how they can demonstrate they ve achieved the learning outcomes. And, It includes factors instructors will take into account when evaluating performance. Aprit 02, 2025 Submit your paf file before 49 59 ay Grade 8 A ® Submit your pdf file before 9 33 py ‘Grade 8 E) December 24, e Submit your pdf file before TOP “Grade 9 D? REPORT EVALUATION PRESENTATION EVALUATION —_eRITERIA SCORE CRITERIA Organization (title, contents, tsts 92 Organization (title, outline, smooth 43 of tables and figures) Introduction and literaiure review 25 Glear objective E Methodoto: 4 Results transfer of information} Content (objective, methodology, 93 results and conchssion) f ariy (ides) —_ __ 38 Presentation within the assigned 29 t _ time linwits (15 20minutes) | Conclusion and Answering questions (only the one recommendations 49 who has been called should 94 a a a Total Score ___|"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "criteria",
        "ocr_text": "sean dame “ii Grade 7 D 3 07 PM ‘Elementary 6 87 Language Preseniat time limits"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "criteria",
        "ocr_text": "February 08, 2024 4 47 AM 6 Grade 7D} '@ 3 07 PM ‘Elementary 5 5’ mit your 2 Bip Grade 7 C’ PM o ; —— transter of information) Content lobjective, Tnethodo a results and concise _— Answering ques! who has been called 5 sould"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "criteria",
        "ocr_text": "spat t he leamirg out And, it includes © 4 47 AM) Grade 7 D 9 3 07 PM (Eton enlary 5 B Bip “Grade 7 C? wansfer ot in Content fo"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "criteria",
        "ocr_text": "org wil take WO February 08, 2024 Grade 7 D fore 4 47 AMS ait your Pt é ay 1 07 PM ‘Elementary 5 B° Bi pai ha Submit you August 04, 2025 bit your pdf file before AP (Grade 7 0) outline, wAeoth Organ grander of information, l ee een ii ree a infracuction Content objective, methodalogy, 94 \\ ire: and conckiston) — HE COTO anmnmmneensnemrat {4 ear objachys —— {33 \"Halhodology mr Method Ny nen Gp (Results a5 iG Answering, aque ens tony the one who has been called should en ncreren woe [Total $"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "criteria",
        "ocr_text": "ws them how February 08, 2024 mit your pdf fib 4 47 AM! Grade 7 D S07 PM ‘Elementary 5 3! CRITERIA an Organization (1d 60 Crnanication: i"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "criteria",
        "ocr_text": "December 31, 2023 «® Submilt your pdf file before “57 AM (Grade 17 ABM 8 3 02 PM ‘Elementary 3 4‘ Language and Promur i e i ai esentation within the as signed i 52 5 vering questions (oaly ef: vho Fras been cafled should i 54"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "criteria",
        "ocr_text": "25 them Now 3 factors December 31. 2628 2 Submk youre Submits & 1gigd Ealigs ic Srganl pansfer of bn information), Tintent lanjective, riioe, memodwogy, results and concussion) i Gaity {slides} i 2 nena 2 arnt i Pronunciation _ P sentation within the he assigned i Aominutes 5 Bae ering quest AS via has been called shoul! Hl"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "criteria",
        "ocr_text": "December 31, 2023 Submit YOUr pdf file before Submit Your pdf file before August 20, 2024 Submit Your pdf file before REPORT EVALUATION PRESENTATION EVALUATION CRITERIA Organization (title, Contents, lists Organization of tables and figures) 9 57 AM (Grade 11 ABM B:) 4 02 PM ‘Elementary 3 a) Ri4 Eimear» Introduction and literature review Results Conclusion ana recommendations Total Score peat eave (title, outline, smooth transfer of information) Content (objective, methodology, results and conclusion arity (slides -sansuaks and Pronandation ——}~5 J Presentation within the assigned time limits {15 20minutes} Answering questions (only the one who has been called should answer)"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "criteria",
        "ocr_text": "O57 AM (Grade 11 ABM B) smentaty 3 A’ ic transfer of informmalien) Se emeonsersome “TFantent (objective, ore Ho uolOey, 32 i results 2 ard conclusion) deeemvernonmspeetontanane reat 3 EO een nn oe iharity (slides) 3 ee 3 ieee 3 a ern a Tarquage and Preruncl =e resentation win the asst 4 ites} Fe ing qu wire has beer call ad s should answer)"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "criteria",
        "ocr_text": "ember 34, 2023 se Submit pdf 9 57 Ald (Grade 11 ABM B) Submit your p 4 02 PM ‘Elementary 3 A? August 20, 2024 M 10 An"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "criteria",
        "ocr_text": "Criteria Make it clear to leamers what they are SxPected to how achieved the leaming 8S. And, it Inctudes factors 8k inte account when ®valuating per formance February 05, 2025 they can demon, do. it shows them Strate they ve Butcom instructors will ¢: Submit your PCF file before 2 42 Submit YOur pdf file before 9 46 Aly 1 HRIE 4 d Februa 27, 202. Submit your Pdf file before i PIM (Thre Year Cotiege \"3 £P “Grade 10 4? __ REPORT EVALUATION ~~~... PRESENTATION EVALUATION a CRITERSA SCORE Oiganization title, contents, fists 10 Of tables ang figures) CRITERIA [Sean Organization {tide introduction and Meraline eview 90 outline, smooth i Content (objective, methodology, results and conchision} 51 arity (slides, 87 Language and Pronunciation Presentation within the assigned fine Smits (15 26minutes _ Answering Guestions (only the one 74 who has been called should &6 answer) | Total Score a"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "criteria",
        "ocr_text": "what they xbecied to do. it sh Sm now melita Peay ¥eo he leam g outcomes. And, it inclu factors int when ey February 05, 2025 lega B:) TS 2 42 Py (The 9 46 AM ean mit your pdf file b February 27, 2025 your pd beiore 7 29 Un yoy NS Tee? “Grade 10 A)"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "criteria",
        "ocr_text": "OWS U eit clear to demonstrat BAM SABRE A 2026 “Grade 10 A’ Content (oplect he esulis ani on"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what the can demonstrate they ve achieved the instructors will take into account when evalua y are expected to do. It shows them how leaming outcomes, And, it includes factors ting performance, they February 05, 2025 Submit your Pdf file before 2 42 PM (Third Year College B:) Submit your pf file before g. ) Mem yr p 46AM' Srage 4 February 27, 202: Submit your Pdf file before i ff “Grade 10 4) REPORT EVALUATION PRESENTATION EVALUATION CRITERIA CRITERIA Organization (title, contents, lists 10 Organization (title, outline, smooth 13 of tables and figures) transfer of information| Introduction and Merature review Content (objective, methodology, results and conclusion ates 25a a 94 Language and Pronunciation 9 Results Presentation within the assigned 7 time limits 15 20minutes' Conclusion and recommendations Answering questions {only the one who has been called should Total Score"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the leaming outcomes. And, it includes factors instr uctors will take into account when evaluating performance. February 05, 2025 Submit your pdf file before 9 42 PM Submit your pdf file before g- 0 46 AM (CKBNEA (Third Year College B') February 27, 5028 Submit your pdf file before TARP (Grade 40 A? REPORT EVALUATION PRESENTATION EVALUATION CRITERIA SCORE CRITERIA SCORE Organization (title, contents, lists 40 Organization (title, outline, smooth 4 3 of tables and figu res) transfer of information) Content (objective, methodology, 51 Introduction and Tierature review QQ results and conclusion, a ae rranguage and Pronuncauon guage and Pronunciation [_9 jin the assigned 7 4 Presentation withi time limits (15 20minutes Conclusion and yecommendations 2 Answering questions {only the one who has been called should answer) 7 Total Score"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "criteria",
        "ocr_text": "March 04, 2024 your paf fi le T STEM A 3 3 35 PM (g lementary 3 4) August 18, 2005 \"BAe Po ntteatenin ate eetsanan REPORT EVALUATION Content (objective thve, 4 fesuilts and con ae tieirriceeee rene er ai el a eet ceenee a 88... Language and Pronunciation i 59 i “T Presentation: wi heey the assigned tions fonly the | who has been called should"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the leaming outcomes. And, it includes factors instructors will take into account when evaluating performance. March 04, 2024 e Submit your pdf file before 44 48 pry (Grade 11 STEM A') e Submit your pdf file before 3 35 pM (Elementary 3 a) August 18, 2025 e Submit your pdf file before 19 40 (l Seogpd ser REPORT EVALUATION PRESENTATION EVALUATION CRITERIA CRITERIA SCORE Organization (litle, contents, lists Organization (tite, outline, smooth 31 of tables and figures) transfer of information) Introduction and literature review 62 Content (objective, methodology, 99 results and conclusion Clear objective 97_| Methodolog) 88 Results Presentation within the assigned a time limits (15 20minutes) Answering questions {only the one who has been called should Conclusion and recommendations"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "criteria",
        "ocr_text": "juating performance. March 04, 2024 it your pdf file before 44 4 pay (Grade 3 35 PM ‘Etemen Mary 3- a? i iransfer be iormation) ene npee alte ls hal a sar TOS 62 Content fobjective, methadoingy, 35 gewitsand ae souetsion)"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the feaming outcomes. And, it includes factors instructors will take into account when evaluating performance March 04, 2024 Submit your pdf file before 44 48 py (Grade 11 STEM A‘) Submit your pdf file Defore 3 35 PM (Elementary 3 A) August 18, 2025 Submit your pof file before 19 49 (i Saonnd yeer PRESENTATION EVALUATION L- Tata ~~ CRITERIA SCORE, Organization i ftitle, contents, lists Organization {tide, outline, smooth 31 of tables and ae transfer of information} Content febjective, methodology, results and conchision) [Garity (sides) Language and Pronunciation i 96 Presentation within the assigned Results ee time limits (15 20minutes} Conclusion and Answering questions {only the ene recommendations 3 whe has been called should answer) Total Score"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. it shows them how they can demonstrate they ve achieved the leaming outcomes. Arid, it includes factors instructors will take into account when evaluating performance. March 04, 2024 Submit your pdf file before 44 49 pay (Grade 11 STEM A © Submilt your pdf file before 3 95 pay ‘Elementary 3 A) August 18, 2025 Submit your pdf file before 1gi40 (i Sagand Year REPORT EVALUATION ~_ PRESENTATION EVALUATION “CRITERIA SCORE CRITERIA ss SCORE Organization flitls, contents, lists 2 Organization (title, outiine, smooth 31 transfer of information} [ct taoles and figures) Introduction and titeralure review G2 Content fobjective, methodology, results and conclusion) Clarity (slides 7 Languege and Pronunciation Results Answering questions (only the one who has been called should answer) _ Conchision and secommoendations 3 Total Score {"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the leaming outcomes. And, it includes factors instructors will take into account when evaluating performance. April 17, 2025 Submit your pdf file before 4 58 aM (Elementary 2 A:) e Submit your pdf file before 4 59 ay (Elementary 1 A) January 07, 2025 e Submit your pdf file before 07 (Elementary 1 B REPORT EVALUATION PRESENTATION EVALUATION CRITERIA SCORE CRITERIA Organization (title, contents, lists 71 Organization (title, outline, smooth of tables and figures) transfer of information) Introduction and literature review 24 Clear objective arity (slides) 7 Methodology AO. Results 2 Presentation within the assigned 82 time limits (15 20minutes) Conclusion and Answering questions (only the one recommendations 40 who has been called should 62 answer) Total Score"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "criteria",
        "ocr_text": "ted to do. It shows them how ar to leamers what they are expe’ And, it includes factors Criteria make it cle comes. y ve achieved the leaming out they can demonstrate the’ mance. account when evaluating perfot instructors will take into April 17, 2025 e Submit your pdf file before 4 58 AM (Elemental e Submit your pdf file before 4 29 AM (Elementary 4 0) ry 2 A‘) January 07, 2025 Submit your pdf file before RF (\\Elementary 1 B REPORT EVALUATION PRESENTATION EVALUATION CRITERIA CRITERIA Sm] contents, lists 71 pater fi (title, outline, smooth mation) of tables and figu' res) 71 Canter of info ce results and conclusion’ Clear ob Clear oes Methodolos yy A 3 Languag Franguage and Pronundation __| da om a Reed ren Results time limits (15- ren ‘Answering questions {only the one who has been called should Conclusion and recommendations"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the leaming outcomes. And, it includes factors instructors will take into account when evaluating performance April 17, 2025 e Submit your pdf file before 4 58 AM (Elementary 2 A e Submit your pdf file before 4 29 AM ‘Elementary 1 A) January 07, 2025 e Submit your pdf file before BF (Elementary 1 B PRESENTATION EVALUATION CRITERIA SCORE Organization (title, outiine, smooth 50 transfer of information) Content (objective, methodology, 31 results and conclusion) REPORT EVALUATION CRITERIA SCORE Organization (title, contents, lists 71 of tables and figures) Introduction and literature review 24 Clear objective Methodology AQ_| Language and Pronunciation Results 2 Presentation within the assigned 82 time limits (15 20minutes) Conclusion and Answering questions (only the one 62 recommendations 40 who has been called should answer) Total Score"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "criteria",
        "ocr_text": "April Januar 17, 2025 07, 2025 Snes 4 58 AM Elementary 2 4, “4 29 AN Elementary 1 4 Eee ‘Elementary 1 8 _PRESENTAT Tiok ve, metic results ‘Sand Conckesien| Anse poring questions fonky the one 1 who 3 been catied should"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "criteria",
        "ocr_text": "Criteria make it clear to leamers what they are expected to do. It shows them how they can demonstrate they ve achieved the leaming outcomes. And, it includes factors instructors will take into account when evaluating performance. April 17, 2025 Submit your pdf file before 4 58 AM (Elementary 2 A:) e Submit your pdf file before 4 59 ay (Elementary 4 0) January 07, 2025 e Submit your pdf file before 07 (Elementary 1 B) REPORT EVALUATION PRESENTATION EVALUATION CRITERIA SCORE CRITERIA SCORE Organization (title, contents, lists 71 Organization (tite, outline, smooth 50 of tables and figures) transfer of information} Introduction and literature review 24 Content (objective, methodology, results and conclusion} Clear objective Methodology AO. Results 2 Presentation within the assigned 82 time limits (15 20minutes} Conclusion and Answering questions (only the one recommendations 40 who has been called should 62 answer) Total Score"
    }
]