[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "criteria",
        "ocr_text": "Use Of tran sitions 84 evaluat 26 Fy pw eifectiv ely U Paes guides the through i poinis."
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Relevance The essay should 74% demonstrate aclea connection between \"he ‘topic, researct conclusions drawn Originality Creativity The use of authes tic 2 HSeSlé 35 personal expences origin the” Paths essay. Style and To Organization The essay follows a |{1 logical sequence of ideas, ensuring that arguments build upon leach other effectively. Language Proficiency Use of tre transitions 84\" uate ef how ectively the writer guides the reader through different points."
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Relevance The essay should 74% mo} al cqpncetn Bek yeen the topic, research, 2 conclusions drawn. Originality Creativity The use of authe} tic 5 el les al 3 personal experiences onesie Gate essay. Style and at tae The essay follows a Fin Organization logical sequence of 1 ideas, ensuring that arguments build upon each other effectively. Language Proficiency uate: S ectivel writer ules the reader through different points. Use of ransicyeOe"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Relevance a clea pe Fe eee he conclusions drawn Originality Creativity The use of authentic 5 examples an 3 Personal experiences 9 isghances the originality of an essay. Style and | Fi The @ssay follows a Organization logical sequence of 11 ideas, ensuri that arguments buil upon leach other effectively, Use of tran itions84° e uate hs Ww eliectively the writer guides the Treader through ifferent Points. ld rosie 74 Language Proficiency"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Relevance The essay should 74 oP eRN BAA topic, research conclusions drawn, Originality Creativity The use of authentic 5 examples ani 3 Personal experiences 9 igohances the Originality of an essay. Style and Jo ae The essay follows a Organization logical Secon of 1 ideas, ensuring that arguments build upon each other effectively. Language Proficiency ae Use Of transitions84 evalu tes pw effectively the writer guides the reader through different points."
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Relevance The essay structs structure should 55° Jeach sechon renforcing the main argument. Originality Creativity an essay shows originality 8 hse tt when ft eiets the writers 4 re others Style and Varying sentence Organization hoice cont al fee contri mic and: engag! writing ene my Chery of 33° expression measpres h how well comm te Som nd tind i"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "criteria",
        "ocr_text": "Vee yor r Organization s ructure and me a2 t i Ice vin ant Shyle Clarity of expression H imeagures how welt i i Ww"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "criteria",
        "ocr_text": "Criteria for ‘Student Essays Relevance Originality Cre: maintain lenich section reinforcing the main argument. The essay structure should 55° coherence, wit! Style and Organization Varying sf sentence us Language Proficiency Clarity of expression mei ages 1} how w commnunicat ites ideas ndet Sistan herent, jand une well"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "criteria",
        "ocr_text": "in Criteria for Student Essays al Relevance The essay structure should 55° he stan coherence, with emi section reinforcing the main argument Anessay shows originality ‘hen tt reflects the write ul ive an ity Creativity personal perspe {fer than, copying others work. Originalit Style and Organization Language Proficiency eras of 33 expression a measures how we Spent mmunicates Magen manner. CO! ane"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "criteria",
        "ocr_text": "| Varying senienoo 7? i ee Sfucture and word Spee eontbuteS i ®hgaging writing sivle = Clarity o 3} H [ex presen { reste. how well j Pay i les i nt H and tinders sian 38"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Relevance The essay should focus 3, directly on the assigned topic without including unrelated information Originality Creativity an essay shows originality p) when it reflects the witers personal perspective and insight rather than copying others work Style and Organization The essay followsa [14 logical sequence of ideas, ensuring that arguments build upon leach other effectively. Language Proficiency Appropriateness 95° of tone assesses whether he writing style suits the essays purpose and audience."
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "criteria",
        "ocr_text": "Van essay ShO89 (when Lite PD pe athe th others work, The essay follows ES y 4 jogizal sequence O! : tha at | 1 if ideas, 05 rir H build mgo7 gu! mits ih othar affectively. | | Appropriateness “95 of tone. PS | (wert nS S| vic ets ) the essays purpose and"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "criteria",
        "ocr_text": "Relevance Originalititey i i smzhage Profieienes Appropriateness O5* Of tone assesse yahether fe WHung sive su ihe essays purpose ang oo ai"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "criteria",
        "ocr_text": "Criterts tor Shident Bases, Styte and Panguaye Protfigenues Cc Appropratcness gS oft 3"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "criteria",
        "ocr_text": "largunrer leach other 2 (of fone j j writing style sults the essays j puIpose and nce"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "criteria",
        "ocr_text": "- ___ Criteria for Student Essays a hp Relevance “Every p Paragra raph should |> z | contribute meaning 20 fo the development o —{ the essay centralidea So Driginality Creat eativity i Onarnality also be 33 7 hieganweti fia é shrines convey the essays _ihe: |Site and A wellorganized essay Bg) 'y Organization le: ia introab eon, Fea ind | Conclusion that guide. | |yihe feader smoothly through the argument. 1 guage Prof Proficiency | Use of transitions53° | e ectively e |writer guides the | reader through different Points. |"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "criteria",
        "ocr_text": "|A well organized essay oat cleat \\ i yt i through the argument, i i Use o! sun transitions 53 | eng ales Now | y the | fer guides the i Trough i different points. i"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "criteria",
        "ocr_text": "Coiteria tor Stunient hee Use og tran rtonss 3 uales how EB fecively he writer guides ihe reader through | different pol"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "criteria",
        "ocr_text": "evaluate erect"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "criteria",
        "ocr_text": "reader through the argument. Use Of transitions 53° e uate Ww effectively the writer guides the reader through different points."
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays if argurnents an [Relevmice Tai nd 1168 examples must support | the main: thesis clearty and logically LL SSS Originality/© iCreativity Originaitty is evident when | he waiter explores |). H lesser known aspects of | topic instead 9 ef repestng te ao Style and (Clears ang concise iad spies e loverall clarity and \\ _ style of the essay. | ——t Spelling and 98° punctuation jcheck e rect use of wri | conventioy 3 Co) \\"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Relevance All arguments and 66 examples must support the main thesis clearly and logically. Originality Creativity Originality is evident when the writer explores lesser known aspects of a topic instead of repeating standard information. Style and fi b vee ieee rE) 5) improve the overall clarity and style of the essay. Language Proficiency Speling and 98° punctuation chéok the e Col rrect use oO} writ e conventions to thisunderstandings."
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Relevance All arguments and [46% examples must support the main thesis clearly and logically. Originality is evident when ¢4 the writer explores ie) lesser known aspects of a topic instead of repeating Standard information. Originality Creativity Style and = Organization _ _ Cl€ Land concise 45° improve the Overall clarity and Style of the essay, Spelling and gg* punctuation check the correct use of write; conventions to mhisunderstandings. Language Proficiency"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Relevance All arguments and 4g% examples must support the main thesis clearly and loaically. Originality Creativity Originality is evident when the writer explores lesser known aspects of a topic instead of repeating standard information. Style and Organization Clear and concise 45\" improve the overall clarity and style of the essay. Language Proficiency Spelling and 98” punctuation check the correct use of writte; conventions to"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "criteria",
        "ocr_text": "Spelling and 98° punctuation check the rect use O' writen conventions to isunderstandings."
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "criteria",
        "ocr_text": "Criteria for Stadeni Pasays — dieains ee vi rotations and cinton ey T7at eas ts a, | oon aise ba Lanai ou convey the tect pe i [Sie wad 0 COSCO jo s iClear ar ane concise k 90 improve ‘overall clarity and __ _ __ Style of the essay. __ _ __| Language Proficiency Argument 86\" cevelopment i sirsnath aan and support of ideas or opinions [Presented |"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Relevance rt iti most eae [78° Originality Creativity Oniginalty can also be 8 i lunconv tonal struct oF formats that otoatueRs: convey the essays b Style and Clear and concise Organization Sentenc 0 improve: Overall clarity and style of the essay. ‘Language Proficiency 5 ee ney Argument gg development strength dane, and Support of ideas or opinions presented."
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Quotations and citations [7_% Relevance must be pertinentand” 78 enhance the overall discussion father han reflect lunconventionel sfjuctures lor formats that effectively convey the essays message Originality Creativity Oriainalty can also be 6 Style and fi Ovgmizaion (clean. concise 0\" improve the overall clarity and style of the essay. Language Proficiency Ament 86° development easures th strength, clari and support of ideas or opinions presented."
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "criteria",
        "ocr_text": "Griteria for Student Essays Relevance Originality Cr vity Quotations and citations 7g must be per linen an cession inet ffan Onginality can also be 38 unconventional ef aes ur formats that effectively convey the essays Style and Organization [Language Pre — To Clear and concise 0 improve overall clarity and __istyle of the essay. Argument 86‘ developmem. ofronath, es diy, and support of ideas or opinions presented."
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "criteria",
        "ocr_text": "Age. i cop 4 ‘ear and concise : improve the } voverail clarity and : style of the essay. i Argument development reg thi"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "criteria",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "criteria",
        "ocr_text": "‘Relevance “The 2 (he -ectly on the Vtepic witout ine related inte \\Grammar acct acy 32 | evatuates {h ng i proper Us “tenses, and cture \\"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "criteria",
        "ocr_text": "vst Grgaaizayen ~~ Gyiteeda for Student Essays igirectiy on tne ass tops vathout including __} unrelated information di tive yoioe 3nd a Sie throw Bat the essay contributes to ts onginality and reader engagement... Varying sentence * structure and word quae contapules ‘Yow dynamic ang \\ engaging writing i style ia (Grammar accuracy 32° evaluates: the proper use o isyntax, tenses, and sentence staugture throughout the essay La"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "criteria",
        "ocr_text": "| i jeStay contibites to its i i originality and reader Varying senien. Organization Sbucture and {orl i j lenaice cents sues: } (10 8 dynamic anc Language Peoficiene 4 Grammar accuracy 3% evaluates 6rop eo Syntax, fenses, and j sepierce Sirus iyiure i FOURRGUI eésay. '"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "criteria",
        "ocr_text": "co ~~ Criteria for Student Es Essays _ i Relevance Tih \"The es essay howls foc Po {si é ™ {directly on the assi topic without inci ma _— unrelated information. |. \"Srlghnalitgh /Creativity |A i niCreativily Ag stnctve yore and ssay contributes to its i originality and reader | _erganement __ +=——— [Style and ‘eustare sentence |, a2 Organization roicg eo Sorbie iynamic and H engadl writing i style. 4 |Grarmmar accuracy 32° evaluates the proper use of syntax, lenses, and i SatredenSt fe? essay. [a _L. ee ee"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "criteria",
        "ocr_text": "eoncise 96 i improves Se loverall clarity and i Be istyle of the essay. guage Proficiency Grams curacy 25° the |Stvle and | Organization"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "criteria",
        "ocr_text": "= ses i i a cel Sivle and . i eS | Orguaization “gauges fs | style of the es: al i ‘4 ye sy Grammar accuracy 25 | evaluates se of |"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Relevance Supporting evidence 34 mu: be relevant and |directly tied to the points being discussed. Originality Creativity Originality is evident when the writer explores) leasor know, aspects of a ic instead of repeat Standard information. Style and Clear and i Organization ‘Sentences 6 improve overall clarity and style of the essay. =e ™°Y Grammar accuracy 25° evaluates the proper use 0 syntax, tenses, and Sefroughout ihe essay."
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "criteria",
        "ocr_text": "1On gna pepe wt iClear and GON se 5 Sariencgs 96° improve the joveral olanty and t gtyie of he assay. L { Grammar BOCUTACY 2 \\ avaluales ING t | proper sé O om eyes. tenses. H (seplen Ace stugiure iniough faut the"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "criteria",
        "ocr_text": "iClear and concise BS i sentence: | improve She | loverall clarity and istyle of the essay. _ fl iGrammar accura evaluates the | Broperuse cl i isynlax, g88, end | sent structure roug hat ‘i the essay."
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Relevance Every paragraph should 47% contribute meaningfully 17 to the development of the essay central idea Originality Creativity A distinctive yoice and 4 style throughout the 32 essay contributes to its originality and reader engagement. Style and Supporting evidence ly 5\\ Organization and examples are integrated smoothly to reinforce the main points without disrupting the flow. Language Profici Consistency in style33° examines whether ithe essay maintains a uniform approach in formatting and language use."
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "criteria",
        "ocr_text": "Criteria for Student Essays Relevance Every paragraph should 47% contribute meaningful to the development ot the essay central idea Originality Creativity A distinctive yoi d~ A enarCreatty |A SSRIS IOP RY 3 lessay contributes to its: originality and reader engagement. Style and Supporting evidence |4 5 Organization and examples are integrated smoothly to reinforce the main points without disrupting the flow. Language Proficiency 33° Consistency in style examines whether ithe essay maintains a uniform approach in formatting and language use."
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "criteria",
        "ocr_text": "Tple Limegrated Srnoothy | ito reinforce th eer Tain { BOInEs disruptin, e flow, geatency mi styie Sd es whethe: essay mat nS j pas Mion aboreach ; in formatting and BNguageE Use,"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "criteria",
        "ocr_text": "¥ para ee 08 ots Phe i originality 5 and feader 2ngagement i Hl Lintege ct Mo reiniorce tf cain | _,. Points without J disrupting he flow. eney in styied3 i Xarmines whether i 2 essay pares a Uniform approach fin fomnating and i t i language ti use :"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "criteria",
        "ocr_text": "Supporting evi I, and exainole ia ane Wi _, disrupting the flow. 1. ad | i lau i i in form | \\"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "criteria",
        "ocr_text": "Ete a oT \\ Ee { [ina iereativly oe ae Sn essay 7 one at, 7 1 __ common a oi es Seyte ond ~TSuppoiting evidence 46 Organization \\_and examples are | ere smoothly i orga ehont ____| digrapting the flow. 1--—-- a [aan Fraens Proficiency Ciasity of expression imeagpres at communicates, saree ie fi NE weil"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "criteria",
        "ocr_text": "beg i Relevance Pager nt show wide [77 | fata erie ing \\ jE =! clarity and purpose. i oe 5 [Originality Creativity cyanate in oe n ossay i is | ni wile prevanie Le 77 and unique wal ich eee aes pee —-3- Style and i supper evidence i 6 | Organization and examples are j integrated smeothly jto renforce, 8 ihe ain point __ _| cae the flow. ee aoe es [Langage Profietescy) Clarity of 76° ses | imea res we ats ia [Ld woe"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "criteria",
        "ocr_text": ": 3 are j i Ai rated machly i i ii reinforce: e main I _ Pe i H 76 i express fon measur Bh i i “he Wi waren I i ggoreeuiicet tes Si coherent ae Undersia"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "criteria",
        "ocr_text": "i Style and Organi vidence iq gv are 10 i Clarity of \\ expression } uneasures how well i ihe writer | com i i a j"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "criteria",
        "ocr_text": "aye SPRING { upperting nd examples are [Integrated smaoihly fo ramforce the maim | points without 4 disrupting the flow. - { ney Clarity of 7a { exoression i measures how well i i fer i | __ corununicaies iH lideas in a coherent i an erstendabie |"
    }
]