[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE a THIS CIPLOMA IS PRESENTED TG Ryan Gonzalez ee ee DATE Co Se ee"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE '# Hoe. THIS DIPLOMA IS PRESENTED To Ryan Gonzalez oe Reet nl tl In recognition of her course completion in the University Academy with the degree name Virginia Allen December 15, i SIGNATURE DATE"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE ee de eo THIS DIPLOMA iS SYESENTED TO Ryan Gonzalez ence course completion in the University with the degree name"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE #¢ See THIS DIPLOMA IS PRESENTED TO Ryan Gonzalez In recognition of her course completion in the University Academy with the degree name Virginia Allen December 15, a 2023 SIGNATURE DATE"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE ee BB Bete THIS DIPLOMA IS PRESENTED TO Ryan Gonzalez eae cetera ne etiennenanenenentintenir in recognition of her course completion in the University Academy with the degree name"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE '# Soe. THIS DIPLOMA IS PRESENTED To Lori Atkins In recognition of her course completion in the University Academy with the degree name Christopher January 21, SIGNATURE DATE"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "diploma",
        "ocr_text": "Lor Atkins. be caqurse CO on in the iversty miy with the degi"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE 2 oo THIS DIPLOMA IS PRESENTED TO Lori Atkins e completion in the University e name In recognition of her cours! Academy with the degre January 21, DATE Christopher SIGNATURE"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "diploma",
        "ocr_text": "yy weit"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE ee Goo THIS DIPLOMA IS PRESENTED TO Lori Atkins In recognition of her course completion in the University Academy with the degree name Christopher January 21, ——Ihomas__ SIGNATURE DATE"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE tephanie Patrick 9 )\\4\\) oe nin the University en, oF her Fae COL ich the degree Narne Seay"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE Goo THIS DIPLOMA IS PRESENTED TO Stephanie Patrick —__DVM___, In recognition of her course completion in the University Academy with the degree name becca August 10, 2025 SIGNATURE DATE"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE Soe. THIS DIPLOMA IS PRESENTED TO Stephanie Patrick In recognition of her course completion in the University Academy with the degree name becca August 10, 2025 SIGNATURE DATE"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE —'# Soe. —_ THIS DIPLOMA IS PRESENTED To Stephanie Patrick In recognition of her course completion in the University Academy with the degree name becca August 10, 2025 eee SIGNATURE DATE"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFIDATE ee THIS E OMA IS PRESENTED TO Stephanie Patrick tion of her Academy with the ¢"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "diploma",
        "ocr_text": "in recogivt of her course completion infversity ith the degre"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE _ 2¢ oe THIS DIPLOMA Is PRESENTED To Brandy Jackson completion in th he degree name January 23, DATE In recognition of her course e University Academy with tl Andrea SIGNATURE"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "diploma",
        "ocr_text": "ae sieatenene aes andy jacks son Tart saison"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE 2 oe THIS DIPLOMA IS PRESENTED TO Brandy Jackson ee In recognition of her course completion in the University Academy with the degree name Andrea January 23 SIGNATURE DATE"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE #¢ GS oe. THIS DIPLOMA IS PRESENTED TO Brandy Jackson In recognition of her course completion in the University Academy with the degree name Andrea January 23, SIGNATURE DATE"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "diploma",
        "ocr_text": "IPLOMAC CERTIFICATE nal Se I RECENTER TO"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "diploma",
        "ocr_text": "watetion in the Universi"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE #¢ Soe: THIS DIPLOMA IS PRESENTED TO Joseph Chen In recognition of her course completion in the University Academy with the degree name Jacob October 14, —2023_ __ SIGNATURE DATE"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE ee ne THIS DIPLOMA [S PRESENTED TO Joseph Chen in recognition of her course completion in the University Academy with the degree name yeacob October 14, SIGNATURE"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE —~2e eor-— THIS DIPLOMA IS PRESENTED TO Joseph Chen In recognition of her course completion in the University Academy with the degree name Jacob October 14, SIGNATURE DATE"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "diploma",
        "ocr_text": "BH PLOMA CERTIFICATE a THIS OIPLOMA 5 f OUISEe Corn ty with the"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "diploma",
        "ocr_text": "—:#¢ Soe. THIS DIPLOMA IS PRESENTED TO Michelle Howard In recognition of her course completion in the University Academy with the degree name avid July 20, 2024 SIGNATURE DATE"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE ee ee Te En TS"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "diploma",
        "ocr_text": "\"te Goo. THIS DIPLOMA Is PRESENTED To Michelle Howard ——__~ 1 ware In recognition of her course com; Academy with the d. avid July 20, 2024 SIGNATURE DATE pletion in the University legree name"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE =o eas Ae ae"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "diploma",
        "ocr_text": "—' Soe. —_ THIS DIPLOMA Is PRESENTED To Stephanie Carter nena In recognition of her course com Academy with the d psa April 10, 2024 ae) SIGNATURE DATE pletion in the University legree name"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE __. ee Soe THIS DIPLOMA IS PRESENTED To Stephanie Carter In recognition of her course completion in the University Academy with the degree name Lisa April 10, 2024 SIGNATURE DATE"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE a ae in rece"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "diploma",
        "ocr_text": "THIS DIPLOMA Is PRESENTED To Stephanie Carter ee In recognition of her course co} Academy with the idisa April 10, 2024 et SIGNATURE DATE mpletion in the University degree name"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE wee ee PRESENTED TO 1a) Let"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE 2e Gee THIS DIPLOMA IS PRESENTED TO Jennifer Gentry In recognition of her course completion in the University Academy with the degree name Ms. Whitney September 25, me) oe SIGNATURE DATE"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "diploma",
        "ocr_text": "Ot i ee... THIS Din; OMA Is PRESENTED Tm Jennifer Gentry in Fecognition of her ci Acaderny wir S€ COMPpletion jn the University ‘he degree fame SIGNATURE"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE ' #¢ oe. THIS DIPLOMA IS PRESENTED TO Jennifer Gentry In recognition of her course completion in the University Academy with the degree name Ms. Whitney September 25, SIGNATURE DATE"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE ee ern THis DIPU SENTED TO jennifer Gentry x xi dhl {ONATURE cranes ea ets"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "diploma",
        "ocr_text": "oe er THIS DIPLOMA 1S PRESENTED fo Jennifer Gentry a in recognitie a completion in the University pcademy Ms. Whitney __Williamison SIGNATURE senor oneness"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "diploma",
        "ocr_text": "BIPLOMA CERTIFICATE PD De ree, THIS DIPLOMA 1S PRESENTED TO Tamara Owens In recognition of her course COMBletion fry Aca demy with the degree na Jerome sooner AZ SIGNATURE ee the University me"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE Soe THIS DIPLOMA IS PRESENTED TO Tamara Owens In recognition of her course completion in the University Academy with the degree name Jerome January 13, SIGNATURE DATE"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE —' ## GS oe. THIS DIPLOMA IS PRESENTED To Tamara Owens el EL In recognition of her course com Academy with the d Jerome pletion in the University legree name January 13, SIGNATURE DATE"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE ee Goo THIS DIPLOMA IS PRESENTED TO Tamara Owens In recognition of her course completion in the University Academy with the degree name Jerome January 13, —2024___ SIGNATURE DATE"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE —-e Soe THIS DIPLOMA IS PRESENTED TO Tamara Owens In recognition of her course completion in the University Academy with the degree name Jerome January 13, ——2024 _ SIGNATURE DATE"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "diploma",
        "ocr_text": "eae spe ee iE"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICA TE ——~'F* Soe. THIS DIPLOMA Is PRESENTED TO August 30, 2025 SIGNATURE DATE"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "diploma",
        "ocr_text": "an OO OO THIS DIPLOMA is PRESENTED TO Michael Pitts pletion i the er COUTSE co on of fh th the degree naMe Academy wi Melanie SIGNATURE in resogniti"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICATE curse completion in the Univers Acaderny with the degres name Melanie"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "diploma",
        "ocr_text": "DIPLOMA CERTIFICA TE —~\"F# Doe. THIS DIPLOMA Is PRESENTED TO August 30, 2025 SIGNATURE DATE"
    }
]