[
    {
        "image": "dutiesandresponsibilities1_synth_10_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "ONSIGTLITIES Supervise laboratory operations to improve learning outcomes. Coordinate the community outreach to document progress. Facilitate the laboratory operations in collaboration with stakeholders. Supervise the research activities in collaboration with stakeholders."
    },
    {
        "image": "dutiesandresponsibilities1_synth_10_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "STATEMENT OF DUTIES AND BESBONSTSNE ITTES OF Ketnlown Kebey (Cour Supervise laboratory operations to improve learning outcomes. Coordinate the community outreach to document progress. Facilitate the laboratory operations in collaboration with stakeholders. Supervise the research activities in collaboration with stakeholders."
    },
    {
        "image": "dutiesandresponsibilities1_synth_10_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "SYATEMENT ©) ESPUNSIBILIEIES Supervise laboratory operations to improve learning outcomes. Coordinate the community outreach to document ~- Facilitate the laboratory operations in collaboration with stakeholders. Supervise the research activities in collaboration with stakeholders."
    },
    {
        "image": "dutiesandresponsibilities1_synth_10_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Di Barton Green tr STATEMENT OF DUTIES AND RESPONSIBILITIES OF kathleen Kelley (Coordinator) Supervise laboratory operations to improve learning outcomes. Coordinate the community outreach to document progress. Facilitate the laboratory operations in collaboration with stakeholders. Supervise the research activities in collaboration with stakeholders."
    },
    {
        "image": "dutiesandresponsibilities1_synth_10_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region 43 Divisionof Port Alicia Barton cent and aa Mena) 5573 Held St STATEMENT OF DUTIES AND RESPONSIBILITIES OF Kathleen Kelley (Coordinator) Supervise laboratory operations to improve learning outcomes. Coordinate the community outreach to document progress. Facilitate the laboratory operations in collaboration with stakeholders. Supervise the research activities in collaboration with stakeholders."
    },
    {
        "image": "dutiesandresponsibilities1_synth_1_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "PONSIBILTLIES Monitor community outreach to support program objectives. e with community outreach to ihe curricu improve learning oulcam Develop eauipmenit maintenance to enhance safety procedures. Supervise the curriculum materials te support or m objectiv Liaise with t Monitor t prograry"
    },
    {
        "image": "dutiesandresponsibilities1_synth_1_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "- Monitor community outreach to Support Program oblectives. Ligise with community outreach to document Progress. Coordinate the o improve learning outcomes, Develop equipment Maintenance to enhance s: fety procedures, Supervise the Suricuium materials to Support program objectives, Liaise with the assessy enhan Ment processes to ce Safely procedures. Supervise the com collaboration with Stakeholders. Monitor training sessions io support Program oblectives, Urriculum Materials to Munity oufreach in"
    },
    {
        "image": "dutiesandresponsibilities1_synth_1_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Educaton Region 4 Divisionof Fast Kevin Marsh Robinson University USCGC Gomez, FPO AP 53469 STATEMENT OF DUTIES AND RESPONSIBILITIES OF Reger Cras Conant Monitor community outreach to support program objectives. Liaise with community outreach to document progress. Coordinate the curriculum materials to improve learning outcomes. Develop equipment maintenance to enhance safety procedures. Supervise the curriculum materials to support program objectives. Liaise with the assessment processes to enhance safety procedures. Supervise the community outreach in collaboration with stakeholders. Monitor training sessions to support program objectives."
    },
    {
        "image": "dutiesandresponsibilities1_synth_1_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Fast Kevin Marsh Robinson University USCGC Gomez FPO AP 53469 STATEMENT OF DUTIES AND RESPONSIBILITIES Ronald Lowery (Teacher) OF Rageta Crusieseeene), Monitor communit Program objectives, Liaise with community outreach to document Progress. Coordinate the Curriculum materials to improve learning outcomes. Develop equipment maintenance to enhance Safety Procedures. Supervise the Curriculum materials to support program objectives. Liaise with the assessment processes to enhance Safety procedures, Supervise the community outreach in Collaboration with Stakeholders. Monitor training sessions to support Program objectives. y Outreach to support"
    },
    {
        "image": "dutiesandresponsibilities1_synth_1_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": ">not Fast Kevin Marsh Robinson University UscGc Gomez, FPO AP 53469 STATEMENT OF DUTIES AND RESPONSIBILITIES p Donald Lowery (Teachery OF Angela CRs eoedenen, Monitor community outreac! Program objectives. Liaise with community outreach to document Progress. Coordinate the curriculum materials to improve learning outcomes, Develop equipment maintenance to enhance Safety procedures, Supervise the Curriculum materials to Support program Objectives. Liaise with the assessment processes to enhance Safety procedures. Supervise the community outreach in collaboration with stakeholders. Monitor training sessions to support Program objectives, h to support"
    },
    {
        "image": "dutiesandresponsibilities1_synth_2_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "NSIBILETIES Document the research activities to enhance safety procedures. Facilitate training sessions to support program objectives. Liaise with laboratory operations to improve learning outcomes. Monitor the curriculurn materials to ensure compliance. Facilitate student activities to improve learning outcomes."
    },
    {
        "image": "dutiesandresponsibilities1_synth_2_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region 16 Divisionof Travismauith Ball Lewis and Walter University 166 Jennifer Keys, Frazierside, WI 27755 STATEMENT OF DUTIES AND RESPONSIBILITIES Marie Powell (Teacher) OF Victoria Midateton (Teacher) Document the research activities to enhance safety procedures. Facilitate training sessions to support program objectives. Liaise with laboratory operations to improve learning outcomes. Monitor the curriculum materials to ensure compliance. Facilitate student activities to improve learning outcomes."
    },
    {
        "image": "dutiesandresponsibilities1_synth_2_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region 46 sg Wravismonith Ball Lewis and Walter University 166 Jennifer Keys, Frazierside wi 27755 STATEMENT OF DUTIES AND RESPONSIBILITIES OF Venn! tcaston Pesener Document the research activities to enhance Safety Procedures. Facilitate training sessions to Support program objectives. Liaise with laboratory Operations to improve learning outcomes. Monitor the Curriculum materials to ensure compliance. Facilitate Student activities to 'mprove learning outcomes."
    },
    {
        "image": "dutiesandresponsibilities1_synth_2_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "STATEMENT OF pL Liks AND RESPONSUELET IES Document the research activities to enhance safety procedures. Facilitate training sessions to support program objectives. Liaise with laboratory operations to improve leaming outcomes. Monitor the curriculum materials to ensure compliance. Facilitate student activities to improve learning outcomes."
    },
    {
        "image": "dutiesandresponsibilities1_synth_2_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "f Travisennnith ‘d Walter University (V8, Frewiorsids, Wi 27755 STATEMENT OF DuTINs AND RESPONS tHE tris OF Tetther each Document the research ACtivities to enhance Safety Procedures. Facilitate training SeSsions to Support program objectives. Liaise with laboratory 9perations to improve learming Monitor the Curriculum Materials to ensure compliance. Facilitate Student activities to iMprove learning Outcomes."
    },
    {
        "image": "dutiesandresponsibilities1_synth_3_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region 3 Division of North Frin Anderson Hill and Davis University 441 BumettLake Suite 172, East Robert LA STATEMENT OF DUTIES AND RESPONSIBILITIES OF Jamie Martin (Coordinator) Nicole Bates (Faculty); Justin, Hahn (Teacher) Document assessment processes to improve learning outcomes. Evaluate student activities to ensure compliance. Develop training sessions to support program objectives. Develop the research activities for quality assurance. Evaluate assessment processes for quality assurance. Monitor the community outreach to document progress. Supervise the assessment processes to improve learning outcomes."
    },
    {
        "image": "dutiesandresponsibilities1_synth_3_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region 3 Division of North Erin Anderson Hill and Davis University $41 BumettLake Suite 172, EastRoben Le 1546 STATEMENT OF DUTIES AND RESPONSIBILITIES OF jamie Martin Coordinatory Nicole Bates (Facutty): Justin Hahn (Teacher) Document assessment Processes to improve learning o utcomes. Evaluate Student activities to ensure compliance. Develop training se Program objectives. Develop the research activities for quality assurance. Evaluate assess quality assurance. Monitor the community outreach to document Progress. Supervise the to improve lear Ssions to Support ment processes for assessment Processes ning outcomes."
    },
    {
        "image": "dutiesandresponsibilities1_synth_3_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "DR PONSIBILIDES Document assessment Processes io improve learning Outcomes, Evaluate Student activities to ensure compliance. Develop training Sessions to Support Program objectives. Develop the research activities for quality assurance, Evaluate assessment Processes for Quality assurance, Monitor the community outreach to document Progress. Supervise the as. Sessment Processes fo improve learnin g cutcomes,"
    },
    {
        "image": "dutiesandresponsibilities1_synth_3_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region 3 Division of North Frin Anderson Hill and Davis University 441 BumettLake Suite 172, East Robert LA STATEMENT OF DUTIES AND RESPONSIBILITIES OF Jamie Martin (Coordinator) Nicole Bates (Faculty); Justin, Hahn (Teacher) Document assessment processes to improve learning outcomes. Evaluate student activities to ensure compliance. Develop training sessions to support program objectives. Develop the research activities for quality assurance. Evaluate assessment processes for quality assurance. Monitor the community outreach to document progress. Supervise the assessment processes to improve learning outcomes."
    },
    {
        "image": "dutiesandresponsibilities1_synth_3_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "PONS TRE Tres Document assessment Processes ty improve Evaluate Stude ming cutcomes, compllance. Ml activities ty ensure Develop training SESSions to Support Program Oblectives, Develop the rese Quality &@88urance., Evaluate asse are ach activities for ssment quality ®@Ssurance, Monitor Processes for ine coramunity outreach to document progress. Supervise the assessment Processes to Improve learning outcomes,"
    },
    {
        "image": "dutiesandresponsibilities1_synth_4_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "ONSIRELDTES Supervise the communily outreach to Monitor community outreach to document te the laboralory operations to nt progress. Evaluate the student activities te document progress. Evaluate laboratory operations to ensure compliance. Monitor the research activit! learning outcom: Document training sessions to enhance safety procedures. to impr"
    },
    {
        "image": "dutiesandresponsibilities1_synth_4_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "University Camp Apt 068, Non foster, MIN 6387 Lopez 7577 VO! Connie UTIES AND RESPONSIBILITIES Janie Mckinney (Faculty) sSTATEME NI OF D) OF Mel Supervise the community outreach to document progress. Monitor community outreach to document progress. Facilitate the laboratory operations to document progress. Liaise with the equipme enhance safety procedures. _ Evaluate the student activit rogress. Evaluate \\abora erations to ensure compliance. Monitor the research activiti learning outcomes. Document training sessions to safety procedures. nt maintenance to jes to document tory OP ies to improve enhance"
    },
    {
        "image": "dutiesandresponsibilities1_synth_4_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "ONT OF DU Or INSTRILITIES Supervise the community outreach to cument progress, Monitor commur progress. Facilitate the laboratory operations to document progress Lisi ith the equipment maintenance to ennance safety procedures, Evaluate ihe student activities to document progress, Evaluate laboratory operations to ensure compliance. onilor the research activities to improve learning outcomes. Document training sé safety procedures. outreach to document sions to enhance"
    },
    {
        "image": "dutiesandresponsibilities1_synth_4_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "STATEMENT GFE OF AND RESPONSIBETTIES ervise the community outreach to oratory operations fo Ss ulpment maintenance to rent aie laboratory operations te nsure jearning outcomes. Document training sessions fo enhance ivities to improve"
    },
    {
        "image": "dutiesandresponsibilities1_synth_4_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Z LLG Unive STATEMENT OF DUTIN' Es OF ity outreach to Supervise the commu document progress. community ot ch to document progress. _ Egeilitate the laboratory operations to document progress. Liaise with the equipment maintenance to enhance safety procedures Evaluate the student activities to document progress. sgluate laboratory Op compliance. Monitor the resea learning outcomes. t iraini safety procedures. sure ations to er activities fo improve ns io enhance"
    },
    {
        "image": "dutiesandresponsibilities1_synth_5_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "~ Evaluate equiomer it Liaise with the curr Support program objectives, Coordinate equipmer improve fear leaming outcomes, Monitor assessment Program obiectives. Document the TES assurance, Evaluate the assessr improve igaming outeo Deveiop the a quality assy ANCA, ning outcome Develop research act earch ac sessment process ONS ES x ug improve learning outs maintenance to comes, culum matariais fo it maintenance to s. 'S fo improve processes to Support ment processes to mes. SSeS for"
    },
    {
        "image": "dutiesandresponsibilities1_synth_5_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region 46 Divisionof Matthawtown Levy Boyd University 7971 Willie Dale, North Sharon, MD 04213 STATEMENT OF DUTIES AND RESPONSIBILITIES OE Tavis Edwards (Teachen: Logan Smith (Staff; Melvin Skinner (Teacher) Evaluate equipment maintenance to improve learning outcomes. Liaise with the curriculum materials to support program objectives. Coordinate equipment maintenance to improve learning outcomes. Develop research activities to improve learning outcomes. Monitor assessment processes to support program objectives. Document the research activities for quality assurance. Evaluate the assessment processes to improve learning outcomes. Develop the assessment processes for quality assurance."
    },
    {
        "image": "dutiesandresponsibilities1_synth_5_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "STATEMENT oF OF BESPONSIBN ry RES Evaluete equipment my improve fs farring outcomes, Liaise with the curric 4 Support progr robie Coordinate equipment maintenance to impreve learning outcomes, Develop research activities to improve leaming outcomes, Monitor assessment pro Document the research assurance. Evaluate the assessment processes to improve j gaming outcomes. Develop the assessment processes for quality assurance, enance ta Um matenais te Ves. Cesses to support activities for Quality"
    },
    {
        "image": "dutiesandresponsibilities1_synth_5_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "! Matthawtawn yd University lie Dale, North Sharon, MD 04213 STATEMENT OF DUTIES AND RESPONSIBILITIES Skinner (Teacher) Evaluate equipment maintenance to improve learning outcomes. Liaise with the curriculum materials to support program objectives. Coordinate equipment maintenance to improve learning outcomes. Develop research activities to improve learning outcomes. Monitor assessment processes to support program objectives. Document the research activities for quality assurance. Evaluate the assessment processes to improve learning outcomes. Develop the assessment processes for quality assurance."
    },
    {
        "image": "dutiesandresponsibilities1_synth_5_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "STATEMENT OF DUTSES AND RESPONSIBELITIES or f Evaluaie equipment maint improve learning outcornes. Liaise with the cu m materials io support program obie Coordinate equipment improve learning out Develop research act leaming outcomes. Monitor assessment processes to support poeren Ghee enance fo nienance to 5 to improve arch activities for quailit Evaluate the assessment processes to improve learning oulcomes. Develop the assessment processes for quality assurarice."
    },
    {
        "image": "dutiesandresponsibilities1_synth_6_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region 13, pivisionof West... Munoz Graham and Gray University 3ea% Wesley Way, Lake Tammy, NH ‘NT OF DUTIES AND RESPONSIBILITIES STATEME! OF Shirley Benjamin (Teachen esearch activities to am objectives. essment processes procedures. unity outreach for Document r support progr Evaluate ass} to enhance safety Liaise with comm quality assurance. Facilitate the cur to enhance safety procedures. Supervise the community outreach to improve learning outcomes. Evaluate laboratory operations to ensure compliance. Document the curriculum materials to document progress. riculum materials"
    },
    {
        "image": "dutiesandresponsibilities1_synth_6_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "SEATEMENT OF DU OF Sh Document research activities to Support program oblectives, Evaluate assessment processes io enhance safety procedures, Liaise with communiy outreach for quality assurance, Facilitate the curriculum materials to enhance safety procedures. Supervise the community outreach to improve learning outcomes. Evaluate laboratory operations to ensure complianca, Document the curriculum Gu materials to docurnent progress."
    },
    {
        "image": "dutiesandresponsibilities1_synth_6_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "- Document research activities to support program objectives. Evaluate assessment processes to enhance safety procedures. Liaise with community outreach for quality assurance. Fact itate the curriculum materials to enhance safety procedures. Sup syise the community outreach to improve learning outcomes. Evaluate laboratory operations to ensure compliance. Document the curriculum materials to document progress."
    },
    {
        "image": "dutiesandresponsibilities1_synth_6_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region 13 Division of West, Munoz Graham and Gray University $8904 Wesley Way, Lake Tammy, NH 931 STATEMENT OF DUTIES AND RESPONSIBILITIES OF ‘Shirley Benjamin (Teacher) Document research activities to support program objectives. Evaluate assessment processes to enhance Safety procedures. Liaise with community outreach for quality assurance. Facilitate the Curriculum materials to enhance Safety procedures. Supervise the community outreach to improve learning outcomes. Evaluate laboratory Operations to ensure compliance. Document the Curriculum materials to document Progress."
    },
    {
        "image": "dutiesandresponsibilities1_synth_6_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "c mot West. Munoz Graham and Gray University agg Wesley Way, Late Tam NH STATEMENT OF DUTIES AND RESPONSIBILITIES OF Shirley Benjamin (Teacher) arch activities to objectives. ment processes procedures. ty outreach for Document rese support program Evaluate assess to enhance safety Liaise with communi quality assurance. Facilitate the curriculum materials to enhance safety procedures. Supervise the community outreach to improve learning outcomes. Evaluate laboratory operations to ensure compliance. Document the curriculum materials to document progress."
    },
    {
        "image": "dutiesandresponsibilities1_synth_7_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "ONSIBILITIES STATEMENT OF DUTIES OF Supervise the equipment maintenance to support program objectives. Document the student activities to ensure compliance. Coordinate curriculum materials to support program objectives. Coot rdinate the res search activities to document progress."
    },
    {
        "image": "dutiesandresponsibilities1_synth_7_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region 20 Divisionof Andreafort Peterson Bradshaw University USCGC Scott, FPO AE 57167 STATEMENT OF DUTIES AND RESPONSIBILITIES OF Rabph Mies (Coordnaton, lex Clarke Supervise the equipment maintenance to support program objectives. Document the student activities to ensure compliance. Coordinate curriculum materials to support program objectives. Coordinate the research activities to document progress."
    },
    {
        "image": "dutiesandresponsibilities1_synth_7_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Di ndreafon Peterson Bradshaw University PO AE 57167 USCGC Scott, F sT. ATEMENT OF DUTIES oF Baer! Ae xc ESPONSIBIL TIES tor) Supervise the equipment maintenance to support rogram objectives. Document the student activities to ensure compliance. Coordinate curriculum materials to SUPPO program objectives. Coordinate the research activities to document progress."
    },
    {
        "image": "dutiesandresponsibilities1_synth_7_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Andraafort Peterson Bradshene University UscGcC Scott, FPO AE 57167 STs ATEMENT on Rueres AND sora, PONSIBIL ITIES Supervise th the equipment maintenance to Support Program objectives. Docume nt the Student activities to ensure Compliance Coordi nate ye utriculum Materials t, Su Pport Program cheater Coordina e the research activities. to docume nt Progress"
    },
    {
        "image": "dutiesandresponsibilities1_synth_7_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "NSIRDUITTES supervise the equipment maintenance to Support Program objectives. Document the student activities to ensure compliance Coordi inate curriculurn Materials io support program objectives, 1 Goordin late the research activities to document progress,"
    },
    {
        "image": "dutiesandresponsibilities1_synth_8_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region 40 Divisionof Mirhaelfart Williams Miller University USNS Hill, FPO AE 51890 STATEMENT OF DUTIES AND RESPONSIBILITIES OF Michelle Logan (Stam); Russell Gordon (Teacher) Supervise laboratory operations in collaboration with stakeholders. Evaluate training sessions to document progress. Document the community outreach for quality assurance. Document the curriculum materials to ensure compliance. Supervise the curriculum materials in collaboration with stakeholders."
    },
    {
        "image": "dutiesandresponsibilities1_synth_8_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region ag oOo Michaeltort Williams Miller University USNS Hill, FPO AE 51890 STATEMENT OF DUTIES AND RESPONSIBILITIES OF Michelle Logan (Stam); Russell Gordon (Teacher) Supervise laboratory Operations in collaboration with Stakeholders. Evaluate training sessions to document progress. Document the community outreach for quality assurance. Document the curriculum materials to ensure compliance. Supervise the curriculum materials in collaboration with stakeholders."
    },
    {
        "image": "dutiesandresponsibilities1_synth_8_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "STATEMENT OF OF NSIBLLIPIES Supervise laboratory operations in collaboration with stakeholders. Evaluate training sessions to document progress. Dacument the community outreach for quality assurance. Document the curriculum materials to ensure compliance. Supervise the curriculum materials in collaboration with stakehoicers."
    },
    {
        "image": "dutiesandresponsibilities1_synth_8_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region 40 Division of Michaelfart Williams Miller University USNS Hill, FPO AE 51890 STATEMENT OF DUTIES AND RESPONSIBILITIES OF Michelle Logan (Stath; Russell Gordon (Teacher) Supervise laboratory operations in collaboration with stakeholders. Evaluate training sessions to document progress. Document the community outreach for quality assurance. Document the curriculum materials to ensure compliance. Supervise the curriculum materials in collaboration with stakeholders."
    },
    {
        "image": "dutiesandresponsibilities1_synth_8_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "ducation 10 Divisionof Michaelfort Williams Miller University USNS Hill, FPO AE 51890 STATEMENT OF DUTIES AND ESE ONSIBIEATIES Michele Logan (Sta Rus OF Gr rdon (Teac Supervise laboratory operations in collaboration with stakeholders. Evaluate training sessions to document progress. Document the community outreach for quality assurance. Document the curriculum materials to ensure compliance. Supervise the curriculum materials in collaboration with stakeholders."
    },
    {
        "image": "dutiesandresponsibilities1_synth_9_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Department of Education Region 3 Division of Chnstinebury Young Nichols and Gay University 169 Norris Tunnel, Rachelberg, KY 88249 STATEMENT OF DUTIES AND RESPONSIBILITIES OF Stephen Walker (Teacher Janet Johnson (Faculty), Tony Morales (Coordinator) Coordinate curriculum materials to enhance safety procedures. Coordinate the training sessions to support program objectives. Monitor curriculum materials in collaboration with stakeholders. Develop assessment processes to support program objectives. Develop research activities to ensure compliance."
    },
    {
        "image": "dutiesandresponsibilities1_synth_9_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "3 t Chnistinebury and Gay University el. Rachelberg, KY 88249 169 Nortis Tunn STATEMENT OF DUT TES AND RESPONSIBILITIES OF Coordinate curriculum materials to enhance Safety procedures. Coordinate the training sessions to Support program objectives. Monitor curriculum materials in collaboration with stakeholders. Develop assessment processes to support Program objectives. Develop research activities to ensure compliance."
    },
    {
        "image": "dutiesandresponsibilities1_synth_9_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "STATEMENT ©! OF Goordinate curriculum materials to enhance safety procedures. Coordinate the training sessions to support program objectives. Monitor curriculum materiais in collaboration with stakeholders. Develop assessment processes fo support program objectives. Develop research activities to ensure compliance."
    },
    {
        "image": "dutiesandresponsibilities1_synth_9_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "NSM TES Coordinate curriculum materials to enhance safety procedures. Coordinate the training sessions to support program objectives. Monitor curriculum materials in collaboration with siakeholders. Develop assessment processes to support program objectives. _ Develop research activities to ensure compliance."
    },
    {
        "image": "dutiesandresponsibilities1_synth_9_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "STATEMENT a DUTTES AND RESP INSIBILITiES OF Se Coordinate curriculy to enhance Safety pro Coordinate Sessions to 5 objectives. Monitor Curriculum Materials in Collaboration with Stakeholders. Develop assessment processes to support program objectives. Develop Search activities fo ensure compliance. M materials cedures, the training Upport program"
    },
    {
        "image": "dutiesandresponsibilities2_synth_11_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Ls COLLEGS FORWARD JOB DESCRIPTION Wish across way such t chat ge c control f busin s policy level. ce hospital training. ESSENTIAL DUTIES AND GES Evaluate assessment processes to document progress. Develop student activities to document progress. Document equipment maintenance fo ensure compliance. Liaise with training sessions to enhance safety procedures. Faciitate curriculum materials to enhance safety procedures. Monitor the student activities for quality assurance."
    },
    {
        "image": "dutiesandresponsibilities2_synth_11_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD Joy DESCRIOTION across Way Such “ge Control busines Across huge experienc. Evaluate asse cocument pro Develop Student activit document progress. Document equipment Maintenance to ensure compliance. Liaise with training Sessions to enhance Safety Procedures. Facilitate Curriculum Materials to enhance Safety Procedures. Monitor the 5 3) Student activities for quality assurance. team, Even fill S policy level, hospital training. ssment Processes to Oress. ies to"
    },
    {
        "image": "dutiesandresponsibilities2_synth_11_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD JOB DESCRIPTION Wish acro cnange o Across huge Evaluate assessment processes to document progress. Develop student activities to document progress. Document equipment maintenance to ensure compilance. Liaise with training sessions to enhance safety procedures. Facilitate curriculum materials to enhance safety procedures. Monitor the student activities for quality assurance. usiness policy le vel."
    },
    {
        "image": "dutiesandresponsibilities2_synth_11_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "@B) COLLEGE FORWaRD Jog DESCRIPTION Job Title: Cabin crew Class College d ‘Amanda Johnson FLSA Status Non Exempt Requisition Number: REQ 7807 Wish across Way such team. Even fill change contro business policy level, Across huge ©xperience Ospital training. ESSENTIAL DUTIES AND RESPONSIBILITIES: Evaluate assessment Processes to document Progress, Develop student activities to document Progress, Document equipment maintenance to ensure compliance. Liaise with training sessions to enhance Safety Procedures. Facilitate Curriculum Materials to enhance Safety Procedures Monitor the Student activities for quality assurance."
    },
    {
        "image": "dutiesandresponsibilities2_synth_11_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "> COLLEGE FORWARD JOB DESCRIPTION Job Title: Cabin crew Department: Class College REQ 7807 SUMMARY: Wish across way such team. Even fill change control business policy level. _ Across huge experience hospital training. ESSENTIAL DUTIES AND RESPONSIBILITIES: Evaluate assessment processes to document progress. Develop student activities to document progress. Document equipment maintenance to ensure compliance. Liaise with training sessions to enhance safety procedures. Facilitate curriculum materials to enhance safety procedures. Monitor the student activities for quality assurance."
    },
    {
        "image": "dutiesandresponsibilities2_synth_12_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "re Sy). COLLEGE FORWARD J08 DESCRIPTION Job Title: secondary school ment nent to: FASA Status Requisition Number ovement st ff control toward. e cover table arrive. ESSENTIAL DUTIES ANO RESPONSIBILITIES: _ Evaluate the research ac aRsue with community outreach to enh safety procedures. _ Evaluate the training sessions for quality assurance, a . “Develop the training sessions to impr learning outcomes. Coordinate assessment processes to improve learning outcomes. Liaise with the curriculum materials to enhance safety procedures. Supervise community outreach to ensure compliance. Monitor stu outcomes. tivities for quality ance ove dent activities to improve learning"
    },
    {
        "image": "dutiesandresponsibilities2_synth_12_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD 108 DESCRIPTION Jol, Tite: Beparenant: ovement staff contro! toward. Ve cover lacie arrive. ESSENTIAL DUTIES AND mESPONSiBILITiES: Evaluate the research activities for quality assurance, ; Liaise with community outreach to enhance safety procedures. Evaluate the training sessions for quality agsurance,, _ . Develop the training sessions to improve learning outcomes. Coordinate assessment processes fo improve learning outcomes. Liaise with the curriculum materials to enhance safety procedures. Supervise community outreach to ensure cormpliarice. Monitor student activities to improve learning auicomes."
    },
    {
        "image": "dutiesandresponsibilities2_synth_12_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD JOB DESCRIPTION Job Title: Teacher. secondary school Department: Fear Department Reports to: Kimberly Gallagher FLSA Status: Non Exempt Requisition Number: REQ 8921 SUMMARY: ovement staff control toward. e cover table arrive. ESSENTIAL DUTIES AND RESPONSIBILITIES: Evaluate the research activities for quality assurance “Liaise with community outreach to enhance safety procedures. Evaluate the training sessions for quality a surance, _. : Develop the training sessions to improve learning outcomes. Coordinate assessment processes to improve learning outcomes. Liaise with the curriculum materials to enhance safety procedures. Supervise community outreach to ensure compliance. Monitor student activities to improve learning outcomes."
    },
    {
        "image": "dutiesandresponsibilities2_synth_12_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD Jos DESCRIPTION Teacher. se: ndary school Department: Fea Deparimen oAATY Schoo} Reports to: Kimberty Gallagher FLSA Status: Non Exempt Requisition Number. REQ8921 SUMMARY, (ovement staff Control toward. cover table arrive. ESSENTIAL DUTIES AND RESPONSIBILITIES. Evaluate the research activities for quality assuranc - Pra! With community outreach to enhance Safety Procedures. Evaluate the training sessions for quality assurance velop the trainin learning outcomes. Coordinate asse: improve learning Liaise with the enhance Safety Procedures. Supervise community Outreach to ensure compliance, Monitor Student activities to improve learning Outcomes. 9 Sessions to improve Ssment processes to outcomes. Curriculum Materials to"
    },
    {
        "image": "dutiesandresponsibilities2_synth_12_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD JOB DESCRIPTION Teacher, secondary school Department: Fear Department Kimberly Gallagher Non Exempt Requisition Number: REQ 8921 SUMMARY; \\evement staff control toward. cover table arrive. Evaluate the research activities for quality 3 ae th community outreach to enhance Safety procedures. Evaluate the training sessions for quality assurance. Vevelop the training sessions to improve learning outcomes. Coordinate assessment processes to improve learning outcomes. Liaise with the Curriculum materials to enhance Safety procedures. Supervise community outreach to ensure compliance. Monitor student activities to improve learning outcomes."
    },
    {
        "image": "dutiesandresponsibilities2_synth_13_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD JOB DESCRIPTION Sing end well include. Media put buy clearly make. Contain compu iler listen. Liaise with the student activit ies in collaborati ion with stakehol ders. Monitor community outreach for quality assurance. Coordinate laboratory operations for quality assurance. Devel jop curriculum materials in collaboration with stakeholders. Liaise with community outreach to improve learning oulcomes. Coordinate the training sessions to document progress. RESPONSIRULITEES:"
    },
    {
        "image": "dutiesandresponsibilities2_synth_13_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD 308 DESCRISTION Sing end weil include. Media put buy clearly make. Contain computer listen. ESSENI ne 5 AMG RES! ut Liaise with the student activities in collaboration with stakeholders. Monitor cormmunity outreach for quality assurance. Coordinate laboratory operations for quality assurance. Develop curriculum materis collaboration witn stakeholders. Liaise with community outreach to improve learning outcomes. Coordinate the training sessions to document progress. in"
    },
    {
        "image": "dutiesandresponsibilities2_synth_13_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COUEGE FORWARD Jo8 DEsCRI TOR SUMMARY, 9 end well include. Media put buy clearly make. Contain computer listen. ESSENTIAL masz AND Resvonsianarigs, Liaise with the Student activities in collaboration with Stakeholders. Monitor community outreach for quality assurance. Coordinate laboratory operations for quality assurance, Develop curriculum materials in collaboration with stakeholders. Liaise with community outreach to improve learning outcomes, Coordinate the training sessions fo document brogress.,"
    },
    {
        "image": "dutiesandresponsibilities2_synth_13_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "* COLLEGE FoAWaRE JOR Descriprian Susenany: Sing end well include. Media put buy clearly make. Contain computer listen. Liaise with the student activities in collaboration with stakeholders. Monitor community outreach for Quality assurance. Coordinate laboratory operations for quality assurance. Develop curriculum materials in collaboration with Stakeholders. Liaise with community outreach to improve le: ming outcomes. Coordinate the training sessions to document progress,"
    },
    {
        "image": "dutiesandresponsibilities2_synth_13_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Kee» \\s ey COLLEGE FORWARD JOB DESCRIPTION Job Title: Clinical psvcholoaist Department: Long Department Reports to: Erica Greene Exempt risa sta tion Number: REQ 0530 ‘Sin end well include e. Media ut uy C clearly ma ake. Contain computer listen. Liais se with the tudent activities in collaboration n wi ret takeholders. Monitor co ommupnty outreach for quality assur Coordinate Taboraton fe) for quality assurance lum Develop curl collaboration W with s Liaise W! ith com impro rin eutcom Coordinate the training sess document progress. perations ions to"
    },
    {
        "image": "dutiesandresponsibilities2_synth_14_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Gey 2\") COLLEGE FORWARD JOB DESCRIPTION Job Title: Teacher. music Department: School of Line Reports to: ‘Amy Woods FLSA Status: Non Exempt Requisition Number: REQ8295 SUMMARY: Character before be experience prove movement western property. With whom bank ground party people. Matter thousand person final in skill drug available. Monitor laboratory operations to improve learning outcomes. Monitor assessment processes to enhance safety procedures. Supervise the curriculum materials to enhance safety procedures. Liaise with the equipment maintenance to document progress. Facilitate research activities for quality surance “eve op the laboratory operations to enhance safety procedures. Evaluate training sessions to ensure compliance."
    },
    {
        "image": "dutiesandresponsibilities2_synth_14_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD Joe DESCRIPTION Character b ice Movement property, With whom bank ground party eiore be ey perience prove westerr rly peopie. Aatter th fin ski drug available. Monitor laboratory Operations to iMprove learning outcomes. Monitor 4SSessment Processes to enhance Safety Procedures. Supervise the curriculum Materials to enhance Safety Procedures, Liaise with the equipment maintenan document Progress. Facilitate research a surance. Develop the Person fina ESSRITIAL OUDES ousand ce to activities for quality laboratory 9Perations fo enhance Safety Proceduras. Evaluate training Sessions to ensure compliance."
    },
    {
        "image": "dutiesandresponsibilities2_synth_14_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD JOB DESCRIPTION dob Title: Teacher. music Department: School of Line Reports to: ‘Amy Woods FLSA Status: Non Exempt Requisition Number: REQ 8295 Character before be experience prove movement western property. With whom bank ground party people. Matter thousand person final in skill drug available. Monitor laboratory operations to improve learning outcomes. Monitor assessment processes to enhance safety procedures. Supervise the curriculum materials to enhance safety procedures. Liaise with the equipment maintenance to document progress. Facilitate research activities for quality a surance, - Develop the laboratory operations to enhance safety procedures. Evaluate training sessions to ensure compliance."
    },
    {
        "image": "dutiesandresponsibilities2_synth_14_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "BS). COLLEGE FORWARD JOB DESCRIPTION Job Title: Teacher. music ‘School of Line Department: Reports to: ‘Amy Woods FLSA Status: Non Exempt Requisition Number: REQ S295 SUMMARY: Character before be experienc aon movement wes stern property Wt Ce) tter thousand bank ground party pe person final in skill drug Ie vailable. ESSENTIAL DUTIES AND RESPONS! Monitor lab learning outcomes Monitor assessment processes to enhance safety procedures Supervise the curriculum materials to enhance safety procedures Liaise with the an maintenance to document progres Facilitate earch activities for quality agsura ce, p the laboratory operations to evelo enhance safety procedures. _ Evaluate training sessions to ensure compliance. RESPONSIBILITIES: oratory operations to improve"
    },
    {
        "image": "dutiesandresponsibilities2_synth_14_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD JOB DESCRIPTION Job Title: Teacher. music Department: School of Line Reports to: ‘Amy Woods FLSA Status: Non Exempt Requisition Number: REQ 8295 ‘SUMMARY: Character before be experience prove movement western property. With whom bank ground party people. latter thousand person final in skill drug available. Monitor laboratory operations to improve learning outcomes. Monitor assessment processes to enhance safety procedures. Supervise the curriculum materials to enhance safety procedures. Liaise with the equipment maintenance to document progress. Facilitate research activities for quality assurance Bevel lop the laboratory operations to enhance safety procedures. Evaluate training sessions to ensure compliance."
    },
    {
        "image": "dutiesandresponsibilities2_synth_15_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "* COLLEGE FORWARO Jo DESCRIPTION SUMMARY. Would you watch owner sound €gin up. Same drop usually campaign man activity yourself. ESSENTIAL DUTIES AND ResFONSioN Mes. Monitor the student activities for quality assurance. Monitor the student activities for quality assurance. Evaluate the research activities to Support program objectives, Coordinate laboratory Operations fo document progress,"
    },
    {
        "image": "dutiesandresponsibilities2_synth_15_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "di. COLLEGE FORWARD JOS DESCRIPTION ‘actice doctor SUMMARY, Would you watch owner sound begin up. Same drop usually campaign man activity yourself, ESSENTIAL DUTIES AND RESPONSIBILITIES: Monitor the student activities for quality assurance. Moniior the student activities for quality assurance. Evaiuate the research activities to support program objectives. Coordinate laboratory operations to document progress."
    },
    {
        "image": "dutiesandresponsibilities2_synth_15_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD JOB DESCRIPTION Would you. watch owner sound begin up. Same drop usually campaign man activity yc ourself, Monitor the stude nt activities for quality assurance. Monitor the student activities for quality assurance. Evaluate the research activities to support program objectives. Coordinate laboratory operations to document progress."
    },
    {
        "image": "dutiesandresponsibilities2_synth_15_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "wz J» COLLEGE FORWARD 406 DESCRIPTION SUMMARY: Would you watch owner sound begin up. Same drop usually campaign man activity yourself. Monitor the student activities for quality assurance. Monitor the student activities for quality assurance. Evaluate the research activities to support program objectives. Coordinate taboratory operations to document progress."
    },
    {
        "image": "dutiesandresponsibilities2_synth_15_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD 508 DESCRIPTION Would you watch owner sound begin up. Same drop usually campaign man activity yourself. Monitor the student activities for quality assurance. Monitor the Slee nt activities for quality assuranc Evaluate the research activities to support program objectives. Coordinate laboratory operations to document progress. DUTIES AnD RESPORSINLETIES:"
    },
    {
        "image": "dutiesandresponsibilities2_synth_16_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "> COLLEGE FORWARD JOB DESCRIPTION Site engineer End College Stephanie Harrison Non Exempt REQ5762 Between firm left some agency many. Raise be yes language any. Will item wide star material form town. ESSENTIAL DUTIES AND RESPONSIBILITIES: Monitor the laboratory operations to support program objectives. Develop the curriculum materials to document progress. Document the training sessions for quality assurance. Evaluate the community outreach to document progress. Supervise the curriculum materials to document progress."
    },
    {
        "image": "dutiesandresponsibilities2_synth_16_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "> SOLLEGE FORWARD JOR DESCUPTICN Between firm lefl same agency many. Raise be yes language any. Will item wide star material form LOW ESSENTIAL i Monitor the labora ory operations to support program Sbeclives Develop the curriculum materials to document progress. Document ihe training sessions for quality assurance. Evaluate the community outreach fo document progress. Supervise the curriculum materials to document progress. RESPONSHRNITIES"
    },
    {
        "image": "dutiesandresponsibilities2_synth_16_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "+ COLLEGE SORWARD JOB DESCRIPTION Between firm efi some agency many. Rais ise be yes lan igitage al any. Will tern wide star material form town. - Monitor the laboratory operations to support prograrn objectives. Develop the curriculum materials to document progress. Document the training sessions for quality assurance. Evaluate the community outreach to docurnent progress. Supervise the curriculum materials to document progress. ATES:"
    },
    {
        "image": "dutiesandresponsibilities2_synth_16_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "LE} = COMEGE FORWARD JOB DESCRIPTION SUMMARY: Between firm left some agency many. Raise be yes language any. will tem wide star material form ESSENTIAL OUTUES AND RESPONSIGILITNIES: Monitor the laboratory operations to support program objectives. Develop the curriculum materials to document progress. Document the training sessions for quality assurance. Evaluate the community outreach to document progress. Supervise the curriculum materials to document progress."
    },
    {
        "image": "dutiesandresponsibilities2_synth_16_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "i t COLLEGE FORWARD JOB DESCRIPTION Ss) Job Title: Site enaineer Department: End College Reports to: Stephanie Harrison FLSA Status: Non Exempt Requisition Number: REQ ST62 Between firm left some agency es language any. many. Raise be y will item wide star material form ESSENTIAL DUTIES AND RESPONSIBILITIES: Monitor the laboratory operations to support program objectives. Develop the curriculum materials to document progress. Document the training sessions for quality assurance. Evaluate the community outreach to document progress. Supervise the curriculum materials to document progress."
    },
    {
        "image": "dutiesandresponsibilities2_synth_17_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "-- Sy) COLLEGE FORWARD JOB DESCRIPTION Job Title: Trade mark attornev Department: School of Debate Reports to: Jessica Brown FLSA Status: Exempt Requisition Number: REQ 7532 ‘SUMMARY: Machine arrive citizen special. Fyofessic alcan mean... anage discuss strategy if. ESSENTIAL DUTIES AND RESPONSIBILITIES Facilitate the assessment processes to document progress. Supervise research ac' objectives. Coordinate the training sessions to document progress. Coordinate the assessment processes to support program objectives. Monitor the assessment proce safety procedures. Document the research activities to document progress. Monitor community outreach to document progress. , Monitor community outreach in collaboration with stakeholders. tivities to support program isses to enhance"
    },
    {
        "image": "dutiesandresponsibilities2_synth_17_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD JOB DESCRIPTION dob Title: Trade mark attorney Department: School of Debate Reports to: Jessica Brown FLSA Status: Exempt Requisition Number: REQ 7532 suMMaRy: Machine arrive citizen special. Motession al can mean. anage discuss strategy if. ESSENTIAL DUTIES AND RESPONSIBILITIES: Facilitate the assessment processes to document progress. Supervise research activities to support program objectives. Coordinate the training sessions to document progress. Coordinate the assessment processes to support program objectives. Monitor the assessment processes to enhance safety procedures. Document the research activities to document progress. Monitor community outreach to document progress. Monitor community outreach in collaboration with stakeholders."
    },
    {
        "image": "dutiesandresponsibilities2_synth_17_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD 108 GESCRIPTION Machine arrive citizen special. Professional can mean. Manage discuss strategy if. seSuTuS quTieg an AesPONSIMA TIES Facilitate the assessment processes to document progress. Supervise research activities to support program objectives. nate the training sessions to document rdinate the assessment processes to support program objectives. Monitor the assessment processes to er safety procedures. Document the research activities to docurnent progress. Monitor community outreach to document progress. Monitor community outreach in collaborati with stakeholders. hance"
    },
    {
        "image": "dutiesandresponsibilities2_synth_17_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "cana COLLEGE FORWARD JOB DESCRIPTION Job Title: Trade mark attorney Department School of Debate Reports to: FLSA Status: Requisition Number: REQ SUMMARY: Machine arrive citizen special. ofession alcanmean. anage discuss strategy if. ESSENTIAL DUTIES AND RESPONSIBILITIES: Facilitate the assessment processes to document progress. Supervise research activities to support program objectives. Coordinate the training sessions to document progress. Coordinate the assessment processes to support program objectives. Monitor the assessment processes to enhance safety procedures. Document the research activities to document progress. Monitor community outreach to document progress. ; - Monitor community outreach in collaboration with stakeholders."
    },
    {
        "image": "dutiesandresponsibilities2_synth_17_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD Jos. DESCRIPTION Job Title: Trade mark attorney Department: School of Debate rts to: Jessica Brown FLSA Status: xempt Requisition Number: REQ 7537 suMMary: Machine arrive citizen special. ofessional can mean. anage discuss Strategy if. ESSENTIAL DUTIES AND RESPONSIBILITIES: Facilitate the asses. document Progress. Supervise research activities to support Program objectives. Coordinate the training sessions to document Progress, Coordinate the assessment Support program objectives, Monitor the assessment Processes to enhance Safety Procedures. Document the research activities to document Progress. Monitor community Outreach to document Progress. Monitor Community outreach in Collaboration with Stakeholders. sment processes to Processes to"
    },
    {
        "image": "dutiesandresponsibilities2_synth_18_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COiLee Jok Tide: Tade sit option wit i catch, tage far s sing] a house ane ial own “eco nomy merri cay Rigtration: contir regi ion ‘au tel wa curriculum Materials to a eatety Procedures. cllitate the student qua ity assurance, Evaluate the Curriculum Materials to document progress. Liaise with the training SéSsions to enhance s Safety Procedures. Evaluate curriculum mater ials f Quality assurance, Coordi Mate the traink: AQ sessions in collaboration y ith s Stakehol ders, Supervise the lab “oratory operations document progress, activities for"
    },
    {
        "image": "dutiesandresponsibilities2_synth_18_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORMIARG JUD DESCRIPTION Shake security trade sit option wil catch. Financial own economy marriage far single season. Administration continue House eSqion quay tell want. Eres ANTES ANE RESROMITERLITIES: Document curriculum materials fo enhance safety procedures. _ Facilitate the student activities for quality assurance. _ Evaluate the curriculum materials to document progress. Liaise with the taining sessions to enhance saiely procedures. Evaluate curriculum materials for quality assurance. Coordinate the training sessions in collaboration with stakeholders. Supervise the laboratory operations 10 document progress."
    },
    {
        "image": "dutiesandresponsibilities2_synth_18_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "SS COLLEGE PORN: Shake sect Financial own ecor wity trade git opto season. Admini stration comlnus region quality tel want egg ntiah QUTIES ANG RESPOMSIBRT ies: Document cur enhance safety Pp Facilitate the studen uality assurance Evaluate the document pF _ Liaise with the training sessions {0 enhance safety procedures. Evaluate curriculum materials for quality assurance. collaboration V ath stakeholders. Supervise the laboratory operations to document progress. CUI) materiais te rocedures. t activities for foulum materials fo"
    },
    {
        "image": "dutiesandresponsibilities2_synth_18_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "ED SSF), COLLEGE FORWARD 408 DESCRIPTION Administrator. sports: Job Tithe: ‘Schoo! of Analy? crrett Departmen Reparts te FLSA State Requisition Murr summary: Shake security trad Financial own economy Te. season. Agministaont contin region qua ity tell wank. ESSENTIAL purges AND RESPONSIBILITIES: Document curriculum materials to enhance safety procedures. Facilitate the student activities for quality assurance. Evaluate the curricul document progress. _ Liaise with the training sessions to enhance safety procedures. Evaluate curriculum materials for uality assurance. Coordinate the training sessions in collaboration with stakeholders. Supervise the laboratory operations to document progress. e sit option will catch. marriage far single ue house jum materials to"
    },
    {
        "image": "dutiesandresponsibilities2_synth_18_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "«Ss 22) COLLEGE FORWARD JOB DESCRIPTION Job Title: Administrator, sports. Department: School of Analysis. Reports to: Daniel Farrell FLSA Status: Non Exempt Requisition Number: REQ 8328 Shake security trade sit option will catch. Financial own economy marriage far single season. Admini tration continue house region quality tell want. ESSENTIAL DUTIES AND RESPONSIBILITIES: Document curriculum materials to enhance safety procedures. Facilitate the student activities for quality assurance. Evaluate the curriculum materials to document progress. Liaise with the training sessions to enhance safety procedures. Evaluate curriculum materials for quality assurance. Coordinate the training sessions in collaboration with stakeholders. Supervise the laboratory operations to document progress."
    },
    {
        "image": "dutiesandresponsibilities2_synth_19_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "* COUSGE FORWARD Jog SESCRP Tay Engineer 3utomotive Oapertinunt: Resource Denertrens Audience pass defense ‘rip Single histo attack off Agreement USINess open Option. Whefe bed civil. Dream today better size concern, RESPONSIPILy ESSENTIAL OUTS AND Supervise the research activities to enhance Safety Procedures. Monitor the equipment Maintenance to document progress. Develop training SEssions to Support program objectives. Evaluate the curriculum Materials document Progress, THES:"
    },
    {
        "image": "dutiesandresponsibilities2_synth_19_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "> COLLEGE FORWARD JOB DESCRIPTION Job Title: Enaineer, automotive Department: Resource Department Steven Jordan Non Exempt 2 REQ0878 SUMMARY: Audience pass defense trip attack off single history. Agreement business open option. Where bed civil. Dream today better size concern. ESSENTIAL DUTIES AND RESPONSIBILITIES: Supervise the research activities to enhance safety procedures. Monitor the equipment maintenance to document progress. Develop training sessions to support program objectives. Evaluate the curriculum materials to document progress."
    },
    {
        "image": "dutiesandresponsibilities2_synth_19_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD 108 DESCRIPTION udience pass defense trip attack off single history. Agree i business open option. Where bed civil. Dream teday asst A RESPONSIBILITIES: Supervise the researcn activities to enhance safety procedures. Monitor the equipment maintenance to document progress. Develop training sessions to support program objectives. Evaluate the curriculurn materials to document progress."
    },
    {
        "image": "dutiesandresponsibilities2_synth_19_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "” COLLEGE FORWARD JoB DESCRIPTION Enaineer, automotive Resource Department Steven Jordan Non Exempt re REQ 0B78 suMMaRy: Audience pass defense trip at single history. Agreement business Open Option. Where bed civil. Dr attack off eam today better size concern. Supervise the research activities to enhance Safety procedures. Monitor the equipment maintenance to document Progress. Develop training sessions to Support program objectives. Evaluate the Curriculum materials to document Progress."
    },
    {
        "image": "dutiesandresponsibilities2_synth_19_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "4 COLLEGE FORWARD JOB DESCRIPTION dob Title: Enaineer. automotive Department Resource Department SUMMARY: Audience pass defense trip attack off single history. Agreement business Open option. Where bed civil. Dream today better size concern. Supervise the research activities to enhance safety procedures. Monitor the equipment maintenance to document progress. Develop training sessions to support program objectives. Evaluate the curriculum materials to document progress"
    },
    {
        "image": "dutiesandresponsibilities2_synth_20_aug1.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FoR¥ iment detq Agency as lawyer our. Ust autho rity six otf Deveiop the equipment maintenance to document progress Monitor equipment maintenance to improve learning outcomes. Supervise research activities to document progress. Liaise with the research activities n collaboration with stake holders. Coordinate the student activities to ensure compliance. Develop the research activities to improve learning outcomes unistration sacher"
    },
    {
        "image": "dutiesandresponsibilities2_synth_20_aug2.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "rE 2S). COLLEGE FORWARD J08 DESCRIPTION Inve stment detail road could discussion at shake. sent eS Anside as a 1 stration ask lawyer Our. Usually yeah teacher authority six other sense out. Develop the equipment maintenance to document progress. Monitor equipment maintenance to improve learning outcomes. Supervise research activities to document progress. Liaise with the research activities in collaboration with stakeholders. Coordinate the student activities to ensure compliance. Develop the research activities to improve learning outcomes."
    },
    {
        "image": "dutiesandresponsibilities2_synth_20_aug3.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "COLLEGE FORWARD 206 EEScRIPTION investment detail fad could discussion at shake. A gency inside as aaministration ask lawyer our Usually yeah teacher authority six other Sense out. sn Develop the equipment maintenance to document progress. Monitor equipment maintenance to improve learning outcomes. Supervise research activities to document progress, Liaise with the research activities in collaboration with stakeholders. Coordinate the student activities to ensure compliance. Develop the research activities to improve learning outcomes."
    },
    {
        "image": "dutiesandresponsibilities2_synth_20_aug4.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "Ge FORWARD JOB DESCRIPTION vesiment detail ro¢ shake. Agency insice adminis: ask lawyer Our. Usually yeah teacher authority six other sense oul Develop the equipment maintenance to document progress. Monitor equipment maintenance to improve learning outcomes. Supervise research activities to document progress. Liaise with ihe research activities in collaboration with stakeholders. Coordinate the student activities to ensure compliance. Develoo the research activities io improve iearning outcomes. aS"
    },
    {
        "image": "dutiesandresponsibilities2_synth_20_aug5.png",
        "label": "dutiesandresponsibilities",
        "ocr_text": "(i) COLLEGE FORWARD JOB DESCRIPTION Job Title: Field seismoloaist Department: Manage College Reports to: Thomas Underwood FLSA Status: Non Exempt Requisition Number: REQ 6758 Invgstment detail :2Ad cout ainistiation ask lawyer our. Usually yeah teacher authority six other sense out. Develop the equipment maintenance to document progress. Monitor equipment maintenance to improve learning outcomes. Supervise research activities to document progress. Liaise with the research activities in collaboration with stakeholders. Coordinate the student activities to ensure compliance. Develop the research activities to improve learning outcomes."
    }
]