[
    {
        "image": "employmentrecord1_synth_10_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "BRENGAN V4 COLLEGE LUE STATE EMPLOYEE RECORD FORM Name, Venus Street, Megan V cur Yel Nofsi _O& Department Date of fr coen ana o93e i"
    },
    {
        "image": "employmentrecord1_synth_10_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "BRENDAN VILLE STATE COLLEGE EMPLOYEE RECORD FORM wae AD: Curannt Residential Aatcnes® sationsity Divorced Marital status:"
    },
    {
        "image": "employmentrecord1_synth_10_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "BRENDAN VILLE STAT COLLEGE EMPLOYEE RECORD FORM Cody ville Contra: i. Biecen vi 2827 2030 i"
    },
    {
        "image": "employmentrecord1_synth_10_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "BRENDAN VILLE STATE COLLEGE EMPLOYEE RECORD FORM tame ADAM R. THOMAS _ oo a corre Residents Address. 6792 Vets Street, Megan Vile mag: michael lopez omsil. com Tel. Nofsh 0088 512 2775, State of Origin, Regina Vite Province toa: Witton Vile Municipality’ Date of ith: September 10, 1985 attra: Fatpane Oo Gender, Mate Marital status Ovorced Genotype AS row BE Designation: Department Chat Cepartmens: College of Business Adminstration a Date of fmplorment: May 30 2018 _ _Wranche_Dastara Ve Mein Cones, ACADEMIC QUALIFICATION [ame K adaiess of ‘Shoals. Colleges. university, ete. “From Te Cartilcates Obtamied —~} cody Vile Cantal GemenmyScnot HE Metanie Vite State University —| tom |_ to Positions Held $2012 2016 Aemiiadve assntant tf ee 2019 2621 trainer zozv 2000 Saeent*"
    },
    {
        "image": "employmentrecord1_synth_10_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "BRENDAN VILLE STATE COLLEGE Nene ABAM 5782 Venus Str SH Resilentiss Adress: 8782 Venus Strat Genotype: AS nation, Department ¢) air arbre Ville COGN Mite Cena! Eterm, Nationa High Senet 00! Diner a ei Isirony yg ie Gratuit 08 Compater Emplover s Contact P Renee Vite Fomciteatne Resins faminetstive Assbtant i"
    },
    {
        "image": "employmentrecord1_synth_1_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "COURTNEY VILLE STATE UNIVERSITY EMPLOYEE RECORD FORM Name_RENEE R. PORTER Current Residential Address: 7437 D Bouganvilla Street, Jonathan Ville Tel. No s): 0928 995 4667 Email; _barbara smith yahoo com State of Origin: Sydney Ville Province ca; Joshua Ville Municipality Date of Birth: June 14, 1995 Nationality: Filipino Gender: Male Marital Status: Married Genotype: AC Blood Group_A- Designation: Administrative Officer IV Department: College of Computer Studies Date of Employment; November 29, 2019 Branch; Morgan Ville Main Campus ‘ACADEMIC QUALIFICATION Name Address of Schools, Colleges, university, etc. From To Certificates Obtained Dean Ville Central Elementary School 1991 1997 Elementary Diploma Joshua Ville National High School 1997 2001 High School Diploma Paul Ville State University 2001 2005 Bachelor of Science in Education Master n Business Victoria Ville Graduate School 2006 2008 ‘Administration PREVIOUS EMPLOYMENT DETAILS: Employer s Contact Name of Employer Address of Employer Details From To Positions Held Busse Vile National Hah naan Vile, Mindanao 861 404 6497 2009 2014 instructor Hayley Ville Senior High School Andrew Vile, Mindanao (0924 750 4386 2014 2017 Instructor It Benjamin Vile State Colege Michele Vile, Mindanao 0948 458 7775 2023 2027 Instructor i"
    },
    {
        "image": "employmentrecord1_synth_1_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "COURTNEY VILLE STATE UNIVERSITY EMPLOYEE RECORD FORM cumvent Resident Address 7437 0 Buuganvita Street, Jonathan Vile Tel Nojs}: 0828 905 4657 state of Origin, Sydney Vite Pron’ ——— 16h: Joshua Vie Municpemy __ ate of with, June 14, 1995 Nationality: Fp emai: barbara smith yahoo cem Gender; Male a Metal Stats, Mazer Genotype: AC _ Sood Group, A a Date of mnloyment: November 29 2019 sranen, Morgan Vile Main Campus ACAOEMC QUALIFICATION Seen Vile Contai Elemantary Schoo! Name aaavess of schools, Cottages, unbearsivy, fc, From im T Cartiteates OStained Joshua Vile Nationa! High Schoo! | Paxn Vite State Urawersny"
    },
    {
        "image": "employmentrecord1_synth_1_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "COURTNEY VILLE STATE UNIVERSITY EMPLOYEE RECORD FORM Name RENEE R. PORTER Current Residential Address _7437 D Bouganvilla Street, Jonathan Ville Tel. No s _0928 995 4667 Emait; barbara smith yahoo com See ot rg: Syney Vie Province tc Joshua Vile Municipality Sydney Vile Province Date of Birth: June 14, 1995 Nationality: Filipino Gender, Male sMared Genotype: AC Blood Group_A- og 7 Designation: Administrative Officer IV Department: College of Computer Studies Date of Employment: November 29, 2019 ranch: Morgan Vile Main Campus ACADEMIC QUALIFICATION Name Adress of Schools, Colleges, university, ete _| from To] eerteates Obtained Dean Ville Central Elementary School 1991 1997 Elementary Diploma Joshua Ville Natonal High Schoo! 1997 2001 High School Diploma Sa 201 2005 bacnetoror science mn Eaucaton Victoria Ville Graduate Schoo! 2006 2008 —_| Master in Business PREVIOUS EMPLOYMENT DETAILS: Name of Employer Address of Employer Senos “Se Naonatton snaun Ve, Mindanao Hayley Vite Senior High School Andrew Vite, Mindanao Benjamin Vile State Cotege Michele Vile, Mindanao"
    },
    {
        "image": "employmentrecord1_synth_1_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "COURTNEY VILLE STATE UNIVERSITY EMPLOYEE RECORD FORM veene RENEE R. PORTER em 7437 D Bouganvita Street, Jonahan Vale “7431 0 Bouganila See, NN I stace of Cee: SyaHeY Vile PIES. ote of Bit, Lune 14, 1905, 2 4 NS em Date of Emptovement: November 28, 2019 ranch _Morg aap RCADEMIC QUALIFICATION. a a"
    },
    {
        "image": "employmentrecord1_synth_1_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "COURTNEY VILLE STATE UNIVERSITY EMPLOYEE RECORD FORM ho te PREVIIOS O HLT DEY"
    },
    {
        "image": "employmentrecord1_synth_2_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "KATHY VILLE UNIVERSITY EMPLOYEE RECORD ForM Name APRIL M. HALL Current Resertal Adcress 6157 E Frankin Street, Dana Vile Tel No s) 0926 196. Emad _Chestopher lee gmai com S210 of Origin Kathleen Vile Province ca Natae Vite Municipality Nationatity Filipino Conder Femaie Manital status Widowed Genotype AA Blood Group_AB. Designation Department Chay Oroartment College of Computer Stusses Meee Srancn_Sara Vile Main Campus ACADEMIC QUALIFICATION Name Address of Schools Colleges. university. etc Thomas Vite Cental Elementary Schooi Stacey Vite Natonai High Scnooi i [ere Ville State University 85 Business Aamnstaton [Sem vie Graguate Scrow PREVIOUS EMPLOYMENT DETANLS- Employer s Contact Name of Employer Address of Employer Details From to _| Positions Heid Deve Ve Senor High scroo Carayn Vile Vnayas 0937 116 388 2018 2021 assatan Protsar Mehae! Vike Uriversty Gra Vite Veayas 0943 295 9246 2024 2028 teacrer) Seater Ve Sener Hop Mare Vie Luzon 0923 973 rare 2034 2037 Assatart Professor 1"
    },
    {
        "image": "employmentrecord1_synth_2_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "KATHY VILLE UNIVERSITY EMPLOYEE RECORD FORM Designation tage of Computer Studies Dake of Sinployeneet ACADE MIG CUAMECATION nesies Wie Ser Hig [ea"
    },
    {
        "image": "employmentrecord1_synth_2_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "THY VILLE CNN eRe EMPLOYEE RECORD Form Nome APRIL M. HALL Frain Sn —__ Cerrenthetietilbedyas 81S? E Fravkin Steet, Dana Vie eS et Nets: 2B 1967399 ———_____ mk -Sttstethereeomalcon Serre Rae Ye Proce toa: Natalie Vite Municip a iia <a en, ee we “eeiseaoe Weed eee in Designation, Gepartment Chair ———____ Deaarmans, Cotege of Computer Shucs Pato ot Employment: Atay 16, 2016"
    },
    {
        "image": "employmentrecord1_synth_2_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "KATHY VILLE UNIVERSITY EMPLOYEE RECORD FORM theme APE OIS7E Frankin Street 9 9904 Iqers! com chastoprer sete of Ons pangs, Female taaora! status Demarinent ACADEM I, QUALIFICATION Bayne Vie State Unie NONE DEANS. Aentens of fonts"
    },
    {
        "image": "employmentrecord1_synth_2_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "KATHY VILLE UNIVERSITY EMPLOYEE RECORD FORM"
    },
    {
        "image": "employmentrecord1_synth_3_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "JONATHAN VILLE STATE UNIVERSITY EMPLOYEE RECORD FORM MATTHEW 2. 30 49818 36th Sue, Keren Vile coarroint Soins ATES: Yel abst, cqate of Crigine Polson Vile PrvFee _ etnies Ot nary Dipioins Patrick \\o= Master Lad [ietany ville Grave gauect Yeasner {"
    },
    {
        "image": "employmentrecord1_synth_3_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "JONATHAN MILLE STATE UNIVERSITy STA 7 4 CieiVent Residential Adsrass: Marital States; Single High Scacel Bistoma —a ddhess of Erploper"
    },
    {
        "image": "employmentrecord1_synth_3_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "JONATHAN VILLE STATE UNIVERSITY EMPLOYEE RECORD FORM Name_MATTHEW P. JONES. 4381B 38th Street, Karen Ville Current Residential Address: Tel. No s): 904 467 9776 Email: _david green outlook com state of Origin: Alison Ville Province tca _Jason Ville District bate of Birth: August 29, 1999 Nationality: Filipino Gender: Female Marital status: Single Genotype: AS Blood Group_A= Designation: Assistant Professor Department: College of Business Administration Date of Employment: June 26, 2023 ranch: Melvin Ville Main Campus ACADEMIC QUALIFICATION Name Address of Schools, Colleges, university, ete. From To Certificates Obtained Patricia Ville Central Elementary School 1983 1989 Elementary Diploma Michele Ville National High School 1989 1993 High School Diploma Antonio Ville State University 1993 1997, BS Civil Engineering Master in Business Tifany Ville Graduate Schoo! 4998 2000 Master in Busi PREVIOUS EMPLOYMENT DETAILS: Employer s Contact Name of Employer Address of Employer Details From To Positions Held Peter Vile State Colege Tyler Vile, Luzon 996 245 6970 2001 2003 subiect Teacher Katherine Vile State Colege Betty Vile, Visayas 097 705 6897 2006 2008 subject Teacher Bradley Vile State Colege _—| Benjamin Vile, Visayas (0950 204 1355 2014 2018 Instructor"
    },
    {
        "image": "employmentrecord1_synth_3_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "JONATHAN VILLE STATE UNIVERSITY EMPLOYEE RECORD FORM Name MATTHEW P. JONES ‘address, 43818 38th Street, Karen Ville Current Residential mait; david. green outlook com tga: Jason Ville District Tel. No s): 0904 467 9776 state of Origin: Alison Ville Province Date of Birth: August 29, 1999 Nationality: Filipino Marital status: Single Gender: Female Genotype: AS Blood Group A Designation: Assistant Professor epartment, College of Business Administration pate of Employment: JUNE 26, 2023 ranch, Melvin Ville Main Campus (ACADEMIC QUALIFICATION Name Address of Schools, Colleges, university, etc. From I To I Certificates Obtained Patricia Ville Central Elementary School 1983 1989 Elementary Diploma Michele Ville National High Schoo! 1989 1993 ‘High School Diploma 4997 _ BS Civil Engineering ‘Antonio Ville State University 1993 Master in Business Tiffany Ville Graduate Schoo! 198 2000 Master PREVIOUS EMPLOYMENT DETAILS: Employer s Contact Name of employer Address of Employer Details _ _From To _| Positions Held Peter Vile State College ‘Tyler Vile, Luzon (0996 345 6970 2001 2003 Subject Teacher Katherine Vie State Colege Betty Vite, Visayas (0971 705 6497 2006 2008 Subject Teacher trade ve Sate Coege namin ve, Vey censors zoe 200 werent —L"
    },
    {
        "image": "employmentrecord1_synth_3_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "JONATHAN VILLE STATE UNIVERSITY EMPLOYEE RECORD FORM Name_MATTHEW P. JONES 4381B 38th Street, Karen Ville Current Residential Address: david green outlook com el, No s): 904 467 976 Email toa: _Jason Ville District state of Origin: Alison Ville Province Date of Birth: August 29, 1999 Nationality: Filipino Gender: Female Marital status: Single Genotype: AS Blood Group Az Designation: Assistant Professor pepartment. College of Business Administration Date of Employment; June 26, 2023 ranch: Melvin Ville Main Campus [ACADEMIC QUALIFICATION Name Address of Schools, Colleges, university, etc From To Certificates Obtained Patricia Ville Central Elementary Schoo! 4983 1989 Elementary Diploma Michele Ville Natonal High School 1989 4993 High School Diploma Antonio Ville State University 1993 1997 BS Civil Engineering Tifany Ville Graduate School Master in Business 1998 2000 Administration PREVIOUS EMPLOYMENT DETAILS: ‘Employer s Contact Name of Employer Address of Employer Details From_| To _| Positions Held Peter Vile State Colege “Tyler Vile, Luzon 996 345 6970 2001 2003 Subject Teacher Katherne Vie State Colege Betty Vile, Visayas 0971 705 6497 2006 2008 Subect Teacher Bradey Vile State Colege Berjamn Vie, Visayas (0950 208 1355 2014 2018 Instructor"
    },
    {
        "image": "employmentrecord1_synth_4_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "ANE VILLE STATE COLLEG! EMPLOYEE RECORD FORM Name_KATHLEEN S. WARNER _ 6967 Virgo Avenue, Amy Ville Tet No s), 0959 771 6771 Emait: amy hart yahoo com state of Origin, Noah Ville Province toa: Erika Ville Municipality Date of Birth: July 02, 1973 Nationality: Filipino Gender Male Marital Status: Divorced Genotype: AS Blood Group AB+ Designation. Department Chait Department: College of Nursing and Allied Health ranch: Catt Vile Main Campus Date of Employment: _May 10, 2022"
    },
    {
        "image": "employmentrecord1_synth_4_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "ANNETTE VILLE STATE COLLEGE EMPLOYEE RECORD FORM rome KATHLEEN S. WARNER Tek. nafs): 0850 774 6771 State of Origin: Noah Vile Province Gender, Male Genctyow, AS. beyartmnente Cobege Of Nursing and Albed Heath Date of Emotoyment My Oe TEN anne ACADEMIC QUALIFICATION Name Addie of Schools, Colleges, univer ason Vie Gan marty ‘Wency Vile Nabonat High Schoot PREVIOUS EMPLOYMENT DETAILS: teran® Name of Employer TBperse te Soe He ecto Vile, Niaayas ied eve ie Serer High Schnt j Canna Ve, nena Dele Vite Nationa ign Senoct Heat Vie, Luzon ane NS"
    },
    {
        "image": "employmentrecord1_synth_4_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "ANNETTE VILLE STATE COLLEGE EMPLOYEE RECORD FORM Name_KATHLEEN S. WARNER Current Residential Address _6967 Virgo Avenue, Amy Ville Tel. No s _0959 771 6771 Email: _amy hart yahoo com State of Origin: Noah Ville Province tga: Erika Ville Municipality Date of Birth: July 02, 1973 Nationality: Filipino Gender: Male Marital Status; Divorced Genotype: AS Blood Group_AB+ Designation _Department Chair Department: College of Nursing and Allied Health Date of Employment: May 10, 2022 Branch; Cat! Ville Main Campus ACADEMIC QUALIFICATION: Name Address of Schools, Colleges, university, et, From i Certificates Obtained Allison Ville Central Elementary Schoo! 1998 2004 Elementary Diploma Wendy Ville National High Schoo! 2004 2008 High Schoo! Diploma Richard Ville State University 2008 2012 BA Psychology Erika Ville Graduate School 2013 2015 MA in Psychology PREVIOUS EMPLOYMENT DETAILS: Employer s Contact Name of Employer Address of Employer Details From To Positions Held honda vile Senor Hoh setrey ae, Visayan 863 409 8715 2016 2019. Deparment Kevin Ville Senior High School Candice Ville, Mindanao 0923 679 3231 2022 2024 Assistant Professor Dale Vile National High Schoo _| Kristin Vile, Luzon 0975 942 3984 2030 2034 Teacher!"
    },
    {
        "image": "employmentrecord1_synth_4_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "ANNETTE VILLE STATE COLLEGE EMPLOYEE RECORD FORM Name_KATHLEEN S. WARNER 6967 Virgo Avenue, Amy Ville Current Residential Address: Tel. No s): 0959 771 6771 Email: amy hart yahoo com state of Origin: Noah Ville Province tga: Erika Ville Municipality pate of ith; July 02, 1973 Nationality; iipino Gender: Male Marital status: Divorced Genotype: AS Blood Group AB+ pesignation, Department Chair pepartment: College of Nursing and Allied Health pate of Emoloyment: May 10, 2022 ranch: C2\"! Ville Main Campus ACADEMIC QUALIFICATION Tame Address of Schools, Colleges, university, ete» From To Certificates Obtained ‘Alison Vile Central Elementary School 198 2004 _| Elementary Diploma ‘Wendy Ville National High School 2008 2008 _| High Schoo! Diploma Richard Ville State University 2008 2012 BA Psychology Erika Ville Graduate ‘School 2013 2015 MA in Psychology PREVIOUS EMPLOYMENT DETAILS: y Employer s Contact Name of Employer Address of Employer Details From. To Positions Held honda Ve Senior Hoh Jeffrey Vile, Visayas (0983 409 8715 2or6 2ore Depa Kevin Vile Senior High School Candice Vile, Nindanae 0923 679 3231 2022 2024 Assistant Professor 2030 2034 Teacher! Dale Vie National High School Kristin Vil, Luzon (0975 942 3084"
    },
    {
        "image": "employmentrecord1_synth_4_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "ANNETTE VILLE STATE COLLEGE EMPLOYER RECORD FORM Name Cusvent Gen Genotype. Designativ: Departmen: Date of Emp Lazo og7s 242 94e4"
    },
    {
        "image": "employmentrecord1_synth_5_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "Sere Side actress: 25 Cresta Row Oy dy Vibe Teresa Vite Naaewgs High Sen"
    },
    {
        "image": "employmentrecord1_synth_5_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "LAUREN VILLE UNIVERSITY EMPLOYEE RECORD FORM Name_LORI W. FORD Current Residential Address _25 Cresta Road, Cindy Ville Tel. No s): _0970 978 7005 Email: robert ryan gmail com State of Origin; Tiffany Ville Province uca _Rachel Ville District Date of Birth: May 02, 1987 Nationality: Filipino Gender, Male Marital status: Widowed Genotype: AA Blood Group_O+ Designation _Department Chair Department: College of Arts and Sciences Date of Employment: January 07, 2017 Branch: Jessica Ville Main Campus ACADEMIC QUALIFICATION Name Address of Schools, Colleges, university, etc. From To Certificates Obtained Curtis Ville Central Elementary School 1990 1996 Elementary Diploma Teresa Ville National High School 1996 2000 High School Diploma ‘Samuel Ville State University 2000 2004 BS Information Technology Dominique Ville Graduate Schoo 2005 2007 Master of Arts in Education PREVIOUS EMPLOYMENT DETAILS: ‘Employer s Contact Name of Employer Address of Employer Details From To Positions Held Robert Vite State Colege Adam Vile, Mindanao 0903 459 8754 2008 2011 Assistant Professor Acia Vile University ‘Andrea Vile, Luzon 0966 496 5288 2014 2018 Administrative ‘Assistant Jacob Vile State Colege Deanna Vile, Visayas 0917 685 4382 2024 2028 Teacher!"
    },
    {
        "image": "employmentrecord1_synth_5_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "LAUREN VILLE UNIVERSITY EMPLOYEE RECORD FOR"
    },
    {
        "image": "employmentrecord1_synth_5_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "LAUREN VILLE UNIVERSITY EMPLOYEE RECORD FORM ame LORI FOR Current Residential kedrass _ 25 Cresta Road, Cindy Vite _—. 1Ga: Rachel Vile District ate of beth: May 02 1987 Nationatity, Filipino. Genotype: AA. __. Bead Group OF Designation: Depsrtinent Chair _ Department: College of rts and Sciences {osminigue vite Gradua Seto! he SREROUS BAPLENDENT DETARS: Nain of Emplover op Mentions ‘Robert Vite State Cotes Adem Vito, Mindansc Acta Vile University Andina Vie, seen [eve so cose Oaarnn Vie, Vissya8"
    },
    {
        "image": "employmentrecord1_synth_5_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "LAUREN VILLE UNIVERSITY EMPLOYEE RECORD FORM We FORO na pune LORE _ _ i Cresta Read, Crett VBE __ oo _ _ man, robeTt CO nem ee _ aca Tl VRPT nn SERRE Pipe"
    },
    {
        "image": "employmentrecord1_synth_6_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "sRIDGET VILLE STATE JNIVERSTTY EMPLOYEE RECORD FORM pesidentiat Adtiress: current oy Q97EA sei. noise 8 ie Prov state of Ori Fupine wationality: .._ Maries ee gate of bith 2 saaeital State Female Gendet nip BS Bicad Gi erie Libraries:"
    },
    {
        "image": "employmentrecord1_synth_6_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "BRIDGET VILLE STATE UNIVERSITY EMPLOYEE RECORD FORM saan Vile Fiipine ey Morita Status: Married Date ot teploymects May 94, 2 Vite Mair. Campu ACADEMIC QUALIFICATION atin vie Nationa!"
    },
    {
        "image": "employmentrecord1_synth_6_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "BRIDGET VILLE sTaTE UNIVERSITY EMPLOYEE RECORD FORM t Vile Sizto Unversity Ratey vita, tan"
    },
    {
        "image": "employmentrecord1_synth_6_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "BRIDGET VILLE STATE UNIVERSITY EMPLOYEE RECORD FORM Name_APRIL S. BURNS 8955 Hardin Avenue, Susan Ville Current Residential Address: kimberly perez gmail com Tel No s): 0976 454 1502 Email state of Origin: Andrew Ville Province toa: _Mark Ville District Date of eirth; September 01, 1998 Nationaty _llbino Gender Female Marital Status; Married Genotype: SS Blood Group. Designation _Senior Librarian Department. College of Computer Studies Date of Employment: _May 01, 2020 sranch _ Emily Ville Main Campus ‘ACADEMIC QUALIFICATION Name Address of Schools, colleges, university, tc From To Contfcates Obtained Emily Ville Central Elementary School 1980 1986 Elementary Diploma Joseph Ville National High School 1986 1990 High Schoo! Diploma Oscar Ville State University 1990 1994 Bachelor of Science in Education Corey Ville Graduate School 1995 1997 __| Masterin Business Administration PREVIOUS EMPLOYMENT DETAILS: Employer s Contact Name of Employer Address of Employer Details From_| To __| Positions Held Kevin Vile Senior High Schoo _| Rhonda Vile, Mnganao (0929 875 4043 1998 2001 Admnstatve Assistant Ryan Vile State College Baiey Vile, Minganao 0996 636 9786 2004 2006 Assistant Professor Kstin Vie Hatonal High Kost a ‘Sheley Vile, Mindanao (0963 138 3201 2012 2015 Agmaistatwe"
    },
    {
        "image": "employmentrecord1_synth_6_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "BRIDGET VILLE STATE UNIVERSITY EMPLOYEE RECORD FORM 9985 Hardin Aven, Sut Andrew Vike Provines Marital Sats cenatype: SS ot Comput Biementary Optoma Schou Diploma in Education score State Uoieesty 1, 1980 een Faaastes bn Business Ageorastatia eee meena conay vite Graraats 1 4996 L_ address of Eropheget i adress of ERODE femme aay vs, tetas"
    },
    {
        "image": "employmentrecord1_synth_7_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "REGINA VILLE UNIVERSITY EMPLOYEE RECORD FORM Name_WENDY T. NEAL Current Residential Address: 8639 Kanlaon Avenue, Anthony Ville Tel. No s): 099 722 9192 Emai _Melinda bennett gmail com State of Origin: Nicholas Ville Province ica: _Jack Ville Municipality Date of Birth; December 24, 1967 Nationality: Filipino Gender: Female Marital Status Married Genotype: AS Blood Group_B- Designation _Lecturer Ill Department: College of Arts and Sciences Date of Employment: _July 14, 2016 Branch: Mary Ville Main Campus ACADEMIC QUALIFICATION ‘Name Address of Schools, Colleges, university, ta From To Certificates Obtained Sarah Ville Central Elementary School 1980 1986. Elementary Diploma Gary Ville National High Schoo! 1986 1990, High School Diploma Thomas Ville State University 1990 1994 BA Psychology Elizabeth Ville Graduate School 1995, 1997 ‘Master of Arts in Education PREVIOUS EMPLOYMENT, DETAILS: Employer s Contact, Name of Employer Address of Employer Details From To Positions Held Antonio Ville State College Jeremy Ville, Visayas (0990 724 1902 2005 2009 Teacher 1 sone VBP National High atcthew Vite, Mindanao (0997 365 1272 2015 2017 Subject Teacher"
    },
    {
        "image": "employmentrecord1_synth_7_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "REGINA VILLE UNIVERSITY EMPLOYEE RECORD FORM same WENDY T. NEAL _ Decemb Date of dirt: Genotype: AS Designarion: a sot Besariment Colege of Ar uly 14, 2010 bate of Employment: ACADEDES QUALPKATION i Name af Ep xwcier Vite Ristionel High"
    },
    {
        "image": "employmentrecord1_synth_7_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "REGINA VILLE UNIVERSITY EMPLOYEE RECORD FORM name WENDY T. NEA: Email, Malinda bennettdagmell conn State of Origin: Nichol ate of auate December 24, 1967 Filpine Watiowatiey: __ Mavite! status; Mia Roud Group Bo apartment: SO bate of fraptoyent: [Rare B adres L Saar th Ville Grauwsate Schoo! ive ween"
    },
    {
        "image": "employmentrecord1_synth_7_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "REGINA VILLE UNIVERSITY EMPLOYEE RECORD FORM ame WENDY TNE A nese emai: meinda bennettgigmel com __ 1Ga _Jack Vile Municipality Parionaiey: FOO ACADEMIC QUALBICATION"
    },
    {
        "image": "employmentrecord1_synth_7_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "REGINA VILLE UNIVERSITY EMPLOYEE RECORD FORM Thomas Vide Stete University L"
    },
    {
        "image": "employmentrecord1_synth_8_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "MICHAEL VILLE STATE COLLEGE EMPLOYEE RECORD FORM Name_ASHLEY D. CLARK 3437 F Asteroid Street, Richard Ville Current Residential Address: Tel. No s): 0966 820 7591 Email: _bfooke mcintyre outlook com state of Origin; William Ville Province Loa: _Trevor Ville District Date of Birth: June 12, 1996 Nationality: Filipino Gender; Male. Marital status: Divorced Genotype: SS Blood Group_AB+ Designation _Assistant Professor Department: College of Nursing and Allied Health Date of Employment: _February 07, 2018 ranch; David Ville Main Campus ‘ACADEMIC QUALIFICATION ‘Name Address of Schools, Colleges, university. ete From To Certificates Obtained Jettrey Ville Central Elementary Schoo! 1992 1998 Elementary Diploma Sarah Ville National High Schoo! 1998 2002 High Schoo! Diploma Daniel Ville State University 2002 2006 BS Computer Science Dana Ville Graduate Schoo! 2007 2009 MA in Psychology PREVIOUS EMPLOYMENT DETAILS: Employer s Contact Name of Employer Address of Employer Details From_| To _| Positions Held Laura Vile State Cotege Connor Vile, Visayas 0905 983 3341 2010 2014 Assistant Professor ‘Ashley Vile National High Ashley Michael Vile, Mindanao (0906 397 8786 2017 2019 Subject Teacher Daniel Vile State Cotege Joelle, Luzon 0963 403 8596 2025 2027 Bepaiment Coordinator"
    },
    {
        "image": "employmentrecord1_synth_8_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "MICHA COLLEGE VILLE STATE EMPLOYEE RECORD FORM thaws ASE Richars Ville Current Reade viens, V Lravid Vite"
    },
    {
        "image": "employmentrecord1_synth_8_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "are io Geosaiate SMO"
    },
    {
        "image": "employmentrecord1_synth_8_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "MICHAEL VILLE STATE COLLEGE EMPLOYEE RECORD FORM Name_ASHLEY D. CLARK 3437 F Asteroid Street, Richard Ville Current Residential Address: Tel. No s): 0966 820 7591 Email: brooke mcintyre outlook com state of Origin: William Ville Province ca: _Trevor Ville District Date of Birth: June 12, 1996 Nationality: Filipino Gender: Male Marital status: Divorced Genotype: SS Blood Group, AB+ Designation: Assistant Professor Department: College of Nursing and Allied Health Date of Employment: February 07, 2018 Branch: David Ville Main Campus ‘ACADEMIC QUALIFICATION Name Address of Schools, Colleges, university, etc From Te Certificates Obtained Jeffrey Ville Central Elementary School 1992 1998 Elementary Diploma Sarah Ville National High School 1998 2002 High School Diploma Daniel Ville State University 2002 2006 BS Computer Science Dana Ville Graduate School 2007 2009 MAin Psychology PREVIOUS EMPLOYMENT DETAILS: Employer s Contact Name of Employer Address of Employer Details From _| To _| Positions Held Laura Vile State Colege Connor Vile, Visayas (0905 983 3341 2010 2014 Assistant Professor Ashley Vile National High Michael Vile, Mindanao (0906 397 8786 2017 2019 Subject Teacher Daniel Vile State College Joel Vile, Luzon (0963 403 8596 2025 2027 Department Coordinator"
    },
    {
        "image": "employmentrecord1_synth_8_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "MICHAEL VILLE STATE COLLEGE EMPLOYEE RECORD FORM Name_ASHLEY D. CLARK. SKIT Asteroid Steet, Richard Ve ____—~ ee. amngnmnen signin, Assistant Prfess0¢ 1 ox College of Nursing ane Aled Heal David Ville Main Campus cate ottmployment: February 07 2018 _ rage ACADEMIC QUALIFICATION."
    },
    {
        "image": "employmentrecord1_synth_9_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "JOHN VILLE UNIVERSITY EMPLOYEE RECORD FORM Agsisiant Prolessor! Department Date of Empioeant ACADEMIC OUALIEATIONS wachasor of sctence PREVIOUS EMPLUNPAENT OFT AIS: Fa ah cof Emplent cenoat Rihana Vile, Vays Peete vite Histon Mt"
    },
    {
        "image": "employmentrecord1_synth_9_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "JOHN VILLE UNIVERSITY EMPLOYEE RECORD FORM EYNOLDS AF Gist Sweet, dam vite sane MATTHEW 2769 Une cuusent Residental Ae tate ch Crigie Matthew Vile Op etober 31 Nationality: marivat Status sined Grove ©: pate of Employment AGADEMHE QUUASIFICATION 097 7 655 8N9"
    },
    {
        "image": "employmentrecord1_synth_9_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "JOHN VILLE UNIVERSITY EMPLOYEE RECORD Forad Rétionaity: Chpino Goncer, F ma Mita Stat Gemitype: AS Designation: 8 Cental Glementary scrioas ma Vie ta"
    },
    {
        "image": "employmentrecord1_synth_9_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "JOHN VILLE UNIVERSITY EMPLOYEE RECORD FORM Name_MATTHEW D. REYNOLDS 2769 Unit F 5ist Street, Jamie Ville Current Residential Address: Email: Paul. gardner outlook com Tel. No s):, 0999 305 6682 toa: Heather Vile Municipality state of Origin: Matthew Vile Province Nationality: Flipine pate of ith October 31, 1979 Marital status: Widowed Gender; Female Blood Group_O- Genotype: AS. ion _ Assistant Professor Designation:. College of Computer Studies Department: ranch; Nicole Ville Main Campus pate of Employment: _APFiLO6, 2016 ACADEMIC QUALIFICATION Tamme Rddres of Schools, Coleges, Ivers, te From To Certiicates Ontained —_| ‘David Ville Central Elementary School 4988 1994 Elementary Diploma in {John Ville National High Schoo! 1994 1998 _| High Schoo! Diploma ane William Ville State University 1998 2002 Bachelor of Science in Education Michael Ville Graduate School 2003 L 2005 Master of Arts in Education PREVIOUS EMPLOYMENT DETAILS: Name of Er Addr of g yme of Erg iress il ployer 95 of Employer Details From to _| Positions Held ‘Mark Vile University Daniel Vile, Luzon 0978 286 9609 2006 2008 Instructor It Metesa Vie State Colege Timothy ile, Mindanao 26 64 4056 2011 2015. AssitantProtessce SS Se"
    },
    {
        "image": "employmentrecord1_synth_9_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "YON VILLE UNIVERSITY EMPLOYEE RECORD FORM “one MATTHEW D REYNOLDS oe Moctal Status, Watowed Thai asa cig t Dane Vire Contras Eloman i ny Scoot {Wiinam Vive Seats University fem"
    },
    {
        "image": "employmentrecord2_synth_11_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record First Name Hiddie Name Tast Name Soca Security Number Home Telepnene Sfficiat Telephone Brittney Jeffrey ‘Anderson 347 71 6420 (448) 903 8263 (362) 534 1213 Gate OF BiH Ave Will Be 65 On. Dependents Education Years Attended am [0D YY mM DD YY 2 Elementary can parau Eero \"oa 22. 1994 31 04 22 2055 High School Dylarbay High Schoo! walling Address city State zip Hiat SSchoot [HVAC Academy Dewadochester 28376 College Tew Eve Sate Uavesty Besiding AE 755 ward Fist, wester TN Bistance Eb Ja Case OF Emergency, NOU! phone Numbers Of Emeraency Contacts: Duane ERS (640) 473 3204 ‘Sex: Male Female Marital Status Married single Divorced Wise. Information ‘eDL License holder ‘Spouse s Name Date OF BIH Wedicat Conditions oarzai9es N General Wealth Height Weight Hair Color Eye Color Good or 206 bs Brown oray Union Affiliation Job Classification And Grade Local 123 Union Foreman Level Tnsurance Pen ‘omer eligibility Date ‘etna Heath Pan NA Dental, Vision awed} worred [Serine [Ending Teng For previous Employer Position worked Fa seria Grge? teaving References condom sugeisot se wave [siamo |_ seem _loxew ssn ‘Saray Day. Supavist ‘Waren, Huber and Sth Foreman an ee ee cate Garner, Speier rie ue spect Saw} aww sam som |endcr ‘wisam Thomas, Manage! Comments? Team player with leadershiP potential Hired BY: Project OF Location: Jefrey Carson Highway Project 101 Termination Information Termination Date From Project Location Terminated BY qecommended For Re- Employment? ves_| No Totes 7 Comments: L"
    },
    {
        "image": "employmentrecord2_synth_11_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "T Raciad Bacarlly Naniior [S177 i 6aze “TY tipactouts TBivcaios Bar Rerptoymont?"
    },
    {
        "image": "employmentrecord2_synth_11_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "[Firstname Widdie Name Home Telephone ‘Official Telephone Brittney Jeffrey (448) 903 8263 (962) 534 1213 Date OF Birth Age Will Be 65 On Dependents Education ‘Years Attended Mm 00 YY mM [D0 YY A Elementary sa aris Tey OOH ‘04 22 [1904 31 04 22 [2056 High Schoo! Dyin High Soho Malling Address State ip Frode School [HVAC Academy Delgadochester 1H 98376 ol New Ene State Univer Residing Distance ‘AE 753 ward Fiat, Deigadochester, TN ee Tn Case Of Emergency, Notify: Fhone Numbers Of Emeraency Contacts: Duane Es (640) 473 3208 “Sexi Male (K Female || Marital Status Married Single Divorced Wiec. Information COL License holder Spouse s Name Date OF Birth Medical Conditions oaz21994 ‘None ‘General Health Height Weight Fair C Color a eI on lor Eye Color Tnion Affiliation Job Classification And Grade Local 123 Union Foreman Level Insurance ‘other Eligibility Date ‘etna Health Plan WA Dental, Vision worked Worked Starting Ending Reason For Previous Employer Position from. Til Wage Ws Referencs® Sandoval Watton Spent snow samo s1eco 52800 comeratvarcanen suiey Day evi ‘Waren, Huber and Seth Foreman sam anon szsco _s2700 [entctcoman _ uensie Cone: Sew tte Le Specat saom van szzeo sence [Entetconact waen Tenn Never ‘Comments: 5am player wih leadership potential Hired By: Date: OF Location? setfrey Carson 162023 Lan Highway Project 101 Te Taformation Termination Date From Project 7 Location Terminated By Recommended For Re- ves_| No Notes 7 Comments:"
    },
    {
        "image": "employmentrecord2_synth_11_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "Sait Sry 71 8620 (aan) 263 826: iovis Eawcaon Cokiege ___ panera Rai thames BY Branitiensy eomtoes —T sesaiiag 7 Baa 7 Hass Fee 65 Lhe wage LM ne..."
    },
    {
        "image": "employmentrecord2_synth_11_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record Farnam nas ae ast Wane] Soca Socary Romar | ams Fale OFiial Telephone Brittney Jeffrey Anderson (347 71 6420 (448) 903 8263 (362) 534 1213 Date OF BGR [ps [WaT Bs 65 Or Dependents Education Years Attended Ca a a oe 22 rood 31 02\" 39 [20d igh Schoet [eyes po Wang nase a a tte Scheu was numer sexe Saige fone sae es Ten eto as Tn Cave OF Emergency, HOO irons Numbers OF Earaoney Contac: nanan Sex: Male Female Marital Status Married Single X Divorced M S Information COL License hokéer Spouse s Name Date OF Birth Medical Conanions owzavt998 General Health Weight Weight Hair Color Eye Color Good or ORE os bs Brown 6 Union Affiliation Job Classification And Grade Local 123 Union Foreman Level2 Insurance Pansion 740500) ‘Star Euigibitty Date Aetna Heath Pan NWA Dental Vision Worked Worked Starting] Ending Reason For Previous Employer Position romed We Wage” Wage’ _| Leaving References Sema wason sieeve sams sae sito scnco coeerasvancener Suey Day Sepevecr Waren tae and Sth Foam sacs 2am szaco arco [enotcower [mera Guar Sapevacr er Specatt ee ee ee eee ‘Comments Tam piyer wih leadership potential Wired BY: Project OF Location: Jetrey Carson oart2023 Hohway Project 101 t Taformation Termination Date From Proiet 7 Location Terminated BY Recommended For Re Employment? Yes No Notes 7 Comments:"
    },
    {
        "image": "employmentrecord2_synth_12_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record First Name Middle Name % Megan Stephanie wn Social Security Number Home Telephone Official Telephone: 844 54 3850 (551) 329 8847 (381) 623 3908 Date OF Birth Age Will Be 65 On Depend pate OF Birth nae jents Education Years Attended 02 or [200 25 95\" or [aoe 1 PBementany asteneonemesn ans Mailing Addres: igh School [New Duavesiad High Seta _| Address tity State Zip Trade School |wvkc sesens Jessiavile w suse Residing At: es 3924 Pearson Valley, Jessicavile, WI Distance Ed. ‘Other Tn Case Of Emergency, Notify: Phi 7 jane Numbers Of Emeraency Conta a> ‘Adam Davidson (356) 381 2508 Sex: Male (| Female X Marital Status: Married X Single Divorced MISE Taformation CCDL Lense hokder Spouse s Name Date OF Birth Wedicar a katherine Greer a eT Con General Health Height Weight 7 Excelent ont etORt sobs Hale Color UTE Union Affiliation Job Classification And Grade Local 123 Union Foreman Level 2 Insurance Pension 010K otk Eligibility Date United Healthcare Retirement Plan B Life Insurance Worked] Worked Starting] Ending Reason For Previous Employer Position eae me ped ES eet References (Graham, Rivera and Staney Siyentor voamoe econ s2n00 32100 [entetcouact Rotet Nevion Ore Swvage 6 —— sao oa sion sznco |eeteremonmty [ean Nash Saperaer Rebetson NOt Fons won| sara sie sasco Beceoppninty ve Waren, Oreste “heson Wagner Ferman roams vzor siaao _s0n00 [eetwrorsemiiy oan seat. Sper comereate Excellent work performance and attendance record z Dat Project Or Location: Wired BY oe wagner quosioes Downtown Ofice Complex Termination Tnformation Termination Date From Prolect 7 Location Terminated By Recommended For Employment? Yes’ No! Notes 7 Comments:"
    },
    {
        "image": "employmentrecord2_synth_12_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record First Name Middle Name Last Name Social Security Number Home Telephone Official Telephone Megan Stephanie Kim 84 54 3850 (551) 329 8847 (381) 623 3908 Date Of Birth Age Will Be 65 On Dependents Education ‘Years Attended MM DD YY MM] DD YY 1 Elementary ine Weems ever ae 02_| 07 2004 25 02 o7 |2069 High School New Dusvesiad High Scheel Malling Address tity State Zip Trade School [vac Acacem Jessicavile wt 9454 College Restdl0g At 5074 Pearson Vey, Jesscavie, WI pence Ed. Tn Case Of Emergency, Notify: Phone Numbers Of Emeraency Contatst ‘Adam Davidson (356) 381 2509 ‘SexiMale Female X Marital Status: Married X Single Divorced MiS¢: Information DL License holier Spouse s Name Date Of Birth Medical Conditions Katherine Greer (0210772000 Diabetes General Health Height Weight Wair Color Eye Color Excelent cht FE abs Black Green Union Affiliation Job Classification And Grade Local 123 Union Foreman Level2 Insurance Pension 403 K) Other Eligibility Date Unites Heattheare Retirement Plan 8 Le insurance Worked Worked Reason For Previous Employer Position References From Tilt Leaving Graham, Rivera and Stanley Supervise woo ecor Endot contact Rober Newton, Director Savage Le Technion same e010 Better oppetunty Exzabeth Nash. Superior Rebetsonitat Foreman azn sao sie00 sas00 [ener opeannty Jute waren Dvecter Johesen Wagner Foreman oaors sore 318 00 $20 00 setter oppenunty Diana Seat, Supervaor Comments: Excellent work performance and attendance record Hired By: Date: Project OF Location: George Wagner 4052028 Downtown Offce Complex Termination Information Termination Date From Proiect Location Terminated By Employment? Recommended For Re- Notes 7 Comments: Yes No"
    },
    {
        "image": "employmentrecord2_synth_12_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record First Name Hidde Name Taat Name] Social Security Number —] Wome Telephone ‘Oficial Telephone Megan ‘Stephanie Kim (844 54 3850 (551) 329 8847, (381) 623 3908 Date OF BIRR] Age [Will Be 65 On Dependents Education Years Attended mM BD ¥ ham 0D v¥ [Blamentary ——[iaeuensenn ore Sor o2 07 200g 25 02 o7 206: High School New Duanestad High Schoo! ailing Address ity Sate Zip Trade School [nic cosy Jessie wi use ol Residing AB Distance Ea: 3924 Pearson Vay, Jessica, Tn Case OF Emergency, Nowy Phone Numisers OT Emeraency Cont ‘Adam Davidson (ase) 381 2508 Sex: Male || Female X Marital Status: Married X Single Divorced Mis Information COL Lense holier Spouse s Name Date OF BIA Medical Conditions Katherine Greer 2207 2000 Dabetes General Wealth aight Weight Har Cote Eye Color Excelent sx 2480 back Green Trion Afiation Job Classification And Grade Local 123 Union Foreman -Level2 ‘Insurance Pension 401( ‘Other Eligibility Date United Healthcare Retirement Pian B Life Insurance Worked] Worked Starting Ending —] Reason For oe Position Ros a a References ee vwao00 waa senc0 s210 lensetconact Reber Newton Dreier Soaps le saw wane sro snao [ete coponeny _ enrnen Nash Sever Rawtantal Foenan azo saa seco sosen [eeteropnminy ue waren Oreste So Fownan vezi vaow seco sat00 [eetwepponnty [anu eet Superior Comments: cetent work performance and attendance record Dat Project OF Location? George Wagner wos028 Downtown Ofice Complex Terinatioa Tnformadaa Termination Bate From Proiect 7 Location Terminated BY Recommended For Re- Employment? Yes’ No"
    },
    {
        "image": "employmentrecord2_synth_12_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "| Sacer Secor Hom gaa 54 3850 seo"
    },
    {
        "image": "employmentrecord2_synth_12_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "pS eee [Ase [writ tie 63 on aka feted | 102 ole lie ya 5 13934 Pearson Vabey, Jeneicavite, Wi == —_— Aatnerine Greer mara Exceiert Oi en ex ~ i Biker i umubitty Date: Untied Hoaincare Potrement Pin ite ewrarce: —_—- 4] eee ‘wena [ree Swage “| Seaaiiag” ading 7 Weseaa Fr =e heaving"
    },
    {
        "image": "employmentrecord2_synth_13_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "itor. Ae es Du f"
    },
    {
        "image": "employmentrecord2_synth_13_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "Sh Gray Keys Sule 178, Ry i Caaw OF Eimeiganey, Raa: gam Mele femaio Ko Martalaheus: Marctad X Siagie Riverced T wise [Sate GF Bie Hone i Hiair Geter Benenst Heat i ‘Union Raise i was soersinge Grace L Reedy Tavnination Sete Erastoymrant? Rates Comments; ="
    },
    {
        "image": "employmentrecord2_synth_13_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "mployes Reo Teaaarity Namber 292 96 538 Higiie ase Rodieal Sendivions previous Eeeploya Position raustrisl FacMy | Ferninaboa takaaatan Sas i ratraination Bata inated By"
    },
    {
        "image": "employmentrecord2_synth_13_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record First Name Middle Name Tast Name Social Security Number] Home Telephone Official Telephone Gary Karen White 388 98 6853 (692) 750 6743 (679) 574 3819 Date Of Birth Age Will Be 65 On Dependents Education Years Attended MM DD YY MM] DD YY Elementary o3_| 12 |197q 46 03 12 2044 High School ‘Canton High Sehoa 9 Address City State Zp Trade School =vstiai Taning Center Ryanview Mo 79498 College Cianevile State Unversty Distance Fd. 186 Gray Keys Suite 178, Ryanview, MO pistan Tn Case Of Emergency, Notify: Phone Numbers Of Emeraency Contacts: Laura Gross (620) 416 7991 ‘Sex: Male [] Female Marital Status Married X single Divorced Mi8¢ Information NA Date OF Birth Wedical Conditions ‘Austin Turner oat2i1979 None General Health Height Weight Hair Color Eye Color Good or 149 bs Gray er Union Affiliation Job Classification And Grade Workers United Local 456 Supervisor Grade A Tagurance Pension /40i K) ‘Other Eligibility Date ‘Aetna Heath Pian Pension Fund A Dental, Vision Worked Worked Starting Ending Reason For Previous Employer Position aT es med [ESS Fe References Hansen, Getta and Mart Operator 32300 $20 00 [Better opporunty Lawa Balad, Diector Ngoyen, Alen and Dixon ‘Speciast sig00 $27 00 Retoeaton Joseph Hal, Manager Comments: table employee with strong technical skis Hired Byr Project OF Location: Javier Arroyo 4004 2022 Industrial Factty C Termination Information Termination Date From Project Location Terminated By Recommended For Re- Employment? Yes! No Notes Comments:"
    },
    {
        "image": "employmentrecord2_synth_13_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record First Name Widdie Name Tast Name Socal Security Number Home Telephone ‘Official Telephone Gary Karen White 388 98 6853 (692) 750 6743 (579) 574 3819 Date OF Birth Age [Will Be 65 On Dependents Education Years Attended mm] OD WY MM DD YY Elementary 03 12 197g 46 03 12 [2044 High School “Garyiown High Shoo Mailing Address city ‘State ip Frade School [Becca Tang Core Ryanview Mo 79498 College [lok Sate Unversity Residing At: 156 cray Keys Sute 178, Ryanview, MO Distance £6. Tn Case Of Emergency, Notify: phone Numbers Of Emeraency Contacts: Laura Gross (€20) 416 7991 ‘Sex: Male || Female X Marital Status Married X single Divorced Wisc. Information wa Spouse s Name Date OF Birth Wedical Conditions ‘Austin Turner osiane79 None General Health Height Weight War Color Eye Color Good is! or \"a! 149 Ibs Gray ve Gray Union Affiliation Job Classification And Grade Workers Unted Local 456 Supervisor Grade A Insurance ‘Other Eligibility Date ‘etna Heath Pan Pension Fund A Dental, Vision Worked Worked Starting Ending Reason For Previous Employer Position Worked Tn Hage’? wage” Leaving References Hansen, effin and Mert Opector pases wane $2300 $2000 [Seteroopotuny_ Law Satrs Overt Nguyen, Alen a Dion ‘Speci cma zee sac s2700 Reccaton esegh Wal, Manage Mts: elable employee with strong technical skits Hired By Dater Project OF Location: Javier Arroyo so7osr2022 Industrial Facity “Termination Taformation Wecommended For Re~ Termination Date From Project Location Terminated By Employment? Yes _| No ‘Notes 7 Comments:"
    },
    {
        "image": "employmentrecord2_synth_14_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "brarnmation oie | Smployerenn?"
    },
    {
        "image": "employmentrecord2_synth_14_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "Theis Fetephane 212) 827 3439 Page D3 pe Tye Ralling Aaa asiding At seas Mate Feoaty HK mcibad Staten Marries Secaes Rasim Union Aiffistien | etigitiny Sate ines Cp warmed (From T Binject GF Llacaiionr Feployment? I ij BREE 7 Coane: ne am ce ise"
    },
    {
        "image": "employmentrecord2_synth_14_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record First Name Middle Name Tast Name Sorat Security Number \"rome Telephone elepho 5 Official Telephone Leslie Sheryl Thompson 352 76 3592 (912) 527 4499, 789 897 9619 \"| aa Pa Age a a s ts Education Years Attended x or 13 00 35 [Ort PP [FY ines Malling Address ye mee Frade School Teecneg ee rang College ee ary a LSS oy Christopher Freeway, North Pati, Fg a Ses 10 Case Of Emergency, Ratify: Cara Numbers OF Emergency Contaca> [sen ‘Sax Male (| Female K Marital Status Married singig Divorcea Mise: Information Veteran status Wai ‘Spouse s Name Date OF Birth a Wedical Conditions Ma We a General eal ean an Hair Color hich ‘Union Affiliation Loca yon 0b Classification And Grade Stpervsor Gradwa Eligibility Date United Heathcare Retirement Pan 8 ‘Stock Options orked Worked Staring Ending Reason For Previous Employer Position From |e Wage Wage’ ah References Miter, Powel and Davia Technician a A pe cppatanty Mesa Townsend. Dees Marto, Bush and Bishop Sepeviner Sere von 80 sre Rescation Masson Maine. Sapevaer Excelent work performance and atendance recora Hired By: hs a Project OF Location: Highway Project 101 Te Tatormation Termination Date From Project 7 Location Terminated By Recommended For Re- Yes No Notes 7 Comments"
    },
    {
        "image": "employmentrecord2_synth_14_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record First Name Widaie Name Tast Name Social Security Number Home Telephone ‘Official Telephone Leslie Thompson 352 76 3592 (912) 527 4499 (789) 897 9619 ah] Ase Will Be 65 On Dependents Education ‘Years Attended 5 Elementary Sarnaven emery Scoot 35 High School ‘Garzastad High School Mailing Address State ip Hiatt e School Evetica Trang Cente North Patricia FM rng College Ease Soe UTA Residing AE 4424 christopher Freeway, Nort Patrica, FM Distance ES. Fa Case OF Emergency, NoUty: hone Numbers Of Emeraency Contacts: Daniel Bowman (623) 677 8509 Zou ale |) Female X Marital Status: Married Sinsie pworced Mise Information Veteran status Spouse s Name Date OF Birth Wedicat Conditions 07 13 1980 NA General Health Height Weight Hair Color Eye Color Excelent os 243108 Brown Hazel Union Affiliation Jab Classification And Grade a Sauna eich Insurance Pansion 40100 ‘Other Unites Healthcare Retrement Pian 8 ‘tock Optons area Worked Starting Ending Reason For Position Worked Sarees Wage’ teaving References Men, Powel and Davis Techaiin oT aww _szz00 _s0400_ setwrcovonnny_| ess Tore Marin, Bush and Bishop speriset mmo wars s2500 s2700_ Reeenon Tasson Marines, Supers ‘Comments: ¢,cetent work performance and attendance record Hired By: te Project Or Location? Jennifer Hudson 7102021 Highway Project 101 “Termination Taformation Termination Date From Project Location Terminated BY Recommended For Re- Employment? Yes No Notes 7 Comments:"
    },
    {
        "image": "employmentrecord2_synth_14_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "7 Bocias Security Ranber Official Teienivane Hess :7a9) 297 9699 | Phos tiuaibara Ot Roweraency Contact, L' S43) €77 8802 Rerreonant Pas B sii Ha 4 wWege _ wage ‘iain 7 Comnemaa?"
    },
    {
        "image": "employmentrecord2_synth_15_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "‘ago, East dereyimous, HE ores ayaistie lor over rataatien bere Soniye?"
    },
    {
        "image": "employmentrecord2_synth_15_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "Wlecine"
    },
    {
        "image": "employmentrecord2_synth_15_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "[ Employee Record First Name Widdle Name Tast Name social Security Number —[ Home ¥. Official Te Cheryl Brenda Nelson 169 38 4154 (654) 234 2384 (807) 228 2596 Date OF Birth Age Will Be G5 om Education Years Attended “MT DD vy Do vv 3 Elementary 10 [05 1904 31 49 05 205: High Schoor ‘Tammjhaven High Schoo Malling Address ‘State Trade School Tuvac nese East Jerrymout No 20187 College Late Seabee Sie Vara AGA nun Station, East Jerrymouth, No peters Ed >] 11 Case Of Emergency, Notify; erate Numbers OF Emergency Contagar Lauren Weber (722) 545 1670 Sax: Male || Female K ‘Marital Status Married Single Divorcea Mise. Information x Avaiatie for overtime ri ai i Conditions ‘Spouse s Name Date OF Birth ‘ostos Medical Condition Wa 5 Seneral Weaith— Heian l wah Hair Color ve Calor inion Afilation Classification And Grade nto Workers Unted Local 456 re sation And Supervisor Grade A Insurance ‘Other Etigibitity cae |? ‘Aetna Heath Pian Ue insurance Previous Employer Position aes References Cater Reaset Opwatr wore ao Thomas Bacal Manager Pere Bennet pear sz sas Mary Staley, Spervacr Wise, Smith and Late sas socon7 Any Nebion. Oreste \"Excelent work perormance ang attendance record Dater Project Or Location? et oar ox042021 Manufacturing Pant 8 ‘Termination Information Termination Date From Project 7 Location Terminated By Recommended For Re> 2 Notes 7 Comments: Yes No"
    },
    {
        "image": "employmentrecord2_synth_15_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "at BREET i [18936 4954 Somat neme eaaear aan ~~ et GF Lecationy Sanataeneny Pans"
    },
    {
        "image": "employmentrecord2_synth_15_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "#8 tranden Statin, Ean! Jersymaut, ts Excotent Asiietion~ Thee Behn, Manage i"
    },
    {
        "image": "employmentrecord2_synth_16_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "Eavedent Salaam Workers Unted Lorai 456 Pension Furs aT taaing [Mase eat or Diesen? Terniinatian titaraainn Verrtinaied By Yarneiiation Bate Emstoymant? ae TS"
    },
    {
        "image": "employmentrecord2_synth_16_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record Firat Name Hiddie Name Tast Name Social Security Number Home Telephone ‘Official Telephone Gregory Karen Baird 831 57 9330 (931) 668 4811 (503) 520 8667 Date Of Birth Age Will Be 65 On Dependents Education Years Attended mM DD YY MM [DD YY 4 Elementary Daven Bevery S208 12 08 1984 36 12 08 205: High School ‘hglartn High Schoo! Mailing Address city State ii Trade School Jessicaport MA 75867 College ennteine Sate Davey Residing AE 045 scott Divide Sute 314, Jessicaport, MA Distance £6 Tn Case Of Emergency, Notify: Phone Numbers Of Emeraency Contacts: Melissa Park (487) 516 6827 Sax: Male [& Female |) MaritalStatus: Married X Single Divorced Mane: Bxtormmtion WA Spouse s Name Date OF BiH Wedical Conditions Sean Parker 12 08 1988 Diabetes Height Weight Hair Color Eye Cole Excelent OPE oe TOM os bs i Bue Union Affiliation Job Classification And Grade ‘Workers Unted Local 456 Foreman Level2 Insurance Pension 7401000 ‘Other Eligibility Date United Heathcare Pension Fund A Dental, Vision Worked Worked Starting Ending Reason For Previous Employer Position Worked [Tin Base”? wage” Leaving References Marsh Floys ‘peat aoce samo $2000 $2000 Careeradvancemant Hester Freseet, MASE West ts Supervisor yore) ams sesoo s2000 etermemnay cuter Cwpen, SPEYSE ‘Comments: “peiable employee wit strong technical skis Hired By: Date: Project OF Location: Yona Moore sngi2021 Industrial Facity “Termination Information Termination Date From Project Location Terminated BY Recommended For Re- Employment? Yes_ No Notes 7 Comments:"
    },
    {
        "image": "employmentrecord2_synth_16_aug3.png",
        "label": "employmentrecord",
        "ocr_text": ""
    },
    {
        "image": "employmentrecord2_synth_16_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "| sou: Male ¥omwte aaa ae seen Parker Weatind T eeproyment i"
    },
    {
        "image": "employmentrecord2_synth_16_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "Homa Tahephens 931) 888 481 Cae Too TW Tae oe [seed 1 Qa a a. ‘3 3 sie School a, (ara Schoo bieaaie ae PEBBE AR a4 soot Oe Sue 396, Session, WA Emergency, Newly: Raterenens Teeaiag” TBiaiaag _| Wage i wage [rai Ge taetions i ‘Taruiinanan intanation Weckae 7 Carmina ek"
    },
    {
        "image": "employmentrecord2_synth_17_aug1.png",
        "label": "employmentrecord",
        "ocr_text": ""
    },
    {
        "image": "employmentrecord2_synth_17_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record First Name Middle Name Tast Name ‘Social Security Number Home Telephone Official Telephone Whitney James Mcdonald 548 99 8245 (538) 813 9258 (275) 875 7374 Date Of Birth Age Will Be 65 On Dependents Education Years Attended mm] DD [vv Mm DD ¥¥ 4 Elementary NetaRTo Sere Se 06_| 28 198q 45 06 28 204! High School South Thomas High School Malling Address city State Zip ‘Trade School Jordanbury Ne 16502 College Residing AE S719 Hemandez Fery Sue O24, Jordana, No Distance Ed. Tn Case Of Emergency, Notty: Phone Numbers Of Emeraency Contactar James Hart (344) 626 4764 Sex Male (X Female || Marital Status Married Single X Divorcea Mise Information Veteran status ‘Spouse s Name Date OF Birth Medical Conditions 06 28 1980 NA eral Health Height Weight Tair Color Eye Color Gen Good 3 oa 184 bs Brown kad Brown Union Affiliation Job Classification And Grade Workers United Local 456 Eectrcian- Grade 3 Tnsurance Pension7a0a0k} ‘Other Eligibility Date Bue Cross Blue Shield NA Life Insurance Worked Worked Starting] Ending —| Reason For Previous Employer Position eT YE wage” Wage’ _ tsseon’ References Robinson Regge Same sz seco s2400 [carer aévancemer Wat Cantm, brecur Harngton, iceland Winans Tectescan vans mae sir [52400 [Coveradvacener Senann Henan Mauger CS Excellent work performance and attendance record Hired By: Date: Project Or Location? as Lydia Figueroa 01 23 2022 Industrial Facility C Termination Taformation Termination Date From Project 7 Location rminated By Recommended For Re= Employment? 09 17 2024 Matthew Hutchinson ins Yes’ Nox Notes 7 Comments: Voluntary resignation relocated to another state"
    },
    {
        "image": "employmentrecord2_synth_17_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record First Name Middle Name Last Name Social Security Number —] Home Telephone ‘Offical Telephone Whitney James Mcdonald 548 99 8245 (538) 813 9258 (275) 875 7374 Date Of ith Age Will Be 65 On Dependents Education Years Attended mm] 0D Y MM] DD YY Elementary eemsromn 06 28 1984 45 06 28 2049 High School Thomas gh Stoo Mailing Address city State Zip Trade School Jordanbury No 16502 College Residing At Sonn Distance Ed. 5718 Herandez Ferry Sute 024, Jordanbury, NC Bistan Tn Case OF Emergency, Nowty= Phone Numbers Of Emeraency Contacts: James Hart (a8) €26 4764 larried Single Divorced Mi8®: Information Sex: Male X Female Marital Status Veteran status Spouse s Name Date OF Birth Medical Conditions 06 2811960 N General Health Height Weight Hair Color Eye Color Good ‘9F ae oy Brown Brown Union Affiliation Job Classification And Grade Workers Untes Local 456 Electrician Grade 3 Tasurance sion /401 K) Eligibility Date Blue Cross ue Shield WA Life insurance Worked Worked] Starting Ending Reason For vences Previous Employer Position worked [vin Sraeee erie? Rearing Refer Waar Caste, Deector Speci wirenet arc waams Ts Excellent work performance and attendance record Date: Project OF Location: Hired By: YL yaia Figueroa ow23z022 Industrial Facity C ‘Termination Information Termination Date From Project Location Terminated By Recommended For Re- Employment? prey 09 17 2024 Matthew Hutchinson ves _| Nox Notes 7 Comments: Voluntary resignation relocated to another state"
    },
    {
        "image": "employmentrecord2_synth_17_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record Cast Name sa 00 aaaa BY Number Wome Yetaphone ‘Official Teleph Mcdonald Ee (538) 813 9258 (275) 875 7374 Dependents education Years Attended A aa Fre eel Sos Tras gr Soe State Zip Trade Schooi eee No 16502 ‘College Distance Ea. Phone Numbers Of Emeraency Contaair [Eee MattalStatue: Married Single X Divorcag MG Toformaton Veteran status 's Ori tical ‘Spouse s Name Date Of Birth | Medical Conditions a Mair Color Bye Color General Heaith Halon Weight on Coie We Calon teen Antiation Workers United Local 456 cation And Grade Blectrician Grade 3 Insurance ‘Other Eligibility Date ‘Bive Cross Blue Shield NA Life insurance _ [REET Worked staring enamg Reason For Previous Employer Position ries bs [f= References Resse Rips ee eT eg en Caate Drctr Haron Miche an Winans Yeciscan EL BE er eey en Hermans Manager Pree OF Leeaton er Termination Information Terminated By Recommended For Re- Matthew Hiutctinecn Yes |NoX"
    },
    {
        "image": "employmentrecord2_synth_17_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "‘voteran state a i ser2RSHe mat wre petormacce ont aera I Fenataation Crraniopenent? repeated ts arotner stale i Vouctary peer"
    },
    {
        "image": "employmentrecord2_synth_18_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "en a Paawae yma ren Pu i (Raia 7 Canara 1"
    },
    {
        "image": "employmentrecord2_synth_18_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "Prantl, Vision"
    },
    {
        "image": "employmentrecord2_synth_18_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record Firat Name ‘Middle Name Tast Name Social Security Number ‘Official Telephone Jared Jeffrey Reed 632 72 5514 (719) 865 3137 (719) 75 3664 Date OF Birth Age Will Be 65 On Dependents Education ‘Years Attended mm 00] mm] [YY 5 Elementary Tate Jason Saretary S28 o4_ o1_| 1974 46 04 ot [2044 [Manna High Sehoot Malling Address ‘ity State Zip Trade School Lake Michaelsire 10 87356 College espera Sie Unves Distance Ed. Orie Unvers Residing AE 33502 Heather Manor, Lake Mchaelsire, 1D eee Tn Case OF Emergency, Nowy: Phone Numbers Of Emeraency Contacts: Jot Metean (236) 322 1914 Sex Male X Female MaritalStatus: Married Single X Divorced tise: Taformation CDL License holier Spouse s Name Date OF BIH Wedical Conditions oxon979 Asthma General Health Height Weight Hair Color Eye Color Fae so 1588 Gray Union Affiliation Job Classification And Grade Local 123 Union Blectrcian Grade 3 Tnsurance Pension 401 K) ‘Other Eligibility Date Ble Cross Bie Shield NA Dental, Vision Worked] Worked Starting Ending Reason For Previous Employer Position From Til wage” Wage” _| Leaving References Maer Sen Ome aoc sao soso 12800 Reccaten Mary Conmings, Orci os Grup Operator yao veo szaoo 32500 [Reccaton Jay Ala, Drector Comments: Relable employee wih strong technical skis Hired By: Dater Project OF Location: Enca Thomas 06 27 2024 z Construction Site A z Termination Tnformation Termination Date From Project Location Terminated By Recommended For Re Yes _| No Wotes 7 Comments:"
    },
    {
        "image": "employmentrecord2_synth_18_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "[ ieee Tatennase 799) ROSSA9T Tie Tae {os _j 01 sr 38 weriag naan Stussiad tastes: Married Single"
    },
    {
        "image": "employmentrecord2_synth_18_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "PROVES Mh sto techn"
    },
    {
        "image": "employmentrecord2_synth_19_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "Official Telephone Ger) 373 2478 me Telephone ergy 392 8130 | Frey School [es Davos Sts Ss [estes ea |__| aeney Contacts: Social Security Number 454 80 5291 First Name wigdie Name A ra] ar OF] [ous oteer co 06 48 06 city mailing aes East Loriport ing, East Lonport, NM one Numbers Of Emert Pay eTt 1525, Residing At: o991 gridges Cross Wisc. Tatormation valable for overtime Tn Case OF Emergency, Wedical Conditions Hair Color Black WF GrAGE cupervisor Grade A e Hayden Wiiams Insurance Kaiser Permanente eg [eee = fecommended For Re- Date: ject OF Location? 0270912022 Downtown Office Comolex -Farmination Information Terminated BY Hired By: ‘Aigon Jones Yes From Project Location Termination Date Employment?"
    },
    {
        "image": "employmentrecord2_synth_19_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "Ngibtiley bate Pravieus Eampteyey sys fee Come"
    },
    {
        "image": "employmentrecord2_synth_19_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record First Name Widdie Name Tast Name Social Security Number Home Telephone ‘Official Telephone Anna Anna Nelson 454 80 5291 (649) 392 8130 (381) 373 2478 Date Of Birth Age Will Be 65 On Dependents Education Years Attended mM DD YY MM DD YY 4 Elementary nyse Bemertary Shot o1 06 |198q 45 01 06 204: High School ‘New David High Sehoo! Mailing Address a State Zip Trade School East Lorport NM 67955 College Residing At 591 pridges Crossing, East Lorport, NM Distance Edt Tn Case Of Emergency, Notify: Phone Numbers Of Emeraency Contacts: ‘Ashley Kein (220) 671 1525, Mise. Information ‘Sex: Male |) Female X Marital Status Married X Single _ Divorced Avalable tor overtime Date OF Birth Medical Conditions 1706 1980 NA Weight Weight Tair Color Fye Color ORE ge Mt oosies Back i Hazel Talon Affiliation Job Classification And Grade Wirkers United Local 456 Supervisor Grade A Tasurance Pension 400010 ‘ther Eligibility Date Kaiser Permanente Retrement Plan B Dental, Vision Worked] Worked Starting Ending Reason For Previous Employer Position erecta |e sees [Wave =\" References Havel Hayes a Pst Opec waoor samo sis 32200 [ensetecnaet Danate Noman Drectr Ceetvege ‘Spec qa eco sso szzc0 [ensorconract Alcia king, Sipser Mogae Fiicher onan Gaon was) seco seco [Beternpernty uate cote, Sipesisor ‘Bute, Duncan and Mer Gmoor saan seme 22800 carer aavanement Len Petersen, Servier FWA Dat roject OF Location? ‘ison Jones 0290072022 Downtown Offce Complex Termin Termination Date From Project Location Employment? Notes 7 Comments:"
    },
    {
        "image": "employmentrecord2_synth_19_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "Cemate S Mariel tiatue: Maried X Siagie row Brahe Tecation"
    },
    {
        "image": "employmentrecord2_synth_19_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "j= Leaving i ee wae se [aemremeean + won| wan wae tm fom. Wrejaet Or ination:"
    },
    {
        "image": "employmentrecord2_synth_20_aug1.png",
        "label": "employmentrecord",
        "ocr_text": "be [oo T aipitad Satind 1 veg ‘Be Docent Higiainy Ergact 10"
    },
    {
        "image": "employmentrecord2_synth_20_aug2.png",
        "label": "employmentrecord",
        "ocr_text": "Test as Reed ‘Shows Humber 360) 45 8728 encs [Fannianen Empioyatent?"
    },
    {
        "image": "employmentrecord2_synth_20_aug3.png",
        "label": "employmentrecord",
        "ocr_text": "Employee Record First Name Widdie Name Tast Name Social Security Number Home Telephone ‘Official Telephone Sarah Kimberly Reed 235 91 1804 (878) 952 4327 (313) 258 8263 Date OF SIAR Age Will Be 65 On Dependents Education Years Attended mM] OD YY mM DD [YY A Elementary er es Senet S08 Ss 08 [1974 53 03 08 |2037 “High School Hailing Address: State ap Frade Schoo! [Weng nttate Mooretown MA 61487 College. Seotview State USS Residing AE 219 aexander Cif, Mooreiown, MA Distances Fa Tn Case Of Emergency, Nouty: phone Numbers Of Emergency Contacts: Jacob Morison (959) 945 4728 Tau Mote Female |) Maral Status Married single PWorced lec. Information x NA Spouse s Name Date OF BIH Wedical Conditions oaosit972 Asta General Health Height Weight War Color Eye Color Good No restrictions 10\" 209 bs: Brown ia Hazel Union Affiliation Job Classification And Grade rade Union 789 Electrician Grade 3 ‘Insurance Pension 401 k) ‘Other Kaiser Permanente Retrement Pian B ‘Stock Optons worked Worked Starting Ending Reason For Previous Employer Position From _| Tilt Wage Wage Leaving References eon ne Foreman vom sco $1700 $3500 Reoeaton tea Lam, Deetor crecen re Fons ow waa zoo soaan Entctconmact Jane Danes, Noor ee Grove Specaist aor eames sino s2300 _ Betercrnotnty _| Jot ein, Neet Rosas ne Ope ane wwe saz [_ 5800 [comwatanament Deteon Hammers NANO ‘Comments: peiable employee with strong technical skits. Wired B Dater Project Or Location? Christy Stephens 03082023 Highway Project 101 Termination Information Termination Date From Project Location “Terminated By Wecommended For Re- Employment? Yes _| No Notes 7 Comments:"
    },
    {
        "image": "employmentrecord2_synth_20_aug4.png",
        "label": "employmentrecord",
        "ocr_text": "TV eonah enone, Sa"
    },
    {
        "image": "employmentrecord2_synth_20_aug5.png",
        "label": "employmentrecord",
        "ocr_text": "[essen Sex: Rag 4 Femaie [Heise 7 Cee"
    }
]