[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "entranceform",
        "ocr_text": "nares ‘ype ot choot CiPrvte CPi vanvipmmamnomet Saco Pity: _Senmretben mn cour Pratrence: Fat Pith mai oan te —_sosusceny _ Aten 2000 ee _sosus Soe"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "entranceform",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "entranceform",
        "ocr_text": "ne gas asraRe ene: Zasaies Heme née. 202 rn tress oLnTaT3. leone ONO neon enn ene enmang estan on come trterence: fini fionny: SOTACTERSIAI ANS Smee shoe"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "entranceform",
        "ocr_text": "sit 925 Ian site| Ho nates ee Rema trees ee ‘Sire Sek beeing esirnan oven Praveen: To Secs ic jostue sony"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "entranceform",
        "ocr_text": "COLLEGE ADMISSION APPLICATION FORM sromaton tue, Macon 03 1997 __ Mx evatrnne oe ame (ns Pi _ Halder Tye Ward uve _B7R121482000 Sinhdate: “SEE Age 19 caicenhip: Cpine Clore (ony___ Wome Adie: —___292_ _Wiest Tena ___Zambales____— 083 _ ‘Barareor) _ mcipleyON) rome) ‘ee coe) malt Addres ___hroy rexample net__ Active MobileMe. 09473773713 _ Sex: _Male ‘Pease Check “incoming Fresiman Sal from which yougraduates: __ Hf PLC Aemdamy cress 20279 Emty Wall Nort Mane, 10 86978 Trade ‘Sean: HUMSS. School Yeo Grodveted’ 1988. 1984 ——_— Type ofSchook Cl Prive COPE Catranaeree Scrootast ended nares: ‘yee of cheat CiPwate Cimtic er second Pity, _ebrettaen tnrrmnty aor Course Preference: Frnt Pioity"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "entranceform",
        "ocr_text": "ose eh Seinat aoe, ca Bernt sese"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "entranceform",
        "ocr_text": "ATION FORMA UT sane achicet \\ ones ADMRSSION APPLIC ow esas nate ee Home adres a Set eo santo Seeoeie see EO EEN, sis"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "entranceform",
        "ocr_text": "COLLEGE ADMISSION APPLICATION FORM pre sr ‘owe Powys} 3009 sym <ora -_ Taylor a se U9N T2ES4S7A7IO4 irthdate: ey 1201 nge21_ cn an an ome —llacas Norte 1853. (Barangay) Qetraburcn Email Address: rcpt ty) rom ome incoming Freshman sto he gaan se i Sos aan icone th Orta Tet nan Pom ‘Woe of School Ctrivate Clube"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "entranceform",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "entranceform",
        "ocr_text": "i COLLEGE ADMISSION APPLICATION FORM om Soyer sao Bes saa, Tse Reales Boom ia eatate? Cite shoal tae are Seuayedotonee ecSopiteheonan secre est aaa aii ee oe RASS"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "entranceform",
        "ocr_text": "enone ns en 8 See wer vere -—"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "entranceform",
        "ocr_text": "sre Se RARIRREDA Bien: 51M aur 23, omsbip: Uke CFerctne so res Mae oa ence Before op BSN BIICe"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "entranceform",
        "ocr_text": "COLLEGE ADMISSION APPLICATION FORM aN 790207524207 Emad Adress J acoming Freshman Mransterce hoe 0 Schoo! Course Preterence Jessica Vata Teme cage 8a Agen sane"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "entranceform",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "entranceform",
        "ocr_text": "cohen sess"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "entranceform",
        "ocr_text": "poset. Mash it Shou toa Gratien 3883 8D eyreentire Schoo ar uted: CGowee Preference: Fist Pry: Sami 3"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "entranceform",
        "ocr_text": "COLLEGE ADMISSION APPLICATION FORM. nena “tiknew? |} wal me an: sxsonsn2nea_ sede _ engage 29. creer ‘Davedbaxen —— seams uta 208 — frowns! sex Female ‘incoming Fresh Scnoot fom which Yu ar obs NS Tee ea Graduated 1982 2013. seerschoa! (Prune CIM crTransteree “noo"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "entranceform",
        "ocr_text": "pion ele nee ame ps, Pri_BO D. a Yor ane gpsonsg29523 Srndte: SSE _AGe20. SSF [Drape Ctoregne (oe 4 Se Pavaauen sams Questa —, Proweee! Tecate) Home Adress: 99 orarend __taaniepsiey Os) mat Addren sardovalerns ce able. nagsszazano Sev Female incoming Fret Sinetron which you graduated casey Hoimes Senool aores: ower Pan At 908, Anfionsheven. me ‘cee ee Tee seo Geoeted 182 2013 —_——— Srcurscoa Clrrwne Cheb ransteree Scnot at attended"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "entranceform",
        "ocr_text": "COLLEGE ADMISSION APPLICATION FORM t t2 2108iewsie rts god peewee Mech 152010 eymntone wom woe ame (. Prt _ Bron teson Yor Un: 625003028523. Birthdate: SUNG _Age29 Cicer: Chipino CFortner ec Wome Address: 493 _ David Misamis Ocints 05. TBaraneor) —_ Mancpaltyy) (Pownce Teo ose) mal Address: sacovalamandagexample net Active Mobile No. pe Please Check —ngassi2a2450__ Sex Female incoming Fresiman School rom which you graduated: _Gasay Holmes School _ ‘sees 885 Howard er Trace SS Seond: natin Course Preference: Fis Poity; ur ePreacasaten ‘tn at oat ain peclapshen irl sts Pecemed ne ota. Geant Lauren Perez Sune 24 2025 7 or ="
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "entranceform",
        "ocr_text": "wl ea hi: SIRNA Rita: OES age 2 Cairectie. [Papino Citacegne inl Revise. Saracen. 1988 ane) tanita iano) ibe tae re Scho ram at vou gat heat tows B88 Sea n 8i oR Peck oy an: esac Seosot Va? Seated BA BR. Tepretsetaat L iwdis Tete stew Shoots amends. ates Eason fenaraiess fe Hy 8 cette Fo rer er"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "entranceform",
        "ocr_text": "| COLLEGE ADMISSION APPLICATION sane ease te Prick be Sie ASZADAIGROTT_ Benton sere 2 mie age som eo an oat 2788. iniaiicaeseey Fema Sateeeiemmetecon, Ace mache, teers see nie ucseieg tases ea acon, 28 Naas rie Besos fs. Sor Giatotew aa cg it timer Ciena Clie Citrineteree ‘SPhool ie eos Aires"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "entranceform",
        "ocr_text": "| SOALEGE ADMinSiON s LICeTION soRy, feta Seed Sowa: tne eet iowy) seghMN Siero te Nate Woes AB Pama Crees Ehncoming Fabre ZACot EIN MBI 0H eat Seew Pennie: i Pay Seed ee sewer vezep"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "entranceform",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "entranceform",
        "ocr_text": "| | paULede ARMISSION APPLICATION FORS Tipe shot erento ala sess: pest Bost Seat popu wrest IE. mead i aig"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "entranceform",
        "ocr_text": "COLLEGE ADMISSION APPLICATION FORM wrmatnte_Dasember 4 2021 Aeyetnuine soto wo Name (PPint_tl Bracke Webster (Wn: 997524500077 Sinhdate: He) 21 0M _Age24_Chizersbig: CFspino ClForeigner (vec Home Adres: 203 Jamestown. —SuigsodelNote 3782 {Beranear) __Waipaly ony (Province) pease) mal Addresc_anthony O examplecom Active MobileNo. 9167725001 Sex _ Male Plnse Chace ClncomingFrestman ‘Schoo tom which you graduated Johnson PLC Academy ‘Aséress __899 Moyer Drwes, Nosh Saratvale, 49896. ‘rock: _ Resdamis Teac ee Seand: Sone a School Yer Gaduates 5 Type et Schoot rvs CPutic Catranseree ‘Schoo ast attended: Keres ‘ype of School: Clrrvate CiPubi Course Preference Snir Flot Poy: sume senna exes Second Prony: Saou Sewer apenas ‘i cr a am spat oe Fosse erent iareletirsralind red Scott"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "entranceform",
        "ocr_text": "enoor tne nosh ws pate Seek Seth Pennie B08 BH. Pek de cweren povtevnemas Fest Prowitys, STN aR UPREESTS Ee semana Paboreet emetic Sti Be “Gases enn tvs soe ie"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "entranceform",
        "ocr_text": "COLLEGE ADMISSION APPLICATION FORM “rcs” syohoventae_November 14 2014. segment Rippon 7 Name s. Print _Thomas. Meghan, Evens nn: 877087470310. irhdate: SURE _Age27_Citiershi: Cipino Cvoreies teen. Home addres: 774 ‘Carkburgh ‘Sorsogon 4512, ‘farangay _ Maneaty 0ty) Prone! Tp cose) ‘email Address: lamb @evampie com Acve Mobile No __gg7s7en4205 Sex! Female Plane Check [incoming Freshman ‘schoo fom whch you graduated: Powel Brown Univer Adress 025 Griftn Prarie Rot 992, Pon Andrew, SC 30282 Track “Aeademi Tack ‘Seand’ ABM School ear Greate 2007 1868 Type school” C Prvate CIPubie ress. a Type of school ClPrvate CiPoble Couns Preference: Ft Pony Second Protiy _Saeneor at soercen soa, inane Pend enya ‘chasies Anderson Oewber 142017 —— emia Bodin —— —s"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "entranceform",
        "ocr_text": "Saorme =A See ea; Seaeee tae ee ene a Sa."
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "entranceform",
        "ocr_text": "Apgestsa mee Nowe sepa emi asian aanseanecoe ee Fame. aie ack \"ebook a wich Typentsenent Chemie (ee peat Seneciba ede a sac Pre course Peteence: HS Erey"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "entranceform",
        "ocr_text": "exrirenmen severe oo ao\" j a (Une STTMTARL IO Dente SUSE _ ge 27 Coie: Heine Chennai Meme peren: IN Septet. Sarwan a3 Ca ad wwe! tower ons Adios canbe corn activa Mate No, _ogpsTanams Sees Saran"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "entranceform",
        "ocr_text": "Sint Sea aig Tyee ete: Cine Cinea Dreetee, ol"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "entranceform",
        "ocr_text": "atest 21210 pene n ‘COLLEGE ADMISSION APPLICATION FORM aro ne ‘wove pmnonowe December sa ig —— eegaeseyne a0 ame it _ Rode Ama es ne secsnsonsaon Sihdte: \"SERE_Age 10 Creep: Cpne Corner ehh Nome adress: 76____Websterbssa _ Tierra) __ Munsiplty 0 0 rome) Te cote) iol Adress _daenbuncongerample el Ace Mele No, _qgangoazai__— Se Femait Please Chek: \"Seond: —— OMS Type oF Schook (J Prvate IPE (Ceansteree “School ist tended nesses Semis Tyee of Schook Cpavate CiPuble a! oon course Preference: Fist Prioiy: peepep epee raeete ated cae ns. March 122004 cee nnee Brad Witla —____Brad Wiliams"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "entranceform",
        "ocr_text": "wpoven | COLLEGE ADHESION APPLICATION FOR weer"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "entranceform",
        "ocr_text": "SOLLECE AUMISIOM APPLICATION FORM wenn tear ned e sare es se say bow WE de ere RA Ape te Cnverat n pete oorenes feetasorn caennane bp 2 me Fesae Pate:"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "entranceform",
        "ocr_text": "ee ce ae ee foe Bae Tata Exasaint wiomassances aaah Nove Mabie agaen zou Ha. 2880 Type ni tecak Ci Baie Capea Cibarateree ‘eonise aioe ae Brash 222008, ee Pee arr od"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "entranceform",
        "ocr_text": "ee 2amNREZAD ND, Some Ree Home nation 22 2 Tiras Ripenycton Fel seen: Posse vets Sieeseng eons Scot ioot atch you site Aaserse 3002 Ws Ta Rendon re Schooler eascsed Tyreattanoas eae CPiresetecos Stet Sacond Pete son Consent eo hon Montes Yaseen Hoctoartisosedes. ogg Hisnee Gocteme. 003 wees piety reenter nn ene)"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "entranceform",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "entranceform",
        "ocr_text": "——f COARSE ADMISSION APPLICATION Foaya ep eur Penne ace? ett ros a ws grams Guiows BUR Wists Facet S24 Fan, Yoo Renee Ea Soule: Giaduces 208 2ag Doe otsetent Sioa Tee eetnoe ae) Spun aa Caune Mienee: Fin Bey ew asraacrteiaton emcee Maas tease aaniae Seren ema anh 2c 24"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "entranceform",
        "ocr_text": "meas 0 na men Wt Seveekare er en ale oneal corel nn _seonecachan DOR. A LARS am ie"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "entranceform",
        "ocr_text": "wenn seis ‘Seband to Grains a Fa Heathen 1 “pone eecone ase. esting enon qi gmanies"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "entranceform",
        "ocr_text": "| COLLEGE AAIESION APPLICATION FOR pane ming rea save Soro tee eat Reoeier lense Cees tamterse “Sota seen menwess Perera rk bo an ESE counatreagcnsas tot nny"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "entranceform",
        "ocr_text": "tear rar Duron ‘re taderre ah ace ag aeyermer ewe Dogealenyeacsoce i ‘laine omen Mev wt yr son Neositw iidowes 281873 Shree nee nm aan ne Bese er seret nc crabs a i pei Preps"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "entranceform",
        "ocr_text": "COLLEGE ADMISSION APPLICATION FORM 2 20sccwe ‘te bacon Aovmeten One _ ay 232015 age mee woe Name (Ps. Pint __Lyons Aaron Moore ‘nn 633528823700 ithdate teca 620 Age24chizenship: ine Clforeigner (wen Home Adres: 12 ___abetstat —Bukidnon ____ zane (Barangay) (ihmicpay ony Prove) Tee code) mal Adéresanathewrslenzusia Qeramplecommctive MobleNo _agasaea7470 Sex. Famaie Please Check incoming Freshman School from which you graduates: _Willams, Suarez and Monow Cotege saree Trak il Strand: As andDesign School Year Graduated Type ofSchoot CTrvate Crue Ciransteree Schoo ast atended Aecres. woe of schootCPrvate Clrvbie Course Preference: Fis Pricity: Sehere mtntn Sense nee Second Prioiy _Baereorat Somes Boge Eeasstep ens eeb eeu recessed somone teres Dwayne Peters July 14 1997 a mane Peters __ 41"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "entranceform",
        "ocr_text": "Sptae Pert Shami -Bansstsad. iwhestjaerons School Ra i ee Pati edit Seto tea aster hip samew Ciieanterne Skeiag ates srr ywe et sh ont Conran, 2 Prati, A ofa"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "entranceform",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "entranceform",
        "ocr_text": "| COLLEGE ADMISSION APPLICATION FORM ‘en 270penee pevliany ie ‘seomummione Onicha 082023__ pentane shat oo\" ame ret _Scroie Kafe Pery otone Tt hone eae me (me _96020 485728 Side: 10 2002 Age24 Crivemip: Cpe Chtoregner ey) ome Aasrens 455. Jones, a a8 orrenn _ Wasrcpaie Ory) 7 To cose) mat Addre _rbeccameore exami ret _Aciwe MabieNe. _o94stt44es4 Sex: Fema ‘Pens Che: incoming Freshman ‘kcal rom which you adetes _Cameron Green and Gao Setod ‘Adore: 348 Corral Deen Sue 408. Catonian. AK 74584 ‘Tack _ Aeademie Track Sead ABIL ‘School veer Graduates TyeeetSchoot Cre Coie Ctansteree Serco st sensed scr. nr ‘Type ot Scheak Citviwee Citic Coure Preference: Fest Pronty, SPTGSSCO \"Sand Py Sabet oteete falar Nenwateralentrermelnd peed sores sage Sancea Metaciand day 202018 ro ET. SS"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "entranceform",
        "ocr_text": "revit eomerer feuticray St Shenae"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "entranceform",
        "ocr_text": "| COLMEGE ACMISSION APPLICATION FORM tase Pet ste gma anaes. nite: Some Adare: Dincawing Freshman Sena aeens CVrantocer see cena cbse Saco Peony: eho"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "entranceform",
        "ocr_text": "| COLLEGE ADMISSION APPLICATION FORA SUEY pepo Sotnnas 08 20. Meow (on Preth Sn seen Ue re SA Bh ooo: ae. Acme ate see DtERSSSARS See Bema. ame ana teasr at sien pieatavee reel cron forests:"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "entranceform",
        "ocr_text": "ioe of school Cire CPE transferee School last tended nesses {ype ot Shook Clhrvate CIPoBIe"
    }
]