[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "entranceform",
        "ocr_text": "[ RRLRATONFORENTRGE examinacion H i i i i 1 = Si Neca H Fenway 29 ang i kt tober worm aehisangteceirnte ne Nar of atc seen Canty Litt Behsel Atndee aston hn ‘Baio Cenuctoe: _ Augiast 90 1987"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "entranceform",
        "ocr_text": "gust 30 2987"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "entranceform",
        "ocr_text": "nomenon esol, Pe FEBTICATION FOR EXAMINATION f 1 1 saxma—| t one i sidan exami at seen of Maes. Aan ah os as Seto! pate gH EEE eres Bares agate PRSER, ‘pas rece: Apa 32 ANT eure ea Hurore Racenet!"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "entranceform",
        "ocr_text": "poe a oe 372058, [eee 5 a ee “= bgepreanian OR ERAN ATI merece a ion ant, tsa BE rr ee al . Meow: sone 8 \\ =e ou. Heom it panied ed pate ctee Felmery at TS | 1 tpn aemmamnnenn a tare enn Contes NE arena ES vm Ares: gperwonpenerr space ease iim oF en a seers of Foes ag Hann FPOAEAICE kore tet inset ste dnb. ee emer apa 3 1987 #2 pate Ceseht"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "entranceform",
        "ocr_text": "Place of Beth: Steam nena (ye Sore eet os so Contact Number: 09770800632 DE mat Adres: aienrson giannis net Name of Father: Smeiope: Meme ot Moter: Aden Casta Address of Parents: “USSHaas FPOAE4eze9 Last Schoo! Attended: Anthony Wright Instie a School Address: 21 ta Perk. rarer Ps General Average: Dato Graduatec: August 30 1007 Honors Received:"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "entranceform",
        "ocr_text": "Form No. FORM 2305 0008 Revision No. Wright Grimes Academy Effectvity Date: August 16 2022 “APPLICATION FOR ENTRANCE EXAMINATION Course Applied: sintrsssmntnianais Date Applied: December 22 2014 Name: ‘Susan Rivera 2x? Pietee Sex___Female _Age _18 Status _Single Date of Bit July 142017 Place of Bit: man ne cw Home Addrose: 49 ¥aer FOR WestLysanaven AL STETO Contact Number: (09640657285 Email Address: andreavaldez example net Name of Father: JustinAllen Name of Mother: DerekKere ‘Address ol Parents: __24314 Watson Brooks, New Joshua, Hl 58555 Last Schoo! Attended Cakiwellailer Colege ‘School Address: 002 Black Estates, Austinmouth, CA 01186 General Average: 98 Date Graduated: July 312022 Honors Received"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "entranceform",
        "ocr_text": "Form No. FORN2305 0008 Revision No. Wriaht Grimes Academy Effectivity Date: August 16 2022 \"APPLICATION FOR ENTRANCE EXAMINATION Course Applad: sintrtsomn 1 Date Applet: December 22 2014 Name Susan Rivera 12 Pic Sex ___Female __Age _18 Status _Single Date of Bit July 142017 Home Actrose: A251 FORE. es. jdanaien ALTO Contaet Number (09940057205 Email Address: andreavaldez examgie net Name of Father: Justinalen Name of Mosher: Derekker Aaldress of Parenis: 2494 Watson Brooks, New Joshus, Hl 58555 Last Seneo! Attended Coldwel Miler College ‘School Address: 002 Black Estates, Austinmouth, CA 1186 Gonoral Average: 28 Date Graduates: July 312022 Honors Received"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "entranceform",
        "ocr_text": "Date of ines Juiy 42017 Pace a ete Conia fasmoer 1a Aspens: are ovnlterprcengie. a1 Fearn alt ow of Mother Denki tenn of acon, (zat Sehgal atte iv Res Cotes 02 Sco Beales, Antares, CA OLEH Gear Anco 28 ‘oat Senta:"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "entranceform",
        "ocr_text": "ot toe Pan AB “aecvennetoce wea OP No NET E cout hoeeser_ ondeovetinatrcemae ret room alfener anencen aoe here Denker “a uown 24214 Watson te, Mew sess HEE Les bones Aeon Caitewiatte: Cat nccs Aste: 12 Raed Soman, MemsnemnA GAGSIPA Care Downe Decrees NE _ roras Reomed"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "entranceform",
        "ocr_text": "onrsireec sre 2808 | op] Mone _____Sonna ana j meee Me 18... 8 __ $tae__..| | ed ne 7 206 mat Aca orctenvadestgeranste ne! Nem ot Free detioaien seene ot Mote omer Aotesncf Parente: 28996 Yimaen Banks, New Joti, BBS a ast Seton Ate Catster Coe Schock Aawese: 052 Black Entole, Auvinmontn. CAO 1108, Sows Anes _#. Owe Cncratas: Ady 312022 eros Recon a"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "entranceform",
        "ocr_text": "aaiaiaell Maidiemienenmmememmee ner eee . sssemses same 8) Mark via Sete 128"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "entranceform",
        "ocr_text": "Come Petes “SEAS Oats Nepean SB 2S a Katee Ween 202 22 Bemom Fees A RI. Si acre t Daze of Brey Mey oF 207 Pace ca or Pan ee ws ewes ET ome Det, 0% Dave Matra, Mark A FORGE em ee Corte asoee ____ SNERMIREDAT Lew Aaron ameerebmangeemie nat teeth sane ites Nera ottoman oe Adarens 8 Paes _ BP Minh na Sute 13. No Se PO iN st te en Remguerin sohor ‘cnt ene: 7 Doth een Mp 2a. ete ee Cort Awa ¥. Dam Gruman Fobra OF 058 secon Fecoiet"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "entranceform",
        "ocr_text": "Fates 03 2024 Ta Dan ey. Maser 9 arog 9 Mor nado of Penns: BL Mavi aan Ste 1B. Net Sen8 2M owepuos ity Soro La Sent! Ata veces cae -"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "entranceform",
        "ocr_text": "Marcaatarstat Gaiege ‘gua Conard ior agrees Paras: ast Soocd Aten Eehces Ae ‘Gens Averargs sur Vii Sate ss nak alo a8 tty Seat. PHL 9A ‘prety DS Peene sR auiierotimeonessentents aes otenry 29 209%"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "entranceform",
        "ocr_text": "“APPLICATION FOR ENTRANCE EXAMINATION, MarshaltMarshall Collage Course Appted: “\"*\"isma7°\" Dato Applied: February 09 2021 Name: __Ms. Katie Weiss MD _ 20 Pen Sox Female __Age _25 ‘Siatus __Mamied Dato of Bet: May 07 2007 Prace of Bit _Pastem supe New renee O7S8 Contact Number _00888565347 Email Address: ashieyrbinuon example net _ Name of Father Jamie Hunt _Name of Mother: _ David are ‘Adress of Parents: 881 Mark Vista Suite 125, North Scot, PW 23014 _ Last Schoo! Attended RodiguezLtd Schoo! ‘School Address: £7 waa Maven Sue 718 Savm Branded. TNO7209 General Average: 87 Dato Graduated: February 08 2018 Honors Received:"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "entranceform",
        "ocr_text": "a ares stony ones Kescagee teres Rane ate Secate"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "entranceform",
        "ocr_text": "oo HGUICKHOU POR ENTREE _ EXAIATON _ i a stone Adicnse, STAM SRE SOUT RORGNT ALE Email Adeoes: —richasda etanokeoes me 0 ote lentu satin essa Aveo '"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "entranceform",
        "ocr_text": "Ee | Feeruary 27 1908 Wong, Waren and Marae Inst Seeeremreneeueee \"APPLICATION FOR ENTRANCE EXAMINATION. ‘Andrea Hunter Sec __ate Age: __10 Date o it: June 112028, Prace of Bath simp nn 98 mot Home Address: #2 Ota Cae, Sum Tyfoun, ALSDSte Contact Number: Name of Father: __Tany Gasp 00599318778 ‘Addtess of Parents Last Schoo! Attended Lopez PLE Schoo! ‘School Adtross: __758Panerrery Mamsmurp DESs761 General Average: Honors Received —82_bate Graduated: _ September 12 2023"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "entranceform",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "entranceform",
        "ocr_text": "i 1 sewcae rata fot a Nowe pies Harte. Bie Dee ctBow one 2 acm cB Lexanonerion ay i i i 4 1 cae aterm SOPH Gs Soe tne SHE estas Ni sons Een Senge: cockmeBagjomesase oe ofa erent ows ct Mocs Wale ene surest me eh ten tart Su Mosc Lave PU Senor! sont ung: SS ONeTEerE Pweg DEAE e. ete Communes. Baptanber 12 2022 Gareen Roepe 000"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "entranceform",
        "ocr_text": "= Semaine tears H sian te: Wiatsun hree Senoet Enectiity Cale THEM gen APPLICATE Ferment nemo ERARIREAS Pt Et saan, Goer Iseaaentneremeenacarcned 2 Namba setvoonara Emi Aaciess aiathgBersemple com ens ctor esac Bie: Acti ef Pauses: 10155 Con atch Suite 928. Yeast are, BaeATR ‘Lis Senco untest Saves te Seo! ‘Some Aasioes _ Severe arent We Soa ey ance Geng eva 8 a. Bite Genta a"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "entranceform",
        "ocr_text": "ots arete ed Reese of Father sos fait Steet Atenas wasre Aone Ye deans of Mots ‘Gumings bre Seta} ete Gradua eat Renwene 2% erative Men 2135 ine sits ke 324, Mioet Ofna FLBRIT. aay 08 2013"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "entranceform",
        "ocr_text": "rere partment APBUICATION FORE ce Eanations j j a | to Sit 2031 J t ome Aironae SM AO En nee nsae Bena wee Name of Mabe Sadan of Pare 10105 Sin nae tI West Les Sch Aecdoe! homme bs Shien 2"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "entranceform",
        "ocr_text": "cee nnn nnn Ca Acco Ne dente Waa Ses hae ae Suna Sree. No of Bey dere 23 2021 peat Maree oot yoaner2 eiceot Genera com New o Fare Aone we verona ler Aosens d Pare 10128 Cine inna Sute 234 Went Oare. 0 90078 Unt Sere Aor emerge he Sena"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "entranceform",
        "ocr_text": "yo erben ES OPORE TES s EXSUINATION, peers -_ perpen an ab aaa com asters: saotepexamste oo\" ga 1390572 vasa ME conten Hab 28 aire ort sa ots ian. cone st Ba cunenrat ast Sehoot abenciat caress RS May BRS onl ROSS"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "entranceform",
        "ocr_text": "Form No. FORM 2023 3288 Revision No. Lewis Rubio Unversity Effectvity Date _| February 25 2005, ad “APPLICATION FOR ENTRANCE EXAMINATION Course Applied: secexranataizauater Date Applied: __Januery02 2022 Name: Tenothy Rodriguez 2x? Pietee Sex Male ‘Age _26 Status _Single Dale of Bith: November 15 2008 Place of Bit: cee Jn, roe 5 Home Addrose, 85 FORE Roast, PorTayorde PASTIB4 Contact Number: 100002588504 Email Address: jemifer62 example com Name of Father: rarnagare Name of Mother: Victoria Holloway. ‘Address ol Parents: _ #533 Saun Gee sot 58, a kar RISES Last Schoo! Attended Jackson, Huang and Diaz Schoo! ‘School Address: __SSSHioey Rane ate 6h ulcers NOSES General Average: 7 Date Graduated: November G7 2003 Honors Received"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "entranceform",
        "ocr_text": "Form No. FORM 2023 3288 Revision No. Lewis Rubio Unversity Effectvity Date _| February 25 2005, ad “APPLICATION FOR ENTRANCE EXAMINATION Course Applied: secexranataizauater Date Applied: __Januery02 2022 Name: Tenothy Rodriguez 2x? Pietee Sex Male ‘Age _26 Status _Single Dale of Bith: November 15 2008 Place of Bit: cee Jn, roe 5 Home Addrose, 85 FORE Roast, PorTayorde PASTIB4 Contact Number: 100002588504 Email Address: jemifer62 example com Name of Father: rarnagare Name of Mother: Victoria Holloway. ‘Address ol Parents: _ #533 Saun Gee sot 58, a kar RISES Last Schoo! Attended Jackson, Huang and Diaz Schoo! ‘School Address: __SSSHioey Rane ate 6h ulcers NOSES General Average: 7 Date Graduated: November G7 2003 Honors Received"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "entranceform",
        "ocr_text": "cocina wantin Sane ene | Now ~—Trnemy Resins. 20 Peeee Prince of Sat: sone love. em arses Hy owas SOP POP Rents, open, OA HY Contact fier DrecriRtOs a Sere cf Fanos a Apa Name of deer, Mite Hennaey cede f Para: en wma naw ar naman MM Lat wo earn, Secrton, Hoang and Ces Bevo ‘Serco! Aina: _ boar Hat Ana Be Conard Reon: Dum Censored. Noveecber OT 2003 Mores Racewer -"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "entranceform",
        "ocr_text": "a =] ‘APPLICATION FOR ENTRANCE EXAMINATION, Course Applod: suneerePrataitenaton Date Applied: January? 2022 Name __Tenotty Redtigvez_ _ _ 290 Bice Sex Male Age __26 Status _Singie Date of Birth: November 15 2008 _ Place of Bith: acer sn 0 89809 _ Home Address; #8 FOR Rabo, Pat Tyree PAST} _ Contact Number: ‘one2586804 _ Name of Father rownagire Address of Parents: _ 18 Sun gers se Last School attended: Jackson, Huang and Diaz Schoa ‘School Address: __SHECneery Rew ue Mk rie No usD Coneral Average: ‘November 07 2003, Honors Recewved!"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "entranceform",
        "ocr_text": "Date ct ese Proce otter, SPO ce t018 mas ttm Adorn. 0 be Poom Pottermes maaree Comes tractor mune Naf Pater saarapeee a A226 ot Porm: theme owen tae ta Sets arenes a {Sate Haass,"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "entranceform",
        "ocr_text": "momas, Herrera and Praios institute APPLICATION FOR ENTRANCE EXAMINATION. x S752 DPOAASUSST course Apps: Name: sex Female Date of Bet: race of Bit Home Adress: Contact Number: 05220149821 nomen wtzoenigearo es Nasue of Foor, —— Adam shes ——— ame of Mother: Mrs. docalun no acsress o Parents va en cxag, se 7. MITES Last Schoo! Attended: Pham Lane Academy Z tension, Marindut, FL76140 ‘senoot Address: 7272 Neches E a1 General Average: —"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "entranceform",
        "ocr_text": "‘Troman termes and Pros teste umereg te va S09 Em Conn Aan SES Dut opted: ature orzo} i ar oma oan Ovit ee ___fesmta___ Aa. Dart Bebe Seommaer eI Preceet Orv: por teeres ter manages at j fas neoe Ponta paomn Arona wie —— Contac orber oma woeny Lat Aces tage @ererme oy maane ot hare: tam Rissersion ume ot me: Mes Joanie King Aston a rer Ron Crmany, a Gary (et Seto! Anestee Pramien Acaton Sent Aetroan: TAT Metro Keren Mert FL 8) teow mearee a Dito Geucacr _— Oetser 20 1 Woon Racthet ."
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "entranceform",
        "ocr_text": "SRL RON TOR ERE) Seu gamete. ‘ws 8, Box ENEE, APOE onan erat Gages: isu iGo vadeon_ Name af star: Mes davatyn Prarnams Bowie Scho! Anarene 2 Nenoles sion. ar rues anor Average a Date Gretistes Setaber 20 10s"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "entranceform",
        "ocr_text": "EA Geared ‘ j a a Phan oy Es dessin ving 20 1288"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "entranceform",
        "ocr_text": "J mene] 1 waxaee soon Themes, eon ans Hemp inate ROTEA ar P82 O80 98 HSE ae (OPCEMGH POR ER RANE a scene nnn nerve RENAE THO ES metre } Gone Aaa: RT ae Ne ‘ison 0 Pana Pi eat San O34 Se ee i Sree trate i vec Actas FOS HA Reteoheac nee osiscs amber E mae mas Aare nF Nth 28 Se Crneng a Say 264385 Memeeriteesse sions ows od Fate Nea darsien King Ahn Sic ii 8 rcs. (rt 3200 eet Phoonk festomy Mess Roots, RTS Hela Rens an, PL Pasay nares Acweage 3"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "entranceform",
        "ocr_text": "eset 0 Ss fess SYS OA ENT RENE SIEIREETION, nner"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "entranceform",
        "ocr_text": "\\ ne ones Raed ommcee ence ning Se Aa wo _ setrey anes See a Bi a A sts 1 Dole ates dip (829 eee ance mnowe rem ONESIES ‘erences nmnrnnet corte resrbar: SEHR poet aidine:, dichanlssrahipeenes ns ee ame oi Mater: dane 5 2R Ainntain Nau, Macro A THEE. Asters Pa ast fichost Monae Lewin eens ico Acres: ante Average we Fain Sradvto dane TOROS Honese Bansiet"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "entranceform",
        "ocr_text": "joven, Psartas rs PSwnes ALOE a ne Rypiod: ser cern 6 ee BRB ene IP an Bn nm ro oy 8200 praca cn Bit wit na rg Bane tan ae ims _ ean Sian I ardace Bre geuseanonss st at sa 28 Fate atoms Paves as eos abst sereh Maron arenes DHA DORE. sate Ieee Lewis tht Hotes ey ered vor srs Penevees seaerneeeeman eset ECE Data Grose erred ce Sexist Bi. ore OER TIPE OR SXABIMATIO ene — can paderavesaeh porters meter adams Oat Again Seton De Bane NFER"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "entranceform",
        "ocr_text": "Form No. FuE20221878 YIAC Revision No. Johnson, Fuentes and Petersen Academy effectivity Date: [February 15 2021 mee “APPLICATION FOR ENTRANCE EXAMINATION Course Applod: susetraaceerinnctrs Dato Applied ne 17 2028 Name: Jeffrey Lopez suo Pun Sex____Male __Age _24 ___Siatus _naried _| Date of Bit ly 082018 Place of Bit: $500. ry ie atin Wt Home Addrase: _ SMC Fer 24 207 Sym ALss012 Contact Number: ose 14450641 Email Address: schardsserah examole org Name of Father: Lesh Marin Name of Mother: ‘Adam Cia ‘Addross ol Parents: 12691 Momilan Neck. Martinview. WI 75125 Last Schoo! Attended LewisLc University School Address: __ S77 was vest 63 aemanat 203138 General Average: 93 Dale Graduated: June 092003 Honors Received"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "entranceform",
        "ocr_text": "\"APPLICATION FOR ENTRANCE EXAMINATION Johnson, Fuentes and Petersen Academy Course Appied: suoeeresceneinteare Dato Applad: June 172023 Name: Jefrey Lopez _ 20 Penn Sex Male Age: __24 Dato of Bit July 08 2014 puceofewe: scam tewenanse twin wrms Home Address: _ SMSeE Fer te 347 bmn. AL O12 Contact Number _09214458081 Emat Address: ichadssarah eampleog Name of Father: __ Leah Martin Name of Mother: ‘Adam Clare ‘Address of Parents: 12001 Memilan Neck. Matinviw, Wi 75125. Last Schoo! Attended LewisLLc University School Address: __ #277 Owes Gero remark 23038 General Average: Honors Recenved Date Graduated: June 0092003"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "entranceform",
        "ocr_text": "Lu i one Roses: MEW Hearn ntentum reece j a breed sat ee macy ny Haran ey ‘ora 9980 Serena Soca, 90 Hones Frcumy 0 vei"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "entranceform",
        "ocr_text": "‘Yona tee eevincn Be, ntowaine Date Asso ‘e He Date Geadustes: Heteuny as 1082 rionors Raowived _"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "entranceform",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "entranceform",
        "ocr_text": "Date of Bre: Auguat 26 2025 Pace of Bem ey Home Address: 7% ems ta nes pm Pm ce Contact Numba ooerzz00 08 mat Access woahan exampie net Name of Faber cee === ‘Accrens ol Parents: $2452 Wicax Run Sule 214. Erictort Me 99005, Last Scroo Aero Myers LLC tnatevte ‘School Address: Unf 3900 Box £720, OPO AP 91897 Conerat Average, cy Onto Gracin Fetrunry 08 1008 Monona Recewed"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "entranceform",
        "ocr_text": "een etme Lcocacean perernes ponte t Mens og Caters sme ee ae i Jplemierramrane L wt Examen whee Soasn tessnine 98 at 28 cog eed Sermo: easazzsanae Pan et Hine 39. Boees 06 a3, roses PAP ane? PRBS eo so Sito 2 tarsi 2 Fan 6705, Semin Receives:"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "entranceform",
        "ocr_text": "Form No. ‘22ENR O870Z Revision No. Johnson Ine University Efectivity Date: May 13 2013 “= “APPLICATION FOR ENTRANCE EXAMINATION. Course Applied: “*™uactrG\"°\" Date Applied: December 27 1997. Name: Kristen Ochoa. 219 Pichia Sex fale ‘Age _18 Siatus __ Maried Date of Bit ‘August 04 2012 Prace of Bit: {cts ae ue Ragnar Aen Home Address: 9487 Vaughn Fort Adianhaven, KY 88103, Contact Number: onass376252 Email Address: scottwiliamson example com Name of Father: ‘Steven Richard Name of Mother: __Hesther Richards. ‘Address of Parents: PSC 4820, Box 2998, APO AA75728 Last Schoo! Attended: \\Vakiez Henson Colege ‘School Address: _62 36FurerBeentora epeen PASE General Average: 23 Date Graduated: _ November 09 2020 Honors Received"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "entranceform",
        "ocr_text": "‘August 04 2012 Piece of Bs aanpaenn Ot veep. Mtoe aE — contact bar. 08248370252 Emus Addross: seotwiamson eexamee com ume of Fate: Steven Recher \"Name of Mother: Heather Richart ‘stress ol Parents 1p9c 4920 ox 0998, APO AATS728— Last Scnoo Atendes Valdes Henson Cotege - at Adrenn, _ _ nr mere wees I oneal Average 3 ‘Date Graduated: _ November 0@ 2020, Honors Received"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "entranceform",
        "ocr_text": "ee ance —_ ees Fenn a\" al PEs near ba Unio ore i = REPTER TION FSR ERTEAREE seve ed nee een nena EM ARSIAATION ate Apes Deceinae 38 agust 8 FEN nag, HBT Hen Fam, earner KY $903 Conte emer oasearazes Ema Aastuna: saatottamccntinenegie oem tone of Rater Siren Rehaees Deon of ote patio Rishi Pascoe Prowse PAC 48RD Ren 998. APOAS T8720 1 Sarasa witenttencay Fenn Rose 8 Date Erosive"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "entranceform",
        "ocr_text": "Johnson ine University Dato ofBiet: August 04 2012 Prace of Birth: —__ Se ante tpnershA 0) Home Address, S87 Vaughn For AdsanhavenKY 80103 Contact Number: 98248376252 Name of Father Steven Richard Address of Parents: PSC 4920, Box 9988. APO AATS728_ Last School Attended: \\Valdes Hensen College _ ‘School Addross: _ SH Paver serene end PANERA _ - General Averape: 93 Date Graduated: _ November 09 2020 Honors Recoived:"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "entranceform",
        "ocr_text": "‘APPLICATION FOR ENTRANCE EXAMINATION Nar Krsten Ocnae Sen Mae Age otBely August oF 2012 Peace of Bath wens Contact Nuree osrassre2s2 t hamson erample com Nam of Seven Re Heae Richards PSC 4920, Box 9098, APOAA 75728 fides Manson Cotege 03 November 08 20"
    }
]