[
    {
        "image": "evalform1_synth_10_aug1.png",
        "label": "evalform",
        "ocr_text": "fan BB: Li 4 Republic of the Philippines Department of Education Region 85 DIVISION OF SOUTH COTABATO Ago District Howard Wallace School EVALUATION FORM DATE: February 15, 2025_ gram according to the n refer to the following PROGRAM TITLE Re engineered motivatin help desk Direction: Please asses’ indicators below Please rating scale 4 Strongly Agree (SA). 3 Agree( A s the effectiveness of the entire pro check the appropriate box and you cai ), 2 Disagree (D). 1 Strongly Disagree SD) anagement P reparation Program Planning delivered as planned 7| The program was 2] The program was managed efficiently 3,| The program was well structured Attainment of Objectives 4] The program ‘objectives were cleany presented The session objectives were logically arranged 5 The program and session objectives were attained Program Management Team Program Management Team members were courteous 7 ls Program Mana: Program Mana quest stakeholders d Accommodation fe was well lighted gement Team was efficient The venue was com activities ality is and sufficient in quantity and qui he accommodation was com fortal conditions future? p since leg weight establish. ould vou suaaest to improvement similar in the ‘What chanaes W' conference professional to Provide interview"
    },
    {
        "image": "evalform1_synth_10_aug2.png",
        "label": "evalform",
        "ocr_text": "ATO Howard Wallace Schaoi vane 06796 Singh Field, Lindseyiurt, VA 37985 seman EVALUATION FORM rating scale"
    },
    {
        "image": "evalform1_synth_10_aug3.png",
        "label": "evalform",
        "ocr_text": "DIVISION Age isiict Hovaretmnars Schoo! Fleld Lin Seyturt VA 37: 965 EVALUATION Form =: _Re engineered motivating heip desk ie the sffectivaness of the entire @MG you co sagres (OD) 1 Stronal indicator eee What cha would vou sud ant fy inrovemerh similar in ine future? Provide interview conference pr ofessional fop since leq weight establish."
    },
    {
        "image": "evalform1_synth_10_aug4.png",
        "label": "evalform",
        "ocr_text": "fe ‘BB: td Republic of the Philippines Department of Education Region 85 DIVISION OF SOUTH COTABATO. Ago District Howard Wallace School EVALUATION FORM PROGRAM TITLE: _Re engineered motivating help desk_ DATE: February 15, 2025 Direction: Please assess the effectiveness of the en indicators below Please check the ai rating scale 4 Strongly Agree (SA); 3 Agree( A); 2 Disagree (D); 1 Strongly Disagree SD) tire program according to the propriate box and you can refer to the following Program Planning Management P reparation The program was delivered as planned The program was managed efficiently 3.) The program was well structured Attainment of Objectives The program objectives were clearly presented The session objectives were logically arranged The program and session objectives were attained Program Management Team Program Management Team members were courteous Program Management Team was efficient Program Management Team was responsive to the needs of guest stakeholders The venue was well lighted and ventilated The venue was comfortable with sufficient space for program activities The venue had sanitary and hygienic conditions Meals were nutntious and sufficient in quantity and quality The accommodation was comfortable with sanitary and hygienic What chanaes would vou suaaest to imorovement similar in the future? Provide interview conference professional top since leg weight establish."
    },
    {
        "image": "evalform1_synth_10_aug5.png",
        "label": "evalform",
        "ocr_text": "Wa A Howard. {6198 Singh Fj ace Schoal Deseyfurt va 37965 EVALUATION FORM $i Pr Direction inchcators 22 (D) -Stror ora, pod Lory {Spy COTO OT ear pete ea, UnCroverm ent Simiar uh 8Ssional top si nee leg w, SIGht establish"
    },
    {
        "image": "evalform1_synth_1_aug1.png",
        "label": "evalform",
        "ocr_text": "Jones Adams 2359 Benneti Mil ie 745, Port Tracyhaven, MO 45426 EVALUATION FORM _e Decentralized req y forward religious final f Body any _ SOO0) nn"
    },
    {
        "image": "evalform1_synth_1_aug2.png",
        "label": "evalform",
        "ocr_text": "DIVISION Jones Adams and Brown School teter S 23 J H 7 i, OY a A, ARAIE 2359 Bannett M Suite ‘ort iracynaven, MO 48496 EVALUATION FORM Decentratize: mre TENE 2 Ene icllowing program ar) Melt i Bod ~8G0R_. 5 narey. f arin ine Yan yone buy especially which arry forward re! gious final finish main"
    },
    {
        "image": "evalform1_synth_1_aug3.png",
        "label": "evalform",
        "ocr_text": "Know District ns and Brown School 746, Port Tracvhaven, MO 46426 i asetsnncenconontnen auc EVALUATOON FORM sal workforce _Decentralized re mts) a Agreet A), am Man. vent Team | soon —"
    },
    {
        "image": "evalform1_synth_1_aug4.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippines Department of Education Region 9 DIVISION OF SOUTH COTABATO Know District Jones Adams and Brown School 2359 Bennett Mill Suite 746, Port Ti ven, MO 46426 EVALUATION FORM ional workforce DATE: April 49 2024 PROGRAM TITLE lease assess the effectiveness of the entire program according to the e check the appropriate box and you can refer to the following 2 Disagree (D). 4 Strongly Disag Decentralized r Direction: PI indicators below Pleas rating scale 4 Strongly Agree (SA). 3 Agree( A). Program Planning GnagementP reparation ri d as planned || The program was delivere The program was well structured rei | iB__| Se of Objectives ee ee ectives were dearly presented The program obj ree SD) Program Man Program Manageme Program Mana! quest stakeholde modation N lighted and vel as comfortable with sanitary and hygienic nt similar in the future? h carry forward religious final finish main 4 fe ___| Overall What chanaes W' Body anyon ould vou suaaest to imoroveme! e buy especially whic!"
    },
    {
        "image": "evalform1_synth_1_aug5.png",
        "label": "evalform",
        "ocr_text": "HDDINeS LCBO Know District vones Adams and Brown School 2359 Gannett Mil Suite 74 46. Port Tracyhaver, MO 46426 EVALUATION FORM WOGRAM THLE: Decentralized regional workiorce 3 the effectiveness of f poroprate niin 2 entire p and you can yAgres (SA) 3 Agrest i Strongly Disage indicator sa nna ne PODS bjeciives were alairied i Manager nant 182 Body a anyone buy: ‘eapeci ially which carry forward religious final finish mail in"
    },
    {
        "image": "evalform1_synth_2_aug1.png",
        "label": "evalform",
        "ocr_text": "cavist District 7 Reilly Smith and Rubio Sc aol 2. AR S68I9 9256 30 Road, Pon Jame: EVALUATION FORK Future-£ ae jocal access saga to the the following es for trial that oper gis Ser jes ion fon. ward water home analy Try measure “apes erat it"
    },
    {
        "image": "evalform1_synth_2_aug2.png",
        "label": "evalform",
        "ocr_text": "fe See Republic of the Philippines Department of Education Region 30 DIVISION OF SOUTH COTABATO District 7 Reilly Smith and Rubio School EVALUATION FORM PROGRAM TITLE: _Future proofed local access DATE: June 10 2024 Direction: Please assess the effectiveness of the entire program according to the indicators below Please check the appropriate box and you can refer to the following rating scale 4 Strongly Agree (SA), 3 Agree( A), 2 Disagree (D); 1 Strongly Disagree SD) Indicator Rate Program Planning Management P reparation | The program was delivered as planned The program was managed efficiently The program was well structured B Attainment of Objectives 4] The program objectives were clearly presented The session objectives were logically arranged 5 | The program and session objectives were attained Yr [ je] Program Management Team Program Management Team members were courteous 7 Program Management Team was efficient guest stakeholders Venue and Accommodation lo Program Management Team was responsive to the needs of 1D | The venue was well lighted and ventilated 1 The venue was comfortable with sufficient space for program pe} | 1. activities The venue had sanitary and hygienic conditions Meals were nutntious and sufficient in quantity and quality 3 1 The accommodation was comfortable with sanitary and hygienic 4. conditions E _ Overall ‘What chanaes would vou suaaest to imorovement similar in the future? Try measure apply operation forward water home analysis series for trial that open movement hear."
    },
    {
        "image": "evalform1_synth_2_aug3.png",
        "label": "evalform",
        "ocr_text": "7 oan, iy Smith and Rubio School 36, Smith Road, Port Jamesshire, AR 66870 EVALUATION FORM try measure e apply operation forw. ard water home analysis series for trial that open mov sment f"
    },
    {
        "image": "evalform1_synth_2_aug4.png",
        "label": "evalform",
        "ocr_text": "S ba a Republic of the Philippines Department of Education Region 30 DIVISION OF SOUTH COTABATO District 7 Reilly Smith and Rubio School 56 S: a rt Jamesshir 66870 EVALUATION FORM PROGRAM TITLE: _Future proofed local access DATE: June 10, 2024 Direction: Please assess the effectiveness of the entire program according to the indicators below Please check the appropriate box and you can refer to the following rating scale 4 Strongly Agree (SA); 3 Agree( A); 2 Disagree (D); 1 Strongly Disagree SD) Program Planning Management Preparation The program was delivered as planned The program was well structured Attainment of Objectives The program objectives were clearly presented The session objectives were logically arranged The program and session objectives were attained Program Management Team Program Management Team members were courteous Program Management Team was efficient Program Management Team was responsive to the needs of guest stakeholders The venue was well lighted and ventilated The venue was comfortable with sufficient space for program activities _| The venue had sanitary and hygienic conditions Meals were nutritious and sufficient in quantity and quality The accommodation was comfortable with sanitary and hygienic conditions _| Overall What chanaes would vou suaaest to improvernent similar in the future? Try measure apply operation forward water home analysis series for trial that open movement hear. }"
    },
    {
        "image": "evalform1_synth_2_aug5.png",
        "label": "evalform",
        "ocr_text": "et? Reilly smith and Rubio Schoo! 2256 Smith R 30. Por damesshire EVALUATION PORK we Futur Ufe proofed Wed OCS access OY rio the gree (Dy Strongly D Ouch Try measure apply operation forware water home analysis 5 Séries for trial that open ear. enn eee"
    },
    {
        "image": "evalform1_synth_3_aug1.png",
        "label": "evalform",
        "ocr_text": "F 2 aot Republic of the Philippines Department of Education Region 4 DIVISION OF SOUTH COTABATO Computer District Torres Bentley Schoo! 100 Krause Crossing Suite 975, Sarahburgh, FL 09368 EVALUATION F ORM geme gue st stakeholders Venue and ‘Om fortable with sufficient space for program The venue had sanitary and hygienic conditions"
    },
    {
        "image": "evalform1_synth_3_aug2.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippini Department of Education Re DIVISION O SUTH COTABATO Computer District Torres Bentley School 100 Krause Crossing Suite 975, Sarahburgh, FL 09368 EVALUATION FORM “AM TITLE _Triple buffered web enabled attitude DATE. August 24, 2023 enabled attitude AUgUSE 24, 2023 _ Direction’ Please assess the effectiy rs below Please check th le 4 Strongly Agree (SA), 3 Agree Ss of the ent riate box anc re prograrn rding to the ucan refer to the following approp rating 4), 2 D ree (D). 1 Strongly Disagr ogram Planning h The program was del The programm was managed efficiently The program was well structured Attainment of Objec The program obje ere clearly presented The session objectives were logically alranged The prograrn and session objectives we ained Prograrn Management Team Programm M. anagement Te. am members were courteous Program Management Team wa efficient Program Management Team gue st stakeholders Venue and was responsive to the ne Meals were nutntious and sufficient in quantity and quality The accommodation was com fortable with sanitary and hygienic itions. What chanaes would WOU Sudaest to improvement similar in the future? Quickly begin window main toward theory respond."
    },
    {
        "image": "evalform1_synth_3_aug3.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippines Department of Education Region 14 DIVISION OF SOUTH COTABATO Computer District Torres Bentley School 100 Krause Crossii Suite 975, Sarahbu Ih, FL 09368 EVALUATION FORM PROGRAM TITLE Triple buffered web enabled attitude DATE August 24 2023 _ ase check the appropriate box and you can refer to the following rating scale 4 Strongly Agree (SA); 3 Agree( A); 2 Disagree (D); 1 Strongly Disagree SD) [A [Program Planning anagement P reparation |] The program was delivered as planned The program was managed efficiently The program was well structured [8 [Attainment of Objectives 4] The program objectives were Clearly presented ls The session objectives were logically arranged Py 5 I The program and session objectives were attained |e |C [Program Management Team || || Program Management Team members were courteous |] 7. Program Management Team was efficient Program Management Team was responsive to the needs of guest stakeholders 1D d Venue ani Accommodation Yd The venue was well lighted and ventilated 1] The venue was comfortable with sufficient space for Program 1. activities The venue had sanitary and hygienic conditions 1 1] Meals were nutntious and Sufficient in quantity and quality P| 3 1] The accommodation was comfortable with sanitary and hygienic 4. conditions Overall a What chanaes would VOU Su laaest to imnrovement similar in the future? Quickly begi n window main toward theory respond."
    },
    {
        "image": "evalform1_synth_3_aug4.png",
        "label": "evalform",
        "ocr_text": "| Quickly begin window m"
    },
    {
        "image": "evalform1_synth_3_aug5.png",
        "label": "evalform",
        "ocr_text": "S S By Republic of the Philippines Department of Education Region 1 DIVISION OF SOUTH COTABATO Computer District Torres Bentley School 100 Krause Crossing Suite 975, Sarahburgh, FL 09368 EVALUATION FORM PROGRAM TITLE: Triple buffered web enabled attitude DATE: August 24 2023 _ Direction: Please assess the effectiveness of the entire program according to the indicators below Please check the appropriate box and you can refer to the following rating scale 4 Strongly Agree (SA), 3- -Agree( A), 2 Disagree (D), 1 -Strongly Disagree SD) Program Planning Management P reparation ‘| The program was delivered as planned The program was managed efficiently The program was well structured Attainment of Objectives The program objectives were clearly presented The session objectives were logically arranged The program and session objectives were attained Program Management Team Program Management Team members were courteous Program Management Team was efficient Program Management Team was responsive to the needs of guest stakeholders The venue was well lighted and ventilated The venue was comfortable with sufficient space for program activities The venue had sanitary and hygienic conditions Meals were nutntious and sufficient in quantity and quality The accommodation was comfortable with sanitary and hygienic conditions E Overall What chanaes would vou suaaest to improvement similar in the future? Quickly begin window main toward theory respond."
    },
    {
        "image": "evalform1_synth_4_aug1.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippines Department of Education Region 62 DIVISION OF SOUTH C District 44 Moreno Holt and Erickson School 21 Collins Pike Samantha, FM 9364 EVALUATION FORM PROGRAM TITLE. Multi channeled incremental Standardization DATE: May 13 2025 Direction: Please assess the effectiveness of the entire indicators below PI Program according to the ease check the appropriate box and yOu can refer to the following rating scale: OTABATO 4 Strongly Agree (SA); 3 Agree( A); 2 Disagree (D); 1 Strongly Disagree sp) A Program Planni ha ManagementiPreparation 1] The Program wi 4s delivered as Planned 2.| The Program was managed efficiently 3] The Program was well structured Attainment of Objectives 4] The Program objectives were clearly Presented The session objectives were logically arranged The Program and session objectives were attained Program Management Team Program Management Team members were courteous Program Management Team was efficient Program Managem guest stakeholders Venue and Comfortable with sufficient space for program activities The venue had sanitary and hygienic Conditions"
    },
    {
        "image": "evalform1_synth_4_aug2.png",
        "label": "evalform",
        "ocr_text": "DIVISION OF S District 44 Moreno Holt and Erickson School cast Samaning EN 25354 221 Collins Pike ary EVALUATION FORM ~. fult channeled incremental standardization _Multi cha eee c the entre pro can refer ate pox and you ase check the sagree Sl Sy +-Strongly DI am arid 58% miiary ered A inthe a 2? leave choice guess star military popular might light college alae sores Winat chan SOLE St saaest tg imoroven ant 4 Choose item property _AGTOSS.. —"
    },
    {
        "image": "evalform1_synth_4_aug3.png",
        "label": "evalform",
        "ocr_text": "art 8S fo, Republic of the Philippines Department of Education Region 62 DIVISION oF SOUTH COTABATO District 41 on Schoo! Moreno Holt and Ericks I 221 Collins Pike East Samantha FM 25364 EVALUATION FORM ntal standardization pate May 1 3 2025 PROGRAM TITLE ulti channeled increme! rogram acco ding to the the effectiveness of the entire P d you can refer to the following Direction’ Please assess indicators below Please check the appropriate box an rating scale (SA), 3 Agree( A), 2 Disagree (DY). 1 Stronaly Disag 4 Strongly Agree nq Managem entP reparation Program Plann as delivered as planned The program W: efficiently The program was managed The program was well structured f Objectives ectives were cleanly presented Attainment 0 The program ob) ally arranged The session objectives were logic ives were attained sion object! The program and se Program Management Team Program Management Team members were courteous mwas efficient Program M anagement Tea ve to the needs of gement Team was respons Program Mana Ke ventilated The venue was comfortable with sufficient space for program activities The venue had sanitary and hygienic conditions ality Meals were mutntious and su fficient 1n quantity and q' rtable with sanitary and hygienic The accommod ation was comfol conditions Overall What chanaes would Choose item pro re O wverent similar in the fiture? guess star military Po pular might light college jou suiaaest to imoro perty leave choice"
    },
    {
        "image": "evalform1_synth_4_aug4.png",
        "label": "evalform",
        "ocr_text": "Republic ofthe Philippines Department of Education Region 62 DIVISION OF SOUTH COTABATO District 44 Moreno Holt and Erickson Schoo! 221 Collins Pike East Samantha FM 25364 EVALUATION FORM DATE: May 13 2025 of the entire Progra he @ppropriate box and you can rating scale m according to the 4 Strongly Agree (SA); 3 Agree( A, refer to the following ); 2 Disagree D); 1 Strongly Disagree sp) gem guest stakeholders Venue and"
    },
    {
        "image": "evalform1_synth_4_aug5.png",
        "label": "evalform",
        "ocr_text": "Reoubl: Distrc a4t Moreno Holt and Erickson School 221 Collins P East Samantha, FM 25364 EVALUATION FORM PROGRAM TIT Multi channeied incrementa! standardization DATE May 12 2025 of the entre pr oprate box and vou ASy t amodation nd ventiated Choose itern propery le leave choice guess star military popular might light college _ACTOSS."
    },
    {
        "image": "evalform1_synth_5_aug1.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippines Department of Education Region 86 DIVISION OF SOUTH COTABATO Best District Brooks Gross School 1272 Anna Run, Loweview, SC 26219 Ce eee eee ee eee ey EVALUATION FORM PROGRAM TITLE: _Organized background capacity DATE: January 18, 2025_ Direction: Please assess the effectiveness of the entire prograrn according to the indicators below Please check the appropriate box and you can refer to the following rating scale 4 Strongly Agree (SA), 3 Agree( A}, 2 Disagree (D); 1 Strongly Disagree SD} Indicator Program Planning ManagementPreparation The programm was delivered as planned The program was managed efficiently The program was well structured Attainment of Objectives The program objectives were clearly presented The session objectives were logically aranged The program and session objectives were attained Program Management Team Program Management Team members were courteous Program Management Team was efficient Program Management Team was responsive to the needs of guest stakeholders Venue and Accommodation The venue was well lighted and ventilated The venue was comfortable with sufficient space for program activities The venue had sanitary and hygienic conditions Meals were nutntious and sufficient in quantity and quality The accommodation was comfortable with sanitary and hygienic conditions Overall VWvhat chanaes would vou suadest to improvernent similar in the future? Church view effort success medical these represent condition individual treatment agreement."
    },
    {
        "image": "evalform1_synth_5_aug2.png",
        "label": "evalform",
        "ocr_text": "Brooks Gross School ig72 Anna Run, Loweview. SC 26219 EVALUATION FORM Y S OW Church view effort success me _treatment agre t"
    },
    {
        "image": "evalform1_synth_5_aug3.png",
        "label": "evalform",
        "ocr_text": "Best District Brooks Gross School i272 Anna Run. Loweview, SC 25219 EVALUATION FORM d background car nuary 18, 2 mrefer ts the me Maat char Church view effort success medical these represent cendition individual i i treat menta"
    },
    {
        "image": "evalform1_synth_5_aug4.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippines Department of Education Region 86 DIVISION OF SOUTH COTABATO Best District Brooks Gross School 4272 Anna Run vie! 6219 EVALUATION FORM PROGRAM TITLE _Organized background capacity DATE January 18, 2025 Direction Please assess the effectiveness of the entire program according to the Indicators below Please check the appropriate box and you can refer to the following rating scale 4 Strongly Agree (SA), 3 Agree( A), 2 Disagree (D), 1 Strongly Disagree SD) Indicator Program Planning Management P reparation The program was delivered as planned The program was managed efficiently The program was well structured Attainment of Objectives The program o leary presented The session objectives were logically amanged The program and session objectives were attained Program Management Team Program Management Team members were courteous Program Management Team was efficient Program Management Team was responsive to the needs of quest stakehc Venue and Ac« The venue was well lighted and ventilated The venue was comfortable with sufficient space for program activi The venue had sanitary and hygienic conditions Meals were nutntious and sufficient in quantity and quality The accommodation was comfortable with sanitary and hygienic conditions Overall What chanaes would vou suadest to improvement similar in the future? Church view effort success medical these represent condition individual treatment agreement."
    },
    {
        "image": "evalform1_synth_5_aug5.png",
        "label": "evalform",
        "ocr_text": "Church view effort success madical these rep vt condition individual _teaiment agreement."
    },
    {
        "image": "evalform1_synth_6_aug1.png",
        "label": "evalform",
        "ocr_text": "& By Republic of the Philippines Department of Education Region 8 DIVISION OF SOUTH COTABATO District 11 Garcia Inc School 2425 Sherry Causeway. West Garrett, CO 90721 EVALUATION FORM ny fat PROGRAM TITLE: Reduced exuding forecast DATE: October 19, 2023 effectiveness of the entire program according to the Direction: Please assess the the appropriate box and you can refer to the following indicators below Please check rating scale 4 Strongly Agree (SA). 3 Agree( A), 2 Disagree (D); 1 Strongly Disagree SD) Program Planning Management P reparation The program was delivered as planned The program was managed efficiently The program was well structured Attainment of Objectives The program objectives were Clearly presented The session objectives were logically arranged The program and session objectives were attained Program Management Team Program Management Team members were courteous inagement Team was efficient Program Mai Program Management Team was responsive to the needs of quest stakeholders Venue and Accommodation The venue was well lignted and ventilated The ven activities The venue had sanitary an The accommodation was comfo conditions the future? general inste ad any production est to improvement similar in ‘ould vou suad ger more What chanaes W der sport music mana Section le pany."
    },
    {
        "image": "evalform1_synth_6_aug2.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippines Department of Education Region 8 DIVISION OF SOUTH COTABATO District 11 Garcia Inc School 2425 Sherry Causeway, West Garrett, CO 90721 EVALUATION FORM PROGRAM TITLE: _Reduced exuding forecast DATE: October 19, 2023 _ Direction: Please assess the effectiveness of the entire program according to the indicators below Please check the appropriate box and you can refer to the following rating scale: 4 Strongly Agree (SA); 3 Agree( A); 2 Disagree (D); 1 Strongly Disagree SD) Indicator Program Planning Management Preparation The program was delivered as planned The program was managed efficiently The program was well structured Attainment of Objectives The program objectives were clearly presented The session objectives were logically arranged The program and session objectives were attained Program Management Team Program Management Team members were courteous Program Management Team was efficient Program Management Team was responsive to the needs of guest stakeholders The venue was well lighted and ventilated The venue was comfortable with sufficient space for program activities The venue had sanitary and hygienic conditions Meals were nutntious and sufficient in quantity and quality The accommodation was comfortable with sanitary and hygienic conditions What chanaes would vou suaaest to improvement similar in the future? Section leader sport music manager more general instead any production"
    },
    {
        "image": "evalform1_synth_6_aug3.png",
        "label": "evalform",
        "ocr_text": "Republic OF SOUTH COTA. NM District 14 Garcia inc School » 2425 Sherry Gausews “West Garratt, CO 9q724 EVALUATION FORM PROGRAM TI LE: Reduced exuding forecast en 5 of the entre pro ppropnate box and you 6 mda if ui guadest tO imnravement Si What chances WAG Y Section jeader sport MUSIC manager more"
    },
    {
        "image": "evalform1_synth_6_aug4.png",
        "label": "evalform",
        "ocr_text": "Mstrict 14 Garcia ine Schoo! 2425 Sherry Causewa ay West Garrett CO 90724 EVALUATION FoRI Reduced exuding forecasi DATE: October 18, 2023 _ Agree (5 4) &S would vor Section leader sport music mana production —~SoMpany."
    },
    {
        "image": "evalform1_synth_6_aug5.png",
        "label": "evalform",
        "ocr_text": "lic of the Philippines artment of Education Repu Dep Region 8 DIVISION OF SOUTH District 11 Garcia Inc School 2425 Sher Causewa West Garrett co 90721 EVALUATION FORM DATE October 19 2023 PROGRAM TITLE Reduced exuding forecast entire program according to the Direction Please assess the effectiveness of the indicators below Please check the appropriate box 4 er to the following rating scale 4 Stronaly Agree (SA). 3 Agree( A), 2 Disagree (Dy. OTABATO nd you can ref 4 Strongly Disagree SD) Managemen reparation jelivered aS planned inning was d Program Pla The program mi was managed efficiently The progral The program was well structured bjectiv es ectives Were cleanly presented ‘Attainment of O The program obj jectives were logic ally a The session ob. ranged ectives were attained The program and session ob} ent Team nt Tearn mem eous Program Managem bers were court Program Manageme ement Team was efficient Program Man ag needs of Program Management Team was responsive to the questistakeholders Venue and Accommodation The venue was and ventilated t space for program well lighted The venue was comfortable with sufficien activities The venue jenic conditions had sanitary and hyd y and quality and sufficie nt in quantit Meals were nutntious enic The accommodation was comfortable with sanitary and hygl conditions ction provement similar in the fiture? instead any produ jaest to im er more general rt music Manag What chanae Section leader spo! company."
    },
    {
        "image": "evalform1_synth_7_aug1.png",
        "label": "evalform",
        "ocr_text": "Sus% ee Republic of the Philippines Department of Education Region 98 DIVISION OF SOUTH COTABATO District 19 Huahes Campbell School PSC 3831, Box 1110, APO AA 63599 EVALUATION FORM PROGRAM TITLE: _Inverse regional productivity DATE: November 16, 2023 __ Direction: Please assess the effectiveness of the entire program according to the indicators below Please check the appropriate box and you can refer to the following rating scale 4 Strongly Agree (SA), (Dy, 1 Strongly Disagree SD) 3 Agree( A), 2 Disagree Program Planning Management P reparation The program was delivered as planned The program was managed efficiently The program was well structured Attainment of Objectives |) The program objectives were Clearly presented The session objectives were logically arranged The program and session objectives were attained Program Management Team Program Management Team members were courteous ent Team was efficient Program Managem: Program Management Team was responsive to the needs of guest stakeholders. Venue and Accommodation The venue was well lighted an id ventilated The venue was comfortable with Sufficient space for program activities The venue had sanitary and hy gienic conditions Meals were nutritious and Sufficient in quantity and quality The accommodation was comfortable with sanitary and hygienic conditions Overall What chanaes would vou Suaaest to improvement similar in the future? Act for air"
    },
    {
        "image": "evalform1_synth_7_aug2.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippines Department of Education Region 98 DIVISION OF SOUTH COTABATO District 19 Hughes Campbell School PSC 3831, Box 1110, APO AA 63599 EVALUATION FORM PROGRAM TITLE: _Inverse regional productivity DATE: November 16, 2023 _ Direction: Please assess the effectiveness of the entire prograrn according to the indicators below Please check the appropriate box and you can refer to the following rating scale 4 Strongly Agree (SA); 3 Agree( A); 2 Disagree (D), 1 Strongly Disagree SD) Program Planning Management P reparation The program was delivered as planned .| The program was managed efficiently The program was well structured Attainment of Objectives The program objectives were clearly presented The session objectives were logically arranged The program and session objectives were attained Program Management Team Program Management Tearn members were courteous Program Management Team was efficient Program Management Team was responsive to the needs of guest stakeholders Venue and Accommodation The venue was well lighted and ventilated The venue was comfortable with sufficient space for program activities The venue had sanitary and hygienic conditions Meals were nutntious and sufficient in quantity and quality The accommodation was comfortable with sanitary and hygienic conditions Overall What chanaes would vou suaaest to improvement similar in the future?"
    },
    {
        "image": "evalform1_synth_7_aug3.png",
        "label": "evalform",
        "ocr_text": "DIVISION O District 19 Huches Campbeil School PSC_3831, Box 1116. AP PO AA 83599 EVALUATION FORM _ inverse feg Honal Droductivity $s ihe pee é check t mens sc escent mieten S Were altain ar inne Biture> tand wait wai it rate. a ovemert cirnit"
    },
    {
        "image": "evalform1_synth_7_aug4.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippines Department of Education Region 98 DIVISION OF SOUTH COTABATO District 19 Hughes Campbel! Schaal EVALUATION FORM PROGRAM TITLE: _ Inverse regional productivity DATE: November 16, 2023_ Direction’ Please assess the effectiveness indicators below Please check the appropriat rating scale 4 Strongly Agree (SA); 3 Agree( A), 2 Disagree {D): 4 Strongly Disagree SD} of the entire program according to the box and you can refer to the following Proaram Planning Managementreparation The program was delivered as planned The program was managed eficiantly The program was weilstrudured Attainment of Obie: The es program objectives were Cleary presented Program Management Team members ware Counoous Program Management Team was efficient Program Management Team was responsive to the needs of guest stakehoiders 7 oe Venue and Accommodation The venue was well lighted and ventilated The venue was comfortable with Suificient space for; program activities _ _ The venue had sanitary and hygienic conditions The accommodation was comfortable with sanitary and hygienic conditions vou Suadest to improvement similar inthe future? or air stand wait wait rate. enter nee ered"
    },
    {
        "image": "evalform1_synth_7_aug5.png",
        "label": "evalform",
        "ocr_text": "biatch 4 ott se8 Ca senpbel School PSC 3831, Box 1110 APO AA 63599 moaaes EVALUATION FORM TIT inverse regional produativily eee eee eS reine nrc PROGRAM 7 8 3 fer bo the folowing indie rating ie 1 NG SST WAS WW: eneeecenn nner si aniaaest 10 F ranrovernart La Vinal . WHOL) VO Art for air. stand. wait wait. rate."
    },
    {
        "image": "evalform1_synth_8_aug1.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippines Department of Education Region 60 DIVISION OF SOUTH COTABATO Finish District Blankenship Davis School 6091 Baker Isle, New Christinamouth, SC 12812 EVALUATION FORM PROGRAM TITLE _Digitized 6thgeneration support DATE May 26 2023 Direction’ Please assess the effectiveness of the entire program according to the indicators below Please check the appropriate box and you can refer to the following rating scale 4 Strongly Agree (SA), 3 Agree( A), 2 Disagree (D), 1 Strongly Disagree SD) 4 SA. Program Planning Management P reparation The program was delivered as planned The program was managed efficiently e The program was well structured Attainment of Objectives The program objectives were clearly presented The session objectives were logically arranged The program and session objectives were attained Program Management Team Program Management Team members were courteous Program Management Team was efficient Program Management Team was responsive to the needs of quest stakeholders. Venue and Accommodation The venue was well lighted and ventilated The venue was comfortable with sufficient space for program activities The venue had sanitary and hygienic conditions Meals were nutntious and sufficient in quantity and quality The accommodation was comfortable with sanitary and hygienic conditions Overall What chanaes would vou suadest to imorovement similar in the future? Experience bit case contain if poor green lead commercial."
    },
    {
        "image": "evalform1_synth_8_aug2.png",
        "label": "evalform",
        "ocr_text": "ois rf 4 Republic of the Philippines Department of Education Region 60 DIVISION OF SOUTH Finish District is School Blankenship Dav! 6091 Ba r Isle New Christinamouth sc 1281 EVALUATION FORM DATE: May 26, 2023 ___ PROGRAM TITLE Digitized 6thgeneration support entire program according to the Direction: Please assess the effectiveness of the indicators below Please check the appropriate box and you can refer to the following rating scale: 4 Strongly Agree (SA). 3 Agree( A). COTABATO (SD) 4 Strongly Disagree 9 Disagree (DB). naivanagementiP reparation ‘as delivered as planned Program Plann The program W: ‘| The program was managed efficiently The program was well structured Attainment of Objectives The program objectives were clearly presented n objectives were logical ly arranged The sessio! n objectives were attained The program and sessio Program Management Team ement Team Tempers were courteous Program Manag was efficient sive to the needs of Program Management Team Program Management Team was respon questistakeholders Venue and Accommodation The venue was well lignted and vel rable with sufficient spac ntilated e for program The venue was comfo activities The venue ha 'd sanitary and hygienic conditions and quality is and sufficient in quantity Meals were nutritiou enic able with sanitary and hygi The accommodation was comfort conditions ihe future? green lead com t to imorovernent similar e contain if poor What chanaes Would vou suades Experience bit cas:"
    },
    {
        "image": "evalform1_synth_8_aug3.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippines Department of Education Region 60 ION OF SOUTH COTABATO Finish District Blankenship Davis School 6091 Baker Isle New Christinamouth SC 12812 EVALUATION FORM PROGRAM TITLE Digitized 6thgeneration support e assess the effectiveness of the entire progra heck the appropriate box and you can re DIVIS DATE May 26, 2023___ Direction. Pleas m according to the fer to the following indicators below Please cl rating scale 4 Strongly Agr (SD) ee (SA). 3 agreel >). 2 Disagree (D). 4 Strongly Disagree Managem ent P reparation jelivered as planned Program Planning! The program was d The program was managed efficiently The program was well structured Attainment of Objectives The program objectives were cleanly presented The session objectives were logically arranged Ssion objectives were attained The program and se gement Team ent Tearn me! Program Manas e0us Program Managem mbers were court ent Tearn was efficient Program Managem the needs of Program Management Team was responsive to questistakeholders Venue and Accommodation The venue was well lighted and ventilated am A sufficient space for progr The venue was comfortable wit activities The venue had sanitary and hygienic con ditions Meals were nutntious and sufficient 1n quantity and quality sanitary and hygienic The accommodation was comfortable with conditions Overall \\what chanaes woul Experience bit case conta ture? n lead commercial. provement simular in the fil in if poor gree d vou euadest to im"
    },
    {
        "image": "evalform1_synth_8_aug4.png",
        "label": "evalform",
        "ocr_text": "Blankenship Davis School 6091 Baker Isic, New Christinamouth, SC 12812 EVALUATION FORM _ Digitized 6thgeneration support May 26, 2023_ +-Strongly D: world te tr Experience bit case contain if poor green lead commercial."
    },
    {
        "image": "evalform1_synth_8_aug5.png",
        "label": "evalform",
        "ocr_text": "5 OK “hil i Departn ort R pines EVALUATION ForM Sigiized Sihgeneration Support DATE lectiveness of the entire pre appropriate box and you CgTaimMn ac ef AY 2 Disg S ro ToS ard yarn ialed"
    },
    {
        "image": "evalform1_synth_9_aug1.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippines Department of Education Region 27 DIVISION OF SOUTH COTABATO District 23 Bridges Russell and Nelson School 3161 Jane Estates Washingtonmouth {e) EVALUATION FORM K 90832 DATE: February 21. 2024 _ rogram according to the an refer to the following ult tolerant software ness of the entire pl and you PROGRAM TITLE Diverse fal sess the effective se check the appropriate box gree (D), 4 Strongly Disagree Direction. Please a5 indicators below Plea' rating scale 4 Strongly Agree (SD) (SA). 3 Agree( A), 2 Disa Program Panning Management reparation The program was delivered as planned e m was managed efficiently e The progral The program was well structured Attainment of Objectives The program objectives were cleanly presented jectives were logically arranged The session ob ives were attained The program and session objecti Program Management Team Program Management Team members were courteous ment Team was efficient esponsive to the needs of Program Manage Program Management Team was r questistakeholders Accommodation Wighted and ventilated The venue was comfortable with sufficient space for program activities The venu e had sanitary and hygienic conditions Meals were nutritious and sufficient in quantity and quality lon Was comfortable with sanita The accommodati ry and hygienic conditions Overall What chanaes would vou sua Value cultural doctor m report never. imilar in the future? rt door look cause environmental jaest to imorovernent SI aterial century than repo!"
    },
    {
        "image": "evalform1_synth_9_aug2.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippines Department of Education Region 27 DIVISION OF SOUTH COTABATO District 23 Bridges Russell and Nelson School 8161 Jane Estates Washingtonmouth OK 90832 EVALUATION FORM PROGRAM TITLE Diverse fault tolerant software s the effectiveness of the entire pI propriate box and you can refer to 1 fas B 5 DATE: February 21, 2024 _ rogram according to the Direction: Please asses: the following indicators below Please check the ap! rating scale: y; 3 Agree( Aj, 2 Disagree 4 Strongly Agree {SA (D). 4 Strongly Disagree SD) Program Pranning Management P reparation The program was delivered as planned The program was managed efficiently The program was well structured ctives Attainment of Obje: fives were Clearly presented The program objec’ es were logically arranged The session objectiv The program and session objectives were attained Program Management Team Program Management Team Tmembers were courteous ‘am Management Team was efficient Progr: Program Management Team was responsive to the needs of quest stakeholders dation hted and ventilated The venue was comfortable with Sufficient space for program activities The venue had sanitary and hygienic conditions Meals were nutntious and sufficient in quantity and quality The accommodation was comfortable with sanitary and hygienic conditions E milar in the future? What chanaes would vou Suaaest to improvement si Value cultural doctor material century than report door look cause environmental _ report never."
    },
    {
        "image": "evalform1_synth_9_aug3.png",
        "label": "evalform",
        "ocr_text": "District 23 Bridges Russell and Nelson Schoo! 8161 Jane Estates. Washin lonmouth, OK 90832 “mnemonic IED, OK GOB 8 a uceeeeeae EVALUATION FORM :. Diverse fauittolerant softy below Pie BS ne ei hghted eS would vol Sugdest fe imipray fue cuflural doctor mate: fepor never sivular in the future? ial century than report door jock cause environmental _"
    },
    {
        "image": "evalform1_synth_9_aug4.png",
        "label": "evalform",
        "ocr_text": "‘eo <4 Republic of the Philippines Department of Education Region 27 DIVISION OF SOUTH COTABATO District 23 Bridges Russell and Nelson School 8161 Jane Estates, Washingtonmouth, OK 90832 EVALUATION FORM PROGRAM TITLE: _Diverse fault tolerant software DATE: February 21, 2024 _ Direction: Please assess the effectiveness of the entire program according to the indicators below Please check the appropriate box and you can refer to the following rating scale 4 Strongly Agree (SA); 3 Agree( A), 2 Disagree (D), 1 Strongly Disagree SD) eee Program Planning Management P reparation 1| The program was delivered as planned [Rate PiraRes 2.| The program was managed efficiently 1B _| Attainment of Objectives 4] The program objectives were clearly presented The program was well structured The session objectives were logically arranged Lg The program and session objectives were attained Program Management Team 5 Program Management Team members were courteous Program Management Team was efficient Program Management Team was responsive to the needs of quest stakeholders The venue was well lighted and ventilated The venue was comfortable with sufficient space for program activities The venue had sanitary and hygienic conditions Meals were nutntious and sufficient in quantity and quality The accommodation was comfortable with sanitary and hygienic conditions ‘What chanaes would vou suaaest to imorovement similar in the future? Value cultural doctor material century than report door look cause environmental report never."
    },
    {
        "image": "evalform1_synth_9_aug5.png",
        "label": "evalform",
        "ocr_text": "Republic of the Philippines Department of Education Region 27 DIVISION OF SOUTH COTABATO. District 23 Bridges Russell and Nelson School 8161 Jane Estates Washingtonmouth, OK 90832 EVALUATION FORM PROGRAM TITLE: _ Diverse fault tolerant software DATE: February 21 2024 —attterantsoftware ry Direction: Please assess the effectiveness of lease check the @ppropriate b indicators below Ph rating scale 4 Strongly Agree the entire program according to the 0X and you can refer to the following SA); 3 Agree( A): 2 Disagree (D); 1 Strongly Disagree SD) Planning Managemel nt P reparation The program Was delivered 4 iS planned Attainment of Obj ectives The program objectives were Clearly presented Program Managem guest stakeholders Venue and A comfortable with sufficient space for program activities The venue had Sanitary and hygienic conditions Meals were nutritious and sufficient in quantit and quality The accom modation was comfortable with Sanitary and hygieni 4. conditions wenic Oo"
    },
    {
        "image": "evalform2_synth_11_aug1.png",
        "label": "evalform",
        "ocr_text": "Gaby quess reduce toward Star impact rise my drive phat. Not back sh w acull ig. Animal herse especially simp le goal. 12 schoal office. your 108s. semne Schon! _tamnas Sims Se"
    },
    {
        "image": "evalform2_synth_11_aug2.png",
        "label": "evalform",
        "ocr_text": "Baby guess reduce toward Star impact rise my drive t. Not back sh dult that Animatherselt acu especially simple goal. PLEASE NOTE: student will be lect an option or return this form to the school office, your Student s Name_Grant Brooks School D _ 5 119804 Grade 4 School _Bames Group Schoo! [bo want my child to participate in a KIND oral health ening [E 100 Nor want my cil to participate in a KIND oral Signed Patricia Davis Relat ip to Student_Pacea Date, January 23, 2024"
    },
    {
        "image": "evalform2_synth_11_aug3.png",
        "label": "evalform",
        "ocr_text": "Baby quess reduce toward Star impact rise my drive iat. Not back show adult Anima nerself especially si simple goal. eae Scie) Bes"
    },
    {
        "image": "evalform2_synth_11_aug4.png",
        "label": "evalform",
        "ocr_text": "Baby guess reduce toward Star impact rise my drive that. Not back SH adult oig. Animal herself especially simple goal."
    },
    {
        "image": "evalform2_synth_11_aug5.png",
        "label": "evalform",
        "ocr_text": "Baby guess reduce toward Star ee ea) rive that. back wW adui big. ‘Animal herself cate) simple goal."
    },
    {
        "image": "evalform2_synth_12_aug1.png",
        "label": "evalform",
        "ocr_text": "Air mission picture Smile traditional speech church huge guess can. Major no class behind difficull woman iH"
    },
    {
        "image": "evalform2_synth_12_aug2.png",
        "label": "evalform",
        "ocr_text": "Air rrission picture Ssmie traditional speech church huge guess can. Major no class behind difficult woman."
    },
    {
        "image": "evalform2_synth_12_aug3.png",
        "label": "evalform",
        "ocr_text": "Air mission picture Smile traditional speech church huge guess can. Major no class behind cifficull woman."
    },
    {
        "image": "evalform2_synth_12_aug4.png",
        "label": "evalform",
        "ocr_text": "Air mission picture Smile traditional speech church huge guess can. Major no class behind difficult woman. PLEASE NOTE: If you do not select an option or return this form to the school office, your student will be screened Student s Name_Jeremy Golden School 108 5 420283 Grade 4 Schoo! _sohason ine Schaat (111 00 want my child to participate in a KIND oral health screening. ]L00 NOT want my child to participate in a KIND oral health screening Signed_Leslie Pierce Relationship to Student_Paseat Date, September 26, 2023"
    },
    {
        "image": "evalform2_synth_12_aug5.png",
        "label": "evalform",
        "ocr_text": "Alp ichure Smile traditional speech Major no class behind dificult woman. np"
    },
    {
        "image": "evalform2_synth_13_aug1.png",
        "label": "evalform",
        "ocr_text": "on then why listen jeadar Prove strategy possible blood apply second part. Including seam energy hair. Aimost trial rich central tote gi true ancy Gil wor lear gas ch aracter thousan Teal ort 4 an option erretuca this forin to theschast office, your"
    },
    {
        "image": "evalform2_synth_13_aug2.png",
        "label": "evalform",
        "ocr_text": "Life soon than why listen leader Prove strate: egy Sri itie blood apply sais poe Including seem energy hair. Almost trial ric Renfral total true know. Oil world €ad gas character thousan total. PLEASE NOTE: I you do not select an oj Ption or return this form to the school office, your student will be screened. Student s Name_Melanie Humphrey School ID#. s sso418 Grade 2 Schoo! _temande2 ina Schoa C00 want my cid to participate ia KIND oa heath screening. [AL00 Nor wane my cid to paricpateina KIND oral heath screening ‘Signed_Benjamin Yang —_- Relationship to Student_parent Date. June 18, 2023"
    },
    {
        "image": "evalform2_synth_13_aug3.png",
        "label": "evalform",
        "ocr_text": "Soon than why sien ieade Prove strategy possibile blood apply second part. Including seem energy hair. Almost tial rich central total true know. O! worid isad gas character thousand total."
    },
    {
        "image": "evalform2_synth_13_aug4.png",
        "label": "evalform",
        "ocr_text": "Life seon than by 22 Prove strategy possible biood apply second part. Including seem energy hair. Aimost triai ric oh central total true Asus oil world lead gas character t ousand total,"
    },
    {
        "image": "evalform2_synth_13_aug5.png",
        "label": "evalform",
        "ocr_text": "Life soon than why listen leader Prove strategy possible blood apply second part. Including seem energy hair. Almost trial ric! pentral total true know. Oil world ead gas character thousand iotal. PLEASE NOTE: If you do not seisct an option oF return this form te the schoo! office, your ‘sundent willbe screunes. 100 want 2 itd to puncte na HIND oral Peat: ceeoing [1 00 Nor ware my chido sartitpateioa HNO crathnath scrnaning sgevo, Benjamin Yang. Rebilonship to Student exes Date sane tm anc"
    },
    {
        "image": "evalform2_synth_14_aug1.png",
        "label": "evalform",
        "ocr_text": "7 staff none Mean Gar Our technology many sister fund phone state. He lar response full president serious. OH agency Focus what age purpose enstgy. Dae, Auge D8, 982"
    },
    {
        "image": "evalform2_synth_14_aug2.png",
        "label": "evalform",
        "ocr_text": "Magen staif none mean cwn Our technology many sister fund phone state. ne far response full president serious. Oil agency us what age purpose energy. PLEASE NOTE: it you do not select an option creature thk foam to the sehen aifce, yout studoot whi be screened Suasers Nowe Mathew 62 SchoaIOF, 9 216 5% Grose 12 Shoe! saat H8 {ne ware ny cate paste aN ral tanh ree 7i0 Mor want my so pcan FIND aatnea sien Sigeee_Shaton Reese etticesnig 0 Staleot_ une ean rugque 28, 202"
    },
    {
        "image": "evalform2_synth_14_aug3.png",
        "label": "evalform",
        "ocr_text": "Mgeem Staff none mean own Our ie nclogy Many sister fund Phone state. He far response full resident serious. Oil agenc ocus what age purpose energy. PLEASE NOTE: I you do not select Otlon or return this form tothe school office, your student will be screened Student s Name Matthew Lee School ID#. 5 >s 68 Grade 42 School _Gradiey PLC School ee 1100 ware my histo paricpate ma KIND ora heather ing DhtD0Ner wane my chido paicpateina HIND oa nean screening Sned_Sharon Reese Relationship to Student_cuartan Date, August 20, 2023"
    },
    {
        "image": "evalform2_synth_14_aug4.png",
        "label": "evalform",
        "ocr_text": "figgem staff none mean own that Our rechnology many sister fund phone state. He far response full president serious. Oil agency ocus what age purpose ener iv ware"
    },
    {
        "image": "evalform2_synth_14_aug5.png",
        "label": "evalform",
        "ocr_text": "Moser staff none mean owrt Our technology many sister fund phone state, re far response full yrasident serious. Ol agericy ocus what age purpose energy. pense NOTE: errotwa thu bin to the acho! office, your studen bait be se"
    },
    {
        "image": "evalform2_synth_15_aug1.png",
        "label": "evalform",
        "ocr_text": "Politics tree practice wind leader Behind address develop size righ. Choice better how inal. Dinner water price fact choice against note. PLEASE NOTE: If you do not select an option or return this form to the school office, your student will be screened Student s Name Brian Mills School IO s azes7e Grade 12 School _Padae vemes $2n00! (111 00 want my child to participate in a KIND oral health screening. ]1L00 NOT want my child to participate in a KIND oral health screening Signed_Brandon Wilson Relationship to Student_uasian Date, tarch 27, 2024"
    },
    {
        "image": "evalform2_synth_15_aug2.png",
        "label": "evalform",
        "ocr_text": "Politics tree practice wind leader Behind address develop size rch. Choice better how inal. Dinner water price fact choice against note. PLEASE NOTE: If you do not select an option orreturn this form to the school office, your student wll be screened. Student s Name_Brian Mills School 1 s 620576 Grade 12 Schoo! _Padita vargas Schoo! [1100 want my child to participate ina KIND oral health screening )100 Nor want my cid to participate ina KIND oat health screening Signed_Brandon Wilson Relationship to Student_Guantian Date, March 27, 2024"
    },
    {
        "image": "evalform2_synth_15_aug3.png",
        "label": "evalform",
        "ocr_text": "Politics tree practice wind leader Behind address develop size righ. Choice better how inal. Dinner water price fact choice against note. PLEASE NOTE: If you do not select an option or return this form to the school office, your student willbe screened. Student s Name Brian Mills _Sehool ID __s a29576 Grade. 12 School _Padiae vas 201 [1100 want my cil to participate ina KIND oral health screening, [21100 Nor want my chit prticpate ina KIND oratheath screening Signed_Brandon Wilson _ _ _ —— Relationship to Student_uanian Date, March 27, 2024"
    },
    {
        "image": "evalform2_synth_15_aug4.png",
        "label": "evalform",
        "ocr_text": "Politics tree practice wind leader Behind address develop size rch. Choice better how inal. Dinner water price fact choice against note. PLEASE NOTE: If you do not select an o} student will be scree Student s Name Brian Mills SchoollD#. sa20576 Grade. 12 School _Padiis v T1100 want my child to parti B tw0 Nor want my chi to Sened_Brandon Wilson Relationship to Student_uardian _ _Date. March 27 2024"
    },
    {
        "image": "evalform2_synth_15_aug5.png",
        "label": "evalform",
        "ocr_text": "Poiitics tee practice win Behind address develop ize Fgh. Choice better how inal. Dinner water price fact choice against note. LEAR MOTE: 1 at seiect re opti b torn ti the seh"
    },
    {
        "image": "evalform2_synth_16_aug1.png",
        "label": "evalform",
        "ocr_text": "Minute sometimes economic issue Detail six partner head. Approach alone part ceil policy control like very. May sure foot bill everybody. PLIASE NOTE: you do not select si option or retum the form to the schon! office, your stage wll be screened Srudent s tame (of Acgeado Geate 5 100 wave my eid to pacts no Dhiwoser sme Brenda Rogers aebnen sin te"
    },
    {
        "image": "evalform2_synth_16_aug2.png",
        "label": "evalform",
        "ocr_text": "PONGITIG Detail six partner head. Approach alone part cell policy control like very. May ure foot bill everybody. ie notewines an option ox rat"
    },
    {
        "image": "evalform2_synth_16_aug3.png",
        "label": "evalform",
        "ocr_text": "Minute sometimes economic issue Detail six partner head. Approach alone part cell policy control like very. May sure foot bill everybody. PUIASE ROTE: if you do mat select sn option or retuin this form to the school office, your stadent wil be sereened. Gas» E 1 00 wae my cae to particoate a IND ora (D1D0. NOP wane ny dite to partic ‘ened, Srenas Rogers Rebtionsheto Studert amet Date aang 14, 2029"
    },
    {
        "image": "evalform2_synth_16_aug4.png",
        "label": "evalform",
        "ocr_text": "Minute sometimes economic Issue Detail six partner head. Approach alone part cell policy control like very. May sure foot bill everybody. PLEASE NOTE: If you do not select an option or return this form to the school office, your student will be screened. Student s Name_Lori Acevedo SchoollO®. 5 307488 100 want my [D0 wor want my child to pa sened_Brenda Rogers Relationship to Student_pazent Date. June 14, 2023,"
    },
    {
        "image": "evalform2_synth_16_aug5.png",
        "label": "evalform",
        "ocr_text": "Minute sometimes economic Detail six partner head. Approach alone part cell policy control like very. May sure foot bill everybody. PASE NOTE: Ifyou do not select an option or return this form to the school office, your student will be screened Student s Name_Lori Acevedo School 18s sora Grade 3 Schoo! _Seencer Hal and Tunes Senet 21100 ware my cid to participate ma KIND oral heath screening CLG nT wae my cto prticpatein 2 tO crt heath screening Sined_Brenda Rogers Reltionshe to Student_parent Date, June 14, 2023"
    },
    {
        "image": "evalform2_synth_17_aug1.png",
        "label": "evalform",
        "ocr_text": "Still nothing leader wait life Add main interest point where. Probably fight attorney wide type mention. PLEASE NOTE: If you do not select an option or return this form to the school office, your student will be screened Student s Name_Phillip Spencer SchoolID _s 740308 Grade, 6 School _Hensiey Ltd Schoo! [1100 want my cilé to participate na KIND oral heath screening [e 100 Not want my chile to participate in a KIND oral health screening signed_Victor Graham Relationship to Student_ Guardian Date, Apri 11, 2025"
    },
    {
        "image": "evalform2_synth_17_aug2.png",
        "label": "evalform",
        "ocr_text": "Still nothing leader wait life Add main interest point where. Probably fight attorney wide type mention. PLEASE NOTE: If you do not select an option or return this form to the school office, your student willbe screened Grade 6 School _Hensiey Ltd Schoo! (111 00 want my child to participate in a KIND oral health screening. [100 NOT want my child to participate in a KIND oral health screening Signed_Victor Graham Relationship to Student_uasiian Date, Apa 11, 2025"
    },
    {
        "image": "evalform2_synth_17_aug3.png",
        "label": "evalform",
        "ocr_text": "ader wail life Add main 1 interest point where. Probably fight attorney wide type mention"
    },
    {
        "image": "evalform2_synth_17_aug4.png",
        "label": "evalform",
        "ocr_text": "SHI nothing ieadey wait le Add main interest point where, Probably fight attorney wide type mention, th"
    },
    {
        "image": "evalform2_synth_17_aug5.png",
        "label": "evalform",
        "ocr_text": "eater wait He StH net Add main interest point where. Probably fignt atiomey wide type mention"
    },
    {
        "image": "evalform2_synth_18_aug1.png",
        "label": "evalform",
        "ocr_text": "Talk company since Wish billion particularly member whom ue fee tg SET Wienigt out ie} strong thir task star east. PLEASE NOTE: If you do not select an option or return this form to the school office, your student will be screened Student s Name Michael Holland Jr, _SchoolID __s ogaaze Grade, 5 School _Riey LLC Schoo! [100 want my chilé to participate na KIND ora heath screening L 00 Nor want my chile to participate in a KIND oral health screening signed_Benjamin Richardson Relationship to Student_ Guardian Date, August 11, 2024"
    },
    {
        "image": "evalform2_synth_18_aug2.png",
        "label": "evalform",
        "ocr_text": "Talk company since Wish billion particularly member whorn cause, Fear television vavel ouisice. heck Strong inird task star east. PLEASE NOE: Ifyou do pet select ar option or ana this form 20 vou ens office, your sexeened"
    },
    {
        "image": "evalform2_synth_18_aug3.png",
        "label": "evalform",
        "ocr_text": "Talk company since Wish billion particularly member whom cause, Fear evision travel outside. heck strong third task star east. PLEASE NOTE: If you do not select an option or return this form to the school office, your student willbe screened. Student s Name_Michae! Holland Jr School ID®. 5 090320 Grade 5 Schoo! _RieyiwcSeroot [71100 want my child to participate a KIND oral health reening, T 20norwant my child toparicpate ina KIND oratheath screening Stened_Benjamin Richardson Relationship to Student_uastan _ Date, August 11, 2024"
    },
    {
        "image": "evalform2_synth_18_aug4.png",
        "label": "evalform",
        "ocr_text": "Talk company since Wish billion particularly member whom cause, Fear igievision travel! outst e. Check strong third task star east. PLEASE NOE: you student yell be 6"
    },
    {
        "image": "evalform2_synth_18_aug5.png",
        "label": "evalform",
        "ocr_text": "Talk company since Wish billion particularly member whom “ues oes tg SEH Hetil out lo} strong thir task star east. PLEASE NOTE: If you do not select an option or return this form to the school office, your student will be screened Student s Name_Michael Holland Jr, _SchoolID _s caaaze Grade, 5 School _Riey LLC School [e 100 want my chilé to participate na KIND ora health screening [00 Nor want my chile to participate na KIND oral health screening signed_Benjamin Richardson Relationship to Student_Guarian Date, August 11, 2024"
    },
    {
        "image": "evalform2_synth_19_aug1.png",
        "label": "evalform",
        "ocr_text": "Develop both choice Oppartunity around Suggest stage bring fried political g vironment allow, W quish dire ector Step wrong while alrea ove south deal point a ge kind. Leave siudent relationship appear, FRASE NOTE: you do oot satect an option return thts lomm tothe cheat fice, your CAS wl be sere C0 Shadent s tame Cryst Crue Gea 1120 wary ce portion 2 HIND oat beh Kx seoing C3100 wat won my chiid to participate in 2 TEND Orel neath scmenig Serod_Kunderty Wood ReeNonitio ta Studer? Seuss te aay 08. soa"
    },
    {
        "image": "evalform2_synth_19_aug2.png",
        "label": "evalform",
        "ocr_text": "Suggest stage bring third political environment ollow. Wish Girector Slep wrong while slreac y. Above South deal point age kind. Leave student relationship appear, mm the sehayet"
    },
    {
        "image": "evalform2_synth_19_aug3.png",
        "label": "evalform",
        "ocr_text": "Develop both choice opportunity around Suggest Stage bring third political gpvironmen ‘O low Wish qifector step wrong while already. Above south deal point age kind. Leave student relationship appear. PLEASE NOTE: Ifyou do not select an option or return this form tothe schoo! office, your student will be screened, Student s Name_Crystal Cruz School ID, s s17369 Grade, 15 Schoo! _TenetAmaliand FemandexSchoat }100 want my child to participate ina KIND oral heath screening T i00 nor ware my tld to paicpate na KND oral heath screening Signed_Kimberly Wood _ Relationship to Student_counsel Date, Juty09, 2023"
    },
    {
        "image": "evalform2_synth_19_aug4.png",
        "label": "evalform",
        "ocr_text": "Deveign both choice opporunly Suggest stage bring third political environment follow Wish director step wrong while already. Above south deal point age kind. Leave student relationship appear. ALUASE NOTE: Ifyou donot select an option return HN form to the schoo! office, Your student will be screened student s Name_COystal C2 School IO _ 5 17380 Schoo! Tames Ameid aod Famandaz Scbast Grade 11 [51100 wore my cdo parton ma INO era Hea ree [io mor want ny dt paricoatein a HO thea seen Signes_Kimberty Wood Relationship to Student_Caunseit Date, ay 09, 2023"
    },
    {
        "image": "evalform2_synth_19_aug5.png",
        "label": "evalform",
        "ocr_text": "Develop both choice opportunity around Suggest stage bring third political environmen Gllow, Wish director step wrong while already. Above south deal point age kind. Leave student relationship appear. PLEASE NOTE: If you do not select an option or return this form to the school office, your student will be screened. Student s Name_Crystal Cruz School ID _ 5 517390 Grade, 11 School Tenet Amold and Femande2 School [2100 want my child to participate in a KIND oral health screening [L0 Nor want my child to participate in a KIND oral health screening Signeg_Kimberly Wood Relationship to Student_counsalo Date, July 09, 2023"
    },
    {
        "image": "evalform2_synth_20_aug1.png",
        "label": "evalform",
        "ocr_text": "Herself wait ight Main whether often gnoiner Hould audience, che ce. nter manage ahead ort. Money politics product low resource. LIAS"
    },
    {
        "image": "evalform2_synth_20_aug2.png",
        "label": "evalform",
        "ocr_text": "Herself wait light ain whether often another uld audience chance. nter manage ahead effort. Money politics product low resource. PLEASE NOTE: If you do not select an option or return this form to the schoo! office, your student will be screened Student s Name Brandon Lowery School 104 5 190586 Grade 2 Schoo! _somsan Seat Schaal 1100 wort my child to participate in KIND oral health sreening 21100. NOT want my child to participate in a KIND oral health screenng Siened_Antonio Hardy Rebtionshe to Student_quantan Date, June 05, 2024"
    },
    {
        "image": "evalform2_synth_20_aug3.png",
        "label": "evalform",
        "ocr_text": "ait tight Main whether often another enould audi rence cr ie IS CE Bnter manage ane ort. Money politics product low resource."
    },
    {
        "image": "evalform2_synth_20_aug4.png",
        "label": "evalform",
        "ocr_text": "Herself wail fight Mal n nner often another d audience chap ee: pngut manage ahea rt. Money pol litics product low pack vice, Woot"
    },
    {
        "image": "evalform2_synth_20_aug5.png",
        "label": "evalform",
        "ocr_text": "Money politics produ resource. PLEASE NOTE: If you dono} student will be screened school D _5 190554 student s Name, “prandon Lowey schoo| tain Se Seba Grade 2 ‘D0 want my hilé to participate Wn KIND oral health screening. Cio [apo mor wont my clo partcoaeln® Jan oratheath screening a enna pate, June 08 2028 Relationship to Student_Guasan."
    }
]