[
    {
        "image": "expandtraining1_synth_10_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Spend generation difficult set outside Date: April 15, 2024 Submitted by: Jennifer Pierce Horticultural therapist"
    },
    {
        "image": "expandtraining1_synth_10_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Spend generation diffi Department of Region SCHOOLS DIVISION oj DISTRICT Date: Maintain not threat star into. Hope Protect common argue. Air boy himself among. Poli win al Message card. decade. Econo urface. Store hope eat my story west u Ice answer brin, bove know every s of the Philippines ducation 10 F Pampanaa OF Angeles Ci cult set outside April 15, 2024 19 Create. Huge clearly Same Mrs writer indicate black same Population some pon usually. military College Submitted by: Jennifer Pierce Horticultural therapist"
    },
    {
        "image": "expandtraining1_synth_10_aug3.png",
        "label": "expandtraining",
        "ocr_text": "1 Phulippanes Department of Education Region 10 SCHOOLS DIVISION OF Pamoanaa DISTRICT OF Angeles City Spend generation difficult set outside bate April 15, 2024 Maintain not threat star into. Hope protect common argue. Air boy himself among. Police answer bring create. Huge clearly win above know every surface. Same Mrs writer indicate message card. Store hope eat black same population some decade. Economy story west upon usually. military college military window moment child. Success present ago production wide one. Whose start stop wait. Radio he show scene information. Performance per together and back huge. Submitted by Jennifer Pierce Horticultural therapist"
    },
    {
        "image": "expandtraining1_synth_10_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Rap Depart Spend generation difficult set outside pa Apri 15, 2024 ornmort argue. Air into. Hope protect te. Huge clearly Maintain not threat star i boy himself among. Police answer bring cre win above know every surface. Same Mrs indicate 2 card, Store hope eal black same population some decade. Economy story west upon usually. mitary cobege ry window moment child. Success presert ago production wide one. Wh start stop watt. Radio scene informauon. Performance per together and back OW huge Hericultural"
    },
    {
        "image": "expandtraining1_synth_10_aug5.png",
        "label": "expandtraining",
        "ocr_text": "we Spend generation difficult set outside ae Aor 15, 2024 Maint not threat staz into. Hone protect OmM Palice answer bring crea’ y Surface. Sar decade military w: Y lotion wide one. cene information. Pert i Radic he show et together back huge,"
    },
    {
        "image": "expandtraining1_synth_1_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Departacat ot Educatton: Rewoa amboanca Add tend reality Nation describe iis. Begin step thecause View building ime public Glass leader performance better difficult. along push. Different dea remem politics carding assume instead. Ly management newspaper maybe. Tax player wht consumer marriage. Production must speak of hair girl price by help. Third event hign dire reason service hour close paper Project second summer oid break carty. Firstiess yara scientist. Room try former thus Clear consider possible finish difference. Themselves resc race, Ce"
    },
    {
        "image": "expandtraining1_synth_1_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Departiuent of SCHOOLS DIVISION OF DISTRICT OF Add tend reality Dara Glass leader performance better difficult. Nation describe along push, Different idea remernber various. Begin step politics according assume instead. Most because view management newspaper maybe. Tax player while building consumer marriage. Production must speak of. Crime public hair girt price by help. Third event high director. Wilh boy reason service hour close paper. Project second summer cid break party. First less yard scientist. Room try former thus. Clear consider possible finish difference. Themselves resource rock several move race. ted by inda Wiis nioton 6e5iq"
    },
    {
        "image": "expandtraining1_synth_1_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Add tend reality Date: Septamber (4, 20 Glass leader performance Detter dificult. Nation describe along push. Different ides remember various. Begin step politics according assume instead. Most because view Management newspaper maybe. Tax player while build consumer mariage. Production must Speak of. Crime publi hair Gif price by help. Third avent high director, With boy EAS close paper, Project sacond surmner old break party. First less yared se t. Room try former thus Clear consider possible finish difference, Themselves resource rock Sevaral move race, signer"
    },
    {
        "image": "expandtraining1_synth_1_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education Regioa 5 SCHOOLS DIVISION OF Zamboanaa DISTRICT OF Dipolog Add tend reality Date: September 04, 2025 mance better difficult. Nation describe remember various. Begin step instead. Most because view be. Tax player while building Glass leader perfo along push. Different idea politics according assume management newspaper may! consumer marriage. Production must speak of. Crime public hair girl price by help. Third event high director. With boy reason service hour close paper. Project second summer old break party. First less yard scientist. Room try former thus. Clear consider possible finish difference. Themselves resource rock several move race. ‘Submitted by: Linda Willis Exhibition designer"
    },
    {
        "image": "expandtraining1_synth_1_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Bongaiie of toe Pa acation Department of Bee: Glass leader performance better difficult, Nation describe: alang ant idea remember various. Be 4] assume instead. Most because vi hewspeper maybe. Tax player while building Production must speak of. Crime public 5. Third evant high directer, With boy reason service hour close paper. Project second summer cid break party. {less yard scientist. Room try former thus. ay consider possible finish difference. Themselves resource rock several move race. hair git price by nel ‘Subualtted ty: ca WRK ibiion designer"
    },
    {
        "image": "expandtraining1_synth_2_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Palippines Department of Education Region 10 SCHOOLS DIVISION OF Nueva Eciia DISTRICT OF Palayan City Choose to soon relate important mention Date: January 24, 2024 Artist room stop commercial world experience. You step teach sea very experience. Sign two dog certain. Through talk blood wear beautiful. Chance health town area new ten cause. Moment head sure bad despite tonight. Woman Congress nature. Game case above baby anything. Time when local even. Team necessary low including meeting painting anything face. Per television sign view moment style those painting. Tough wall we cover this generation want. Matter food both population. Submitted by: Joseph Anderson Patent examiner"
    },
    {
        "image": "expandtraining1_synth_2_aug2.png",
        "label": "expandtraining",
        "ocr_text": "dacation an Sity Choose to soon relate important menticn Darn January 2: 2 commercial word experiense. You slap teach a two dog certain. Through talk blood 1ealth lown area new ten cause an Congress Time when local Avisi roc si sea very exparience. wear beautiful, Chance f Moment head sure bad despite tanignt. W: nature. Game case above baby anything. even. Team necessary low inckuding meeting painting anything face. Per television sign view moment style se painting. Tough wall we cover this generation want. Matter food both population. Saban ay Josept Ariens: Patent exer"
    },
    {
        "image": "expandtraining1_synth_2_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Republic of Department of Education Plulippanes SCHOOLS DIVISION OF Nueva Eciia DISTRICT OF Palayan City Choose to soon relate important mention Date: January 24, 2024 Artist room stop commercial world experience. You step teach sea very experience. Sign two dog certain. Through talk blood wear beautiful. Chance health town area new ten cause. Moment head sure bad despite tonight. Woman Congress nature. Game case above baby anything. Time when local even. Team necessary low including meeting painting anything face. Per television sign view moment style those painting. Tough wall we cover this generation want. Matter food both population. Submitted by Joseph Anderson Patent examiner"
    },
    {
        "image": "expandtraining1_synth_2_aug4.png",
        "label": "expandtraining",
        "ocr_text": "BO N Republic of the Philippines Department of Education ScitooLs pIvIsioN oF” fezion ION OF Nueva Eciia DISTRICT OF Palayan City Choose to soon relate important mention Date: January 24, 2024 Artist room stop commercial world experience. You step teach Sea very experience. Sign two dog certain. Through talk blood Wear beautiful. Chance health town area new ten cause. Moment head sure bad despite tonight. Woman Congress nature. Game case above baby anything. Time when local even. Team necessary low including meeting Painting anything face. Per television sign view moment style those painting. Tough wall we Cover this generation want. Matter food both Population. Submitted by: Joseph Anderson Patent examiner"
    },
    {
        "image": "expandtraining1_synth_2_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Stop Commercial world experience. You st realtn tow despite ton aie Case above haby any aven Saiy low including 7 Yview moment s\\ Joseph Anders exaan"
    },
    {
        "image": "expandtraining1_synth_3_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Music Step interest Rate: ng force hour here fill Oestober O7 2024 Face trouble boy what wife even. Mi Consem positive far degraa, Ne very. Cell process behavior se Serous dosr. Dog that fa: Sernati, eeting card miltary Y deal trip themselves jet 20US. Administration open ind argue movie Present, Too son offer vay event me. Health thank writer difference Option public came North itself practice may) Eat though iu Sot Al, Plant o Sahization final jay Carry white city art confinue MUCH. Pick door nortt onto common. Ahead toe fire consumer human. Media strong bring reflect, umes phone away"
    },
    {
        "image": "expandtraining1_synth_3_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Republic ofthe Phlspines Department of Education SCHOOLS DIVISION OF Pampanaa DISTRICT OF Angeles City Music step interesting force hour here fill Date: October 01, 2024 Face trouble boy what wife Concem positive far degree. Near d common. Ahead too fire consumer human. Media strong bring reflect. Submitted by: James Price Patna"
    },
    {
        "image": "expandtraining1_synth_3_aug3.png",
        "label": "expandtraining",
        "ocr_text": "re cs A Republic of the Philippines Department of Education Region 9 SCHOOLS DIVISION OF Pamoanaa DISTRICT OF Angeles City Music step interesting force hour here fill Date: October 01, 2024 Face trouble boy what wife even. Meeting card military. Concern positive far degree. Near deal trip themselves let very. Cell process behavior serious. Administration open serious door. Dog that land argue movie present. Too son offer sometimes phone away event me. Health thank writer difference option public camera. North itself practice maybe. Eat though use both hit. Plant organization final lawyer case. Carry white city art continue much. Pick door north onto common. Ahead too fire consumer human. Media strong bring reflect. Submitted by: James Price"
    },
    {
        "image": "expandtraining1_synth_3_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Music step in Date: a. North itself practic ation fina! act,"
    },
    {
        "image": "expandtraining1_synth_3_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education SCHOOLS DIVISION OF Pampanaa DISTRICT OF Angeles City Music step interesting force hour here fill Date: October 01, 2024 Face trouble boy what wife even. Meeting card military. Concern positive far degree. Near deal trip themselves let very. Cell process behavior serious. Administration open serious door. Dog that land argue movie present. Too son offer sometimes phone away event me. Health thank writer difference option public camera. North itself practice maybe. Eat though use both hit. Plant organization final lawyer case. Carry white city art continue much. Pick door north onto common. Ahead too fire consumer human. Media strong bring reflect. Submitted by: James Price Bare Sea"
    },
    {
        "image": "expandtraining1_synth_4_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Repub of the Philippe? Department of Education Repen SCHOOLS DIVISION OF Cora Brewince DisTRICT OF Carcar CY Behind group instead choice mind option consider pate: May 01, 2024 Leave each study growth build language- Here either environmental cost crime food kind. True theory arrive prevent major conference. Article born relationship large. Personal hard mother run way kitchen. Surface ‘owner decade evidence but arm risk. Submitted by: Jimmy Contreras Film video editor"
    },
    {
        "image": "expandtraining1_synth_4_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Rep Education Department Behind group instead choice mind option consider Leave each stud environmental cost crim major conference. Articie born relaiior hard mother run way kitchen. Surface owner de: out arm risk rowth build language. Here either food kind. True theory arrive prevent ship large. Personal je evidence vibe by: Jimmy Conte ‘video ed"
    },
    {
        "image": "expandtraining1_synth_4_aug3.png",
        "label": "expandtraining",
        "ocr_text": "eho Ormanes Behind group in consider stead choice mind option Dae May 01, 2094 Leave each Study growth puite language. Hera o itt environmental cost ciime food Kine) Major conference. Article bom relat Aard mother fUn way kitchen Surfa but arm risk. ter Jinvay Contreras"
    },
    {
        "image": "expandtraining1_synth_4_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Department of Hegioa Behind group instead choice mind optior consicer Dae: May 01, 2024 Leave each study environmental cost crime food kind. True theary arrive prevent major conference. Article bom relationship large. Personal hard mother run way kitchen. Surface owner decade evidence but arm tisk. Here either pitted by: ny Contreras"
    },
    {
        "image": "expandtraining1_synth_4_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Depariment of ScHOOLS DIVsle' oF me Behind group instead choice mind option consider Dew May 01, 2024 Lea. ach study growin build language. Here either ronmental cost crime food kind. True theory arnve prevent major conference. Article born relationship targe. Personal hard mother run way kitchen. Surface owner decade evidence but arm risk. Filnvvideo editor"
    },
    {
        "image": "expandtraining1_synth_5_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Department of Rducation Bepsitic of His region science thus as bed class Date: 45, 2022 Meet thing back close your prepare provide. Speech box special spring student near your. Ready more memi Our home hope suffer Gace BURGER) peat able series where consider sp: jor draw option ago real. Stand ae administration u un i scienc infere necting control magazine official c option. Imagine develop sometimes purpose. Submitted by:"
    },
    {
        "image": "expandtraining1_synth_5_aug2.png",
        "label": "expandtraining",
        "ocr_text": "His region science thus as bed class Date: December 15, 2022 Meet thing back close your prepare provide. Speech box special spring student near your. Ready more member name. Our home hope suffer general. Mean agent able series where consider speciai above. After administration senior draw option ago real. Stand expiain administration until give science. Interesting meeting contro! magazine official option. Imagine develop sometimes purpose Submitted Christine Perry Designer, graphic"
    },
    {
        "image": "expandtraining1_synth_5_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Department of Education SCHOOLS DIVISION OF Zamboanaa DISTRICT OF Zamboanga City His region Science thus as bed class Date: December 15, 2022 Interesting meeting c ‘ontrol magazine Official option. Imagine develop sometimes purpose. Submitted by: Christine Perry Designer, graphic"
    },
    {
        "image": "expandtraining1_synth_5_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Date: Meet thing back close you special spring student near y Our home hope suffer gen consider special above. After eainisaton senior or Ora ie pepare prewee 3 LR ‘ead aihere M Paton interesting m develop sorn ting contro! magezi 1 officiel option imagine"
    },
    {
        "image": "expandtraining1_synth_5_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Reged of he Vaippines Department of Education TOF Zamboanga City His region science thus as bed class Date: December 15, 2022 Meet thing back close your prepare provide. Speech box special spring student near your. Ready more member name. Our home hope suffer general. Mean agent able series where consider special above. After administration senior draw option ago real. Stand explain administration until give science, interesting meeting contro} magazine official option. imagine deveiop sometimes purpose. Submitted by: Christine Perry Designer, graphic"
    },
    {
        "image": "expandtraining1_synth_6_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Pa ad we OB Republic of the Philippines Department of Education Region 4 SCHOOLS DIVISION OF Laauna DISTRICT OF San Pablo Relationship to all deep Date: July 03, 2025 Scene garden relate. Yard fight assume step. Head skin anyone different decide partner. Exist hard address which return others capital. Put book seat nation. Base third hit break everything until good sit. Laugh particularly single animal those. Chair still player rather. Ask beat religious four break. Submitted by: Teresa Graves Engineer, electronics"
    },
    {
        "image": "expandtraining1_synth_6_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Relationship to ali deep July 03, 2025 ight assume step. Head SKIT hard address whic on. Base third hit break ry single animal Jigious Our preaak. relate. Yard de partner. Exist Put book seat nati gh partict dart Ask beal re! ollal. rything unt! good nose. Chair stil player rath"
    },
    {
        "image": "expandtraining1_synth_6_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Repu of the Poteppines Department of Education Relationship to all deep Scene garden relate. ¥: anyone different de return others capital. Pc everything untii good those. i player je pai i. Laugh partiouwlars ‘fight assume step. Head skin toner, Exist hard address which nation. Base third hit break ingle animal rather. Ask beat religious four preak. Bee aH"
    },
    {
        "image": "expandtraining1_synth_6_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Repadlie of tae D Departneni of alate. Yard fight a anyone different decide parine: fs Capital, Put book seat nation. Base third hit break everything until good sit. Laugh partic. farly single animal player rather. Ask beat religious four bre: se slep. Head ski st hard addres. x"
    },
    {
        "image": "expandtraining1_synth_6_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Fé BS Republic of the Philippines Department of Education Region 4 SCHOOLS DIVISION OF Laguna DISTRICT OF san Pablo Relationship to all deep Date: July 03, 2025 Scene garden relate. Yard fight assume step. Head skin anyone different decide partner. Exist hard address which return others capital. Put book seat nation. Base third hit break everything until good sit. Laugh particularly single animal those. Chair still player rather. Ask beat religious four break. Submitted by: Teresa Graves Engineer, electronics"
    },
    {
        "image": "expandtraining1_synth_7_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Pattigpises men? of Education Ragicn 36 Marriage bar Date Safe administration fly May 76, 2024 ive detail brother news, if Small word enjoy. Beautify fy effect i feeling. Potitics side get rang: i iy Miss matt drop, High lose raed te Spring water pragst e Poor give idea law this General continue bade. Within use fTaanager throw break including her size similar, Number direction Scund. Husband decide fevel list option 's parent teach indeed. Staff save"
    },
    {
        "image": "expandtraining1_synth_7_aug2.png",
        "label": "expandtraining",
        "ocr_text": "® Repadic of the Pbrtppeses Departinent of Education Region SCHOOLS BINISION OF cain Peevinre a SASTRICT OF Lapulapu Cty Marriage bar safe administration fly Dew: May 16, 2024 College receive detail brother news. Poor give ides commercial. Hear smal! word enjoy. Beautiful try effect jaw this vote maintain feeling. Politics side get. General continue visit political it. Fact test part range experience trade. Within use activity beautiful. Miss matter manager throw break including drop. High jose read teacher size similar. Number direction Spring water pressure sound. Husband decide ievel jist option performance. Gas middle parent teach indeed. Staff save crime consider it us. Submicted by: Matihew Beli Tesch, ack oaveetien"
    },
    {
        "image": "expandtraining1_synth_7_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Marriage bar safe administration fly bate: May 16, 2024 ive idea Hui it iry effe ge receive detail brother news. Poor commercial. Hear small word enjoy, Beat vote mail political i te ‘part GATES activity beautiful, Miss matier manag nw break inciud: sa read her size similar. Number direction assure sound. Husband decide level list option performance. Gas middie parent teach indeed. Sk crime consider it us. ct law thi"
    },
    {
        "image": "expandtraining1_synth_7_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Marriage bar safe adminisiration fly ction vach indeed Sart save"
    },
    {
        "image": "expandtraining1_synth_7_aug5.png",
        "label": "expandtraining",
        "ocr_text": "e Philippines Republic of Education Department o' Region 16 SCHOOLS DIVISION OF Cehn Province DISTRICT OF Lapu Lapu City bar safe administration fly Marriage pate: May 16, 2024 etail brother news. Poor give idea rd enjoy. Beautiful try effect law this vote maintain feeling. Politics side get. General continue visit political it. Fact test part range experience trade. Within use ger throw break including activity beautiful. Miss drop. High lose read teacher siz imilar. Number direction cide level list option spring water pressure sound. Husband de performance. Gas h indeed. Staff save crime consider it us. College receive d commercial. Hear small wo middle parent teac! ‘Submitted by: Matthew Bell ‘Teacher, adut education"
    },
    {
        "image": "expandtraining1_synth_8_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Republic ofthe Philippines Department of Education Region 3 SCHOOLS DIVISION OF cen: Province DISTRICT OF Carcar City Adult project boy reach way rich Date: April 19, 2023 Wall seat discussion our situation animal. Able kind offer real. Song leg hit son. Think appear TV hundred south. Even senior travel number any dark. Usually place bed difficult single. Sister too accept trade environmental common throughout. Point security hand forget successful. Car amount executive first lot issue. Best base daughter common cold computer take father. Sister conference local between. Another traditional police test movement. Available yes professor opportunity quite run level everyone. Much three suggest both especially our cut. Line forget face tough. Submitted by: Sabrina Johnson Midwife"
    },
    {
        "image": "expandtraining1_synth_8_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Pdoppine: Department of Education Adult Project boy reach Way rich \"ADFT 19, pa23 ‘aise Song eg nits a. Able kind Ofer Fea. uth, Ey ior beg iff le 2 environments coy if f Succes: Ssful Oe BESO) yore three SUOgest bi ‘Line forget face opportu, uty oth esneci hy OUP CUE. tough."
    },
    {
        "image": "expandtraining1_synth_8_aug3.png",
        "label": "expandtraining",
        "ocr_text": "“ ‘eo <4 Republa of the Palppenes Department of Education 2 Repoa SCHOOLS DIVISION OF Crt: Province DISTRICT OF Carcar City Adult project boy reach way rich Date: April 19, 2023 Wall seat discussion our situation animal. Able kind offer real. Song leg hit son. Think appear TV hundred south. Even senior travel number any dark. Usually place bed difficult single. Sister too accept trade environmental common throughout. Point security hand forget successful. Car amount executive first lot issue. Best base daughter common cold computer take father. Sister conference local between. Another traditional police test movement. Available yes professor opportunity quite run level everyone. Much three suggest both especially our cut. Line forget face tough. Submitted by: ‘Sabrina Johnson Midwife"
    },
    {
        "image": "expandtraining1_synth_8_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Adult project boy reach way ricn Bate Aprif 19, 2023 ation animal. Abie kin Ty ed south. Even Car amount r common cold computer take tween. Another traditi y opportunity fr father, Sister o police lest mover quite run level everyone. Much three sugges our cul. gel face tough. d by na Johnson"
    },
    {
        "image": "expandtraining1_synth_8_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Republic ofthe Philippines Department of Education Region 3 SCHOOLS DIVISION OF Cebu Province DISTRICT OF Carcar City Adult project boy reach way rich Date: April 19, 2023 Wall seat discussion our situation animal. Able kind offer real. Song leg hit son. Think appear TV hundred south. Even senior travel number any dark. Usually place bed difficult single. Sister too accept trade environmental common throughout. Point security hand forget successful. Car amount executive first lot issue. Best base daughter common cold computer take father. Sister conference local between. Another traditional police test movement. Available yes professor opportunity quite run level everyone. Much three suggest both especially our cut. Line forget face tough. Submitted by: Sabrina Johnson Midwife"
    },
    {
        "image": "expandtraining1_synth_9_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education Region’ 3 SCHOOLS DIVISION OF Rahal DISTRICT OF Tagbilaran City Future success south material according beat Date: March 20, 2024 Area line sea more. Under current town practice people every whether. Watch seek figure author system staff know lawyer. Successful adult human through simple everybody fact. Daughter other staff sport increase century establish past. Step state side six key. Crime goal should pull. Necessary executive fall our his happy friend direction. President line poor color. Submitted by: Melissa Rodriguez Conservator, furniture"
    },
    {
        "image": "expandtraining1_synth_9_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Department of Future success south material according beat Dawe: March 20, 2024 Area line sea more. Under current town practice people every whether. Watch seek figure author systern staff know lawyer. Successful adult human through simple everybody fact. Daughter other staf sport increase century establish past. Step state side six kay. Crime gaei should nud. Necessary execulive fall our his happy fiend direction. President fine poor color. aos, funyutine"
    },
    {
        "image": "expandtraining1_synth_9_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Republic ofthe Philippines Department of Education Region 3 SCHOOLS DIVISION OF Rohnl DISTRICT OF Tagbilaran City Future success south material according beat Date: March 20, 2024 Area line sea more. Under current town practice people every whether. Watch seek figure author system staff know lawyer. Successful adult human through simple everybody fact. Daughter other staff sport increase century establish past. Step state side six key. Crime goal should pull. Necessary executive fall our his happy friend direction. President line poor color. Submitted by Melissa Rodriguez Conservator, furniture"
    },
    {
        "image": "expandtraining1_synth_9_aug4.png",
        "label": "expandtraining",
        "ocr_text": "a head Republic of the Philippines Department of Education Regia 3 SCHOOLS DIVISION OF Rano DISTRICT OF Tagbilaran City Future success south material according beat Date: March 20, 2024 Area line sea more. Under current town practice people every whether. Watch seek figure author system staff know lawyer. Successful adult human through simple everybody fact. Daughter other staff sport increase century establish past. Step state side six key. Crime goal should pull. Necessary executive fall our his happy friend direction. President line poor color. Submitted by: Melissa Rodriguez Conservator, furniture"
    },
    {
        "image": "expandtraining1_synth_9_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Reps Phipps Depar: nat of Education Future success south material according beat Oste: March 20, 2024 people every Area line sea more. Under current town practice system staif know lawyer. her. Watch seek figure aut! ssful adult human through simple everybody fact. afi sport increase century establish past. ae State side six key. Crime goal shi pull. Necessary i r his hi esident line poor or “olor, Conserater, fun"
    },
    {
        "image": "expandtraining2_synth_11_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Depa eee rtm SSE Night determine money hotel into pt ick ondition career betier i retand ever joveme Open model mi other. Movie pal iadustty rather agree. short. Fine gingle seem would. Somebody usually 9 v havi ago Nous! ad. Paper whole ore p. Recognize ead worry Tees il! Sore: ores Old protect in exactly gort free note prepare. Pres sent movie lead in ead line. Such baby 1g foreign. Matter arm Klichen exacily lop red you. Final nor tself wae Air film tion tel olty hotel reflect music TOP - Baby young devel"
    },
    {
        "image": "expandtraining2_synth_11_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Night determine Money hotel into pick Movernent condition career betler pailtical place. While underst. nd UpON rather Open mode other, Movi indus agree. Baby Young ey Shor. Fine SINE sear; would, Somebody Usually quick ily travel ago house wind, Paper whole Prepare help, Recognize lead worry trouble bili future Manage. Old brotect Republican exactly sort tres note prepara. Present Movie lead Stead fine, Suc! aby evening foreign, M farm kitchen exactly develop red YOU. Fina! nor iiselt Study. Ale Shtuth ect music, On let city hotel refl"
    },
    {
        "image": "expandtraining2_synth_11_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Open mode! movement condition career better other. Movie political place. While understand industry upon rather agree, Baby young ever shori. Fine single seem would. Somebody sually quickly travel ago house wind, Paper whole prepare help. Recognize lead worry trouble bill fulure manage. Old protect Rapublican exactly sort free note prepare. Present movie lead instead line. Such baby evening foreign. Matter arm kitchen exacily develop red you. Final nor itself study. Air fim institution let city hote! reflect music."
    },
    {
        "image": "expandtraining2_synth_11_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Night determine money hotel inte pick beter Open mocel movement condition ca ine i upon fa short. Fine single usually guickly tray al soo Re USE itself s of music"
    },
    {
        "image": "expandtraining2_synth_11_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Night determine money notel into pick movement condi career better per al place. derstand rather agree young ever q ri would. Someboay 9 house wind, Open mo ath er Movie in ter arm ki nor Kself study. Alr flim insta j ition iet city hotel reflect m"
    },
    {
        "image": "expandtraining2_synth_12_aug1.png",
        "label": "expandtraining",
        "ocr_text": "wv Republic of the Philippines Department of Education SCHOOLS DIVISION OF Bohol Operation floor heavy author early be Democrat purpose someone our thing everybody. Experience center own everybody. Road strategy challenge another. Today upon animal certainly prepare. Seek window image nation be market. West system grow responsibility. Ability plant tend mind. Prepared by Tom Walker _"
    },
    {
        "image": "expandtraining2_synth_12_aug2.png",
        "label": "expandtraining",
        "ocr_text": "y author early be Democrat Purpose Someone our thing everybody. Experience venter own every Road stre GY Challenge another, Today upon animal cer ainly prepare, Seek window image Nalion be markat West system grow responsibility, Abllity plant t end mind."
    },
    {
        "image": "expandtraining2_synth_12_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Operation floor heavy author eary be Democrai purpose someone our thing everybody. Experience center own rybody. Road strategy challenge another Today upon animal certainly pret idow image sation be market West sj syster mm grow responsibility. Ability plant tend mind."
    },
    {
        "image": "expandtraining2_synth_12_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education SCHOOLS DIVISION OF Bohol Operation floor heavy author early be Democrat purpose someone our thing everybody. Experience center own everybody. Road strategy challenge another. Today upon animal certainly prepare. Seek window image nation be market. West system grow responsibility. Ability plant tend mind. Prepared by: Tom Walker _"
    },
    {
        "image": "expandtraining2_synth_12_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Operation floor heavy author. early be Democrat pur everybody Road strate animal core nati res yse Someone Our thing oerience center fown 2 yoclay upon prepare, Seek window image West system grow wt tend mind"
    },
    {
        "image": "expandtraining2_synth_13_aug1.png",
        "label": "expandtraining",
        "ocr_text": "ation Buy individual central top Take from picture above student new sometimes administration. Field professor worker. issue marriage them article. Scene understand high tend through by. Chair use ready sound compare. Make a again break card themselves her. One group raise around official here. Foreign girl author generation. Significant receive try positive early process. Materia! success bit know end animal maintain chair. Prepared dy"
    },
    {
        "image": "expandtraining2_synth_13_aug2.png",
        "label": "expandtraining",
        "ocr_text": "| central fop Take rom Bicture ab, OVE Studd SoMetimes a ew dministration, j Professor Worker, issue Matrriag 80 then article, Scene ONerstang high teng through by. Chair use Feady sound compare, Make a 3 an break card emselves her. One GFOup raise ound offic: ners, Forsion Gil author generation. Signif PaQCeive uy POSitive Carly Srocess. Ma Nai SuUCCASS bit know eng animal main fain chair."
    },
    {
        "image": "expandtraining2_synth_13_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education 3 SCHOOLS DIVISION OF Boho! Buy individual central top Take from picture above student new sometimes administration. Field professor worker. Issue marriage them article. Scene understand high tend through by. Chair use ready sound compare. Make a again break card themselves her. One group raise around official here. Foreign girl author generation. Significant receive try positive early process. Material success bit know end animal maintain chair. Prepared by Teresa Lopez"
    },
    {
        "image": "expandtraining2_synth_13_aug4.png",
        "label": "expandtraining",
        "ocr_text": "and nigh te e nd com selves he"
    },
    {
        "image": "expandtraining2_synth_13_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education SCHOOLS DIVISION OF Bohol Buy individual central top Take from picture above student new sometimes administration. Field professor worker. Issue marriage them article. Scene understand high tend through by. Chair use ready sound compare. Make a again break card themselves her. One group raise around official here. Foreign girl author generation. Significant receive try positive early process. Material success bit know end animal maintain chair. Prepared by: Teresa Lopez"
    },
    {
        "image": "expandtraining2_synth_14_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Departinent of Education 14 SCHOOLS DIVISION OF Cavite Church kid government business soldier mouth Good gun gas represent war. Necessary morning road prove his executive sea. Mention fire wife suddenly identify information. Office skin appear early music way tonight. Analysis player since according. Between lay seven my officer team despite instead. Peace history number stock decide wide. Prepared by: Sandra Phillips"
    },
    {
        "image": "expandtraining2_synth_14_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Phusppines Department of Education SCHOKHS DIVISION OF Cove oe Church kid government business soldier mouth Good gun gas represent war. Necessary morning road prove his executive sea. Mention fire wife suddenly identify information. Office skin appear early music way tonight. Analysis player since according. Between lay seven my officer team despite instead. Peace history number stock decide wide."
    },
    {
        "image": "expandtraining2_synth_14_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Churen Kid government business soldier mouth r, Necessary morning road prove his executive sea. M fire wife suddenly identify information. Offic skin appear early music way tonight, Analysis piayer since according. Between lay seven my officer team desp. ead. Peace history de, number stock decide wi"
    },
    {
        "image": "expandtraining2_synth_14_aug4.png",
        "label": "expandtraining",
        "ocr_text": "1288 Soldier mouth Sood gun gas represe, moming road prove his executive sea. Mention fire wife suddenly identify information, Office skin appear arly music way tonight. Analysis player since according. Between lay seven my eace history ni war, Necessary officer team cesoite instead, ©, number stock decide wide."
    },
    {
        "image": "expandtraining2_synth_14_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Church kid government business soldier nouth resent wal. Necessary his executive Sea. Mention oration. Office skin appear ea! tonight. Analysis player since according. Belween lay seven My officer leam despite ins tead. Peace nistory number stock decide wide. Good gun gas feP morning rae prove fire wife suddenly identify inf arly music Way ."
    },
    {
        "image": "expandtraining2_synth_15_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Republic Departinen 15 SCHOOLS DIVISION OF Mara Artist technology seven simpie network project always myself Room action operation adult account physical behavior. Boy this own late last part collection. Range letter any season market tonight well. Air each music that. Betier heart Democrat by. Agent fook camera bill could local. Safe now run other it human board kind. Remember including particular clear message two. Debate tax kind choose. Technology environmental war college pattern which. Particularly weight save white movement science cover. Large like put. Choice card create other road seem parent. The body ok black. Prepared"
    },
    {
        "image": "expandtraining2_synth_15_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Departinent of Education 18 SCHOOLS DIVISION OF Manila Artist technology seven simple network project always myself Room action operation adult account physical behavior. Boy this own late last part collection. Range letter any season market tonight well. Air each music that. Better heart Democrat by. Agent look camera bill could local. Safe now run other it human board kind. Remember including particular clear message two. Debate tax kind choose. Technology environmental war college pattern which. Particularly weight save white movement science cover. Large like put. Choice card create other road seem parent. The body ok black. Prepared by: David Lynch"
    },
    {
        "image": "expandtraining2_synth_15_aug3.png",
        "label": "expandtraining",
        "ocr_text": "behavi S OWN fz Range ‘etter any seasol each music that. Better Agent look camera bul c other it human hoard kind. Remember including particular clear message two. Debate tax kind choose. Technology environmental war colle pattern which. Particularly weight save white movernent science cover, Large like put. Choice card create other road seem parent. The body ok black."
    },
    {
        "image": "expandtraining2_synth_15_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Phihppines Department of Education 15 SCHOOLS DIVISION OF Manila Artist technology seven simple network project always myself Room action operation adult account physical behavior. Boy this own late last part collection. Range letter any season market tonight well. Air each music that. Better heart Democrat by. Agent look camera bill could local. Safe now run other it human board kind. Remember including particular clear message two. Debate tax kind choose. Technology environmental war college pattern which. Particularly weight save white movement science cover. Large like put. Choice card create other road seem parent. The body ok black. Prepared by: David Lynch"
    },
    {
        "image": "expandtraining2_synth_15_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Bw Republic of the Philippines Department of Education SCHOOLS DIVISION OF Nana Artist technology seven simple network project always myself Room action operation adult account physical behavior. Boy this own late last part collection. Range letter any season market tonight well. Air each music that. Better heart Democrat by. Agent look camera bill could local. Safe now run other it human board kind. Remember including particular clear message two. Debate tax kind choose. Technology environmental war college pattern which. Particularly weight save white movement science cover. Large like put. Choice card create other road seem parent. The body ok black. Prepared by: David Lynch"
    },
    {
        "image": "expandtraining2_synth_16_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education 1 SCHOOLS DIVISION OF Cavite Environment give region Year outside thank purpose mention. Treatment article young fact. Tell attorney could accept activity interview. Half hear tend research. Ball through response wall. Situation have energy maybe bit forward identify theory. Hot serve among improve. Career would Mr. Prepared by: Michael Turner"
    },
    {
        "image": "expandtraining2_synth_16_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Environment give region Year outside ti hank purpose mention. Treatment fact. Tell, ation could “accept interview, Haif hea thro ough fesponse wall. Maybe bf rd ident among linprove, ituation have energy Ty theory. Hot Serve vareer would Mr,"
    },
    {
        "image": "expandtraining2_synth_16_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Environment give regio pose mention. Treatment e young fact. Tell attorney could accept activity interview. Half hear tend research. Bail through response wall. Situation have energy bit forward identify theory. Hot serve g improve. Career would Mr."
    },
    {
        "image": "expandtraining2_synth_16_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education 16 SCHOOLS DIVISION OF Cavite Environment give region Year outside thank Purpose mention. Treatment article young fact. Tell attorney could accept activity interview. Half hear tend research. Ball through response wall. Situation have energy maybe bit forward identify theory. Hot serve among improve. Career would Mr. Prepared by: Michael Turner."
    },
    {
        "image": "expandtraining2_synth_16_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Philippines Department of Education 16 SCHOOLS DIVISION OF Cavite Environment give region Year outside thank purpose mention. Treatment article young fact. Tell attorney could accept activity interview. Half hear tend research. Ball through response wall. Situation have energy maybe bit forward identify theory. Hot serve among improve. Career would Mr. Prepared by: Michael Turner"
    },
    {
        "image": "expandtraining2_synth_17_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education 17 Culture from necessary Suggest leave wife get bit Phone short. Production fly next c: Prepared by: Tammy Elliott Sy Elliott eee"
    },
    {
        "image": "expandtraining2_synth_17_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Culture from necessary Production fly next cause evidence. Much field process. Power real family religious. Others card say enviranment rate trouble home. Above sistory local want body cultural. We catch total esiablish cell check role. Age memory al alihough wail raise memory. Yel five respond work abl research. Risk finally rest think may next. Capital for should have pattern. Reality through itself tive dark simply property. ohait true"
    },
    {
        "image": "expandtraining2_synth_17_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Culture from necessary it phone short. we an ay tural Wie C catch official alth ‘ough wait i k able res! ital for s if five dark"
    },
    {
        "image": "expandtraining2_synth_17_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Culture from necessary Sug wife get bit phone short. Production fiy next cause [PRESSES Power real farnily ard say environment rate iro’ ict history true total establi official alt! Wise respond work think may next. Cay fle gious. Others ait F raise memory Yet f search. Risk finally rest ial for should have pattern. ive dark simply property. Reality through itself"
    },
    {
        "image": "expandtraining2_synth_17_aug5.png",
        "label": "expandtraining",
        "ocr_text": "1 oL BS Republic of the Philippines Department of Education 17 SCHOOLS DIVISION oF a Culture from necessary Suggest leave wife get bit Phone short. Production fly next ca it Prepared by: Tammy Etiott"
    },
    {
        "image": "expandtraining2_synth_18_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Win position task although Thank scene collection plan seat their check. Natural soon smile usually reveal involve nothing pact hard itself ali play rtend. on personal ner medi Statemen new i simple agree organization explain."
    },
    {
        "image": "expandtraining2_synth_18_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Vin posi ink scene collectio heavy growt! ye contain, Fact de organiz new letie:"
    },
    {
        "image": "expandtraining2_synth_18_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Win position flask although Thank scene col Natura! soon Smile usug nothing. impact hard media free, Slatemen culture Stalement 5 iment per lection p lan seat their check, feVeal invelve self begin beliay ‘wonder Dublic. if ound close enough, S 3S S Veral base Glear tend, Int ting allow heavy Srowth. One on pe new letter he contain remember simpie agree orgay service be. Fact determin #On explain,"
    },
    {
        "image": "expandtraining2_synth_18_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education 18 SCHOOLS DIVISION OF Zamboanga Win position task although Thank scene collection plan seat their check. Natural soon smile usually reveal involve nothing. Impact hard itself begin believe service media free. Statement wonder public. Fall play culture statement sound close enough. Site treatment perhaps several base clear tend. Interesting allow heavy growth. One on personal new letter he contain. Fact determine remember simple agree organization explain. Prepared by: Emily Morton"
    },
    {
        "image": "expandtraining2_synth_18_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Republi of the Philippines Department of Education 1 —— SCHOOLS DSVESION OF ZamOoon92. a Win position task although Thank scene collection pian seat their check. Natural soon smile usually reveal involve nothing. Impact hard itself begin believe service media free. Statement wonder public. Fall play culture statement sound close enough. Site treatrnent perhaps several base ciear tend. interesting allow heavy growth. One on personal new letter he contain. Fact determine remember simpie agree organization explain."
    },
    {
        "image": "expandtraining2_synth_19_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Hahippines Department of Education 19 SCHOOLS DIVISION OF tency Music main outside Than Strategy short visit. Response kid animal, Resource give fish cultural couid if View couid, chair near. Radio trade energy speak about i i en ull Dractice somebody reaily employee however, Prepared by: Thomas Mooney ---——___. a an"
    },
    {
        "image": "expandtraining2_synth_19_aug2.png",
        "label": "expandtraining",
        "ocr_text": "<4 Republic of the Philippines Department of Education 19 SCHOOLS DIVISION OF Bohol Music main outside Than strategy short visit. Response kid animal. Resource give fish cultural could if view could. Floor would check chair near. Radio trade energy speak about campaign education. Carry service themselves amount serve who. Final thing seem TV policy consumer budget. National long possible TV structure her. Begin charge station price. Camera sure evening specific stage. House pull practice somebody really employee however. Prepared by: Thomas Mooney"
    },
    {
        "image": "expandtraining2_synth_19_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education SCHOOLS DIVISION OF Bohol Music main outside Than strategy short visit. Response kid animal. Resource give fish cultural could if view could. Floor would check chair near. Radio trade energy speak about campaign education. Carry service themselves amount serve who. Final thing seem TV policy consumer budget. National long possible TV structure her. Begin charge station price. Camera sure evening specific stage. House pull practice somebody really employee however. Prepared by: ‘Thomas Mooney"
    },
    {
        "image": "expandtraining2_synth_19_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Music main outside i visit, Response kid ani hing National long possible TV sti charge station price. Camera sure evening secific sage. House pull practice somebody"
    },
    {
        "image": "expandtraining2_synth_19_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education SCHOOLS DIVISION OF Boho! Music main outside Than strategy short visit. Response kid animal. Resource give fish Cultural could if view could. Floor would check chair near. Radio trade energy speak about campaign education. Carry Service themselves amount serve who. Final thing seem TV Policy consumer budget. National long possible Ty structure her. Begin charge station price. Camera sure evening Specific stage. House pull practice somebody really employee however. Prepared by: Thomas Mooney thomas Mooney ee"
    },
    {
        "image": "expandtraining2_synth_20_aug1.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education 20 SCHOOLS DIVISION OF _jiolio Understand middle deal dinner public event Trouble lawyer green hand owner. Charge drive great wish woman he stage. Along rather enough section game tend into. Eye including laugh TV garden serve claim. Practice PM mouth. Toward gas much. Sense hold meet leader should. Grow number about after once. Defense increase stuff. State room former water. Believe fly before politics. Prepared by: Mark Williams Mark Williams"
    },
    {
        "image": "expandtraining2_synth_20_aug2.png",
        "label": "expandtraining",
        "ocr_text": "Understand Trouble lawyer great wish wo Enough section game tend into. Eye inci laugh TV garden Serve claim. Practice PM mouth. Toward gas much. Sense hold leader should. Defense increase Stuff. State room fo) water, Believe Revubhec of the Philippines Departinent of Education SCHOOLS OWISION OF soup middle deal dinner public event green hand owner, Charge drive man he stage. Along rather uding meet Grow number about after once. rmer fly before politics."
    },
    {
        "image": "expandtraining2_synth_20_aug3.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education 20 SCHOOLS DIVISION OF _tioilo Understand middle deal dinner public event Trouble lawyer green hand owner. Charge drive great wish woman he stage. Along rather enough section game tend into. Eye including laugh TV garden serve claim. Practice PM mouth. Toward gas much. Sense hold meet leader should. Grow number about after once. Defense increase stuff. State room former water. Believe fly before politics. Prepared by: Mark Williams"
    },
    {
        "image": "expandtraining2_synth_20_aug4.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education 20 SCHOOLS DIVISION OF _ ioilo Understand middle deal dinner public event Trouble lawyer green hand owner. Charge drive great wish woman he stage. Along rather enough section game tend into. Eye including laugh TV garden serve claim. Practice PM mouth. Toward gas much. Sense hold meet leader should. Grow number about after once. Defense increase stuff. State room former water. Believe fly before politics. Prepared by: Mark Wiliams"
    },
    {
        "image": "expandtraining2_synth_20_aug5.png",
        "label": "expandtraining",
        "ocr_text": "Republic of the Philippines Department of Education 20 SCHOOLS DIVISION OF jiojio Understand middle deal dinner public event Trouble lawyer green hand owner. Charge drive great wish woman he stage. Along rather enough section game tend into. Eye including laugh TV garden serve claim. Practice PM mouth. Toward gas much. Sense hold meet leader should. Grow number about after once. Defense increase stuff. State room former water. Believe fly before politics. Prepared by: Mark Williams"
    }
]