[
    {
        "image": "facultypromotion1_synth_10_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "Mas KE G9q UNIVERSITY Meng ORANDUM n Wiyait Stuff energy road large S peace Ses de Sbotunily management Like Slaniard choose pri SHOUD Contain front Imagine to interns oH bad imagine have author seg. HET Pack team Once wile alse de ide. Then middie society 7 Donaiy Moore ara ReLEe:"
    },
    {
        "image": "facultypromotion1_synth_10_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "Date Aggest 23, Meme MP 010 UNIVERSITY MEMORANDUM To: Austin Wvatt Re: Stuff energy road large Term hot glass peace. ‘See door enough contain front. Imagine to international next ‘Opportunity management. Like bad imagine have author see. Foreign reach team standard choose price. Once wife also decide. Then middle society suddenly. (sed)"
    },
    {
        "image": "facultypromotion1_synth_10_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "Date August 23, Memo MP 010 UNIVERSITY MEMORANDUM To: Austin Wvatt Re: Stuff energy road large Term hot glass peace. See door enough contain front. Imagine to international next opportunity management. Like bad imagine have author see. Foreign reach team standard choose price. Once wife also decide. Then middle society suddenly. (sed) Donald Moore Therapeutic radiographer"
    },
    {
        "image": "facultypromotion1_synth_10_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "AoUgH Contain front. ty A imagine have author wife also decide. Then ace f} Donale Moore Theresauti"
    },
    {
        "image": "facultypromotion1_synth_10_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "Date Aupat 23 Memo\" MP010 UNIVERSITY MEMORANDUM To: Austin Wvatt Re: Stuff energy road large Term hot glass peace. See door enough contain front. Imagine to international next Opportunity management. Like bad imagine have author see. Foreign reach team Standard choose price. Once wife also decide. Then middle society suddenly (sed) Donald Moore Therapeutic radiographer"
    },
    {
        "image": "facultypromotion1_synth_1_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "er. sane P L UNIVERSITY MEMCR 2ANDUM tx finn of the CHADS re. Natural boy axect ide garien ye foe S ca leave prove gnaction. According OS ath OO NKSATMALON, Hot actions of NBTTE 10 ee"
    },
    {
        "image": "facultypromotion1_synth_1_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "nile cutive need whatever Office of the C! rich momary 4 pat power, Rate wish No ue hor hait direxston of D2 more history."
    },
    {
        "image": "facultypromotion1_synth_1_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "UNIVERSIDY MEMORANDUS of the Crancetior rai boy sxecuiive need whatever Huge yes onay direction Accoiding oxist piece to fesponse. Bad that power Rete wish north poor nbn trectniont president head size Pressine duection off protessor skull list Fact rest admene case we for Ci te most Defense nair on More distor fen Joshua Rometa Syaternd toss adusten"
    },
    {
        "image": "facultypromotion1_synth_1_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "Doe om. seome* MP 0Ot UNIVERSITY MEMORANDUM To: Office of the Chancelior ke Natural boy executive need whatever joy rich memory direction According exist Huge yes ent response Bad threat power prosident nead it size. Pressure professor skill list. Fact rest piece leave provide garden Rate wish north paor information. Hote! case we for. City divection off natura most, Defense hate administration more NSeOry"
    },
    {
        "image": "facultypromotion1_synth_1_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "Date an. Mone MP 001 UNIVERSITY MEMORANDUM To: Office af the Chancellor Re: Natural boy executive need whatever Huge yes enjoy rich memory direction. ‘According exist piece leave provide garden response. Bad threat power. Rate wish north poor information. Hotel case we for City treatment president head it size. Pressure direction off nature most. Defense hair professor skill list. Fact rest administration more history. (sed) Joshua Romero cl loss"
    },
    {
        "image": "facultypromotion1_synth_2_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "Rats Bewanage Memo? ME p02 NDUM evens and Fran American sou aS enjoy ty (res. Dark adult Faan pattem. Sense biue white Ded thir fiend hey evidence ontinue e Add severaj avoid sim side i Every itself fi ‘all past argue never 1 le salt i Simple oxsetiy Mies"
    },
    {
        "image": "facultypromotion1_synth_2_aug2.png",
        "label": "facultypromotion",
        "ocr_text": ""
    },
    {
        "image": "facultypromotion1_synth_2_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "‘SITY MEMORANDUM For Re Maybe 'y force. Dark adult mand Aer effet road Egor can media cider af iH inarket easy scisntist fee eud: hive White fle ceil pation, Gad) Robert Roman Pr ener, mutinedia"
    },
    {
        "image": "facultypromotion1_synth_2_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "Speraaer MP Qe2 Maybe exact tty for Fe Ratiom. s, Dad th side, VEY self ver need. Pat &e evidence Sol Add soveray avoir ait PUL argue 5 le exactly Arg -"
    },
    {
        "image": "facultypromotion1_synth_2_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "sity MEMOR ghoul crime as enloy effort ro: 2 evide: ctly force. Dark aduit fa seversl avaid small"
    },
    {
        "image": "facultypromotion1_synth_3_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "Fo: Mohn Marshal Service whom great single available fly ad really tage. Various ve. Unit claim claim gos! dark camera des: 6 fii body contain factor. Organization ana Day central your cost former sceve Hil address, sortraiher. Sey nov rate family. Baby indic e. Quickly police out Weight must represent south guess food management lean pret Witla restaurant"
    },
    {
        "image": "facultypromotion1_synth_3_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "UNIVERSITY MEMORANDUM john tanestal! Service whom great single available fly Bag really tage Vanous sort rathar Say none supper frst rote tanuly, Baby mnaicate sen eit clan claim qoal dark camera descnbe (Quickly rolice oul Weight past ganzanon analysis must represent south guess dive More leave pretty ood manageme” address ised) Alexis William"
    },
    {
        "image": "facultypromotion1_synth_3_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "Poe dene en, Mme® 24 Gog UNiversiry MEMORANDUM Te John Marshatt Re: ice whom Great single available fly Bad realty i¢ 89e. Vanous sert rather Say none SUPPON first role farcaty, Baby indicate Sam Unit claim claim, 208i dark camery describe, ICKly police out, Weight past five fit body factor. Organization Analysts must represent South guess drive, Cay central your cost former score Sil. More leave food team (sed) Fast food restacent"
    },
    {
        "image": "facultypromotion1_synth_3_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "sha Mars! Bad realty tage. five fill body conta Da addre! me. Unit claim claim goat dark cb yy central your cost well Re Service whom gre: aious sort rather. Say «factor Organization analysis must former score fii, More leave pi ie at single avallanle ty one support mere describe. Quick Alexis Wilh Fast food restaurs MP 503 role family. Baby indicate Weight past ropregent south quess drive food management leat ‘firs iy police Si"
    },
    {
        "image": "facultypromotion1_synth_3_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "Dae hg Mesos MP0 UNIVERSITY MEMORANDUM first role femily. Beby indicate Bad really it age. Vanous sont rather Say pone support same. Unit claim ciaim goal dark camera describe ‘Quickly potice out. Weight past five fil! body contain factor. Day central your cost former score address. Ongenizalion analysis inust represent south guess drive fi More leave pretty food managenient eer xd Alexis Wilttams: Fast food inane"
    },
    {
        "image": "facultypromotion1_synth_4_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "UNIVERSITY ME Rutter and Murohy Re 72 eye visit front again mother though institution ever build slong aip table provise rock a present lag) fagain be how) coramercri! oil current four thu happy. Room Listen imemational address she everyene oy nares? unit, Over knowledge might conierence daugh Robin James Event organiser"
    },
    {
        "image": "facultypromotion1_synth_4_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "UNIVERSITY ME George, Ritter and Mi ary ke. Pressure eye Viel front it again compara goal ali again big ROW nat Be Ahead afer commerciat oit CUTE! i out 1) imamational address BD every. és Robin Jar MORANDUM ain mother though instution ound piece 4 Other knowledge maht, ad Event organiser sacie similar cover iid sheng vide PACK BEHOD. gis hapey. Roars"
    },
    {
        "image": "facultypromotion1_synth_4_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "Date MB 17: Mono MP 004 UNIVERSITY MEMORANDUM To: George, Ritter and Murphy isit front again mother though institution Re: Pressure eye VIS! similar cover build strong, help table provide rock action. present Jaugh happy. Room Compare goal ball again big how half. Bar care article Ahead after commercial oil current four thus. Professor e everyone. Sound piece Listen intemational address she terest unit. Other knowledge night conference daughter In! (sed) Robin James Event organiser"
    },
    {
        "image": "facultypromotion1_synth_4_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "ue ey\"? tame 8 NPOOK UNIVERSITY MEMORANDUM To: George, Ritter and Musi fe Pressure eye visit front again mother though institution ‘Compare goal bait agsin big how half. Bar care arécle similar Cover build strong. Ahead afer commercial cil current four thus. Professor heip table provide rock acon Listen intenvational address she everyone. Sound piece present iaugh happy. Room conlerence daughter mierest unit Other knowledge night texed) Robin James Event organiser"
    },
    {
        "image": "facultypromotion1_synth_4_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "Dae May Mone MP 004 UNIVERSITY MEMORANDUM To: George, Ritter and Murphy Re: Pressure eye visit front again mother though institution Compare goal ball again big how half. Bar care article similar Ahead after commercial oil current (sed) Robin James Event organiser"
    },
    {
        "image": "facultypromotion1_synth_5_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "Date gest 02. Memo MP 005 UNIVERSITY MEMORANDUM To: Thomas Wells. Re: Box consider nice Month treatment unit role hundred. Surface blood adult store more seek boy. Then Toad soon rich political. Image able use would watch continue day follow. Week Possible yourself detail. Here some crime project either anyone. These ten attack computer suggest. Reason personal entire feel tree level. Outside coach process next. President himself itself across develop shoulder film. Daughter lead foreign manager art nation two. Save letter radio many. Outside executive public and type. Head sure also simply pretty hospital debate apply. Fact herself feel either. (sed) Joshua Johnson TEFL teacher"
    },
    {
        "image": "facultypromotion1_synth_5_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "fORANDUM mas Wells OX CONSI anh treatment ur road ut FO blood adult store m: seek boy Then pedicel, ime wld watch conlnitie day follow Week De Yourself detail. Here some crime prevact either anyone. Th Sten attack e! Thee e coach proce: age able use w Sper Seif itself onal entire fe next. President hi manager att Head sive velop should: or lead foreign iside executive public and Joshua Johns:"
    },
    {
        "image": "facultypromotion1_synth_5_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "Joshua Johnson TEFL teacher"
    },
    {
        "image": "facultypromotion1_synth_5_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "(sad) TEFL teacher"
    },
    {
        "image": "facultypromotion1_synth_5_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "MP 005 UNEVERSITY MEMORAD DUM Wells, unded. Surface Blood adult store more se ifical. image able use le yourself datait epuler suggest. Reasa: ai he i. Presivient himself itself across develop shoulder manager ani nation two. Saye many Outside Head sure also simpiy pretty hospital debate epply. Month teatment unit role FOad Soon tich pot would watch continue day follow. Week are Some crime project a pe aither anyone. These ten atisce ecutive public and ope. Fact hersaif feet either, Joshua Johnson TEFI. teacher"
    },
    {
        "image": "facultypromotion1_synth_6_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "ege baby siory vary. Py ual page behind interg F drogran ta 2088 Yo! palice step tough Worta Panay q black, Barats otf finish top. Condition though very Some pa AOAKY refect Lis PRvEnt reflect Mind Six apy indead TORMENIas Federal wo My audience rich Unit athucs ot TRSPORG boar Fesponsibitity ay base hy ct cer ‘ducation officer Sheironmensal"
    },
    {
        "image": "facultypromotion1_synth_6_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "Date Resenber Memo MP 006 UNIVERSITY MEMORANDUM To: Allison Singleton Re: Store citizen page discussion so Aim college baby story very. Police concern wall call arrive different. Allow stage natural page behind raise source impact. Church bar meet one. Order culture card leg interest than. Produce go finish big color. Light meet yes. In exactly address program left large understand find. Game physical then change yet police step though. World manage market collection black. Parent indicate off finish top. Condition though young some pass neatly reflect. Us prevent reflect mind six any indeed environmental Federal two my audience rich unit education meeting. Question respond board responsibility let base hold. Even can both night market effort wonder. (sed) Rhonda Frye Education officer, environmental"
    },
    {
        "image": "facultypromotion1_synth_6_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "Yo: Allison Singision Re Store citizen page discus: BSION SO Aam cart yy story vary. Police concert: wall call anive diflerent Allow stage natural page behind raise source impact Church bar meet one Order culture card tog interest than. Produce go finish hig color, Light meet yes. ts exactly address prograin jel large understand find Game phys J then change yet police stap though. Word manage market collector black. Parant indicate off finish lop. Condition though young some pase neariy radect US prevent refiect mind six any indead envircnmentat, ‘adeval two my audience ich unit education mosting. Question jegpond board responsibility iet base hold. Even can both night market offor wenger. feed Rhomta Frye Education officer, envcormental"
    },
    {
        "image": "facultypromotion1_synth_6_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "collage baby St\" d raise SOUITe Hl natural page beF Faderal two my aul esponsitslity jet _Produre go fis! ty reflect. Us prevel 01 fed Game ph ience nek ait enh at. sa big color. Ligh pase hold, Even Con both night mar ariive different Aa ner wall apres tant Tae ing neat yes. 1 RAC gcation mSehe bs) Rhonda Frye Ecication offer, penne ei one. Carder CEG sty AdGESS progrert sien though. ti how St card ies"
    },
    {
        "image": "facultypromotion1_synth_6_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "Date Breenpe Nemo MP 008 UNIVveRsiry MEMORANDUM To: Allison Sinaleton Re: Store citizen Page discussion so Am college baby story ver ty. Police concem wall natural page behind false source impact. Church interest than. Produce 90 finish big color. Light meet yes. in exactly address Program left large understand find. Game Physical then change yet police step though. World manage market collection black. Parent indicate off finish top. Condition though young ‘some pass nearly reflect. Us Prevent reflect mind six any indeed environmental Federal two my audience ich unit education Meeting. Question respond board Fesponsibility let base hold. Even an both night market effort wonder. call arrive diferent. Allow stage bar meet one. Order culture card leg (sed) Rhonda Frye Education officer, environmental"
    },
    {
        "image": "facultypromotion1_synth_7_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "Date Recamber Memo\" MP O07 UNIVERSITY MEMORANDUM To: Office of the Chancellor Re: Though bed tree program media tough Newspaper product eight myself grow reach throw test. Yard low everybody black officer economy adult who. Purpose left lead crime build if. Worker three thus impact month. Recently color safe push. Provide beautiful somebody staff product move Push. Cup history seat collection. Again state thousand. Building knowledge wide must century way. Rate probably daughter interview where lose. Structure similar could bill seven lead. Ever pretty money next foot brother social single. Road common artist ability important with. Congress game war ability task. Half yourself lay marriage method probably meet (sed) Victoria Underwood Phytotherapist"
    },
    {
        "image": "facultypromotion1_synth_7_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "Owe reat Mewes MP O07 UNIVERSITY MEMORANDUM To Offfire of tha Chancatior Ke: Though bed tree program media tough Newspaper product eight myself grow reach throw test. Yard low everybody biack officer economy aduit who. Purpose isft tead crime build if Worker three thus impact month Recantly color safe push Provide deautitul somebody staff product move push. Cup history seat collection. Agein state thousand. Building knawiedge wide must century way. Rate probably daughter interview where lose Structure simitar could bili seven lead. Ever pretty money next foot brother social single. Road common artist ability important with. Congress game war ability task. Half yourself lay mariage method probabiy meet. (xd) Victoria Underwood Phytotherapist"
    },
    {
        "image": "facultypromotion1_synth_7_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "One Rasa Somes MP OO7 UNIVERSITY MEMORANDUM Te: Offina of the Chancaitor ke Though bed tree program media tough Newspaper product eight myself grow reach throw test. Ya! everybody black officer economy adull who Purpose left tead crime buiid it. Worker three thus impact month. Recently color safe push Provide beaunful somebody staff product move push. Cup history seat coltection. Again state thousand. Building knowledge wide must century way. Rate probably daughter interview where lose. Structure siiniiar could biti seven iead. Ever protty money next foot brother social single. Road common aftist ability impottant with. Congress game war ability task. Half yourseit lay mariage method probabiy meet. ised) Victoria Underwood Phytotherapist"
    },
    {
        "image": "facultypromotion1_synth_7_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "Dove Reger som MP OOT ONIVERSITY MEMORANDUM To: Office of the Chancellor Re Though bed tree program media tough Newspaper product eight myself grow reach throw tast. Yard low everybody black officer economy aduit who. Purpose fe tead crime butid it, Worker three thus impact ‘month. Recently color safs push. Provide beautiful somebody staf product move push. Cup history seat coffection. Again state thousand. Building knowledge wide must century way. Rats probably daughter interview where jose. Structure similar could bill seven lead. Ever pretty money next foot biather social single. Road common amtst ability important with. Congress game war ability task. Hail yoursetf lay mariage: method probably ineet tend) Victoria Underwood Phytotherapist"
    },
    {
        "image": "facultypromotion1_synth_7_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "scamze UNIVERSITY MEN MORANDUM To: Re: Office of tha Chaneattor Though bed t ee program Inedia tough Ht mPySeit grow react th cer econ HRY eetult woe Pay month, Re contly Sus. Cup histo fast century Could DH seven ATES! ability ireportant wit method Brobably meat, tosh Yard bose left lead crime buita if Wi Provide ee thus impact product move ding knowledge wi a5 re tase Struct: soca ite similar HY Hext foot beathor Congtess game war a ised? Victoria Underwood Phytotherapist"
    },
    {
        "image": "facultypromotion1_synth_8_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "Date Nevgnber Memo MP 008 UNIVERSITY MEMORANDUM To: Human Resources Re: Shoulder onto accept economic Hard kind public student. Receive friend Mrs run resource half arm. Dog alone vote organization rich check degree. Several treat interest PM. Election model whom huge. Face number each film me there leader. Ged) Dr. Kathleen Chapman ledical {SEALE officer"
    },
    {
        "image": "facultypromotion1_synth_8_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "Date ‘November Meme MP 008 UNIVERSITY MEMORANDUM To: Human Resources Re: Shoulder onto accept economic Hard kind public student. Receive friend Mrs run resource half arm. Dog alone vote organization rich check degree. Several treat interest PM. Election model whom huge. Face number each film me there leader. (sgd) Dr. Kathleen Chapman ical We nical officer"
    },
    {
        "image": "facultypromotion1_synth_8_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "Date November Memo# MP oog UNIVeErsiTy MEMORANDUM To: Human Resor Ices Re: Shoulder onto accept economic organization rich che at interest PM. Election mode! whom huge. Face number each film me there leader. (Sed) Dr. Kathleen Chapman (SFE officer"
    },
    {
        "image": "facultypromotion1_synth_8_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "Foie REVO Meme AE MEMORANDUM To Hunan Rescues Re Hard iond public student organizaiion ich cherk degree. Seve Face number each film me there i Chapman ical officer"
    },
    {
        "image": "facultypromotion1_synth_8_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "Sono? MAP 088 UNIVERST VEY MEMORANDUM Jo: Human Resoorees: Shoulder onto socapt econonus Hard Rand public dent Recewe Sion Mrs Tan Se nef arm. Dog a ergene rch chack cages: Saveral teat sf PAA Elechon: madel Face nuTeber each fim me hae leader"
    },
    {
        "image": "facultypromotion1_synth_9_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "UNIVERSITY MEMORANDUM 28 of the Channetior consider ik leacher most Auth jell, Otfice one knowledge high wite mean ff t physical drug bank lype wide significant Baby score ieally per wide opportunity trough. Bed some choose effort feeling. Kid figure tine indicate economic tial. Bel wiite hold, Position perhaps de ised) Steven Sullivan Event organiser"
    },
    {
        "image": "facultypromotion1_synth_9_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "\" MP 068 Bo: Re talk teacher most even throw begin pla i That physica! dnig hank Author only him modia young final. Semeor jolt. Ofice one knowledge high wile mean fish somebod wide significant, Gaby score reatly per wide oppor ype on tq) Steven Sullivan Event organiser"
    },
    {
        "image": "facultypromotion1_synth_9_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "UNIVERSITY MV MORANDUN Office of the Chancellor Prevent consider talk teacher most fini. Sonsene seven throw beain pian. With design rowledg! wile mean fish so iy. That p bank ni Raby score mally cer wide opportunity thre shoe acd it i inl, Behind clear st write hold Position perhaps design Event organiser"
    },
    {
        "image": "facultypromotion1_synth_9_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "awe bes Meme# MP 009 UNIVERSITY MEMORANDUM To: Office of the Chancellor Re Prevent consider tak teacher most ___—— begin plan. With design (sad) Event organiser"
    },
    {
        "image": "facultypromotion1_synth_9_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "Dae dee Swe MP 009 UNIVERSITY MEMORANDUM sed) Steven Suttivan Event organiser"
    },
    {
        "image": "facultypromotion2_synth_11_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMOTION Name _ Adrian Bowman Date _January 16 2020 Department: Department of Computer Science Thave completed or will complete the minimum requirements for the academic rank checked below, and I believe myself to be eligible for promotion to: Assistant Professor _ Associate Professor __ Professor Nov 02 il 2019 _Kimberly Kramer _ or __ Trevor Howard Date Candidate s Signature Nominator s Signature Highest degree held: Ed D. _ Ifan appropriate terminal degree has been completed but not yet awarded, enter verifying documents as the next sheets of paper in this application and check this box. Check the eligibility for promotion: _X Regular ____ Other If “Other,” explain briefly. Ifthe equivalency type of eligibility is used, enter as the next sheet of paper in this application a statement by the departmental promotion committee clearly specifying those details of a candidate s educational and experiential qualifications that constitute equivalency to the terminal degree. Give the dates for time in each rank at Rowan. Instructor: Assistant Professor Dept. of Biology, 2015 2019 ‘Assistant Professor: _Assistant Professor Dept. of Biology, 2015 2019 Associate Professor: _ Assistant Professor Dept. of Biology, 2015 2019 Date of appointment to COS? _JY 88 Date of tenure at coteges _Mar 27, 2017 Recapitulation of all employment (See Rowan University Personne! Resume for details, Item 5) 7 Total years college teaching experience Total years other teaching experience Yes Early Childhood levels No Elementary levels No Secondary levels 17 Total years collegiate administrative experience 29 Total years other relevant experience i e., business, industry, government, ete.)"
    },
    {
        "image": "facultypromotion2_synth_11_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMOTION Name _ Adnan Bowman Date _January 16 2020 _ Department Department of Computer Science Thave completed or will complete the minimum requirements for the academe and I believe myself to be eligible for promotion to: ‘Assistant Professor _ Associate Professor Professor rank checked below, bitte Kimberly Kramer _ __ Trevor Howard Date ‘Candidate s Signature Nominator s Signature Highest degree held: Ed D. Ifan appropriate terminal degree has becn completed but not yet awarded, enter verifying documents as the next sheets of paper inthis application and check this box, ‘Check the cligibility for promotion X Regular Other If “Other.” explain briefly ly specifying those details of a candidat ‘equivalency to the terminal degree statement by ‘educational and experiential qualifications that constitute Give the dates for time in each rank at Rowan. lastrecter: Assistant Professor Dept. of Biology, 2015 2019 [Assistant Professor: Assistant Professor Dept_of Biology. 2015 2019) Associate Professor: _ Assistant Professor Dept of Biology, 2015 2019 Date of appointment to GHG Date of tenure at cates Mar 27, 2017 Recapitulation of all employment (See Rowan University Personnel Resume for details, Item S) 7 Total years college teaching experience 2 ‘Total years other teaching experience Yes Early Childhood levels No Elementary levels No Secondary levels 17 Total years collegiate administrative experience 29 Total years other relevant experience (ve, business, industry, government, ete.)"
    },
    {
        "image": "facultypromotion2_synth_11_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "4 s Finghew degive be Choe tae wing ib mew Assidant Profesor rasectone Prafeanr Recupiulscon of See Rineom tne Actan Baeman TOS TION FOR FACE TY PROMOTION Date _tatean, 1 Gepartinent ot Computer Science te fe the se adenme rank eae bet nebo Asinted Prafeser Seeintate Prsiesvon Pestesor Kimberly Kramer Trevor Howard Corahubote s Stamatire Noone sh had nal degree hae Boon ecaph w tine vent sheets 0° peper ee ft eheet of pacer an tars opts presen prow fy sgeeitiay theese den wakes: te be comma deyroe Sea stant Prctes Dare ot enue at 2 bona seas attics (aching oMperier Yes Nev thy i"
    },
    {
        "image": "facultypromotion2_synth_11_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMOTION 1, Name _ Adrian Bowman Date _January 16, 2020 2. Department: Department of Computer Science 3. Thave completed or will complete the minimum requirements for the academic rank checked below, romotion to and [believe myself to be eligible for p Associate Professor Professor 38t3 Kimberly Kramer _ o: Trevor Howard Date Candidate s Signature ‘Nominator s Signatur Assistant Professor 4. Highest degree held _ Ed D. not yet awarded, enter —— ication and check 5. fan appropriate terminal degree has been completed but ext sheets of paper in this app verifying documents as the n\\ this box 6. Check the eligibility for promotion: _X Regular Other xplain briefly Ie Othe in this application a 1¢ details of a candidate s terminal degree used, enter as the next sheet of paper von committee clearly specifying thoss 7. Ifthe equivalency type of eligibility is ‘onstitute equivalency to the statement by the departmental promot cational and experiential qualifications that $. Give the dates for time in each rank at Rowan, rofessor Dept. of Biology, 2015 2019 Instructor: Assistant P Assistant Professor: _ Assistant Professor” Dept. of Biology. 2015 2019 Associate Professor: Assistant professor Dept. of Biology. 2015 2019 _Mar 27, 2017 Date of appointment to gue Age Date of tenure at cotege 8 Recapitulation of all employment Resume for details, Item 5) (Sce Rowan University Personnel 7 “Total years college teaching experience 29 Total vears other teaching experience Yes Early Childhood levels No elementary levels No Secondary levels AT Total years collegiate administrative experience evant experience Total years other re 29 (ce., business, industry, government, 16 )"
    },
    {
        "image": "facultypromotion2_synth_11_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "1. 6. Check the eligibility for promotion: LICATION FOR FACULTY PROMOTION “Date: January 16 2020_ rank checked below, APP! Name _ Adrian Bowman Department: Department of Cot 1ed or will complete the minim puter Science 1um requirements for the academic Thave complet an believe myself to be eligible for promotion (0: ____Assistant Professor _ Associate Professor Professor oes _Kimberly Kramer _ ot __Trevor Howard Candidate s Signature ‘Nominator s Signature Date Highest degree held: Ed D. {fan appropriate terminal degree has beet completed but not yet awarded, enter verifying documents as the next sheets of PaPEr this application and check this box. X Regular ___ Other 1f Other,” explain briefly. 7. Ifthe equivalency type of eligibility is used, ne 2 the next sheet of paper in this app! Ui Mement by the departmental promotion comme Clearly specifying those details of ‘candidate s ssheational and experiential qualifications that wonstitute equivalency to the terminal degree for time in each rank at Rowan. Assistant Professor Det rant Professor Dept. of Biology, 2016: 8. Give the dates jt. of Biology, 2015 2019 Instructor: Assisti Assistant Professor: Dept of Bilogy, 20152019 _Mar 27, 2017 Associate Professor: _ Assistant Professor Golege 34 Date of tenure at Cotege 8 Date of appointment to Recapitulation of all employment (See Rowan University Personne! Resunve for details, Item 5) “Total years college teaching experience ‘Total years other teaching experience Yes Early Childhood levels No Elementary levels No Secondary levels 17 Total years collegiate administrative experience 29 Total years other relevant experience (ie. business, industry, government, 16)"
    },
    {
        "image": "facultypromotion2_synth_12_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "6 APPLICATION FOR FACULTY PROMOTION Name. John Amold Date: August21, 2024 Department: Department of English Thave completed or will complete the minimum requirements for the academic rank checked below, and I believe myself to be eligible for promotion to: _X Assistant Professor _ Associate Professor Professor Jun 28. 2020 Karen Jackson» ~—_ _ Paul Richards Date Candidate s Signature Nominator s Signature Highest degree held: B S. _ If an appropnate terminal degree has been completed but not yet awarded, enter verifying documents as the next sheets of paper in this application and check this bow Check the eligibility for promotion _ Regular X Other If Other.” explain briefly, Visiting Ifthe equivalency type of eligibility 1s used, enter as the next sheet of paper in this application a statement by the departmental promotion committee clearly specifying those details of a candidate s educational and experiential qualifications that constitute equivalency to the terminal de} Give the dates for time in each rank at Rowan Visiting Lecturer 2018 struct Assistant Professor: _Visiting Lecturer 2018 Associate Professor: _ Instructor Dept of Mathematics, 2010 2014 Date of appointment to G9 483 2% Date of tenure at cotege 8 Aug 27, 2023 Recapitulation of all employment (See Rowan Un sity Personnel Resume for details, Item $) 4 Total years college teaching expenence 14 Total veary other teaching experience No Early Childhood levels No Elementary levels No Secondary levels 11 Total yeary collegiate administrative experience 7 Total years other relevant experience (1e., business, industry, government, ete.)"
    },
    {
        "image": "facultypromotion2_synth_12_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMDY tN 1 Marne Jonn Amoi 2. Qeparment: Department ot Englisi femie patk checked helow, sored or will comnplese the avinimuan vequirements fr the a to be eligible tor promotion to: 3. Phave oom and i believe p50 LX Apsistand Professir Axsuciate Professor Professor sa\" Karen Jackson © __ Pau! Richards Date Candidate s Signasire Nominstors Sigmatare 4, Highest degres heb BS. fan appsopriate seniiaat degra has teen completed bat ao yok aya ron and clicks acumen 25 the next sheets ef pxper in this application a Ld this BOS. 6 Check the efigib: Regular A Other ie “Other,” exp of paper in this appheation ails of x candidate s ones. 3, if the equivalency type of eligsbitity is used, enter as the next sheet tien couainittes clearly specifying those ions that constitute equivalency te the terminal 8, Give ihe dates for time ip such cank at Rowan, Visiting Lecturer 2018 lastrector: 4 Assistant Frofeser: Visi “Amsaciste Prafessoe: _tesiructor ept of Mathematics, 20) i cumes Aug 27, 2023 Dats of appointment we Gu e998. Date of tenn: Recupttalation of all empleyment (Soe Rowan University Parsotaat Resunne for dewits, hows $5 Tota! sears college teasing experience Fotel years cates be SPCHPEHES Ho uty sod toveds: Ne Eknnestacy levels NO Seewndary tevels aq Ys collegiate wdrainistrative experionss 7 Tota} years other retevant egperienre business, industry, govemmens, ete.) i"
    },
    {
        "image": "facultypromotion2_synth_12_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "APPLIC AION Jone Array SEM Pte Sseainue Peniesser, insciuetee appoint Dron ot bt mi pt in Karen Jackson REAOVESS preevtserery"
    },
    {
        "image": "facultypromotion2_synth_12_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION POM PAOL 5 John Arora renee Department of English Thave completed or will comple and {belive myself to be elignhle fo LX Assistant Professor TY PROMOTIC Bates August 24 ments for the academic sank checked raisin req tion to. uw Assnciate Profesor Professor gage Karen Jackson _ er __Paui Richards Date ea deyree helt: B S. Chock the eligibitity for promot bejetly. ie Other,” exp Habe of ei statement f quien vy the alionl and experiential quali jepartmental Give the dates foe ti Instructor: Assistant Featesuers Associste Professer: _ nent io Googe sega 38 onnel Res “Foun yopropsivie terminal degree bas been comp asthe next sheets of paper i iaubility is weed, enter as Ga promuation comm me Hoe deta ars coliog: 's Si Nominster s Si ictod but not yet awarded, enter dius application and chock he ice clearly apecifying those detstis of 2 candibote s heat constitute at degree ach rank at Rowan oy Dept of Mathematics, 2010 2014 Date ofiwoue at cows Aug 27, 2623 hing experience Fotu! sears other teaching experience hhildhood ievels if"
    },
    {
        "image": "facultypromotion2_synth_12_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMOTION Mame: dete Arintd Department Department of Eng! have completed sar will complete dhe mininyssn requirements fie dh Baier August 21 2024 and I believe myself to ae eliginge fe promotion tox LX Assistant Progeasar Highee degwe heh B S, Wan appre vavifying documents as the this box. 5 the Gigibiti ve presmustion: Weother,” explaie briey, visting IP the equivalency type of aligibitity is used, enter as the statement by the deparenental prosution commitier oh ucational aad engevienti Givin the dates instructor: Visiting Lecturer 2018 Astistan( Professor: _V Associate Pesfeswar: _tnstrucior Dept Date of appnisiment te GOS! sens Recapitutotion of all eoxplosment priate terminal degree hes been completed but net y shosis ol isiting Lecturer 2013. an. Assuciate Professor Professor Karen Jackson __ Paul Richards Candidate s Signature Nontitator s Signatre wariled, enter py pandcheck || pce i this ampticatc Regular X__ ORher 5 aheot of popes in this iy specifying those details of p candidate s ‘valency 10 the terminal degree. for time in each pnk ut Rowan, 2010 2014 Date of tewate at cones Aug 27, 2023 (Sco Rowan University Peresnnel Reeume for cletaits, Hien 9} 4 Total years coflexe izching experience Bo Fotai veaes otter ieaching cxporienae Ne Barty Chifthood levels Nin ch) Tees! years o legumes adminiarative experience 7 Total sears other exlewanit expenicice tie., business, iedustry gevernsnent, ec.) axiemic rank checked below,"
    },
    {
        "image": "facultypromotion2_synth_13_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR PACULTY Scott Tucker pnp PROMOTION Dave: Augu 2. Depaiencas: Gepartmani of Education ecanplsie the minions naguiremene far the scadenic Penk checked tstom, i to be eiigible far casero te Assistant Professr —___Asuactate Professor _ Caristapiver Nielsen Candidate s Signature LX Professir dan 14, 2020 oF Bats, 4. Wighest degree nut PROD. if an appropriate serninst degexe bas boon Soruploted ber ant yet awarded, enter ‘stifving documents as tse neza shevts of paper in tis application gad cheek this Bove ‘Cheub the atigibitity fer promating OX Hegetae Seer HECither.” expisin brietly ‘Roxt sheet of Ay span epee in this apptivation 2 that comstituts equivade fag those detaits ef a sandatare s icy 40 the terminal degme, Give the dates fir time in «, sah rank at Rowen, fastractor: ology, 2015 2019 Assneiose Prefexsess sistant Protosecr Dept of Bisiogy. 2015 2019 Bate of sppoinumces to Betee $922 Paw oF tenure st yess _ Aug 09, 2024 Recupiutation of wil emptepmsne {See Rowsas Univexsity P amo fos 3 otal yours colloge teaching experience Bo Fotal vears ther teaching experience Yas Earhy Chik Nin val ‘Teta! pears calle, fate sdinivistrative experience 33 Total years otter relevant experience fie. si indstry, goverment, ete.)"
    },
    {
        "image": "facultypromotion2_synth_13_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "1, 8 APPLICATION FOR FACULTY PROMOTION Name _ Scott Tucker PhD Department: Department of Education Thave completed or will compl Date: August 24, 2023 lete the minimum requirements for the academic rank checked below, and I believe myself to be eligible for promotion to: Assistant Professor _ Associate Professor .X__ Professor sad+ _ Christopher Nielsen _ or __ Angela Calhoun Date Candidate s Signature ‘Nominator s Signature Highest degree held _ Ph D. fan appropriate terminal degree has been comy the next sheets of paper in this applicati verifying documents as t this box. Check the eligibility for promotion: If “Other,” explain briefly. If the equivalency type of eli statement by the departmental promotion committee clear! educational and experiential qual Instructor: Assistant Professor: Associate Professor: Date of appointment to ste pleted but not yet awarded, enter arent (| _X Regular ___ Other lity is used, enter as the next sheet of paper in this application a y specifying those details of a candidate s lifications that constitute equivalency to the terminal degree. Give the dates for time in each rank at Rowan. Assistant Professor Dept. of Biology, 2015 2019 Assistant Professor Dept. of Biology, 2015 2019 _ Assistant Professor Dept of Biology, 2015 2019 __ 4832 Date of tenure at yew _ Aug 09, 2023 Recapitulation of all employment (See Rowan University Personnel Resume for details, lem 5) 31 Total years college teaching experience “33 _ Total years other teaching experience Yes Early Childhood levels Noa Elementary levels Yes _ Secondary levels 21 Total years collegiate administrative experience 33 Total years other relevant experience (ic., business, industry, government, ete.)"
    },
    {
        "image": "facultypromotion2_synth_13_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "3. APPLICATION FOR Name, Scott Tucker PRE Depanoest Deparieent of Education Dhave completsd or will complete the mininann roquimuments the the aeademiy rank checked below, ged i believe myself to be eligible for premottins te: Assistant Profesor Aswociate Prefessar XK Prefessse wait. _Oivistopher Nielsen ow ___ Angela Caihoun Base Cassidaic s Signannea cpainatie s Signature Highest degewe held: h 0) ca Hfon opprogeiace termined depos huss bran completa bat mot yos awarded, cater fy verifying docemens ay the neck sheets of paper in this wpplicatios and eben this bax. arsnetion: OO Reguiar aMhee Check the eligibility fo 1 Oeber,” explain briefly. oven teen oon tenner if the oquivaicncy type ef eligibility is acd, emer as the next shoes of paper ta this application a stateraens by the depactmental promotion covimitige cleerly specifying those details wf a cane sdhucaticnal ang experiential qualifications diet eoastinte cqpsivalensy to the terminal degree Give the dates far tre ta cach rok at Rowan, Hastrmstor: Assintant Pistass Dept. of Biology, Assistant Svofewor: Amaciate Feeferwr, _Asslatant Professer Oept, of Biology, 2012019 Gar efappoinmmentss BAU\" Bog Date of tenure at yom _ Aug 08, 2023 Recapinuation of aff exiiuyssers {Bee Roway University Parvoanet Reounte for deteits, exe 9} a “Genat years college teaching experience Bo Tonal wears other tenohins experience Yes Kacly Chitchond ievele Na Hhemoniary bevels Yee Secondary freely 4 Fotal soars collepiste wioinistrative experience: (33 Tots) sears oiler relevant experience fi, Business, industry, goverameni. ex.)"
    },
    {
        "image": "facultypromotion2_synth_13_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FACULTY PROMOTION 2 eat: Depariment of Education 3 Hiave coraptetss or will conplete tbe minima canteens tur the academic rank chevked below, anit believe myself to be eligible tor penmation to Assistant Professor __assaciate Professor x Professor ned? Givistopher Nielsen _. Angela Calhoun One Candidate s Signature Nomnators Siguatuns a Highest degree belts Ph Dy, 5. fan apmopriase tones vertt iey dogume this Box, ninal degree ius been compteted s the next sheets of ganer Sut not yet wwacied, ner ay his ape 6. Check the cfigibitiy for prow (f Othee,” expisin briedy 1 the equivatency iype of cigibitity is used, enter a the Satenient by the depasimemal promotion educations! and experiential <aalificatioe next shot of paper ig 2s application anmitive clearly specify wig these details af a candidate s Honey to the terminal degyoe F evASTiIE equi Give the dates time i ee rank at Rowen, Tuatrnstor: Assistant Sra leay, 2055 2079 rset a iiniane _ Aug 09, 2029 Keceptintation of aif exytowmens {See Rowen Unive Perec! Resume for detail i s, Hawn $3 34 ‘Toil yeas college teaching experience Bo Total vents other teaching experienoe Yes Barly Childhood levels Ne lementary levels Be Yes Seeondary levels 24 otal Hate adrainistystive experience .33 ‘Fotal yours other relevant ex: i"
    },
    {
        "image": "facultypromotion2_synth_13_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "ES 8. Give the dt APPLIC “ATH BORE FACDL pame:, Scot Taker PRO SGioparincet: Phave compicted of and 1 believe my Assistant Peatosset Jan 14, ana Bate he! Highes dep 1s appropri vertfying do is box Check the cfigibiti Hepartment of Educator complete siote foe promotion 19 eit to be eli ee seer Christepher Nielsen ‘Candidate s Sigratir® té: PRD. map syminal degeee faa best as as te next sheets OF paPAT iy He promotions teotieher, explain briefly, th stasornens by aauational amd Rashi meter: Assistant Professor: Ascoeiats Professnrs Baie of eppoim 9. if thw equivalency type of efegibilty i+ asta, eater a nities nia] protaotion com departra fications that ce es foc time fa cack tank ai Rowan. ment io Wee gt Date of tenure saircermies #000 KX Regviar _ LEY PROMO Bates iments for the ate Peafesset oF ig no pw 2 this appiiestion am asthe next sheet of paper in thi glearhe specifying those de inte equivalency fesictant Professor Dept. of Biciogy 20 4 ao Rrecapitalation of oll exyplesseent Pee Rawat University Personne) Resurne for details, few at otal ysars coltege teasing oxper 3 7 Takei yeurs other caching oxpericncs Yes Early Chikthond levels No Egermantary fewels ves Secondary tevels 2t 33 Total yours coliegiats ac adustey, wer relevant experieaee goveraneid ct} nied anter f THON adeayeg reask checked below LX Professir Angela Calhoun Nomninasor s St yates nad check 1 apptication iis of curiae’ to the Heinen degree. 18 2019 Burg 09, 2023 ene i"
    },
    {
        "image": "facultypromotion2_synth_14_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY Mathematics will complete the to De eligible foe Asstuant Prefesser Kelly Brooks Candisiate s Signature cligibitity for pe e Other, cain brietly if the capivaloney top y is used, enter as she siemeni by the deps potion committee chy Give the dates For tine instructor: Assistant Prefesser: Associate Peafesser: Visiting Lecturer sey 28 Se nf tenure 30 Y PROMOTION Dates June 94, fe Professor Prafessar or _ Gedy Howard next sheet of paper in thi 2048 ii"
    },
    {
        "image": "facultypromotion2_synth_14_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "APPLIC S TION FOR FACULTY FROSKITION Mame: Robert Parker mates ihave irernents for the academic tink checked beh sane belie asuistant Peetessor Aseuciate Profesor Professor ae Kelly Brooks o Cody Howard Nemainaten s Bune Canditase Sis eros heli PLD. Highest fast not yot awa terminal degree hay been comp new! shests of page si this apphheation and chice Check the cligibility fr promotion _ Hegstar XK Othser He Qrher.” expla briefly eligibility su ivaloicy GPE the departmental prom 1 commit ferent by wateonal inseraceer: Assistant rotesvor; Visiting Leck Assnciste Professer: _ Visiting Lecturer 2036 mes dun 16, 2043. intenend io SI AE Date of tenure at Date of spp Recapinstotion of all eniplegment Vota! years co Ton Flomeneary tevel eve ninustrative expertense aa Ey"
    },
    {
        "image": "facultypromotion2_synth_14_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "2. Whe equivalency typeof eligibility is used, enter asthe next shet of paper in this ‘departmental APPLICATION FOR FACULTY PROMOTION 1. Name _ Robert Parker 2. Department: Department of Mathematics 3 Toe Wil complete the minimum requirements forthe scademicrnk checked bow, and I believe myself to be eligible for promotion to: Assistant Professor —— Associate Professor Professor 4. Highest degree held: Ph D, $. Ls appropriate terminal degree has been completed but not yet awarded, enter Verifying documents as the next sheets of paper inthis application and check this box. Give the dates for time in each rank at Rowan. Instructor: Visiting Lecturer 2018 Assistant Professor: Visiting Lecturer 2018 Associate Professor: _ Visiting Lecturer 2018 Date of appointment wo §™\" 397* Date of tenure at yy _ Jun 16, 2013"
    },
    {
        "image": "facultypromotion2_synth_14_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION POR Pacunry PROMOTION {Name Robert Parker DB: Department of Mathematics pisted or wit co maples Pbohiowe neyscis to be a ‘param requizements for the aci Higible fer pro aah checked below, AststaME Prafesae we Kelly Brooks Daic Candiciate s Sipe Asweiate Professor Professar Cody Howard sminalon s Signataze Highs depres held: Ph.) a 5 Wan sopropeiete terminal dk 8 bec completed tawanded, enter feet6 tg documents as the moxt sheers ot Paper plication art check this box wbility foe promotion, Regatar x BGAN” exp briely, Contract BW the equie cligibliey is uses al progest and oxpertonsial gu: state eHeE as the a i cOraMttes cig “ations that i sheet ef pape ation specify ates seandi serininal stegres Give the dare: for time in each ray Enstracter: Assistant Professor: Associane Professor: Visiting Lecturer. 2018 of appaieraent te nee RE Date femure at jun 46, 2015 Recapitabstion of See Rowse Li ‘il eraploymens sity Persone R RE cxpetiCnce Yes Nev 2 Socendary sears colts levels ‘wiate adminisiraty SO HEY, Severmaieny, i"
    },
    {
        "image": "facultypromotion2_synth_14_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FAC TY PROMOTION i rt Parkes Date: June 04, 20: +. Departnest: Deparment of Mathematics 2 Thave compicted oc will euinplete the aininwsen requirements for the academic rank checked ead I believe myseit te be eligible for promotion tc: istant Frofessor Associate Profewar Prafesser 38h Kelly Brooks __ Cody Howard Bote Candidate s Signature loininator s Signsinate 4. Highest degmve held Ph D, _ $. Wan appropriase teeming! degree has boon completed but 208 yet awarded, enter verilying documents as the nexs sheets of paper in dis application and check this box , Cheek the eligibility for promotion: Regstar ‘Other iether.” expiain briefly, Contractuss I tie expuivelency type of tement by the Separtmentat promo educational and experiential qualifications that Give the dutes foe time ia cach rank at Rowan. Instructor: Visiting Lecturer 2018 Assistant Professor: Visting Lecturer 2018 Aweciaie Professor: _ Visiting L Date of app torent o GORMAN py Revapitstation of ait employment ighbiliry is ued, entes as the na on cornmittee clea shest ef pager in this application a ncifying those details of a candiiate s seaming degree. stizate equivalency to th echwer 2018 oftenure at voor Jun 16, 2012 (See Rewan Universtiy Permoarel Resume fir derail, Ye Fa “Total years college teaching experience i Fetal yenrs other touching experiene Yes Early Childhood levs Elementary Sevondary levels 8 Fois! yours collegiate 30 ‘otal years other rele ssi, fi adeninists vont peri 'y, guverament, ef.)"
    },
    {
        "image": "facultypromotion2_synth_15_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION POR FACULTY PRomoric Name, Melissa Dennis 2. Deperonces: Deparment of Mathematics Thawe completed or will conwplute the niininicen requicemeats five the academic renk checked below, and betiewe myself to be cligsble for promotion tor Asciatunt Professor Assoclate Professsr rafieser Ju, 2 Enk Rogers Justin Wilson Dae Candidate s Sigeatare Namioatve s Sigastere 4, Highest dogee belt MS. If ap appesprisie terminal degree hss boon coinpleted ina wot yet awarded, enter verifying dusuments as the meat shoess of paper in this apication and check =| thie Box. ~~ &. Check the cligibiliy for promotion: Regaiar _ Other HW Other,\" expisin brietiy, Adjunct IF the equivalency type af eligibility is wood, eter ax the auxt sheet of juper in this apptivetion a Siaternent hy the departmental prmmotion commities clearly specit ing thase details of a candidate exiscutionel and exporientiat qualifications that constitune equivakeney t the weaninal degree. R. Give the dates fhe time in cach rank st Rew. 20r-- Dept turer 2018 truntor Gept of Mathematics, 2010 2004 Kaatrenter: _ Resistant Axvintaat Profesor: Visiting Lec! Assoriate Professor: Dale of sppointment to YOY FE Nae of aurea coges _ OCt 10, 2043 Recapitwlastor of ail voxpdezusent {See Rowse University Porsonael Resuane fo stalls, Fee $} 8 ‘Total years calinge teeching expestenee a ‘Toud yoors cstwr muching experience Yes Early Chikthoad tovels Yew Elementary tows Yes Secumbery fevets S&) Total years coltepiato adimnisteative experienne 38 Fotal years other selovant expestence: Gio, bosinens, industey, ysovernanet, ete.) bs"
    },
    {
        "image": "facultypromotion2_synth_15_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMOTION Name _ Melissa Dennis Department: _ Department of Mathematics Thave completed or will complete the minimum requirements for the academic rank checked below, and I believe myself to be eligible for promotion to: Assistant Professor ___Associate Professor _ _ Professor Jul 23, 2015 _ _Erik Rogers _ or ___ Justin Wilson Date Candidate s Signature ‘Nominator s Signature Highest degree held:, M S. _ Ifan appropriate terminal degree has been completed but not yet awarded, enter verifying documents as the next sheets of paper in this application and check this box. Check the eligibility for promotion: __ Regular X_ Other If “Other,” explain briefly. _Adjunct Ifthe equivalency type of eligibility is used, enter as the next sheet of paper in this application a statement by the departmental promotion committee clearly specifying those details of a candidate s educational and experiential qualifications that constitute equivalency to the terminal degree. Give the dates for time in each rank at Rowan. Instructor: Assistant Professor Dept. of Biology, 2015 2019 Assistant Professor: _Visiting Lecturer 2018 Associate Professor: _ Instructor Dept. of Mathematics, 2010 2014 Date of appointment to Yrversty 43120. Date of tenure at coreges _ Oct 10, 2013 Recapitulation of all employment (See Rowan University Personne! Resume for details, Item 5) 8 Total years college teaching experience Total years other teaching experience Yes Early Childhood levels Yes Elementary levels Yes _ Secondary levels 33 Total years collegiate administrative experience 8 Total years other relevant experience business, industry, government, ete.)"
    },
    {
        "image": "facultypromotion2_synth_15_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "PACOLTY PROMOTION Bate. May 2 Departmen Deparinent of Mathematics a Thove completed ov wit checked below id Uheticve nyse ty AWE M Bote ciate Professor Prafecsar Ju 23 2015 Enk Rogers i ats Cadthe s Signa Ms. UPreate cermin! dep fying docucnenss a8 th is been eomptes At sheets of paper 8 Check the eiuititiey far syn Other, bicty, _Agnunet Wf the equivatene: sttement t Paper ia this anphcation 2 thave deta educational aut oF candidate s ses for time in cael rank ot Rowan Inetrecter Associate Protcosar: _ Hhsinuctor Dept of Mathem, att Sate Bete or renuce at comes Cet 16, 2048 Recapituta (See Rowe g dekdbood tov ets Biome MEaEy fev Seconds ii"
    },
    {
        "image": "facultypromotion2_synth_15_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "FOR FACULTY PROMOTION Date: May 06 2018 rank checked below, APPLICATION 1, Name _ Melissa Dennis Department of Mathematics 2. Department: sninvum requirements for the academic 3, Thave completed or wil and I believe myself to Assistant Professor Jul 23, 2015 _Erik Rogers ‘Candidate s Signature 1 complete the mit ibe eligible for promotion to: _ Associate Professor _ or __ Justin Wilson Nominator s Signature Professor 5. [fan appropriate terminal degree has been completed but not YeE% Nerifying documents as the next sheets of PaPEr this application and check this box. 4. Highest degree held _ M S. warded, enter Ol 6. Check the eligibility for promotion: Regular X__ Other I Other,” explain briefly. Adjunct, 7. Ifthe equivalency type of eligibility is used, enket the next sheet of paper in this application vatement by the departmental promotion commiies Clearly specifying those details of a candidate s sGiucatvonal and experiential qualifications that constitute equivalency to the terminal degree. the dates for time in cach rank at Rowan. 8. Give Assistant Professor Dept. of Biology. 2015 2019 Instructor: Assistant Professor: _ Visiting Lecturer 2018 tor -Dept. of Mathematics, 2010 2014 Associate Professor: _ Instruct Date of appointment to niversty £8579\" Date of tenure at cotegea Oct 10, 2013 Recapitulation of all employment (Sce Rowan University Personnel Resume for details, tem 5) 8 en\" Total years college teaching experience 54 _ Total years other ‘teaching experience Yes Early Childhood levels Yes Elementary levels yes _Secondary levels 33 Total years collegiate administrative ‘experience 8 Total years other relevant experience (ce, business, industry, government, ete.)"
    },
    {
        "image": "facultypromotion2_synth_15_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "3 APPLICATION FOR FACULTY PROMOTION Name _ Melissa Dennis Date: May 06 2018 Thave completed or will complete the minimum requirements for the academic rank checked below, and I believe myself to be eligible for promotion to: Assistant Professor __ Associate Professor Professor Jul 23, 2015 _Erik R ers a Das cee sigue” plus Yiecn, Highest degree held _ M S. If an appropnate terminal degree has been completed but not yet awarded, enter ‘verifying documents as the next sheets of paper in this application and check this box. Check the eligibility for promotion: _ Regular X_ Other If the equivalency type of eligibility is used, enter as the next sheet of paper in this application a statement by the departmental promotion commitce clearly specifying those details ofa candidate s educational Give the dates for time in each rank at Rowan. Instructor: Assistant Professor Dept. of Biology, 2015 2019 Assistant Professor: _ Visiting Lecturer 2018 Associate Professor: _ Instructor Dept. of Mathematics, 2010 2014 _ Date of appointment to Oey 48 29. Date of tenure at Cateye 8 _ Oct 10, 2013 Recapitulation of all employment (See Rowan University Personne! Resume for details, Item 5) 8 _ Total years college teaching experience 34 Total vears other teaching experience Yes Early Childhood levels Yes Elementary levels “Yes —_Secondary levels 33 Total years collegiate administrative experience 8 Total years other relevant experience (Le., business, industry, government, etc.)"
    },
    {
        "image": "facultypromotion2_synth_16_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMOTION Name _ Alec Blanchard Date: May 20, 2017 Department: _ Department of Computer Science Thave completed or will complete the minimum requirements for the academic rank checked below, and I believe myself to be eligible for promotion to: Assistant Professor _X_ Associate Professor __ Professor May 30 2016 _ William Mills °F __ William Williams Date Candidate s Signature Nominator s Signature Highest degree held:, M A. Ifan appropriate terminal degree has been completed but not yet awarded, enter verifying documents as the next sheets of paper in this application and check this box. Check the eligibility for promotion: _X Regular ___ Other If Other,” explain briefly. If the equivalency type of eligibility is used, enter as the next sheet of paper in this application a statement by the departmental promotion committee clearly specifying those details of a candidate s educational and experiential qualifications that constitute equivalency to the terminal degree. Give the dates for time in each rank at Rowan. Instructor: Assistant Professor Dept. of Biology, 2015 2019 Assistant Professor: _Visiting Lecturer 2018 ‘Associate Professor: _ Assistant Professor Dept. of Biology, 2015 2019 Date of appointment to Yrversty 14121. Date of tenure at yey _ Aug 23, 2016 Recapitulation of all employment (See Rowan University Personne! Resume for details, Item 5) 14 Total years college teaching experience 2 Total years other teaching experience No Early Childhood levels No Elementary levels No Secondary levels 9 Total years collegiate administrative experience 6 Total years other relevant experience business, industry, government, ete.)"
    },
    {
        "image": "facultypromotion2_synth_16_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMOTION Mane: atc Dai May 20, quirements Sor the academic nank checked Assistant Prefersor X _ Assecinte Fravescur Professor Rhye) 28 Wilham Mills «Willan Willams Dane sandidiute s Signature pininators Signaases 4. Highest dogn iS MAL STs appropri ternal degre fas been completed hut nat yet awaced, enter 7 verifying documients as the next sheets of paper in this application and ehack i this box, Sor promotion LX Regular __. Other IP Either,” explain beietty, ie next shect of paper in this opplication venlal promotion caramiting clearly specifying those details af a condi qustifientions educations! aed expencat hak constitde equteulency la the texto degree. 3. Give the dates fine nue in each maak at Rowen, Insirwetier: Assistant Professar: Associate Professor: _ Dste of eppoivinaent to Yovesty WAI. Date ware at yore, hug 23, 2016 Recopriutatios af olf emaploysucrse #ee Rowan University Personnel Resume for detail 14 Total years 5, Hie 53 6 teaching experience oval years otkey teaching experi No Early Cha Seoondury levels “) years callegiute adisiniswative experienc: 8 ‘Total yours other selovant experience fle. Puoviness, indy prveramibien 16.) ii"
    },
    {
        "image": "facultypromotion2_synth_16_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "POR FACULTY PROMOTION APPLICATION Date: M94 20 2011 1. Name: alee Blanchard 2. Department: Dopartmant of Computer Science sense th nim rons te AS 5, Hiawee completed oe wit ote efigible for promotion to\" nak checked below, and Ibeiveve oayseif _ Assistant Professor K__ Asmociate Profesar Professor May 26, 2016 “Wittiam Mills SS Wiliam Williams Date ‘Canstidaie s Signa Reominaton s Signature 44 Sighest deypse bel: MLA. 5. eee ei sg a ont Knap eo ems AS {4 this box. a Other 6, Check the cligibitity for pronation: LX Regular _ [f Other,” expiein briefly ype of eligi in ase ert wo i] oh etn actly wscaiying ie Sets f geaificatis that conseitate Coquivaioncy tothe aerinal S27: ext sheet of paper i this artiste imatrecter: _Aasintart Prolene Cert of Bickagy, 2015 2029 Asstsinat Professor: Nisiting Lecturer 2018 pssistant Provensor Dept. of BistO3 pores Date of eoure at Se Ag 23, 216 off all employment {Soe Kowan Unversity Resume for details, tem 5) 14 years college teaching i otal vears No ‘Early Childhood iewels No Flemneatary tevels"
    },
    {
        "image": "facultypromotion2_synth_16_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR F. Name:, Alec Blanchard Department: Departmer Thave compl and I believe mysel Assistant Pro! May 30, 2016 _ Wi Date Highest degree held: M A. 5, fam appropri verifying documents as the this box. 6. Check the eligi 1f “Other,” explain briefly. 7, Ifthe equivalency type of eli statement by the ‘educational and experiential Jcted or will complete f to be eligible for pr ate terminal de} bility for promotion: departmental nit of Computer Science the minimum requirements for the romotion to: fessor liam Mills X_ Associate Professor ACULTY PROMOTION _Date _May 20 2017 Professor or —_ William Williams ‘Nominator s Signature ‘Candidate s Signature gibility is used, qui dates for time in each rank at Rowan. gree has been co! Tpext sheets of paper in this 2 X Regular ‘enter as the next sheet of paper in t I promotion committee vlifications that constitute equ pleted but not yet awarded, enter pplication and check ____ Other is application a 12 those details of a candidate s clearly specifyin to the terminal degree. valency 8. Give the Inatrector: ‘Assistant Professor Dept. of Biology, 2016 2019 Assistant Professor: Visiting Lecturer 2018 Associate Professor: _ Assistant Professor Dept of Biology, 2015 2019 _ Date of appointment to Key Zh. Date of tenure at yey ‘Aug 23, 2016 Recapitulation of all employment (See Rowan University Personne! Resunt for details, Item 5) 4 Sy Total years college teaching ‘experience “2 ‘Total vears other teaching experience No Early Childhood levels No Elementary levels No__ levels 9 Total years collegiate administrative ‘experience 6 “Total years other relevant experience (ie., business, industry, government, etc.) academic rank checked below,"
    },
    {
        "image": "facultypromotion2_synth_16_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "Give she dates fi 6 APPLICATION FOR YACULTY PROMOTION “fiat $828, 2097 Name. Aiee fAanchare CGNCe epartmont: Dopastenent of Computer S have completa or sill complete the ein recmtroneen aed believe anguctf i be eligible for pratnotion (© foe the acter Ausistant Profenres 2, Associate Protessar Profrasoe Hery 30, 2018 Witliarn Mills or fete ‘Cotitate s Segue fam Willan ss Segnavo te Highnes dagwee belts ALA if an appropiate ngs bas one eosepeted WE srwurdes, enter etn doco a the nent sheets cf pages i Zip ‘sppliewion ses chock dhe Bes. Check the cigiiity Sr promotion: XM Hogutar thee rset exp SEE. nent enter 9p the nent oheet of papar i this epptioation ot cgay spasifving ‘hove Setadis of x exsuint s eituin egaivalenecy 10 he eeasnal eee igibiliny ts wed, xian exam the equivalency type of the departrnestia! promi oma ane experisati’ qualifications that gue in. enc rath at ore Iasteuetor _ Roxboro Gioiogy. 2015 28 avristont Profeor: Visiting LU Assorinte Peotenors _Aesisiant professor Duct. of Biciogy, 85 2089 gorse Aug 23, 26 awe of appoisiment wo BMOMEE MAT Cake of eure Recasinstasion of ai emmplaymen® {See Rowan University Bersonact Eesmrt for details, Wan 4) es “Cota years coblope teaching, experience i. Toxal yous coker wectang experience Re Bayly Childhood jevels: NF Elneniary levels: 9 Toask peoes collegiate adieiaiatrative experience g “Tonal yours cibert relevant experiease dee. business, industry. gevwoursmsent, e882 ii"
    },
    {
        "image": "facultypromotion2_synth_17_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "Names fuis Alena Depa APPLICATION POR FACULTY PROMEVPRUS ser ot Bepartnent of Ed ucation runs requis and boliewe myself te he ekysble for promotion te. wi iyhest degree bel MLA. 2) appropriate vermina! deproe ta this bos ing documents av the romvation HOther” explain beefy, Conte bidity as by the deparins ee dates for time ns imstrvetor: Assit: Professar Associate Professor: _fnstructor Dep Recapititation of alt eanphuysnersé Rosvar: Univesity Personnel Mara Hall ut salutes Sug nai promotion commutes clearly speetty Assurlate Peatessor paper in th x Lenten ip the sent si fac business Penbeene f pape wi nl experience sity. wovemencet, chet ii"
    },
    {
        "image": "facultypromotion2_synth_17_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "6 APPLICATION FOR PACL Name: Luis Alexander Deparment: Deparment of Education ave completed or w piste the n and I believe mysel! £0 he eligible for promotion te: LX Assistant Professor Associute Prefessa iar Hail or Canadiciate s $i Hfan axpropriate serminai depres has been completea! but not as the next sheets of papes Begatar a ity is asedd, a8 the nest sheet if the equivaluney #3 the departmental ps aotion comuuittee cloarly specif that constitute eqaivalen Associate Erefessors _ $n Dept of Mather: Pate of appointment to Soe yO at Samage Recapitubtion of all employment (See Rowan University Person 24 TY PROMOTION Dates Stach 24, snuns remaunemsents for th atte ‘Noniinator application a Jefiery Marti Jawanled, onfer 7 7 Other a so details af a vandidate s y 10 the terminal deg Nov 27, 2021 fi"
    },
    {
        "image": "facultypromotion2_synth_17_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "SPPLICATION POM PACLLTY PROMOP ION LUIS Alexanaes Heparment Dariment of wis Witlam Halj or Candidate s Suenwure Profesor sifery i Neamuntor s 5) foctge nek’ MA we prenotion Reguiar x Otter E Giber explain bie fly ‘a Saiialenes type of init stetement by th fasiructan: Aesiant Proms yar Mssecinte Professor: 8, 2040 2014 Becapiushsion of alt 24 p 6 ii"
    },
    {
        "image": "facultypromotion2_synth_17_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMOTION Name: Luts Alexander Date: March 14 2024 Department: Deparment of Educaton a Ihave completed or wil! complete the minimum reqgirements for the academic rank checked below, and I betieve myseif to be eiigible for promotion to: LX Assistant Professor ___ Assoctate Professor Professor. yee William Hall _& ___ Jeffery Martin Dae Candidate s Signatare Nominator s Signature Highest degree held: MLA. tf am approprite terminsal degree hus been completed but mat yet awarded, eater ventying documienss 38 the next sheets of papct in ds eppbeation antcbeck |_| this box. a Check the eligibility for promotion: Rogober X_ Other 1 \"Other,\" explain hniefly, _Contractust 4 the equivalency type of etigibitity is used, cater as the aext sheet of paper ia this application a statement dy the devartnental pronietion committee cleaity specifying those details of a candidate s educational and expericutial qualifications that constitute equivalency to the terminal degree. Give the dates fo time in each rank at Rowan lastractor: Ser Assistant Professor: _ Assistant Professor Dept. of Bilogy, 2015 2019 Associate Professar: _ Instructor Dept. of Mathematics, 2010 2014 Date of appointmen to EP 58 1\" Date of tenure at compa _ Nov 27, 2021 Recapituiusion of ail employnent {See Rowan University Personnel Reswine for details, item 5) ‘Total years callege teaching experiewe Toaal veurs cxher teaching experience No Early Childhood levels Yes Flementary fevels Ne Secondary levels 24 ois! years collegiate administrative experience 8 ‘Total years other rebzvant experience fi... business, industry, goverument, ste.)"
    },
    {
        "image": "facultypromotion2_synth_17_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACUL Name: Luis Alexender Dawe: Department: Dapariment of Education Thave completed or will se aod netiave myself we be UK Assistant Featesser der 25, 4 ous Wi Cate Highest dagsee beds MLA fase gppropeinte ‘verifying documents a8 the Bex this bon &. Check the eligibilisy fr prom {e totivee,” explain brictly 2. tthe capivalency oes of sastennees fey the depart ntocational and experieatial Give de date semnmianat degeee has beer atigghitny ts sed, ste she minis 29 foie foe prometion: 20: itiam Hell Candidase s Suppiasure hosts of paper in th sotion: Regnier ak promatinn comesiice C qualidcaitans thas consiitate vc for tame in each rank at Rowan, _ Assestute Professor completed inut nat yet awarded, omer Conicoctial ater ag dhe eS TY PROMOTION sreavents tox the ncwiemnic rank checked bake Professor _defiery Martin oe omninator s Sigeatre fg apgtwation and check | aset off geper in thie application s dearly specifying tan details cf cansaies casvalenay #0 Uhe tenninal Gugree: of Mathematics, 2010 2 gastrsctor? instructor Dept of Mather Asaktaat Prakeser ERD asunolate Profeenor: station Oop cf Mathematics, 2010 2044 Bane of eppotntrent to Recapieniasion wf all emplosmaset ay Perscnnet {See Rowen Unive: goeee Sage of een Fouad years college Ho Wes 0 cial yoaes colin es “tenet years otker ralewass tia., Baines Resume OE detatta, eas 3) caching este ideastey, Boerteea, B24 rane at cogs NO nee “Tonal years ather sraching oxppercaive arly Clvithowd eves cmemiany levels Secondary levels sg ubaynenbaeretive CAPRIS 4 experience #"
    },
    {
        "image": "facultypromotion2_synth_18_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMUPIS Ramer, Jennies Young Depa Departnent a Thave eomnpieted oc wilt cond t bel econ Sexitunt Profesor 5 Han apyropriste terminal degree critying docements 0% this Bes. complete the minieann requirements ‘myself ty be etigibie fer promotions ie _ Assnakate Prafenior Robin Ford se ‘Candidate s Sigsvobsre Highest degree held PLD. dhe omnt sheets 6, Check the clagibitigy for promotes 7, ithe equaivaleney tyPe state ediwational 8. Give te tnstenetors Assistant Pri Agsuninte Prater: Date of appointowent Recappleutasion of all essploxsacet ee -eotived,\" explain baietty. cenit by the: departencsiat promotion ‘andl expestoxitiad quutitications that ‘of pager fee dis aywst X Repslar camuatitite dates ee tian ir exch rank st Rows. instructor pore a? shewor: Misting Lecter: 2018 instructor Dept. ot Mathemat Date of manure a ve details, Ham thas howe comipictad but sot yor averted, CHES igibiity is wad, enter as the vant seat of DapTE A fr cocunitioe cheatly speci squivitemry 1 che te ademic iaak checked below, Bor the Peofesser __ Amanda Christian ceenitas s Sigeaters eaten and check spptication sag those dewiis of s candida renin degree pistwematics, 2010 2044 cs, AACOOT eras Dec 22, 26 face Rowan (ravotsliy Peracteael Rewseee 8 ey Poaal yoacs college easing cuperese eo “Tova! yonrs offs teaching experiense no Early Chitttiood levels Yeas Elementary levee to. Secondary levels 34 ai year coltagints sdaninissative experience 34 “Tesgi years oticerrsleamt experience treet, wae. Ee, bursinest, industry, BoM 8"
    },
    {
        "image": "facultypromotion2_synth_18_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMOTION Name _ Jennifer Young _Date _September 06, 2019 Department: Department of Education Thave completed or will complete the minimum requirements for the academic rank checked below, and I believe myself to be eligible for promotion to: Assistant Professor Associate Professor _ Professor Jun 29, it seti. 2013\" -Robin Ford _ or __ Amanda Christian Date ‘Candidate s Signature Nominator s Signature Highest degree held: Ph D. _ If an appropriate terminal degree has been completed but not yet awarded, enter verifying documents as the next sheets of paper in this application and check this box. Check the eligibility for promotion: _X Regular ___ Other If Other,” explain briefly. If the equivalency type of eligibility is used, enter as the next sheet of paper in this application a statement by the departmental promotion committee clearly specifying those details of a candidate s educational and experiential qualifications that constitute equivalency to the terminal degree. Give the dates for time in each rank at Rowan. Instructor: Instructor Dept. of Mathematics, 2010 2014 Assistant Professor: _Visiting Lecturer 2018 Associate Professor: _ Instructor Dept. of Mathematics, 2010 2014 Date of appointment to {gsttvte 44299. Date of tenure at yeesy Dec 22, 2015 Recapitulation of all employment (See Rowan University Personne! Resume for details, Item 5) 6 7 Total years college teaching experience 8 Total years other teaching experience No Early Childhood levels Yes Elementary levels No Secondary levels 31 Total years collegiate administrative experience 134 Total years other relevant experience i e., business, industry, government, etc.)"
    },
    {
        "image": "facultypromotion2_synth_18_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "3, the equivalen APPLICATION FO! Name. Jennifer YOUNG pepartment Department of E jor will complete the Thave complete wo be eligible and [believe mprell Hl Assistant Professor 3g? Robin Ford 2015 Bate Candid Highest degree held PD D- termmal degree has Iran appropriate the next shee verifying documents a this box Check the elngabalaty for promene® 1 Other bility 1 ney type of elie! tal promot ye department qualiticat statement Dy thi Qducational and expersentit Give the dates fr tame am eas rank at Ins Instructor: for promote professor: Visiting Le Date September ducation ina Associate Pro re s SHENATUTE been ts of paper 1 X Regular as the used. en won committee Cle pons that Rowan tructor REACULTY PROM requirements f or completed but not yet n this application constitute equ Dept. of Mathematics, 201 OTION cor the acasemic rank checked below fessor, Professor Amanda Christian Nominator s Signature sanded, enter and check other expla bretly ee plication 3 per mn this app is of a ean minal de wert shect of P Iy specifying valency tw the ndidate s those det 0 2014 ecturer 2018 Lecturer matics, 2010 2014 gy yee Dec 22, 2018 nS) nce experience ive experience sxperience Assistant Associate Professor: “instructor Dept of Mather Date of appointment to ygge Date of tenure ecapitutarion of all employment Recah University Personnel BT for details, Hen 6 Tora years colleve teatehing EXPenE 8 Total vears other teaching No arly Childhood levels Yes Hlementary levels No Secondary levels 31 Lotal years collegnate cadmunisteat Total years other relevant 34 (i¢., business. indus y. government, 16}"
    },
    {
        "image": "facultypromotion2_synth_18_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMOTION Name:, Jennifer Young _ Date _September 06, 2019 Department: Department of Education Thave completed or will complete the minimum requirements for the academic rank checked below, and I believe myself to be eligible for promotion to: __Assistant Professor _ Associate Professor. Professor 2018? _Robin Ford _ or __ Amanda Christian Date ‘Candidate s Signature Nominator s Signature Highest degree held:, Ph D. _ Ian appropriate terminal degree has been completed but not yet awarded, enter verifying documents as the next sheets of paper in this application and check this box Check the eligibility for promotion: __X_ Regular ___ Other If “Other,” explain briefly. If the equivalency type of eligibility is used, enter as the next sheet of paper inthis applic Statement by the departmental promotion committee clearly specifying those details ofa candidate s Educational and experiential qualifications that constitute equivalency to the terminal degree. Give the dates for time in each rank at Rowan. Instructor: Instructor Dept. of Mathematics, 2010 2014 Assistant Professor: _Visiting Lecturer 2018 _ Instructor Dept. of Mathematics, 2010 2014 _ Associate Professor: Date of appointment to [gstiute _4352° Date of tenure at ™\"\" _ Dec 22, 2015 Recapitulation of all employment (See Rowan University Personne! Resume for details, Item 5) 6 ‘Total years college teaching experience 8 —_ Total years other teaching experience No Early Childhood levels Yes Elementary levels No Secondary levels 31 Total years collegiate administrative experience 134 Total years other relevant experience (i c., business, industry, government, etc.)"
    },
    {
        "image": "facultypromotion2_synth_18_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "1 APPLICATION FOR PACU) Name:, denniter Young Depirsnent: Department of Educa save camipteted or wtt compete aay j betiews sayself LPY FROMGTEON Date: Se on, aise wanna Fea Jo be eligible for promteen sats toa tan acatemic rank cfacked below, _Asineaet Prefer one associate Profesor Profesner Robin Ford _ ot Amanda Ch Candidate s Signstare Rominavot s Siyrates Highes degree bel Pad. aot yet waned, 62 fon apipoyine terninal degree ba ben competed bat venting docomnents as ie west SHOE OF PAPE ‘his application and chock his bees. Other ok rae eligibility for promotion: se Omber.” expisin briely 2, ifthe equivalene satentenn by the es Dvosthona end exportentiel fel ce eps of etiginiiy sed, sparing pouanctios See ceomennnereevntsenetac te gates as the next about of paper 1: aoe clearly speulying the givers 09 20 1 hat cxsetltae ies wach rank at Rows. Give the das: for tieat Assistant Prolite? Visiting Lee Associate Professors Bote af appointees io af all camphor Recnpinetation sity Hetaonnel sn nN featnce yng? De of tert a Fou sears cel Teaa! yours 2048 tnstrustor Dept. of Mathematics, 2 ea weer Resncae for details, tte FF vs ociiege senching experi of teaching experience Total wears esbey 1 Eeerly Childhood fevels Picwtueneary evel Savuninry Hove s feginie adenisisteative other velecant experience experionoe 34 han, business industry, qowszamets 6} «application 3 vg sets of carsales aninat degree. 4 2 “Bec 22, 2018 a"
    },
    {
        "image": "facultypromotion2_synth_19_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION POR FACULTY PROMOTION Name: Jomn Wang Deparment: Department of Computer i and believe my May 28, 2 Han apes verifying documents as the Give the date: Recupitutation af all expt (See Rowan Univ ck the eligibility for m 12 completed or will complete the af be efiginte for LX Assistane Professor Candida e terminal degree fas 9 al motien: Assuriate Profiss Gnaversiy A Fotal years col years othe aes, in 2 Ricky Ortiz a ent sheets of pa as _Misiting Lecturer 2 's Personnel Rasunte for datails, ftera $3 lege texehing experiens f Science ‘emotion to: 5 Sigusture Nota sett completed but sot yot Bate of tenure at yoo r ever exp pinnen requirements fo ssociste Professcr Fred Nguyen ore Sigianue awarded, enter and check _ May 23, 2055 a"
    },
    {
        "image": "facultypromotion2_synth_19_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "BW Orher” explain briefly sia APPLICATION FOR FACULTY PROMO y fae foment by the depan educational anid exper Date of ep Recapitutati instructor: Assistant Pe: Asonsiaty Py poinimest to Rowsp Un B promeiion: mental pi atial quel cafessar: fessor: of elt employment bus 16 nce, We minimum req) LX Reyutar ther motiga committe clearly speciiying those Geutions that fo the tess Visiting Lecturer -~ 2048 ines, ete warded, enter 2 ibis appicati ie rank cheched below is of a candidate s meny May 23, 2045 #"
    },
    {
        "image": "facultypromotion2_synth_19_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "6. APPLECATION FOR FACULTY PROMOTION Namie:, Jape Wang Date Department of Computer Science ee Separtme: Phave completed or will complete the usinimn requiremems fir the academic rank checked below, and Lbohieve myself to be eligshte fer promotion te: LX Assistant Profesor ____ Asserlate Professes Profecsar Bay 29) 2 Ricky Ortiz o __ Fred Nguyen sate Chntidste s Sipsaiwee Nomivater s Sigossture Highest degree held B S, If un appecpriate terminal degree bss boca completed ut nat yet awards, enter 7} verifying documents as the next sheets of paper in this opplication and cheek this box. Check the eligibility for promation: LX Regular __. Dither 1 Gther,” explain beietly, valency type of eligibility is exed, enter as departmental pracotion compat jcariaas that constr: the ment sheet of pay application a fying those details of candidew s to the teoninal degre, The equ en by fi srcationel gnu experientin’ gu a Give the dates for tins i cack randk at Rowue. fastrxetors Assistant Professors _ Associate Professor: _ Visiting Lecturer 2078 _ Dats of appoiniment to 3° Date of tenure at Y Recapinalusion of all omptovmens (Seo Rowan University Personnel Resume for detaits, Hoot $} 19 Total years cotloge teaching experience é Tosa} yours other teaching experience tive experience 7 Tonal ys relevant exporignce fie. businow, industry, government, et"
    },
    {
        "image": "facultypromotion2_synth_19_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMOTION 2. Department: Department of Computer Science _ 3. Thave completed or will complete the minimum requirements for the academic rank checked below, and believe myself to be eligible for promotion to: .X Assistant Professor _ Associate Professor Professor May 29, 2012 _Ricky Ortiz _ or __ Fred Nguyen Date Candidate s Signature Nominator s Signature 4, Highest degree held _ B S. 5. If an appropriate terminal degree has been completed but not yet awarded, enter verifying documents as the next sheets of paper in this application and check this box. 6. Check the eligibility for promotion: _X Regular Other If Other,” explain briefly. 2. Cake used, enter as the next sheet of paper in this application a statement by the departmental promotion commitice clearly specifying those details of a candidate s ‘educational and expericatial qualifications that constitute equivalency to the terminal degree. 8. Give the dates for time in each rank at Rowan. letrestonr Instructor Dept. of Mathematics, 2010 2014 Assistant Professor: _ Instructor Dept. of Mathematics, 2010 2014 _ Associate Professor: _ Visiting Lecturer 2018 Date of appointment to Yr\" 22%. Date of tenure at yrrey _ May 23, 2015, Recapitulation of all employment (Sce Rowan University Personne! Resume for details, lem $) 9 _ Total years college teaching experience “8 Total years other teaching experience No Early Childhood levels No Elementary levels AT Total years other relevant experience"
    },
    {
        "image": "facultypromotion2_synth_19_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "4. 5. APPLICATION FOR FACULTY PROMOTION awe: John Wang os, uly 30, 261 Depaciment _ Department of Computer Science thave oo pleted or will compicte the ininimem mequitemetds for the academic rank chucked hel nnd beliove myself to be eligible for promotion to: XM Ascstant Professer Ass Ricky Ortiz _ 8 Chndid aciate Prafeescr vofesser ad Nguyen e s Siguamre Nominator s Signature id B S. if an appropriate terminal degree bus hoon completed bi not yor awa verifying docaments as the next sheets of paper i ication and ches his X Regular Ditter Check the eligibitity iether.” statement by the departs sastion cemmitzee cleasly spocitying thase details of a candi fonal and experieatis! qualifications that constinuie eguivaiency to th ters he dates for Gine mi exe instrectar: Date of appointment te supivitation of ait cmplovmens “2 Rewies Unive era 5) ence ining experience ‘arly Uhildhood levels fomentary levels “onary levels 4 Total years coltzgiate adininistrativ 17 ‘Total years other relevent experience the., husiness, industry, g vermment, a"
    },
    {
        "image": "facultypromotion2_synth_20_aug1.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION FOR FACULTY PROMOTION Name _ Stephanie Jackson Date _June 07, 2016 Department: _ Department of English Thave completed or will complete the minimum requirements for the academic rank checked below, and I believe myself to be eligible for promotion to: Xx Assistant Professor ___ Associate Professor _ —_— Professor CC, Z0i -Thomas Webb _ er __ Warren Wilson Date ‘Candidate s Signature Nominator s Signature Highest degree held: Ed D. If an appropriate terminal degree has been completed but not yet awarded, enter verifying documents as the next sheets of paper in this application and check this box. Check the eligibility for promotion: _X Regular ___ Other If “Other,” explain briefly. If the equivalency type of eligibility is used, enter as the next sheet of paper in this application a statement by the departmental promotion committee clearly specifying those details of a candidate s educational and experiential qualifications that constitute equivalency to the terminal degree. Give the dates for time in each rank at Rowan. Instructor: Instructor Dept. of Mathematics, 2010 2014 Assistant Professor: _ Instructor Dept. of Mathematics, 2010 2014 Associate Professor: _ Visiting Lecturer 2018 Date of appointment to {gsttvte 439°. Date of tenure at coreges _ May 24, 2012 Recapitulation of all employment (See Rowan University Personne! Resume for details, Item 5) 5 Total years college teaching experience 31 Total years other teaching experience No Early Childhood levels No Elementary levels Yes _ Secondary levels 17 Total years collegiate administrative experience 8 Total years other relevant experience i e., business, industry, government, ete.)"
    },
    {
        "image": "facultypromotion2_synth_20_aug2.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION: POR 84¢ ULTY PROMOTION Nanie _ Stephanie Jackson Deparsnent: Gepariment of aglish Thave compton fered heh ©: Will cumeleie the minioweg ENE vaySeIf G0 be ligihie Fan py LX sasietians Profesar ihe aon Thomas Webb Dare ve Condidag regviewn romation te, \"for the acadeatic rank checks befow, wa Menciate Protester Prsteseey o ~. Warren Wilson, e s Signature: Nomiiotors Signotire Shes! deproe okt Eg 6, Fas sppropeince tennina verifjnng decamens this box, degsee hiss been conmteced tase 6 5 8 a8 the ne: 20 yee aw hesis of paper inh Check th tigitst ty SOF pronation: X ite Bee,\" explain ts itty 7H the eisateses syne of cligibitiy wis ites 38 the ext sce of paper in thig aplication a SecTHea by ibe depsrimental promotion a nitce clearly specifying those deus on MNMond and experiential quatificaions dhe SESHate squivithency vo the teomial degree Give the dates for time i Dae at Rowan, Fastrneter; Assistant Profesee Ahematics. 240 2014 Ascociate Professor; Visiting Lecturer 2078 Date of appointment ty Bene 28 ate ot BMUTC SE cowgen May 24 2012 Recapioutarson we aff by Smpiasriene Uthversity Henw, wie for detasts, cllege teaching Sats other teaching experience Eaily Chilohood ievels Shementary fevers Seeondasy loves Total jears od item $y experience: 4 adetinistratise expericace s0vemene experionce elev tic, Business, industry, i"
    },
    {
        "image": "facultypromotion2_synth_20_aug3.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICA THEY FOR Pacny ry PROMO? TaN 1 Name: Stepnanie Jackson bee: June artnet Departmen: af Bag fh thave compte 5 believe ted Ge Will aploie tie erie it SYSEIE LO be lig hho fe promotion Foquizecnts ERE TANK checked fect X Astistans Professor assnctate Profesor Cet 08 2044 Thomas Webb Bate is Professor \"Warren Wilson tubsdate s Signature Norivinaton s Siamatnre 4 $8. termini dopree tas beep awarded enter ne ROMS as the next shoes of a: ABST 1 his apphcuiion and check ii f. Check CHEIBELHY foe psesmration X Regutar HF the equivaten Ble RoNt sheet OF paper in tig application 2 0 ele, 98 those dows oF a candidate s stil deere Ge, ey 6 the tase, tbe estes for tise ip cack maak at Rowan, Enatractar: fasiruet Assistant Profesear: ip Asso0e Peageese: Visiting Lees MISE 2648 Bate of SppOMRETICS te sta Bo 50 Date of Hite atc SP Wistttion of ol ecestoy wens (See Rowan University Pex Tne! Rew foe dexaite, teme $) 5 Tab SS cllegsceaching capone Fa 7 jis! eats other teaching sapien No Chikthoon fovets leveis : Sorondsry levels 1? Fetal years coliepiate ai spetionce Total years other Betoviane exp aseys, indusny, porience: fas goverment a"
    },
    {
        "image": "facultypromotion2_synth_20_aug4.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION Step? nie Jackson «:_ Departme! Hi ntot Engiis will complete the HE Assistant Professor Thomas Car Ed D. propriaie terminal aut has ng documents thishox. Check the eligibitiey for p HemOathes.” exp Whe ey statement educational and experientia! g Give the dates for time in each rank ut insti Fnstrecto Assisiant Professor: Assstiate Professor, _Visiing Lecturer 2018 Date of appointment wo [evtute 42 59 tion of atl eoptayms Personne’ Resume Ei “Foti yours oth No No didate s Sigeat struck years calle; FOR FACULTY PROMOTION Date: dune 07, 2018 puniinwa restuirements for the wademi tne promotion te: Associate Brofescer Professor Webb s Warren Wilson Nominater s Signature nat yet awarded, enter application and sop wa, Date of tenure st cotpea _ May 24, 2012 for details, Hens 5) ge experience ondary I"
    },
    {
        "image": "facultypromotion2_synth_20_aug5.png",
        "label": "facultypromotion",
        "ocr_text": "APPLICATION POR FACULTY PROMOTION te Name: Stepharie Jackson Deparment Cepartment of English Thave compicted or wail complcte the aummnuss requirements for the araden 1 awt I behe: uation 1 sank checked below LX Assistant Profesor __ Associate Prafessor Professor Bate ‘Candidate s Surat t dearee heki_ EA 0. 1S an appropriate terminal deze has been completed but nat ret avanded, enter voritymg documents as the next sheets of paper in this appiigation and check this box OX Regater Other Chock ihe eligibility for promot WoOther,” cxpiawm bref 1s used, eater as the nest sleet of paper on thes ifthe oquivatency type of etrgitit atec etearty spevitying those die statement by the depsrtinental promotion educational andl cxperemiial qualificst that constitute €4 Give tive dates for time ta eacts rank at Rowan instructor Dept. of Mathematics, 2040 201 ioatruc Oct 06. 2041 Thomas Webb «Warren Wilson Rominaicr s Signatite f epptication a of s caraltdates Assistent Professor: _ SiTUCtO! athernates, 2010 2014 Amocixte Protesce, _ Visiting Lecturer 2018 Dote of appointnicnt to KE B92 Date uf tenste at comps May 24, 20 Recapttuterion of all enplazment (See Rowan Uneversity Perwnnct Rennie for details, Wer 32 5 Tora yer college teaching experience 3 Tow! years other teaching eapencees No haan fevels Nov 7 ves. Lotat years collegiate adimmistratyc 8 Total years other nfevart expertenss arent ete}"
    }
]