[
    {
        "image": "financialstatement1_synth_10_aug1.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UIVERSiT Y E STATEMENT Second eet FAY 2024 2028 Assessment Hement sho AL TUE WS You NT Program: BS inforr on Year i “evel First Year Assessment Hod: Getober November TUITION CHARGES: Academic rOlled: 4 Rats per Unit 2 500 Basic Tuition: P40 000 9 tory Fee (3 subjects) 3 000 00 ratory 2 509 05 Internet A eness F 1 000 00 Student PS00 00 300 01 etotor 25, 2 25 Third er 24, 2025 Late pay: charge. \"Please seltie ace Second Instaiime: November 24, fant incurs 2% counts on time,"
    },
    {
        "image": "financialstatement1_synth_10_aug2.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment HEATHER first name (given name) BROWN Jast name (surname) e_2022 89116 _ ‘Student ID Number Technology Year Level: First Year Assessment Period: October November 2025 TUITIO! CHARGES: Academic Units Enrolled: 16 IN units Rate per Unit: p: 500 Basic Tuition: P40 000 00 OTHER FEES: Laboratory Fee (3 Subjects) .. se Computer Laboratory Fee P2 500 00 Internet Access Fee Activities Fee P800 00 Development Fee see P 1 500 00 Energy Fee Installment Plan: 3 First Installment: P15 121 00 October 25, 2025 : -00 November 24, 2025 Third Installment: p4 5 121. ber 24, 2025 Late Payment incurs 2% Monthly Surcharge. Please settle accounts on time."
    },
    {
        "image": "financialstatement1_synth_10_aug3.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY TUITION FEE STATEMENT Second semester, AY 2024 2025 Official Assessment BROWN HEATHER 2022 89116 __— Firat name (given name) Student ID Number Jast name (surname) hows your official tuition and fee assessment for the semester. This statement st m: BS Information OFFICIAL TUITION ASSESSMENT Progra! Technology Year Level: First Year Assessment Period: October November 2025 TUITION CHARGES: ‘Academic Units Enrolled: 16 units Rate per Unit: P2 500 Basic Tuition: 40 000 00 OTHER FEES: Laboratory Fee (3 subjects) _.. P3 000 00 Computer Laboratory Fee ---.-- wee 2 500 00 Internet Access Fee we 1 000 00 Student 800 00 Activities Fee -. Development Fee 1 500 00 Energy Fee Identification Car os 100 00 TOTAL AMOUNT DUE: ENT OPTION Full Payment: On or before November 09, 2025 Installment Plan: 3 equal payments First Installment: 15 121 00 October 25, 2025 Second Installment: 15 121 00 November 24, 2025 Third Installment: 15 121 00 December 24, 2025 Late payment incurs 2% monthly surcharge. Please settle accounts on time."
    },
    {
        "image": "financialstatement1_synth_10_aug4.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment BROWN HEATHER pe_2022 89116 last name (surname) first name (given name) ‘Student ID Number This statement shows your official tuition and fee assessment for the semester. OFFICIAL TUITION ASSESSMENT Program: BS Information Technology Year Level: First Year Assessment Period: October November 2025 TUITION CHARGES: Academic Units Enrolled: 16 units Rate per Unit: 2 500 Basic Tuition: 40 000 00 OTHER FEES: Laboratory Fee (3 subjects) 3 000 00 Computer Laboratory Fee .. 2 500 00 Internet Access Fee 1 000 00 Student Development Fee 1 500 00 Energy Fee Identification Card 9 100 00 TOTAL AMOUNT DUE: P45 365 00 PAYMENT OPTIONS: Full Payment: On or before November 09, 2025 Installment Plan: 3 equal payments First Installment: 15 121 00 October 25, 2025 Second Installment: 15 121 00 November 24, 2025 Third Installment: 15 121 00 December 24, 2025 Late payment incurs 2% monthly surcharge. Please settle accounts on time."
    },
    {
        "image": "financialstatement1_synth_10_aug5.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNF RSITY TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment HER Wn festt nate (ouraame) This statement shows your official nition and fee assessment kx the semester OFFICIAL TUITION ASSESSMENT Program: 8S information Technology Year Level: First Year Assessment Period: October November 2025 TUITION CHARGES: Academic Units Enrolled: units Rate per Unit: ®2 560 Basic Tuition: 940 000 90 OF HER FEES: Laboratory Fee (3 subjects) . 3 000 56 Computer Laboratory Fee an amet Access Fea sree. 4 000 00 Student 800 00 Development Fee 1 500 00 Energy Fon loation Card .. we cor PI90 06 AMOUNT DUE: 945 36! y Full Payment: On or before Novernber 09, 2025 insiailment Plan: 3 eqjual payments First installment: 15 424 00 October 25, 2025 Second Installment: 15 124 66 Novembar 24, 2025 Third instalment: 15 121 00 December 2. 025 Late payment incurs 2% le accounts on time."
    },
    {
        "image": "financialstatement1_synth_1_aug1.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY SCHOLARSHIP GRANT STATEMENT Scholarship Program Details Academic Year 2024 2025 ATKINS _ ;SAMANTHA 2021 91814 Jast name (surname) first name (given name) Scholar ID Number This statement confirms your scholarship grant coverage for the current semester SCHOLARSHIP GRANT DETAILS Scholarship Type: Dean s List Scholarship Grant Period: First Semester, AY 2025 2026 Status: ACTIVE TUITION AND FEE ASSESSMENT: Total Tuition and Fees cee 55 355 00 SCHOLARSHIP Tuition Fee (100%) 38 748 00 .. P16 606 00 Miscellaneous Fees (100%) .. . TOTAL SCHOLARSHIP GRANT: 55 354 00 STUDENT RESPONSIBILITY: Amount Not Covered by Scholarship 1 00 Less: Payments Made sessesessenseeneeees 13 860 00 BALANCE TO 13 859 00 SCHOLARSHIP TERMS AND CONDITIONS: Maintain a General Weighted Average of 1 75 or higher Complete 17 units per semester No failing grades in any subject Comply with all scholarship program requirements Submit progress report every semester Failure to meet requirements will result in scholarship revocation. For concerns, contact the Scholarship Office at scholarship university edu ph. BE PAID:"
    },
    {
        "image": "financialstatement1_synth_1_aug2.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY SCHOLARSHIP GRANT STATEMENT Scholarship Program Details Academic Year 2024 2025 SAMANTHA ye_2021 91814 name (surname) first name (given name) Scholar ID Number This statement confirms your scholarship grant coverage for the current semester. SCHOLARSHIP GRANT DETAILS Scholarship Type: Dean s List Scholarship Grant Period: First Semester, AY 2025 2026 Status: ACTIVE TUITION AND FEE ASSESSMENT: Total Tuition and Fees 55 355 00 SCHOLARSHIP 38 748 00 .. P16 606 00 Miscellaneous Fees (100%) we TOTAL SCHOLARSHIP GRANT: 55 354 00 STUDENT RESPONSIBILITY: Amount Not Covered by Scholarship P1 00 Less: Payments Made 13 860 00 BALANCE TO BE PAI 13, 859 00 SCHOLARSHIP TERMS AND CONDITIONS: Maintain a General Weighted Average of 1 75 or higher Complete 17 units per semester No failing grades in any subject Comply with all scholarship program requirements Submit progress report every semester Failure to meet requirements will result in scholarship revocation. For concerns, contact the Scholarship Office at scholarship university edu ph."
    },
    {
        "image": "financialstatement1_synth_1_aug3.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY SCHOLARSHIP GRANT STATEMENT Scholarship Program Details Academic Year 2024 2025 ATKINS SAMANTHA e _2021 91814 last name (surname) first name (given name) ‘Scholar ID Number This statement confirms your scholarship grant coverage for the current semester SCHOLARSHIP GRANT DETAILS Scholarship Type: Dean s List Scholarship Grant Period: First Semester, AY 2025 2026 Status: ACTIVE TUITION AND FEE ASSESSMENT: Total Tuition and Fees core: 55 355 00 SCHOLARSHIP COVERAGE: Tuition Fee (100%) 38 748 00 .. P16 606 00 TOTAL SCHOLARSHIP GRANT: P55 354 00 STUDENT RESPONSIBILITY: +» Amount Not Covered by Scholarship 1 00 Less: Payments Made --se« 13 860 00 BALANCE TO BE PAID: P 13 859 00 SCHOLARSHIP TERMS AND CONDITIONS: Maintain a General Weighted Average of 1 75 or higher Complete 17 units per semester No failing grades in any subject Comply with all scholarship program requirements Submit Progress report every semester Failure to meet requirements will result in scholarship revocation. For concerns, contact the Scholarship Office at Scholarship university edu ph."
    },
    {
        "image": "financialstatement1_synth_1_aug4.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY SCHOLARSHIP GRANT STATEMENT Scholarship Program Details Academic Year 2024 2025 1 SAMANTHA first name (given name) ATKINS __me_2021 91814 last name (surname) ‘Scholar ID Number This statement confirms your scholarship grant Coverage for the current semester. SCHOLARSHIP GRANT DE Scholarship Grant Period: Fi Total Tuition and Fees P55 355 00 SCHOLARSHIP COVERAGE: Tuition Fe e (100%) P 38 748 00 - P16 606 00 Miscellaneous Fees (100%) TOTAL SCHOLARSHIP GRANT: P 55 354 00 STUDENT RESPONSIBILITY: Amount Not Covered by Scholarship P1 00 Less: Payments Made a P13 860 00 BALANCE TO TERMS AND CONDITIONS: ighted Average of 1 75 or higher Complete 17 units per semester No failing grades in any subject Comply with all scholarship program requirements Submit Progress report every"
    },
    {
        "image": "financialstatement1_synth_1_aug5.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY SCHOLARSHIP GRANT STATEMENT Scholarship Program Details Acadernic Year ATKANS SAMANTHA ___ _ __ name (grver mane) “Tost manwe (surname) Scholarship Grant Period: First Semest 2024 2025 pe DOU 9N4_ ‘Sctenar ID Number ‘This statement confirms your scholarship grant coverage foe the current semester SCHOLARSHIP GRANT DETAILS Scholarship ‘Type: Dean s List er, AY 2025 2026 Status: Total Tuition and Fees ACTIVE TUITION AND FEE ASSESSMENT: SONERAGE. Tuition Fee (100%) JOTAL SCHOLARSHIP GRANT. RESPONSIBILITY: Amount BE PAID: Maintain a Generai Weighted Averag® grades in any subject Comply with al units per semester No failing scholarship program requirements quirements will result in scholarship ct the Scholarship Office at semester Failure to meet re revocation. For concerns, contat scholarship university edu ph. _ P38 748 00 13 860 00 BALANCE TO of 1 75 or higher Complete 17 Subrnit progress report every"
    },
    {
        "image": "financialstatement1_synth_2_aug1.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN SCHOLARSHIP GRANT STATEMENT Scholarship Program Details Academic Year 2024 2025 BOYD 1 SEAN _E. 2020 29539 Jast name (surname) first name (given name) Scholar ID Number This statement confirms your scholarship grant coverage for the current semester. SCHOLARSHIP GRANT DETAILS Scholarship Type: Athletic Scholarship Program Grant Period: First Semester, AY 2025 2026 Status: ACTIVE TUITION AND FEE ASSESSMENT: Total Tuition and Fees we 50 267 00 SCHOLARSHIP COVERAGE: Tuition Fee (1 00%) 35 186 00 P7 540 00 Miscellaneous Fees (50%) wee TOTAL SCHOLARSHIP GRANT: 42 726 00 STUDENT RESPONSIBILITY: Amount Not Covered by Scholarship 7 541 00 Less: Payments Made 9 139 00 BALANCE TO BE PAID: P 1 598 00 SCHOLARSHIP TERMS AND CONDITIONS: Maintain a General Weighted Average of 1 75 or higher Complete 16 units per semester No failing grades in any subject Comply with all scholarship program requirements Submit progress report every semester Failure to meet requirements will result in scholarship revocation. For concerns, contact the Scholarship Office at scholarship university edu ph."
    },
    {
        "image": "financialstatement1_synth_2_aug2.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN SCHOLARSHIP GRANT STATEMENT Scholarship Program Details Academic Year 2024 2025 BOYD 7 SEAN e_2020 29539 last name (surname) first name (given name) Scholar ID Number This statement confirms your scholarship grant coverage for the current semester SCHOLARSHIP GRANT DETAILS Scholarship Type: Athletic Scholarship Program Grant Period: First Semester, AY 2025 2026 Status: ACTIVE TUITION AND FEE ASSESSMENT: Total Tuition and Fees .. 50 267 00 SCHOLARSHIP COVERAGE: Tuition Fee (100%) P35, 186 00 .. P7 540 00 RESPONSIBILITY: Amount Not Covered by Scholarship ... P7 541 00 Less: Payments Made 9 139 00 BALANCE TO 1 598 00 SCHOLARSHIP TERMS AND CONDITIONS: Maintain a General Weighted Average of 1 75 or higher Complete 16 units per semester No failing grades in any subject Comply with all scholarship program requirements Submit progress report every semester Failure to meet requirements will result in scholarship revocation. For concerns, contact the Scholarship Office at scholarship university edu ph."
    },
    {
        "image": "financialstatement1_synth_2_aug3.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN SCHOLARSHIP GRANT STATEMENT Scholarship Program Details Academic Year 2024 20 first name fast name (surname) uv scholarship giar T DETAILS Scholarship Type: Athletic tod: First Semester, AY 2025 2028 =SSMENT: Total Tuition ard 287 00 Schciarshin ACTW RESPONSIBILITY: Amount Not 7 544 00 Less: Payments Made onus00 9 139 00 BALANCE TO TERMS AND CONDITION! BE PAID Maintain a General Weighted units per semester No failing grades scholarship program requirement Submit pragre semester Failure to meat re urements will result revocation. For concerns: contact the Scholarship Office at acholarshi: @university. report every nelarship duph"
    },
    {
        "image": "financialstatement1_synth_2_aug4.png",
        "label": "financialstatement",
        "ocr_text": "UNIVER SCHOLARS ANT STATEMENT scholarship Program De Academic Year 2024 2! esate fist name quven names nn Fea (190%) P35 18 RESFONS BILNT BE PAID: PS Maintain a Gener unis par semest schoia Shig pr semester ESM ueve"
    },
    {
        "image": "financialstatement1_synth_2_aug5.png",
        "label": "financialstatement",
        "ocr_text": "ITY OF THE PHILIPPINES UNIVERS DILIMAN SCHOLARSHIP GRANT STATEMENT ‘ogram Details 1 2024 2025 ie. 2020 29539 Scholar ID Number Scholarship Pr Academic Yea SEAN BOYD first name (given name) Jast name (surname) statement confirms your scholarship grant coverage for the current semester. Thi SCHOLARSHIP GRANT DETAILS Scholarship Type: Athletic Period: First Semester, AY 2025 2026 Scholarship Program Grant Status: ACTIVE TUITION AND FEE ASSESSMENT: Total Tuition and 50 267 00 Miscellaneous Fees (50%) . TOTAL SCHOLARSHIP GRANT: 42 726 00 STUDENT RESPONSIBILITY: Amount Not Covered by Scholarship _.. P7 541 00 Less: Payments Made 9 139 00 BALANCE TO TERMS AND CONDITIONS: e of 1 75 or higher Complete 16 any subject Comply with all gram requirements Submit progress report every semester Failure to meet requirements will result in scholarship revocation. For concerns, contact the Scholarship Office at scholarship university edu ph. 598 00 SCHOLARSH! neral Weighted Averag! ster No failing grades in BE PAID: P 1,, Maintain a Ge units per seme! scholarship pro:"
    },
    {
        "image": "financialstatement1_synth_3_aug1.png",
        "label": "financialstatement",
        "ocr_text": "ATENEO DE MANILA U NIVERSITY ENT SCHOLARSHIP GRANT STATE! Scholarship Program Det Academic Year 2024 2025 eR PETER 0 First mum {gives matte? (sureiarae! want co uirent sem iarship Type: Dean s List Staius rant Period: First Seme EE ASSESSM oat Tuition and Fees weve. 29 235 00 297 00 Nv a0! nes TOTAL SCHGLARSHI ++ Amour, Not Covere P3 193 00 90 STUD dy enis Made 06 BALANCE TO RMS AND CONDITIONS: equiremant ip prograr 6 will result in scholarshin er Fail co mest require 8 wil 7. For concerns. contact the Scholarship Office at @du oh."
    },
    {
        "image": "financialstatement1_synth_3_aug2.png",
        "label": "financialstatement",
        "ocr_text": "ATENEO DE MANILA UNIVE RSITY SCHOLARSHIp GRANT STATE ENT Schol, larshig Program Detalis Academic Year 2024: 2025 last meine (sermncs Risse anee igtven te This stiste OnRIMS Your schotarsti grant covers SCHOLARSHIP GRANT DETans Scholarshi Scholarship Grant Period: F UP Type: Dean s List ee TUITION AN st Semester, Ay 2025 2028 Status: D FEE ASSESSMENT: Total 7. Tultion and Peas 1786 00 SCHOLAP SH HEP 50 i) céllangous TOTAL SCHOLAR RESPONSy 29 235 00 -- P9 397 00 8 632 00 STUD Y Covered by Schola: arship 3 133 00 Lass: Payments Made P10, 340 05 50 BALANCE To TERMS AND CONDITIONS: of 2 00 or higher Comos 880m any subject Comply wi ais 3 Submit Progress rep, re to meet fequiramanty result ir Schivlarship ncerns, comact the Scholarship Office at P university -2du pt TCLARSHIP ghted Avarag, fester “No tailing gract Program requirem: Scholar hip"
    },
    {
        "image": "financialstatement1_synth_3_aug3.png",
        "label": "financialstatement",
        "ocr_text": "ATENEO DE MAI ILA UNIVERS RSHIP GR/ Scholarship Program Dete cademic Year 2024 2025 2 PE Number ame) fir or the current semester pe: Dean s L ENT: Totat Tuition and F: centres 44 785 00 SCHOLARSHIP 29 235 00 0 207 00 TOTAL SCHOLARSHIF ESPONSIBILITY: Amour 1 Covered BE PAID: ®-7 TERMS AND COND: Main’ hied Average of 2 00 a1 ver Gor units per iG grace: PTIONS: 2 17 agress report every in scholarship ns, comact the Scholarship Office at"
    },
    {
        "image": "financialstatement1_synth_3_aug4.png",
        "label": "financialstatement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY SCHOLARSHIP GRANT STATEMENT Scholarship Program Details Academic Year 2024 2025 PARKER PETER g_ 2021 68236 Jast name (surname) first name (given name) Scholar ID Number This statement confirms your scholarship grant coverage for the current semester. SCHOLARSHIP GRANT DETAILS Scholarship Type: Dean s List Scholarship Grant Period: First Semester, AY 2025 2026 Status: ACTIVE TUITION AND FEE ASSESSMENT: Total Tuition and Fees 41 765 00 SCHOLARSHIP 29 235 00 Miscellaneous Fees (75%) TOTAL SCHOLARSHIP GRANT: 738 632 00 STUDENT RESPONSIBILITY: Amount Not Covered by Scholarship .. P3 133 00 Less: Payments Made ceseeeatesesetessesieeesssiteesssiteesssiteesisiteatistensasiteas P10 340 00 BALANCE TO BE PAID: P 7 207 00 SCHOLARSHIP TERMS AND CONDITIONS: Maintain a General Weighted Average of 2 00 or higher Complete 17 units per semester No failing grades in any subject Comply with all scholarship program requirements Submit progress report every semester Failure to meet requirements will result in scholarship revocation. For concerns, contact the Scholarship Office at scholarship university edu ph."
    },
    {
        "image": "financialstatement1_synth_3_aug5.png",
        "label": "financialstatement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY SCHOLARSHI e GRANT STATEME Scholarship Program Details Academic Year 2! This state SCHOLARSHIP GRANT DETAILS Scholarship Type: Dean s List Scholarship Grant AY 2028 2025 Status: ial Tuition and Fees. SCHOLARSHIP 5 00 2 397 00 Miscellaneous Fe: on ori TOTAL SCHOLARSHIP GRAN 2 06 STUDENT RESPONSIBILITY: Amount Not Covered by Scho i .. 3 133 90 Less: s Made cou secre P10 340 00 BALANCE TO RSHIP TERMS AND CONDITIONS: higher Cornpiete 17 with all ip program requirements Subn gress report every Failure io meet requirements dlarship ems, contact the Scholar ice at"
    },
    {
        "image": "financialstatement1_synth_4_aug1.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment 1021 ALEE ROBERT ________® first name (given Bonet? statement shows your official tutron and fee assessment for Te semester This AL TUITION ASSESSMENT Program: BS Psychology Yeer OFFIC! Level: Third Year Assessment Period: October November 2025 TUITION CHARGES: Academic Units Enrotied: 20 units Rate per Unit: 92 009 Basic Tuition: 40 000 00 OTHER FEES: Laboratory Fee (2 subjects)... er _ 5 000 00 Computer Laboratory Fee 2 500 60 internet Access Fee seesesenensen 4 000 90 Student Activities Fee 800 00 Development Fee Energy Fee 9600 00 identification Card deceeeececetoeseneesanentses vesuanenavacenssseseceesenecseecenersnensts 100 00 TOTAL AMOUNT DUE: 947 655 09 PAYMENT OPTIONS: Full Payment: On or before November 03, 2025 instaliment Plan: 3 equal payments First Installment: 15 885 00 October 19, 2025 Second instalment: P 15 885 00 November 48, 2025 Third Installment. 15 885 00 December 18, 2025 Late payment incurs 2% monthly surcharge. Please settle accounts on time."
    },
    {
        "image": "financialstatement1_synth_4_aug2.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY TUITION FEE STATEME! Second Semester, AY icial Assessment 2 FEES: Laboratory .. 5 006 00 Computer .. 2 500 00 ooo 00: 9 Student Activities Fe .. 800 00 Developrnent 41 500 00 -"
    },
    {
        "image": "financialstatement1_synth_4_aug3.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY NT TUITION FEE STATE Second Semester, AY 2024 2025 Official Assessment is 5 your official tution and fee assessme? OFFICIAL T UITION ASSESSMENT Program: BS P Year Assessment Period: October Mi TUITION CHARGES: Academic Units Enrolled: 20 t its Rate per Unit: B2 000 Basic Tuition: P40 000 00 OTHER FEES: Laboratory Fee (2 subjects 5 000 00 Computer Laboratory 2 500 00 internet At 1 000 0 800 00 Development _. 4 500 00 400 00 TOTAL Full Payment: On 3 equal payments f PTIO before Novernber 03, 2025 Installment Plar First installment: 15 865 00 Cotoder 19, 2025 Second instaliment: 45 885 00 November 16, 2025 Third Installment: 45 885 00 December 18, 2025 Late payment incurs 2% monthly surcharge. Please 3 time."
    },
    {
        "image": "financialstatement1_synth_4_aug4.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment pp 2021 49606 TUCKER L ROBERT Student ID Number ICKER Jast name (surname) first name (given name) .ssment for the semester. BS Psychology Year Level: Third Year Assessment lovember 2025 TUITION CHARGES: Academic Units Enrolled: 20 units Rate per Unit: 2 000 Basic Tuition: 40 000 00 OTHER FEES: Laboratory Fee (2 subjects) ...- 5 000 00 Computer Laboratory Fee 2 500 00 Internet Access Fee 1 000 00 Student Activities Fe ‘This statement shows your official tution and fee asse: 800 00 Development 1 500 00 Fee Energy Fee 600 00 Identi ation Card veseeeeeessterente? 100 00 TOTAL 3 56 00 PAYMENT OPTIONS: Full Payment: On or before November 03, 2025 Installment Plan: 3 equal payments First Installment: 15 885 00 October 19, 2025 Second Installment: 15 885 00 November 18, 2025 Third Installment: 15 885 00 December 18, 2025 Late payment incurs 2% monthly surcharge. Ple: settle accounts on time. ase"
    },
    {
        "image": "financialstatement1_synth_4_aug5.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment TUCKER ROBERT IE. 2021 49666 last name (surname) first name (given name) Student ID Number This statement shows your official tuition and fee assessment for the semester. OFFICIAL TUITION ASSESSMENT Program: BS Psychology Year Level: Third Year Assessment Period: October November 2025 TUITION CHARGES: Academic Units Enrolled: 20 units Rate per Unit: 2 000 Basic Tuition: 40 000 00 OTHER FEES: Laboratory Fee (2 subjects) 5 000 00 Computer Laboratory Fee P2 500 00 Internet Access Fee 1 000 00 Student Activities Fee 800 00 Development ... P1 500 00 Fee .. Energy Fee 600 00 Identification Card P100 00 TOTAL NS: Full Payment: On or before November 03, 2025 Installment Plan: 3 equal payments First Installment: P15 885 00 October 19, 2025 Second Installment: 15 885 00 November 18, 2025 Third Installment: P15 885 00 December 18, 2025 Late payment incurs 2% monthly surcharge. Please settle accounts on time. AMOUNT DUE: P47 656 00 PAYMENT"
    },
    {
        "image": "financialstatement1_synth_5_aug1.png",
        "label": "financialstatement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment MICHAEL first name (given name) BURGESS last name (surname) _pe__2021 79010 ‘Student ID Number Laboratory Fee ... Internet Access Fee P 1 000 00 Student"
    },
    {
        "image": "financialstatement1_synth_5_aug2.png",
        "label": "financialstatement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY TUITION FEE STATEMENTS Second Semester, ay 2624 2025 Official Assessment Sr Shows your official tuition are fee assessment SEP ICHAL TUITION ASSESSMENT F First for thes Units Er Unit: B41 gn Basic T 0 00 OTHER (2 subjects) G Computer 82 500 00 velopment 300 00 - P8000» De . P45 MOUNT Oui OF before A Payment: Ge 3 equal Paymants cond lnstaliment: ment: P41 476 09 Seifle accounts an tine,"
    },
    {
        "image": "financialstatement1_synth_5_aug3.png",
        "label": "financialstatement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment MICHAEL first name (given name) BURGESS Jast name (surname) m_2021 79010 ‘Student ID Number This statement shows your official tuition and fee assessment for the semester. OFFICIAL TUITION ASSESSMENT Program: AB Political Science Year Level: First Year Assessment Period: October November 2025 TUITION CHARGES: Academic Units Enrolled: 15 units Rate per Unit: P1 800 Basic Tuition: 27 000 00 OTHER FEES: Laboratory Fee (2 subjects) 5 000 00 Computer Laboratory Fee .. 2 500 00 Internet Access Fee .. 1 000 00 Student Activities Fee 800 00 Development --. P1 500 00 P100 00 TOTAL NT OPTIONS: Full Payment: On Installment Plan: 3 equal payments November 01, 2025 Second Installment: 25 Third Installment: P14 ,476 00 ent incurs 2% monthly surcharge. Please or before November 16, 2025 First Installment: 11 476 00 P11 476 00 December 01, 20 December 31, 2025 Late paymi settle accounts on time."
    },
    {
        "image": "financialstatement1_synth_5_aug4.png",
        "label": "financialstatement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment BURGESS y MICHAEL e_2021 79010 Jast name (surname) first name (given name) Student ID Number This statement shows your official tuition and fee assessment for the semester. OFFICIAL TUITION ASSESSMENT Program: AB Political Science Year Level: First Year Assessment Period: October November 2025 TUITION CHARGES: Academic Units Enrolled: 15 units Rate per Unit: P1 800 Basic Tuition: 27 000 00 OTHER FEES: Laboratory Fee (2 subjects) P5 000 00 Computer Laboratory Fee ... 2 500 00 Internet Access Fee cccecescecessesesesesneseseseeneseeeseeeseetesesteseee P 1 000 00 Student Activities Fee P800 00 Development P1 500 00 Energy Fee P600 00 Identification Card 100 00 TOTAL AMOUNT DUE: 34 428 00 PAYMENT OPTIONS: Full Payment: On or before November 16, 2025 Installment Plan: 3 equal payments First Installment: P11 476 00 November 01, 2025 Second Installment: 11 476 00 December 01, 2025 Third Installment: P 11 476 00 December 31, 2025 Late payment incurs 2% monthly surcharge. Please settle accounts on time."
    },
    {
        "image": "financialstatement1_synth_5_aug5.png",
        "label": "financialstatement",
        "ocr_text": "ERSITY TUITION FE STATEMENT cond Ser 2024 2025 Offich Level. Year A TUITION CHARS e 45 unlis Rate p P7800 Be 2 006. Labor intemet Access Fee P 1 006 00 Student Ac! A JNT DU 34 42) or before November 16, 2 First installment: 11 476 61 P74, 476 00 Dece settle accot ale payment i Ss on time. curs 2% monthly surcharge, Pi"
    },
    {
        "image": "financialstatement1_synth_6_aug1.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment tse tumaaoe) ent shows you official lution and fee assess 2NT Program: &S Accountancy Year ar October 2025 26 units Rate per Laboratory This st OFFICIAL TUITION ASS Level: Sasond Year As TUITION CHARGES: Academic Linkts Ene internel Access Fee .. #4 900 00 Student Activities Fes 4550 00 FAB oe Energy Fe identification cous 100 00 TOTAL T OPTIONS: Full Payrnent On art Plan: 3 equat payments October 0G, 2025 Seeand install talent, P15, 92! %, monthly surcharge. Please AMOUNT or before October 24, 2025 Installs ingtaliment: £45 925. 15 925 00 November 08, 2028 Third Decernber 08, 2025 Late payment incurs setiie accounts on time"
    },
    {
        "image": "financialstatement1_synth_6_aug2.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS TUITION FEE STATEMENT Second Semester, AY 24 2925 Official Assessment OFFICIAL TU Accountancy c Level: See ‘ear vent Period: tember tory .006 06 Computer 300 00 iment: P15 92 f 5 00 November 66, 202: December 08. nours 2% monthly surcharge. Pisase"
    },
    {
        "image": "financialstatement1_synth_6_aug3.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS UNION FEE STATEMENT Secand Semester, AY 2024 2025 Official Assessment ANS fest name feuraamae) This statement shows vw; OFFICIAL TUITION ASSESSMENT EE Level: Second Year Asse TUITION CHARGES: Ay Unit 2 000 BS Accountancy Year robes 2025 Rate por * Laboratory 2 Computer 2 500 00 ene OBES 329 205 3 00 Student Activ 600 60 Development 7 560 00 P100 00 TOT, 247 775 00 PA MENT OPTIONS: Full Payment: On or before Octobe: 24, 2026 insialinent Pian: 3 equal payments First OG October 09, 2025 Second insialiment: November 08, 2625 Third installment: F45 925 00 ber O8, 2025 Late payment incurs 2%, monthly surchai Settle accounts on tire, Please"
    },
    {
        "image": "financialstatement1_synth_6_aug4.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment ICIAL TUITION ASSESSMENT Program: BS Accountancy Second Year Assessment Period: September October 20 ON CHARGES: Academic Units Enrolled: 20 units Rate per Unit: P2000 Sion: P46 090 00 OTHER FEES: Laboratory 5 000 00 Computer 800 00 Development PT800 06 AMOU T DUE: Bg of before October {nstaliment: 845 02 15 925 00 2 in; instal nent Plan: 3 3 8 equal p October 09, 20) ber 08, 2025 limon th m5 328 Late payment incurs 2% monthly sure! ascounts on tire"
    },
    {
        "image": "financialstatement1_synth_6_aug5.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment FORD ANGELA me. 2021 25268 Jast name (surname) first name (given name) Student ID Number This statement shows your official tuition and fee assessment for the semester. OFFICIAL TUITION ASSESSMENT Program: BS Accountancy Year Level: Second Year Assessment Period: September October 2025 TUITION CHARGES: Academic Units Enrolled: 20 units Rate per Unit: #2 000 Basic Tuition: #40 000 00 OTHER FEES: Laboratory Fee (1 subjects) . P5 000 00 Computer Laboratory Fee ... 2 500 00 Internet AcceSS Fee... cceccccsceeeneteteteeeeeesesestsneneieieeneneiee 1 000 00 Student Activities Fee 800 00 Development P1 500 00 Fee. Energy Fee we 600 00 Identification Card AMOUNT DUE: ?47 775 00 PAYMENT OPTIONS: Full Payment: On or before October 24, 2025 Installment Plan: 3 equal payments First Installment: ®15 925 00 October 09, 2025 Second Installment: 15 925 00 November 08, 2025 Third Installment: #15 925 00 December 08, 2025 Late payment incurs 2% monthly surcharge. Please settle accounts on time."
    },
    {
        "image": "financialstatement1_synth_7_aug1.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY oF SANTO Tomas STATEMENT OF ACCOUNT For Academic Year 2024 2025 First Semester POPE —___» PATRICK me_2021 76147 ven name) Stugent Humber Pease review a charges and payments care TUITION AND FEES SUMMARY Assessment Date: October 16, 2025 Due Date: November 15, 2025 CHARGES: Tuition F (18 units P2 500 unit) --- P50 000 00 Subjects) 10 Contact be Casters Onc or any concen ee P 150 00 Insurance Fee Miscellaneous Fees .. 994 00 TOTAL ASSESSMENT: p56 Payment on October 26, 2025 12 988 00 Payment on Noy P. vember 12, 2025"
    },
    {
        "image": "financialstatement1_synth_7_aug2.png",
        "label": "financialstatement",
        "ocr_text": "16, 2025 Sunits @ 4 00 OG Library Fee 500 00 36 00 BALANCE DUE: 46, 2025, AN fees"
    },
    {
        "image": "financialstatement1_synth_7_aug3.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS STATEMENT OF ACCOUNT For Academic Year 2024 2025 First Semester 2025 5 November 15, 2025 CHARGES: 50 000 00 Laboratory Fee (2 Registration Fee P15G 00 insure aber 12, 2025 43 247 00 TOTAL PAID: valid as of"
    },
    {
        "image": "financialstatement1_synth_7_aug4.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS STATEMENT OF ACCOUNT For Academic Year 2024 2025 First Semester POPE ____. ___ PATRICK —___— __e_ 2021 T6147__ dant nage (swenacee} fired mame (given oamc) ‘Student Number range es ot cargos ana permet BreAIY Contact he Carmen Cfce for terry COTES ober 16, 2025 ES SUMMARY Assessment Date: Oct “TUITION ANG FE! Que Date: November 15, 2025 CHARGES: Tuition Fee (418 units P2 50G unit) _. 950 000 00 Laboratory Fee (2 94 000 00 Library Fee _ £200 00 Medical Dental P400 00 Fee £150 00 Insurance Fee a _ 9250 00 “Ais RECEIVED: god. 00 TOTAL ASSESSME! Payment on October 26, 2025 42 988 00 Payment on November 12, 202 soseeeee 743 247 00 TOTAL PAID: 930 559 00 This statement is valid as of abject to university policies. November 15, 2025. Ali fees are St"
    },
    {
        "image": "financialstatement1_synth_7_aug5.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS STATEMENT OF ACCOUNT Year 2024 2028 First Seme ter a Wa? Fast mame (surames fans ave all Marges ne puymen ent Date. October 16, 2625 * Tuition Fee (48 units tory Fee (2 £4 096 0 Library F £505 90 subjects)... Aner Fee P200 00 Medicai Deniai ZEIVED: his statement ts vatid as ot ct to university"
    },
    {
        "image": "financialstatement1_synth_8_aug1.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment GOODWIN SOEL e _ 2023 49224 last name (surname) first name (given name) ‘Student ID Number OFFICIAL TUITION ASSESSMENT Administration Year Level: Fourth Year November 2025 TUITION CHARGES: Academic Unit units Rate per Unit: 1 800 Basic Tuition: 37 800 00 Laboratory Fee (2 subjects) .. Computer Laboratory Fee ... 2 500 00 Internet Access Fee o 1 000 00 Student 800. ‘Assessment Period: October 1s Enrolled: 21 OTHER FEES: 5 000 00 100 00 TOTAL AMOUNT DUE: P45 276.' YYMENT OPTIONS: Full Payment: On or before November 11, 2025 Installment Plan: 3 equal payments First Installment: 15 092 00 October 27, 2025 Second Installment: 15 092 00 November 26, 2025 Third Installment: 15 092 00 December 26, 2025 Late payment incurs 2% settle accounts on time."
    },
    {
        "image": "financialstatement1_synth_8_aug2.png",
        "label": "financialstatement",
        "ocr_text": "DELA SALLE UNIVERSITY TUITION FEE s Second Semester, Ay 2024 2025 Official Assessment This statement sho MUS YE ial hatton and fee assessment for the semester HAL TUITION A =SSMENT Program: BS By: Administration Year evel: Fourth Year Assessment Period: October November 2025 Tuy TION CHARGES: Avadamic Units Enrolled: 24 ubIS Rate per Unit: 1860 Basic Tuition: &37 300 OO OTHE Laboratory Fea (2 sublecte) Computer ~aboratcry Fee 92 500 00 internat Access Fee cEES PE200 00 7 000 00 Student -. P8G0 00 Aclivities Fee Development Fes 7 500 00 Energy Faa identification Card P100 00 To TAL AMOL Full Payment: Op OF befor: ae payments FE Second instatiment: P45 0 instalment: @4 5 092 06 monthly surcharge, Pig 500 90 OPTIONS iment Plan 2026 November 44, 209% S Ing! December 28, 2095 Late payment incurs 2%"
    },
    {
        "image": "financialstatement1_synth_8_aug3.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment GOODWIN _y SOEL me, 2023 49224 last name (surname) first name (given name) Student ID Number This statement shows your official tuition and fee assessment for the semester OFFICIAL TUITION ASSESSMENT Program: BS Business Administration Year Level: Fourth Year Assessment Period: October November 2025 TUITION CHARGES: Academic Units Enrolled: 21 units Rate per Unit: P1 800 Basic Tuition: P37 800 00 OTHER FEES: Laboratory Fee (2 subjects) P5 000 00 Computer Laboratory Fee ... P2 500 00 Internet Access Fee P1 000 00 Student P800 00 Development Fee P1 500 00 Energy Fee Identification Card cece sees teteeeeetteeseesteeeteeeeeeees 100 00 TOTAL AMOUNT DUE: 45 276 00 PAYMENT OPTIONS: Full Payment: On or before November 11, 2025 Installment Plan: 3 equal payments First Installment: P15 092 00 October 27, 2025 Second Installment: P 15 092 00 November 26, 2025 Third Installment: P15 092 00 December 26, 2025 Late payment incurs 2% monthly surcharge. Please settle accounts on time."
    },
    {
        "image": "financialstatement1_synth_8_aug4.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Assessment GooOWIN 1, SOEL __m 2023 49224 Joa mame (sernatie) ——— Birst name given wanset Student 10 Number This staternent shows your official tuition and fee assessment for the semester. OFFICIAL TUITION ASSESSMENT Program. 8S Business Administration Year Level: Fourth Year Assessment Period: October November 2025 TUITION CHARGES: Academic Units Enrolied: 24 units Rate per Unit: ?'14 809 Basic Turtion: 37 800 60 OTHER FEES: Laboratory Fee (2 subjects. 5 000 00 Computer Laboratery Fee #2 500 06 Internet Access Fes 7 000 00 Student 860 00 Development Fee .. ee 1 500 00 Energy Fee identification ‘Card. P100 00 TOTAL AMOUNT DUE: “PAS 276. Full Payrnent: On or before November 11, 2025 instalment Pian: 3 equal payments First instalment: 15 092 00 October 27, 2025 Second Installment: 15 092 00 November 26, 2025 Third installment: 15 092 00 December 26, 2025 Late payment incurs 2% monthly surcharge. Please settle accounts on time."
    },
    {
        "image": "financialstatement1_synth_8_aug5.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY TUITION FEE STATEMENT Second Semester, AY 2024 2025 Official Asse iver mame? istration Year Level Fo 025 TUITION CHAR: er var PH, 800 Basic Yultion: PSY, 300. OS). 5 000 OO 500 00 Student PS00 00 . BSO0 00 - P45 276 00 PAYMENT OPTIONS: before November 17, 2028 installment FI rent: P15 092 00 October 27, 2025 400 00 TOTA’ i Payment: On cof equal p nis First instail Second in instaliment: monthly s"
    },
    {
        "image": "financialstatement1_synth_9_aug1.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY STATEMENT OF AC COUNT For Academic Year 2024 2025 First Semester J RUTH Yared rome (gieem aeae) fur iy. Contact the Cashier s Oiler for any enncoms, eiober 14, 2025 iis Prease review st it pyrite MMARY mant Date 5, 2025 CHARGES: Tuition Fos (16 uni P27 900 00 Laboratory Fee (2 w.. 5 000 00 TUITION AND FE! Registrati 150 00 Insurar sous Fees TOTAL ASSESSM Payment on Otol we cote ect eeae eteieeeresennesnee P12, 874 00 P: ember 03, 2025 ... BS S07 08 TOTAL PAID: 4 00 This statement is valid as of"
    },
    {
        "image": "financialstatement1_synth_9_aug2.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY STATEMENT OF ACCOUNT For Academic Year 2024 2025 First Semester _ RUTH __ pp 2021 68014 first name (given name) student Number LIVINGSTON _ Jast name (surname) please review all charges and payments carefully. Contactthe Cashier s Office for any concerns TUITION AND FEES SUMMARY Assessment Date: October 11, 2025 Due Date: November 40, 2025 CHARGES: Tuition Fee (18 units P1 500 unit) 27 000 00 Laboratory Fee (2 subjects) 5 000 00 Library Fee cesses 500 00 Athletic Fee see 300 00 Student Council Fee we _ 200 00 Medical Dental Fee Registration Fee 150 00 Insurance Fee 250 00 Miscellaneous Fe 905 00 TOTAL ASSES: 400 00 NT: P34 705 00 PAYMENTS RECEIVED: Payment on October 17, 2025 12 874 00 Payment on November 03, 2025 _. 5 007 00 TOTAL PAID: 824 00 This statement is vali subject to university policies. id as of 17 881 00 BALANCE DUE: P16, November 16, 2025. All fees are s"
    },
    {
        "image": "financialstatement1_synth_9_aug3.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SAL LE UNIVERSITY STATEMENT OF 4 UN? For Academic ear 2024 2025 First TUITION AND FE Dus Date: Novem, P4500 unity S SUMMARY Assessment Dat, 18, 2025 CH RGES: Subjects) PSO Athlet P300 00 § On Octeber ¥. 2006 *, 2028 TAls statemant is y ubieot to university po!"
    },
    {
        "image": "financialstatement1_synth_9_aug4.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY STATEMENT OF ACCOUNT For Academic Year 2024 2025 First Semester LIVINGSTON y RUTH _me_ 2021 68014 last name (surname) first name (given name) Student Number Please review all charges and payments carefully. Contact the Cashiers Office for any concerns. TUITION AND FEES SUMMARY Assessment Date: October 11, 2025 Due Date: November 10, 2025 CHARGES: Tuition Fee (18 units 1 500 unit) 27 000 00 Laboratory Fee (2 subjects) 5 000 00 Library Fee 500 00 Athletic Fee 300 00 Student Council Fee 200 00 Medical Dental P400 00 Fee Registra’ 150 00 Insurance Fee 250 00 Miscellaneous Fees 905 00 TOTAL ASSESSMENT: 34 705 00 PAYMENTS RECEIVED: Payment on October 17, 2025 12 874 00 Payment on November 03, 2025 5 007 00 TOTAL PAID: P17, 881 00 BALANCE DUE: 16 824 00 This statement is valid as of November 16, 2025. All fees are subject to university policies."
    },
    {
        "image": "financialstatement1_synth_9_aug5.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY STATEMENT OF ACCOUNT For Academic Year 2024 2025 First Semester LIVINGSTON _y RUTH ye_2021 68014 last name (surname) first name (given name) Student Number Please review all charges and payments carefully. Contact the Cashier s Office for any concerns. TUITION AND FEES SUMMARY Assessment Date: October 11, 2025 Due Date: November 10, 2025 CHARGES: Tuition Fee (18 units P1 500 unit) P27 000 00 Laboratory Fee (2 subjects) P5 000 00 Library Fee Athletic Fee 300 00 Stu P200 00 Medical Dental 400 00 Registration Fee P150 00 Insurance Fee Miscellaneous Fees 905 00 TOTAL ASSESSMENT: P34 705 00 PAY! Payment on October 17, 2025 12 874 00 Payment on November 03, 2025 sists eeeeeeeeecsseeeeeseetessseeeseeeecstatenaeeses P5 007 00 TOTAL PAID: P17 881 00 BALANCE DUE: P16 824 00 This statement is valid as of November 16, 2025. All fees are subject to university policies."
    },
    {
        "image": "financialstatement2_synth_11_aug1.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft Fee Mania 1004 Accounting and ‘casnienng Offer FINANCIAL STATEMENT PLEASE TYPEOR PRINT CLEARLY KENNEDY STEPHEN Flipno COUNTRY OF CITIZENSIN: ITY This document serves 85 offi! STATEMENT OF FINANCIAL ACCOUNTABIL See ong tne tmanoal account of STEPHEN D. KENNEDY. ShAeT! Number seam g3700, ented n Bachelor of Sounce n Information Teehno Soy. Second Year seme rest Semester, Academe Yea\" 2025 2020, DETAILED FEN, ‘BREAKDOWN: {950 000 00 Laboratory Fees (1 ‘Pation Fee (20 unds 82 500 un8) subjects) 195 057 00 Library and Leaming Resource Fee “p00 00 Student Actwties and Development Fee {9200 00 Medical, Dental, and Health Services Fee ‘9200 00 Athlete and Physical Education Fee “3300 00 Registration and Processing Fee '9150 00 Identfication Card and Validation (9190 00 Insurance Coverage 15250 00 Technology and Intemet ‘31 200 00 Macelaneous Fees Aooess Fee 191 215 00 GROSS TOTAL ‘AggeSSuENT: B58 672 00 FINANCIAL ASSISTANCE: Senowrsn® CMY 1p24, 154 00 Franca Ad Dscount ‘911 050 00 NET AMOUNT PAYABLE: “ntl Payment (August 23, 2025) '910 330 00 Second Payment (September 16, 2025) 1910 373 00 Thad Payment (Octobet 18. 2025) ‘b11 980 00 TOTAL AMOUNT PAID: 32 689 00 sents must be made through authored (923 388 00 PAYMENT RECORD: ‘Al a) 1s for verticaton, Ths statement i vsuue, For verfcaton, please contact he ove of emall 41 2025 at 12 00 AM REMAINING BALANCE: 8 0 301 00 ‘at offeal rece gues n0 sn Oifee at the address indicated a Generated: November channels only Keep ccomputergenerated and ‘Accounting and Cashiern@ france Guniversty 2du 9h. Document"
    },
    {
        "image": "financialstatement2_synth_11_aug2.png",
        "label": "financialstatement",
        "ocr_text": "[FINANCIAL STATEMENT Romaine || ee NS sahiemna OFce Pop nent» KENNEDY 8 ‘county ab certs sane FASE STATEMENT OF FINANCIAL ACCOUNTABILITY This eucument vas as offi! SEPHER D, KEWMEDY. Groen Puraer 2808 58200, enruted in Bachslar af sere in infewnatinn Twchnayy Sever Yaar, afeatin ragavsing ihe Ansnaa acount aS forthe Fist Semester, Acecerne Yea? 2025 2028, OFTAILED FEE BREAKEO 799 000 00 Lanamten, Fes Br00 00 Sas POO. Maat, Dental, ame ‘850010 athlete and Phvsea! Sducaton Fee Hesiin Senioes Fos 5209 00 Fayistvtin und Processing Fee 150 00 idensiewsen Gard and Valawton 18109 29 irsvianee Cover PI80 00 181 200 00 wieeateneous Fa #1 216 09 GROSS TOTAL shiaraiig Grant Aovess Fee AGSESEMENT, B54 572 00 FINANEL 25 189 00 Frances Aid issouns 771 050 60 NET AMOUHT PRYABLE (RECORD: «Waiat Payment August 23 2025 875 468 00 PAN 1210 30 00 Seoond Payineat (Senta 915 293 09 Tht Paovant (Oxtovar 18, 2025) 517 804 69 TOTAL AMOUNT PAID: 832 808 20 REWAIS BOL ANCE. BU, 501 00 BS payments mst be anes rough autho Cexanitels a7, Ng «ofc veces for wanraniin, This stxeonant ie computergenersing and segues no signature, Forwerication, plowse nutact the scouting ana Gachiaring Ose a ha axdvess metated 200 wr erm mance lunicensty auu gh, Bons Cenecatad. overbar 11, 2025 st 1200 Ast"
    },
    {
        "image": "financialstatement2_synth_11_aug3.png",
        "label": "financialstatement",
        "ocr_text": "MINANCIAL STATEMENT VERS, Dati Tan M8 108M kennvrony aoe Meee reas rmsrciecat: PP Nae REHMEDY STEN ok ortgeacuy FR SYATRME OF pmAMees ALCOUMTABA RY Ny witeaten regersny 2 MAE ena Bacnear ot sean fe me Bot Se EPSTERESD KEIMEDY Stinent herber Tele UETALES BEE eMeAr aoe Wonton 20 P00 236 99+ saeatary ees (+ wen Ly and Leaeing Hanon Fae tatont Lhe. 8st Deeigsrent Fone Mato. Dantes 298 iene Senn tn Neat are Pyne’ Eee 9209 C0 Reymestee ant Mesues PI 3 iserateae won es 2 Test nog, cunt ees horeones s PAs owaRE Foray POH 90 Franek deme SO MET ALOUNT Mavagee she Paymens pet 25, 2598 Bone AESRSSMET Mae EZ oo Poaceae BS OD Parade nT ReEcORS Sevens Pyne! Septem it 28+ Tred Ca prmit iCotear 6 20% 280 00 \"UPA, axoRNNT Ras"
    },
    {
        "image": "financialstatement2_synth_11_aug4.png",
        "label": "financialstatement",
        "ocr_text": "{rin IBNCIAL STATEMENT Sane Bante eaten soeaar FUSE OR RHINE EES roeusane, KENNEDY, convran ov craressties FERPA PRUNE, ACCOUNTABILITY This int of STEPHEN, STATEMENT nevieovan REE 3 RENGEDY, Stade Shmbe nuioyy. Secnne Ye FEA BREAKDOWN. Labarwanny Peas Sogsaetan enreies in Bactwies of Soarven in ovis nist Garmavter Beaders Yes 2028 2020 1 eee 28 wine G F280 {9609 00 Susan Sctiies and Dereon 9208 ‘aon Heath Sesion Foe ‘pug 60» Avie aoe Prvsen! Bausaton Foe (0209 96 Regsuation and Pawrseng Pee {5159 50 Inentheatea Cand one Veitatay (2160 90 insviense Covernae ‘5280 09 eoroniegy and intent sexass 91 240 09 hansaianenys Hees 218 08 GROSS TOTAL ISSIgTANCE: Sokelershin Gran \"24 154 90 Fir sia! aibesonent AMOUNT PAYABLE [aSEsougnr ese 972 00 FINANCIAL pei goge jen SECURE inital Fayenans (hegest 24, 2028) ig 386 30 «Segond Paynes’ (Sepia oe! “nd Payment tne |. 228 ign PHD 33 028 08 mute rough aticved pi .abe 99 PAY ives a0 TaN RENAMING UALANCE: ronwats aniy. Keen ob afi reoaints fr vertaation vmeried and rulua ta ygnater, Fer saison, piRENE SOMME Te saan smtny and Cavhineng Ofiee utine sedrese maxatad $50 fnanoagannereazats on, Cncune’ fenarated: Novernier #7, 2029 8 1200 AM"
    },
    {
        "image": "financialstatement2_synth_11_aug5.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Tan FINANCIAL STATEMENT Wvenue, Mania 1004 Accounting wat Cashiemng Office LEASE TYPE OR PRINT cLeaRLy ULL Naw: KENNEDY STEPHEN ‘a amy Sa ot Gey ‘Meo Wa 3 657 00 Liar 1300 00 Registration and Proce, 150 00 ident 100 00 150 000 00 Laboratory Fees (1 HY and Leaming Resource Fee s5ing Fee tiication Card and Vakiation Insurance Coverage 1250 00 Technology and intemet Access Fee 1 200 00 Mscelaneous Fees 1218 00 GRoss ToTAL ASSESSMENT: 958 572 00 FINANCIAL ASSISTANCE. Scholarship Grant 824 154 00 Finang al Ad Discount 11 050 00 NET AMOUNT PAYABLE 975 368 00 PAYMENT RECORD: Initial Payment (augoot se 2025) ‘10 330 00 Second Payment (September 10 2025) 10 373 00 Thed Ps \"ayment (October 18, 2025) 111 960 00 TOTAL AMOUNT PAID: 832 809 00 REMAINING BALANCE: B 9 301 00 channels only. Keep al official rece: Allpayments must be made pts for verification. This state through authorized rent is"
    },
    {
        "image": "financialstatement2_synth_12_aug1.png",
        "label": "financialstatement",
        "ocr_text": "AUNERSITY Ketrunae Sverve, Quesan Sey 1 Ottew of Fanen ang Treatury LEE FEZ eR pI CLE ARE Pou niue. ANDED SON _SASSANORA a Se semy oF crstzsxsny, PRBDS STATEMENT SE FRUANDIAL ACKCUNTABILITY Tavis dhscyment soves a3 allot Soltanton miaicing te travel accout of CASSALORA M ANDEESON. Sivas! Fhunbrer 292247768, exied in fort Beet Saminntar Andee Jor af Scienze n Coegtuter Seenee, Fest at 5n RODELOPE, DETAN ED FEE BREAKDOWN, 552 400 00 amor 9 278 09 Lisary ind Laamng Rete Fan (B30 Bu Baader: Amtioes ans Dowwlapnwns Pee EOD Skate, nen. seed Mei Rommees Fate 00 00 Armee an Photons Euston Fa 8360 00 Regisvann and Puessing Fee 280 28 faewrsiemteon Ron anal Veviaion A000 inaucanan Coveenge B2EE 00 Taxrnalogy an ita Soniansnas Hers 4 084 99 GROES TOTIL, PWSNCIN, ABSISTANCES: Benovarshia Grant B25 740 00 Panne antDscwuns 95 242 60 NET ARIOUNT PAYABLE (912 209 64 PAYMENT RECORD, ita! Paymant ‘Gaplenber 17 2025) 93 070 09 Boras Pyynnt (Getobay 29. 2028) 6 407 00.» Pea Payraes evens 2. 2028) (C43 66 TOTAL MART PAD BEE 250 03) RERMA AONE EAL ANCE 17 480 90 Please uae Ene manny Golan sth 20 eye avost penating ang neste on wenden sts. Tie stasbaw carpulerganaratnd and oquKas ne toate For aectizeten, gaase cin the be, 2020 wt 12 00 AO Feen ‘tsa of Fran ane Treatasy at Ove assens ntiovied ah Smanvaghurvicehy ad pe. Boeeren"
    },
    {
        "image": "financialstatement2_synth_12_aug2.png",
        "label": "financialstatement",
        "ocr_text": "\"ATENEO DE MANILA UNIVERSITY tunan Avenue, Quezon Cty 1108 FINANCIAL STATEMENT i ae ee PLEASE TYPE OR PRINT CLEARLY’ ruLLNaMe; ANDERSON ___CASSANDRA_M. _ ‘a Fay Sure) FesGneay Midivae ace Filipino COUNTRY OF CITIZENSI [STATEMENT OF FINANCIAL ACCOUNTABILITY This document serves as official nottiestion regarding the nancial account of CASSANORA M. ANDERSON, Student Number 2022 87768, enrolled in Bachelor of Science in Computer Science, Fist Y forthe Fest Semester, Academic Year 2025 2028. DETAILED FEE BREAKDOWN: ‘Tuiion Fee (18 unas B1 800 una) {932 400 00 Laboratory Fees (1 subjects) 183 270 00 Library and Leaming Resource Fe 1500 00 Student Actiiies and Development Fee '8400 00 Athiate and Physical Education Fee '#300 00 Registration and Processing Fee 150 00 Identfation Card and Validation \"2100 00 Insurance Coverage 19250 00 Technology and Intemet Access Fee 11 200 00 Miscellaneous Fees 'B1 054 00 GROSS TOTAL [ASSESSMENT: 40 430 00 FINANCIAL ASSISTANCE: Scholarship Grant 120 739 00 Financial Ad Discount ‘96 842 00 NET AMOUNT PAYABLE: 812 880 00 PAYMENT RECORD: «Intial Payment (September 17, 2025) 180 070 00 Second Payment (October 20, 2025) 198 167 00 Third Payment (November 09, 2025) 18 043 00 TOTAL AMOUNT PAID: 925 280 00 REMAINING BALANCE: ®-12 440 00 Please settle the remaining balance within 30 days to avoid penalties and holds on academic records. This statements ‘computer generated and requires no signature. For vertication, please contact the Office of Finance and Treasury at the address indicated above or emai ‘nance @universty edu ph. Document Generated: November 08, 2025 at 12 00 AM"
    },
    {
        "image": "financialstatement2_synth_12_aug3.png",
        "label": "financialstatement",
        "ocr_text": "‘ATENEO DE MANILA UNIVERSITY FINANCIAL STATEMENT Katpunen Avenue, Quezon Cty 1108 ‘Omtce of France and Treasury PULASE FYFE Om ransT CLEARLY UU ante, ANDERSON CASSANORA uw at amt Some Tex omen) sala Mn coueray or crrizexsaun, FAO STATEMENT OF FINANCIAL ACCOUNTABILITY This document serves as ofa! netfcaton mgaring the trancal account of CASSANORA M ANDERSON, Stodent Number 2022 87780, envoted m Bachelor of Seance m Computer Seance, Fest Year or te Feat Semester, Academe Year 2026 2028. DETAILED FEE BREAKDOWN: ‘Tution Fee (18 unas 1 800 une) 1932 400 00 Labornory Fees (1 a 193 270 00 Lemay and Leamng Resoure Fee (900 00 Student Actwties and Development Fee (9800 00 Medical Dental and Heath Serves Fee (9400 00 Atniete and Physica! Edveaton Fee 19200 00 Regatvaton and Processing Fee Access Fee 1 084 00 GROSS TOTAL ASSESSMENT 40 430 00 FINANCIAL ASSISTANCE: Scholarship Grant (920 730 00 Financia Ad Oncount (90 842 00 NET AMOUNT PAYABLE: (912 849 00 PAYMENT RECORD intl Payment (September 17, 2028) (99 079 00 Second Payment (October 20, 2025) (98 167 00 Thad Payment November 09 2025) 198 043 00 TOTAL AMOUNT PAID: 825 280 00 REMAINING BALANCE: ®-12 440 00 Piease sette the remanng balance wihin 30 days {© avd penaites and holds on academe econis. Thi statement ‘compviergenerated and mqures no signature For verfcaton, please contact ne (Ottee of Finance and Trasury at he address indicated above or ema teance unwernty edu ph. Document Generated: November 08, 2025 at 12 00 AM"
    },
    {
        "image": "financialstatement2_synth_12_aug4.png",
        "label": "financialstatement",
        "ocr_text": "(932 400 00 Lopanwtory Fees ¢t 99270 00 Loewy an Leaming Resownse Fae P39 60 Stadart Autitne end Deratnent Foe 9822 00 Sincient Conta ant Meath Seniors Fe 9106 00 Avie and Prymna! Eavtcton Fon 5290 00 Regatenen ane Sesessing Foe IEC 06 WeniSenvon Cans wed Vaidanon 9100 00 inrwraeae Covermge 9280 20 Yermnciagy ans tmamet 97 200 00 tsnanianeous Fens 1 n84 90 oRCSS tora! ‘ASUESSMGNT BEG 450 00 FRUANCIAL ASSISTANCE: Sehounnp tnmnt (828 799 00 Pramas: Keb aceon 90542 59 MET AMOUNT Parag, (912 040 90 PAYMENT RECORS: Ines Paymens (Septemeas 17 2338) 9579 09 Seana Papert etaner 20. 2636) 198 187 09 Then Payne Plovamsnr Oo, 2038) 9 045 00 TOTAL AMENURET PAI: #28260 50 RENAN SALAMCE: 12 440 00 Pieane serie tw emer baron wen Mo devs X wrod panctoes ont hoite on academic monets. Thi sstoment wopelengunerated son arqutws na nyneticn Fer vesieain®, piece eencaet oe Ste ok Frionse oe Theatr aie addres nested adove cr emah frascatturtreraty atu pn, Dmvienant Decates Moree 94 2095 st 12 60) AM Access Foe"
    },
    {
        "image": "financialstatement2_synth_12_aug5.png",
        "label": "financialstatement",
        "ocr_text": "‘piz 049 00 PAYMENT RECORD: RSITY ‘and Treasury FINANCIAL ASSISTANCE: SPQ Gant 120 730 00 Francia ‘ge nv2 00 NET AMOUNT PAYABLE: it Payment (September 17. 2026) “Second Payment (October 20 2025) 12 00AM at 2025 at"
    },
    {
        "image": "financialstatement2_synth_13_aug1.png",
        "label": "financialstatement",
        "ocr_text": "DE LA SALLE UNIVERSITY 2401 Taft FINANCIAL STATEMENT ‘Avenue, hinée 1004 Accounting and Cashiering Office FULL NAME: MULLEN JASMINE B ‘st Fay Saray snc) Nis Mas ‘country or crrizessur: Fiiping CERTIFICATION OF ACCOUNT STATUS This sto cerfy that JASMINE 8, MULLEN, ‘Second Year student enrolled in the Bachelor of Arts in Communication Arts program ‘during the First Semester, Academic Year 2025 2026, has the folowing financial standing wih the universty: TUITION AND FEE ASSESSMENT: Total Assessment for the Semester 198 024 00 Scholaship Grant Deductions 111 740 00 Net Amount Due 146 450 00 PAYMENT SUMMARY: Total Payments Made 193 050 00 Outstanding Balance 13 301 00 [ACCOUNT STATUS: CONDITIONAL Pending payment verficaton The student must sete outstanding obligations before being Geared to enrol forthe next semester obtain academic records, or paripate in graduation exercises, subject to settlement of 1 financial obigations. Additonal financial bigatons may inctude: Library fines and unretumed materials Laboratory equipment damages or losses Student organization dues Dormitory or housing fees This certification is issued upon the request of the student for futher studies enrolment. tis valid for sty (60) days from the date of issuance and may be used for official transactions requiing proof of financial standing. Iesued this November 04, 2028 at Mania 1004"
    },
    {
        "image": "financialstatement2_synth_13_aug2.png",
        "label": "financialstatement",
        "ocr_text": "Deca sae wavensrre 51 Ton FINANCIAL STATEMENT ne ate use FRE OR ParNT cian y POU nae MULLEN a as ia ‘wai Tine county or crsunexennn, FID LCERWICATION OF ACCOAMT BTATUS Tint cota SACMONE B MRALER 9 ‘Second Yeu smadent prcotes te Qachalor of Aut a Coneuneatan Att pager oaeng Oe Fv Gacwater Kegenme eat 2078 2028, hes the hilaweg fianea! en we onty TUTION AEG FEE ASSESS,» tos Aasenment Whe Semester 908 024 00 Soren Deavewnns - 911 790 20» Met Amount Ove wo HBANE 09 PAYMENT SLAMUART, otal Payments Maes 923 080 00 Cutwtenieny Batanoe ergari cn ACCOARNT RTATUS: CONDTIONAL Pangea payment mufeanen The stodert at ‘stn owistanding ebaguens é ate beiyy cleared Ws envos forthe naz were Obie wenden: wants pamenate m gudvehOn aemseas SOACt te BaRerant et Ah trarni evbzeions Asien! Feannal obtgetine mn neha Una, fet and eater et wateneit Letontery eqvigment opicages 2: eres Scent epemenien us Darmny or housing foer Thor cantiauon i nsuee upon the raquent of te stadia fer ftner studs erimdeet. Wad tr sity (80) ays om me dete oF xroanoe wt Hoy be ute ter oem tmraestene mating roe! of trend! etanding owes Ors Nevamber 24, 2925 a Maka 194,"
    },
    {
        "image": "financialstatement2_synth_13_aug3.png",
        "label": "financialstatement",
        "ocr_text": "‘OE LA SALLE UNIVERSITY 2401 Tan ‘Avenue, Manta 1004 Accounting aoa Cashienng Office PLEASE TYPE OR PRINT CLEARLY PULL NAME; MULLEN (Ct Fama Saey ouxtny or cmzessun. F 90 Outstanding Balance 33 050 00. 13 301 00"
    },
    {
        "image": "financialstatement2_synth_13_aug4.png",
        "label": "financialstatement",
        "ocr_text": "FINANCIAL TATEMEN? puna FORE HH ERIN CERAM eu tame Fraps: ae SHAG The int aetiy sO SADIONE BERLE wha Busine of As Cinema At BeBe oe Tenn 2025008, ne se fons Mane Tene FEE ASOESSMEHT: «Tats Acouateraet for xa nrer ar cancer: SpeTe ATC OF ACSAT peaoeds Yen! shaded ante darn he Flak Baws A ning wah tha ecteenay: PATO tne Semester (pep, 024 00- Sealant Besuctans 924 745 90 Bont Ant ae fee 50 059 PAYRRENTT SeActASRY Tegel Pespenats ade Bo 058 ‘ouistnasing SAUTE ‘Big 304 88 Seen IAT: EORESTORN, «Pandey YOR MEAD “oy ten at Sor te me sooner, sesreg 0 on sermon. sot Tretute:« hapary ries nd ‘gratunt pygacation cpeiguinons Detws AD Tesoro paciuoate ms ehueton accuse Grancial absgetENS ME mont garages oF S808\" fo waned pes Te emo OEE akseis amen tn getzenent oF i fom! sbayanans anerbareae eanadais Lobe! oH joan Danmary or anes fas Tie enti stamens daie sf wee peraneer skagen een, Bani en sty BE) eeepc ta ant xen eng 974 earn aoe “gh78 Mant 1058 tune nis rosceamber"
    },
    {
        "image": "financialstatement2_synth_13_aug5.png",
        "label": "financialstatement",
        "ocr_text": "FINANCIAL STATEMENT PULSE FYPLOR PeaNT CLEARLY CCERTIFEATION OF ACCOLMT STATUS Tra ws so04 tat JABMDGEB MAKLEN. Sincenet Vor shuten: ent in the Seunaior of Ans ni Communkaiton Aas param dutng he Fat Semester Acoderse Your 025 2026, has Me iobowing tnenen! thendtig 97 the unvarsty. TUTION AND FER ASSESSMENT: Total Aunasrmaat for Wa Berester a 06 924 00 Senoramnigrrent Desactens ces BEN. TAG 00 Hat Amur Dose - 40 450 00 PAYMENT SUAMENY Tota Pennant Laon 995 040000- Cuittanang Amano - 13 0109 ACCOUNT STATUS. CONDITIONAL. Fandig payru veteaton The stant unt ate auvtending obigatons before berg Ueaed (> erteh fare oem Norman auto academe aconts, of Buon n pratuNten aNEENS, Lube I Betinoer of ab tenrca) obigaient. Adetune! inane’ obigeiinns way Maude Lary fren ant eroanumied maintate Labouaion equprant Gorages o leon Staent expe station dues Quentory cr Nout Sows The ensttintin w usond upon the raQuest 6! toe eden! tor fart suadaes encima. fs vai ler sty (62) aye trom the date at amuance and may be uiee tor aes meniattuns mowing pavol at name! wanting unset tit Newer G4, 2025 at Wiante 1604"
    },
    {
        "image": "financialstatement2_synth_14_aug1.png",
        "label": "financialstatement",
        "ocr_text": "— 1 248 Tan Arius. Yorke 1964 Aszouning ond aching Gite | FINANCIAL STATEMEN Hannan BKATEMENT OF FINAREIAL ACCOUNTABILITY Tha aetcoton mgaming the Wunna® asco 2022 569 Of MEMRY ©. HENDERSOK, Stusem tumbor ster i Civk Engenoaring, Fount Ver, tr tn Fee (18 ante et sot, uiesse) BREAKOOWR: Tun 928 500 99 Laboratory Facs (2 8 02 00 Lismany ard Leaming Rescue Fee PEOG OG Btudant Actus and Develoemont Fee (60 Madisat Duntal, ana Heath Senicwe Fee 00 90 etnias anol Psion! Etuoetin 18809 09 Rasistinton and Pres 7180 00 tsnstastin Card an: 3100 60» aicanoe Covamge ma 0 Fee Vuidotes 8280 06 Techaningy and intemet Access Fae 7 200 09» Mteraenmenss Fane 1 397 08 GROSS 167AL STANCE, Sehctach MEN. 036 018 99 FIEANCIAL aS) PIOAZE GO FAYAENT RECORD, msi a 8 973, Sevend Pays (at ‘Pea Fuymen areeonber 12, 2025} 8 094 86 TOTAL AMOUNT Paib 890 272 00 REMAINING BALANCE: #-13 254 90 83 peymants nest ye mae Duough somone serine only, Koop a8 otal recente for vedication. This statement a coravieegenemind ond mqures ra sztwe, ForverBeaton, panse coninct he Dien ai Wn sadrass inated ebove oretat spony adn gh, Document Gwnorees: Now Asscuntag sind Cashed Sy minor 17, 2028 an 12 00 ANN"
    },
    {
        "image": "financialstatement2_synth_14_aug2.png",
        "label": "financialstatement",
        "ocr_text": "; DE LA SNE Givtmuity sans ws] fen JANCIAL STATEMENT ‘rome, ante S004 Rasowine ont FOr samy HENCE SON oO Em ca STATEMENT OF MEAD AL ACCORTABK TY The anevoreet tenes an oem! Sermon mating Se Manna acaonet HEMRY B HEMEERGON deosten Memer PRBHIEY ervated n Bache of Sansa Cot Lngrowng Fouts vow Ines Fay aettee stem 90: 2 243629 DETARED FEE WabAntoon. fren Fee 18 coy Ot nou. (924 £90 09 puorntoy Feed wtpar) PA 229 00 Lavery and Lewin Rascirem For. PPD0 02 Yaweat Actes ant Se: wiicmann ra EDV 09 Meowal Dai h: aie Henn Semveey hee 40906 Amece ona Prynesi €iucston Foe 307 OC» Segara art Prececsing Hee D180 9 Stereteatan Cars wt Vaicanen 90 00 ecomnne Coverage 930 08 Tesneegy ane intenet 309 02 ASeewtaneocs Pov 1 367 wo ORCES TOF. SISTANCE Snranangy Sant 10 278 90. Renan da Doseunt 28 420 00 MET ALOU Paras: E cS Bevtemees ay, 2026. OO P2 UG hesend boymant Caturer th 2, 028) P12 102 00 Tet Paymen Peveoer 1B 3028, Oe 08 69 acon Fee ASSEGNEOTS BIB OTE o9 HHUNCLL AS mie ase we FEA0\" baete mona he Seated soe sina"
    },
    {
        "image": "financialstatement2_synth_14_aug3.png",
        "label": "financialstatement",
        "ocr_text": "‘DE LA SALLE UNIVERSITY 2401 Taft Ofvenue. Manda 1004 Accounting and FINANCIAL STATEMENT ‘Cashienng Office PLEASE TYPE OR PRINT CLEARLY yuu Nate: HENDERSON _ ‘county or crnizensir: FERS __ [STATEMENT OF FINANCIAL ACCOUNTABILITY This notification regarding the franc 12022 54201, enrolled in Bachelor of ‘Second Semester, Academe Year 202 Fee (16 unts P1 800 unt) document serves as official v aorsunt of HENRY B, HENDERSON, Student Number nce i Gwi Engineering. Fourth Year, forthe 15 2026, DETAILED FEE BREAKDOWN: Tulion {928 800 00 Laboratory Fees (2 subjects) (90 022 00 Livrary and Leaming Resource Fee (9500 00 Student Activties and Development Fee ($500 00 Medical, Dental, and Heath Services Fee {9400 00 Athletic and Physical Education Fee {9300 00 Registration and Processing Fee {9150 00 Identfiation Card and Validation 12 100 00 Insurance Coverage {9250 00 Technology and Intemet ‘Access Fee 191 200 00 Miscellaneous Fees ‘1 307 00 GROSS TOTAL ASSISTANCE: Scholarship Grant {917 074 00 Financial AdiDscount \"90 420 00 NET AMOUNT PAYABLE: 1910 425 00 PAYMENT RECORD: Inia! Payment (September 0%, 2025) “p8 173 00 Second Payment (October 10. 2025) {913 102 00 Third Payment (November 19, 2025) \"39 004 00 TOTAL AMOUNT PAID; 830 278 00 sichualitig BALANCE: B 13 864 00 Allpayments must be made through authored Channels only. Keep all offal receipts for verication, Ts statement caerrecgenerated and requees no sgnatur. For vticaton please contact ie Sermantng and Cashiering Offee atthe adaress indicated above or ema terre guniversty edu ph, Document Generated: November 17 2026 at 12 00 AM ASSESSMENT: 39 019 00 FINANCIAL"
    },
    {
        "image": "financialstatement2_synth_14_aug4.png",
        "label": "financialstatement",
        "ocr_text": "OF LA SALLE UNIVERSITY 2401 Tan FINANCIAL ‘STATEMENT ‘Avenue, Manta 1004 Accounting aan Casnienng Office PLEASE TYPE OR PRINT CLEARLY FULL NAME subjects) rd and Validation 7100 00 insurance Coverage 250 00 Technolo, Access Fee 8 and Intemet 1 200 00 Msceteneous Fees 1 307 00 GROSS ToraL ASSESSMENT: 839 018 00 FINANCIAL ASSIS Scholarshia Grant 917 074 00 Financial Ad Osscount 9 420 00 NET AMOUNT PaYasie P18425 00 PAYMENT RECORD: ina Paya, (September 01, 2025), 8 173 00 Second Payment 13 102 00 Thal Payment po 9 004 00 ToraL a SAINING BALANCE: 6 131884 00 at perso must Samos ont Keen a oficial ces for comer computergenerated and Accounting and Cashiemng finance @universiy edu ph, vember 19, 2025) MOUNT PAID: ©20 279 09 be made through authorized This statement is GUFES No Signature. For verification, Offce at the address indicated ave Document Generated: November 1 Please contact the ve or email 7, 2025 at 12 00 any"
    },
    {
        "image": "financialstatement2_synth_14_aug5.png",
        "label": "financialstatement",
        "ocr_text": "ieAsee svi NAME eau oF VIER LEE SOM. St inane, Feta 208. EINE SREAKOOUNE «TREN Laboratory Fes ying Rasouroe *RE pce AIRS ronbanton ga ey ana in bacon Sean EOE sgt, OETA ‘p2eH00 62° ‘vray on 129° sujcts} nese. joi Soren ac and oma FA Gegoo an Mecizat Denoe ane Heath SHR ‘geben aloe ane Piyset event San i Pogeten 208 PoCCED TN deisg an ietnesten Card ane ware og. a8 soeusenan CO Teaneotogy ens iewnet seams Pe spggesemene 29 999 20 FR siane Grant “pi p74 a0» Financia! suiaoUm ve. aze 09 NET NE pao apres 199 173 09 Sesond ween 8 Teed PREM [py TOTS AMO og an payents este ace j Tels ate het ase co s4ghe7 RECORD Puyo re fvovonbes Y8. 2926 mar Pato, BIe 279 00 a Pay na be. 12 arr feng ot cia 2 na genera rd gues 50 aN corny en Comins Onto whe A dioxins a0 vonmivated: rene! 97. mance pocume 22s wt 12 00 A"
    },
    {
        "image": "financialstatement2_synth_15_aug1.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS ea Boulevard, Mania 1015 FINANCIAL STATEMENT Espa Office ofthe Treasurer ‘PLEASE TYPE OR PRINT CLEARLY ULL Nam COMBS ——__—— __ KIMBERLY _ y___ or Fay Sa Tis Gis is we a Fling “coUNTRY OF CITIZENS! FINANCIAL ACCOUNTABI STATEton regarding the fnancas! account of MBERLY T COMBS, Student Numbes ete sg2d, ented n Bacher of Science n ACTIN, “Tied Year, forthe Second aaa ve Aonseme Yen! 20252020, DETALED PS BREAKDOWN: Tutton Fee (20 cons 1 800008) fp3e 000 00 «Laboratory Fees (¢ subiects) ‘pis 980 00« Lirary and Leaming Resouroe Fee 700 00 «Student Actives and Development Fee “Gob0 00 Medical, Dental. and Heath Servons Fee “pron 00» Athlete and Physical Education Fe ‘poco 00 Regitraton and Processing Fee 1p130 00 entation Card and Valaton “3100 00 Insurance Coverage “$250 00 Technology and Intemet ‘Access Fee \"p1 200 00 Macetaneous Fees ‘p1 360 00 GROSS TOTAL (STANCE: Scholarship Grant 929 629 00 Financial AdiDiscount “pio 021 00 NET AMOUNT PAYABLE: \"ut Payment September 08; 2025) se. ab Second Payment (0aobet 10 2025) ‘gra a5s 00 Tard Payment Noveroe’ OB, 2025) ‘po 195 00 TOTAL AMOUNT PAID: 933 265 09 ‘ance. 6 16 740 00 Al payments must De rade through authored Socal rceits fr vesticaton, Ths statement eave sonature For verfcation, please coral the he address indicated above oF ema se address ener: Noverber 172028 at 1200 an ILITY This document serves a8 offs STATEMENT OF “ASSESSMENT: 256 100 00 FINANCIAL ASS! ‘p10 519 00 PAYMENT RECORD! REMAINING BAL channels only. Keep computer genersied Cffee of te Treasurer at france @universty edu."
    },
    {
        "image": "financialstatement2_synth_15_aug2.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF SaNTo Tatwan FRINANCIAL STATEMENT Esposia Roxsavaci, Sonia 118 Oe ote Treaeate Pea sare anne copay Pra wamee: CORMES, ann RORY Naira coe oR cane, FADS a sen OR PNANON RESSUASTAL ITY Tha dasswert serra seco Fess teagan Me foanen’ acount oF TMSELY T TOMES, tte nae RESIAGR, eres 8 Basholo Sein ms Azonuntanin fost er nee Sean m0) Cons WEMTANESOL, CEFN EE FEE REARDON Tater Pee ee its B81. e46084) $35 090 99 Luconstany Fans suijecy) 38 982 0 Utcasy ans Leaming Aavovren Fre BS 0» Statent Actnsies ana Breoiigcenne Fee P00 OE» tess Cant, anc Seni: Sens Foe 405 09 Atoetc ais Pryaial Bacto Poe 100 98 Sagrettnn and Prewsting Fan B20 20 isanttsaen Dane and Valase 102 00 nsuzanae Saeming FEBILGO Vecnnsingy and teaemed 5 200 60 scetoneauis Fane Piaas 00 gRDsS aTaL SESSMENT: 936 145 00 Feats, ASSISTANCE Senmune Oe 1828 €20 99 Cnancit Asiieenunt S20 851 oo ET AMOUNT Ravages fntat Paya Weniameerte, 20285 H 208 09 Gowan Paster: etsbor 6, 266) B4 056 20 Tri Papenent oweinae D4, 2075: 99 905 00 Tei, aseceaT Paso 3 265 00 RANANIO BAL WCE: B 16 748 09 8 pesveots cus be ste forage ooreored ints only, Keay a8 eitniel wanes ta wirkcation. This watemanre Serretive garinuted ans meains ns sigcativn, Far Dikea of tha Tmeasusae oh he astims tasnzeghurerety wey sh Sacwmen Aconte Faw 816 510 09 PavuENT rEnaaS, vantoetion. pene canes Ine onscutes atiove ot aes Sereimsed: Nowenvar 7, 2024 ot 1209 AM"
    },
    {
        "image": "financialstatement2_synth_15_aug3.png",
        "label": "financialstatement",
        "ocr_text": "ENT Ne oucecet, a HEN omen ot the Teoma ANANCIAL S TATE eusvet ER OH TIERE CEEAEN pun nants GOMES. SOMOERLY cece COTE, SNE amon graven OF PEARL ACCA S TS is dwn sees 8 OTHE a navion nepali te feat Se KIVEERLY T, ODS, SALINE NT edn Bari of Beene ADOT “oink Yas, fore Seats Re TRLED HEE RUEARDOARE EF TS po 90. 200 05 \\oberaiony Sees fe BOY stave and aang Pesmue Fat ugant Acsutine uns DEVO spi oink Der a awn Senses FP annie at Payson vatasann ar Dozens end and Veta. esa Set “picgec on Merten FAS 95 28 Fesensucsey 056 100 99 FRAN, ASAISTANE, 0 07809 nd MEY BSUEATT PAYABLE Tpoenesrre? 2. 2525) foeen 19. 20287 saner a8. 2028 ar eae, 93 285 00 rien mini mate Sesh ARATE ior wetancn, Toe want ke Pagrsnt ‘99 228 09 Besana Payers ‘pia nes 20 Pus Payee Faith 10 TOTAL SUN Fie 519 09 Pare RECORD. ‘pearenss BALAN eanoats sey, RHEE a8 Hin ANTS er ieegesntated ve sures 8 SONI ar veceat, pleats Catsel re panann idiots akovt 2 wr revert 37, 2075 at 1290 AME thon of tn Texmsures at Offoe Si peivarsty. atu ph DucEITAt OTN"
    },
    {
        "image": "financialstatement2_synth_15_aug4.png",
        "label": "financialstatement",
        "ocr_text": "[ [FINANCIAL S1 L TATEM| pean Avec ce kaners SOMES. sd Se wee oneniey os cer nernennr, PS? eaten ragaiding tne Prarcis ao220int of KIVBERLY 4. COMES, ardent Number hale of Suace i Becauntency, Tans Cer, fortis Second Sovigeiar, Academe Var 2025 2026. DETR A: Tatton Fee sete 91 BODINE) 36 GOH 2 Labonatay Fees (4 stie ts 918 580 09 Lan and Leaming Renouom Fee 1P200 00 tient Actusine ae Dovalnpewst Fae (9800 00 Xecvast Cun and Heats Sesvics Pe 3760 09 Sahietis ane Pasion Bozeman 858 06 Regiakation and Prneessing Fae \\dentfieation Card unt Vadeton insures Coverage {9250 0 Teshnslogy and internet Auwss Fae 191 200 90 Ahrcatancous Fuss 7389 09 GROSS TOV $F 96 180 00 FINANCIAL ASBISTAN ravotarsip Grant B79 628 00 Feancvat Anisec: ‘0. 521 00 NET AiaQ UST PAYS RECQAO: «insig Payment (Heptersngr 2. 2925) we zi6 00 1! Payot (Dota 18, 2025) (994 3B 09 Tha Payrnnt eweeber 02 2028) _ 9 105 810 TOTAL, AUERINT PAN. 933 286 02 Retdainnrss SPL ence: 18 748 08 Ax payments must Ox mada agin morons ahannwis ony. Keep a ofc wsnints for vedientin This rain ‘compuier generated and requines 0 sunatins, Por wenietion, sleaze contact the ‘len of the Taakiate atthe addeent deste above ar ema feaneagpsrionney wage, Domina Geneeatad: Novenes 37, 20 29462522. encadnd Bs 15006 10 519 00 Fave 6 wt 12 00 AE"
    },
    {
        "image": "financialstatement2_synth_15_aug5.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF SANTO Tomag Espafla Boulevard, Mania toss Office of the Treasurer PLASETYPE OR PRINT CLEARLY FULL Nase, COMBS. COUNTRY OF crrizexsinp, Filipino STATEMENT OF FINANCIAL mes OUNTABILITY This document seves cia! donee t8tInG the mance acccun: STRIMGERLY T. COMBS, Student Nember of Science in ‘Accountancy, Thid Ye 2025 2028. DETALED Fee 36, and Development Fee th Services Fee 1 389 00 GROSS Tora, TANCE: «| REMAINING BALANCE. channels only Keep 17, 2025 at 12 00 amt"
    },
    {
        "image": "financialstatement2_synth_16_aug1.png",
        "label": "financialstatement",
        "ocr_text": "SSE FINANCIAL STATEMENT Payreome a warmers oem Leper tont nteatncanevauan POU SA, RAMOS ‘en chanoycmaaay Aves Foe ANCE Senowwrig Genet 3 2 20 Fanci Adomtount : 211 00 NEY AMOUNT PAYABLE 4 060. 20 PAYMENT RECORD, «tte! Peymantiteptenber V0, Ry 2 3 828 03 Sesnnd Fryrent (October 2. 2028) 99 829 90. Tors Paycant Comber 29 2028 8 768 00 TOTAL AMOLMT Pasty 82 308 20 REMAIN BALANCE B19 448 06 Pate wate ine waning boone warn ME doys {08 ponetn ar Neath an vende ne recor, Tra smenan te fonpiterguaraies nnd metres ne wonton, Fe stoason, piaue sovaet te Casrirs Oce at m9 aden macnied shove or ral feaneetdruressy nav pn Decstent Gereaten Cetobar 24, 024 wt 12 00 AM 0878 00 OROSS TOTK ASBRSSUEM 844 38709 PRUNE, ADtiaty"
    },
    {
        "image": "financialstatement2_synth_16_aug2.png",
        "label": "financialstatement",
        "ocr_text": "FINANCIAL STATEMENT (PLEASE TYPE OR PRINT CLEARLY POUL Nave: RAMOS DYLAN N Cat ty Sma Fest Gna) ‘ew Maes county oF crrizexsinr, FRPPO ‘STATEMENT OF FINANCIAL ACCOUNTABILITY This document serves as official notfcaton reganing the fnancial acount of DYLAN N. RAMOS, Student Number 12020 23000, envoted in Bachelor of Science in Information Technology. Thid Year. for ‘the Fest Semester, Academe Year 2028 2028. DETAILED FEE BREAKDOWN: Tutton Fee (19 unts 81 200). {924 200 00 Laboratory Fees 2 opts) 195 418 00 Lary and Leaming Resource Fee (9500 00 Student Activites and Development Fee 19800 00 Medical, Dental and Heath Services Fee (9400 00 Atniete and Physical Educaton Fee (9200 00 Registration and Processing Fee (9180 00 Identfeaton Card and Validation 1100 00 Insurance Coverage 1280 00 Technology and intemet Access Fee 191 200 00 Mscelaneous Fees (9079 00 GROSS TOTAL ‘ASSESSMENT: 844 207 00 FINANCIAL ASSISTANCE: Scholarship Grant (913 230 00 Financia Ad Oscount 4211 00 NET AMOUNT PAYABLE: (916 856 00 PAYMENT RECORD: Intal Payment (September 10, 2025) (913 025 00 Second Payment (October 02. 2025) 190 631 00 Thad Payment (October 23. 2025) 198 748 00 TOTAL AMOUNT PAID: 812 304 00 [REMAINING BALANCE: ®-15 448 00 Piease sette the remaining balance within 30 days te avoid penaties and holds on academe records. This statement computer generated and requees no signature. For verfcaton, pease contact he Casners Office at te address ndiated above or emai fnance unwversty edu oh Document Generated: October 24, 2028 at 12 00 AM"
    },
    {
        "image": "financialstatement2_synth_16_aug3.png",
        "label": "financialstatement",
        "ocr_text": "po TFINANCIAL STAT Lo. poten: BANOS ee) ‘Staten Nonaar 2020 23060, enraed in Bacher of Reence in information Techwoiagy. The Yass, for 1926. DETALED FET RREAMDOWN: Tutor 934 200 00 Lapecaton Pore B5 148 09 Auer and Laaring Ressvtew Fe Shidant Aatvties and Daveiceraat Fee este, fisores Yeo ce 2800 00 «Beene. Dental, 2 \"3408 00 Amanis ond Foaseat Education Fee 2209 00 Anylebaton oné Frosesaing Fee 150 29 Hdentoation Cant uni Yailaion (8120 00 -Insweanse Zoverege 19259 90 Tectalogy ane inianiet 81 200 50 Minceternous Fans £572 00 GPOSS YOR. (515 207 69 SRMIEZIAL AGSISTANCE. Sahotarvnia Gro 142 280 00 Frnsrsiat ita 616 247 0 HET AMOUNT PAAR an Payer (Beptasrbe: V9, 202 925 05 «Besar Payraant eiaber 2, JE25) 126 952 08 Thi Prysnens Genoa 23 9 90 TOTAL AMOUNT PAID: 952 304 96 SIAL AGN BALANCE. SUIS 426 00 Plewse sate the remsinang Retanse wits 20 days sony. 2th ts avoid peneies and holds on aswdecis reoutss. th sonputergjsneraied aaa reqcies i tgnaiume Fer westientor, Comrin s fice af tw acres niaaind ae 08 2 osuimeen Genannted Getehes 24, 2085 at 12 00 Att"
    },
    {
        "image": "financialstatement2_synth_16_aug4.png",
        "label": "financialstatement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF FINANCIAL STATEMENT PHILIPPINES Anonas Sweet, Sta Mess, Mania 1076 Casners Offee PLEASE TYPFOR PULL NAME: RAMOS: DYLAN N uzensuue; Filipe STATEMENT OF FINANCIAL ACCOUNTABILITY This document serves as offical notficaton regarding the fnancal account of DYLAN N. RAMOS, Student Number 2020 23968, enrolled in Bachelor of Sownce in Information Technology. Third Year for the Fist Semester, Academic Year 2025 2026, DETAILED FEE BREAKDOWN: Tulton Fee (19 units 81 800 uni) 134 200 00 Laboraton Fees (2 suet) 195 418 00 Lvary and Leamng Resource Fee (9500 00 Student Actwttes and Development Fee 1800 00 Medical, Dental, and Heath Servoes Fee 1400 00 Athletic and Physical Edueaton Fee 9300 00 Regstation and Processing Fee 9150 00 -Identticaton Card and Vakdation 1100 00 Insurance Coverage 1250 00 Technology and Intemet Aovess Fee 191 200 00 Mecetaneous Fees 9079 00 GROSS TOTAL ASSESSMENT: B44 207 00 FINANCIAL ASSISTANCE: Scholar Grant 913 230 00 France| Ad Dscount (914 211 00 NET AMOUNT PAYABLE: 16 856 00 PAYMENT RECORD: Intl Payment (September 10, 2025) 113 925 00 Second Payment October 02, 2025) 199 031 00 Thed Payment (October 23, 2025) 18 749 00 TOTAL AMOUNT PAID: 832 304 00 REMAINING BALANCE: B 15 448 00 Please sette the remaining balance wenin 30 days: to avoid penalties and holds on academe records. This statements computer generated and requres no signature. For verfieaton, please contact the Cashiers Office athe address indicated above or emai fnance universty edu ph Documant Generated: October 24, 2025 at 12 00 AM county oF"
    },
    {
        "image": "financialstatement2_synth_16_aug5.png",
        "label": "financialstatement",
        "ocr_text": "ee povyrecaws umctRarty oF FINANCIAL STATEMENT Pst bon mtg runes rtm rw casas pee RAMOS tac tewy tore conweny ow crime, HO OC SG TATEMAESET OF FHKANOUL ACOGUNTARILITY Ths demumment serves at oe natheaton regarding Sie lean ncesum ot OVLAM Ni RARLDS, Ste04n Morber ‘262022688, ennoiad m Bachelor of Betenun 0 ntenncten Tectwetegy. Tonk Yess. (nt Fem Gemaster Acadowe Year 2925 2028, DETALED FEE BRESAOOWE Tote Few 08 wre GOT BO (94 200 00 Labeamtnry Fans weeny 92 418 09+ Len art tnarnng Rese Hoe (#900 00 avant Aotvtes amt Devenir Fen RON 2 «Aedes, Contr are natn Servens Foe (0409 98 rune and Pryce: Eevcaion Foe 05a» Ragrentan ant Procenang Foe 52 99 detention Cant ane Venatun, 120 00 Wrecarer Coverene 7 (9280 08. Teennatagy and heme Bente Pee (97 208 00 Maceneneors Feet WOIB 08 ROBE TOTAL ASS RQURHT B44 207 86 FRUNGIN, ASTISTANCE Setoncne Govt nea BERRI MD Pens Dic (©76 211 00 NET AMOUNT PAYABLE (916 480 00 PAYAKIAT FECCAD: Int Payerant (leetomeer 19 2028) (919 028 00 Geucned Payerant Ktaber i, 7325) MENT OB Thad Papmeen (erate 29. 208) (98 749 09 TOTAL AMOUNT PAID 037 204 00 REMAINS BALANCE: LIS 428 00 Pieane wite ha neraiing inne min 30 Sir sa mcend panattnn ened taken on muasioove mca. Te ctatinne campateegenanted snd argues no wyraton. For writeaion, awn enna te Ganiars Sen 4 te athe eared m0 0 2 ema teneneagbunwarngy 2) Deru Goreme Orlober 24, 2095 ct 17 00 Ale"
    },
    {
        "image": "financialstatement2_synth_17_aug1.png",
        "label": "financialstatement",
        "ocr_text": "IAL HAL STATEMENT anon"
    },
    {
        "image": "financialstatement2_synth_17_aug2.png",
        "label": "financialstatement",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY FINANCIAL STATEMENT a nan Avenue, Quezon City 1108 Office of Fiance and Treasury ASE TYPE OR PRINT CLEARLY FULLNAME: COCHRAN JOHN ‘Co Fam Surmy Fist (Gen) COUNTRY oF crrizexsip, Filipino standing with the university: TUN ITION AND FEE ASSESSMENT: Total Assessment for the Semester 55 140 00 ScholashipiGrant Deductions 16 698 00 Net Amount Due 120 168 00 PAYMENT SUMMARY: Total Payments Made 933 547 00- ‘Outstanding Balance October 21, 2025 at Quezon Cty 1108,"
    },
    {
        "image": "financialstatement2_synth_17_aug3.png",
        "label": "financialstatement",
        "ocr_text": "‘ATENEO DE MANILA UNIVERSITY. FINANCIAL STATEMENT art surettoas Centr Ca¥ 108) Office of Finance and Treasury [PLEASE TYPE OR PRINT CLEARLY FULL NAM; COCHRAN JOHN M. ‘ast (Fay Suan) FistiGne ‘Nii Wace country or crrizexsir: FAPIOO ls ‘CERTIFICATION OF ACCOUNT STATUS This sto certy that JOHN M. COCHRAN. a Fiat Year student enroled in the Bachelor of Science in Civl Engineering program ‘dueng the Summer Term, Academic Year 2025 2028, has the folowing fanciat standing wth the university: TUITION AND FEE ASSESSMENT: Total Assessment for ‘the Semester (955 140 00 Scholarship Grant Deductions. 116 608 00 Net Amount Due (920 104 00 PAYMENT SUMMARY: Total Payments Made 833 547 00 ‘Outstanding Balance 180 00 ACCOUNT STATUS: CLEARED No outstanding balance The student must sete outstanding obligations before being cleared to enrol forthe next semester, obtain academic records. or participate in graduation exercises, subject to settement ofall francial ‘obigations. Additional nancial obligations may incide: Library fnes and unretumed materials «Laboratory equipment damages or losses Student organization dues Dormatory or housing fees This certfeation issued upon the request of the student for ‘isa appicaton requrements, It vaid for sixty (00) days trom the date of issuance and may be used for offal tansactons requiing proof of francial standing. Issued this ctober21, 2028 at Quezon City 1108."
    },
    {
        "image": "financialstatement2_synth_17_aug4.png",
        "label": "financialstatement",
        "ocr_text": "PLIAGE TPE Om Mes cteaers Put Name, COCHRAN sont: Bw COUNTRY OF Cte Nase, FRED re CROATION OF ACCOUNT STATUS Yh ito com at 08m Ee Cs EIN Tear slusen pocine a he Boone sp sen Sn Engineesing gmaven Sanz Be Scoerarteom, Asati Year Sues snoe foe 9 fotosang fnaneus re natn Me uDenty: TMC AND EEE aeenocees ¥88 149 69 Seratustisirany ucts Pis e0e Rot Semoun Bu 25 194 00 Paster Stunmtanty: Vou Payments Mage 53 547 90 etstanding Basins 9 09 wooo PUTS Ba Sehte ovntarding Bo oummaneing owanee Tye \"she e989 19 ares too o8patis Susent ws sbiystions nef a wens 9 settersgat at ge sbhgiikess ay ind» er60 den 9 Fees Ths oa Onwver 24 Linney fines tn unre 4s Oeste Shoe aerate Letoontn ed ent onancaton dues 86d sD the equa each 1 ty 0% cays tonne date af sasone ey Bien eee RIED ODIO anc strain ences S025 at Queren Sky tap"
    },
    {
        "image": "financialstatement2_synth_17_aug5.png",
        "label": "financialstatement",
        "ocr_text": "[ATENEO DE MANILA UNIVERSITY FINANCIAL STATEMENT Ketpunan Avenue, Quezon City 1108 Office of Finance and Tressury FULL NAME; COCHRAN JOHN M. ‘st Fay Sure) Fist (Ohc) iso Mas ‘country or crrizessur: Fiiping CERTIFICATION OF ACCOUNT STATUS This isto certfy that JOHN Ml, COCHRAN, Frat Year student enrolled in the Bachelor of Scienoe in Civi Engineering program ‘during the Summar Term, Academie Yesr 2025 2028, has the folowing financial standing wih the universty: TUITION AND FEE ASSESSMENT: Total Assessment for the Semester 155 140 00 Scholarship Grant Deductions 116 698 00 Net Amount Due 120 104 00 PAYMENT SUMMARY: Total Payments Made 1B93 547 00 Outstanding Balance 180 00 ACCOUNT [STATUS: CLEARED No outstanding balance The student must sete outstanding obigations before being cleared to enrol for the next semester, obtain academic records, or partipate in graduation exerczes, subject to sattiamant of al fancial obligations. Additonal financial obigations may incude: Library fines and unretumed materals Laboratory equipment damages or losses Student organization dues Dormitory or housing fees This certicaion issued upon the request ofthe student for visa application requirements, Its vai for siaty (60) days from the date of issuance and may be used for official transactions requiting proof of nancial standing. Issued this October 21, 2025 st Quezon Ciy 1108,"
    },
    {
        "image": "financialstatement2_synth_18_aug1.png",
        "label": "financialstatement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF PERLIPPINES Anonas Street. S18 FINANCIAL STATEMENT Fe anaa 1076 Cashiers Offo® EARLY PLEASE TYPE OR PRINT Cl ews PULLNAM! at Fary Som) Filipino counrey ov crrizenstr: SEES “STATEMENT OF FINANCIAL ACCOUNTABI TY is potcation regarding the A ee ecount of MICHAEL C. ELLIS: S887 Number 392. 98503, enroed mn Bachelor of Scene Payehology. Second Year. fr the Jammer Term, Aeagemic Yea! 2026 2028, SeTAILED FEE BREAKDOWN: Tuton Foe Boe 000 00- Laboraton/ Fees (1 sublets) (18 uns 92 000 un4) Saldoe 00 Lavrry and Leaming Resour Fe \"actives and Development Fee 1d Health Senices Fee ion Fee Jocument serves as offs \"9800 00 Medical, Dental. an “100 00 Athletic and Physical Eduee vo750 00 Technology and Intemet 'p1 200 00 Miscelaneous Fees Access Fee 191 257 00 GROSS TOTAL [KSSeSeuencr 94 163 00 FINANCIAL ASSISTANCE: Scholarship Grant \"921 025 00 Financia! Ad Dscount (92 692 00 NET. ‘PAYABLE: <ECORD. tal Paynent September 18 2029) eign 00. Seeond Payment (onobe 19 2025) spans 0 Tard Payment Novene! 14 207 911 144 00 ‘PAID: 631 222 00 “Suaanan BALANCE: B 14 770 00 For PayTS” please MN te Finan ofc dung ote Now at ng sequies no signature. For vesoalon reas ndizated above or emad nan per 05, 2025 at 12 00 AM ‘p16 440 00 PAYMENT ements please contact the coordi Jquniversty edU. Ph computergenerated Cashiers Office at th ‘Document Generated: Nove"
    },
    {
        "image": "financialstatement2_synth_18_aug2.png",
        "label": "financialstatement",
        "ocr_text": "nn i i POLYTESHGE UNWERSITY OF [FINANCIAL STATEMENT vu onc ete PAINE CLEARLY SCATENENT OF tention moaeding the tance! eezaunt of HEC 202298888, cnratod i Bacher oF Sunimee Teen, Asada Yea 18 as O2 600 un8 6s Laveraty Feet (1 eutet 03 208 06 Licowy and Leaming Rescutorf an0 06 ADN99 Reoies., Genta, and Helin Servions Raw 1500 00 Aine and Physinwi Eowwotion Pee 200 06 Ragivvaton und Puareng Fe 185 99 Wanthmstinn Cart and Vabseon B19 99 taeamance Coverage 19269 08- Tashnolagy. focaas Fae 1260090 Waeowtaneni Fees 8 90 GROSS TOTAL roisronp Gre 1823 025 00 Fersqcsss Anti TRton AE $92 00 NET AMIDUNT PAYSELI Bie M 05 SAVIENT RECORD: nhl Peymecsi Gepierter 18, A025) (11 905 69» Second Peyrrant (Detohar (2, 2625 internet ASSESSMENT G44 185 00 FRUCIAL ASSIETAN 168 00 TOWRL AROUNT PAID: 931 222 00 amputergenacaied end requrez no spgrmtum. Far vatican. pleove sortacl the W s UMiew ate situs mowed ahve or 29k Hom ty 85h Document teenematnd: Hovenibes 03, 2028 at 12 00 Ais"
    },
    {
        "image": "financialstatement2_synth_18_aug3.png",
        "label": "financialstatement",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF PHILIPPINES Anonas Stet, Sta FINANCIAL STATEMENT Mesa, Mania 1010 Cashiers Office PLEASE TYPE OR PRINT CLEARLY FULL NAME: ELLIS MICHAEL c. at Fay Sormamey Fist (ey ‘Nii w Maes ‘counray or errizessar: FPO —_ STATEMENT OF FINANCIAL ACCOUNTABILITY This document serves as offial notfcaton regarding he fnancil account of MICHAEL C. ELLIS, Student Number 2022 08563, enroled in Bachelor of Science in Psychology. Second Year, or the ‘Summer Term, Academic Year 2025 2026, DETAILED FEE BREAKDOWN: Tulon Fee (18 unts P2 000Vuna) 136 000 00 Laboratory Fees (1 subjects) 193 200 00 Library and Leaming Resource Fee (9500 00 Student Activites and Development Fee {9800 00 Magical, Dental, and Heath Services Fee {9400 00 Athlete and Physical Education Fee 1300 00 Registration and Processing Fee 1150 00 Identfeation Card and Validation {100 00 Insurance Coverage {8250 00 Technology and Intemet Access Fee 191 200 00 Mcetaneous Fees 257 00 GROSS TOTAL [ASSESSMENT: B44, 103 00 FINANCIAL ASSISTANCE: Scholarship Grant 121 025 00 Financial Ad Discount {96 002 00 NET AMOUNT PAYABLE: {916 440 00 PAYMENT RECORO: intial Payment (September 18, 2025) 111 004 00 Second Payment (October 18, 2025) 190 074 00 Thid Payment (November 14, 2025) 1911 144 00 TOTAL AMOUNT PAID; 31 222 00 REMAINING BALANCE: ®-14 776 00 Far payment arangements or concems, please coordinate wth the Finance Office dung office hours, This statement is ‘computer generated and requis no signature. For verification, please contact the Cashiers Office at the address indiested above or emai nance @universty edu ph Document Generated: November 05, 2025 at 12 00 AM"
    },
    {
        "image": "financialstatement2_synth_18_aug4.png",
        "label": "financialstatement",
        "ocr_text": "(PLEASE TYPE OR PRINT CLEARLY ouneme, ELUS __ MICHA at hay em) Tox Ones) ‘iw Ma ‘cousrny or crexsiair, FABRE STATEMENT OF FINANCIAL ACCOUNTABILITY This document serves as ffi notteaton reganing the tnancel sccount of MICHAEL C ELLIS, Stadent Number 12022 08863, envoted in Bachelor of Seance mn Paychology. Second Year. forthe ‘Summer Tem, Academe Yess 2028 2028, DETAILED FEE BREAKDOWN Tution Fee (18 ants 92 000 une 136 000 00 Laboratory Fees (1 subjects) 193 208 00 Lovary and Leamng Resource Fee (9500 00 Student Actwaes and Development Fee (9800 00 Medical, Dental and Heath Services Fee (9400 00 Amiete and Physcal Education Fee 19300 00 Registaton and Processing Fee 19180 00 Identfeaton Card and Vaidaton 19100 00 insurance Coverage 19280 00 Technology and Intemet Access Fee 11 200 00 Macetaneous Fees 191 287 00 GROSS TOTAL ASSESSMENT. 844 163 00 FINANCIAL ASSISTANCE: Scholarship Grant (921 028 00 Financia Ad Oncount (96 002 00 NET AMOUNT PAYABLE: (916 446 00 PAYMENT RECORD: Intal Payment (September 10, 2028) (911 004 00 Second Payment (October 19, 2025) (99 074 00 Third Payment (November 14, 2025) (911 144 00 TOTAL AMOUNT PAID: 831 222 00 REMAINING BALANCE ®-14 778 00 For payment arangements or concems, please “coordnate win the France Ofice dumg office hou The statement comevier generated and reaures no tgnature For vertcaton please contact he Canners Ottee at he address ncated above oF emad trance @unwernty au oh Document Generated: November 08, 2028 at 12 00 AM"
    },
    {
        "image": "financialstatement2_synth_18_aug5.png",
        "label": "financialstatement",
        "ocr_text": "JFINANGIAL STATEMEN seca, Monte 1018 Gastiers Offoe | PLgASE IVES OR PAINT CaARLY MCHA: ©. county ow ernizessinr: £280 STATEMENT OF FINANCIAL ACCOUNT nefecation rapetaing the Tncio! sence! 2028 08082, ened m Gach Suantnos Term, Aradame Fear 2026 25 \"ABILITY This ducument srves ws off OfMICHAE. ©. ELLIS, Shade Number af Scieaoa in Paycholayy, Second Yeas, fe tne 28. ORTAILEY FEE BPEAKDOW 2 600VeniK 1858 00 98 Lanorstory Fees (9 svbiecis} 82 708 00 Livny an Leaminy Resoures Fee BHCL 0» a 8400 00 Avietin and Pris Eeuraton 0 08» Stutent Seth ses and Guetaprent Pee SA0U UN Ragistation ond Processing Fee 150 00 Kdentficntion Cast ane! Velsehor 199 00 fsa 225000 Tacenology anu inte Agrese Fee 1B 209 09 Mecetieneois ses 1 287 09 GROSS TOTAL NT, Bad 203 00 FINENCIAL ASSISTANCE: Schotesnin Gront 921 825 90 Finamnsil AukiDieoout 98 462 00 NET AMOUNT PAVARL “nia Paynant Sepsemhar 16, 2025 12 19 004 60 Second! Peyrient (October 10, 2025) 8 074 17 148 00 TOTAL AMOURET Paid, 251 272 00 REMAINING BALANCE: 9 24 778 00 Fur poyoant arangeren s e: conesms, please Yiniel Payovni: ovsabar 15, 202 uatsinats win te Francs OfRan dung athue hours, Ts statements eongulergunerated and @qures no siznatum, For vertioaton viease cayuct the asbie s Ofios at me eudiess naontnd shove Dowurnent Canerated: November, 2228 at 12 00 ant"
    },
    {
        "image": "financialstatement2_synth_19_aug1.png",
        "label": "financialstatement",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS: Espafia Boulevard, Manila 1015 FINANCIAL STATEMENT Deora Marka {O18 rurase Tyre ommtercuranty runnvm, SUTTON _ GREGORY. ‘to Fst) ae “counrny or crrizexsiar: FPO (CERTIFICATION OF ACCOUNT STATUS This i to certy that GREGORY S. SUTTON. Fourth Year student enroled in the Bachelor of Science in Computer Science program dung the Second Semester, Academic Year 2025 2026, has the folowng financial ‘standing wth the university: TUITION AND FEE ASSESSMENT: Total Assessment for the Semester (947 078 00 Scholarship Grant Deductons 112 778 00 Net Amount Ove (922 081 00 PAYMENT SUMMARY: Total Payments Made 126 362 00 Outstanding Balance 10 00 ACCOUNT 'STATUS: CONDITIONAL Pending payment verification The student is cleared to enrol {or the next semester, obtain academic records, or participate in graduation exercises, ‘subject to settement of al francil obigatons. Additonal fnancil obigations may Include: Lbvary fines and unvetumed matenals Laboratory equipment damages or losses Student organization dues Dortory or housing fees This cerfation is issued ‘upon the request of the student for employment appieation. It vad for saty (60) days from the date of issuance and may be used for official tansactons mequiing proof of franca standing. Issued this November 11, 2025 at Mania 1018."
    },
    {
        "image": "financialstatement2_synth_19_aug2.png",
        "label": "financialstatement",
        "ocr_text": "| eveuan TAVEMENT a Riovard, ake 1282 LSPANOIAL STATEMENT os cect hese SERGRCANIN OF ACCOUNT STATUS The ts wety thet GREGORY 5. SINTON Fou Yon: siesect enmstes in he Sachete u Seinree Goerputar Eanes peje ‘aing foe Secs Sesounter, Acorns Ynas REE 2U25, naz ta tering rane ‘sadn Wh the wrwvercty: TTI AND ECE ASSESSMENT. Tetm Avensemant for we Seewnater ~f887 678 80 Sensietedertwnt Basset PHL 7TO CG Net Ament oe PREG 00 PREMENT SUMAN, 228 582 00 5 6 28 aonguNT ota Payenmnts Sle Outttansing Bosaice SRATUD: SOMUIIONAL Pensitg onrent wactceston The SluRon i wesied ts eat {or axl satrnsias. attain atedenie resents, cr astialawe m ymmiuetinn sraninee fui saterast of a8 nse’ vbiaions, Adonai inane! atigatny omy ‘esas «Lorry finan and unsere raterois Labuotary equa denager ay ‘mins Sturt ergarision dus Donne or housing tues This enithontan im aeved vuron the meio of shutent fe wring exalts Ia ve ote Ra daor fom v9 dats ct isonane se my be ured fr attectneniasiona mqusg goat ee vena saming, sues thi bene: 11, 2028 at funn 1518"
    },
    {
        "image": "financialstatement2_synth_19_aug3.png",
        "label": "financialstatement",
        "ocr_text": "[PLEASE TYPEOR PRINT CLEARLY ‘cau Foy Sara) Fis Gen PULL NO Fourth Year stu ‘during the Second Semester spaaing with te university: TUTION AND FEE TASSESSMENT: Total Assessment for the Semester (947 078 00 Scholarship Grant Deductions '912 776 00 Net Amount Due \"922 081 00 PAYMENT SUNMARY: Total Payments Made (926 302 00 Outstanding Balance {90 00 ACCOUNT STATUS: CONDITIONAL {forthe next semester qubjectto settement of at franca Saude: Library fries and unvetumed metersis losses Student eon tne request ofthe student for employment PPA This vad for sty ©0) days cused tor ofl transactons requeng Proof of ftom the date of ssuance and may toe ctandng, sued ts Noverber 11 2025 at Mania 1018"
    },
    {
        "image": "financialstatement2_synth_19_aug4.png",
        "label": "financialstatement",
        "ocr_text": "erred HTD TOMAS a arene Tpnensy oF SA STATEMENT pata baxaeuars, Morte #998 5 od weal (arewcis pages THEE CLARE eure peur nane 2 fected coarcan or cresie Ae veneer CaHRIEATION OF NCCC ST GREGORY ©. SUTTONS Se vent susan econa ie BEA! cecnses 1 Cg HA SNE PHT “tng tae arcs Secrest, Peterin Oo Pos gare. nao ia vssoene FAP rn oe wrsnnay. TUTION MS PE ADEs SMASH: Fatal asaasaent ‘gn Sores par 57nd Sonctersnsieant agus pen. 778i8 «Nat and SE rt 99 PANSENT SSREATE 2698209\" Vat Payor a ‘putanstng ast 90 98 MOEN gts SONDTION ‘acigans ensot sore nest somseser, be arent otesemment of a2 AAR vee any eee 30d vane) PO eit evsmntorpricaber. ant” TONY mowing H288 ne een coe aint te eT reopen. ened Yr ae SON tae nay 8 oe fs SPSS sessing sat O ep nce £1 a8 at nd TOS pion To se ran i geRGSRE WOES ania sganans oY era oes Panny pane gee rant, 0 9 roma, eee eos cot srr aS."
    },
    {
        "image": "financialstatement2_synth_19_aug5.png",
        "label": "financialstatement",
        "ocr_text": "PUASE TYPE OR PRT cue, FELL NAME: SUTTON 778 00 Net Amount De 1722 081 00 PAYMENT sUnauaRy: 20 362 00. ws! francial obigations may ment damages o"
    },
    {
        "image": "financialstatement2_synth_20_aug1.png",
        "label": "financialstatement",
        "ocr_text": "FINANCIAL STATEMENT i m Rienwe, Gea fine of Bannon amd Tease PLEASE TNR OR FAINT CHESNEY cau S OF cE un BRATARY P FOMER fo intonation Tachowbene “TIFICATION DF ACCOMIE STATES This to out Yes scant navn presi doreng the Fist Semester, Acadenvs Yeas frenca! tonding win the univarsiy: TUITION AD FEE ASS Aaerarmat tere Bachelur ot 8, has she ina 40 216 08 14 077 00 Het Bip 7Et PAMIMENT SUMMARY’ Tota Payevents Made BT 815 00 Oussinscs 80 05 ACHOUNT STATIS: CLEARED sing Ualonoe Tha exident ia pindtouly searns parsing fst wonton 19 ere ns, cr paviivate gave oovched, subject ty notlement of a8 fans! cbigations. Addtiona: Francia: chigetior sn ohace: Library foes and enreSuined tars Lehcstony equienent Samnger srlaxsex Student opckstion dues Dormer arhouting fees This eit Ye pn ou sequiett fhe shadent io ‘ve neat samaster, aptain atadeste 7 sa soptoitan mauioivant, 116 88 fae pins! af francial steesirg. sgucd ths Nevmmer 8, 2025 wt Quaz"
    },
    {
        "image": "financialstatement2_synth_20_aug2.png",
        "label": "financialstatement",
        "ocr_text": "EO DE HANIA UNIVERSITY een ay 10 r ven MANCIAL STATEMENT kaupunan (Giine of Finanoe rd 7 tegye PHEE OS REE CUTER rane FOWLER oRADLEY Figen cr Stave Phu gto semty that BADE tormation THON hes ta foe OLEH oF CHSHFE NIN. ym eoMKE a the Gacieses gf Toncom 0 sea Fru ves sudan 00 ‘Acedere Yess 2025: rogeu duc the Fest Semmes aagree vunnng wih a unceeTeey: THON AND FEE ASSESSMENT Tote arms somes ag eee ‘Senclawig Grant Deduction sa. 677 00 Te rg, 15 08 ment Gut SSUMRUARY «Tata Beprnerns Moe R279 15 0% Cotsanetng Balance uns STARE 2 vg ance Pe wes son ny cored panener ri gradest isi resend Guagatons Addtonel fare! ookgatons Lovsoiatery equament demoges nay cise. «Lary tne ae aver siesson «shaders onjmveaton ques Dottory af necking fees Tha oestheatnn nyu ror bin aie of meuance ane may Be US Fo oes 3. 2085 ak Quaran Cay requeng pinotot nantes standing Somued tos Movenbee"
    },
    {
        "image": "financialstatement2_synth_20_aug3.png",
        "label": "financialstatement",
        "ocr_text": "ee in Tease manaean, FINANCIAL STATEMENT Nal Ne eae in (puLsae TYPE OF Prat COEABLY vous ncane FOWLER \\eosh eat memes coxunray os enversaan, FRE cORTACATION OF ACCOUNT STATUS Thin 10 costly hat WAADLLY F FOWLER, Pes Veer tutent ansoted in 0 Baeneler oi Bcienue 8 tntermeien Verhnwingy ‘peatemic Your 20222028 Pas he tinea paogran cong te Prat Senate Granuns waning wi toe urivwenty TLATIOR AKO FRE ARSESSMENT Tatsh Accontarant forthe Semesior er ertr ro ‘Ser ctanne Owe otictnnt PLS eTT 00» Het Amount Doe ww. i78 09 PAYRMENT SURWARY:» Teta Pormaret Oe (927 819 09 Ouinientingy Saisore (90 00) ACCOUNT STATUS: CLEAPED Go Siameaiey solonen the votes oondioraty steered yercing haat westicaton Ws nat ter ne nent sametion Stan anadems recon, or pumerpete i guadalinn crecs sine te sunannent ct wl tnancia auinatons Addon tear sotyatens Teer rene, LEewyy a nd uname matey» Lacatory @gaipnent nmeyes Grimace Srudent omestaton suns Duory ormausing tees Yhie onricwtn iuoed pen te equnel We thst tr vow apptenton seabemects 6 wnt for Sota (63) aye ham tim ne af euares and wy ne used or ool asec ceesuicg proet ut rani smd, tamund Din Movenber OB, 2028 wt Duzer Cry 08"
    },
    {
        "image": "financialstatement2_synth_20_aug4.png",
        "label": "financialstatement",
        "ocr_text": "coensiey or eraize sone cin dont soda 2 rogram dug the Fest Seinester, Aoedorie Yeu 2025 i standing orth te universzy: TUMTION AND TEE AS B04 18 90 an mis s7608 Arsessieent ter ihe Sens Sahosenin von! Decueens Anos De BAYRENT SUMBARS Tata Bayiems Made B27 219 90. Ommandieg 8 Se Suiataneing bneviee The student s snestenety deans santirg fin! ventana lear forte est sevneste, of goadierss resus, 2 pantcipaie m gotciaton peeraias, wba lo soem of af fae! avigatins, Akane! francis! ubigations say snchce: henty nes ar unceivmed materacs Leaorutery quis’ caion dues Dosing 0: using (as The contiotion is devs far ving agnicaben reguisinanin, fie vai fOr linge arid say £2 uae fr eins! arsactions: a overbor 05, 2028 et Ouucon Cy cas fosues Stet apes sexing e304 2108"
    },
    {
        "image": "financialstatement2_synth_20_aug5.png",
        "label": "financialstatement",
        "ocr_text": "[FINANCIAL STATEMENT L ste bam: FOWLER CERTIFICATION OF ACCOUNT STATUS Tiss to sent eat BRADLEY POWER, 2 res Yaar stud lergiad n the Boahelar of Gownsn in Iowan Tashno ogy 2926, 88 te leew roeine Gunny ne Pest Sarrustar, Acactaiie Your 202 fnqncil standing wih the unicast TUTIGN ANT FREE ASSESSMENT Tow assent tore iu rtb00» Amant tus 819 178 09 MARY: «Tova Faymonts tages BET 913 00 Outstanding Salone 29 00 ACCOUNT STATUS, CLEARED so forte next sameatir, tain vealeie caits, ox paricipste oloiy quien dainages ereses Suidtert aigantaton dws Dornier orhgueing tees Tui wanficaso suas upon tha resuesto ‘eppisaten renuceoents, eat 0) dye aim ne date of raiong wus of francis! stencing issu iis Wvemiias 05, 2025 ot Quezon Cry si08"
    }
]