[
    {
        "image": "guidancerecord1_synth_10_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER. SDIVIOUAL INVENTORY FOR Girth Basic _ Educaticnat! Place of Work; Gowett Monte =~ ___ Gecepation: 1 Froieesionat 2 Masters 5 Tien onw Placa of Wor ted vars at Yaork GIDE. oF SFE 6 Contact Punter: Landline: 19) Caliphowe_ 9977 Home feieens, 6B Cordlera txts, Cayayan se 0: [J women parents [TT] Praaentouse \"7 panuitecy Staying with Redstive, [} Apartment SEROUS HE RECORE: amet o cect Address Veer Complated Nana Sotance righ Srivzot Lae Plas, Hogion Coekdantat ane Jantar High Schaal Honers Awords Rexewed Berson (s} supporting your studing aside from parent Relationship: NA Becupatton, ‘apts Go you have any oroblems? (Piease check} st dies “Forni Haiationships, with whom? Physical Heaith ___ thers, pluaze specify Finances Pecans, Chee Eneneis With whom would you like to discuss your probiom?. OWES"
    },
    {
        "image": "guidancerecord1_synth_10_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER PNDIMOUAL INVENTORY FORM Face where you we staying Fs (Pane: Home with parents Privaie Howse [2] dormitory Staying with Relatives Apartment LLL] Others: (tonne specity) SCHOLASTIC RECORD: Mame of scree! idee Vem Completed a an Pian, Negros Ocowenrat high Manta tens Hn Semot 7 Mewes we For Tronsferews Only: im Crteo Carticules tavubvements: “Soiree Toon, Grane is, Srivacmarey Gu Parson iF) supporting your studies aside froin parents: WA Relationship: WA Occupation: wa Any physical dsabilies er handican s) aviee Do you have any problems? (Hease check) Self Family J Physical Health ~~. thers, please specify Finances Preonts, Chee Friends With whem would you lke to discuss your probtem? NOTES"
    },
    {
        "image": "guidancerecord1_synth_10_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER: INDIVIDUAL INVENTORY FORM Father s Wante: Jace Breen, Seen Proose Check: Mothes s Mame: 7 ___ Skeupaties: tahveational Aainment= Setters Geer Prease Check: OFW HOMOFH aking Laneud _ vears at Work 21 No. of Brothers: \"Tho. of Sstaie__ Contact Summber: Landove: (99511 7025 Cellgbome _go77- see. 2104 Ceretens DAG Capen an oe Oe ic Pease check) Home with paccats Private Howse {7} Dormaory SZ} sting wah Relatwes Apsttivent LL] others: (Piease specify) SCHOLASTIC RECORD: fhame cf Schoo! adiess vem Competes Jplones [special abies: royanany, Wee vgn. Vana E8try Person {F) supposting your studies eside trom parents: MA Petationship: WA Any physical disabitties or handicap s) ssw fo you have any problems? (Please check} Seif Facnity Physica! Health oe FiENCOS MOTES"
    },
    {
        "image": "guidancerecord1_synth_10_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INGIIBUAL INVENTORY FORM Stra Nome Adress Birthdate: Nia Father s Mame: Please check Mest Please check, E Mo, of Reothers: of ns ABN Retinon: Roman Catone Educational Attainment: fa Home with parents Pevate Hoase Staying with Relatives apa J Gthars: loose specify) SCHOLASTIC RECORD: Hames of Schock Adress ‘Year Completing Pers Retati ship, Anny physical aisebiitios or handicapts} scp On you bave any problems? (Pleas. belt Laan __.. Relationshins, witty _Piyjsical Heaith nonene DUNS, Blesse specify _ Finances With whom would you Hke to discuss your prohtoin? NOTES"
    },
    {
        "image": "guidancerecord1_synth_10_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIIOUAL INVENTORY FORM fake: Bs Tisaiey Geknamay Stra: AAS “Bathplece., Uacoied Sa, Setangas Father s tame penne en 2 DECORA Pleose Chece: FT OFW 3g] OROFW inather s Reames Fp AEN ___ Seespation: ivose Checs Pog) HOR OW Place of Work: ed Years at Work 21 _ Contact Amber: Landline: Cellphone. oeT7 932134 ob Suet [7] ethers: tense sno Addewse mers Junior High Shout: Honors awacds Received: Fos Treasferses Grip: NA Extra Careicalar iavadeesnent parson (5) sapparting your Budins aside from parants: WA Relationship: MWA Occupation. ‘ey physical disabilities or handicaps} strana Ra you have any probiens? iPiease check} sult “Family Relationships, with wehow? _ _Physical Health thers, piease specity, Finances Wikh whom would you like 40 discuss your problem?, NOTES"
    },
    {
        "image": "guidancerecord1_synth_1_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "GUIBANCE CENTER INDIVIDUAL INVENTOH MY FORM fame: Be Date; Feeney Tracks Home adirass Buthdate: See arth Rawk. Hsrattoaal at Father s ame: Secupation Piense [5S] BON OF Place of Work Years at York 12 He of brothers: go wo. of sits g é Cellphone: cos: 29 Contadt amber: Lanvin: ne with garetts Staving with Refatver Pevate He CL) Apartment se thers: Please specify Addess eo Junior High Sroo! Bomorsjavcerds oie Cty, Cavite ies aside Fram pa Occupation: sia ap s) Relationship: WA Any physical disabsities SES Bhiysieal He __ finances va ike to With whom wauie y discuss your problem"
    },
    {
        "image": "guidancerecord1_synth_1_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL IRVENTORY FORM ies __ Chizonsiips, Filo with Rosle Region: 7 Educational Allawment: Prise sousiens Seperation _eeapation: “Eéacation a Ataiori De tos onw Works Savage Serinss me Ho, of Brothers: 0, Contact Bret Colighowe _ Moone Aina 3H? Beas Seat Hay Puce whera yous ae stayingin Oe oboe SE] Home with parents Staying with Relatives pete tewse [7 pennitery COD speriment £7 others: ease SEHOLASTIE ECORE Name of Schon! |, Sat Beda Cotege High Sehook Berson (8) sapparting your sbidies 25 from parents: WA Retations! an Occupation: wie any physical disanitities or Randicepis} Nove De you have any problems? (Please check} Set ‘amily Physical Heat oo Fnaree with whem woud you like to discuss your groi |, Fainty Members, Trusted Adials haan? NOTES"
    },
    {
        "image": "guidancerecord1_synth_1_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Name: Rush Ashley vega shy Date: February 21, 2025 fom) it) ‘(idaie) (ietname) ‘Track: _Academic Track Home Address: _312 Rojas Street, loio City Sex _Female Citizenship _Flpino Birthdate: Desense 03 2007 Birthplace _Quezon Cl, loio Birth Rank: 1 Religion: Budshism Father s Name: Wiliam Rush Occupation: Teacher Educational Attainment: Masters Degree Please Check: oFw [><]NON OFW Place of Work: _Pritpine Sohstons Corporation Years at Work_19 Mother s Name: Kay Gonzate Occupation: Teacher Educational Attainment: vocatonai Course Please Check: ‘OFW [><]NON OFW Place of Work: Savage Services inc. Years at Work_12 No. of Brothers _4 Wo. of Sisters\" 0 Contact Number: Landline: (5 960 5932 Cellphone: _0991 266 3690 Home Address: 312 Rojas Street loto Cty Place where you are staying n: (Please check) [><] Home with parents Private House Dormitory Staying with Relatives Apartment Others: (Please specify) SCHOLASTIC RECORD: Name of School Address Year Completed ‘San Beda Cot Hoo ty, Cavite 2019 Junior High School: ‘oleae Honors Awards Received: wth Honor, Academic Excelence Award School Last Attended Address For Transferees Only: Holy West High Shes /_Pasay Extra Curricular involvements: _Computer Club, Robotics Team, School Paper Staff Talents /Special Abilities: Singing, Playing Guitar, Pubic Speaking Person (s) supporting your studies aside from parents _N A Relationship: N A Occupation _Wwa Address _NiA ‘Any physical disabilities or handicap s) None Do you have any problems? (Please check) self studies Family == Relationships, with whom? Parents === Physical Health === Others, please specify_Social Adjustment inances — Famiy Members, Trusted Adults With whom would you like to discuss your problem? NOTES"
    },
    {
        "image": "guidancerecord1_synth_1_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "Fathers Name Preave Mother s tame: ip 0. of Beathers: GUIDANCE CENTER ISOMIDUAL INVENTORY FoRM. _Buthplace: 6 Cxeupats Home with parents CO] Pewat Staying with Refatives —f Apartment SEHOLAL TIC RECORD Pave or v house Strand. 838 i oes vesss a Work 2) nal Aitamenendt __] oratory Others: (Pisase ster Sutra. Curncwtar inved ements Talents /special Abuities Person ist supe. Reiationsty Be yo ay physical di Bee arty problerss? ieuse chet} Schoof Lost artontes iy: Hoe West Hat Senece studies aside ann parents 2 Oseupations tua bilan ov b andicapis} 6 seit Family Phys ences wal steal 8 you ke te discuss your problem? Fam, Memoers, 7 _adares; Rela Tha Studies e45, please specify Sorel aun tee Bets"
    },
    {
        "image": "guidancerecord1_synth_1_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Name: Rush Ashley Vega Ashiy Date: February 21, 2025 ‘fory) et) ‘(Whddie) ___ ickname) ‘rack: _Academic Track Strand: HUMSS Sex_Femsle_ Citizenship _F n= Home Address: _312 Rojas Street, lioto Cty Birthdate: Oecenber 03 2007 _ Birthplace: Quezon Cty, toto Birth Rank: 1 Religion: Budshism Father s Name: Wiliam Rush ‘Occupation: Teacher Educational Attainment: Maste s Degree NON OFW Place of Work: _Privene Soutors Coreraten Years at Work_19 Please Check: ‘OFW Mother s Name: Kayla Gonzalez Occupation: _Teacher Educational Attainment: Vocational Course Please Check: NON OFW lace of Work: Savage Services Inc. _Years at Work_12 No, of Brothers: SI 0. Contact Number: Landline: (5960 5852 __Cellphone _099 26 3690 Home Address 312 Rojas Stret, Toto Cty Place where you are staying in: (Please check) ><] Home with parents Private House Dormitory Staying with Relatives ‘Apartment Others: Please specify) SCHOLASTIC RECORD: Name of School address Year Completed Cobege tole Cty, Cavite 201 junior High Schook =\" cy 2 Honors Awards Received: Win Honors, Academic Excelence Award ‘School Last Attended Address: For Transferees Only: Holy West High Schoo! Pasay Extra Curricular involvements: Computer ‘Cub, Robotics Team, School Paper ‘Staff Talents /Special Abilities: Signa, Paying Gutar, Publ Speake Person (6) supporting your studies aside from parents: TWA Relationship: _WA ‘Occupation: WA Address _WA ‘Any physical disabilities or handicap s) Nove Do you have any problems? (Please check) self studies Family =< Relationships, with whom? Parents <= physical Health =~ others, please specify. Social Adustment Finances Family Members, Trusted Adults: ‘With whom would you like to discuss your problem?, NOTES"
    },
    {
        "image": "guidancerecord1_synth_2_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Name: Muphy Julia Hot wu Date; Febuary 24, 2025 ‘(Fomity) (First) ‘(Midae) ‘(Nicknome) ‘Track: Academic Track ‘Strand: STEM Home Address: _636 Apo Drive Extension, Marikina ‘Sec_Male _ Citizenship _Fltpino Birthdate: August 04, 2010 _Birthplace _Quezon Cty, Misamis Oretal Birth Rank: 5 Religion: Sevenh ay Asverest Father s Name: _Zachary Murphy Occupation: Nurse Educational Attainment: Sees Goss Please check: [_ OFW [><] NON OFW Place of Work: _Sasecenr wore weer comozafears at Work_3 Mother s Name: srarey Green Occupation: seaman Educational Attainment: Cotege Graduate Please check: | [S NOW OFW Place of Work: “=wSnceecmerconean Years at Work 9 No. of Brothers _4 No. of Sist FE 0 Contact Number: Landline: (6832 5629 Cellphone _0975 185 6985, Home Addrovs: (636 Apo Drive Extension, Markina Pace where you are staying in (Pease check) A Home with parents Private House Dormitory Staying with Relatives ‘Apartment Others: (Please specify) SCHOLASTIC RECORD: Name of School Address Year Completed ene Navolas, Bulacan 223 Junior High Schoot, \"#0 \"9\" Schoo! J J. Honors Awards Received: Honor Rol, Perfect Attendance School Last Attended Address For Transferees Only: N A J_NA Extra Curricular Involvements: _Voleybal Team, Chor Member, Youth Ministry Talents /Special Abilities: _Drawing, Painting, igtal Art Person (s) supporting your studies aside from parents: Deanna May Relationship: Grandparent Occupation _Drver ‘Address: Pasay Any physical disabilities or handicap s) vss mssrvet arecesa gaa) Do you have any problems? (Please check) <= self studies Family Relationships, with whom _ Physical Health Others, please specify Finances a Family Members, Trusted Adults With whom would you like to discuss your problem? ‘NoTES"
    },
    {
        "image": "guidancerecord1_synth_2_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM tame: Muy Fenn Track: Academe Track Home Address: _636 Apo Drive Extension, Marikina Buthdate: August 04 2010 Birthplace: Hot wu Wisse) (errame) __Gtizenship: F400 Birth Rank; 5 _ Religion: Seves9y Aavers Father s Name: Zachary Morphy Occupation: Nise Educational Attainment Please Check ofw [<]NON oFW Place of Work; 295 eer ors ese coe ears at Work 3 Mother s Name: syarey Green ~__Occupation _searan_ Please Check: OFW [><] NON OFW Place of Work Years at Work 9 No of Brothers: go of sisters 0 Contact Number: Landline: 975 185 6983 Home Address. 636 Apo Drive Extension, Marka Place where you are staying (Please check) - a Home with parents [><] Private House Dormitory Staying with Relatves [_| Apartment [5 others: (Please specify, SCHOLASTIC RECORD: Name of School Address Year Completed ‘Ateneo High School Nayotas, Bulacan 2028 Junior High School: J Honors /Awards Recened: ionor Rol Berest Atendance School Last Attended Address For Transferees Only: NA Extra Curricular involvements: _Voleybat Te: jor Member, Vout Talents /Special Abilities: rawr Pantng Ontal At Person (5) supporting your studies aside from parents: Deanna May Relationship: Grancoaent__ Occupation: Diver Address: Pasay Any physical disabilities or handicap s) _oss# mx ver careaee ogame Do you have any problems? (Please check) es self Studies homily Relationships, with whom? Physical Health others, please specity S>< Finances Famty Members, Trustes Aduts With whom would you like to discuss your problem? NOTES"
    },
    {
        "image": "guidancerecord1_synth_2_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Name: Murphy Julia Hot Ju Date: February 24, 2025 Tomy) ot) (Wiaate) (ieaname) Track: _Academic Track Strand _STEM Home Address: _636 Apo Drive Extension, Marikina Male Citizen ship _Fiipino Birthdate: August04, 2010 Birthplace: Quezon City, Misamis Oriental Birth Rank: 5 Religion: Sevenwoy Adverist Father s Name: _Zachary Murphy Occupation: Nurse Educational Attainment: Sere) Gaauate Please check: —[_] OFW [<]non orw Place of Work: Sasi cenzy Wana venrss Copyzqpears at Work 3 Mother s Name _syarey Green Occupation _Seaman Educational Attainment: Cotege Graduate Please Check: oFW Es jON OFW Place of Work: Smesnosecnercosram Years at Work 9 No. of Brothers _g No. of 0. Contact Number: Landline: (6 632 5623 Cellphone: _0975 185 6989 Home Adcress 1636 Apo Drive Extension, Markina Place where you are staying ni (Please check) Home with parents <| Private House Dormitory Staying with Relatives Apartment Others: (Please specify) SCHOLASTIC RECORD: Name of School Address Year Completed ‘Ateneo High Schoo! Navotas, Bulacan 2023 Junior High School: Honors Awards Recetved: Honor Rol, Perfect Atendance: School Last Attended Address For Transferees Only: NA Na Extra Curricular Involvements: _Voleyball Team, Choe Member, Youth Ministry Talents /Special Abilities: _Crawing, Paring, Dital art Person (s) supporting your studies aside from parents: Deanna May Relationship: Grandparent Occupation: Drver Address: Pasay Any physical disabilities or handicap s) sa rsiet areacwngaaee Do you have any problems? (Please check) self Studies === Family Relationships, with whom?. —__ Physical Health Others, please specify, Finances —s Famiy Members, Teste Aauts With whom would you like to discuss your problem _\"*™ NoTES"
    },
    {
        "image": "guidancerecord1_synth_2_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM ‘Occupation: Seaman ‘Educational Attainment: Cotege Graduate MON OFW Place of Work: we sncwmcmercomran Years at Work 9 __ Please Check: orw Cellphone: _0875 185 6963 No. of Brothers _g To. of 0 Contact Number: Landline: (8 852 5629 _ Home Address: __ 620 Abo Drive Extenelen, Mert a Others: (Please specify) Address ‘Year Completed ‘School Last Attended tra Curricular Weta Team, Cho Member, You MSY Address: Pasay Oo Person (5) supporting your studies aside from parents _Oeanne May Relationship: Grandparent s Deter _f ‘Any phrysical disabilities or handicap s) w= mewweterere ww pry Do you have any problems? (Please check) >< Self __ Studies ——— Relationships, with whom? _ Physical Health Others, please specify Finances Famty Members, Trusted AS With whom would you like to discuss your problem?"
    },
    {
        "image": "guidancerecord1_synth_2_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER JNONIDUAI INVENTORY FORM __ date jie Rank: 5. nal sitawenvent’ ure ce eyears af NO iccatiomal Attawumvent: Coleg years a Euipiece: Gverr ¥ __cecupation father s Ham Please Oneck Mathers Hames Please Cheese Bo of Brothers 4 SE ecapaten. Toe eon nw Contact fiumber: Landline: we Pena purate ous [porary Scniotas nc RECORD: shame of Schzot preneo Hh avatae, Busean umios Nigh Schack outs nands Recetrat ferses Coiy Entra: Cetsiewiar favebvernent: Supporting your Retati 2 Sranasarent avy pivgsical disabilities oF Randicapis} fg you have any problems? Please check Re ars, please speuity Facnity Piysicat Health Pens vested Sens"
    },
    {
        "image": "guidancerecord1_synth_3_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM pate: £7826, 2028 Name: Ponce Trujlo Jen enim) ren Tpaaaey Weave Track: (eer: Vocational ivetnood (TVL) Track ‘Strand: ‘AgriFishery Arts: Home Address: \"722 Jasper Road, Makati Sen_Female citizenship: Fiipino Birthdate: January 17, 2010 Birthplace: Parafiaque, Birth Rank: 4 Religion: Islam Father s Name: “Christopher Ponce. ‘Occupation: “Government Employee Educational Attainment ‘Some Colege Please check: [|_| OFW [XJNow oFw Place of Work: oa Texans co Years at Work_21 Occupation: Government Employee ‘Educational Attainment: High Schoo! Graduate Place of Work: “Carroll World Capital Limited ‘Years at Work_10 Jennifer Mother s Name: Please check: jON OFW No. of Brothers: =o. Contact Number: Landline: ayaes 2463___Cellphone _0980 711 9852 ome Address: 722 Jasper Road, Makat SS SS Place where you are staying in (Pease check) [| Homewith parents [_] Private House Dormitory stayingwith Relatives BS ‘Apartment others: Please specify) SCHOLASTIC RECORD: Name of Schoo! Address Year Completed Miriam College Makati, Cebu mm junior High School: J. Honors Awards Received: NA ‘school Last attended Addeess For Transferees Only: NA NR Extra Curricular involvements: ‘Volleyball Team, Choe ‘Member, Youth Ministry. Jaents [special Abilities: Shana, Payne CHL ube Speaking person (6) supporting your studies asi From parents: WA Relationship: NA ‘Occupation: WA ‘Address _N A ‘Any physical disabilities oF handicap s) None ‘Do you have any problems? (Please check) self studies === Family === Relationships, with whom _Frends Physical Health others, please specify. Finances ‘School Counselor, Teachers With whom would you like to discuss your problem? NOTES"
    },
    {
        "image": "guidancerecord1_synth_3_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER ERDIVIOUAL RVENTORY For Father s Name: Cir Please Check: iz Mathers same: gree Pitave Crees, PO Ho. otiothons: boty 5 Nowe Aree ‘a wa you Detention: (DS ROR ory Geonpation: Retigivas Educational attsinrveat Pe Bene with pares; Private Rowse LOI Slasing sith getativas ISS} apactmaat SCHOLASTIC RECORD, Mamie of Schoot Aare JUS High Schon 7 Mikal Cota Honowsawvascts teesboad: 8S OF handleanis) Sieme? Pease check) Sel Be you have amy pew Soho Counsety"
    },
    {
        "image": "guidancerecord1_synth_3_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Name: Ponce Jenner Truilo Jen Date: AP 126, 2025 (Fomiy) it) ‘iaele) (Wekname) ‘Track: _Technical VocationalLivetiood (TVL) Track Strand: Agr Fishery Arts Home Address: _722 Jasper Road, Makat Sex _Female_ Citizenship _Fipine Birthdate: _Jenwary 17 2010 Birthplace _Paraflaque, Davao del Sur Birth Rank: 4 Religion: Islam Father s Name: _Christopher Ponce Occupation: Gevennent Enseyee Educational Attainment: Some Colege Please Check: OFW [><] NON OFW Place of Work: Ges Tesnsogescoprain Years at Work_21 Mother s Name _Brney Bai Occupation _Govemment Employee Educational Attainment _tigh School Graduate Please Check: oFW [><] NON OFW Place of Work: Carrol World Captal Limited _Years at Work_10 No. of Brothers: _4 No. of Sisters: 0 Contact Number: Landline: (4 465 2463 _Cellphone _ 099 711 9853, Home Address: \"722 Jasper Road, Makati Place where you are staying in: (Please check) Home with parents Private House Dormitory staying with Relatives [5] Apartment Others: (Please specify) SCHOLASTIC RECORD: Name of Schoo! Address Year Completed Miriam Cot Makai, Cebu 202 Junior High School: Neoe Honors Awards Received: NAL ‘School Last Attended Address For Transferees Only: NA NA Extra Curricular involvements: _Voleyball Team, Choir Member, Youth Ministry Talents /Special Abilities: _ Singing, Playing Guitar, Pubic Speaking Person (5) supporting your studies aside from parents: N A Relationship: _N A Occupation _wa ‘Address _N A Any physical disabilities or handicap s) None Do you have any problems? (Please check) Self Studies === Family <= Relationships, with whom _Friends Physical Health Others, please specify Finances ——. ‘School Counselor, Teachers With whom would you like to discuss your problem?. NoTESs"
    },
    {
        "image": "guidancerecord1_synth_3_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM. Name: Ponce Jenniter Trullo Jen Date; APr126, 2025 Fomy) ft) ‘iaeie) (ekname) ‘Track: _Technical Vocational Livetnood (TVL) Track Strand: Agt Fishery Arts Home Address: _722 Jasper Road, Makati Sex_Female Citizenship _Faino Birthdate: Jenvary 17 2010 _ Birthplace _Paraiaqve, Davao del Sur Birth Rank: 4 Religion: Islam Father s Name: _Chrstopher Ponce ‘Occupation: Covenmert Enptoyee Educational Attainment: Some Cotege Please Check: [_] OFW [><] NON OFW Place of Work: Goo Texwaoyescopmat Years at Work_21 Mother s Name _griine, Occupation _Govemment Employee Educational Attainment: _tigh Schoo! Graduste Please Check: OFw jON OFW Place of Work: Carrol Wor Capital Lmted Years at Work 10 No. of Brothers: _4 No. of Sist Contact Number: Landline: (4 465 2463 _Cellphone _0999 711 9853 Home Address: 722 Jasper Road, Makati race where you are staying i: (Please check) Home with parents Private House Dormitory Staying with Relatives [><] Apartment Others: (Please specify) SCHOLASTIC RECORD: Name of Schoo! Address Year Completed Miriam Cotege Makati, Cebu 2022 Junior High School: J. J. Honors Awards Received: N A School Last Attended Address For Transferees Only: NIA NA Extra Curricular involvements: _Voteyball Team, Choir Member, Youth Ministry Talents /Special Abilities: _ Singing, Playing Gutar, Public Speaking Person (s) supporting your studies aside from parents: N A Relationship: _A Occupation: 1a Address _NA ‘Any physical disabilities or handicap s) None Do you have any problems? (Please check) self Studies =< Family ==—== Relationships, with whom _Friends Physical Health Others, please specify Finances os Ser School Counselor, Teac! With whom would you like to discuss your problem?, nee woTes"
    },
    {
        "image": "guidancerecord1_synth_3_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Age 28, 2025 petiedate: Janus Suth Rook 2 ‘Sathas s Mat an caltonal staan Please ‘OFW Secapstion Gucatond Ataris Mother s Heme: 2 Blease Check, FL OF RON DEY vanis Work 10 fo, of bratbers: 47H. of Sts yep Road, Skat, Home Sates: you are staying (Pivase che Home with parents Private Howse Stang with Robes SS Apartinent [2] penmtory [TF others tease spe address ‘tear Completed jior tgp Sek00 sonarsfiaatds Bee For Dansferves fEvtea Corrisatar te Barvon {5} supporting your studies aside from Relationside: 2A. _Secrapation: ‘Asyy physical disabites or tandiicop s) 1 bo you have any problems? (Please check} Physical Healt: Finances ike to discuss your protien? inte xeom would you NOTES"
    },
    {
        "image": "guidancerecord1_synth_4_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM See Female Citvenshigs Mee Bathedater A, 2070 “a Tbirta Rank: 2 Rebon: Roman Cave: Fatives s Naru doce an 7 <— Prease Check: Woes at Work 6 other s Have: _ Fidacational Sitaimment: asters Segoe Pheie Checks Teeecart mmr Wears at Werk fe cftrotbare {the os of Sit Home Sadenss: 2 30hOrwe. ara Paes where you ue Btaying i: (Pease check) Homewith parents [[\"] Private House A Dormitory Staying with Retatives (5) Apartment ‘Oibers: (Pease specfy) Contact Humber: Laadime, {i747 ue Ceiphome cosg ce5 7400 SCHOLASTIC RECORD: Name of Schoot Address Year Compictet Berson (1) supporting your studies aside from parents: NA Relationship: WA Oceupation: ‘Ansy physical disabilities or handicapis} Asma Do yous nave any problems? (Pease check) sett Parente, Cone Friends with whoo would you lie to discuss your proiem? \"OS “PT NOTES"
    },
    {
        "image": "guidancerecord1_synth_4_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Name: Moris Matthew Turner Mats Date: November 30 2024 oy) Feat) (Wide) (Wiciname) Track: _Aits and Design Track Strand: Media Arts Home Address: _227 70th Street, Makati Sex _Female _ Citizenship _Flpino Birthdate: Apri 10 2010 Birthplace _Pasig, Davao del Sur Birth Rank: 2 Religion: Roman Gathotc Father s Name: _Jeremy Morr Occupation: Lawyer Educational Attainment: Masters Degree Please Check: OFW [><]NON OFW Place of Work: _RXUA Shipping Inc. Years at Work_6 Mother s Name: Occupation _IT Professional Educational Attainment: Masters Degree. Please Check: OFW [><] NON OFW Place of Work: =A2Smmicara canes Years at Work_1 No. of Brothers: _1 No. of Sisters: —_3 Contact Number: Landline: (4 747 3208 _Cellphon 969 440 2430 Home Address: 230th Drive, Makati Place where you are staying in: (Pease check) Home with parents Private House Dormitory Staying with Relatives [5<} Apartment Others: (Please specify) SCHOLASTIC RECORD: Name of School Address Year Completed La Sale Green Hits Navotas, loio 2021 Junior High Schook: Honors Awards Received: __Wth Highest Honors, Valedictorian School Last Attended Addeoss For Transferees Only: NA NA Extra- Curricular Involvement: _ Swimming Team, Drama Club, Environmental Cub Talents /Special Abilit 5: _Programming, Web Design, Video Eating Person (s) supporting your studies aside from parents _NA Relationship: NA Occupation: N A ‘Address _WA Any physical disabilities or handicap s) Asthma, Do you have any problems? (Please check) Self =< studies >< Family =>—<= Relationships, with whom? _Classmates Physical Health, Others, please specify >< Finances With whom would you like to discuss your problem?, Parents, Close Friends NOTES"
    },
    {
        "image": "guidancerecord1_synth_4_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Name: Morris Matthew Tuer Mats Date: November 30, 2024 amin) rt) (ite) (Wiekname) Track: _Arts and Design Track Strand: Media Arts Home Address: _227 70th Street, Makat Sex _Female _ Citizenship: Fiipino Bithdate: A071 10 2010 pirthplace _Pasiy Davao Geir Birth Rank: 2 _ Religion: Roman Cathois Father s Name: _Jeremy Moris Occupation: Lawyer Educational Attainment _itasters Degree Please Check: NON OFW Place of Work: _RXUA Shipping in, Years at Work_6 Mother s Name: Occupation: IT Protesioal Educational Ataaere, Masters Degree Please Check: jON OFW Pisce of Work: Rut ametceconram Years at Werk? No. of Brothers _j— Contact Number: Landline: (3 747 3208 Cellphone: 969 440 2430 hae 230th Drive, Makati Place where you are staying in: (Please check) Home with parents Private House [J Dormitory Staying with Relatives [SZ] Apartment Others: (Please specify) SCHOLASTIC RECORD: Name of Schoo! Address Year Completed se Navetas, oso Junior High School: ‘2 Sate Green Hts 2021 Honors Awards Received: wih Highest Honore Valedicorian School Last Attended Address For Transferees Only: NIA NA Extra Curricular involvements: Swimming Team, Drama Chub, Environmental Gub Talents /Special Abilities: Programming, Web Oesign, ideo Eating Person (s) supporting your studies aside from parents: NA Relationship: WA Occupation _wa Address _WwA Any physical disabilities or handicap s _Astima Po you have any problems? (Please check) Self >< studies Family === Relationships, with whom? Classmates Physical Health Others, please specify <= Finances Parents, Close Friends With whom would you lke to discuss your problem? Notes"
    },
    {
        "image": "guidancerecord1_synth_4_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Name: Moris Mattrew Tuner Mats Date: November 30, 2024 Fomity) First) (dade) (Nickname) Track _Arts and Design Track Strand; Mesa Acts Home Address: 227 70 ‘Street, Makati Sex _Femaie _ Citizenship: Flipino Birthdate: Avel10 2010 Birthplace: Pasig, Davao dei Sur Birth Rank: 2 Religion: Roman Cathois Father s Name: Jeremy Morris Educational Attainment: Nasters Degree lace of Work: _RXUA Sipping ne Years at Work_6 Professional Educational Attainment: Master s ree Please Check: OFW Seve Capea Corpraton Years at Work_1 ‘No. of Brothers _ No. of sist 787 3208 Cellphone: _0969 440 2430 Home Address: 2 30th Drive, naka _ Place where you are staying in: (Piease check) Home with parents Private House Dormitory Staying with Relatives Apartment Others: (Please. Specify) SCHOLASTIC ‘RECORD: Name of Schoo! Address Year Completed loo Junior High Schoot, ‘2 Sate Green Has y_ Neves pm Honors Awards Received: wan Highest Honors, Valedictorian School Last attended For Transferees Only: NA Extra Curticular involvements: Swimming Team, Drama (Cis, Environmental Cub alents /Special Abilities: Programming, Web Dean, iso Eating Addeess NA Person (s) supporting your studies aside from parentsy Wa Relationship: wa Occupation: wa Address _Wa Any physical disabilities or handicap s) Asinma De you have any problems? (Please check) Self >= studies Family =< Relationships, with Whom? Classmates Physical Health Others, please specify =< Finances Me Parents, Close Friends With whom would you like to discuss your Problem? ores"
    },
    {
        "image": "guidancerecord1_synth_4_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER eQESIGUAL RIVERTORY CORD Novernber 30, 2028 He Coecnpatians_ sf Peete other s Bee ea Pease chert jal (on Fw Piece of Wark: ho, af Brothers: 2. Contact Muntres: Lansing: ame Asses race ware yosare styea (auae EK? 7] Momeweh parents [_j Srivatedivese 77] sortary Stayingnith Relatives GEC} Apacment 7} nian: (ease SPC orem SEROLASTE RELIES: Ratsess ear Completed ame of Sehet a Sate Green He sonior High Schnee: “EEO Mosassikwvardr Facebved For Tronsferaes Oni: eatratrrteatae tat esnent parson fs supporting yun a adtationstép: BA __ Dorupatlort ag physica’ disabities or hand By you have aay problems? (Meare check} __ a Fanelly _, Pysital Health SSeS Finances segeerhwown would you tke to diseuss your probten? ee Serius swith wha? ines, please specily, NOTES"
    },
    {
        "image": "guidancerecord1_synth_5_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL ItVENTORY FORM _ Sith Rawk: 7 Peigion: : ey Gueupatien ab Attainment: Somge Gisduce Pease Check: x Teor orw ier years a Weak other s acm Please Che gna RBA: S38 Mae DSelNoWorW ——Bhece of wi io. of Sisters __Educaiioaal Atement: masters Segre Tau eas a Work 2h -_ ats Piece were you ares a PO) Home with pa [0] private Hose Staying with Relatives [TT] apartment SERORASTIE RECORD: vex Competed hasiae High School: Honossavares Person {51 suppo Relationship: Any sbysical disabi Bayou ha _ Family __ Physical Healy Rinances sted Others, Parents, Clase Frisnss with whom: would you iscuss yous probler NOTES"
    },
    {
        "image": "guidancerecord1_synth_5_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER IRDIVIOUAL INVENTORY FORE Father s Maine: Plesse Caeck ace of Work, bothes s flame: _Dectpatien: eae Pease checks Ise) Non orw Pace of Works He. ab Brathers: \"fa. of RIES 1 Contac fiueaber: Landing Heme dadresg: 798 tn Aver Role Cy Pisce where you ae slaying hc (Peamie chek} [oo Mewsevath pacents [77] pret souse ES] stoping wth Retatives 7) Apartment _] Others: (Please saesify) SCHOLASTIC RECORD, Hiwoe of $choat Aaldeess tentos High Schoet Honersjtmatds Beeaned Sacred Hoaet Sehvect panzer hs, Pampansa 2018 ‘awe any prablens? (Please check) _Sef Studies Family orships, with wham Physical Health ceneenan. There, ghease specify, Finances i you lie t9 disosss your protien? Parents, Coxe Fen With whom w _ BOFES"
    },
    {
        "image": "guidancerecord1_synth_5_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Name: MeKRney Amanda amas Date: May 21 2025 Fomty) erst) Pucameme) ‘Track: Sports Track Strand: Sports Track Home Address: _794 Luna Avenue, llolo Cty Sec_Femaie Citizenship _Flpro Birthdate: _sarvary 20 2008 Brthplace _Pasig, Laguna Birth Rank: 1 Religion: Bor Agan Crrstan Father s Name: _Chvstopher Mckinney ‘Occupation: OFW- Enger Educational Attainment: _Cotege Graduate Please check: [><] OFW ]NON OFW Place of Work: Hons Kons Years at Work_& Mother s Name: 5 Occupation: Sales Manager Educational Attainment: Masters Degree Please Check: OFW |><|NON OFW Place of Work: KA Century Finance inc. Years at Work_21 No. of Brothers: _7 To. of SisteFS _1_ Contact Number: Landline: (9 670 2159 Celiphone _0972 812 9659 Home Address; __784 Luna Avenue, Toko Cty Prace where you ae staying (Please check) Home with parents Private House Dormatory Staying with Relatives ‘Apartment Others: (Please specify) SCHOLASTIC RECORD: Name of Schoo! Address Year Completed Junior High SchootS2 Heat Seton Sen Cy. Peoangn yn Honors Awards Recewed: WA ‘School Last Attended Address For Transferees Only: Holy Scot Hgh Schoo! J Bacolod Cty Extra Curricular involvements: Basketbal Team Captan, Math Club Member, Student Council Talents /Special Abilities: Sega, Paying Gutar, Puble Speaking Person (s) supporting your studies aside from parents: NA Relationship: _WA Occupation: wa ‘Address _WA ‘Any physical disabilities or handicap s) None Do you have any problems? (Please check) Selt on Studies Family Relationships, with whom? Physical Health Others, please specify Finances Parents, Cove F With whom would you like to discuss your problem? one Frence"
    },
    {
        "image": "guidancerecord1_synth_5_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Name: Mckinney Amanda Bean Amas, Date: May 21, 2025 (Formity) (First) (Migole) (Nickname) Track: _Sports Track Strand: Sorts Track Home Address: _794 Luna Avene, olo City Sex _Female Citizenship: F890 Birthdate: _Janvar/ 20 2008 Birthplace _Pasip, Laguna Birth Rank: 1 Religion: Bom Again Christan Father s Name: _Christopher Mckinney ‘Occupation: OFW Engineer Educational Attainment: College Graduate Please Check: rw [_ Non orw Place of Work: _Hong Kong Years at Work_8 Mother s Name: Erica Bates Occupation _Sales Manager Educational Attainment: Master s Degree Please Check: OFW [><] NON OFW Place of Work: _KA Century Finance Years at Work_21 No. of Brothers _7 Wo. of Sisters: __1_ Contact Number: Landline: (9 670 2159__Cellphone _0972 812 9659 Rome okra 794 Luna Avenue, tole Cty Place where you are staying n: (Please check) Home with parents Private House: Dormitory D<] Staying with Relatives ‘Apartment Others: (Please specify) SCHOLASTIC RECORD: Name of Schoo! Address ‘Year Completed ‘Quezon Cty, Pampanga Junior Wigh Schook_S2 709 Heat Schoo !l iy, yp? Honors Awards Received: NA School Last Attended Address For Transferees Only: Holy Scott High School __ _Bacolod City Extra- Curricular Involvements: _Basketball Team Captain, Math Club Member, Student Counci Talents /Special Abilities: _ Singing, Playing Guitar, Puble Speaking Person (s) supporting your studies aside from parents: N A Relationship: N A Occupation _WA ‘Address: N A. ‘Any physical disabilities or handicap s) None Do you have any problems? (Please check) self __studies Family Relationships, with whom? Physical Health Others, please specify pyeoees Parents, Close Friends With whom would you like to discuss your problem? NOTES"
    },
    {
        "image": "guidancerecord1_synth_5_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Father s Rema: Chstionet Please Checks j Kor Mother s Name: E icational Altaisment: Hesse Chere fogiRaironw Fanos ine i. fe, of Breehvers _g Heo. a Siskel Contact Member: Landis: ue ema feos Pace utero you eee ote [7] tome with parents '] Staying with Relatives Private Host [| Apartment SCHOLASTIC RECORE: Hames af Schsat Addvnss ‘eve Coempieted Suszan Oty, Pompango anion High Sehsot _” Houare awards Reeet nd, Ror Transferees Oniys Extra Caurieater bevsive Deyeu ieee Tn {Please check} cece SAH Studies Fasely __ Relationships, with wham?, Physical ethers, please specify _ nance Bares, Ciene Fstenda ath wrheny would you like to discuss your orobien? wares"
    },
    {
        "image": "guidancerecord1_synth_6_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM ame: Petersen ___Vocent vwitams ve Date: 20 4 2028 Pom) oa) ‘irade) (chore) ‘Track: _Sports Track ‘Strand: Sports Track Sec _Female_ Citizenship: F&°°° Home Address: _215 Consielaton Road, Cagayan de Oro Brthdate: Aug st07 2010 _ Birthplace _Lae Pfs, Davao del Sut Girth Rank: 4 _ Religion: Born Agan Crostan Father stlame: Janes Petersen ___ occupation: crt Tern Educational Attainment: Sener Gases Please Check: [x] oFW im NON OFW Place of Work: _Qatar Years at Work_6 Mother s Name: (s Occupation _Saies Manager Tducational Attainment: Elementary Graduate Please check: [| OFW [><] NONOFW Place of Work; noamcomceramer covemafears at Work_16 fio. of Brothers: To. of sisters\" _3_ Contact Number: Landline: (2492 3086 Cellphone: _ 09995732634 Home Address: '50 Pandan Streei, Cagayan de Oro Place where you are staying in: (Please check) Home with parents Private House Dormitory staying with Relatives ‘Apartment Others: (Please specif) SCHOLASTIC RECORD: Name of choo! Address Year Completed Phipine Si schoo! Pasig, Buscan Junior High School: fence on s ym Honors Awards: Recenwed: NA School Last Attended Address For Transferees Only; San Netson High School y_Pasay Extra Curricular lnvolvernents: Dance Troupe, Debate Team, Science CM ‘Wang, Poetry, Creative Writing Talents /Special Abilities: Person (5) supporting your studies aside from parents: WA Relationship: _NA Occupation _WA ‘Any physical disabilities or handicap s) None Do you have any problems? (Please check) >= self Studies Family Relationships, with whom? _ Physical Health === others, please specify_Tme Management —_ _ Finances Famiy Members, Trusted Adults With whom would you like to discuss your problem?, Address _N A ‘NOTES"
    },
    {
        "image": "guidancerecord1_synth_6_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER RVENT ORY FORM WOWIOUAL Bick wane Educational Aitaiemient fears sjouat Aiatvinsest vases cso eH WOK 64 Bt ear, please Che Vow ony pes Hance AEE py “ioecap tion: Biense Che VP aen poz ROR ORE Ere hn of Brothers: Re of Sates canta Feat on Hone Ae veg (ease cee) eee apace (| vate toate canna wee astatives garnet jeted padres ear Cami SEOLAS TE RECORD: igaree of Sehvoot santos Hi Hon arsieae kos Tra Extra Cureeatar ve best Saison is supporting your studies aside froin parents groupation: 2A yee felationshig: any ghyneal ins of handicaps go youbave any problems! Pee eee Self studies relation’ ich Healt “Finances Tike te discuss v ar probient?,"
    },
    {
        "image": "guidancerecord1_synth_6_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Name: Petersen Vincent Warns Vn Date: 4 24, 2025 Fominy ie) (Weddle) (Wekname) ‘Track: _Sports Track Strand: Sports Track Home Address: _215 Constetaton Road, Cagayan de Oro. Sec_Female_ Citizenship: Fino Birthdate: August 01 2010 Birthplace _Las Prias, Davao del Sur Birth Rank: 4 Religion; Bom Agan Chratian Father s Name: _James Petersen Occupation: _orw raarexvivawe Educational Attainment: Eenetan Gracie Please check: [><] OFW [_ ]NONOFW lace of Work: _Gatar Years at Work_6 Mother s Name: Occupation: _Sales Manager Educational Attainment: Elementary Graduate Please Check: [| OFW [><] NON OFW Place of Work: Uno7p Crown Deveamnert comratfears at Work_16 No. of Brothers: _ Wo. of Sisté7s\"— 3 Contact Number: Landline: (2492 3086 Cellphone: _0999 573 2634 Home Adress,” 30 Pandan Stee Capayan de Oro. ee ee Pace where you ae staying x (Pease check) Home with parents Private House <] Dormitory Staying with Relatives ‘Apartment Others: (Please specify) SCHOLASTIC RECORD: Name of school Adress Year Completed Prope Science High Schoo! Pasi, Bulacan x22 Junior High School: a yl J Honors Awards Received: N A School Last Attended Address For Transferees Only: San Nelson High Schoo! J_Pasay Extra Curricular involvements: _Dance Troupe, Debate Team, Science Cub Talents /Special Abilities: Wiring, Poetry, Creative Wing Person (s) supporting your studies aside from parents: WA Relationship: WA Occupation: wa ‘Address _WA ‘Any physical disabilities or handicap s) None Do you have any problems? (Please check) >= self Studies Family Relationships, with whom? Physical Health === others, please specify Time Management Finances ——__ Famty Members, Trusted Aduts With whom would you like to discuss your problem?\" -Trested NOTES"
    },
    {
        "image": "guidancerecord1_synth_6_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER eet INDIVIOUAL INE NEOFTE tank CEE cesta peireorar Spas Pa trtocation 2! teament: vows Beare Sane Bow et Berbptre womne aowes 27 suthatate: SOS fakes tame: eg fe “Fale avona! Daameent rev Seon Seaber s Mame” gga btext Sevens Pieats ee oes Have of ort a coasts A 9 errs ~_Calipoone sone _ Mo af Brottens sinekovess 2 TE Herne acit parent L stapang nh Bobs ar ‘30n devour =F] poimaary nbs 1 apartment to SOLOS EC PTD ates ten vracune Se Hah ENE Migh Geb ao?, etn Pecerred tteae’ voi tee Wee ORS sigs Mpocw AbsnveL: spporting yOUC Tpadien aside fee ee ne BEI PREON. piiajes ov handeastsy Be 7 Pease check set Stunies Pinyical ieath: tenance Pecson it Poiationsie any physical Ot Do you hase are probe Ketateanalyps with whem? nn ase apecty fo Wisc ass yout preDleny? fe yrhoar souks you whe Neues"
    },
    {
        "image": "guidancerecord1_synth_6_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIRUAL INVENTORY FOR vty 24, 2008 shi Fi Born Ago Chvstan fivhdate: Father s Karme: Biense Cheek: pu now: wth Ranke 4 Educationsi stlaisrment: ww Mother s Mamie: si cowards TT _ Greupation: ae Please Chests P| GW Tel NON OF Sach Ver sa Deere $F Work Mo. of Beatherst 107 2. Contact Number: Landline: —Celiphone: goes. 575 285 Horne: sirens (CA Homesite garents LL] Staying wats Relatives Ch Private Howse, Apartment Doeattery Cher: 032 specify) AC RECOM: Rava of Schwat Address Compicted ‘ears For Transforees Cngy, Sen Helgon Hah Sete Bunce Traup, abate Tenn See Person {s} supporting your studies aside from parents 2 Secupation: tua Any physical disaiabtins sa Randicap s} Non Bo you have any problems? (Please check) Adtress: ui Faroily Halationshins, with whom? Physical Hewitiy Others, please spe Finances Fam Mera, Trusted Malte With whoo would you tke to discuss your problem? HOPES"
    },
    {
        "image": "guidancerecord1_synth_7_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Name: otnson Justin Fier us Date; Avast 22 2025 (Fomity) (First) (Middle) (Nickname) ‘Track: Academic Track Strand: STEM Sexc_Male Citizenship _F#°° Home Address: _142 Capricom Drive Extension, Cebu City Born Again Christian Birth Rank: 1 Religio Birthdate: March 31, 2009 Birthplace _Quezon Cty, oto Father s Name: Anthony Johnson ‘Occupation: Seaman Educational Attainment: Colege Graduate Please check: [_] OFW [><]NON OFW Place of Work: _NaiaGeeseResarcescuraston_Years at Work_2 Mother s Name: on Occupation _Driver Educational Attainment Graduale Please Check: ONOFW Place of Work; =eunocenyEnemeene _Years at Work_2 Contact Number: Landline: (77636 6811 ___Cellphone _0963 366 5260 No, of Broth Home Address: 1142 Capricorn Drive Extension, Cebu City Place where you are staying in: (Please check) Home with parents Private House Dormitory Staying with Relatives ‘Apartment 3] others: (Please specify) Boarsns House SCHOLASTIC RECORD: Name of School Address Year Completed tole Cty, Bulacan 202 dentor High Sehoot 2S Sen Hie ty, L Honors Awards Received: ‘Academic Achievement Award Schoo! Last attended Address For Tronsferees Only: San York High School J_Manta Extra Curricular Involvements: “Computer Club, Robotics Team, School |Paper Staff Talents /Special Abilities: Programming, Web Design, Video Esting Person (5) supporting your studies aside from parents: VA. Relationship: N A Occupation _wA ‘Address _N A ‘Any physical disabilities or handicap s) Nove Do you have any problems? (Please check) self << studies =< Family Relationships, with whom? =>—<= physical Health === others, please specify_Social Adustment Finances —— Family Members, Trusted Ads With whom would you like to discuss your problem?, my NOTES"
    },
    {
        "image": "guidancerecord1_synth_7_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Name: Johnson Justin Fisher us Date: August 22, 2025 fami) Tad Wide) Ricinare) Track: _Academio Track Strand: STEM Home Address: _142 Caproom Drive Extension, Gebu Giy Sex_Male_ Citizenship _Filoino Birthdate: March 21, 2009 Birthplace _Quezon Gi, Ibio Birth Rank: 1 Religion: Born Again Christin Father s Name: Anthony Johnson Occupation: Seaman Educational Attainment: Colege Graduate Please chee OFW [><] NON OFW Place of Work: Years at Work 2 Mother s Name _K3yiB Robinson Occupation _Driver Educational Attainment: _Colege Graduate Please Check: OFW [><] NON OFW Place of Work: Seunocensyeremesn Years at Work 2 No. of Brothers: Wo. of Sisters: 2_ Contact Number: Landline: (7 636 6811 _Cellphone __0963 366 5260 Home Address: 142 Capricorn Drive Extension, Cebu Cty Place where you are staying in: (Please check) Home with parents Private House Dormitory Staying with Relatives Apartment ><] Others: (Please specify) Boarding House SCHOLASTIC RECORD: Name of School Address Year Completed La Salle Green Hils loio City, Bulacan 2022 Junior High School: I Honors Awards Received: Academic Achievement Avard _ School Last Attended Address For Transferees Only: San York High School Mania Extra Curricular Involvements: _Computer Club, Robotics Team, School Paper Staff Talents /Special Abilities: _Programming, Web Design, Video Eating Person (5) supporting your studies aside from parents: WA Relationship: _WA Occupation: wa ‘Address _WA Any physical disabilities or handicap s _None Do you have any problems? (Please check) Self =X studies === Family Relationships, with whom?, >< physical Health === others, please specify Social Adjustment Finances ——_. Family Members, Trusted Adults ith whom would you like to discuss your problem? NOTES"
    },
    {
        "image": "guidancerecord1_synth_7_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM ae, Meine ?2, 208 Home. Iadress: Bitiates Me Father s fhave: Please Checks I iT RONOEW Osta Heine autres: 1 (Peawe oak) Piaceatiere ye 32 Hye Hearne with rarants {LU Petvate ttouse 7] peraitery Staying wath Salatives (| Apartment (SE) others: (Please spect SCHEAAD TE RECORD: ame of Schoo! pideess ‘Yeu Completed ia Gabe Gomer Poe junior High Schowt Hanarsidwards Ravel Parson (5) supporting your studies aside from pares ship: Gecupations ih pny pivgtical disabilities of handlcapts} @ check} Do pau have any problenns? (elaass Family hysicat Health Finance any ah whom would yau Tike to discuce your problom? sees, Fousten ACER NOTES"
    },
    {
        "image": "guidancerecord1_synth_7_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Harner Zeheoey Father s Staroe: cpp na DCU: _ Sea Pease Check: (Se uowonw Place of ork: Mather s tame: Ei _ Guragation, Ei Gitesal Attaareent: Piowse Checks ears a Work 2 No. of Bruton: 977 Horne Adacess Prace were yon ae saying Pina {7} Homme wath parents Private Rowse c ratory i Staying eth Relatives [| Apartment [BE] others: (Bleane specity) Baeee ‘SCHEAAS TH BECORE ane of sdveed adgeess sted 1a Sale Geese Has Yala chy. Blsran 26 J. tuasioe Wigh Seaook Ronors fumatch Serawerh nsferees City Extra ¢usvtuntar invatvermeats: Perse (5) supporting yaur tudies atid Relationship: N® ny physical disati Do you have any pra ies oF hamelicapist 2 ons? (Please chock} self \"Finances With whom would you lise te discuss your problem? Pony Menars, Testes Aa NOTES"
    },
    {
        "image": "guidancerecord1_synth_7_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER sen, ection: Please Cheek: “Tz HOR OFW Stace of vor: JES __Govipation: Oniver Please heck: |) GPW at HOR Me. of Brothers: foUNe. of stat” 2 Contact Numeier: Landing: ysse eutt __Seliphone: cate Homeadarees: x ace vere yeu ae saying in (Pewee ci womevah parents [TT] evateriese Staying with Relatives |__| Apartment SCHOLASTIC RECORD: Adrees ‘veer Comploted ame of Schwa! ato Gly. Fasscar ome ave Hig Sse: Homers fy fuipperiing your studies aside from parents: _Oeesipations i handican st 9 (lease check: arson 63} Relationship: WA cies"
    },
    {
        "image": "guidancerecord1_synth_8_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY Fores ater Fein 2 Passa) Strats Muss Fathers name ‘Sn, Rotionon decationsl Allaiuanend: OW BT Seeviezs j wna ACS a Wok 17 Stathers tamer Sie en. Sisvpatio Edhssstiowat Aitainiaost Prease chests TY pray [eiitoitorw hiaceat Work: seaenwnases He a etl: fas of site: Coutact thumber- Landine: 7] Private tease a 1] apactroaie SeROLANTEC stcoRD: fame of Schact Hiian: Cotes Zee ig ch ia an Staties oe BY ann Rotatéonishivs, with whom? _Piysicat Heath _ ihers, please suecity Finances With who would you like to aise amity Members, Trusts i S your proton NOTES"
    },
    {
        "image": "guidancerecord1_synth_8_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "eee POOR Pace weve yon ere eieg an Graare ‘chen Home with parents [1] Private Mewse SAYING wel Retaiwes Ey oasis SOHRASTIC paconp: Meme of Scheot Naren Yew Completed Mi shea Se Poratoee, Saray oot Sue 7025 Wonars Anurds Renchrad ___ rr cont Aeros. for nip: Hey eres Kem Sete, =. ——- wertcatar Seer ee —.. nae an emacs Talents /Special abiitios: “Set Gaeyaty Peivmane ae ire Person (3) supporting your wadiay die fom parent a —___——— hip: -——Oecuipation: 264, Address: 564 a Any phvpsical disabilities or S _seegn TT D0 you have SY Problems? (ease checks Stratis ~~ Famity Relationships, with whom? —~-——Physical tear, hers, ploase a wn non Flea OS Farnty Weerters, Tinted hats Men rede cya ern sores on"
    },
    {
        "image": "guidancerecord1_synth_8_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM me Address: Birthdate: Au Father s Namie: ___ Ocespation: [yew ore _Gervpation: Sea: ON FW Place o i. Contact amber: Mothvey s are: Bivgse Chee: No. of Rrothers: 37 Horne with parents staying with Relatives Den SEROLASTIE RECORD: fame of Scie! Adres Veor Complated m3 junior High Schooi. ds Ree Honorsiiew For Wansferees Holy Jon Extra Corvicaiar nvolvernnt Person 15) sapne Relationsiin: 8 Any f ing your studies ad Ba you have a __ Studies atianshins, with whory Others, olease specity__ Finances With wham would you tke to diseu NOTES"
    },
    {
        "image": "guidancerecord1_synth_8_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIMOUAL IRVERTORY FORE Cithzensite: Fane sions _Frates Atiainment: Se __Weaes a Wk Diothar s Name: Please Check No, of Brathers: Hone Aadrors \"] Home with parents 7] private |} Staying with Relstves 7) Apariment Jantar High Sehaok Honoss Reards tecehod: Attended Sersen (3) supporting yout studies asid fieiationship: N A z _Osrxspation: 8 Any physical disabilities o handlcapis) eae Da you hey any problems? {Mtease che ee studies “family _. Relationships, with whom! Physical Health, __. Others, please specify Fina With whom wautd you 6 to discuss your problem’, woTes"
    },
    {
        "image": "guidancerecord1_synth_8_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Nuarne: A008 doveiter Deleon see Date: Febru 62, 2008 “__Edwcationa) Attaorvent: Mavinrs Deyres Please Check: ‘On [5<] now oFw Crary imanennene _yuars at Work Contact Munwber: tandine: (S2O1 2SE Cephone _coue 745. 1674 hace ware you are staying n Paeabs check) Home with parents Private touse {J} enmtory Staying, with Relatives Apartinent i] Others: (Pease specify) Reeine Room SCHOLASTIC RECORD: Kame of Schoot abies ‘ew Completed union Higa Schoo, \"OR Woners Awards Receted: Schoo! Laat Attended Adsen en For Transferees Qnty: Hom owns tinh Sebort, dxtre Cervtcular involvements: Corpus Cue, Roache Team, Sonus Pages Sua Supporting your studies ailde from parents: 1 ny oe Retationship: 15 Occupation: Hie Address: WA Any physical disabilities or hendicap s) “ore oe ns 7 Do you have any problems? (Meese check) sek Studies ‘Relationshins, with whom __ _ others, please specify enees fama Mamoers, Trusted Acute With whom would you like to discuss your problem? woTES"
    },
    {
        "image": "guidancerecord1_synth_9_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVERT ONY Festa i Be pal TROP ose Mothers Macaw: A) gam Qoeeipations ee. Fdntalionad Ataivanent: Masiece Please Cheek, jew di om ory Hees of Wek: G85 nar ‘ho. of Brothers: 0 The. a setae Coated Straten Landline: (6% Home Adress; 68 thot Arona Rasa TOT menses paren: mi BS vormtexs CD staymng wat Relatives ET] apartment Lo} others: (Phase soeciy) StHOLASTIC RECORD: Home cfSehoot Berean {@) suaporting your sadies aside rom puerta: WA Relationship: IA Giceeapatione: UA an AOE: Anw physical disabildier or hendicapls} Be yuu dave any prodiems? (aiease Stadies Relationships, with wham? 7 thers, pleace specify with wham would you: NOTES"
    },
    {
        "image": "guidancerecord1_synth_9_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM Gethdate: Sermon 2 38 SESH btipoce evan Father s Name: Please Check: eon BE pee other s Name: —_! 2 i Please Check: ow “>< hon orw Poca Wet: Seed meta es ar Wik 2 Ho, of Bretberss 1 te esabs roams heres Proce wivers you are <= mow Passe check Home with pareets Petvate House {55} normitory Staying wid Relates Apaiment [} others: (Please specty) SCHOLASTIC RECORD: Kune of School Address Vea Completed Dowernay of ne Prapgenes inter mes Schoo Savatas ot na nw union High Schoot: Renors wards Received: Hergr Rok Dariet Atenance For Transjferees Oaty: WA tro Cerricntastevotvere amiss Compute ub, Robs Team, Seiwa Paper Seat Person 1) supporting yur Fudies aside from parents NA Relationship: \"A Occupation: 5A. seey physical ‘ccaoniar ‘or handicap s} tose Oo have 2 {Ptease check) ~ ene ast swates ti —— Femvily Relationships, with wham?, others, please specity, Gucarce Coane, Frente ‘With whem would you tke to discuss your problem? NOTES"
    },
    {
        "image": "guidancerecord1_synth_9_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER SHDSIOUAL INVENTORY FORM Father s Rises Pease Sheek seiether s Hare Bence Check: to, of Bratt Home Adar nas face where yo ae Romie ith porents Staging nth Relatives ictal ater’ haste Werk 21 _Seaupation _Ssovaiomant ROR OW Piare of Wor Contact Buraber: Lance: (T] pene se OE} Apartment LOGAN: Adticess SeHOLas ravatas, tooo anion High Sebook Hononiraash Received: Bar Tronsferses On Extra. Cueriuniar tosolvernn Persan {3} Reistionship: _§ avy physical dhabith Do you have any problem 8 (ploase ch gelationships, oth wham? tnthers, please speci, ‘you Bike to discuss your probless?,"
    },
    {
        "image": "guidancerecord1_synth_9_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "SUIDANCE cere POMIDUAL INvERTORY roses atony Beat a —- Eelucational Sitaiiant: Siecse Chere, Y Mathers tacne: ATE Bowe, eorpeana- SRCURALON: amener Be Please Chess PP eee SeTwOR oe Pieew of Weck: Ne of Beathers, \"Ro. oF stale 7 Contact male tema Sasrnne 58 Aesber Ayemub Hnsany ary 5\" ease Fiona ite garents ae Preeti Heese FE) dormtary Stoyimg weitt Rafatives E~! apactesane a1 Othees: Pieose spetityy SOIGLASRE BTCORD: Rane of sebeeh Addons Yaar Competed Lisiracty of he Pripsines ingested Seton Jeaiot High Sehogy, OE REY 9 he Prin Honvei Aveasds Recon Foe transgerses Oeiys Rta. Surrenias invnivemeais Parson fs} supporting yous stiias guide Fr Retationst i fd ialatincs a BSidress: ik, Glies ar handicagts} Bn yout have any prableins? (Hoare check! SPST cudies ietationshias, witht whom? __ Othees, please spardiy HOSES"
    },
    {
        "image": "guidancerecord1_synth_9_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE CENTER INDIVIDUAL INVENTORY FORM No. of Brothers: _ Tho. of Siste S __1_ Contact Number: Landline: (2 821 2634 Cellphone: 912 740 9888 Home Address: ‘5 Amber Avenue, Mandatyo0g ronan ye we sgegc Peoseanea SCHOLASTIC RECORD: Name of Schoo! Address Year Completed ag avery ete Peaines bigrd tent Neve Boo ya Honors Awards Recewved: Honor Rol Perfect Atendance School Last Attended Address For Tronsferees Only: WA _ _NWA Extra Curricular involvements: Computer Cis, Robotics Team, School Paper Stat! Talents /Special Abilities: Sngng. Paayng Gute, Publ Speaking Person (s) supporting your studies aside from parents: WA Relationship: WA Occupation: wa Address _WA ‘Any physical disabilities or handicap s) None Do you have any problems? (Please check) Selt >= studies ramity Relationships, with whom? <= Physical Health Others, please specify. Finances With whom would you like to discuss your problem _C S s® Comset Parente"
    },
    {
        "image": "guidancerecord2_synth_11_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE AND COUNSELLING SERVICE INDIVIDUAL INVENTORY RECORD 1. PUPIL S PERSONAL DAT/ ve Alexandra Rios Nam Seren _fet ___ ickname: Aly Sec F _ Natronality: Faeine (Surname) (Given) (Middle) Place of Birth: P88: Leauns Date of irth: A sust 22 2017 Religion: Im Guardian: M#\" Veoe Relationship: Srandtather address: 704 Neptune Drve, Las Pies FAMILY DATS 1. Father s Name: _Shane Veos Educ Attainment: \"555623 Occupation: Carpenter Place of Birth: Mania Date of Birth: August 08, 1981 Religion: Roman Cathalie Nationality: Fibino Living or Dead: Living Cause of Death: 2. Mother s Name: Educl Attainment: _Sevty zoe Occupation: Business Guner Place of Birth: Psrefaque Date of Birth: July 20, 7804, Religion: tsiam Nationality: Fiipino Living or Dead: _Liing Cause of Death: 3. No. of Children: Boys _i Girls: _3 Total No. of Children: 4 4, Language: _Dialect s) used at home: _ocano Family EconomicStatus: Low income 5. Address: 683 Puto Road, Valenzuela House: Owned =< Rented MI, EDUCATIONAL DATA: 1 Schools Attended School Grade&] Rating Honor Earned Teacher Year Sec ‘Aleneo Grade School 2018 2010 Grade 1 26 ‘with igh Honors Paula Medina Bagong Slang Elementary School 72010 2020 Grade 2 95. ith Honors Lof Stewart Bagong Slang Elementary Schoo! 2020 2021 Grade 3 oostears wA Rebeksh Dion, Mania Central School 2021 2022 Grades 26 itn Wigh Hones |\" Sera Eliott ‘Sacred Heart School 2022 2023 Grade 5 mn NA Joseph Garcia Holy Spit School 2023 2024 Grade 6 26 win Honors Vitor Noman 2 Failed or dropped out in any grade? Yes No Grade School Year Cause (s) Special ability ortalents Gr. |: _Spors Grits_Snging Gr. ts Wing Gr. IV: _Danoing Gr VE ath Gr. VE Music 4, Disciplinary measure s) taken against the child, if any: Grade Date Reason Consequence Comment IV. ADVOCATIONAL AND VOCATIONAL DATA: 1 Gr. Ie Musi Grits Cooking Gr. ls 208s Draws Gr. Vi Reading Gr Vis 2 Gradel__| Gradel_| Gradeil’ Gradelv Gradev GradeVi Child s Ambitvon: Teacher [architect Nurse ‘Scentst__| Businessman _| Doctor Father s Ambition for Child: [Esgmasr Engineepusnesaman Seentst ——[Puot Nuts Mother s Ambition for Child: [ast Doctor Pit Muse [Engineer [Engineer 'S IMateftars Read! Ebooks Newspapers [Textbooks [Newspapers [Newspapers Magazines"
    },
    {
        "image": "guidancerecord2_synth_11_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "Doo GuipaNce ANS: pupae eensntah BEES b. Raties s tr Place nf Bathe 2. pawn’ Be piace vf aut: pated paged or ror te. tiseapiinary mensatet Grade hates ante oo pasher s Avent aces’ ante a. taatentat s Reet: tenuis pesostin cay erase? fe Chath 1 Yea a os akan wganest the nate for Chita Face rm Tai A ast “Final eo. of CRAGIN 2 2 Ezonasnic States wonse. Gene? aS"
    },
    {
        "image": "guidancerecord2_synth_11_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "1 PUPILS PERSONAL Dara: Nam <8 a Wick ame: Alexy Sec F Mabonatty: Fone (Surname) (Given) (Midate) Place of Birth: P 4y. Laguna Date of pith; A008 22. 2017 Religion; sam —e en Guardian: M2 Veoe Relationship; G andtaner Address 4. FAMILY DATA. FAMILY DATA: 1. Father s tame: Educ Attainment: Place of Buth: van Date of auth: Natonality: Fone ie Shane vega QcUPaBON: Carenter August 08, 1987 Religion: oman Catron ving oF Dead: voy —_ Cause of Death, 7 ethers Wame: soa Patanan Educ! Attainment: Rlsce of Bxth: Parahagae Date of aut Nationality: Fame 2. ving or Dead: =——D 3 No. of Children: Boy Living a Gis it of Children: g 3 Amaiuaee: Dialects) used athome Teeane == FAM Economie statas Scone 5 Addiess: 043 puss aoed vasnasey” Mouse: Owned Se pesion ™. EDUCATIONAL DATA, EDUCATIONAL DATA: d Heat Senao) HOW Spvt School [2023 2026 2 Falled oF dropped out in any grade? 2 Ambion: Child s Ambion. Seentst Father s ambitron for Child: Seentst [ost Mother s Ambition for Child: hse Engreer [newspaper [ews 3 Materiat s Read: Engneer enbooks"
    },
    {
        "image": "guidancerecord2_synth_11_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE AND COUNSELLING SERVICE INDIVIDUAL INVE, |. PUPIL S PERSONAL DaTA. am 22 Alerands Ras NTORY RECORD Sec F (Sumame) (Given) (nnidate) Natonality: Fiera Place of auth; Pas Laguna Augen 22 2017 _ _ Date of Birth; *294* Religion: 84m Guardian: M7 eas ———Relavonship: Smee pages: 784 Neste Dive, Las Pe 4\". Famuy pata: Tans Mame: “Srarevegs cductattaimment A2 858 Occupation: Carenter Place of Birth: tiene Date of Birth a i Habonality: Fiona. Ay __ Religion: Roman Catnoig Living or Dead: Ln: Cause of Death. —— bung _ 2. Mother s Name: caus Educ! Attainment: Enzmry sunae Place of Birth: Pa Sov Sense Occupation: Date of Birth: uy 20 1994 Religion: Nab onality: Fina ling or Dead: Lwng Cause of Deat ~~ 2 Mo. of Children: Boys; p Girls: 3 4 Language: ialect s) used at homer Total No, of Children; 4 ‘amily Economic Status: __Nouse: Owned >< —— EDUCATIONAL DATA: 5. Address: 083 Pista R [1 Sehootratendea Near age ®] Rating Wonorearaea Teacher) Year Sec Ateneo Grade Schoal 20182070 Gade 1 hie Hono Paula edna Sagong Siang Enea School 2018 2020] Grade 2 25 Win Hone Lon Seas [Bagong Siang Ceraniars 20202021 Gage 3 ome [wa Rebetan Dion tenia Conta Seno 20212022 Gaus 8 ao gh Hones [Sara gion Sazted Hens Scnoat 20922025 Grade 5 rs Joseph Gara Hoy Sart Seno) 20232028 Gres 26 in Reno Veta Navman 2 Falled oF dropped out in any grade? Yes No Grade School Year Cause (s) 2 Specialabilty or talents Gr 1: Spans Gr; Sea Gr wing _ Grow: _Deneng Gi tuse “Disciplinary measure s) taken against the child f any: Grade Date Reason Consequence Comment AVOCATIONAL AND VOCATIONAL DATA: 1 Child s Hobbies Gre use Gr Cooking Gr: Seats Gri TResang OVE pe 2. Ambition Stel {rade J Gradet_ oradev Grade ~Gaaew Child s Ambition: Teacher [Arentect Nurse Seentst Businessmen Doctor faiher s Ambiton for Child: [engseer Engnser [ausnessman Sewnist [Pant Nurse Mother s ambivon tor chit: [2 Doce x Engineer [etree 3 Materats Read (scois ——[Nsssos0es [Fenoots Nensnanes” [Rosine [issecnes—]"
    },
    {
        "image": "guidancerecord2_synth_11_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "‘Baad - Date ctnitn, See 2 4 Fatiere name 2 Paen ab gine Educt Attaienant: 47 Feetinseaion of bit tei OF Beasts vie, w= fit A arenes Tate of Buti: tamanatty: Fae mn ns Uvtng 6# Deed 2 Rn at Citsiea: ayes Sites a 5 ARIRNE Detects ured wt Boiae Jere 5. Addieess: 983 Pate Ras vs n= Pabegson: Goise Fogo Sasa, mis FERAL Ra, of Chas Famiiy Econuents States: toe wsarss Hose: Owned ace tented comes [nia Sonim: Senn zt Hiareateeictont at Sree Discplinary iwaestrefs) tabem agatist the chad any: Grede Date Reason Father s arbiters for Chick Bthhoe s hechaion tre Cit: [eee Ko Mateera s Rend:"
    },
    {
        "image": "guidancerecord2_synth_12_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "te pupae PERSONAS RATA own Hoare idan omewe) (sven pate ami, COON? ran a. fattnn s Brame: Dien lace ef Sith: Pe: Hing or Dwar: Desestied Sac atiaiaroat “Bane of sat salen against the abil ane pate Resse strscnplinsns measure Grade: fy. ANUSCATSNAL AME YESATIONAS BAIA: i, thet sSabives 86 Gr, Se 2 Aatbigon: eakss Asnbsen? Fether s Ambition To CDR paotiner 5 Srabitian for CAS: 5. ptaterlals Rest"
    },
    {
        "image": "guidancerecord2_synth_12_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "fan arg eemer (Serasrey (Gtven} (Aida Peace ot Ban; She CH Conte Date tata, S00 3. 2006 (Coartion: tees Serene Adddveny: 114 Onon Steet Tapeiy geucanows nara TC aaar ae Wego tae fosams Seoae sempey isan owen sare Ses arate BSpecial aovity or talents Gr. 1: Chtd s Ambien: FARNEs Aeabei on tor Case haters Aono foe Undid BR Motestat s Rout:"
    },
    {
        "image": "guidancerecord2_synth_12_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE AND COUNSELLING SERVICE INDIVIDUAL INVENTORY RECORD |. PUPIL S PERSONAL DATA: Heater Drake Nam ickname: Hee (Surname) (Glven) (Middle) Place of Birth: _C O% Covte Date of ith: One\" 21, 2018 Religion: SvePanrovens Guardian: 79 50\" Relationship: Sardmoter address: 114 Oren Sveet Teoua FAMILY DATA: 1. Father s Name: _Bean Baun Educ Attainment: Vocation Come Occupation: Accountant Place of Birth: Paafaave Date of Birth: August 13 1080 Religion: Prctestant Nationality: pio {ving or Dead: Dezeased __ Cause of Death: cancer 2. Mother s Name: Tazey Ryan Educ! Atlainment: esetyoneem Occupation’ Facon/ Wotet Place of Birth: Les Baas Date of Birth: Januar 18 1877 Religion: fonen Caiaie Nationality: Figs ving or Dead: Lg Cause of Death: 2. No. of children: Boysi_a irs: Tatal No, of Children: 4. Language: Dialect s} used at home: Cebuano Family Economic Status: Ueee Mase hone 5. Address: 810 Aayat Rod, Nevtas House: Owned >< Rented EDUCATIONAL DATA: T Schools Attended School Grade] Rating Wonor farwed Teacher Year Sec. UP integiated Sehoo! 20102017 Grades [05 WA Tison Set Hol Spit Seno0! 2017 2018 Grade2 08 Elsen Whte ‘Aieneo Grade Schl 20102010 Gnade [95 WA Neole Wms [sacred Heat Schoo! 20102020 Gade 91 Academic Auard_| Batty Pety [atenso Gade School 2020 2021 Grade 5 ri Wh High Howes —T cca Rass ‘Ateneo Grade Schsl 2021 2022 [Gnde [0 NA ‘Aaron Yoder 2 Failed or dropped out in any grade? Yes No Grade School Year cause (s) 3 Special ability ortalents Gr. :_Spors Grit; Muse Gr. IV: _Reading Gr Vi ing Gr. VIE Puble Speaking 4 Disciplinary measure s) taken against the child, if any: Grade Date Reason Consequence ‘Comment Gade ‘oa 2024 Dsespect Parent conference No peat afense IV. ADVOCATIONAL AND VOCATIONAL DATA: 1. Child s Hobbies Gr. 1: Gaming Grit: Drawing Gr. ti Cooking Gr. IV: _Cooking Gr Vi_Resding Gr. VIE Gaming 2 Ambitvon: “Grader Grade Grade Grade Gradev Grade vi ‘child s Ambition: [pctor Tewyer Lawyer ‘ist Destor Lawyer Father s Ambition for Child: [Teacher Pict ‘Architect [Engineer arist ‘Architect [Scientist ‘Teacher Teacher Businessman Archtect [Arist Newspapers [Textvooks [Comes Textbooks [Storybooks [comes]"
    },
    {
        "image": "guidancerecord2_synth_12_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE AND COUNSELLING SERVICE INDIVIDUAL INVENTORY RECORD PUPIL S PERSONAL DATA: Braun Heather Drake Nam Aickname: 8 Nationality: FH\"? (Surname) (Given) (Middle) place of with: CtY OY Cote pate of Birth: Or0ber21, 2010 Religion: SRP OeeE Guardian: ©9504\" relationship: Orandmotter Address: 114 Oven Sweet Tague FAMILY DATA: 1. Father s Name: Sin Braun duct Attainment: Voestona! Couse Occupation: Accountant Place of Birth: Parafaque Date of Birth: August 13, 1980 Religion: Protestant Nationality: Fapine living or Dead: Deceased Cause of Death: Cancer 2. Mother s Name: Tracey Ryan Tducl Attainment: _Sevety Gane Occupation: Place of Birth: Las Pitas January 16 197 Tiving or Dead: Living Cause of Death: Nationality: Fipino 3. No. of Children: Boys: _4 Total No. of Childr ‘sjaleci s} used a homme: Gabuano Family Economie sto House: Owned >>\" Rented 4. Language: 5. address: 510 Aryat Road, Navotas ll, EDUCATIONAL DATA: T. Schools Attended Scoot] Grade [Rating] Honor Earned Teacher Year Sec. UE integrated Schoo! 010 2017 Sade 1 WA “ison Seat Holy Spit Schoo! 017 2018 Grade 2 94 Elsen White ‘Aieneo Grade School 2016 2010 Grade 3 95 WA Note Waser Seced Hest School 2010 2020 Grades m ‘Academic Anard Bety Petty Atenso Grade School 020 2021 Gade 5 rt Wantign Hons Eee Ree ‘Ateneo Grade School 2021 2022 Gade 6 20 NA ‘Aaron Yoder 2 Failed or dropped out in any grade? ves No Grade ‘School Year cause (3) 3 special ability ortalents Gr. Spor Grit; Muse Gr IV: Reading Gr Vi iia ‘4 Disciplinary measure s) taken against the child f any: Grade Date Reason consequence comment onde 8 Apa 2024 Darespect Parent conference _ Norepestooflense w. 1. Child sMobbies Gr. Grit; Deawing Gr. i: C20kng Gr. IV: Cooking Gr Vi Reading Gr. VE_Geming Ambitvon: Swier ~[Terade Grade_| Gradew Gradev_{ Gradevt ‘child s Ambitvon: Taner [Lawyer [Arist Lawyer Father s Ambition for Child: [Teacher Piet Fate fengmeer [ars arched ‘Mother s Ambition for Child: [Scentst Fer [teacher [Businessman [Ascntest __ actst TFenoos _ stenbocis [Comes 3, Material s Read: Teewspapes _ Textboois [Comes"
    },
    {
        "image": "guidancerecord2_synth_12_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "2. Father s Rane Sean Su Pince of Rath: Pamienwe TT tiving or Gea Qevevied___ Cave OF Drath: Sancee ne kau Altaimmnnts EET OHNE Occupation: econ inka Date of Birth: Jenveny 181677 ______ Rehgins: omen catnais_ a Caute oF Death: T Tetat to. ot chadrens G Famiy Eomomic Status: View Wade sone A. Deccipltn ery meas e s) taken against Uke child, ancy: Grade bate ‘Reason Consequence Corsment"
    },
    {
        "image": "guidancerecord2_synth_13_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "Bursenc) (Given) (Miele) oe, Sstangns Phine af Butte Suepaar hemander Suarciian: H. GASSIY DATA: 2. fathers Meme: Blace of Bath: Nevins Matiowsinys, Po 2 Mothers Rama: Plowe of wieth Babunaiity 2% fin, of Chie a hang Bs daldeess Bate af Girth: Ase Wing or Oesd: Ling. Rene’) astaie ecupal aehgiar Pause ot Besth: prune Total tie. of Chadron: Riateais) used 8 bam, 1 Bareas Ure. Paes, 5 a iiterptinsry measurels) tater aysinst the cba, any Grode Date Beason coasesnenen comment Chile s Ambition: Father s Aunbivon fer Chie: racahau s Asntetian fer Chis 3 thateatets Read:"
    },
    {
        "image": "guidancerecord2_synth_13_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "N. ___. Dn ot Bit taacdiaa, Chetone Hemanites Relattenakigs: SOB. A, Fattear s ar Baca of Birth fabenaiity, 2, Metiar s Mare 2 Biace of Bsth. Nationality: £5: 1 Bp, of Chaldean Failed or dropaed out ot any grade? orede RSpaciat abuly or tataats Gre GON: ast 4. Disciplinary measurelst taken against the shld, anys Gree wate east 0 VOCATIONAL BATA: Ge Dae AOYORATIONA. chiles Heaties Father‘ Ambition for Chile ntother s ruben for Cte 3. Material s Rea: 1 fu wing, or Beak Leg Enlue t Atakvavent bacon 04, 2057"
    },
    {
        "image": "guidancerecord2_synth_13_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "4 Ratigion: Me Game Re Gwarehens NERA Heme i. Fothar s Hane: Dace wf Sirti: x om 7 Si Desthe cancer 3. No of Childran: Bay: cums Tetal Re, of Childress 4 4. tenguage: Dialectis! ured al Boma Favaily Seonomic States: Sanat vive, Bosay Motive: Owned nant REEDS. eS ce eer A Faited ar dropsed oot is any grade? Grae 4 Disciplinary sneasure s} taken eguinst the ebitd, am Srede bere Reasos cunsequence comment WY, ARVOCATIONAL AND VOCATIONAL BATA: 2 Child s Mabie Gr Gr. Bs _ Been 2 Ambetion: child s asnbiviae: Father s ambatan tex Chita Mother s Anta 5. Reaterial s Read"
    },
    {
        "image": "guidancerecord2_synth_13_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "ae t Attosoment: Mesars Degen Erste of Birth: Ape Tivieg or eae: Kdect Artal 2 Yotst ie. af Chie Family Economie states: _ Haste Somed 2. Spncia! abfiay ar tatents Ge Ni Disciplinary meacurets) taken agaist the cule st sy: Gra ote Reason Comment 4 HORA. ANE VOCATIONAL, 4 Child stiebbies Gr. Seng Ge. 1: Gaokeg 2 Aenbetien: ChES s Aust Fattver s Aambiatos fees Chile Daekuer s ambition for Chk crest sean i Eran Fens ak «heed"
    },
    {
        "image": "guidancerecord2_synth_13_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "(Gemame) fewer) fateatian he _Sarsteaus, Satergus 8 2. Fathers anne: Janes iemancer Pisco of Ruth: HSecte festenatity: Fa 2 setber s Wane Edue t Atteinment: Bate of Barts Soni 22 Uiving oF teas sii Sate of arch oer _. Conse oF Deut! Tokai tho, of Childrens Fart Eeoncmie Stats. a on Heb: Dwave Dare 3. League: Adidewss: S Rentaet SSperial ability or teients Ge SEV: saat Diciplinars measara s) tation agnanst tha child, any: Grade oxe Saason M. abvocaronar sup voc: a 2 Chiles Howties Gio Ooweg GRAV _Ganing 2 Ambion: Chutes Amibio on Father s nentesian for Chat Mother s Ambion fos Citic: B MMateriat s Read:"
    },
    {
        "image": "guidancerecord2_synth_14_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "Hateldiay Sumemey (Given, Bice of pith, S28 Or Govte __Fibie' Riaarnaiet: ecsoext Bate ot rth: ent GWlog o7 Sead: pesweaea EGac' Attatarnent ag 2 Riz No. of Didects) used ot homar Tageagmngies Fomity ccomantc Status: teas S300! Pes Heuser Qwaad PFalled or drape outta any grace? Grade 038 Us child, anys Consequunce Comment &, Shits Amber: Father s acwbaion far Chita, Patton s Asieinon var Chit. 3 Ratesiat s Reset"
    },
    {
        "image": "guidancerecord2_synth_14_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "> COUNSELLING. (Sumaiael Place of Bist Father s Haven Manon piace of nirthe Morseit79 Seaton a No. of Children: a valled er denpped out it any grits? Grae a teectat abatty or tatants Gr. aon agatnst the ebile, Maree: 4. Dicciphmary sueasere Grade pate seramotites Gr. Be 2 Ambieon: chides aration: Fativar s Armbatian For Chita srether s Ambavon tor Chee 3 batantal s Read ehaame: SO aa __. Bate of Birth: Merah 2 — Fanily Seomcen voor ort: Reason et Hasonality: Aatigior te State Fave"
    },
    {
        "image": "guidancerecord2_synth_14_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE AND COUNSELLING SERVICE INDIVIDUAL INVENTORY RECORD GUIDANCE AND COUNSELLING SERVICE INDIVIDUAL INVENTORY RECORD: |. PUPIL S PERSONAL DATA: Thomas Chive Brown Nam vickname: Cn! Sex: M Nationality: FH\" (Surname) (Given) (Middle) Place of Birth: #4 C y. Cavite Date of Birth: March 28 2013 Religion: SSP) Aone Guardian: Noman Thomas Relationship: Aunt ‘Address: 721 Banyan Rosd, Pasig FAMILY DATA: 1. Father s Name: _Michae! Thomas Educ Attainment: Vocational Cowse Occupation: Business Owner Place of Birth: Mandaluyong Date of Birth: Asa 19. 1970 Religion: Suaaniem Nationality: Fano Living or Dead: Deceased Cause of Death: Hearn Attack 2. Mother s Name: _kestn Wilson Educ! Attainment: Some Colege Occupation: _ T Professional Place of Birth: Tagua Date of Birth: February 03, 1083 Religion: Iglesia ni Crsto Nationality: Fiping ving or Dead: Living Cause of Deatl 3. No. of Children: Boyst_o Girls: 9 Total No. of Childr 4. Language: _Dialect s) used at home: Family EconomicStatus _tisdie Income 5. Address: 970 Gray Sweet. Pasa House: Owned >< Rented. EDUCATIONAL DATA: T Schools Atended School] Grade Rating] Wonor Earned Teacher Year Sec. UP ites Sahoo! zoiez0i7 Gade ws sin Samzar ‘Quezon Cay Cnt School 2017 2018 Grade e2 Win igh Honor Brenda Duan St. osepn School 20182010 Gade3 65 Joel Sh Bagong Stang Eleeniay Schl 20102020 Grea [04 Morgan One UP integrated School 20202021 Grade 5 Fra 7 Alea ‘Ateneo Grade Schoo! 2021 2022 Gade6 [02 Acadenis Anand Keth tsar 2 Failed or dropped out in any grade? Yes No Grade School Year cause (s) 3 Special ability ortalents Gr, 1: _Dancing Grit; Math Gr. Mh; Sports Gr V: tse Gr. Vi Reading Gr VE ts 4. Disciplinary measure s) taken against the child, f any: Grade ate Reason Consequence Comment 1. Child s Hobbies Gr. I: Playing Grill: Music Gr, tlt: Music Gr WV _ Playng GEV Spors 2 2. Ambition: Grade! Grade lt Grade Grade IV\" Grade Vv Grade Vi Child s Ambition: Teaver et rescner ——[arnteet Pot est Father s Ambion for child: fa ro ites ane ‘Mother s Ambition for Chil Pilot Artist Architect Engineer Teacher Aatist 3. Material s Read: Magushes [Sioyboots [comes [nove _ Sionboots [comes]"
    },
    {
        "image": "guidancerecord2_synth_14_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE AND COUNSELLING SERVICE INDIVIDUAL INVENTORY RECORD. PUPIL S PERSONAL DATA: Thomas Chive Brown Nam ere __ones __Brv’ Nickname: ht sex: M__ Nationality: Fa (Surname) (Given) (Middle) Place of Birth: _C PY C Y. Cavite Date of Birth: Marsh 28 2013 Religion: Sms) “oees Guardian; Noman Thomas Relatronship: Aunt ‘Address: 791 Banyan Road, Pasig FAMILY DATA: 1. Father s Name: _Mchae! Thomas Educ! Attainment: Yorstons Couse Occupation: Susiness Over Place of Birth: Mandaluyong Date of Birth: Aori 12, 1970 Religion: suddhism Nationality: Fano living or Dead: Deceased Cause of Death: Heart Attack 2. Mother s Name _Kstn Wison Educ! Attainment: Some Colege _ Occupation: _1T Professional Place of Birth: Taguig Date of Birth: February 03, 1983 Religion: Iglesia ni Cristo Nationality: Fipino living or Dead: _Lwving Cause of Deat! 3. No. of Children: Boys _o Girls: 9 Total No. of Children: _o 4. Language: —_Dialect s) used at home: Tagalog Engish Family EconomicStatus _Midle Income S. Address: 970 Gray Steet. Pasay House: Owned === Rented MI, EDUCATIONAL DAT) 1. Schools Attended School Grade& Rating Honorearmed Teacher Year Sec. UP Integrated School 20162017 _| Grade 1 3 ‘usin Salazar ‘Quezon City Central School 2017 2018 Grade 2 92 TWh igh Hones Brenda Duran ‘St. Joseph School 20182019 Grade 3 25; oe! Sith Bagong Siang Elementary School 010 2020 Grade 4 mi Morgan Onell UP Integrated School 20202021 Grade 5 28 NA ‘Soot Allen ‘Ateneo Grade Schoo! 021 2022 Grade 6 22 ‘Academic Award_| Keth Mason 2 Failed or dropped out in any grade? Yes. No Grade School Year cause (3) 3 Special ability or talents Gr. I: Dancing Gril: Math Gr. l _Spors Gr. IV: asic Gr. Vi_Reading Gr. VE ats 4. Disciplinary measure s) taken against the child, if any: Grade Date Reason Consequence Comment Iv. ADVOCATIONAL AND VOCATIONAL DAT 1. Child s Hobbies Gr. I: Playing Grit: _Musie Gr. i: Music Gr. WV: _Playing Gr. Vi Sports Gr VE_Gaming_ 2. Ambitvon: Grade! Grade! Grade Gradelv Gradev Gradevi child s Ambition: Lawyer ais Teacher Architest Piot atist Father s Ambitvon for Child: [pot Astist Plot Ait Ait Architect Mother s Ambition for Child: [pioe Att ‘Arhiect [Engineer Teacher [Artist 3 Materiat s Read: Mageznes ‘Storjeoaks [Comes Novels ‘Sterjeoaks Comes"
    },
    {
        "image": "guidancerecord2_synth_14_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "Siekeame: (Sure ares Seno Phsce ot aietty: Cb2 Se. Cavse Bate of gists Mons Gnascian: wna MSD OAc Ao Caz 2 father s tare: fof Ruth: Rabonsiny reoy 2 Mott s tamer 5 Place of Birt Maton etty: 2 Fee. ot Chitdren 4. Language: 5. Adthers: #79 4 Cecupatrons: Gsoms ower Fedigion: 5 seated Fac af beaks eee en Date oF Beech, sed ai Rone: Arapped ont many creda? ie SS becied aby OF tasints Ons Ce 19h asainst the ct any: ate Reon Fonsequence comaent ‘AL AND. Shin s Robsies 4 Matenats reset"
    },
    {
        "image": "guidancerecord2_synth_15_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "kam ans) {Given} PAWS) cagaver 4 Pace of bith oe ces pave ef tits olationsbig. Be Faye Attainment: Se0e Soteoe _ Meespations 5. Father s tame: Place of Barts Bate of dare: fugu oe tata, NaWonaity: 8 TTT iMieg or Bead: Long Cause of beatm: 2. Mother s Wore: Cn ESIC AR nena ._ eeupatian: Bigcw of fart “Gate of Bie Baligion 321 Heasonatity:, Jag nr Dex 2 He, of Chibdran: Bays Tee SHES A. 4, Language: Dielent s) asad at Rewer Tepe ~Famity Eonwomic states: S. hades: L fiowse: Greed Fated or droped ov in any grade? ne Geaite cause id) Beatin ius B Special ability ertatents Gr 4 Gisciplnary messes) tak agaist the cae, any? Grade eae Season consequence comment We apwecaty i Child s toxnes re A Acabioen: chila s Anwiemion: Father s Ambition for Chil Mother s duatiien for Chit 3 saotertts mad oe i verte? s Senvoocts |wepoune: Tasteooks"
    },
    {
        "image": "guidancerecord2_synth_15_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "i mm, SpEcATi WDANCE AND COUNSELLING SERV! BUEILS PERSCEAL BATA ost Aion be hae arama) (Green) tide} Fiuce of eth: S077 He Oo, Gore Date of Buchs Gaarsise: Sanmey BARA 1. father s aime Hlace of airih: Nan onal 2. Movier s Bama: Place af Bith: 4s Nattonality 3, fa, of Chutdeen: a Oath 4. Language: Dralee s) esed at howe: Teasiyg 3, Address: 609 Siuetubo Stwey Saven Oy Giezer Oh HAS BATA: EMue’ attainment: Bate of wicks Wiag or Dead: Long hin 10 29 ua) _ fislstionchip: Sansicanee Aatdross: Seams Gatiege Wo Saige of Baath: Family ceomomnic States: _ House: Guenett _. beep rence atigion: ‘ocwepitiaa is Bethe 2aiied or dropped out tm any grate? Grade od fy. ADYGSATIONA AND VOCATIONAL OST&: Child s Hobbes Gr be Spats Gr. Fe Anions Chikt s Ambo 08: Fathers Ambaven for Chis: anthers Ambition for Chie B Matertay s Read canseist pean gue consequence Comment"
    },
    {
        "image": "guidancerecord2_synth_15_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE AND COUNSELLING SERVICE INDIVIDUAL INVENTOI PALS PRASONAL CATA: _ tebss tam meni Date of Bathe Ag Rig oF Gere: Lrg “tec tam ammmeot aye Fite nf Ruth: seg 16 Rebywe, aortas Leong order bmg bate feat Gomi Feta te, of Crider. Fosrcaly Framer states: Messe Ouned sae Onan on: A Nhe of chatiron: 4. Language: aes oy Pane eee Grade 3 Spaectal abilay oe talents Gr Ge Be Spec 42 Wuagphnany meatarels taker agant the cidd Fa Grace Oate Rene I, AQVOCATICHAL AND VOCATIONS! ONFA: 2 RES weber GEE Som Gey bar Se 2 Ambion 1G Chats Arabians Haters Asmbdos for nid: taativer s Aonistion for Cutt 2 Matenats head."
    },
    {
        "image": "guidancerecord2_synth_15_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE AND COUM 1. UUs PERSORAL tA: iweatays FPR? teem c__ neddese: 47 Moya Bestar, 214209 Cy LATA 2. Father s Mame: hace of Sith: ations “TT Bate at mist: Thing or tach wien a RET Attaiwnvent: Bate ot aes: _. Oecupraivan oT tigi: Tasce oF Bexth: TFesat ato. of Chutsresss Fatally Eeonaratc statis: 2 Mosse: Owned 4. banguage: Sh address: A seis Satan cous Fue. <ause is) Basti sure B S pecial ability of tatents G18: Gi Mat ayjeinst the child, Bays 4. Disciglinary measure s) taken Gre pete Reason comsequence comment WW. SDYECRTIONAL ANP VOCATIGNAL DSTA: 1 Chis habbies Ge 2 Ambition: ‘child s Asnbvon Fathes s Ambitien for Child: Néother s Anebitton for Chit a Materia’ Reads"
    },
    {
        "image": "guidancerecord2_synth_15_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "tom 2 surname) cores) (Midae) Cagayan de ov, Cowie pate of uth: ue 22088 atgfon: Teer ow sean ward petavonsnp: coamamat_ Aadress ‘a7 Mayans Boulevard, 98200 CY FAMILY DATA: 1 Fathers Mame: Seotentest 5, cavel attainment: Some ote _ OCR acme 000 place of Birth: 9880 ees sages 2108 Raion: a Nationality Ting or Dead: Lng Cause of Death: 2, Mother s Name: Apa Moris oF Dent amments Compe onsets ONT eam Place of Birth: Davao Ch ate of Birth: June 16 1880 Religion: pusdhism Nationality: Fp Lng Cause of Death: 3, no. of Children: Boys: Fatal Ho. of Children: 2 a ges Dalets) used home: Family Economie status: pg tae ome 4. Lge: 03 Peabo Svat Dawn CA House: owned Rented =— tn. EDUCATIONAL DATA: T Schools Attended seo] Grade] Ravn ronortamed Teacher Year sec. Sageng Sag Emer SOO sezn10 Sade! 3 ee ny Sone5) z Sram wien High Hons voy Sort Sch00 aoiesozt oases} #2 WA 7 se Siang Emmentany Senoot iy Fgh Hen ad 5 mn Lb egies S200) ‘orade 8 no oard_[ ne Staniey Failed or dropped out in any eras? yes SS No Grade school Year cause (s) mde 4 29173917 eath spues Sates BU special ablty ortalents Fa cor: Muse orm: D502\" Gre AV: Spots ore ath GeV te ‘piscptary measuregs taken agamst tne ch any: Grade Date Reason consequence ‘comment Grit: Sorina Gor. Bead Seve “Gadev Gradevi Father s Ambition for Child: other s Ambition for Child: Pit rene jure a ee Tiaguznes Textbooks 3. Material s Read &"
    },
    {
        "image": "guidancerecord2_synth_16_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "fam SSE Samame) Hionemer S00, iheaktte) Guanise. i Samay ona: 2, Father s amex Placa af Birth: Ctatanstty: Esp 2. Mothers mim. Sener Oeeapabon: F Tate of sith: Living ws Osad: Gis: ga Ra, of Adder: 4. Language: S. esddress: 63 Eeonenic Status: House: Chwed ame Hus te Ruoatidtvisen Sante Camel Soho. samen Scher Special amity oF tatnats Ge. Gre By a 4. Disciplinary measurals) taken wee trade Bate st the che, i amy: Reason Coasequenre ovement RATION AND WC R Ghid sabbier oe. 2 Aenbaton cha’ Ariba: sthex s Ambiaen for Chas Mothers Ambaven fos Childe fe (Asche) +S Meatevial s Psd:"
    },
    {
        "image": "guidancerecord2_synth_16_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "GUIRANCE ANG COUNSELLING SERVICE INDIVIOUAL INVENTORY RECORD RUE? Rar Surmaree) Pace of Barth Boardise: nedatronings SNE” pahisenn; Het Sewet, Menepeg FARM Gaba: 2, Father s Mame: Pigcs of 88 Reatiomalay: F2e 0 2 Muther s tame: Seton Game ice oF Bart Hationalty: & Mio, of Chiba: a tangange Dialed Farid Keonomie Statw %& avidegss: Ov2 Smapsen Raw, Novetan Howse: Oueed apnea Religion: tease Son Lawn conn ACES: SEO rcesaite: Baie of tit: eae Tiving ov Deadk ate edaet attaanmeat LIAL DATA: eo {Sageng Siena Breet .Faited ex dropped out ia any grade? Sends Sead Baie Razson cnareguecee ounment TY. ADSI ECATIONAS AND LOCATIGNAL DATA 4. CU s Hebe Or. Ge. ft _& B Prbutien: a. Chita xwtniean: Fadiers seabitien toe Cd: Tp iota’ tambien tee Obi. fa, tater s Read"
    },
    {
        "image": "guidancerecord2_synth_16_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "7 measures) taken against tne ch 2m Consequence Grade Ee"
    },
    {
        "image": "guidancerecord2_synth_16_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE AND COU Reta vain: nauonabty. a naeth s Watne RAT RR Jroce of Baty Cor Se 4. Langanae 5 address: 1 A eked ox dropped out a Grade “RS pectal abiaty or Haieats Ge i: Dente a onserpiary menasarets taken agarest BE cated amy, Dae Grade ty BBNOCATIONSLANG NO 1 Chas Hobbies on: antares: che 5 Arran tatner s Araiamon for ONS (iter aunty tor Ci 2. taatenai s Read trdnarme: NCE IND! VIDUALS INVENTORY, augue 08, 2018 pate of Bath: tami ai vninew Dato of Bat (irae or Bea: 2 Educ Latamment’ Bate ota “gate TT Hos T _ Keavon tn een 23 Fanty Mouse Owned ert coeene ee cause of Death Fatal sto. of Chile em: i Fromomie siatess ‘Tionnr Larned | i"
    },
    {
        "image": "guidancerecord2_synth_16_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "Nam _Ltvne Frederek —_Dudiay (Surname) (Given) (Middte) Place of pith: ‘2! Pas. Nese Occenias Wickname: Fes Sec Matronality: Fipine Date of airth; AvGUst 05, 2018 Guardian: hares Levine \"Fan oara: Religion: 2 29 Aarne: Relationship: Grandtatner 1. Father s Wame: _Srett Levine Place of Birth: Las Pas Addvess: 8 lasmine Steet. Mandatyong Educ l Attainment: \"9200s crasste Occupation: Date of Birth: starch 23 1005 \\eligion: iglesia ni Craig Nationality: Fab Living or Dead: Uving Mother s Name: sate Cane falul Attainment: Caio Grsaune pation: Engineer Cebu Cay Date of pit tate ono ving or Dead: _Liing Boys: 7 i a wrong) t8d at home: Tagua, NS Sampson Rosd. Navotas —~ Family Economic status. Hide income 1. Schools Attended School Grade Year Sec. Ateneo Gade Scie 17 Gre 1 a80g Stang Ewmeniay Soo] i [Aenes Gade Sent 20102010 Gages runing Eee School r 20202021 Gade t Cesaeng Stang Esemeninny Sooo om Grace 8 2 Falled oF dropped out in any grade? Yes, Grade School Year 3 Special ability or talents Gr: Pubte Speaking Grit; Ants Gr. tt; Sports Gr 1V: Reading Gr. Vi Reading Gr. VEE iting 4 Disciplinary measure s) taken against the child, any: Grade Date Reason Consequence Comment Gru: Gr. it: Cooking ng cans a Grade T Grade ti [Grade no] ernie Gnadevi Gesior__TTessner [ee Teacher Asst Tenaneer Engineer a rey Megecees \"[Megasnes Texsoows"
    },
    {
        "image": "guidancerecord2_synth_17_aug1.png",
        "label": "guidancerecord",
        "ocr_text": ""
    },
    {
        "image": "guidancerecord2_synth_17_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "Kan vn Nam ee Wetmame: £7 Sex: M Nationality: Fipne (Summame) (Given) (rau) Place of pith; _Valenevls, Mae Mansa Detect wath: oust 20 2018 Religion: Asan Crasan Guardian: A¢#™ Khan Relationship: Uncie Address: 980 Rosas Street, Coloocan FAMILY DATA: 1. Father s Name: Daniel Khan Educ Attainment; Senetaxy canine Place of Birth: Cebu Cay Date of Birth: September 18 4972 Nationality: Fapino Living or Dead: Deceaseg Cause of Deat! 2. Mother s Name: Vanssia Vaux feof aanenment Wetinalcane_ Occupations Tea Place of Birth: Taguy Date of Birth: November 24. t9a0 Religion: Bom Agan Chistian Nationality: rape ‘ving oF Dead: Ly 3. No. of Children: Boys: Girls: Total No. of Children: a Language: ialect s) used at homer tecano ——— Fan Economic status: gh income ——— ‘5S. Address: 103 Paianan Steet Cagayan de Oro House: Owned =>-ecc= Rented M. EDUCATIONAL DATA: 1 Schools Attended School] —Grade& J Roma Wonor Eames —Tancar Kamuning Beery Schoo Sa Wie righ onan ES Poses St Joseph Schoa Sesion wer Harn Bagong Stang Eeneniny Sohoor ‘Quezon Cty Cental Schoe 23 NA ‘Cindy Hood 92 Wit High Honors plitntioners John Oren 93 ‘Miche! Haris ‘St_ Joseph Schoo! No Cause () Persona easers Franost pases Special ability talents Gr. t _Ressng Grtz_Spors Gr. Seong rt: Aas Gr. Vi _Bawng Gr. Vi Sang ‘“-Discplinary measures) taken against the child, any: Grade Date Reason Consequence Comment gee 8 jy 2023 Fightin Wann ounseingprovied Sage ja Sat Rez Sarena Sispeon Grier epsstaton 1 Child s Hobbies Fs Reasing Gr. tv: cove 2. Ambition: Grade T Gradew Gradev Grade Child s Ambition: in Teacher Father s Ambion for chad: Past Mother s Ambition for chad: [S22 Engneer Acchtest [oocir 3 Materiars Read:"
    },
    {
        "image": "guidancerecord2_synth_17_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "Fetal tee, of Chakgoen 3. ~_noase: Oxned Des Rented. 4. Disciphoary messare s Laken against the chtd, 4 ay Date n"
    },
    {
        "image": "guidancerecord2_synth_17_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "Sex M_ Matenattey: Fee ame} (Silver) {tle Vaterecein, Movs Manse 108 Spann Si Swarctians em eran Retstionstips ee atdecwss: 2, RARMLY Bee Father s frames ____ Feast tsiamoats TTBate of it: tr flags or Baad pecs Wationality: Fee oem. basther s tame: Vv 2 Rducll Mtsinments veecow Cane Grespabe eae of Mitt: ing ov Owed Ra, iiss Barrens af B. ARE (Tee oeean Sohoet 2 Failed oF dreppad out in any grade? cae 5) sade Special ebility ortaiente G Se a 2. Disciplinary sneasmieis) tak Cemmont Grade consequence Di AOMOCATONA! AND YOCATIDNES A. Chis Hobbies Ge Same Se. Be 2 faniteors cites Bowden: Fathet s Ambion for Rinthor s ambition far patertal s Bans"
    },
    {
        "image": "guidancerecord2_synth_17_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "SUIDANES AnD Counsrtty ed PUBIL S Pogson para: it Wehoames Ecrrmcey Ptace of wart: VS ann Bote oF anti: Retatronshig: Unse Address; 1 Father sstame: Se Educt Attainment: Pisce of Birt, Bate oF But: Se Nationality: Hine 2 Bhattves s tare 0 _ Pett Attsooon nt Plose of air Bite of Birt: Liviag or Beak 8, Oesapatons a kengz __ 62058 Hi Best, Sovet fe. oF Chiteren: aesily Coonomic Status: Sg Hause: Ouvnedt Sane parted 2Falled or dronped ust fm an grate? BS pociat onitay or ratents Ge. i: BEBE foe 4 Bisciphinary messarels) taken against the chit a rate Bote N. AbvOcATCNsL pp 4 Chegs Hobetes S Aeabition for citi, Mathers Aminion for chite: 3 Materia nen"
    },
    {
        "image": "guidancerecord2_synth_18_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE AND COUNSE! ERVICE INDIVIDUAL I Fezpatick Randy Baker Nam —— __Fendy ___ Beker (Surname) (Given) (middle) Place of Birth; YO C8. Davec de! Sur /ENTORY RECORI Wickname: Randy Sex: M___ Nationality: Fano Date of pirth; 2 74#” 25, 2015 Religion: |e\" Guardian: “ersten Fezpati Relationship: Srnsmoter address: 808 Tops: Stee. loto Oty 1. FAnmy para: 1. Father s Name: _Joshus Fitzpatrick Occupation: Engneer Place of Birth: Pasig Date of Birth: Ju 16, 5 Religion: Roman Catnote Nationality: Fino {ving or Dead: xing Cause of Death: 2 Mother s Name: _xaz Larson Educ l Attainment: Some Cotege _ Occupation? Place of Birth: Minis Date of Birth: November 07. 1984 Religion: iglesia ni Cass Nationality: rapes ving oF Dead: Ling Cause of Death: 3. No. of Children: Boys? Girls: _2 Total No. of childr 4; Language: Dialect s) used at home: agaynon Family Economicstatus: tide income 5. Address: 202 Davis Avenue, Pasig Educ l Attainment: Some Cotege House: Owned Rented EDUCATIONAL DATA: 1 Schools Attended | Schoot Grade &T Rating Honor famed Teacher Year See. Le Sate Green ams 20182010 Gade 1 Siang Elementary Shoal 2010 2020 ‘Quezon Cty Cental Schoo! 20202021 Grade 3 4 Quezon Cty Central Scnoal 3 La Sate Green Has 2023 2024 Grade 6 2 Falled or dropped out in any grade? Yes Grade School Year Cause (5) Special ability ortalents Gr 1 _Singng Grits _Spons Gr. is Weng Gr: _Segng Gr. VE Wing Gr. Vir Pubic Speaiing 4 Disciphinary measure s) taken against the child, f any: Grade Date Reason Consequence Comment Grade 3 January 2023, Taxiness Waning Under obsenation Child s Hobbies Gr. I: Spons Grit; Resting Ms Sports Gr. Wv: Gr. VE 2 _Ambiton: Grade _ _Gradeu_ Gradew_[ Grade GradeV Gradev? hild s Ambion: Caper Aasitect re et Father s Ambition for Child: 7 Plot Busnessran Scientist Mother s Ambition for Child: [pao ri “Tscaaist [snesemen Loot 2. Materia’ Read: (Serie [stots Thawapenen Reseses Toe [ems]"
    },
    {
        "image": "guidancerecord2_synth_18_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "Hieknasme: BONY Sens ME Date of Fathor s fame: Piace of birth: J Makonality 2. Miotner s Has face of birt: Natanaliy: Fetal No, of Chiktren= grit Pupie. Spe. ore Shane. 4. Disciptinury mneusuvo s! taken against the cle, if aan Consequence comment 2 Chita s Ambition: Eallser s AmbIGN For Childe Muthiy s ambition fos 3 Material’: Read:"
    },
    {
        "image": "guidancerecord2_synth_18_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "t (Surana ftveny ode Cay, Dawes Sat Place of Bish: Ise Matsonsiity: pee oe 4 Language: Diateen s} used at humee: Hs Address: GOUSADONAL DATES EehsoG Ae dad ese a ‘BFaied ev dropped out mx any grade? Grade suippectit oblity or tatents Ge. i ts. Ns Sao, 4. Diveipiay creasurels) taken agninst the obild, amy vate Sanuans 292 Grate aonbigion: child s Ambien: Fathar s anebatrsn fox ates ahathar s Arabian ter Chee AB tanta s Recah: duct attainment: Sone Sotege i. Reason Tagen Ocempae a Rabi Ease SF Death TT Fekal ta, of chases —Faaniy cenmenmi States: Oncupatio® gas jen: Enaeae ownan Sata"
    },
    {
        "image": "guidancerecord2_synth_18_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "* Fathers tame: oo EOS AS tn mnt: Pheee oF Biot: ann Bate UF Rete Coilag 28 Bead, Becspatie nae Batons ... Case Of Death: Piece of Biv Rahanaiey: F550 3 fis. oF chadon: tangas sonertie 6 anna HOUSES Quxsccd Consequence Comment ghesnstin, Be, SRAMATASS ANE vocArORNL pasa: 1 Chitt s tobhies Ge ts Bete 2 Ameimon: CARES Aran: Pater s subivee tor chai Mother s Aenean Sos Ubink A AButartal: Read"
    },
    {
        "image": "guidancerecord2_synth_18_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "A. Father s tam, a 3. PUPIL S PERSONAL Data: Fezpatres Randy Nam —S__Ran (Surname) Wckname: Ransy (Gren) (Middle) Place of Buth; 9% Cty. Davao de! Sur Guardian: /998Ihen Fezoatncs Nabonality: Fish Nabonality: Fino No. of Children: Language: Dialect s} used Address: 202 Dav Avenue, Pasg DUCATIONAL DATA, 2 Faled oF dropped out in any grade> Grade chita s Father s Ambition for chid: Mother s ambition tor child: 3 Mateniars Gris s Ambition: Read: Date of uth: /8748% 25 2015 —ee Relationship: Srandmoine Ne: _JoShus Fezoatnce Place of Buth: Pas: —_ Educ Attainment __ Date of Buth: Living oF Dead: vn, ares 1 ent So _ _— 07, 1088 Some Cotege _ Date of Birth: Novenvers: See M Natonaity: Féene Religion: Address: 95 Topaz Isiam Steet lowe cay Sere o89¢ _ Occupaton: Engneer Jy 18. 1980 Religion: Wuse of Death: Religion: 2 Cause of Death. —_ Girls: — Total No. of athome: tig: Family Economic —— House: Owned Children: 3 Status: these Income D=<= Rented Roman Camoic Occupation: Ones PE rion Gem: spony Consequence Manag Ot. Vit Butte Spesing Gr: Wiring Comment Under obsenaton"
    },
    {
        "image": "guidancerecord2_synth_19_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE AND COUNSELLING s1 RVIC! CE INDIVIDUAL INVENTORY | PUPIL S PERSONAL DATA: Nam sear a Vickname: Ses Sec M (urmame) (Gwen) inmate) Place of Buth: {°° +) Savas dei sur Relationship: Fasnee FAMILY Dara: 1. Father s Name: Place of Birth: EdUCT Attainment Date of Navonalty: Figng _ 2 Mother s tame: sein tos S288 Occupation: Sag Place of Bith: nanny —— Religion: gaia 5 Nationality: Fans ——_ ting or Dead: Farsi na of Death: ascdgny fo of Childe: pays a re Taney \"2 Tata erat 5 3 kineuae: Ovatect s| used at home Yapa09 Farmily Economie status: tise incsre 9. Address: 834 Mote: Ome Se pee MW. EDUCATIONAL DATA. EDUCATIONAL DATA: ‘1 Schools attended 1009 Elena Karunag Fane Mcnae Gotan wing Elenentay Gono: Karunng Elementay Sense Breanns tye 3 Special ability oF talents ori: orm: OVE Dang Wv AUR ONAL AND VOCATIONAL ata, BCE Hobbies Gy TNA Gry, Ambion: Child s Ambion: ae Father s Ambition for Child: _ _ cutest Mother s Ambition tor en 2 3 Matenat s read,"
    },
    {
        "image": "guidancerecord2_synth_19_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "Gaver} eel sttaanones Bate of Beth: iain oF Domed: Lang Feige h Anzinmnent “Bere ot Bets fare 3 Wing oF Beast a _e one of Beat ewcupaiien: fo 4 Father s Mares 2 Bice of ant pice af atic: warns natonclty: S800 2. tes oF cheers BOYS, 4B Language: Disiedtis) vsent at g, Addrans: 2 Fanat tea, ef Chute: Famdy Erosouc states: JA Meuse: Owned acy peasure s] taken agamst the chi anys coade Dats Rese a. Gisciptin we AOWACATINIAL ANE LOSATOMARESTAS 1 pnts nebies 20 5 8: SB 2 ambition: chides Ants co? Father s Amitian tor Child: pacttves s Arobatign 608 Chih 4. atateriat ys Senet"
    },
    {
        "image": "guidancerecord2_synth_19_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "& pda Astainment 4, Fativa s Nene pigoe af bath Feroneny: £6 Mother! Heme: gain Gand ow Biase of Both! uinee. Ting a7 teas: Ede at ataenes ae of ith ASpactat obiiy ertalaats 665 Gr Pes Dram, Acbiscipiineny secanursinl tater ceptions the eile ary Baader fate hesson WY. ARYOCARONA, srb VOCE OIA DATS: 4. Childs Hobbes we. 2 eubition: sheites aamiaice! Father s Annisstun for Chic: sothse s Anshities fer cid 3 Stateriat s Rea: gto of th: See Be ke Reming Gr: Spars ae Soe Caw ef Beatie fos: Deva cd Ge. tote osromneene Giaeey o 4)"
    },
    {
        "image": "guidancerecord2_synth_19_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "ANCE, Ang COUNSELUNG SE GUIDANCE! 2. Father s REE peace satiety 2. Mother s Place of Kerth: Wareoe. apawonai enone gone eeeadrens Ba a pangeane: Duatestis] wet wy aspactet 4. Distt a an ing, Svan clomentans Sd _goity oe taizats b, nesseess: Bed gt Seest Se SPYGATSMAL DATE Seon [gana 4 et ae ary eanogurelst 12808 mace patton cos ame Fate’ pasa’ 1g Aveseancn fav COE a. wuetertal Reve pba foe Cis ag Bein eke pate sf Set Sapien xetationshige P88 seige s attain jez! use, past Bee eb, ORY peed ceaweaeeee ene ee comment apa EH on Shap eases 1 Geieeuneanaonet"
    },
    {
        "image": "guidancerecord2_synth_19_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "furnase) siace of aint: SP. cwartions 220 EAMARLE DATA: 1s. Father s Homie lace of Barth: Yar Natonality puters Nats: namenaity: Hens 2, Ne. of euidren: A Language: abet) 5. address: $04 abated or cupped ont im 26 Grade iy. BOYOCATIOMAL ANG VoceNl Joins chidls Be 2 Aeabaaen: epics arsason: rashes’ A Mother s Asnbinon for 3 Sataxtate Rend ahem ai joaten fox Cot rete? inst the obit, amy Send vessorarsa: 5 _ tate of atin: OS setotionsiies F2 Eauctactsnvent eel Death: agatent a) io, of Children: i Family Eeouomic states Gunes Enea Be Reason"
    },
    {
        "image": "guidancerecord2_synth_20_aug1.png",
        "label": "guidancerecord",
        "ocr_text": "= ickaam [emasne) (Given) (Midle} _ Retigion: Sa ‘Date of Birth: ofationstip: 02% Pisce of Birt ationatty: 2 2. Maothar s Nam Stace of dict Piatiensioa: 26 2 No of Uhitdren: Bey A. tangwager iste! ws 5. patbraye: 108 308: Feet AB ainsneni: Bate of aust ERUCATONAL BATA: s tisesplinary macsuretsl taken against the child, ey Grae pate 1. ANOCATICS 2 Chile s ei sos, ne noubies rie 2 Arbigen: Child s Amsbanion: Fathers Asnbition for Chil, Mother s Antbition fer Chit 3. Materials Read"
    },
    {
        "image": "guidancerecord2_synth_20_aug2.png",
        "label": "guidancerecord",
        "ocr_text": "PUPIL S PERSONAL DATA: Nam —Wanegen_Meande _tane® vickname: Me Sex F__ Mationality: FP? (Surname) (Given) (Middle) Place of auth: ais: 5887085 Date of auth: Serterme' 26 2019 Religion: “PTS OSE Guardian: \"a7y Washington Relationship: Mote Address: 105 Srtfn Deve, Marking FAMILY DATA: Educ! Attainment: meen cam Occupation: Archtect 1. Father s Name: _Tnomes Washington Date of Birth: More 27, 1976, Religion: Protestant Place of Birth: Pasay Cause of Death: Navonality: Fapn0 ‘ving or Dead: Lng 2. Mother s Name: Seba Samar tducl attainment’ asi s Cages Occupation’ Achiess Place of Birth: Pasa Date of birth: September 15 1887 Religion _Proestant Nationality: Fipno Tiving or Dead: Ling Cause oF Deal! 3. to. of Children: Boyst a Girls: Total No. of children 4. Language: falect s) used at home: Tagsiog Family Economic status: eee Mase Income 5. Address: 726 45th Drive, Valenzuela House: Owned === Rented __ Ii, EDUCATIONAL DATA: T Schools Attended School] Grade | Rating Honor farmed Teacher Year Sec Tania Genial Shoal qois2010 Gade 1 3 Thee Sen Manis Cenval Schoo 2010 2020 Grace oe Readems Ava Cons tong Si Joseph Schoo! 20202021 Grade 3 2 Wir Hones Cynthia Conova Hol Spt Senoo! 72021 2022 Grade 4 22 wit High Honor Etcabeth Smt Si doseph Senoo! 20222028 Grade 5 35 academe Award Waam Shepesd Holy Spit Scho! 20252028 Grade 6 35 ‘eedeme Award Jame Ken 2 Failed or dropped out in any grade? Yes no Grade School Year cause s) special ability ortalents Gr. t _Oawog Gr; Resdna Gr. m _Pobte Speaking GreIV _Dawing Gr Vi Spans Gi Vi Reading 4. Disciplinary measure s) taken against the chil, any: Grade Date Reason Consequence comment IV. ADVOCATIONAL AND VOCATIONAL DAT 1. Child s Hobbies Gr. 1; Gamng Gril: Cooking Gr: Owing Gre: Spare Gri Vi Dancing Gr Vi_Gamog Gadet [Grade [Grade Gradetw Gradev [Grades Tagneer___ [Pret Taner [tewyer Soentst Seentst Father s Ambition for Child: [vente rer Engneer [Businessman [Dociar ewer ‘Mother s Ambition for Child: [Teacher Architect Businessman _| Engineer Piot Artist 3. Materials Read: Foubaee [Enoois wagesnes [Wagsznes [comes Teomes"
    },
    {
        "image": "guidancerecord2_synth_20_aug3.png",
        "label": "guidancerecord",
        "ocr_text": "RSpecial ability ortalents Gr. _Owsey Cn 2. Diseiphnary mvasare sl takes against the ik H aay cede are"
    },
    {
        "image": "guidancerecord2_synth_20_aug4.png",
        "label": "guidancerecord",
        "ocr_text": "__ raatonsiny: PE [Swemaone} saa srecay see piace of Births Retigaos 7 Moraine owardians Spay Ba) 4. Father s Hames Beaux af Witty: Parey Havanality: F9e9 2 tdother s Haine: f Place of fart Pang Natonabty: en, Rekgion: Poe TEease aT penta: Occupant “iiing ar Dead: _ Becta Bate ol ite Ting 0+ Bead: Guts: 3 Special ability or talents Gr. fr Dawn Ge. We Dy 4 Qiscipinnary eseasteret aban against the che, 20: Seale Reason cawsequence Cameemanit w, 1 Ge, is Dinning, —— AE SEG memories 2. Ambaraa! tgiele Cede To ir Chile s Arate ion: Fathar s Ambion tor Chel Mottien s Asuhstten for Ci 3. thateriats Read:"
    },
    {
        "image": "guidancerecord2_synth_20_aug5.png",
        "label": "guidancerecord",
        "ocr_text": "GUIDANCE AND COUNSELLING SERVICE INDIVIDUAL INVENTORY RECORD fam EEE Yieknamar Me See F Satonatiny: TS Se ee Place of wicth: ____ Date ef Barth: __ Religion: Bette, Doce Meviina peiahonsh _ Seeupadon: Religion: enue of beat lace of Birt Habon ality: £2 Aatines s San Dato of auth: ns fied Fatal Bo, uf Cade Famfiy Eeomomuc States, House: Owned 2 {2 Failed or dropped out in any grace? Grade 3 Specs a Gen yortsients Gri: Dawe intinary masaure s) token agamat the chad, i any: Grade Date Reason Wy, anyoesnon, Chile s Arabian: Bathar s Anibevon e s hembiton for Chile Ps Bead"
    }
]