[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "advertisementhiring",
        "ocr_text": "Open Positions LaSoftware Engineer wT Technician Administrative Officer Qualifications: Send Your CV: Team oriented and adaptable. ericagutierrez gmail com Proficient in computer applications. Able to work independently. Contact: Strong 9316644275 communication skills. : More Information: @vibewithnature Ittpswww mathzone com 2 ee ickand AR ob8og or"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "advertisementhiring",
        "ocr_text": "Open Positions: taSoftware Engineer; wl T Technician ba Administrative Officer’ Qualifications: Send Your CV: Team oriented and adaptable. ericagutierrez gmail com Proficient in computer applications. Able to work independently. Contact: Strong 9316644275 communication skills. : More Information: @vibewithnature httpswww mathzone com 220 ennisland, AR S895)"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE HIRIN Open Positions: CySoftware Engineer, WIT Technician WAdministrative Officer Qualifications Send Your CV: Team oriented and adaptable. ericagutierrez gmail com Proficient in computer applications. Able to work independently. Strong 9316644275 communication skills. ; More Information @vibewithnature 220 Powell Shoals Suite 354, Lake i 98895 httpswww mathzone com Dennisland, AR 9889 Contact:"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "advertisementhiring",
        "ocr_text": "wo fours: Pe ee ae be S Ao ee = eric gutierrez gmail com Team oriented Proficient in Com Races ependently. Abie to work indepencen: 9318844279 ation Skills. communis More eer yrneien nitos www mathzone corm ennis!"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE HIRING Open Positions: LaSoftware Engineer, wT Technician Wi Administrative Officer: Qualifications Send Your CV: Team oriented and adaptable. ericagutierrez gmail com Proficient in computer applications. Able to work independently. Contact: Strong 9316644275 communication skills. : More Information @vibewithnature httpswww mathzone com 220 Povetniland AR 98805"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "advertisementhiring",
        "ocr_text": "Pemmoemann oe Qualifications “Send Yourcy: Good time Management skills. HFEgorycampos@ Comal eh Customer service experience Preferred Team atiented and adaptable. Contact : in epee deo, eee 8267229780. Moreinformation: @cozycreations Pape ik? 6 Amy Mountain, West tipswww techacademy io _ Jeremyburgh WA bates"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "advertisementhiring",
        "ocr_text": "eSoftw: 4 4 Sond four cy: é regorycampos@¢ mail cam Me bed ey 5 n Sontack- Abie to work 8367229780 independ Hy. BIBL fori More NOT aU ntips www techacademy 1 my Mountain, West myburgt, WA 24406"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE Open Positions teSoftware Engineer) Send Your CV: gregorycampos gmail com Qualifications Good time management skills. Customer service experience preferred Team oriented and adaptable. Contact: _Aple to ork independently. More Information httpswww techacademy lo 8367229780 @cozycreations 216 Amy Mountain, West Jeremyburgh, WA 24408"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "advertisementhiring",
        "ocr_text": "eens: bene Voug Oy: ood time management skills. regorycampos gmail com He) sd Sant 2 Cust, servic Rees: 2 am oriented and adaptabie, _ Abie to work 8967 229780 ess work, Gig regerGo dove tar rieiian hitoswww techacademy io Joozycreations"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "advertisementhiring",
        "ocr_text": "Qualifications: Send Your GY: Good time management skills. gregorycampos gmail com Customer service experience preferred. Qontast: Team oriented and adaptable Able to wor eas Ex 3672 in Rgendently. 8367229780. More informetion: @cozycreations 216 Amy Mountain, West hitpswww techacademy i0 Jeremyburgh, WA 24408"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "advertisementhiring",
        "ocr_text": "atications SENG Your oy: Able to work j de pendently. elijah74 gmail. com CG aes detail quired More VEO atinn 2079057865 @modernmindsat IUD Gor South Ch I8Www education nters Apt 892, iatene. NM 8296"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "advertisementhiring",
        "ocr_text": "wy WARNER SPENCER WE ARE Open Positions ea) Software Engineer| i Web Developer w Web Developer Qualifications g Send Yourcy: Able to work independently elijah74 @gmail com Able to work independently, Reliable and hardworki —— Contact: Ng individual, Attention, to detail 3079051865 More Information S @modernmindset 3270 Lozano Centers Aj t. 892, South Charlene, Niv 82087 “/Muww educationhub com"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE Open Positions: SiSoftware Engineer} Oi Web Developer O Web Developer Send Your CV: Qualifications elijah74 gmail com Able to work independently. Able to work independently. Gont Reliable and hardworking individual. on act: Attention, to detail required. 3079051865 @modernmindset 3270 Lozano Centers Apt. 892, South Charlene, NM 2987 More Information: “ttpswww educationhub com"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE Open Positions: FS otware Erancy ba Web Developer ms Web Developer Qualifications 5 Send Your CV: Able to work independently, elijah74 gmail com Attention to detail 3079051865 More Information @modernmindset 98ww educationhub eom Sout ane Centers A t. 892, South Charlene, NM 82087"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "advertisementhiring",
        "ocr_text": "veloped Qualifications: Seng Your Gy: Abie to work independently eliiah74 gmail com Abie to work independently. ‘ie fh aty gilis em. are Contact: hard ividual. ail 3079051865 Attention to det Cured Mare informatian sc iwww. educationnub com @modernmindset ups"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "advertisementhiring",
        "ocr_text": "Ge Vicarvione eed Your Oy: david25 gmail com Able fo wo ee Sood time management ae aan oe SIGE 23608 hore Alorne car: @sunsetdreamer bswww educationhub com USNS Ellis, FPO AE 60799"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "advertisementhiring",
        "ocr_text": "Qualifleations Send Your Ov: _Jeam oriented and adaptable. david25 qmail com Able to work independently, ae s t Good time management skills. 2 PONG: Attention to detail (813 643 3698 re required. i s More information @sunsetdreamer PSwww educationhub com USNS Ellis, FPO AE 60799"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "advertisementhiring",
        "ocr_text": "# PS Pre TG ee Set Cure Se as ye. rs CHIANG AUONS Send Your Gy: S Tearm oriented and adaptable. david25 amail com Able to work independentry. Good tine management skilis. Attention, fo detail (813 643 369 required. More ipformetian @sunsetdreamer ttoswww educationhub com USNS Ellis, FPO AE 60799"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE HIRING Open Positions: IT Technician] Data Analyst Web Developer Qualifications: Send Your cv: david25 gmail com Team oriented and adaptable. Able to work independently. Good time management skills. Contact: Attention, to detail (813 643 3698 required. More Information 5 @sunsetdreamer 98Www educationhub com USNS Ellis, FPO AE 60799"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE HIRING Open Positions: Mail T Technician wData Analyst Wi Web Developer Qualifications Send Your CV: Team oriented and adaptable. david25 gmail com Able to work independently. c tack Good time management skills. oma. Attention, to detail (813 643 3698 required. More Information @sunsetdreamer ttpswww educationhub com USNS Ellis, FRO AE 60799"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "advertisementhiring",
        "ocr_text": "GQuantications Send Your OY: Strong communication skills curryaaron gmail com g Ker, Team oriented and adaptable. a Contact: Good time management skilis cate Proficient in computer applications 3 24945125 More Information @urbanwanderer itpswww techacademy ia =, 79° Miguel Neck, Owenport. AR"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "advertisementhiring",
        "ocr_text": "wy WARNER SPENCER WE ARE HIRIN Open Positions: wa Web Developer Project Manager wSoftware Engineer Qualifications Send Your CV: Strong communication skills, curryaaron gmail com Team oriented and adaptable. Good time Management skills. Contact: Proficient in Computer applications 3824945125 More Information: @urbanwanderer Pswww. techacademy io 795 Miguel Neck, Owenport, AR 15925"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "advertisementhiring",
        "ocr_text": "Open Positions: baVVeb Developer ba Project Manager Qualifications: Send Your CV: Strong communication skills. curryaaron gmail com Team oriented and adaptable. c t t Good time management skills. Opes Proficient in computer applications. 3824945125 More Information @urbanwanderer 95 Mi Neck, O rt, AR hitpswww techacademy io Medco"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "advertisementhiring",
        "ocr_text": "Qualifications :. Send Your CV: Strong communication skills. Curryaaron gmail com Team oriented and adaptable. ne c S _Good time management skills. eidteoshat Proficient in computer he 42 applications. 3824945125 More information @urbanwanderer htipswww techacademy io 799 Miguel Neck, Owenport, AR"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE HIRIN Open Positions: bal Web Developer! a Project Manager Software Engineer] Qualifications Send Your CV: Strong communication Skills curryaaron gmail com Team oriented and adaptable. Good time man agement skills. Contact Proficient i uter 0 applenicomP e 3824945195 More Information @urbanwanderer Pswww techacademy, io 795 Miguel Neck, Owenport, AR 15925"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "advertisementhiring",
        "ocr_text": "aphic Desig SAAD OU AN CR ERE ewaerisirs in Ae Strong communication skills. pereziohn gmail com sat orabiem- mares o Tae Sars ifindsph EMOTO NSUON tpswww readingcomerorg"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "advertisementhiring",
        "ocr_text": "Sand Your pon Ae Qualification: 2 perezjohn gmail com Strong commu! ication skills. Contact cellent prob’ ustomer Sem\" vice OX perien \\ple to work 549 704 564 1 separ ently. More information: @locaifindsph 759 Anthony nds Apt 488 acopchester, Wi B9402 ttps www readingcornelorg"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "advertisementhiring",
        "ocr_text": "a eee ee Ses Four ey: Strong cormmunication skills. pereziohn gmail com vellent prabi ie tomer $e! siomer ser _Apie to indepencently. More (ArGroe tion: localfindspn tips: /jwww readingcomer org re aconet peter, Wi 86402"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE HIRING Open Positions hay Graphic Designer wa Software Engineer 4) Web Developer Qualifications: Send Your CV: Strong communication skills. perezjohn gmail com Excellent problem solving ability. C Contact: ustomer service experience preferred. Aple to wor! -704- indeoee or 549 704 5641 More Information: @localfindsph ttpswww readingcorner org i Nacobenesien Wi 80402"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "advertisementhiring",
        "ocr_text": "Send youroy: Gugl nesters: Strong communication skis. perezjohn g mail com wl Excellent probl Sepiact: preferred. Customer ser Able to work independent! More innate: 758 Anthony Islan dasobchester Wi mitpswww readingcormel Org"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "advertisementhiring",
        "ocr_text": "Bes pee ees Sua rien. Sand vou, iY Knowledge of office croc Sharonpope amail. con ented a nd ad vibewilthnature Istoryworld pet PS:/ eww. hy \"82 Pisin, North James, TN 34535 Eeereel"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "advertisementhiring",
        "ocr_text": "Project Ma nage Praline eer wah Qualifications. Pe Your Knowledge cf office procedures. Sharonpope@ ted anda fe Part ae. ce preferred Con eaet 27: 735 889 6004 PI i mn ailon. nOS Awww hi istoryworld net 78 Ramirez fia ain, North James,"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "advertisementhiring",
        "ocr_text": "ot Manager spss RSTSTS ET TR ESET tend YourGy: Qualificaiens sharonpope amall com Knowledge of office pr peGt: Team orient 275 889 6034 @vibewithnature az Plain, North Jame! TN 34625 pare iforraes> 9478 Ramir https: //www historyworld el"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE Open Positions ar acrpgguat Project Manager Mivarketing Assistant! Send Your CVE: Qualifications 2 sharonpope gmail conl e of office procedures. Knowledg Team oriented and adaptable. Contact: Customer service experience preferred. Proficient in computer -280- applications. 275 889 6034 More Information @vibewithnature 2478 Ramirez Plain, North James, TN 34625 ttpswww historyworld net"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "advertisementhiring",
        "ocr_text": "Sere your Knowledge of sharonpope gmail com nied and z Cones. 4 More information @vibewithnature 2478 Ramirez Plain, North Jame ntioswww histo ryworld ne: TN 34625"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE HIRIN Open Positions bi Web Developer bal Software Engineer Project Manager Qualifications: Send Your Cv: Attention to detail required. Jennifertucker gmail com Customer service experience preferred, oe Contact: roficient in computer applications. Team oriented and ca aeeates an (334 460 0903 @happysoulspace 98www futurejobsportal com 85087 ummons Mission, West More Information :"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "advertisementhiring",
        "ocr_text": "wy WARNER SPENCER WE ARE Open Positions Alweb Developer Al software Engineer *) Project Manager Qualifications a Send Your CV: Attention to detail required. jennifertucker gmall com Customer service experience preferred. proficient i a Contact: roficient in computer applications. Team orient d and x a Pivtable. (334 460 0903 More Information @happysoulspace g5097 Simmons Mission, West Joseph, NM 28578 —pg_|/ www futurejobsportal com"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "advertisementhiring",
        "ocr_text": "pa erae, lnaasscore Sy Qualifications 3 Send Your cy: JEnnifertucker gm sueaion io detai} required, al com referred, x * ts nt in compute applications. Contact Zi annem and (334 460 0993 More Inforn; ation: @happysoulspace : 85097 Si Mis hwy. futurejobsportay. com Joseph, Nay sa ion, West 78"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE Open Positions: Pa vWeb Developer a Software Engineer A Project Manager Qualifications Send Your CV: Attention to detail required. jennifertucker gmall com Customer service experience preferred. —z Contact: Proficient in computer applications. Team: neorientee and (334 460 0903 More Information @happysoulspace 85097 Simmons Mission, West Joseph, NM 28578 ps iwww futurejobsporal: .com"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE HIRING Open Positions: ba Web Developer ba Software Engineer Project Manager Qualifications: Send Your CV: Attention to detail required. jennifertucker gmail com Customer service experience preferred Poneen Contact: roficient in computer applications. Team oriented and 7 eam erentes an (334 460 0903 More Information: @happysoulspace Swww futurejobsportal com 89007 Suamons Mission, West Joseph, NM 28578"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE HIRING Open Positions: oo yuma i VWeb Developer Qualifications: Send Your CV: Proficient in computer applications. jeanette29 gmail com Proficient in computer applications. Knowledge of office procedures. Contact: Customer service (209 887 0485 experience preferred. More Information: @dailyvibesph ittpswww biostudyhub com PSC 7620, Boy 0928, APO AE"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "advertisementhiring",
        "ocr_text": "2200 Yau, toe jeanetie2 Ofcient in 9 gmail com a Canine: Knowle; dge of office Procedures, Customer S rvice (209) experience 2: Sd. Mere: Oren et on: S.// www. bios eae 2eSDh ‘UOVAUD Gam"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE Open Positions Web Developer Send Your CV: Qualifications jeanette29 gmail com Proficient in computer applications. Proficient in computer applications. Contact: Knowledge of office procedures. Customer service (209 887 0485 experience preferred. More Information @dailyvibesph PSC 7620, Box 0828, APO AE 415210 Sttps www biostudyhub .com"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "advertisementhiring",
        "ocr_text": "WE ARE Open Positions G Web Developer Qualifications Send Your CV: jeanette29 gmall .com Proficient in computer applications. ations. Contact: Proficient in computer applic Knowledge of office procedures. (209 887 0485 Customer service experience preferred. More Information @dailyvibesph PSC 7620, Box 0828, APO AE 45210 A ttps www biostudyhub cots"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "advertisementhiring",
        "ocr_text": "ualioauens fend Your CY: ieanette29 gmail com Proficient in computer applications. Proficient in computer app aot. Knowledge of office f (209 887 0455 Customer service experlence preferred. if iavinesan v of More pic ae: @dailyvives AE 15210 swww biostudyhud cam"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "advertisementhiring",
        "ocr_text": "Qualifications: Send Your CV: Excellent probler sclving abi jason63 amail com Knowledge of office procedures. Dy bs ary gine 3k TONtact Reliable and hardworking indiv Customer service (586 808 3247 experience preterred. More information: @dailyvibesph i 70703 Cantu High htios Avww physicstutor net Paiticiatown, OR 6"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "advertisementhiring",
        "ocr_text": "BY i BS Ce ee ae oe Cualtieetione: Sor Four. Excellent problem solving ability. jason63 aqmail com ecur dworking individual. omer service ex preferred. tore information: Piipswww physicstutor net"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "advertisementhiring",
        "ocr_text": "Qual fications: sepa Your Oy: Excellent problem solving ability. ja son63 @gmail com Knowledge of office procedures. se 4 Content: Reliable and hardworking individual. Customer service (86 Sea 3247 experience preferred. More inigrmation puoshwww physicstutor net vay, East 1, OR 61009"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "advertisementhiring",
        "ocr_text": "2. oe wa Qualiticatian y Send Your cy: Exce alent problem solving ability, jason63 gmail com Knowied fontact sustomer servic (586 )808 2 expenignet service (986 808 3247 More isfarmaticn tipswww physicstutor net 707, u Highway, atown, OR S40"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "advertisementhiring",
        "ocr_text": "Qualifications: Send Yor “rey: Exceilent problem solving ability jason63 gmail com Knowledge of office procedures Reliable and hardworking individual. forkact Customer service (586 808 3247 experience preferred. More Information @dailyvibesph 70703 C antu mn onetooe 0! hitpswww physicstutor net"
    }
]