[
    {
        "image": "honorabledismissal1_synth_10_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "Nowesnbat 08, 2024 THE REGISTRAR AGUSAN DEL NORTE STAIE UNIVERSITY Butuan, Agusan dei Norte Philippines Dear Sirita am, Greetings of Peace and Good Heaith! ‘YO WHOM IT HAY CONCERT: This 1s to certey hat DIANE COLLINS baaiing Student Muriber 2024 08402. wes a Lonstids shident of Agusan dei ivorla State University enrolted in the Bachelor of Science in Nursing program under a College of Engineering and Technoiogy from First Semester, AY. 2020 2924 to First Semester, AY. 2022 2023. ‘Quang the perios of enrolimant at tis instiutvon, Diane has successfully completed 66 unis with a Genera! ‘Weighted Average (SYA) of2 53. The siuaent has maintained good scadamic standing througout thelr stay lund has shown satisfactory complance with ail university ruies, regulations, and poheas. Records indicate hat Oiane has no pending disciplinary cases, no unseitted nancial obtgatons with the university, ano has property retuined aif borrowed matantels anxd coulpirant fom fw kbtary and other unwversity offcus. The student hiss secured compiets cinarance fom alt concemed offices as of March 13, 2025. ‘This stusiant s feaving the university in goud standing due to prurzuit of inamediate emnpioymenl oopartanites ubrowd. The university admonistaticr: has no objaction io ine issuance of tis eertiication ‘This Honorable Dismiscal is baing tssuea upan ine witien secussi cf me stuoen! for whatever tega! purpose tt may serve, except ior ieenttcaton purcoves issued this 08 day of November 2024 at Butuan, Agusan dst Noite, Philippines, Sincerely yours Prot. Zoe Jordan, MA. Director, Admissions and Records Office"
    },
    {
        "image": "honorabledismissal1_synth_10_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "Rovember 06 2024 THE REGISTRAR AGUSAN DEL MORTE STATE UNWERSITY Jan, Agusan ippines tent Murniaer 2024 28402, was a bonafde stu i Agusan rotted in the Bachelor of S nlogy tom Fits! Semester, AY 2020 69} Norte State Univ ng 2 102 in Nursing otogtam under the College of tei, AY 2022 20) engines! etiod of anvoliment Average GNA} of ed 88 unite with a Ge he et ai sing throughout tet stay nt has shown satisiactory compliance with all unive: obbigations with tbe ty telumed all poreawed meter 2d com and equipment tom the brary anc {March 1, 207 mall concemed offices ersity 1m good toppurlunities rapoyt sikh eee Sno chjection to tne i for whatever"
    },
    {
        "image": "honorabledismissal1_synth_10_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "THE REGISTRAR yeas on tas Beery wet EE 7 peo) Tee teouat WN Preece Agrees oS"
    },
    {
        "image": "honorabledismissal1_synth_10_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "Newember 08 2024 THE REGISTRAR ADUSAN DEL NORTE STATE UNIVERSITY Butuan, Agusan dal Norte Proppeies, Dear Sirhta am, Greetings of Peace and Good Health! ‘TO WHOM IT MAY CONCERN: ‘This (s to covtity at DIANE COLLINS, bearing Student Number 2074 82402. was a bonahde skisentof Aguean det Norte State University envotied in the Bachelor c! Sciences in Hursing program wear the Catiege of Enginesring ang Techwology ftom First Semester, AY 2029 2021 to First Semestet, AY. 2022 2073. Daring te pariad of snrofiment at iis instaston, Diane Rus scccecetty comoteted $8 unis with a Generat Weighing Average (GWA) of 2 52. The skidenthas maintained goo acacemic standing Recughout ty tay arid fs Stiown satstactory compliancn wx al untversity rules, regutations, ana peaces Recotas meicale oa! Crane has no pencing Seciphnary caxtes, ne unseted Krarcal ondigedons with te University, anc hae property retumed ati Corcwed mavariate srt equicinan: fom the library an ottws univarsty offices. The suudent has secured complele clearance om ait concesned offices 88 of March 13 2025 This student is leaving he university in good siandizg dus to pursuat ot mimeciate emeinyment opcerunttes abrosd. The urrversity adnverstaton nas no obyeetan B fhe mawance of his certeaton. This Honorable Desevssal is Derg lasumd upon the wena cequedi of Tue sates tor wrstovar iogal DurpaRe Mt may serve, excep! for idantécation ous0oxes issued nis 06 day of Navernber 2024 at Butuan, Agusan dei Norte, Praiopines Sincerely yours, Prof. Zoe Jorden, MA. Director, Admissions and Records Office"
    },
    {
        "image": "honorabledismissal1_synth_10_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "Hoveinter 08 THE REGISTRAR AGUSAN G8). NORTE STATE UNIVER! ‘Butuan, Agusan et Hore Fhiippines Ty Dear Same! Greetings of Peace and Good Hesitns TOWMOM IT May CONCERN, isis 9 certty hat HAME COLLINS, esting Student Number 2024 88403, was 4 bonalide student of Aguasr Sei fhurlo Slate University enrosied in ine Bacnelor of Science in Nussing program ular ta Cotege of Enginewing and Technology fen First S69 7 te Fist Somestor, 8 ¥, 2022 2023 uring the parted of enrati nant at this insttuton, Diana has succosstaly comple Weighiid Average (OWA) ot2 83 ‘The student hes maintaned goed ac ‘B04 hap shown satisfactory complinnen win ail envoy $38 units with a Genera ents stating Inrouenout nak stay Sify tales, segulations, and nobsies Rooniis intinate tat Diane has no pending discigtinary caeas, mt unselbedt Snancial abligabons with the University, and has cropsrly ratyrnad al omrovenc materia s and equipment rom ine Worary and ether usiomeatty othces, The student has secured complats clearance tem: all concsined ofits a4 of March 13, 292 ‘This etuitent i teaving the university in good stanging dus to pumult of mmidiate emptoyrant opportunitiss sbrowa. The univerity admintebaten nas no objection to tha ioguanee of fe cecication, ‘This Honorable Giscoisaa’ is halng Issued upon the written request of the student tar whalaver legal purmoge ay Seve, exveptior identification mepasas, issued ibis 08 day of November 202 aldutiati, Agusan del Norte, Patiopiies marely yours, Prok, Zoe Jordan, M A. Girester, Admissions and Records Office"
    },
    {
        "image": "honorabledismissal1_synth_1_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "March 10, 2025 THE REGIS THAR GROS ORIENTA, STATE UNIVERSITY Dumagusio, Negros Osuna Piuipginey Dear Sastae’ Sy that HAROLD MOGE Janted Stats 08 in Mareing progearn under the Coltege of Arts and Scionces froin Fret Semaster, AY. 2022 2023 te First Sammestor, ALY, 2024 2025 Charing the period of aneitment at this institution, Hamid has successfully completed 100 units with a ‘Genacsl Weighted Avwoga {GWA} of 3 27. The student hae mainiuined good academic staring throughout their stay ard has shown satisfactory compliance: with all universiay nites, regulation policies sed Records fasicate that Harald has no pending disciplingy cases, eo ungotitad Snaicied obligations with the university, an hae properly tetumed all boruwed matesials and equipmart from the fhrary said other univorsity offices. The stodund has secur complete cluetance fram alt concemed offices as of Aaty 02, 2128. ‘This student is lueving the university in good standing dt to pursuit uf immedivie amploymient Spportunities abroad, The university administration has ne abjentios: to the Issuaree of this ce ‘tion, This Honorable Disiniead fs being insuad upon the wntten regonst of the stiaiant for whatever Logat purpose ft may nerve, axcept for Weatitication purmmee Jenutd this 10 day af Marmh 225 al Dumaguate, Hegre Orletal, ilps, by yours Ge. Chilstopher Johnson, Pr. Gea of Student Afairs"
    },
    {
        "image": "honorabledismissal1_synth_1_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "March 10, 2025 THE REGISTRAR NEGROS ORIENTAL STATE UNIVERSITY Dumaguete, Negros Oriental Philippines Dear Sir Ma am, Greetings of Peace and Good Health! TO WHOM IT MAY CONCERN: This is to certify that HAROLD MCGEE, bearing Student Number 2025 66440, was a bonafide student of Negros Oriental State University enrolled in the Bachelor of Science in Nursing program under the College of Arts and Sciences from First Semester, AY. 2022 2023 to First Semester, A Y. 2024 2026. During the period of enrollment at this institution, Harold has successfully completed 100 units with a General Weighted Average (GWA) of 3 27. The student has maintained good academic standing throughout their stay and has shown satisfactory compliance with all university rules, regulations, and poli Records indicate that Harold has no pending disciplinary cases, no unsettled financial obligations with the university, and has properly retumed all borrowed materials and equipment from the library and other University offices. The student has secured complete clearance from all concerned offices as of July 02, 2025. This student is leaving the university in good standing due to pursuit of immediate employment opportunities abroad. The university administration has no objection to the issuance of this certification. This Honorable Dismissal is being issued upon the written request of the student for whatever legal purpose it may serve, except for identification purposes. Issued this 10 day of March 2025 at Dumaguete, Negros Oriental, Philippines. Sincerely yours, Dr. Christopher Johnson, Ph D. Dean of Student Affairs"
    },
    {
        "image": "honorabledismissal1_synth_1_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "March 10, 2025 THE REGISTRAR DEOROS ORIENTAL STATE UNIVERSMTY Dumaguete, Negros Oriental Philippines Dear Sir Ma am, Greetings of Peace and Good Health! TO WHOM IT MAY CONCERN Dr. Christopher Johnson, Php Dean of Student Affairs"
    },
    {
        "image": "honorabledismissal1_synth_1_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "March THE REGISTRAR NEGROS ORIENTAL Dumaguate, Nor Dear SMa am se and Good iP TO. WHOM IT MAY CONCERT Bead, was a bonatide student of aden’ Number 202 rating St HAROLD hi “This fs to certify that Hegiog Oniertal State University anroieg we ‘Bachelor of Scianca in Nurcing program uncer the 23 19 Fiest Semester, AY 2028 20\" Semester, AY Sciences feorn Fist College af Arts ted 100 unite wi ic standing ay rules, eegudations, and Dusting the period of Sener! Weigeted Average (WA ftaroughonst their stay ies no unsettied ecorisInaicate that Harold bas ne pending disciplinaay the university, and has property retuimed ali berrawest 3! orale are! equipment from the Hbvary anc other valver vam all concemed offices as of dely 02, 202, pursuit of immediate employment shadent is feaving the univer 44 abooad. The university adminis This opportuni p request of the student for a 1 1g boing [sued upon 192s “This Honorobla Dismissat purr xcept for identiication pi serve, wurpeses. Criental, Pllopines. ‘at Dumaguete, Negrc"
    },
    {
        "image": "honorabledismissal1_synth_1_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "March 10, 2025 THE REGISTRAR NEGROS ORIENTAL STATE UNIVERSITY ‘Dumaguete, Negros Oriental Philippines Dear SirMa am, Greetings of Peace and Good Health! TO WHOM IT MAY CONCERN: iss to crty tht HAROLD MOGEE, being Student Nunber 2025 66440, was a bonaide sudan of Nagos Oferta Sat Uriversy eral inthe Bachelor of Slane in Nasing pogo wre 18 College of Arts and Sciences from First Semester, AY 2022 2023 to First Semester, A Y. 2024 2025. records indicate that Harald has no pending disciplinary cases, no unset franca obigatons wih eee sly, and has propery vt al orowed materials and equpment fom the ary an sites university offices. “Tee etadent has secured complete clearance from all concemed offices as of July 02 202. “This students leaving the university in good standing due to pursut of immediate employment ‘opportunities abroad “Ihe university administration has no objection to the issuance ofthis certification. This Honorable Dismissals being issued upon the wien request ofthe student for whatever loos purpose it may serve, except for identification purposes Issued this 10 day of March 2025 at Dumaguete, Negros Oriental, Philippines ‘Sincerely yours, Dr. Christopher Johnson, Ph D. Dean of Student Affairs"
    },
    {
        "image": "honorabledismissal1_synth_2_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "January 24, 2924 THE REGISTRAR HEGHOS ORENTAL STATE UNIVERSITY Sumaguaa Negros Orient Priippines Dear Sere am, Greetngs of Peace and Goad Heath! TOWMOM TT MAY Concenn Recoras indicate Dat Kann has no penaing aiscicunary cases, no LUreVerEI, 2 has DrODeEy retsrna OH borrowed motenais Ofices The studewthat secured compte clearance tom al unsetiied thancia! obtigabons win ne Ard eauinrwat from Be Revary and ober university Concemed atices we of Octomer 24. 2028 TINS Studeots loaving the Unewersety m go0d starving due ty Peal and mmcical conceons requsnng axtended ieave Tho university adminis ston Nes 90 eajacton to te: HsuaNOY of this cerMficatioy This Honeratie Dismussal 1s being issued upon Re wrmee request of ta AAAIONt For wtaienes aga! puDONe AMY Sve, oxCeD! for Jo ntcaban purpoes Fesued tis 24 day ct canuary 2022 at Dumaguete Mewos Onecta Pritopanes Sincerely yours, Prat Jasming Prico, DPA Elon ct Sturhert At es"
    },
    {
        "image": "honorabledismissal1_synth_2_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "Ja ary 24, 2024 THE REGISTRAR NEGROS GRENTAL STATE UNIVERSITY Dumaguete, Negros Oriental Preippines oe Sirdhta zen, FOWHOM IT MAY CONCERN, salle seat ‘This is to cartify ast KET BAT: rity enroitedt 3, beating Student Number 2024 56584, was the Bachelor of Clemenitary Eiucation program und tne Gost ag the pened ofenr anes! Waighioa Average 7 (good acudemis standing threcighaut thei siay andi has stows satstactery compliance with at! university cules, regulations, and gobies, fe tat en vniversity, amet has prope’ oifices, The stucent has secured comptata ch no ponding disciplinary cases, aa ui {y (etsrnsd all bonowad materials and equipment from tre sbrary ang other untversity anos Hon ali consamned offices as af October 28, 2024 This sit eeving the university In good standing due to tasith and mock extends eave. The university zeiministration haz ny ebjection lo the issuance of tts cantieatan, ting 2 water equiest of th ‘hig Honarapie Cismcal 16 nay serve, excapt tar Ment sued upon tt ation purposes, ab fbr whatever legal pumowe Ht fosued tis 24 day of January 2024 at Dumaguete, Kegros Grionlal, Phetpgines, Sincerely yours, Prot J Price DAA Daan of Student Affair."
    },
    {
        "image": "honorabledismissal1_synth_2_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "January 24, 2024 THE REGISTRAR NEGROS ORIENTAL STATE UNIVERSITY Dumaguete, Negros Oriental Philippines Dear Sir Ma am, Greetings of Peace and Good Health! TO WHOM IT MAY CONCERN This is to certify that KEITH BATES, bearing Student Number 2024 56581, was a bonafide student of Negros Oriental State University enrolled in the Bachelor of Elementary Education program under the College of Business Administration from Second Semester, AY. 2019 2020 to Second Semester, AY. 2020 2021 During the period of enrollment at this institution, Keith has successfully completed 104 units with a General Weighted Average (GWA) of 3 22, The student has maintained good academic standing throughout their stay ‘and has shown satisfactory compliance with all university rules, regulations, and policies, Records indicate that Keith has no pending disciplinary cases, no unsettled financial obligations with the University, and has properly retumed all borrowed materials and equipment from the library and other university offices. The student has secured complete clearance from all concerned offices as of October 29, 2024 ‘This studentis leaving the university in good standing due to health and medical concerns requiring extended leave. The university administration has no objection to the issuance of this certification ‘This Honorable Dismissal is being issued upon the writen request of the student for whatever legal purpose it may serve, except for identification purposes. Issued this 24 day of January 2024 at Dumaguete, Negros Oriental, Philippines. Sincerely yours, Prof. Jasmine Price, DPA Dean of Student Affairs."
    },
    {
        "image": "honorabledismissal1_synth_2_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "tanuary 24, 2004 YHE REGISTRAR HEGROS ORIENTAL STATE U Nagios Ontental a Health Grogungs of Peare and cmt FO WHOM TT MAY SOF ide studentot etre College of 74 BATES. nearing Student 8B, was a banat cathe proayrare unde 1p Bachetor 6 ‘bey. 2019 2020 to Second Semestar, AY. 202! “Yhis eto centfy that KE sty onvoteg i Oriental State Uni Business Administration from Second Sem uring the poring of entotinent ats inaatnn, Kah 628 gerovgstvly outipiated 104 units with a General weighand average (OWA) of? ata maintained qaod academic stansing teeugneat mel a rations and has shown satistactory compliance wih ai 2. The stusis 1g pote: unwersty financial abliganons with te no urseited y and other univtsity ot offices 35 oF Gelber 24, 2024 ecptinary cases, ons indicate al Keath raf has propery 59 The student aes secure 62 univers oft cance fon ait can ose plate sequinng extended versity in cand sanding due ta eatin and medical this cestiicatin. “this shacent is ieavieg the ut aiton has ro 85iC% clit to te Ws\" Inge, The waive _ shudent for wharever toga! puvoose sues upon tho wri ernie is bei “yhis Honorable 9 Hor tdentiiention purposes. rma oe Dumaguete, Osientai, Pailingnes. secued tie 24 day of January 2024 at Prof. Jasming Prios, OPA Teen of Stuient AM"
    },
    {
        "image": "honorabledismissal1_synth_2_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "January 24, 2024 THE REGISTRAR NEGROS ORIENTAL STATE UNIVERSITY Dumaguete, Negros Oriental Philippines Dear Sir Ma am, Greetings of Peace and Good Health! TO WHOM IT MAY CONCERN: ‘This is to certify that KEITH BATES, bearing Student Number 2024 56581, was a bonafide student of Negros, Oriental State University enrolled in the Bachelor of Elementary Education program under the College of Business Administration from Second Semester, AY. 2019 2020 to Second Semester, AY. 2020 2021 During the period of enrollment at this institution, Keith has successfully completed 104 units with a General ‘Weighted Average (GWA) of 3 22. The student has maintained good academic standing throughout their stay and has shown satisfactory compliance with all university rules, regulations, and policies. Records indicate that Keith has no pending disciplinary cases, no unsettled financial obligations with the university, and has properly returned all borrowed materials and equipment from the library and other university offices. The student has secured complete clearance from all concerned offices as of October 29, 2024 ‘This student is leaving the university in good standing due to health and medical concerns requiring extended leave. The university administration has no objection to the issuance of this certification. ‘This Honorable Dismissal is being issued upon the written request of the student for whatever legal purpose it may serve, except for identification purposes. |ssued this 24 day of January 2024 at Dumaguete, Negros Oriental, Philippines. Sincerely yours, Prof. Jasmine Price, DPA Dean of Student Affairs"
    },
    {
        "image": "honorabledismissal1_synth_3_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "February 22, 2024 THE REGISTRAR CAGAYAN DE ORO STATE UNIVERSITY Cagayan de Oro, Misamis Oriental Philippines Dear Sir Ma am, Greetings of Peace and Good Health! TO WHOM IT MAY CONCERN: This is to certify that DENISE MORALES, bearing Student Number 2024 23524, was a bonafide student of Cagayan de Oro State University enrolled in the Bachelor of Arts in Psychology program under the College of Education from Second Semester, A Y. 2019 2020 to Second Semester, A Y. 2022 2023. During the period of enrollment at this institution, Denise has successfully completed 82 units with a General Weighted Average (GWA) of 3 72. The student has maintained good academic standing throughout their stay and has shown satisfactory compliance with all university rules, regulations, and policies Records indicate that Denise has no pending disciplinary cases, no unsettled financial obligations with the university, and has properly returned all borrowed materials and equipment from the library and other University offices. The student has secured complete clearance from all concemed offices as of April 16, 2024. This student is leaving the university in good standing due to pursuit of immediate employment ‘opportunities abroad. The university administration has no objection to the issuance of this certification This Honorable Dismissal is being issued upon the written request of the student for whatever legal purpose it may serve, except for identification purposes. Issued this 22 day of February 2024 at Cagayan de Oro, Misamis Oriental, Philippines. Sincerely yours, Dr. Stephen Pineda, Ed D. Dean of Student Affairs"
    },
    {
        "image": "honorabledismissal1_synth_3_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "February 22, 2024 THE REGISTRAR CAGAYAN DE ORO STATE UNIVERSITY Cagayan de Oro, Misamis Oriental Philippines Dear Sir Ma am, Greetings of Peace and Good Health! ‘TO WHOM IT MAY CONCERN ‘This isto certify that DENISE MORALES, bearing Student Number 2024 23524, was a bonafide student of Cagayan de Oro State University enrolled in the Bachelor of Arts in Psychology program under the College of Education from Second Semester, A Y. 2019 2020 to Second Semester, AY. 2022 2023 During the period of enrollment at this institution, Denise has succes General Weighted Average (GWA) of 3 72. The student has maintair throughout their stay and has shown satisfactor policies. ssfully completed 82 units with a ined good academic standing ry compliance with all university rules, regulations, and Records indicate that Denise has no pending disciplinary cases, no unsettled financial obligations with the university, and has property retumed all borrowed materials and equipment from the library and other university ofices, The student has secured complete clearance from all concemed offices as of April 16, 2024. ‘This student is leaving the university in good standing due to pursuit of immediate employment opportunities abroad. The university administration has no objection to the issuance of this certification This Honorable Dismissal is being issued upon the written request of the student for whatever legal Purpose it may serve, except for identification purposes. 'ssued this 22 day of February 2024 at Cagayan de Oro, Misamis Oriental, Philippines. Sincerely yours, Dr. Stephen Pineda, Ed D. Dean of Student Affairs"
    },
    {
        "image": "honorabledismissal1_synth_3_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "28 THE REGISTRAR CAGANDDS DE ORO STATE Cagayai de Ovo, Misarnis Oven PRuppnes was a bonafida states! program under the oy Shuderd Humber 2024 25 vaaraity enrolled in the Bactestor of Acs in Faxc «AY 7019 2020 19 Secoed Somester, HSE MORALES. this is to cently 8 of Cagayan de O Education torn Secord ae hes successfully compte 82 unite wi Lange qood academic standing versity tes reguiatiano, art at this institution, Dems af 372 The student has waite smngitance wit a wh fon the petted of nrc tiod Averaae (GWAY ‘ay and fis show satisfactory soe wth ited Francia obthg from the ibrary and other scons rice hat Hinise nas ce pening ASSIA 9 nouns hea popes rue a goes soars an ARIPNY vent hes seized rompiete cinaance Him al SOrcTN off 5 as ot Api ton to tt ord standing dus 70 rniversity f ‘this, cet issuance of “This stent i Yeeving the cad. The uni opportunities abv pegnast of the stusent for whates xcept fo! identification Bepos9 yan de Or, Misanis Oferta, PHBA Oe Stephen Pineda, Ea D jean of Student Affates"
    },
    {
        "image": "honorabledismissal1_synth_3_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "February 22, 2024 THE REGISTRAR CAGAYAN DE ORO STATE UNIVERSITY Cagayan de Oro, Misamis Oriental Philippines Dear Sir Ma am e and Good Health! Greetings of Pe: TO WHOM IT MAY CONCERN: This is to certify that DENISE MORALES, bearing Student Number 2024 23524, was a bonafide student of Cagayan de Oro State University enrolled in the Bachelor of Arts in Psychology program under the College of Education from Second Semester, A Y. 2019 2020 to Second Semester, A Y. 2022 2023. During the period of enrollment at this institution, Denise has successfully completed 82 units with a General Weighted Average (GWA) of 3 72. The student has maintained good academic standing throughout their stay and has shown satisfactory compliance with all university rules, regulations, and policies Records indicate that Denise has no pending disciplinary cases, no unsettled financial obligations with the university, and has properly returned all borrowed materials and equipment from the library and other University offices. The student has secured complete clearance from all concemed offices as of April 16, 2024. This student is leaving the university in good standing due to pursuit of immediate employment ‘opportunities abroad. The university administration has no objection to the issuance of this certification This Honorable Dismissal is being issued upon the written request of the student for whatever legal purpose it may serve, except for identification purposes. Issued this 22 day of February 2024 at Cagayan de Oro, Misamis Oriental, Philippines. Dr. Stephen Pineda, Ed D. Dean of Student Affairs"
    },
    {
        "image": "honorabledismissal1_synth_3_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "February 22, 2024 THE REGISTRAR CAGAYAN DE ORO STA: /an de Oro, Mis. Philippines TE UNIVERSITY ‘amis Oriental Dear SirMa am, Greetings of Peace and Good Health TO WHOM IT MAY CONCERN, Dr. Stephen Pineda, Ed. IN Of Student Affairs"
    },
    {
        "image": "honorabledismissal1_synth_4_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "December 09, 2023 THE REGISTRAR UNIVERSITY OF ZAMBOANGA Zamboanga, Zamboanga del Sur Philippines, Dear Sir Ma am, Greetings of Peace and Good Health! TO WHOM IT MAY CONCERN. Personal and family reasons. The his certification Sincerely yours, Alty. Michelle Underwood, Ed D. Director, Admissions and Records Office"
    },
    {
        "image": "honorabledismissal1_synth_4_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "Decemner 99, 2023 THE REGISTRAR: UNIVERSITY OF ZAMBOANGA Zamvounga, Zartoangs de! Sur Phitippines: Daar SirMa am, Greetings of Peace and Goad Heath! ‘TO WHOM IT MAY CONCERN: This is to certify that JOEL DAVIS, beating Student Number 2023 207 1. was a Donatide student of University of Zamboengs entailed in the Bachelor of Science ini Infonnation Technalngy program wider the College ot Education fron First Sementer, A Y 2020 2021 to First Semester, AY. 2022 2023. ‘Dusing the period of enrolment at this institution, Joa! has successfuly completed 79 units with a Genaral Weighted Average (GWA) of 2 62. The student has maintained good acedemic standing throughout thelr stay and has shown satisfactory compliance wi ail university rules, regulations, ond policies, Records indicate that Joa! has no pending disciplinary cases, no unsettied linancial cdligations with tive university, anc has property retumed sit Lorrovaed materials and equicment trum the library and ther university offices. The student has secured compiele clearance trom ail conramed offices a ot November 03, 2024. ‘THis student is leaving tive university in good staring due to personal and family reasons. The university administration hss no abjsction ta the issuance of this certification. This Honomble Dismissat is being issued upon ihe written request of the student for wiusever legal purpose it may sorve, excopt fo: identification purposes. tssved this 09 cay of December 2023 st Zamboerga, Zamboange del Sur, Phitippines, Sinceraly yours, Atty Michetle Underwced. Ed D. Director, Admissions and Recurds Office"
    },
    {
        "image": "honorabledismissal1_synth_4_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "THE REGISTRAR UNIVERSITY OF ZAMBOANC boange, Zamboanga del TG WHOM IT MAY ‘This is to cently University uf Zarnbcanga ervctled fn the ist Semacier, AY 2020 2021 to Fie the College of Education tron Shut roll ig institution, Joe! has Gen ont at uccessfully comp he period of ad Ay cal ei thoughout theie stay ana has shown satisfactury and policies te that Jost has no pending disciplinary cases, no unseitled financial obvigations wth brary and other mex offices male and equigsnent from te piste clearance ftom all cor 23, 2024 univ 's halng festied upon the written request of the studant for whatever H This Honorable Dismissal purpose it nay serve, except for ident ication purposes."
    },
    {
        "image": "honorabledismissal1_synth_4_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "RStTY OF ZAMBOANGA Zsmboare 714. was a bonafige student of 2023 2 ty of Zombcanga enrolled tn the Bachelor of Scierice in information Technology program urider ‘od Generai Weighted Average ssfutly completed 79 unit During the per tained cond academ with all univer 6 Ti throughout their ards indicate that Joel hss 1 9 ty, and has univaisity olfices, jent has secured c November (3, 2024 standing dy This sits int is leaving the university in good rersity administration has fo objection to This Honorable Dismieeal is 6 sing issued upon the we purpose it may"
    },
    {
        "image": "honorabledismissal1_synth_4_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "pecempar 08 2 THE REGISTRAR UNIVERSITY OF ZAMBOANGA Pamboarga, Zomboang det Sur Phitippines 5 inteernat jagt Semester, AY 2022 2023 wacheior of Sc! cf Zamboanga ervailed in tre of Eaucaiza from Fast Sernestes AY 2020 2024 completed 7S units with a a08NG ns, and has successtially estiution, Joel enraiment stabs During General Weighted Average (WA) oF peices ttied financial cbfigations with the disciplinary cases, no ues library and otter mmareriais end eqezpmert from the ail concemed office Records indicate that Jest has no univessity, asd bas properly retumed all bore offines. The vbicent has wesured compleis clearance fe 03, 2028 ent as of to personal ard family reasons. The Tain stitient is laaving the university in good standing 1as rie objection io the issusr are of this comtifc ation an the oritten request of Ore student for whatever logat Yismisea is being iosued 4 of for slontifieation parpeses: Vhie Honesaile pemese t may or 2023 at Zamnounga, Zamboenge tel Sue, Phiipgines. tssued this 08 day of De Michelle Undenacr syity and Rec aii vector Adm"
    },
    {
        "image": "honorabledismissal1_synth_5_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "Becambor 28, 2023, THE REGISTRAR QUEZON CITY CITY COLLEGE Mets Manto Dear Sirtéa am, Gree’ tgs of Peace and Geod Hestht TOWHOAIT May Concer: This is Serity Slat ROBERT PARKER, bearing Stuart Number 2022 778: Gukzan City City Cobege anralied in tie Bachelor of Bementary Exginesting and Technology rom Fest Semscier, AY. 2618 20 2 was 9 bonaos stident of iwcation progeam under the Gaege of OD Bacons Semesior, A 2023, ou \"iy INS pain oF enratinent at ine inetiazte, Robert has sucnesafutly completad 129 unts with 3 General ‘Wolghinid Average (GHA 012 83. The student has maintained good acastemic stancing throughout det sey nH Ras chown satstaciory comphance with wt university cules, eagutations, and ostlciwe Records ingicate ts rv Rebart hor ne pending iscintinary cases, no uneatied Hnaticial obtigatone wlth fe ANG has properly retined ali bairowed mateiais and ‘tha studonthas secures complete r onary and other univarsity Clearance fom ak concern afficas a8 of May 08, 2024 ‘Thi shicentis taaving dhe university in god siznaing cue fo family retoeation to anothes region, The waiveraity astioinistrabion has ne ebjuction. te the /ssusnce ofthis cantication: ik Monarebie Diumessai ss being 4 8d upon the written request of 2 ssn for amhataver leat gqumone H ay, Moto Nanka, Pompones ‘Sincaraty yer Atty. Chive Rodsiguer, Ed Univenity Rogietar"
    },
    {
        "image": "honorabledismissal1_synth_5_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "Becamber 26 2023 fade’ om. Dear Sir Greetings of Feace and Good Meath! TO WHOM IT IA OONDERN' Ys RBI, was a banetie thadant of ram anaer te Coens of 2823, ete cently that ROWER? PARKER, baertag Stage Hamoe saan Calg Sy Collage aneatied in he Gacterar oF Elemartary Eguaaioon Omar Engineensg and Teehnciegy fom Fist Semestti, AY gota zage te Second Semesiss, AN, 2022 19 grils wim a Gonarat sreovagheatinel stay During te peo of ennatiment at is nation, Rover has Se sstuily completed Weighted Average (GHUApOTZ 02. The stent AS egies gerd aan SERED sity vate, caguiations, ant patties. “tne shuvsen saitecsory comoianc wih ai) unbi ny casas, no uncatien Barta sokgutons whe ty dinate wnat Rober tres no paosing diseiDtts ‘gue Horary ang ater uneven Recor tn erat, ata hac properly rotunda bowrawe MaleHels and equinenentiiom nan wocared compote leavers aT gt OGASETEM CRORS wact May 08, 202% cafficas The suadent seaesity ocd standing due te fermi miocaien to anomnes #6710\" whe of his cerbieston, “his spaiant is seating Gus Univeral _ntrminieration has no objection i tie Insuancs spe wetton request ofthe student for wate egal HBSS it ‘this Honorable Disowszal is beirg Ire? nary serve, exCeL NDT HETERCAON PURO yeast tus 26 dy of Dacambr 2023 at Guazon etre Hania, Polipines Sincerely yours daty, Ghoaten Rosnguer, E60. University Bagster"
    },
    {
        "image": "honorabledismissal1_synth_5_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "THE {QUEZON CITY CITY COLLEGE ‘Quezon City, Metro Philippines Dear SirfMa am, Greetings of Peace and Good Heath! First Semester, AY. 2019 2020 Sincerely yours, ‘Atty. Charles Rodriguez, Ed 0 University Registrar rod in te Bachelor of Exmantary OVA po ‘second Semester, AY. 2022 2023"
    },
    {
        "image": "honorabledismissal1_synth_5_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "YY CITY COLLEGE Quezon Oty, Matic Marie Phipomes, and Sood Heatn TOWHOR IT MAY CONCERN TNE Cert as ROSERT PARKER, beasg Sextet urnoar 2025 77021 wag A DONUEIe Scant of Quse Cy City ©: Eee ender So Comnge of Engineeong ana SING Serrwster, AY 2037 2075 Swicerety yours Any Chaves Roxtiaues £60 Unvwonity Registrar"
    },
    {
        "image": "honorabledismissal1_synth_5_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "December 26, 2023 THE REGISTRAR QUEZON CITY CITY COLLEGE Quezon City, Metro Manila Philippines Dear Sir Ma am, Greetings of Peace and Good Health! TO WHOM IT MAY CONCERN: ‘This is to certify that ROBERT PARKER, bearing Student Number 2023 77821, was a bonafide student of ‘Quezon City City College enrolled in the Bachelor of Elementary Education program under the College of Engineering and Technology from First Semester, A Y. 2019 2020 to Second Semester, A Y. 2022 2023. During the period of enrollment at this institution, Robert has successfully completed 119 units with a General ‘Weighted Average (GWA) of 2 93. The student has maintained good academic standing throughout their stay and has shown satisfactory compliance with all university rules, regulations, and policies. Records indicate that Robert has no pending disciplinary cases, no unsettled financial obligations with the university, and has properly returned all borrowed materials and equipment from the library and other university offices. The student has secured complete clearance from all concemed offices as of May 08, 2024. ‘This student is leaving the university in good standing due to family relocation to another region. The university ‘administration has no objection to the issuance ofthis certiication. ‘This Honorable Dismissal is being issued upon the written request of the student for whatever legal purpose it may serve, except for identification purposes. Issued this 26 day of December 2023 at Quezon City, Metro Manila, Philippines. Sincerely yours, Atty. Charles Rodriguez, Ed D. University Registrar"
    },
    {
        "image": "honorabledismissal1_synth_6_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "Dansmber 14 2 THE REGISTRAR CASRVAN DE ORG CAY COLLEGE Cagayan de Oro, Micamis Orieatai Phaippines Dear Sirf am, Greetings of Paacs end Goad Heath He. TO WMOAA ITUAAY CONC! 1, paaning Student Number 2074 22072, was 2 tonatde stident of Cagayan Ads ‘hg 8 te cert that JAMES ds On Cily College entailed in the Bachelor of Science in Gompuiot Scienoe progtam under tha Cofege rom First Bamastes AY, 298 2019 ty Second Samevier AY. 2921 unng the pesicd of onecitenent af this Inssivton, James has succonstully complated 105 unite with General Weighted Averaga (OWAset 23. The suidont nas maintained goad acaganse standing drreughout ew say 40S fas shown satiefariory comptiance wih 28 uniwnestly tates, myiatinns, ard PIA, with he scipinwary cases, ne unnetied fnaneia! ctiigations frome Sha Hlewary ana otter univer pees ga af Anil G8. 2026 Records ingtcatie Saat Jarces has no pending unasraity, and fa ermpeny salummed ait horawed matedsin ard equi fions, The sindent has secured comalale clsaranice ham atl eoncamed “pris statent is teeving the university in goat changing dus te guesult alimmediek: emnlopnant opportune ateoad. The unienesily sansnisirsian has Wo objection i te ieasanice of his eavtiteation: vat egal purpose it ‘Diiemtenat is being ieeaee upon fie weltsn eequesl ofthe student tar whaten ‘ioe hlentfication permones. seus tis 4 day of December 2023 at Cagayan we Cre, bisamie Griontat, Phkigpines, Sincerely vours, Dr. Sotmathan Otiver, Chacter, Anasions and Becerds Otic"
    },
    {
        "image": "honorabledismissal1_synth_6_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "‘THE REGISTRAR CAGAYAN DE CRO CITY COLLEGE Cagayan de Oro, Misaria Oriental Prippines ar Saltese, Greetings of Pea. TO WHO IT MY CONCERN bearing Student tharder 23713077, was a bonahte stitkent ot Cagayan nos prargram under the Costeg of Arts ‘Thisis to cantly that JAMES WH de Cro Oly Goltege enrolled in the Bachelor af: ana Sciences hort Firs Semester, AV, 2018 2014 19 Gencnd Semmgws, AY, 2021 202°, yy coemptetad 105 unite with Ganacal fucugnout tei say ane During the pedlod ef ervwilmens at is forsitalbon, James has 8 Weighted Auecaye (GA) of 3 3. The sudent has maintained good academic Sending fias shows eakstactory compliance with af university tiles, sogulabane, as polices Records indicais that James nas no pending disciplinary cases, no unseltod trancial ebigatons wil ee orivesity, and has propery euened ni Iowowed matarnts ad eqaypment ont tee Mba are oBher urseersty “The student hax secured compiits cigarance rom a cavecammed ofbees 69 ot ABT 05, 2074, otiee. aomsodinly eempesymnent sppoctunities rc otadent is having tno Lniwarsity in gewnd etariing dan 79 punt auroad, The university adnanisiraion: has no objacton t the iseuanoe of his carttcatan pumas it ‘hve Honorable Sigmiacat is being faeued upon the wrtien raquasiotine student for watever nay nerve, except tor Menthoatun pumones, December 2625 at Cagayan de Oro, Hisamis Griemtel, Patinpines tasuad thin 14 day: rely yours oy. Johnathan Giver, £4 0. Dimetor, Admissions ard Records Oftoe"
    },
    {
        "image": "honorabledismissal1_synth_6_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "ciscumber 14 2023 HE REGIS! CAGATAN DE ‘Cagayan de Oro, Misarais Praiepones Dear Suita a™, Greetings of Peace “Vo wHIOM IT MAY COHCERN, sbapad. The university Tras Honoree ray sev once tesund this 44 day of Deceater Sincerely yOUrS, parnseat i bing ists wpa the een TRAR ‘OROCITY COLLEGE Onental and Good Health! eas a bonaiige staan of C2B8799 rose 2023 23972. program ander te Cote of oti stagers for smatever tana PurpOES aan DUDIe® 023 a capayan de Oro, Hisar 7 B (Dr Jonnathan iver, E34. \"aaerisaions acd Raccrts Office Director,"
    },
    {
        "image": "honorabledismissal1_synth_6_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "December 14, 2023 THE REGISTRAR CAGAYAN DE ORO CITY COLLEGE Cagayan de Oro, Misamis Oriental Philippines Dear Sir Ma am, Greetings of Peace and Good Health! ‘TO WHOM IT MAY CONCERN: ‘This is to ceriy that JAMES WADE, bearing Student Number 2023 23072, was a bonatide student of Cagayan ‘de Oro City College enrolled in the Bachelor of Science in Computer Science program under the College of Arts ‘and Sciences from First Semester, AY. 2018 2019 to Second Semester, AY. 2021 2022. During the period of enrolment at this institution, James has successfully completed 105 units with a General ‘Weighted Average (GWA) of 3 3. The student has maintained good academic standing throughout their stay and. has shown satistactory compliance with all university rules, regulations, and policies, Records indicate that James has no pending disciplinary cases, no unsettied financial obligations with the University, and has property returned all borrowed materials and equipment from the library and other university offices, The student has secured complete clearance from all concemed offices as of April 05, 2024. This student is leaving the university in good standing due to pursuit of immediate employment opportunities ‘abroad. The university administration has no objection to the issuance of this certification, This Honorable Dismissal is being issued upon the written request ofthe student for whatever legal purpose it may serve, except for identification purposes. Issued this 14 day of December 2023 at Cagayan de Oro, Misamis Oriental, Philippines, Sincerely yours, Dr. Johnathan Oliver, Ed D. Director, Admissions and Records Office"
    },
    {
        "image": "honorabledismissal1_synth_6_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "December 14, 2023 THE REGISTRAR CAGAYAN DE ORO CITY COLLEGE Cagayan de Oro, Misamis Oriental Philippines Dear SirMa am. ood Health! Greetings of Peace and G TO WHOM ITMAY CONCERN ‘This sto certity that JAMES WADE. bearing Student N! 4¢ Oro City College enrolled in the Bachelor of Scienct land Sciences from First Semester, AY 2018 2019 to Second Semmes tatthis institution, James has st 3 The student has maintained sity rules, 129) ‘fide student of Cagayan umber 2023 23072, was a bon inder the College of Arts ‘en Computer Science program ul ster, AY. 2021 2022 units with a General yecesstully completed 105 oughout thet stay and ‘good academic standing th ulations, and policies Dunng the period of envollmer Weighted Average (GWA) of 3 has shown satisfactory compliance with all univ ‘ancial obligations with tne setied fin university iment from the library and other 2024 isciplinary cases, no Un Jed materials and eaulor ncemed offices as of April 05. James has no pending a ymed all borrow complete clearance from all cof ursuit of immediate employme! ication. Records indicate that university, and has property ret offices. The student has secured ant opportunities ty in good standing due to P ye universi to the issuance of tis certifi ministration has no objection niten request of the student f ‘This students teaving th abroad, The university ad “this Honorable Dismissals being !s8ued UEP the w 1 whatever legal purpose t may serve, except for identiicaion PUrBOsES vgsyed this 14 day of December 2023 at Cagay2° de Oro, Misamis Oriental, Pritippines Sincerely yours Dr Johnathan Oliver, EdD Director, Admissions and Records Office"
    },
    {
        "image": "honorabledismissal1_synth_7_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "June 08, 2025 THE REGISTRAR UNIVERSITY OF NAGA, Naga, Camarines Sur Philippines Dear Sir Ma am, Greetings of Peace and Good Health! TO WHOM IT MAY CONCERN: This is to certify that BETH BROWN, bearing Student Number 2025 70358, was a bonafide student of University of Naga enrolled in the Bachelor of Science in Civil Engineering program under the College of Arts and Sciences from First Semester, AY. 2022 2023 to Second Semester. AY. 2025 2026. During the period of enrollment at this institution, Beth has successfully completed 97 units with a General Weighted Average (GWA) of 2 59. The student has maintained good academic standing throughout their stay and has shown satisfactory compliance with all university rules, regulations, and policies Records indicate that Beth has no pending disciplinary cases, no unsettled financial obligations with the University, and has properly retumed all borrowed materials and equipment from the library and other university offices. The student has secured complete clearance from all concemed offices as of September 16, 2025. This student is leaving the university in good standing due to financial dificulties and constraints. The University administration has no objection to the issuance of this certification This Honorable Dismissal is being issued upon the written request of the student for whatever legal purpose it may serve, except for identification purposes. Issued this 08 day of June 2025 at Naga, Camarines Sur, Philippines. Sincerely yours Prof. Cristian Wilkinson, Ed D. Director, Admissions and Records Office"
    },
    {
        "image": "honorabledismissal1_synth_7_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "dune 04, 2g REGISTRAR UnivVERSITY OF ‘Naga, Camarines Sur Pritnpines de student of ISG, was BOE program under the College ot lad in the Bache! 026. ist Somes! rom Fi salon, Both has succes jodent hes misiriained good academic During the period wwereity ries, rect jatices, ate oh Avarage (GWA) of 2 2 shown sath General Weigh compliance wt coughean shel actory gations with the ancial oi ri the library and thee s offices poi! es, ny unsattied f ssoipiinary spaterisls 2 “0 perding 4 ned ali Doro rad compinte clearance equipment £3\" from all concerted Recwds ind university, and has property 7 xsity offoes. The student he ys SC he September _ulties ane consti dus to fi ty in good standing ince of this jectien to the West lant fs inaving the ve sigtration nas ne «eh This university 23% 1 for whatever legal Honorable Dimissel is being sve CPO the watten request of the studer! sification. puEpeses for id purpose 8 may Seve, SCOPE afines Sus, Painpines at Haga, Igoued this 08 day of June sincerely yours lan WMikinson, EoD. ‘Admissions and F"
    },
    {
        "image": "honorabledismissal1_synth_7_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "syne 98, 2028 THE REGISTRAR UNIVERSITY OF NAGA agg, Camarines Philippines ngs of Pea TO WHOM IT MAY CONCE 70358, was 3 bonafide student of TH BRCWK, hearing Student Number 2025 or the Callege of Naga envaited in the Bachelot of Selence in Civi Enginnering POBSR ns trom Piet Semester, A. 2022 2008 ta Savond Semasior, AY. 202% 2078 ene hones sucressiey completed 97 units wih a ned gord acadztnle standing 8, ad yevios of enraliment at this inition, Bel ted Average (3W2A) of 2 59. The shixdent has mein lay ani has shown satisfactory compliance with aff university alas, 1eguS ecoris Indicate that Beth has no pending cisuininery cases, no wasettiod Snel obligate the vs has properly retumed si newewzed materials at equipment from the Wbisty 52 othe sre The stadso! haw secured complete cloarance fom aft concemed cffleas as cf ynive: university off September 4 28 ian aod constraints. The ue to financial in goed siavating 1 to the issuance of this eet ification. Tits student Is leaving the univers university edminist has no object charewer lege 1 request of the student for: ng issued sagan the wrt i bel This Honorable Disent 2, except for icentifiestion pupaees, 2 it may 2026 ai Naga, Comasnes Sur, Pht issued this 08 day of Ju Sincerely yours, Picg, Cristian Wikinsen, £.0. Director, Admissions and Records Gifice"
    },
    {
        "image": "honorabledismissal1_synth_7_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "June 08, 2025 THE REGISTRAR UNIVERSITY OF NAGA Naga, Camarines Sur Philippines Dear Sir Ma am, Greetings of Peace and Good Health! ‘TO WHOM IT MAY CONCERN: This Is to certify that BETH BROWN, bearing Student Number 2025 70358, was a bonafide student of University of Naga enrolled in the Bachelor of Sclence in Civil Engineering program under the College of Arts and Sciences from First Semester, AY. 2022 2023 to Second Semester, A Y. 2025 2026. During the period of enrollment at this institution, Beth has successfully completed 97 units with a General Weighted Average (GWA) of 2 59. The student has maintained good academic standing throughout their stay and has shown satisfactory compliance with all university rules, regulations, and policies Records indicate that Beth has no pending disciplinary cases, no unsettled financial obligations with the University, and has properly returned all borrowed materials and equipment from the library and other University offices. The student has secured complete clearance from all concerned offices as of September 16, 2025. This student is leaving the university in good standing due to financial difficulties and constraints. The university administration has no objection to the issuance of this certification, This Honorable Dismissal is being issued upon the written request of the student for whatever legal purpose it may serve, except for identification purposes. Issued this 08 day of June 2025 at Naga, Camarines Sur, Philippines, Sincerely yours, Prof. Cristian Wilkinson, Ed D. Director, Admissions and Records Office"
    },
    {
        "image": "honorabledismissal1_synth_7_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "dune €8, 2028 THE REGISTRAR VERSITY OF NAGA Noga, Gamers Sus Philipines aod Heaith! 70 WHO WIT MAY CONCERN: This is to contty thet University of Naga eneatied ia the Bachelor of Scie Axis and Sciences trovn Firs Number 825 70258, was 9 borate stucient of in Civil Engineering program wreder the College of Sermesier. A ¥. 2022 7023 ia Second Semester, ALY 2025 2026 Duin 8 the pevica! of anvolimmant 2 this institution, Goth has enerai Weighted Average (GWA) of 2 59. The 5 ‘throughout thelr stay and has shows: esefully completed SP ident has ma ntalved: ss emin ood academic starting factory compliance with sit university nes, faitons, and Beth has ne pending ais: sity, ari Nas properly retumed all varsily offices. The student hus excured od September 16, 2 the dua to finance! tration has no objection to the issuance of this cet aifficuttles and constraints. Tise ieation sniversity ar This Honoratie Dismissal is telng fesused upon the weittien paspose tt 08; of the student for whales egal Ave, except for idontlication purposes loaued thls C8 day of Jane 2025 af Naga, Camavines Sur, Philippines Prof, Cristian Wikinson, EXD. hector, Admissions anc Recor Office"
    },
    {
        "image": "honorabledismissal1_synth_8_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "August 19, 2024 THE REGISTRAR UNIVERSITY OF DUMAGUETE Dumaguete, Negros Oriental Philippines Dear Sir Ma am, Greetings of Peace and Good Health! ‘TOWHOM IT MAY CONCERN: ‘Tso certty that KIMBERLY MILLER, bearing Student Number 2024 45952, was a bonafide student of University of Dumaguete enrolied in the Bachelor of Science in Information Technology program under the College of Computer Studies from First Semester, A Y. 2019 2020 to First ‘Semester, AY. 2020 2021 During the period of enrolment at this institution, Kimberly has successfully ‘completed 46 units with a General Weighted Average (GWA) of 2 84. The student has maintained good academic standing throughout their stay ‘and has shown satisfactory compliance with all university rules, regulations, and policies, This student is leaving the university in good standit ‘administration has no objection to the issuance of ing due to personal and family reasons. The university this certification, ‘This Honorable Dismissal is being issued upon the written re ‘Quest of the student for whatever legal purpose it may serve, except for identification purposes, 'ssued this 19 day of August 2024 at Dumaguete, Negros Oriental, Philippines. Sincerely yours, Prof. Peter Johnson, DPA Vice President for Academic Affairs"
    },
    {
        "image": "honorabledismissal1_synth_8_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "August 19, 2624 THE REGISTRAR UNIVERSITY OF DUMAGUETE uni ngucta, Negras, Crlental Dur Phitiggines TOWHOM IT MAY ConcE: “This fo te certify tat KIMBER Uniesraty of Sumeguete en Cotiege of Compe dom Number 2024 45952, was at fed in tha Bacholor af Seisnce inf t undies toon First Senverter, AY. 2045. nade student of Maton Tacheology mogram under te 2820 to Fast Semester, AY, 202 ES ing the Posted of ervettore ‘Yerignted Auacage f and has shox tat is insttohon, Kamnberty has sueceastully completed 43 unita witha 0f 2 64. The siden has maintained good academic standing vn satisfactory compilance wit ail university rules, maguiasons, and poh Recon ‘Sindee that Kimberly has no pending disci Ghierity, att has propeity reumed alt aonowed 1 oftces 8 Recured completa Seprance ft Wty SABES, ne Uneatlied fn Stlals and eaapment tom the jibe 2 of May. ‘obligations with the Ivand otter an 2005 ‘This sludentiisioaving te universe reasons. The university adninistiaton hes ne eniection to the puance of tis cartiivator “This Honorable Ciamisset is being issued upon the written request of the May Seve, except tor anti for whatever iagal supace it n purposes, Iss this 19 vay ot august 2024 al uriaguete, agtos Oneal Phiigpines Vices President for Academic. fa"
    },
    {
        "image": "honorabledismissal1_synth_8_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "August 19, 2024 THE REGISTRAR UNIVERSITY OF DUMAGUETE Dumaguete, Negros Oriental Philippines Dear SirMa am, Greetings of Peace and Good Health! TO WHOM IT MAY CONCERN: ‘This isto certify that KIMBERLY MILLER, bearing Student Number 2024 45952, was a bonafide student of University of Dumaguete enrolled in the Bachelor of Science in Information Technology program under the College of Computer Studies from First Semester, A Y. 2019 2020 to First Semester, AY. 2020 2021 During the period of enrollment at this institution, Kimberly has successfully completed 46 units with a General Weighted Average (GWA) of 2 84. The student has maintained good academic standing throughout their stay ‘and has shown satistactory compliance with all university rules, regulations, and policies. Records indicate that Kimberly has no pending disciplinary cases, no unsettled financial obligations with the university, and has property returned all borrowed materials and equipment from the library and other university offices. The student has secured complete clearance from all concerned offices as of May 07, 2025. ‘This studentis leaving the university in good standing due to personal and family reasons. The university ‘administration has no objection to the issuance of tis certification. ‘This Honorable Dismissal is being issued upon the written request of the student for whatever legal purpose it ‘may serve, except for identification purposes. Issued this 19 day of August 2024 at Dumaguete, Negros Oriental, Philippines. Sincerely yours, Prof. Peter Johnson, DPA Vice President for Academic Affairs"
    },
    {
        "image": "honorabledismissal1_synth_8_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "August 19, 2024 THE REGISTRAR UNIVERSITY OF DUMAGUETE Dumaguete, Negros Oriental Philippines Dear Sir Ma am, Greetings of Peace and Good Health! ‘TOWHOM IT MAY CONCERN: ‘This is to certify that KIMBERLY MILLER, bearing Student Number 2024 45952, was a bonafide student of University of Dumaguete enrolled in the Bachelor of Science in information Technology program under the College of Computer Studies trom First Semester, A Y. 2019 2020 to First Semester, AY, 2020 2021. During the period of enrollment at this institution, Kimberly has successfully completed 46 units with a General Weighted Average (GWA) of 2 84. The student has maintained good academic standing throughout their stay and has shown satisfactory compliance with all university rules, regulations, and policies Records indicate that Kimberly has no pending disciplinary cases, no unsettled financial obligations with the university, and has properly returned all borrowed materials and equipment from the library and other university offices. The student has secured complete clearance from all concerned offices as of May 07, 2025. This student is leaving the university in good standing due to personal and family reasons. The university ‘administration has no objection to the issuance of this certification. This Honorable Dismissal is being issued upon the written request of the student for whatever legal purpose it may serve, except for identification purposes. Issued this 19 day of August 2024 at Dumaguete, Negros Oriental, Philippines, Sincerely yours, Prof. Peter Johnson, DPA Vice President for Academic Affairs"
    },
    {
        "image": "honorabledismissal1_synth_8_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "THE REGISTRAR UNIVERSITY OF QUMAGUETE Oumagueta, Negros Quenta May CONCERN ‘vhs 10 certty thal KINDERLY MILLER. Searing Stide oggiann unde? anvotien in the Bachelor of Sevence mn informer sity of Dunag: ios tein Fist Semester. AY vege of Compete Stud lay completed 48 units with a Genera igheul nei stay Dune sod of anrgiament at tis ington, Kintbor s has sucresst Weighte! as snc tng Sanco te 199 01 2 84, The slument nas mamdained good aca Average (9 ali unoeersty ies. reguiat ans n salstactory compliance 5 wat the wtieg 6 to cat Komnerly hos oa bending discipionary eases, Ne UN Records inawate rary and oiher university owedt materais and equiomel university, ang has properly retumed ai bon ay 07 2025 5 aS complete cearance fom alt concern shies, The shadent has secured th good standing due Wp cersonsi and family feasons The unwe ving othe issuance ofites carbtication. ation nas no abi ofthe student tor whabnve” legal ougose A sc peing issued upan Ihe whiten Teg his Honorapis Drs noses enbteaion may sete, except to Onental Priippries issued this 19 day of August 2 Prof Peter dot Vice Prosidem for Academic Aifairs"
    },
    {
        "image": "honorabledismissal1_synth_9_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "December os, 2023 THE REGIC RAR BACOLOD POLYTECHNIC UNIVE: Siacoled, Nagas Occidental Phiipaee Dear Sirta am, a5 of Peace 3 Bosd Healy: Tow WIT MAY GONCERN This is to certty tat AN Poiytectiaie Universit Engineering a 600, wes a borage ny Education program under the Y 2upe2na: soled in the Bach #9 Tochnotogy trom Saco a student of Dawatod ‘wei Semester, AY. 2024 2025 Fed of envoliment at ‘his instiuton, shied Averane (GWAj of 2 TS Hes Siow Sati Andrew has suee 86. The student isa main somnlisincs With al univer essiully competed 196 uy Bed acaceriic sta ts whth a Genera! ng throughout their stay fulen, reguiavons, and poticigs Records indicat that University, and has offen. The sh ins Cisspiicary Cazes, no unsatied Suantiat nbtigetone with the Lemna ali Bomowed maieriats and squipmnent om 9 library ona ether univarsity smblel stearance fom ait concsined aifcas as of augus 05, 2028, feauing the university ishation as no object: in 200E standing aie font ir the iasiacie Bnancat diicuites ond constants. The univesity 8 a1 this cectifcatin, This Honos fe Ray serve, exe, ai fs being iesued upon the written roe ‘ofthe siusant for whatev fegai runzose jon purposes, 2at Bacolod, Negros Cucidenta, Philippines Pret, Margaret Thomas, Untearsity Regt"
    },
    {
        "image": "honorabledismissal1_synth_9_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "Sevember a2, 2005 IME REGS TEAR BACOLOD POLY TE CHnae UNWERSIy pets. Megs Oecidertes, Pritippineg Dear Sitta am, Grestiags ofp 2073 36800, wos a penahde stedany 'Y Eeiucation piscraen Under the 6, e380\" AY. 2099 2023 8 Fest Seonnstee. a 8f Bacsiog otege of 2024 2026 ES iOS ot erastiment at in Et, Arcrow Weighted seorace Nis Suteesshiy comptotag 206 us Witt Genera Satert hae maine soc ard has Recents inaicuts mar Usivetty anes Angra: Aas pepe Dorawed mate Offcea. The student n, RAS ne pers Fy TehNeS aie {AGE obtgtons wth she leavin the uriversty in goog g SHAR NaS Na otyection wm ig fewaney Thin Henorabie Sismsysat Dein heied wp te wetter “SOUESt OFtNe student tr stems My B808, ace fye Montitoaten purposae outed tie oe (628! supose a; *Y o Becamiver 2025 at Sacoiog Negros Seca"
    },
    {
        "image": "honorabledismissal1_synth_9_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "December 05, 2023 THE REGISTRAR BAGOLOS PUR. YTERRNIC UNIVERSITY Bacalad, Negros Occidental and Good Heath? TO WHOM IT MAY CONC niber 2023 8000, was a bonaliee stuclent af Bacolod tion program urndor the Collage of for, AY, 2024 2025, This is cert hat ANCREW HOOD, beating Student achelor of Blementary Ech sie, AY, 2022 2023 1 First Seme Polylechnis University ennatied in Enginesting anc Techaciagy 2 Seco) nent at this insttubon, Anivaw has suceseehlly completed 105 units with General {has maintained good scacamic standing Seoughout heir stay guiations, ng the parted of anrai tod Average (GWA) of 2 88. The Siu ‘and hes shown gatistactory cemalisnce with aff unvuersity rule mt Dotetas cate that Andrew aa no pending otscipinary cases, no unsattied financial citigations with the iveraily, ang hae propery retained ail borrowed materats, oun the fisrary and other un offices. The sludent na completa clearance trom all concemed offices as af Augusi 08, 2025. equines “a this s sicullies ana constraints the adentis faving the university in good standing due fo trance administration hrs no oulection fo ihe issuance of this certifcasn, This ever ssued ints 05 day ot December 2023 at Bacotes, Negros Gccidental, Philigpines,"
    },
    {
        "image": "honorabledismissal1_synth_9_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "December 05, 2023 THE REGISTRAR BACOLOO POLYTECHNIC UNIVERSITY Bacolod, Negros Occidental Philippines Dear SirfMa am, Greetings of Peace and Good Health! ‘TOWHOM IT MAY CONCERN: “This is to certy at ANDREW HOOD, bearing Student Number 2023 90600, was a donate student of Bacolod Polviechnic University enrolled in the Bachelor of Elementary Education program under the College of Engineering and Technology from Second Semester, AY. 2022 2023 to Fist Semester, AY. 2024 2025. During the period of enrliment at tis insttuton, Andrew has successtuly completed 106 units with a General Weighted Average (GWA) of 2 86. The student nas maintained good academic standing throughout heir stay ‘and has shown saistactory compliance with ail university rules, regulations, and polices. Records indicate that Andrew has no pending disciplinary cases, no unsettled fnancial obligations with he university, and has property retumed all borrowed materials and equipment fom the Wbrary and ther university offices. The student has secured complete clearance from all concemed offices as of August 05, 2025 “This studentis leaving he university in good standing due to nancial dificutes and constraints, The university ‘administration has no objecton to the issuance of this certification, _This Honorable Dismissal is being issued upon the writen request of he student for whatever legal purpose it may serve, except for identification purposes. Issued this 05 day of December 2023 at Bacolod, Negros Occidental, Philippines. ‘Sincerely yours, Prof. Margaret Thomas, DPA University Registrar"
    },
    {
        "image": "honorabledismissal1_synth_9_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "nececntiet THE REGISTRAR paccLe PO YIECHNIG UNVERSTY Porulod, Hecgs Ocekentst Praspeine nd GO 2 AF RAY CONCERT: RYE HOCH), tas SHIGE pyumbae 2025 90000. 188 5 ponates suedent oh bacated rats Brachlot of CHOMENTY education progrart waar Bee CORTE at easier, AY, 2024 2525 second taamenter ss Fira “yngs is t0 cot AN poayeennic Uotoneety rhe Enajrasering ond factmatogy FON ANDER soa at arrose ne paz sgotesstaly rage (anyrZee Tre sadent ae smaintaired ond acaaernic SN siacrory compte #68 8 UNS say ies, sean, ae FOE nine wath 9 Gareat opiate 106 1 sghost tne St ing Bea suc, Bie using the pat spoaigttied Ree andi tes oon 5a coxa obsgaiiona wi ME ary and oes wrinerty seopinary cased, no wneeties feo te crew nas ne osnding a Recois neat at very, ane ian prope cts si teescn asain REDO fies, The sucess saute mate ares wes 2H cOneane ‘nica 26 of Auger G5, 2025 ‘nis st tang Be onizers 7° good nsing doo 1 Eran gaicuttos anci conesenints. TRE nivertty aevagration nas 0 opj ehur 2 ME reuance ot 2K cBPHaHO®- nig Hemorable Grama Bain SUS wagon te svinn vequaet ore snugent for ater ioge pupae seat ear, 2c oe aT AUO prirposes saan on 05 ay of eve 2027 egceind, tggrne cee, PRESSE Sincerely yours, prot, Margovet Thornes, OPA University Rogisttat"
    },
    {
        "image": "honorabledismissal2_synth_10_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "ILOILO CITY STATE UNIVERSITY Graduate School 240 Rizal Avenue, liolo Cty, Noe er (035) 490 5001 Erk: totoctstateurversy ee on HONORABLE DISMISSAL To Whom It May Concer: tudent of Hoo City State To WHOM IT MAY CONCERN: ‘academic Year 2023 2024 umber 2023 59678, was a reguary enroleg “This isto cert that RY “Accountancy from First Semester, University, Graduate Schoo), sna Fst Semester, Academic Yea 2025 2028 _The student has completed a total of 61 2 General Weighted Average (GWA) of 2 68. “Throughout the period of enrolment, RY good academic eres as como wih a nveraty reason 22 requirements, “The Offee ofthe Registrar confirms that Ryan ity including Worary fires, aboratory qe. or cher nancial accounabites, Abunwershy ‘property, materials, been duly returned and ‘accounted for as of May 09, 2025. Furthermore, the student has no pe universty s Code of Student Conduct themsetves in accordance with the honorable standing. be used for any Jes and has conducted tudent is Yeaving the institution sudent for famiy relocation. tt may nding discipinary cast ‘and Discipine. The st able Dismissalis sued at the request of he “This certification of Honor form of identfication. lawful purpose except as ne, 2025 a oto ty, tno, Repubts of he Pruppine® Issued this 04 day of Ju ‘Atty. Brianna Serrano, Ed D Registrar"
    },
    {
        "image": "honorabledismissal2_synth_10_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "ILOILO CITY STATE UNIVERSITY Graduate School ‘840 Rezal Avenue, ll Cty, loo “Tet: (038) 420 5061 Emad: doloctystateuniversty edu ph HONORABLE DISMISSAL To Whom It May Concem: ‘To WHOM IT MAY CONCERN: RYAN C. LARSEN, Student Number 2023 59678, was a regularly envoled student of Hoo City State ‘This isto certy that Jence in Accountancy from First Semester, Academic Year 2023 2024 University, Graduate Schoo), taking up Bachelor of Sci nti First Semester, Academic Year 2025 2026. “The student has completed a total of 61 academic unts with a General Weighted Average (GWA) of 268. Throughout the period of enrolment, Ryan has maintained good academic standing and has compled wih ail university regulations and requrements, “The Offce of the Registrar confirms that Ryan has no pending obligations to the university including Nbrary fnes, laboratory fees, or other fnancial accountabiltes. Al university property, materials, and equipment have been duly returned ang ‘accounted for as of May 09, 2025. Furthermore, the student has no pending discipinary cases and has conducted themselves in accordance withthe university s Code of Student Conduct and Discipine. The student s leaving the instution in honorable standing. “This certification of Honorable Dismissalis issued at the request ofthe student for famy relocation. It may be used for any lawful purpose except as a form of sentfication. Issued this 04 day of June, 2025 at llolo Cty, loko, Repub of the Phitppines. Atty. Brianna Serrano, Ed D."
    },
    {
        "image": "honorabledismissal2_synth_10_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "#OILO CITY STATE UNIVERSITY choot Deb Frat Avene, Yo Brat sinonmtamanentyGee i ate rar ayer a70 o8 HONORABLE DISMISSAL ‘To Whow f May Concei: “7 WaPRRE IT BAY OGNOER secpaty exc stuart of aks City State ance Marines IGQS SRETE, WO 8 seraater, Acacemic Your BD 28 ty tet FRC. LARSEN, 20 checrsts comune Seba tke up Gaol of erence econ Rees FAL Ss ud Pest Semesion Asaderc Year 25 2825 etter Gt accent ucts wih Genoa ind Avera [ORY cf 26% TEAS ne any gba HN aeRO IRENE OS “the stunont nae complaint aromas eB) pariod of enfant, Ryan hae resins we roquivernente tres writs cna Harasy fs, Bama 1g Bat Ryan nas 0 pened abTQSHENE 1 caagarare ave ben Say euro aS he Ortice of te Rageatar oc “A unevarety peaperty, mathriis, a 66 owe, 2 ihe Seana accoumbabon. seccuted te a9 of May 98, 2025. has ne sending cickoinary cases ahd Ma sent re. The student ter sont tenienatvcn Re ROCA wit TNE rutetor, ia RRA INN Futana, ov site sanvarpiy e Cotte of Sucean Concuct ate DSc “Tia corttcation of Monarubte Dl onus ra regattas oe ene veces Creny be ad Tar Sy eas gurpene #xeek 28 8 Sati HINARI segue is 04 day of Jor, 200 24 Roto Sty, take, Rests fe PARAS Aity Baisona Sone Registrar"
    },
    {
        "image": "honorabledismissal2_synth_10_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "ILOILO CITY state UNIVERSEry ‘Graduate Schoai BS Ras Avacase, todo Cay, nie TL 508) 306905 j Brows Salestrmetnsrwontytiedupn HONORABLY DISMISS 41, To Whom Bt May Concern FO WHORE me May concn PR lo oerity tine RYAN C. Lan. 5 SAY ance choad of fo Chy Stang rears, Grouse Seton, ing up Bacmene Science w Accoxiney tom tems Samesien Aecnneeras Vow 2029 2058 SSH Fie! Semnustee, asodorae 2 ‘The site nay \"al etter een (Hi ot Fhrougts tng PEON a ENCORE, Pan fans maaisne iS On Das CeIn vat AB aravore Pearman, n8 Ofles of ne Regetzarconteme tat an B25 1 Dern satin tothe univer ‘Sct 3 athe frnsal wccuntunstin. ap Count tor 38 of tay 2, ape. PADENETY CLES and has conseactees Oncisine The sistent is waves; te Hemmer ‘arenes accordance wih the Wrcraiie csonsng ‘Stade to tomas eaton. ty Foss cetthication of teonceatae 5 Seats pees a: orient ls tenes as SA 8 8 em oF eet atin ‘one 9 68 ay a te comsnat, De wes far ane We DORE ote Oy, tote, Reni of ne Shion,"
    },
    {
        "image": "honorabledismissal2_synth_10_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "HLOILO CITY STATE UNIVERSITY Graduate Schoot 840 Reza feverue, fo Gy, Yio To! (O25) 4H 681 Era lolceaynratmunnarniysieds oh HONORABLE DISMISSAL ‘To Whom: it May Concern: TOWHONN MAY CONCERN. “This to cernty thar RYAN C. LARSEN, Shien thunmoer 2023 59678, was 4 reguanry envoted eluant of toby Cty State University, Graduate Schoo, taking up Bachar of Science m Accouniene; trom Fret Semester, Acacerw: Year 2022 2024 unld Feet Secoster, Aconessie Yew 2025 2025. “The stated has compselad a Sco of Bt acaiemas unds wih a General Wesghted Average (CNA) of 2 68 Throughout the pari cf enrotresi, Ryan has mantaned good acadenic standing and has compled wit at unwersty requations. nd requeemenrs The Offce of the Rogistra confine thar Ryan hs ne ponding chayatonn to the universty ehudiny Wary fea, iaboratory fees, cr cher nancial eucourtanitins Ai wmvarsty pope, mutes, and equmeNt have Deen culy fAumied ad acconnied for 28 of ay 08, 2925. Furtrermur, the statent has no percig Seeipkuary cases aiid has condhsted twemoeives in accortane wit te univer say e Gosle of Statert Conduct and Discipline, The student it leaving tne eiation in honcrabe standing, “This verthication ef Honcvable Cinwinsalis usd at hw request of ie shitant fe tamy colocation. i may be used for amy motd purpose except a8 2 form of wectiicaton, tesued thes 04 cay of June, 2025 at dolu Cy, Holo, Repub: of te Prbpines Atty. Beignna Serrano, Ed.) Registrar"
    },
    {
        "image": "honorabledismissal2_synth_1_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "AGUSAN DEL NORTE STATE UNIVERSIT College of Criminal Justice 200 Be! Plor Fivaet, Cutuan, Anus 6 anidetnonectniaunwacstysped oh Yer 34) er2 7328 Beat og HONORABLE DISMISSAL ‘Ts Whom it May Concern: 1O WHOU IT MAY CONCERT sien enrol stadt of Ay ge of Comma Justice, wing Jor of Scignoe Iefesmalian Tecinagy {0 2022 wnt Fes! Somenier, Acai: Year 2025 Naste St ‘Ssamenter, Auaciemie Your 20 unis with a Gengral Weighted Average (OWAY of 26 Throughner the mplotel 9 tial o of regulations ant ey has mainianed (o0¢ academe siending and has corepted with a uty se suuceet bas erin of encotrent, Ash sing rary thes, BdCr roms to He nee ox is, and Aguipment nave been uly etuenad anc tr as of Aus once wih tes tainly nencasin. Kemay be user fer any “This rectication at Honorable Guanseaa’ is moved al the request ef the stent fo su) purpose Becoph a3 2 town ot Sere lasued thes terrber, 2025 at Buran, Asussn de! Norio, Republic of he Pnaippinee ty Matirow Registrar"
    },
    {
        "image": "honorabledismissal2_synth_1_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "SAN DEL NORTE STATE UNIVERSITY Colleye of Criainat g 20 Det Fear tice sf, Suan, Asean Get Norte Te 824) 0129908 j Seat equssrdetnenasineconesrm Epes gh HONORABLE DISMISSAL Te Whom It May Coaceen: WHGM IT May CONgERN: This ino cently nat ASHLEY A. oA Norte St3te Un ), Suan 9, 1eas 2 remulary encod ronal ust, taking up Bachelor sf Scimnee i acne Year 2S 20, Rent of apis maton Technsinay frown Fs ‘Thee ert ike complete a ola of 135 academia orive of encclinent Asiioy has sainanne lunes wi a Genera Weighing Average (GWA! uf 2 8, Throwg rst the ‘9021 aeaaland suancing and nse conmpied wan et univers ragutatne ang ‘The Ofice of the Ropistrar comtemes thet Ashley haw wx fone, ce ofter fonci accountabiiies. Ad univeasity scouunted for ay of August Barding obinatons i tre untraredy inci oerty, matecisis, anes ecu rary no tee. tly rebar sor aicny heceste, te suet hos mo peretg oie nary o3tes and nas conducted emeetves nx smrveistyt Cove of Stent Conduct sed Daciptne. The ster eaving i vance with the \"8 nsthzon in mnacabie atencing, ‘This centhicaSan of Hicowrabie Oseineate sued atthe ‘Wn purse exept asa fer of itenifcetion eewast ofthe shade for lanly oatocate. ay ts used tor any ay of Senternner, 2 22 By Agissan doi Notte, Repu afi Phiiginee Atte. Matinew Prince, 4 0."
    },
    {
        "image": "honorabledismissal2_synth_1_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "[AGUSAN DEL NORTE STATE UNIVERSITY College of Criminal Justice 200 Det Phar Street, Butuan, Agusan det Norte ‘Tet (024) 012 7228 Emat egusandenorestateunversty ess oh HONORABLE DISMISSAL ‘To Whom It May Concem: ‘To WHOM IT MAY CONCERN 9, was a regulary envotied student of Agusan det Tern sate Unieraty, Colege of Crmnal Justee, ating up Bachata of Science niformaton Tectnotogy tom Frst ‘Semester, Academic Year 2021 2022 unt First Semester, Academic Year 2025 2026. Tre stedent has completed a tao 136 academe unts win a General Weighted Average (GWA) of 2, Throw me Forest ewemmert Aaiey as mantaned good academic stadng and has come win at erat repsatons a requrements, ‘The Office of the Regiatrar confirms that Ashiey has fees, or other francial accountabaes. Al university ‘accounted for as of August 23, 2025, no pending obigations to the universty including Worary fines, laboratory property, materials, and equpment have been duty returned and and has conducted themselves n accordance wih the Furthermore, the student has no pending Gscpinary cases insttuton honorable standing, universty s Code of Student Conduct and Dacipine. The student s leaving the “Te certicaton of Honorable Damissalis sued atthe request of the student for famty relocation may e weed 1 ay lawta purpose except as a form of entfication. tasued tie 12 day of September, 2025 at Butuan, Agusan del Norte, Repubic ofthe Prappnes Alty. Matthew Prince, Ed D. Registrar"
    },
    {
        "image": "honorabledismissal2_synth_1_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "AGUSAN DEL NORTE STATE UNIVERSITY Hekege of Criminat Juntos on Dat or Strat, ints, Agata det Hae poeandiracarencc Rt (84 BAR 23RR Bont HONORABLE DISM! ISSAL fn Whom It May Concem: eH T SOY GONDERNE spusarty onnie sete AEE SL sion Toy eam Fest ros te to custiy that ASHLEY He OBRIEN, Ste me ana Uesenesy, Cokage of renal ee, BENS Sonasner, Academie Year 2021 2022 wt Feat Somasit avaente fastens han coorquaied a 2c 138 aoa Tenroferae, Revaey Has mawsoined GSE teeabee 1009 92355, wel a7 for of Senge We age (Seva of 2 Tizeroe E in nts wits a Gooner Woes Aet eB nsec 25g OE Ths pores at measecite wy SPH Hed COMES stents Atay bats ple gas sity ncn Hocary fas, tabawataty s anprenay seq, eucerate, w7 oars ae ee AF renened and “he ition of his Rsciates ial seid tae gp af Burgas 22, 2628 naymacivgs fo acconsance wih Bie spinon exams sod bas conceit ion is norereite ARE. ie he atacand mareing the i sor ty eloeatn, 8 rien ne a pening fof Shasert Conduct ana DBS esnereate, epteoreny s Oe yb sua Re ws sequaat of the weeds cores of rcnathe Paeeseate aso 2 ong as Fo aa conn, ayusan we Heke, Fee 6 hes eons onate ws! 1 he PRappRNSE ese tin SB of Septet, 200% a Be ity Matinew Prince. E"
    },
    {
        "image": "honorabledismissal2_synth_1_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "AGUSAN DEL NORTE STATE UNIVERSITY Cotiege of Criminal Justice 2p Des ear Str, Banvan, Agusan de! Norte |T2Rk) Fost einannsenenesiateaen abe BO wr eon HONORABLE DISMISSAL ‘To Whom Ii May Concent: ‘TO WHOM IT MAY CONCERN The 9 Wocertty Det ADMLEY lc. OBRIEN, Surdent tuenber 2675 92358, wan a equa ervaid stocert of AcimAn Ost Neate State Unvertty, Cotege sf Criminst Juetos, uking up Bacher of Sane tornatnn Techrasogy to Frat emanter, Scurtone, Yeas BQ 2A we Feat Secs, Acaceens: Yew S2S 2008 ‘The shen’ nes comomted oul of 198 acacenae uray mth 3 Genera Victted Auerage (GWS) of 2 8. Trrougtend Ne ‘patio of earcment Aaniny has mantsined oot acncemic Atay hd A Compe’ wi OE arveaRy YegNeGO ant mmewerwerte The Otis of Pm Reger coders tat Aarts Rak re pending stigancrs tte iverety nctuding Buery tres, wbearatory fees, ce that rangi ercouetatilies Muewernty propery. materete, and agaaomert hewe been cay returns Br ccouten for a6 of Agua 2%, 2028. Fortrernee, 8 slodkc hm no pening decrinay cates ANZ has conhacted Beemantves m accross wih te eoveruty s Cote of Student Cannset and Dccine Tia vhasent ming De VINER hoarse HAN “The certteatin of Honcrabie lament med ot te equce! of ine etgent for Maray relocation. may he wed fox any ented urvore mates a9 a form cf ante cton Sanuerd the 12 dy o Sactembes, 2025 a Bran, panan des Hatin, Renate ct he Prtpcres Atty Mathin Prince, £5 0. Registrar"
    },
    {
        "image": "honorabledismissal2_synth_2_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "QUENTAL STATE. UNIVERSITY sneering ott MISAMIS Technol casas Onertet i Read, Cagayan de OF MISSAL spe student af wasanis One eaten tan SoH Te rin sso certy TA AE sudan annner 2022 1294, gad TACHEOESY jp besnaie oto eecrasiet, Acad spot 3 08 Taronghout reguiations ant _ panne Ye neg Aes? pee west wean aise 2 pas compe se tl gf 79 aoa Ui nas gees aparsere SAN reauirewntts geong tai ig bas 90 TONS. cersty 052 fie Reta &0 aocountabenes AEM ‘The Dit ec ier teetcat gue 26. ary oases anc nat 6 penta division’ Sonnet and DSR. punent nas pay’ Code of Shade Fe students feaveg Furthermore, te optus. exgonst oh gee student es ch cartteston of Honmanie DSRS eet 8 8 fees of DETERMIN pranpees tor any aint veut 47 ony tie, 24 ar Cagayan SS pre, wisarrne Oriana, Repabic of pe tary woods, LLM"
    },
    {
        "image": "honorabledismissal2_synth_2_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "MISAMIS ORIENTAL STATE UNIVERSITY, College of Engineering and Technology 932 Mabin Road, Cagayan de Oro, Msams Orental Te! (045) 998 1727 Emai: meamorentalstateuniversty edy oh HONORABLE DISMISSAL To Whom It May Concer: TO WHOM IT MAY CONCERN ‘This isto certty that MIA A. WALTON, Student Number 2022 13604, was a regularly enrolled student of Misamis Oriental ‘State University, Colege of Engneerng and Technology. taking up Bacheler of Elementary Educaton from Second ‘Semester, Academic Year 2020 2021 untl Second Semester, Academic Year 2024 2025 The student has completed a total of 73 academic unts with General Weighted Average (GWA) of 3 09. Throughout the Period of enrolment, Mia has maintained good academic standing and has complied wth alluniversty regulations and requirements ‘The Office of the Registrar confirms that Mia has no pending obligations to the university including library fines, laboratory fees, or other financial accountabiltes, All university property, materials, and equipment have been duly returned and accounted for as of June 26, 2024 Furthermore, the student has no pending discipinary cases and has conducted themselves m accordance with the university s Code of Student Conduct and Discipine. The student is leaving the insttution m honorable standing. This certfeation of Honorable Dismissal s issued at the request ofthe student for employment opportunties. It may be used for any lawful purpose except as a form of dentfcation Issued this 17 day of July, 2024 at Cagayan de Oro, Misamis Oriental, Republic of the Phippnes Dr Mary Woods, LLM Registrar"
    },
    {
        "image": "honorabledismissal2_synth_2_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "MISAMIS ORIENTAL STATE UNIVERSITY Coliege of Engineenng and Technology 902 Matas Rot, Cagayan der, Minar Oriani “Tat (080) 980 177 mat mnaenernninnenorior rt Ges HONORABLE DISMISSAL Te Whom It May Concecn: TO WHOM 'T MAY CONCERN: This 9 to certly Het MAA WALTON, Stadert Maret 2022 13804 ‘State Ucwarnty, Colage of Ergnieerng and Techvaiogy, tang up Bachar of Bxrmantary Semmoty, Academic Yew 2020 2021 ntl Saccens Semneaine, Aranieme Yoo 2526 2025 etal 73 acaceinic cts win a Genera Wergited Average (GWA) of 308. Through me ‘academic stand and nae coraied wi af ubvaraiy reguatians and was se regarty onvcted wiucert of Minnenie Overt Eaucabon tom Second ‘Tow atucent has completing &: pesos ct enesienant, Mea fuse marine good rawr “Fre Ciice of the Regal as contiins Dat Nia has ne peANG tees, cr other tnancial necoumtabier AS universBy prORey, pecqunind fot a8 ot June 26, 2026 ebigations to te uniwerny rican rary Ses, sbexatony naterats, 0 aE TNEN Nae DORE Oily RITE OL Curtaricen, Ye stadent har 90 panding Gncipinary caves sai as conductee inemmebves accontnce ¥n Fe wrevarety s Code of Student Condact snd Oneipine, The whwsent i eavnng the methon m noneraiia wtanceng, ‘The certification of Hunorebie Casals sued at the request of Doe staswnt for enphoyment spportantioe \"rity Be anes (es aniy tae purpowe exzent a form of wontcAton, inoued Dus 17 aay of ty, 2024 at Cagayan de Oro, hesams Oriental, Repti of te Pripoinen Dr. Mary Wooss, LLM"
    },
    {
        "image": "honorabledismissal2_synth_2_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "ENTAL STATE UNIVERSITY rqineering and Technclogy saris Ort MISAMIS OR! ‘gue Baabct Ras, Cagays da OS: 3? {Coat inane tatguine stp O! “eee AEN BH HONORABLE DISMISSAL ‘fo Whom May Concer: PaMHOALT MAY CONCERN: S7IA. A UAL TON, Started beet 2 ‘aos Teton, Second Servet, Fe sp rcp eros ates of Mewar: Ontarih 13808, wes calery Eaksnatinn tare SEM sngy up Rus hee Eh atari Yew DOPE TOES. Tha ta erty Wa eiate Universtiy, Coto of ERECT Sennantec, Aine Year 202 207\" 3 LWA) o£ 3 09, Toeougrans DS Breage atone 2 ante wit a General ah vied wits a ect “OBS avs commpinted a tous 73 aacterie ‘Tee atusent poved of ans, Wa as naa pas BAH oriding wee sa sretecirg iorary Snes, OORT -qoectice ofthe Resins contms a Mis W289 DOSED niigutiona to Be ese ern, a cgiiart ne baer cy (SPE ee fran or otsar franuin accoustic. tesirar sky OP iad ter ws of ae 26, 20 aecins roeragetonnn oncousncn wih the faetion renee SSA. cana ane om, cores shodent Mavis He for annie eppostonaon may rivet, ea easter Ps 0 peENING SBCHERDIEY nae of Skutant Conduct ant fascians, THR csrosraty9 Ca ap iqvoraote Desa oud ate recseet of eset fern of wentbcaion This cnrtiicaton ox used for sry tad arp en A suse i 41 ty of Sug, 2A st Cagayan ve Ge vnaarie Greene, Raut of the PRONE tx, ary Woods, LLM Regivteae"
    },
    {
        "image": "honorabledismissal2_synth_2_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "MISAMIS ORIENTAL STATE UNIVERSITY College of Engineering and Technology 912 teawm Road. Cagayan Je Cs, Mesame Orenns Yee 14) 600 1727 Keak minsrmorentatanecaiceny edu 9h HONORABLE DISMISSAL Te Who It May Concern: TO WHOMLIT May CONCERN: {ha it 9 cmbty that MA A WALTON, Student Nearinw 2022 1960, wae a regularly enrates shades of Minami Orientat ‘State Univer ty, Cofege of Engroarng se Tectrtegy, tating up Bachaier of Blemamary Eikcaton tom Second Semester, Acacome Vere 2020 2021 url Sutnns Sementes, Aencntet, Vw 226 3023. ‘The shasert fuse competed 3 total of 73 acacia: \\evtn with» Gonura! Waegtton Average (GWA) of 2 09. Throughout fe Fer of evoment, he Ns mamnlained goed acacemee Mandy Bix haw Comal wit af wera tag latone and tepremets ‘The Ofte a te Ragone contains that Win hes no pening ahigatane Wo te unlverety Mcbating henry tes, latrevtory Seen oF ots francis sccoumtatiien, As unbvereay prowerty, materads, and equaement Nave Uaee <oy VeRNTD 3 ccmuniea tor a8 of Sune 28, 2076 Fareonmere, tm suet has Ro Deng SBCONRaTY Cates amt has Conductea Drmmentves h ACCendAnce wih te sebrerniyy Code ot State Concur atid ruchine The stadt keing the mobtuten Monae tentang ‘This cerficaton of Honorable Owmasat i mautet at te request cf he ohuaent fa employinect spportantes Wray he used {ot ary nuts purpone encect ae form cf Meriden. insves 17 cay of Sty, 2004 28 Copgayn de Oro, tines Onienca, fergathe of De Pippen"
    },
    {
        "image": "honorabledismissal2_synth_3_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "UNIVERSITY OF BAGUIO Cotege of Business Adminsstraven 12 tac Fea, Sag, Borgeet Tak 1294) 990307 Emat anmemtyotoegunthess a HONORABLE DISMISSAL To Whom It May Concern: ‘YO WaIOM IT MAY CONCERN, rn tc corty at MICHAEL ML CUNUREGHAL, Steet Humber 2021 27242, won 8 ema eins WAS ae a Cleon ot Branevs arate abn Bache of Seana ere Teciicy tam FF enaner, Acacema: Yous 2521 2022 unt Feet Sametter, Arasemie Yew 20732006 Wieignted Awernge (GWA) of 3 22. Throughout “The siudect has companied a fad of 100 acadernic wns witn Geverat ‘complied wit a8 uriceraty reguaations and pared of ewalrvart, Mchasi has mattiaines goo acacers ving sO M28 reqakenns “The Omtce of tre Rogier contiems thai Micra has #1 DENSI tabereiory (een, oF ines tewacish pecomtaniies, At umversty Srocmety, and accented for ae vf Detaber 28, 2023 chipatins ta the urwverhy wchatny ineary fees, maneriats, and equament has been day reared Furmermere, te stud ha Po ebversiy s Code at Startent Cone ane ‘a conten e Honore Dasweat in mand ae reat de stort fer persona an fey orcerslanset ana ‘be used fer any tent parpone excagt ae a form of erties. anand tie 25 day ot Noweraber, 2025 8 Baguio, Bargunt, Reputlec of the PrCE nes"
    },
    {
        "image": "honorabledismissal2_synth_3_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "UNIVERSITY OF BAGUIO College of “et: (034) 500 4967 Ema: unives Business Administration {187 Mabini Road, Baguio, Benguet ityotbaguo edu oh HONORABLE DISMISSAL ‘To Whom It May Concern: TO WHOM IT MAY CONCERN: “This isto certify that Ml University of Baguio, College of Semester, Academic Year 2021 2022 “The student has completed a total of 1 period of enrolment, Michael requirements. “The Office of the Registrar c' laboratory fees, of other financial acc ‘and accounted for as of October 26, Furthermore, the s university s Code of tssued this 25 day of November, 2023 at ICHAEL M. CUNNINGHAM, ‘Business Administration, vent First Semester, Academic Year 2023 has maintained good academic st ‘onfims that Michael nas no pending student has no pending discipinary °: ‘Student Conduct and Discipline, The st tuber 2021 87242, was a regularly ened ‘Student N Ipetor of Science in Information Ted! 100 academic units with ‘ountabiities. Al university Property, 2023. ‘Baguio, Benguet, Repubsc ofthe PBPPES: ‘or. michae! Smith Registrar student of Jnnology from First Pho."
    },
    {
        "image": "honorabledismissal2_synth_3_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "UNIVERSITY OF BAGUIO College of Business Administration 187 Mabe Road, Baguo, Benguet ‘Tet (034) 500 4367 Emat unverstyoteqvo eds ph HONORABLE DISMISSAL To Whom It May Concem: TO WHOM IT MAY CONCERN: ‘This isto certty that MICHAEL M. CUNNINGHAM, Student Number 2021 87242, was a regularly enroled student of Unwversty of Baguo, Colege of Business Administration, taking up Bachelor of Science in Information Technology trom Frst ‘Semester, Academic Year 2021 2022 unti Frst Semester, Academic Year 2023 2024. ‘The student has completed a total of 100 academic unts with a General Weighted Average (GWA) of 322. Throughout the erg of enrolment, Michae! has mantaned good academe standing and has compled wih all uwersty requstons and requrements, ‘The Offce of the Regatrar confirms that Michael! has no pending cbigatons to the unwersty nckding lorary tres, laboratory fees, or other francial accountabittes. Al universty property, material, and equpment have been duly returned ‘and accounted for as of October 26, 2023. Furtermore, the student has no pending dacpinary cases and has conducted themseWves mn accordance win the rwersty s Code of Student Conduct and Dacipine The student s leaving the msttuton n honorable standing ‘The certficaton of Honorable Damssals saved at he request of he student for personal and famdy crcumstances. It may ‘be used for any lawl purpose except as a form of wentficaton. Issued ths 25 day of November, 2023 at Baguo, Benguet, Repubic of the Phippnes. Dr. Michael Smith, Ph D. Registrar"
    },
    {
        "image": "honorabledismissal2_synth_3_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "UNIVERSITY OF BAGUIG lege of Business Administration 18\" Manes Road, Ragu, B ue Beds HONORABLE DISMISSAL Vhom Et May Cencen: YO WHOM IT Muay CONCERN AT242, wan a agus enrabed student of sation Technology fom Fist that MICHARL Wi, CUNDINGHARS, lege of Bowers kame Year 2921 2022 cota East “Ths is to cert riveraty of Baas 22 Tinasgthet ie fy teauiations ang oe staggne nas oom a Init oF paei hae mainawed parent of enrotinang,§ Fenuicements Tae Oftz9 ol ine Pagatier confeme thst bigatons to ne iavvensty mrckadiey Uorary fi nse bees diy senarren vse! has no pening ities A urwasinty pronety, meterals, and eau’ ascipinary cases at has corte themsewes ih aveorcance wth rs Disco, Vise ater leave the instiutor m henatabie sang iisation of Honorable Disses a Student for perscnal ane famnly 28ers any bani purpose excent as a for of serticaten, Issued fe 25 gay of avert, 2073 at Baga, Benguet, Reouib of the Pigpines, Dy. Michael Sots, PRO. Registrar"
    },
    {
        "image": "honorabledismissal2_synth_3_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "UNIVERSITY OF BAGUIO College of Business Administration 1187 Mabini Road, Baguio, Benguet “re (094) 590 4367 Emat universtyofbaguiog edu Ph HONORABLE DISMISSAL ‘To Whom It May Concern: ‘To WHOM IT MAY CONCERN: “This to certy that MICHAEL M. CUNNINGHAM, Student Numbet 2021 87242, was a regularly enrolled student of Unnersty of Baguio, Colege of Business Administration, ‘of Science in Information Technology from First Semester, Academic Year 2021 2022 untl Fi total of 100 academic unis with a General maintained good academic standing and Weighted Average (GWA) of 3 22. Throughout the thas complied wth alluniversty regulations and “The Office ofthe Registrar confirms that Michael has no pending cre ctor tees, or ober trancil ccountabies, Al unversty Prope: ‘and accounted for as of October 26, 2023. has no pending discipinary cases and has c igine. The student s leaving Furthermore, the student Jonducted themselves in accordance withthe university s Code of Student Conduct and Disc the instution in honorable standing. “This cerfication of Honorable Dismissalis issued at the request of De student for personal and be used for any lawful purpose except as a form of Kentication ember, 2023 at Baguio, Benguet, Repubte of the Phippnes amily circumstances. It may Issued this 25 day of Nov br. Michael Smith, PhD Registrar"
    },
    {
        "image": "honorabledismissal2_synth_4_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "HONORABLE DISMISSAL To Whom ft Mav Con"
    },
    {
        "image": "honorabledismissal2_synth_4_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "CAGAYAN DE o SRO STATE UNIVERSITy College of Engineering ang Technology S86 Dei Par Sioet, Cenayan de Ove, team Ter (074 ara Birt ceseyacoeemsiateuniversay ge HONORABLE DISMISSAL ‘Pe Whoo ft May Conese TO Wont pany SONCERIY Tit certty mal JUSTIN WELLS Staci duets 200 9 SWts Uinverty, Cotge SMB, wae e reg bf Eagweering aot enishen shident of Gavyayan de Ore Teeny, takes im Bachar of Seamey n Comps Scie Seisoster, Aeasemic vear 2024 2909 on Senso Sen eo bras Fig ‘a DO. x24, The stusert hes ccm ee, sith 59 ecninmis we wth 3 Sener Wee Aesiage (WN) of2 8, Throvahout the Perse feted, Susu hae mazisted gon eRSeme stant ane tae rep wemanis, “© Conca win af umiversay regulates ane ‘The Oise ofthe ay fons, se ther eco tae 98 ES contions that Agee ss ne pening Dourdatiies Wr university peony of Decanter otSigaicas fo he un eter, and endinent stg Ubrary tes, abovatory awe been, Sky rekeriee ane, Farthermote he stadeot has no sande, Tce a8 35 Nas conta inercahies ace unbieraiy s Cou of Seaton rs povine The suaar ‘OAR we PRE onthe «mcrae sian Zw re Fcation of NenorsahyDismisalis td ioe TSQUESt OF the sindact Re banstee te another nation. may be ‘rsd Re any et pevzcse exraye ae 4 form ofan, ‘eee eS tty ot Desernber 204 at cago an 85 Ora, Mitams Ockactne, Repaite of the Pinos."
    },
    {
        "image": "honorabledismissal2_synth_4_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "CAGAYAN DE OR! STATE UNIVERSITY Cotege of Engineering ang Tachnoloay sig, inns rani 950 bot Phe Se ces (075) 97D 2622 owe cagayanseoremainunicernidet es HONORABLE DISMISSAL To Whom it May Concem: yo WOM HT May CONCER ‘than w catty fat AUSTIN 2 WELLS. Son tharber 27 850, waa a regis eres stadt a Casin e 219 Neen eon cetage of Engneerng end Teenrakopy aking up Sauer of Sewnee w Computes sence Ha T St Senentes, Rewseme Yet 20212 oe, deabrtie VO 2OGEGA Seneca! Waightes| Average (EWS) of LS Throughoal he led ws ab univeesty regpnatons ME facies haa socnplatnd 2 tata! ie maivanived goed aeaceenie xtaceig ard MAA CON eres of emveament, Junte has regurerets nos no soning obigations tothe wnaredy ekg teary tines, box atery ‘The Ofte of the Peystrar onetemns th [At yrovecsy ptonmrty. materia, aed eriapnent Nave Dew Sul reamed Ae fees, oF hes fearreu accoumtaniios scvounteg for 28 ot Decemninr 16, 1024 eosin scpina y Cask 3nd hea consutied themeaives mn ancondiven ete Fuiraamere, te sta ng Easing, The studeet i feavng the natution 6 Penorable staring esnornay s Goce of 3 +s cuiicatie of Honorable Gasrensat sxund atte vequnst of toe shusent for tanta to anodar natteton Looe for any feats pone mata se 9 from of mericston sanues ie 15 day of Beecemnbae, 2022 at Cagsyen de Gro, Mears Crier, Repu: oF the Pigines ark Wh Registrar"
    },
    {
        "image": "honorabledismissal2_synth_4_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "CAGAYAN DE ORO STATE UNIVERSITY Eintt cageyandeorestainunicenzyiiedy gh HONORABLE DYSMISSAL Po Whos ft May Concem YO WNOHS IT tiny coNCERN [eb a cetty thet JUSTIN 1, WEES, Stone reaniee 2091. ‘Steve necaresy, Coe 8, We 8 cexrlary sere shutient of Gagner Ge ee of Rminerg ar Vacheatoy, taking wp Bachoky of Seems Compute Seen tom Fest Seiten, Reaaie Year I. 2222 weBh Second Seman Sears Yaar 2023 2108 {he Bien hss compton ot of 53 eaten wn vith Seswral Weigend Average (SYA 0128 Tieouprous to Ree RTT, Suxtn rae miahwanad ed acactese stmcen ose se rousiteenente RONG wth at unicarsity egualico and The Oftce of thw Rais fe08, or obe tsnula aceite chiens tothe oniveeaty tet ag Baran foes, abate Rasecate, ant ecuipniant Mave: ‘oan Suly carne anes coated he no wanting Seciptary caves ent Nox condocing thecceshves in accerdnce sith he Setar’ Onde et Stsone Condo: and itn The ete ‘8 leaving tie station honsvsite stencing, Fe tse 0 Hrearati Detainee st pe see NOB Stover tr rane er i anther cet, may be MOEN 07 ier wapeoe exceet on v lam ch cartteem, Mewes tis 1S day of Decenber, 309 et cseavm ge Ore, amis rental Reputie ote Phubieéons Dir. Bark Wtthame, OA Registrar"
    },
    {
        "image": "honorabledismissal2_synth_4_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "CAGAYAN DE ORO STATE UNIVERSITY College of Engineering and Technology 980 Dei Piar Street, Cagayan de Oro, Misamis Oriental Tel (074) 675 2423 Emai cage ndeorostateunversty edu ph HONORABLE DISMISSAL To Whom It May Concern TO WHOM IT MAY CONCERN, This s to certty that JUSTIN J. WELLS, Student Number State University, Colege of Engineerin ‘Semester, Academic Year 2021 2022 2021 58348, was a regulary enrolled student of Cagayan de Oro 19 and Technology, taking up Bachelor of Science in Computer Science from Fret Lunt Second Semester, Academic Year 2023 2024, accounted for as of December 10, 2023 Furthermore, the student has no pending disci University s Code of Student Conduct and bis: 'ssved ths 15 day of December, 2023 at Cagayan de Oro, Misamis Oriental Republe ofthe Philppines, Dr. Mark Wiliams, OPA Registrar"
    },
    {
        "image": "honorabledismissal2_synth_5_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "MANILA CITy COLLEGE of Als ana 5, HONO RABLP DISMISSAL To Whom ff May Concer To WHOM T aay Registrar"
    },
    {
        "image": "honorabledismissal2_synth_5_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "MANILA CITY COLLEGE College of Arts and Sciences 873 Real Avenue, Manda, Metro Manta Tet (034) 225 1080 Emat: mandacsycotege @ledu ph HONORABLE DISMISSAL To Whom It May Concem: TO WHOM IT MAY CONCERN: ‘This isto certty that SHELLEY D. LOPEZ, Student Number 2021 18670, was a regulary enrolled student of Manda City College, Cotege of Arts and Sciences, taking up Bachelor of Arts in Psychology from Fist Semester, Academic Year 2020 2021 untl Second Semester, Academic Year 2023 2024, ‘The student has completed a total of 140 academic units with a General Weighted Average (GWA) of 234. Throughout the period of enrolment, Shelley has maintained good academic standing and has compled with al unversity reguiatons and requirements. The Office of the Registrar confirms that Sheley has no pending obligations to the university chiding Wexary fines, laboratory fees, or other financial accountabates. Al universty property, materials, and equipment have been duty retuined and ‘accounted for as of November 11, 2023 Furthermore, the student has no pending discipinary cases and has conducted themselves in accordance with the Lunwversty s Code of Student Conduct and Discipine. The student is leaving the insttuton in honorable standing, ‘This certification of Honorable Dismissal is issued atthe request ofthe student for transfer to another msttutlon It may be used for any lawful purpose except as a form of wentfcation, Issued thes 23 day of November, 2023 at Mania, Metro Mania, Repubic ofthe Phippines. Prof. Thomas Davila, DPA Registrar"
    },
    {
        "image": "honorabledismissal2_synth_5_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "MANILA CITY COLLEGE Coltege of Ars and Sciences: 573 Rizm Avene, Mart, tebo Warde Tet 24) 225 1006 Great mentnchycctepe eda oo HONORABLE DISMISSAL To Whoni It May Concem: TO WHOM IT MAY CONCERN: Tine 9 to Cersty hat SHELLEY D. /.OPEZ, Stacent Number 2971 19870, waa a regurly enrotnt sucant of Marte Cay Catege, Catepe of Acts and Semnices, Wing Up Baciats cf Arte in Paychaiogy tree First Samweier, Acadian Vou 2000 2024 unit Second Semester, Acanis Viner 2003 2626, ‘The ctudere nn composed a tebe of 160 academic unix with a Generm Wieghted Average (C3ViA) of 2 36, Theoughont he Deri of menbment, Sheley hws mantines good scadene: standing and tan cempted wih a6 univorely ragesetnns ans renames ‘The Offce 01 ie Recintea contrins Bt Sheimy rae ne pening obigations to tee unverety Mching Rerary tows, ator ator 1228, or ier franca acccumiahtton, AX ueavernty property, materials, ant aqupmert nave boen ckiy retuned anc accounted he as ef November 11, 2023, Furtrecmore, Cvs ubatent har ro perdi Ghviptoary canes 2a its conducied themaelves in acecrumce with he ‘erwerehy s Cove ct Shident Conduct and Decipine The shident i tava the methurion in honceabie aimcina, ‘Thee certtevton of Honcratis Damana i meund at he request of the edGent for Canales to anctner cetasion 3 may be weed tor ary vba surpane excent an a tenn of entiation, tesved ive £2 con of November, 2023 st Mant, Mave Hana, Repuste cf he Pitppines. Prof. Thornas Davita, DPA Registrar"
    },
    {
        "image": "honorabledismissal2_synth_5_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "MANILA Orry COLLEGE College of Aris ang 873 Rizal Avenie, 4 Sciences ans, Metes 980 Beat: mantactyeuteneded on Manta Fee 34) 22 HONORABLE DISMIAS4), To Whous it Mey Consem, To waiOR TT may Thies to cent that EFS. LOPEZ, Stsdont Humber 2004 Soke, Cotes of Acts ane Salences, aking up Bachelor of Arts nit Seon Samrester, Acaiienc Yess 2023 2008, 2 Cemuby excotees Ser ehceey Rom Feat Semaries Bette Yaar 2s SCenH hes coated atta ot tat acadimy: a Berind of sneatmeny, 2 Benorat aig Sitley fs mainte gone, Fequterents teal erage sway ‘SoA Standing grat han 12 34, Theat the Conan oth at UnErsiy cemutstons and fs thal Shetey hag iain, oF Neve 9 other finance! ao aoeniied tor a sapere haye Bry fos, Isboatery materia, an ‘een aly ered acy ete of sara UeLeie ony tev ou ies ir sue at the SkSeEt as a foem of ident es te 23 dey oF Now serter te ante te anther aes fomay be i 2023 et Kents, thesis Marta, Resmi oF he Preis Prot Tromas Davis, oA, Registrar"
    },
    {
        "image": "honorabledismissal2_synth_5_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "MANILA CITY COLLEGE College of Arts and Sciences 873 Real Avenve, Manta, Met Mana ‘Tet (034) 225 1080 Ema mantactycotege edu ph HONORABLE DISMISSAL To Whom It May Concem: ‘TO WHOM IT MAY CONCERN: ‘This isto certty that SHELLEY D. LOPEZ, Student Number 2021 18670, was a regutarly enroled student of Mania Cty College, Colege of Arts and Sciences, taking up Bachelor of Arts in Psychology trom First Semester, Academic Year ‘2020 2021 untl Second Semester, Academic Year 2023 2026. ‘The student has completed a total of 140 academic unts with a General Weighted Average (GWA) of 234. Throughout the period of enrolment, Shetey has maintained good academic standing and has complied wih al universty regulations and requrements ‘The Office of the Registrar confirms that Shelley has no pending obligations to the university including Ibrary fines, laboratory fees, oF other tnancial accountabltes. Al universty property, materials, and equpment have been duty returned and ‘accounted for as of November 11, 2023. Furthermore, the student has no pending disciplinary cases and has conducted themselves in accordance with the university s Code of Student Conduct and Discipine. The student i leaving the insttuton in honorable standing. ‘This certification of Honorable Dismissal is issued at the request of the student for transfer to ancther institution. It may be used for any lawful purpose except as a form of Kentfication, Issued this 23 day of November, 2023 at Mania, Metro Mania, Repub of the Phitppines Prof. Thomas Davila, DPA Registrar"
    },
    {
        "image": "honorabledismissal2_synth_6_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "ZAMBOANGA CITY COLLEGE Cutlege of Educator 252 Quon Coulewses, Zameninge, Zemboayga oe! Sur “Tot (46) 744 7808 Bower santoongestessinge tac an RONGRABLE DISMISSAL Te Whom ik May Concene: ‘2 WHOM IT MAY CONCERN ‘Thiet to cetity fost ANGELA He, SPEARS, Sudene Number 207- Cy Cokege, Cosege of Seercatien, tuking up Sachets of Ckaventayy SVEO 2021 hit Fee! Semester, Acadian Yaa B2HI0Z4. TES aS raaiihety ervalad chalet A Banbangs, wen tha Fars Seevestar, Anacemie: Yes ‘The stsent nan comyited tated $18 acmteaie unde wah 2 Geneva Weapon Average SIMA} of rays tse ered cf anvatmens, dyes Rak meiamed grog acsiemic starting andl nan congas with Sk issieereny regulations ahs requirements ‘Tne Oion of he Regairae castes thas Angmis ms na pening Lbigathons ts be wcavonly chung Geary fines, aborstony (oat, oF ether taansist aovontatains, Al univaraty ctapery, meres, ai aQEmEt are heen sy ure ate accounted fev a9 of December 19, 2023, Ruthonrens, tne student nae no warding dieciplomy cases sea tas sonmuckd tnewaniees 5 scconlanee wit te vcaraty s Caste of Sortent Condit snd Tasclpinn, The whut ieevng the hainutinn i pomesaee atancing, ‘Tiss cartfcation of Honora Rieerienal ised at tha requact of fn gaatent ew fisencial consteaists. 8 may be used for iy iat paencae except as a for of tantfeatinn, tsi tes 34 day oF December, 292 at Zamboanga, Zamioanag dst Ser, Reptile ofthe Penne. 5 Cindy Huniee m9,"
    },
    {
        "image": "honorabledismissal2_synth_6_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "Te When ity TO RG OR a The 929 2021 cee Ths cartiicadion of ey St urs Tee, Anat Nae maine sous ZAMBOANGA crry COLLEGE Coliege oF Euucatien, 22 Ouezon Reaawyerg, 2 HONORAULE fay Conces: MAY COncEAN, Sottly that AEA Cotege, Coings oF 5a, try owen at t 4 parC Uinutes 5 Panes, msestae, ane PRY 2A809 3d Ney 0 SCINE, The atacand is tae hac Hons se Diamine, a ths raniseot EDSE PCO 8 toes te. Fitunston fem Fe M9 tie ita in Nenceany DISMISSAL 08 a restr exces gucnre oH Esmbsangy Streeter, Acaternn. Yar EOI Thrones te Stns sng fe ety heketens Serary tree, Roneatery RMI bse chy mentees acccrdsnece with typ"
    },
    {
        "image": "honorabledismissal2_synth_6_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "ZAMBOANGA CITY COLLEGE Snilege of Eaucanan 862 Quezon Rovievard, Zansxcanga, Dasbougn det Tet ass Sur 709 7809 Eat sutoangacivestagestest ph HONORABLE DISMISSAL ‘9 When It May fencer WHON TA NCES: ‘That i fo warty thai ANGEL. 14, SPEARS, Shatent Gy College, Cotte of Paucation, takeny us Bachelor 2ORGLG2t untt Fret Semester, Acadian $4188, was a regularly encstud stusane et tary Eswnabon tee Fi moana: satierk: Yee ‘The gkadant has conletee o tal of 143 aeadennis unt with a a Avaveos (GWA) oF 2 81, Thoughoct the cement NT Mae NAS Maines gone scacecne Canting snd tas Compa wih a uthvarsty teguante ne {te OBL ofthe Relea cotems that gta has no png chats to thw uvaraty Fretucing foray thes, sberateny fees. 2+ olner ancl accourlabiies. Ad umwvesety apery. mateizis, and pectrios ecouitod for a8 of December 19, 202% Furthermore, the stusont hae ‘ersty s Cove of Steen Forcing decpinary cases and hen corsusted thensen Comet and Diventine. The slunent eeving \"39 m accordance withthe the meseutow in rere otao Ths cendiication of Homscabie Tinmmisnal i ou oe at ee ree 2hiy Sal perpese acest as a fon of dont re Himay be uses for en, UG thie St day of December, 2023 al 2"
    },
    {
        "image": "honorabledismissal2_synth_6_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "ZAMBOANGA CITY COLLEGE Education: Zamboanga det Sur Cotege 682 Guazre Badevand, Zamomanga, ‘rat (934) 204 7008 Sma rarmcangucepategededs ch HONORABLE DISMISSAL ‘Te Whoa It May Concer Fo vescane IT Man for AN nent of Zamboanga ue, Acadesnic Ye MEANGELA M, SPEARS, Student! Rumoer ye of Eescation, tling up Bachelor of Bereentary Education trom Firat Sem Seales, Rearcmnie Year 2023 7024 hia st castty ‘ity Casiage, Cok 00 30: “The student hon comloted toialut 1158 aundsenic wits with a Generat Whighted Averiige (SWA) of 281. Tiwnughout the perint of croton, Arqels has maitaned good scadeni: stziing and Pas comple’ wih ab universty repdatina vi requeemente The Offoe 2 the Repisbar confenvs thet Agata haa no nending abiyatiars Lo the uieveretiy acluding ibcary fre, ‘eboratery ‘eso hes fais asccumtbiies. A antes ore, sari nt moe ave nee ty airing a cteraty s Cie coments, mny be ued for Tins certiscansn of Honorable Osmiceai ti lave tte request ot the ulus tor anc any teh purpone acest a form af Mention, lewed tes 21 day of Gecontha, 2023 at Zemntnanga, Zamboanga cet Suc, tepuisie af tee Pracines, Di. Cindy Hunter, PRD. Ragisrer"
    },
    {
        "image": "honorabledismissal2_synth_6_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "ZAMBOANGA CITY COLLEGE College of Education 1652 Quezon Boulevard, Zamboanga, Zamboanga del Sur ‘Tet (034) 704 7800 Emat: zamboangaciycotege edu ch HONORABLE DISMISSAL To Whom It May Concem: ‘TO WHOM IT MAY CONCERN: ‘This certfication of Honorable Dismissal is issued at the request t ofthe student for financial constraints, it may be used for ‘any lawful purpose except as a form of identfication, 'ssved this 31 day of December, 2023 at Zamboanga, Zamboanga del Sur, Repubie ofthe Phippnes Dr. Cindy Hunter, Ph D. Registrar"
    },
    {
        "image": "honorabledismissal2_synth_7_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "NEGROS OCCIDENTAL STATE UNIVERSITY College of Nursing 1301 Quezon Boulevard, Bacolod, Negros Occidental ‘et (035 325 0503 Emat: negrosoccentastateuniversty ieds Ph HONORABLE DISMISSAL To Whom It May Concer: To WHOM IT MAY CONCERN: ‘This isto certfy that JENNIFER ‘Occidental State University, Cotege of Nursing, ‘Academic Year 2021 2022 untl First Semester, tne student has completed a total of 95 academic uns wih a General ‘maintained good academic standing and has period of enrolment, Jennifer has requirements “The Office of the Registrar confirms that laboratory fees, or other ‘and accounted for as of Apri 20, 2025. Furthermore, the student has no pending ‘university s Code of Student Conduct and Discipine, “This certification of Honorable Dismissals iss J. FISHER, Student Number 2023 38976, was ancial accountabites. Al universty property, materas, disciplinary cases and has conducted regularly enroled student of Negros ocrg up Bachelor of Sclence n Compuler Science fom Fst Semesie ‘Academic Year 2025 2026. Weighted Average (GWA) of 223. Throughout the ‘complied wih all university regulations and themsetves in accordance with the “The student i leaving the insttution in honorable standing, ued atthe request ofthe student for fay relocation tmay be used for any lavful purpose except as form of kentfication Issued this 08 ay of May, 2025 at Bacolod, Negros Occidental, 1epubie of the Phappines. ‘Atty. Joshua Mason, LLM Registrar"
    },
    {
        "image": "honorabledismissal2_synth_7_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "DENTAL STATE College of Hursing 301 Quezon Bowevars, ed, Negros esis ter 38) 2 HONORABLE DISMISSAL, To Whom kt May Concern: To WHOM IT MAY CONCERN: Student Men iy, Cntege of Nurs, taking up Bschen 7 wut! Frat Setnester, Acadens thas e erin of envoy cequiremanis weed total of x, Jonmiler hes einisived cee anaceme stanng and hus vonaiet vl secountabiiee. ss university property, materials, ant quien ce university ine wwvetaty s Code sent paving baa mstivion fy herr abe standing lusful purpoae axceot vest ofthe shsdent for fanudy relocaban. lh may be used for any aiocmef utr Tasued tre 00 day of tay, 2025."
    },
    {
        "image": "honorabledismissal2_synth_7_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "NEGROS OCCIDENTAL STATE UNIVERSITY Cobege of tursin Sotevire Hacond Heyes Occ vert 321 ver Ve! (988) 928 0403 Emmet negerneseeninn tet vernfiee so HONORABLE DISMISSAL To Whom it Muy Couccm YOURMOM DT MAY CONCERN Ths a to contty mas JEUMIEES SF 8 roguiaet errcted Ocaeny sae Umer p kEG Ue Bacher of Scenne «1 Corman Aeadere: Year NUN. 002 ud Fest Semegler Academe Yar M56 ert of Heyes Scarce fom. Foot Se nectar, Toe sardent han comomtes a tat o! f ecaden Pred ed arccinent, cexrerents Wes WO 4 Geer Weeprinn Average (DNA) #2 23 Ts Nou (AEE 00D CSI eM A Se Bee Hhaeseg aN eIeeree) rogeeane are as cooroin ws as he ice ot he Rana conte the: Jeter hay ne MSF aN Met cr oar treat secret 28 Re ceartnt fon 98 26 AGRA Ze, Benary edsgaiuna lta cowersty er axing trary pte AL ROO sR, proper HARB, and aque ort have Meer Obty tener Futmermive, the tudor has no penton 4 SONOS) caNe9 AE NIN coeNcian Mensenen Acker Mee we the LONE Coan of Sader Contact ad Ducane {He suadent 3 wang bw metas onezaue Monn Ths cert snr of Henoeabe Dacre exe anus! 3 264 eocaet of the siuc Purnewe B1cer aS a etn oS arineater Hat Sanity recat, Neay be uted to any sued Pas 98 gay 2% at Recciad Negros Oonederia, Hep Aik ote Pricenee Joshua Mason. L!"
    },
    {
        "image": "honorabledismissal2_synth_7_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "NEGROS OCCIDENTAL STATE UNIVERSITY College of Nursing (20t Quezon Beamevero, Bucood, hegros Occedentzt Yat O99) 526 6903 Reet negresosents Gece HONGRABLE DISMISSAL To Whom It May Concem: TO WHOM IT MAY CONCERN: Tide tt cantly hat JENNIFER J. FISHER, Student Numer 2023 38978, wan veziary anced student of egies (Geegenial Stam Und eraty, Cotege of tuning, taking up achelor of Seannes bn Centaur Scianen teen Feet Samener, ‘enooeme Ven 2021 2022 unti First Sewmeter, Acacemé: Yeas 22 2026. ‘The shaders hax completed a toa of 5 academe unks wih General Weightes Average (GWA) 62 23. Theoughoet bee eros of ewutnent, Jeenter Due munteined goad scacaone SAND Sd as COMMA WAR aI tess) HeguStONS aed reaurements, ‘The OFfc# of he Renatrar contyms fut Jenner Nes no pening ublgitinns tothe urberaty mebvSeig bear hows, (abe ctory tots, or other france accomtahtons, Ab urverety property, materials, and aqabreent have Leen diy rebuet and accounted toe a8 of Acr4 20, 2025. Furrarone, the atudeni hee ro pending duicitnary casey and has coranucied thawelves in accordance wih ane Lawvacahy Code of Seater: Conduct and Dacpine. The siusent i leaving fie ination i hencvatie etancing ‘The certicaten ot Monovabte Denar inausd at te request of re stuart for tardy rancor. may be waea tor any eat persone except an a trea of daetticaton ewes tts 09 tay of May, 2025 a Bucoind Negros Occidencal, Reputie cf me PNtoBNES. ‘Alty. Joshua Mason, LLM Registrar"
    },
    {
        "image": "honorabledismissal2_synth_7_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "OER iseR o: Coden 2 tera 5 Pott nge (Na ot 2 PO Sem gte wie at cower, re 088 dean oe cet, MOY mee cine, Nam scourcacom PE account Oe 5 Sem er mtn SC Ome 28 ty of Mts"
    },
    {
        "image": "honorabledismissal2_synth_8_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "SAN DEL NORTE STATE UNIVERSITY College of Nursing 26s peas Avenue, Butuan, Agusan dei Norte mat nqusancenonestatasre ty Gea oP AGU! ror (84) 598 1040 HONORABLE DISMISSAL To Whom It May Concem: TO WHOM IT MAY CONCERN joked student of Agusan det Norte 28611, was a reguary ene ‘Semester, Academe Year ‘student Number 2022: ation trom Second Bachelor of Elementary Bove! General Wegptes Average (GWA) of 292 Throushon 18 academe unts win 8 erroke wih ab raversty requatns 3nd ‘The student nas comets 2 tata of 62 (good academe standing and has ered of enrolment, Ern has mantanes tequrements aoa ne nen tra Pate 9 a tworatory Wren ar oer trance accountapaces, AL Unvers ty PrOPeY maerais, and equpment nave Been Gy 'eRZTeS aS ‘accounted for a of March 02, 2024 has no pendng aaceanary cases ‘conauct and Daceine The student s Weaved ued at ne request ofthe student fr fart nd nas conducted hemsewes n accordance ## Me Furmermore, the student he nsttuton n honorable stand, unwersty s Code of Student feccaton Mmay be used for any"
    },
    {
        "image": "honorabledismissal2_synth_8_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "AGUSAN DEL NORTE STATE UNIVERSITY Ccotege of tursing 35 Rew svar Bubuer, Agusan ge Nore nec tare NyBEC BM tes Oba, $35 1248 Ema gaye» HONORABLE DISMISSAL To Whoru tt May Concom: TC AOA IT MAY CONCERN sem feather 2322 BK6' Yes a roeaany envoted etooen of Agana weitere Tras to ety Mat EPI FOOLING, 5 tom Seren Semester Academe (22: ite Urwe sty, Cote? ef HUENG, “akieG up Bacrene ct Benawan 2 Seraster, Acsderse Yeas 1M 2007 rt See The ehdent has comeltins en off academe ints wth a Lene: a Meeamien Average GWA: G29: Throvgneut me Dervat ct enrcaret, E57 Res BRTAEE GRR Ser NC MARSING 1nd Nae GteTckec Wm AT uversay FEUD eoutecns Te Gitce of me Reps as esetioon at Ene Dan no penning sbageltons 12 ihe vers NEERING Mary tees ake Cuperty aleraS. ont Reacira t nave Seer day eturnes aA! trea accountants Hane Fan of March C2, BO tet eet nas sermon tienen ae coraente a Ihe Foemrmec, te Hucent line i tanding uscetmary cal es Uetowady s Cece ot Sagent Cangvet ans Decgane The sate nayy he UME f henorane stand, Darwntat e asced ate request of oe abment to tary felocaoar ray be Utes fue By cnet aette tee pens ther atu prpene ay vest as 6 nace thea OF ny ot Mare, 2"
    },
    {
        "image": "honorabledismissal2_synth_8_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "AGUSAN DEL NORTE STATE UNIVERSITY ‘Coliege of Nursing 205 Rae avenue Buen, Aepsar dot Newie 1846 Bouck agusandeteitentateu sarsiyBedugh HONORABLE DISHTISSAL, Te Whom fi May Concem: TO WHOM IT MAY cones Sto cery Hat SRNR. State itveraty, ma DOLLINE, Stent Hunter 2 etoge of Nureng, tcng up Bastele 9 Wilt Seeond Saiowster, Academe Vea 2 C2 BRON, wae a remsiorly enratee sticent af Aguas de! Morte of Elementary Chueation fiom Second Semacien. Academe Yeoe ve Fis shident hts comptes a etatot 7 sna: one with 2 Genera Waited farce tna 8 2 92, pinios 0 ex oer Er hae ciniahed goon acadense stating are has cored vot v4 inher 2 rogues, Taroogtout the putes are Tie Ofte othe Regisicar coats that has oer ctagotin to toe um Uo2s, u utes tarsi aceoutatking, AB wnieay property, seats SOSA UnERG for as of Haren 22, 2028, roy ticking time tos, owatory ats doa agrarian have Been duty Furttermare, the sosaont ha ‘eiunisii s Cesie of Stxtent Bending daciponary cases and nave contacted themeen, wantuct and Gsepine The student sf aecoriaone wth the 8 eens the matter in heruvabie sine, ‘Ths cevtticaton of Honarable Disrieasl& iasuard the request of the wtudent tor famty reoeation, may Se ws ore murgase excent a2 afore of Kanttination Issues ti O7 63y of Mar 34 st Boswer, Agunan det Nore, Seputie of he Phere, Atty Brent Sanchez, 8 8"
    },
    {
        "image": "honorabledismissal2_synth_8_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "AGUSAN DEL. NORTE STATE UNIVERSITy Cotege of Hursing SFE RG Aver, Bute, Aman “at erty tm SOMBIE Seat apse ceranetticmvennrpesege HONORABLE DISMISSAL"
    },
    {
        "image": "honorabledismissal2_synth_8_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "AGUSAN DEL NORTE STATE UNIVERSITY College of Nursing (805 Raw Avenue Butuan, Agusan det Norte ‘Tot (054) 955 1048 Emat aguaandemoneststeuniersty edy ph HONORABLE DISMISSAL"
    },
    {
        "image": "honorabledismissal2_synth_9_aug1.png",
        "label": "honorabledismissal",
        "ocr_text": "DUMAGUETE CITY COLL Graduate S09! osuate, Negron Oriental 2) Batacis Stent, Ds as quagH497 2143 1 Zook Guiragvereoteatepe gets oh PONORABLE DISMISSAL To Wham ft May Concern: FAY COCHIN yO HON cevseting steer of Ouenasee CA ie Your sect tut ANY, WALA, St Rane 2022 56080, wa POE cores Seeninster Motsier vont, vecnig up Bachelor of Clereactary Erarcaton tat 3a 208 Cotes, Cracksate lange Seven Semester, Arado g Gover Wigted Average (GHA) of 3 24, Trevegeont BS mpd eth ak urbvarody regusatane St 18 meson 8S vest geacienis winawing ws MG equrorcents sane Sce of te Ragin cotta at Ban 168 0 Bei PASI ON nie Free er aber Hegre acuunkeDitns, AL UNTeESY PIODENY, THES ‘an expsproent NaS ‘encgurian fot as of Sul 27, 24 ut he rasan i toate abie TONES. eecspinacy eases aid as conan tremaaies ASS Ja, the snitent has 1 pending ing, The atoent 2G SH Parka Siudent Conduct ane DG! oweranye Code hesits and masicol reacons may CC the erent ove eesteabn of Monae teicest is sound ta renee sre ter arn sani carpess sacentis 2 frm of AerREEDESS aguets togroe Cental, Feqai of hs PIAS sescnns Gus 21 ay of Esa, 2624 at Ds Haydon, LLM or. sto Registea"
    },
    {
        "image": "honorabledismissal2_synth_9_aug2.png",
        "label": "honorabledismissal",
        "ocr_text": "DUMAGUETE CITY COLLE! Graduate Schoo! 0 Steel, 1 HONORABLE DISMISSAL Te Whom it May Concer: TOVROM IT MAY ©) a tod Averuye (GWA) off 4 ah al ureversity The Otfee ot 2, oF et or se of Fucnes ine otuoent has 19 Be uawerstys Code of Stsdent “Thig cartlcation of Honanatie Damnsals eguce ot the request ofthe alustant used fae any fav xcept 3 oes of itentietin, Dureaguiate, Negiow Oriente, Republi of the Phibovines Hayden, LLM Registrar"
    },
    {
        "image": "honorabledismissal2_synth_9_aug3.png",
        "label": "honorabledismissal",
        "ocr_text": "DUMAGUETE CITY COLLEGE Graduate School £851 Bontacio Street, Dumaguete, Negros Oriental ‘Tet (045) 467 6143 Ema dumaguetectycotege edu ph HONORABLE DISMISSAL To Whom It May Concem: ‘TO WHOM IT MAY CONCERN: ‘This i to certty that RANDY W. WALL, Student Number 2022 55060, was a regulary enroed student of Dumaguete Cty CColege, Graduate School taking up Bachelor of Eementary Eaucaton trom Second Semester, Academe Year 2020 2021 ntl Second Semester, Academe Year 2024 2025. ‘The student has completed a total of 102 academic uns with a General Weighted Average (GWA) of 3 34. Throughout the period of enrolment, Randy has maintained good academic standing and has compled wih all university regulations and requrements ‘The Offce of the Registrar confirms that Randy has no pending obigations to the university including Ibrary fnes, laboratory fees, oF other tnancial accountabates. Al universty property, materais, and equpment have been duty returned and ‘accounted for a8 of July 27, 2024, Furthermore, the student has no pending dscipinary cases and has conducted themselves in accordance with the university s Code of Student Conduct and Dscipine. The student i leaving the insttuton in honorable standing. ‘This certification of Honorable Dismissal is issued at the request of the student for heath and medical reasons. It may be used for any lawful purpose except as a form of Kentficaton, Issued this 23 day of August, 2024 at Dumaguete, Negros Oriental, Repubic of the Phitppines Dr. Madison Hayden, LLM Registrar"
    },
    {
        "image": "honorabledismissal2_synth_9_aug4.png",
        "label": "honorabledismissal",
        "ocr_text": "DUMAGUETE CITY COLLEGE Graduate Schoo! 851 Bonifacio Street, Dumaguete, Negros Oriental Tet: (045) 487 0143 Emat: dumaguetectycotege edu ph HONORABLE DISMISSAL To Whom It May Concern: ‘TO WHOM IT MAY CONCERN: ‘The fo certly that RANDY W. WALL, Student Number 2022 55060, was a regulary enroed student of Dumaguete Cy Cotege, Graduate Schoo, taking up Bachelor of Elementary Education from Second Semester, Academic Year 2020 2021 ‘ntl Second Semester, Academic Year 2024 2025. ‘The student has completed a total of 102 academic units with a General Weighted Average (GWA) of 3 34, Throughout the period of enrolment, Randy has maintained good academic standing and has complied with al university reguiations and fees, or other francial accountabities. Al university property, materials, and equipment have been duly returned and ‘accounted for as of July 27, 2024. Furthermore, the student has no pending dscipinary cases and has conducted themselves in accordance with the ‘nversiy’® Code of Student Conduct and Discipne. The students leaving the insttution in honorable standing ‘This certification of Honorable Dismissal is issued at the request: used for any lawful purpose except as a form of Kentication. Issued this 23 day of August, 2024 at Dumaguete, Negros Oriental, Republic of the Phitppines, ‘of the student for health and medical reasons. It may be Dr. Madison Hayden, LLM Registrar"
    },
    {
        "image": "honorabledismissal2_synth_9_aug5.png",
        "label": "honorabledismissal",
        "ocr_text": "DUMAGUETE CITY COLLEGE Graguate Schoo! teks Steet, Comagunte, Nowes Orient: ns (Dany 487 4549 Eau aumaqowtenvontagnie: HONORABLE DISMISSAL ‘To Whora 8 May Concern: “To WHOM £T Nay CONSERH eA SSTae. wae 2 reas) covsbed shatent of Cumacquane CRY “Tris ete cartfy tat RANDY Ye WALL, Staton Phen! ee frome Sanceed Serrnete, Recast: Yast 20 A0z4 stage, Graduate Sohne! taking up Bachar sf Bemeetary EAs sath Seen Semeotss, Academie Year 2035 2825, 1 cadens era wide 2 Cenetid Weighted Azraga (GWA) af $34, Throwgnout fe cere th a eeaesy regains ‘Tne stant hes competes» tata of 20 pore ak ervcinrent, Ray fas minted uve acareare: stanng ast he require. “Toe Ofine of te Rgtrar conn ha Raney as Hs ening agate to te utirray cto ay Se tepccatury ace been sely returned at nos, 12 spor Snarciah soctnwatsire AS ctaversay eopetty, marin, eo ecpeTent soecuttes for as of Suey 27, 2008 od Demenees w accantonce wh De n tonarniin sang. Lrtemne, he sadert tas co pena oacRinay cose Bret hae Cony ineveraty s Cons of Skatert Comat ans Dacine, the ehident in navi Rata seis cureation of Honeeable Diymlesalis tue ai tbe request ofthe ataGent fr neatn and medic aaa Fy te aes for acy baad purges except an 9 form of Menten esund tis 23 day of Ragest 20S wt Oueraguete, Negros Oren, Republic of he Pinkpones, naadtison Hayasn, LLM"
    }
]