[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "ipcr",
        "ocr_text": "Apes, erent area eae AS ooo i Eg (Cuepnvinuas PERFORMANCE COMAETRENT Avo REVIEW [INBANBUAL PERFORMANCS CO wmcmes Tat H H i eet Tranyphout 12 Peng Hees nemuarcengesattt cremmamengimmnpericint || i canacicompsmavme fp Lt ee 1 i i i i j } 1 | iH i"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "ipcr",
        "ocr_text": "poe tna | ANDIIOUAL PERFORMANCE COMMITMENT AND REVIEW T wewroaaeaiice } visiam “meacarons acne [ores mae oniecsives toarane ser x84 Seen, estas i 1 i integrate | fectongeae i ‘S a i 1 Oey inaoim|"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "ipcr",
        "ocr_text": "fee. [INDIVIDUAL PERFORMANCE COMMITMENT AND REVIEW Sc Tama of Employee Fak vost Narir of Raios woke amc Posto “asinmectnnis Poston sae tesa Dison Sent Dave ofeview: Augusta 218 Rating Period Sil Yeu 202 2009 ‘PLANNING “EVALUATION PERFORMING ae wage \"wowvons cron wor xmas onsecrves rmeune pereea| (ava jeer, ests a] e |r] ave soon == mee Bick os sfafafa |. Tregrou on woe ane Twotecidogyansed cane qo etmamig sindatine \"goss ‘hsigatgns oe See ey Twogpet iiggetg 202 nce ese GRt80 ant guedt tem od tot a Re oa QRNSRS Bt aera ee, ‘Bahan."
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "ipcr",
        "ocr_text": "— ae ©) ann J Cac Raeptog tne. Marat nee roster saw eetenans Dae of Review Aint. S128 __ beat____. i 4 PE yd 4 | } 4 iy t | pot ot Lup | HH 1s ; 4 re eee | | | i | iti Ls"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "ipcr",
        "ocr_text": "—— Bw INDIVIDUAL PERFORMANCE COMMITMENT AND REVIEW Name of Employ. ee Frank Vincent ‘Name of Rater Raw ostion: Ses rotesona f na eee Dee aermmin as Period School Year 2022 2013 EVAKURTTON— [eatin es Actua, (Quotty Efkiency, m sir i i thats], a sad froo tea Simulations “ag Ord nasssaanasmuas coy AL. Throughout Ad, ee sirginamng |, Dgtzed at midterm and som) ‘Sagsenm omens mise mmaradireniicts, xm atone tang te AS soa,"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "ipcr",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "ipcr",
        "ocr_text": "—Femande Taylor Engneet, mang 112 2007 | aoe ot Ra Posipon Date of Review: Septerbet comet Setar soeasoomet mopanteistrmtretten’ oie BEES | A eo. eit \"Eas } | | an | syap art narng, | SHOE Rando AQUI ORES EI"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "ipcr",
        "ocr_text": "5 _ SibevuaL BERS ORMANCE SGMMTIMENT AND REVIEW “I —-rormrateneecrazemeneminmeed ate of Kovien arenes aati ye jeorgramiers | i AES i ES t cee i i H i | i i j i H i | ' | rreygnne | agsages jek boes |"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "ipcr",
        "ocr_text": "Name of Employee __onanan Darna Name of Rater Femando Tayor Poabon, —Enainens noier _ Ponton Ergnee: mona Division: Sane [Date of Review: September 12 2007 Rating Period ‘School Your 2008 1098 PANNING VALUATION 4 PERFORMANCE maine. Weight INOKATORS AcTUAL fF] waros xmas Onmcrives TaMELINE per eRA| (Ovo, Kifer, RESTS a] e |r| aw scone 7 Bey 2. TSS a See ‘pescnaton by ny a als a |e soe Ee FES teararermsass. it"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "ipcr",
        "ocr_text": "| restacpon Sedan > weight TIMELINE per KRA | seapue 228 | SeeeRe mando Tayor Engineer ming September 12 2007 PERFORWANCE INDICATORS ovat, effexor emeuones momeremngtyes? Bata a ae syst arenas, au coups cpar vcr a ge, guonsemimsess oat WEE ORE Neat oso"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "ipcr",
        "ocr_text": "_ Tame of Employer Ponibon: Division renod taangrenet _ —— wwros KRM"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "ipcr",
        "ocr_text": "4 Vamvinuar erarcamance COATT ENT ARG ARVIEW 7 te ee ee BETS | Pegeyess jeadlbnn i i lalsdais jal i i i i. ‘an on oe ne i i egaratsoe Speier | i fo } 1 LORRY BESS Ressacs i an i | partion ech Se SSS ee Pag 14 \\ D4 Paty i i if i Adda i i | to i i | fom i fetojals ba) t i 1 bse { cnpesion. pwsenuating: earcneue fF of pf H i i i 1 sotbeck PE Ed GG 1 y i"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "ipcr",
        "ocr_text": "Name af Eplape Joton, Ge Name of ie Paton kay Position: Engineer chemical Position: Conmunty xs omer Division: ——Gavite ____ Date of Review: September 18 2010 Rating Period ‘School Year 1976 1996 PLANNING EVALUATION Fenronaanee Tag weir \"nowarors actuat vwros unas onucrves rameune perma (cmt terry resus |e |r| ave scone Tonnes 2% sisjzls 4 esate pone Fr esearcr poe ncn for ee , MERE Throughout t alals 5 oe, ale fazgpsion teneinees eon esearch eatonaum wih poste teebaa"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "ipcr",
        "ocr_text": "fa, -———_ ____________ pain fers we 4 a | INDIVIDUAL BERFORMANGE CORMMITHERT AND REVIEW | Sighs pen owes Maar puguton nw tae neekat pus Gears,"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "ipcr",
        "ocr_text": "‘Name of Employas Position: Division: INDICATORS (Quoity, fen, Tienes) seco hte: [opSetn Seesecuesr Seay peng IF sation cae accepeere sel eae Pee Gaston >|. “RRRE: Cronies: ena idm wb 3 Yetibac \"Poste"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "ipcr",
        "ocr_text": "} Pisano. PERFORMANSE COMMITMENT AND REWIEW [wont asus Someries mse serena esants fom | ' amngin | ! [ete ian i i i H i | ' 1 gente, ona even : ! i comet Stee 1 ainesinecommunivnwey | i of i | frewesrosang Wasetapons. | i i i i ad 4 | i i Pha ; Pt i i i padqd t i | |s SS Erieatiood"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "ipcr",
        "ocr_text": "ei, 4 INDIVIDUAL PERFORMANCE COMMITMENT AND REVIEW hs, Name of Eaploner catmine Bice ‘NameofRaiee tage an PLANNING WWALUATION PERORMNEE a ween \"oretTons Actua vweos xmas omsecnves rateune pertns (Qatyefccrs, nests a] e |r| ave scone so cottney conaet, Creston oae,| Twocuisacn pagans] oranced tug conpuntyiter ace Tua wegeaeee ge Comers wacorynay te eh eit a0 sen Toit lata fs ci, zeabbnze 1, petra wt ey sells oeemrtsnz saree ‘ia"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "ipcr",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "ipcr",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "ipcr",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "ipcr",
        "ocr_text": "@ [Sree comer ——] Name of Employee: _Sergio Watson _ “Name of Rater’ Exe Seria Position Position Ese oot Divison lesen Date of Review: —ostte 23 2009 Rating Perio Sheol Year 18 1976 PLANNING EVALUATION PERFORMANCE mane ween \"inowcrrons cunt ros xmas onxcrnes rweune pertta| (aim efor, resus a} |r| ave scone Tres a Fok Bane, a sfils a a iy Atsod giant SEE Parizpaton nino Atended tree potersona sete Satgpeome seretpinntsenc eran é speelOTES peas Throughout ae 4tata 5 1 Prag nger egos er =~ ae\" ca Eaten door roger a oetethes omsieseges Pretetins dere cs ease “"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "ipcr",
        "ocr_text": "ee i Es] | JUDRIDUAL PERFORMANCE COMMITMENT AND REVIEW Position ante agest rate of Revie Gabi 23 2309 araNe miaienTes warn wos OeNCTRS meat [awe HRA) (Qacits Liteon [EMC ecacone speciation ff |"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "ipcr",
        "ocr_text": "Satomi in tay BRAY Aterted tows gene Poy fod SSiayeg ASN || to} i i Besos ee : Pio i j pp bdod od I igiol pot Seremconot papay SSTETRI, erctatinasoamas Pd 4g ‘i Seana SH Saeco ones ii i i j H Pf { i if i H boi |"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "ipcr",
        "ocr_text": "a ip INDIVIDUAL PERFORMANCE COMMITMENT AND REVIEW ‘Name of Employee: Sesgo visteon “Name of Rater’ Eve Sobmiah. Position Booksale Position Estate agent Division lesb Date of Review: —Ostaber232000 Rating Period Shoal Year 1904 1070 PLANNING EVALUATION PERFORMANCE RATING weight |“ voicaroRs Actua saros ras onsecrives rimeune perkRa (Quay Efe, RESULTS a} e|+| ave scone ‘imeines) 41% ered 49% sfifila |e senate ay gay Partcpatonntwo Aanded tree profersiona! Trang poorame dewopmen seninrsreised 1 ssprovedsy SRD pelagooy. 49% af P igh Treggina 5 1 ccsue higher Completion of eee a28bn20 Errategin doctoral program aligned qiststons ‘oraduste studies ‘win academe speculation” late fo ‘eset dscpine"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "ipcr",
        "ocr_text": "Ee tragnsgemuesensre"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "ipcr",
        "ocr_text": "Time of Rater denetMangomey Position: water enainees Time of Employer Me Seach Dane of Review: August 02019 Position: Seracerasmers eres Divison rere tating Period Sool er 1087 1088 PLANNING ‘EVALUATION ERFORMANE mate weignt INDKATORS aor twos omas osecrnes romene poem (on, er mus a) e 1) ave scone ‘means ident, persis weting ws 2s 2|+ age cont tert OE rasa aeab ze cgppeasinuant AtansstaRSTS ey, Fst ones cs ererng os. 208 s 2 ez ret of Fs ne RE Leeteenoepe\" Lendeno wang compl wth SAEs segemmeageer \\epeansseen cineca sellers"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "ipcr",
        "ocr_text": "COMMYMERNT ANE REVIEW SOMMITMENT AND REVIEW Ot he SYanwariON FRE BGRNEE a wogne “xoearans sores"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "ipcr",
        "ocr_text": "((Q) [amonnt raromne comaran mw mae ——— e) Nome of Eamplovee Mice Stmna__ New of Tater Sere anpomeny =a Pwr eer ognge Division: Lane Date of Review _ Augvat 30 2019 Maometered Schaar a — PUANNING oe a EVALUATION —] T PERORMANCE |__ eating Weeght (NOKATORS aru i wor ume oamcres rmatumt [porta (one ae, mesa ts ©) 1) aw scone mn |\" ee ” cl | Sid * alefel. |, aa = | eee we Salon Lepered ase: wer Sp Ss omen, sl2alel. ste, Se SAR) seer ‘speisememess ESE,"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "ipcr",
        "ocr_text": "INDIVIDUAL PERFORMANCE COMMITMENT AND REVIEW Name of Employes __Michast Siewag_Name of Rater Janet Mengomey, Poston: Sarees Toston Waren Divison Lage Dane of Review —Augat 92919 Rating Period ol ot 187 186 _ PLANNING EVALUATION PERFORMANCE RATING wears \"woraTors acruat swros wnas onsecrves roaeune pera (0 0 ice resus a |e |r| ave scone mane sus [pob8Sstient tng ale zfs jo swongvaut conga rntore| sent _ Mammen se’ ng aealbnce 7 waned mos ey SEAR SE comutinoranliendrng to SEN ce sesunne oge cong win onus TURe ‘siemens oars ines sie stent Sees"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "ipcr",
        "ocr_text": "PLANING, Pecan secon Seay"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "ipcr",
        "ocr_text": "Pian twee gor ke svuitcres +; i fae i i ; i i | ci i | i pera i Ppt"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "ipcr",
        "ocr_text": "Pgsescal a CESSES io4 i |"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "ipcr",
        "ocr_text": "ete eee posites Payonenait Bike of Randers ioe 2 fer, radians | pactemten ea nest i i cafe [Petopetin Pane posited nese \\ ee. en ee | i Socata H t { an | H i oof i \\ i i ; 4 ty ‘ae i 1 | it \\ i Lowe ate 4 “LaBEe 1 hah H i seg Rye semua { | See es wer in i i i i |"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "ipcr",
        "ocr_text": "tl ceeatene ial samen ee | BRDIVIDUAL PERFORMANCE COMMITMENT AND REWEEW | rivisien: sane 57 2920. i aeruns paved revise a0 i { | i i bas oboe Agsites m ausaumng seonicaven Spans ins fre osege"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "ipcr",
        "ocr_text": "MITMENT AND REVIEW VIDUAL PERFORMANCE COM! Division: __teguna ___— ‘Date of Review: June 172020 Rating Period ‘School Year 1978 2020 PLANNING EVALUATION a a we] anon vam a ee on ape fe ae [oom Smee zoblae putcpaten atiest Ea pean “processes. set pacpatein [SEER Pese Proposed a new evaluation, sa ae fase"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "ipcr",
        "ocr_text": "- Le wana PERFORMANCE COMMITMENT AND REVIEW HAswN i wile actin i | a sig lai t i i"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "ipcr",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "ipcr",
        "ocr_text": "& ae INDOADUAL CHEPORMANGE COMMITMENT Al REVIOW i ere a acne ey Postion Mahan wager i Toke of Reco: September 38 205¢ \"neaeatoxs tae, omy, joe cows | ,upcamenses, cnnigee yo motses ter io i reese mOHSEeERGia Sretires so meties reeset fof og { eee i “Hetabicne i i j Po i Pot t i i i 1 i H | i i fam ! fa fa bay | upente svat | Metomueed a’ Rapegesteesaeamaucests Poy 4 | eae 2° i osstate ttatton, i Pyro"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "ipcr",
        "ocr_text": "| MDEVIDUGL PERFORMANCE COMMNTMERT AMD SLVIEW rinsesave ave seoKe"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "ipcr",
        "ocr_text": "? fe a SS INONGDUAL FEAFORMANCE COMMITMENT AND REVICE —l fe a Bs conten niger nnn hs Pine of Review aavaiea engeaer ser9t 9 2051 i oe i mseTE pale! i oe | ee i- i i i H oh | ho ho i ee an \\ Poo tty i | aes 1 letalata da i i i Aipteted acting |b | ha i {seaese Sones, Swmatneemmem? |"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "ipcr",
        "ocr_text": "saa onsecewes ase wets arena Evauavie sone"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "ipcr",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "ipcr",
        "ocr_text": "j Heecslson i i i i i 1 fgse lame i oi po ' ee ee i | ai emi i i i | Pea dog | 1 som i i i po Pot i H ia! inf i ‘congas tenet! 3 ; iS ye p2 pe ee i Sechated i itecel lu i yf “an i Soeanons Ppyot i 1 |"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "ipcr",
        "ocr_text": "——== =O Neos of Eapioys. Hepner Pomtons"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "ipcr",
        "ocr_text": "=e as = eR eS 2S Ae PLANNING EVALUATION casa cal cam cal| co || oo || or |[3| SS fey alfolallclk= == ox Ion i alfellolla |e a poate |B matte ee ne gE AREER oar roe | rit || aa tstesttee extant Beery Umea pesed™ wih commendations from ICA team, aie al"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "ipcr",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "ipcr",
        "ocr_text": "een em a (eenvouan PERFORMARCE COMMITMENT ai REVIEW fer cr mer TS ea eee a Ae Neasna rasa SES caret ve Lats 1 avalide | | senshe ATU ae soy nam aareves mune rere ofc Lv mee seone i i H H “s, i an 1 i ii"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "ipcr",
        "ocr_text": "scene namiem aon | SNOIVIDUAL PERFORMENCE COMMITMENT AND Rie Boston Shine ot Review (Posen ! ‘| i t isi, iad i i i red feieists te: casas, ist i pepo a i | gape? iSeries! xaiereswirey j | | | noite some. ste pay | [jecssou fh i ty i ot | i i 14 Pog i | i sw { il j i | sme | 4 a \\ i er pt i i | it } Seanag, ent lace PYmPcormarwe wh cauma at tomty amente wre | Poy i | grmra ti | egos geeageeos AS en ore weasel i i H i Sg | Mee ve |"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "ipcr",
        "ocr_text": "onncves naan ay nageaTon"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "ipcr",
        "ocr_text": "CE nnn i a E INDIVIDUAL PERFORMANCE COMMITIENT ARD REVIEW a) cd i OCA TORS acwat seo rrmnune pee ina Kote em sever i H i Abeskes, rt \\ 2 Poneniins { i i | j ie t i sgEBE Bye ERIE [erases oes suerte i bob od 1 narBSE8eor i ater i; i 1 i yer hoof j Pet doa i i i PirqGod of fof | \\ Ped; oy | | snogna sieieis ha 1 Brun 10s cumetiange in Pia | eepecgemenen OSM aad amie ApoE oG i"
    }
]