[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "ipcr",
        "ocr_text": "MONE PERFORMANCE CORMUTTDRY Aa MER DE LETTS ae Tork, baa ad Stee Soman Fo teat Cocewmmm unset Dengie! came n Site wn aye Bm mone we ence 8 Ta ery gee nian meee tsa Sant HY 88 MUD VESM BRON COIS. ow (Ameer, Currglaton dorm cosrocr tuned Comers emery aavvamene ‘han Faves Saey Dee Ye vResweg esa 1353 2 seine potcoumnauerey Stguneagiee ccatgrvenateny oescwme nz arr SERA EER [34 2 diegiverart in student Arison cne yam 4 acave neem longantzatian advisership ‘aah phatem cesusten 1 ree trace Reng t 3"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "ipcr",
        "ocr_text": "NOEL PERFOMANCE COMMATIRENY iD MIRE: OA Cave tnd Gommewnent Unie Benguet commen sehr toe sen 2 be oF FDS! Gener 1 ems 9 mts Sera"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "ipcr",
        "ocr_text": "IWONIDUAL PERFORMANCE COMMITMENT ANT ceve ___ York, Luna and sims cone sca wt Benguet coma ber rd aeeio 2 =S ST ae men oven Jenner Sith oo e205 ered ae [ores Tome Saraopher Palmer Benjamin Graz 7 medio SupeTOE pps 2018 fool abo Soares naire |(targets measures nana ‘Rating Remarks: a 3 dans EASES Sn tesech son ce Ses eas coemgeasacees’ |3| 3 |2 4 aces Paricipation mnstuionl ‘oaton n sear ore conta ee osheangcoeuaion ‘Garage sn gma\" ninneerae sepanme 3 4 2| 1 \\Faee of active, a a sane sso wowiget ia Scere: 2lal1 3 bee 3 1 4 2"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "ipcr",
        "ocr_text": "LN PURPA RTRSY AY NEES SSS fangs cence see manson whan erat ITE ee aa atv erberaneriO1S"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "ipcr",
        "ocr_text": "separ ote Yeni Lane. fe Let Gomatemant Une ot Benguet conse caner aro apue be ales en so liseonsnaloe Sanagiape Reena tate awe DO Aver bel anus; 2076 PR epe eee bGeey dtetes seem"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "ipcr",
        "ocr_text": "ePORHAEL COSTINT AO SENET errs vaaet Cagayan ceomancnmamung arene art erg neers eters apenas"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "ipcr",
        "ocr_text": "INDIVIDUAL PERFORMANCE COMUITMENT AND REVIEW FOR az sates of he Morgan, Owen and Woodard Academy __O! te Local Government Unitot Cagayan committe dehver and gre to berated on testament othe fsona get Macaraacr wh be nscand memos he aco hone oOL, Gregor Attn Rote Oat _ arse Review by Oe Aowroved by Owe Joseph Turner Patricia Smith January 31 2008 Trrecit Suporir ait Heed of Ofer output ———) Actual Accomplishments fang Remarks oes Ghtienatemoagmiecns [sues camrsetienaans weverees [wmeeceeerem l4141 4] 4 SS Conduct of quality lest 0 suse satsacon sing. Capes consis crazy Classroom instruction |\" “952m austens; punctual class ‘win non ude ser 1 2 (3 2 Se, saietstaniicannemosaes “msmertamarasmnccers ™emaciewss|> >| 3 5 [SEE Final Average Rating 2 3 14) 4 2 Lepend oenty 2. eer Tees pe"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "ipcr",
        "ocr_text": "Candie cok gu city Amante las srenate wrstear Mon 7 7"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "ipcr",
        "ocr_text": "Se MD me ee Secombe Gan emaneneetermnmense sors PeeDecembsbectobe2000 On _ eee As omg Patria Smith Tos —__ i oo i —— nsnfan tens wtverees \\“SSsismemeaes 1) 1) 4 Snes SE ae SS Tpgesetenange™ |2 2 3 “moauet competed wow ow mm"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "ipcr",
        "ocr_text": "HIVIOLG, PERFORMANCE GONMETMERT hres MEME FORE vane, Quen an Ween Academy teow Goverment ek ot CAgaYN cite dalam ss yun a uses Pept iacardane she rete manele Om rD pembeetob eee Tio st asend ite aaa wetainted onyggiven neuen SARs a Laat payee Conduct of quaity MISsi 90% aude! uavetaaion rating Cazsescergucmccaretenty ty ARICRILSON cent ealocin ring, rays ongues rs lassioon instructios ses he pence Sats “evenseoeres Tur naw ssintena itera oenmee Toga gu a | Moamiteearigese ues apgasentt [Fie avocage Bata PR Unpend Conntty 2 Slowey Toate Ancepe"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "ipcr",
        "ocr_text": "hah Hot Pontine Susornge ones 299 enhancement Pacbcnaton 5 ats ewe oman Ww C9 sligned Conplation ats, MOM pr app (C88 Syn Fins! Nescage Rate OABUAG PaReome, Gelobersanerr ass Posey ANCE CLRMESTREA AnD ecw Cena of Ban Bocce by i 5"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "ipcr",
        "ocr_text": "SESEEES SP ceca e9 Seon acacemy Seem er aren x Samat ste Geaisas SNe See leview and enha tose sutccateee pocorn rivoen oe [Conduct of asec, atgned wth insitutions! pnones tz {esearch pronchal Reson SHDMVOd by Ihe Ressaroh Otie Preserttion mt otreecaich in| Nees 6 sya (Pre resp taia, BEL Oey LeRLANY 2 Fmt 4 mage"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "ipcr",
        "ocr_text": "{IR DEVe RAN PERERA COMMRETENET TS PEAY FRE cospe sesh overt sok of PANEER ‘seni ant Sone Rea ee Se SCHERER Y 2018 emus aon ae ogre 9 ic ensiora te Sek seeps (Giger earch aigned Camplelion of one esearch nrupaeal gprs by tea Reset OR a Tresmiatorst aeons PRES ig or ranone oon esas ae OE NESTE ae es"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "ipcr",
        "ocr_text": "[See aee 509 ot Sot” 90d Seva scutes Meer al Ee kee ges STM 28 Se ‘nen SPEER Gorromes tet ar Ba “Betohercanary a Hannay Hobs Shores Sigersee Hd ae 000088 inaicztny Vrtorcraanee eee GS Wat Wont Gan Spas Suse [fee anes ena Tent [renew organ eens Day emanate [OeSiet of resei en vines \"Completion Si one esearch tropogai Peage trpate! on sksteng Mah estiunonal grantee APRON Uy the Resenech STtiow eon trate rn, Pees iabion of research PO a oie on ema Nevin rasee sm 1 obit avencee ne pyar nat cae Mm aseenee T Ft deco Ratng i 5 i fPiaiaegs 65 Qa teen,"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "ipcr",
        "ocr_text": "MENDEL PEAT ORR COMBTTREENT BND REVIEW TOE Asademy Sn 208 Gevaert ose 8) Peenpanega econ asses Wo Some Che ye Rbanay 2S eencmeo tte Suances va munnet of Pa taealQ ABP neues aa sergh Pe Baws [Cae Repro ie nan Hobbs 1 day 08 George May f oust Fesemclocnad Sau accomsccnnente tng seo Bartapaton 3 lasat one curncusun Te serie Ge Iwagiare enhancaaneet sont. sy ih eatiicuim and goharcenvent [Combet of esoxch atgocd nipletion of one fesearch genposai Beexorn grovote! on etiam wih mainstona! prontes i Secuae | anproves by te Reaearen OMe. ete 3 ES aN 7: w s 4 4 Presentation ot Sotho of aieant ez oecerins Saenesarsnecpmava |) be RY S i nae hanna: costes sevstcawtskecers (4 4 3g Frac Revenge Rating i po"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "ipcr",
        "ocr_text": "ROA eR RnmeaNCS OMRTMRIT An REVOEN Ie Lfehn Hine wire _ Gance, fac an T ACRISCRY re Lee averamecl Uaeat esi Stora meen wi a RSRCd ES pe a Junenevemsone ‘Sent eho we te cm enparin an samenconpapenespanane Hoes arheeed parr SESE Septoria of Guidance provided te 2t least tuo Succetetity at vadergrarsaw thesie oe BON 2 GR Crate Stee"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "ipcr",
        "ocr_text": "aoc, Hosen ard TO AMOS 3 pecnoosmcr ict folio ose DEN acai emcee nore oe Nine 1 en Siew oe FE wing rau enue oa a “geen oo tke"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "ipcr",
        "ocr_text": "NCEA, FERSORWANICE CONBITARNY AND REVIEH FORA Loko Nerion of ms _ Caicla, Soran end fhomas Academy __oF nce Gouamniment 8 Holo Junestovembent Esurgessnopomn) Publcaline ofat ieasl one paper ina paimencre same nnepmene 4 i vioned or eters Fa UBSIoEtavarneare 1 4 provided to al iesstwo Sucseestuly atvised gate thesis gious. HSE ae 1242 Abendance in 80% of departmental and eS ‘cologe beings"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "ipcr",
        "ocr_text": "INDIVIDUAL PERFORMANCE COMMITMENT AND REVIEW FORM |John Norton ctine _ Garcia, Moran and Thomas Academy Othe Local Government Unt of |Jgil __samimito sever ano aaree to be att on the atarmet of ne fclomiglatgels accordance ah th heated measures Ter the sered JunenfoyembeO24. Tina Jordan Reviewed By [bate Aoproved by [aie Denise Mcconnell vay 38012 John Martinez Augen 18108 heciate Superior Tea of Ofice ‘Success indicators Ovteut argetermeasures ‘Actua Accomplishments Rating Remarks oes a Publication of research output Publication of atleast one paperin an Piaiseaore sao n epnigone ih peer reviewed journals Indexed oF refereed journal Consorcassonaunearn 1] 4 4 1 Advising and mentoring of Guidance provided to at least two Successfully advised three ‘gaa student research groups undergraduate thesis groups. me8® grouse tocometion 2 2 1 4 iets die Active participation in Attendance in 90% of departmental and anewes atsneoues searmertmaetngs Sage dierent peetngs and “college mectings. mamma |6 [4 [3 5 ae Final Average Rating"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "ipcr",
        "ocr_text": "hie ee [Advising and Mentoring of Guidance Provided to at least two. /\"sudent Tesearch groups Undergradose thesis groups Actve patopaton n |Aterdance 090% of sepermerai ang | CSE. eercen ses see |matarons, Senin [4 Ja Secoe satu eas groups"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "ipcr",
        "ocr_text": "INDXVIDUAL PERFORMANCE COMMITMENT ANO REVIEW FORM casino ho Harris Greene Academy ofthe Local Goverment Unt ot C comin to caver ang agree oe ee on the atarment cle Iolowing gels accordance nih the icaed MRRSURSTEr he pared July WWanvary 1975 4 e __Michael Drake Rote Reviewed by ome [Aoeroved by Dae ‘Amanda Murphy Jodi Dorsey august 21208 _Aepestcazoos __ eeiot _| Irvmeciate Supervisor output ‘Success indiestore eee nace, ‘Actua Accomplishments ang Remarks Preparaton of student Allclass grades submitted within the ses seenee: Peformance repos andgrade ‘sexorbbed Geadine, |_siemmeonprerttt. Implementation of student Atleast one classroom activ Heid trace csgorn engagement activites” eactegioimarove steer MREANIBGRNG 5 |g |g conga tap eseeron __Ainndaes nation semen yyw ener ad entre devprentanigeprondencyear ‘anurmaiermmgacse |3 1 1) 2 Final Average Rating 5 sit 5"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "ipcr",
        "ocr_text": "| NOVOUAL PERFORMANCE COMMITMENT AND REVIEW FORM 9 ve Loca Government una et Cavite Tee ome renee eee ore Harns Greene Academy Tee Ts memes es re ree July MWaruary 1973) pelaaroet ave tasers eget uchae! Drake ag om _ hoerowe oy aad Joo Dorsey Amanda Murony nega ¢9 2008 | ed of Otce oceans me tors ct hecometaonete as om ‘Sernccoonoes bce ices goes evortne wv PO RMS A class 9 eas eaane wemanereame 2 2 1 1 i y least one classroom achvt Mord reer ecpye canyon |Implementation of student AUS ee stsoerd Sere 5 3 02 «4 yerscemant aches Soy (EEE 8? eeeene amen |, strenncntn miata, SR ERETERMER 3 11? 4 rat averse Rang is 5 5 1"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "ipcr",
        "ocr_text": "OIA PERESRIGHESE BORMETINENT ANE REVIEW FORE Lora Lice esmmesnne es wt Cayyites net eevee ape i aa aveomee Quy avay GTS _ Miche) Grane. fine po Reanistoraicer mimic pars ase aris — SMO, Hai recap amcor iP\" agegament aetvltes P sommaroeis toy Sergent | sss epee) aunty Pewee G seaeps fee"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "ipcr",
        "ocr_text": "REAR MARTRVANEE SE usna won Gps RS CREE Sia aly ena 797 3 memanccen 1 HEB GIENR ASI ag BSc os peer spe bearer hte OS oe F 3s peter migais ns 998 peo ae ieepiemantation of student Brgagement aciuies nel"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "ipcr",
        "ocr_text": "SSSR, PERRO Ne Ree Pon A omsareca oy RSMAS Gita tana amemmenacce VIE coon sate mci aR tne a baa Sate Rares 7 NRE Sn giGes wintind awe ‘ressrbec ana, Aikset ne chwwoam acive [Fee Someta 29 Ss Aiveape Bima i. FI aens mein 2 Pres Heine"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "ipcr",
        "ocr_text": "RAINS, PELE CMRR AEE CORRECTED ANE REVERE FORE shan Motiman cto _ tke, Brawn aaa Batterson Lniverety ht Sim Qoeecnaet Un 3) Da des Shor comma aetna apne re me og aN Bere Se RE eet os aah ar welemne emus by OPA ery RAEN Ch 1224 fshiey Seters wae Sa “Eanedieengtagemsens, (Gre excennon crag am cunenzing ana SEES LLP Grpnmersea nuscasahay tonsia aytnates |, Condunt fat ieastone racing oF Mot ig g LRSARE* ochre besetting patter comin metal 45 OBER ee Rar coeronueaty Srebuchonat ob Despwcm necsesmesand Able parent a least one sear ret 208 a ee ee Fin Aaorage Ring"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "ipcr",
        "ocr_text": "Ita, ROComAHR COMMERERSY AE ROREW FOE Bion Numan stim _ Bren Brana ona vedtacontelte snoniemre Santee Shs tna Gvessman Bee aI Cyan det SPN iverbidanct 194 send he me yt 8 ma {Ors extsnuion progam cooopaaied and 0 “ahs nice ausewnay ‘aragn sen women i Seti! oft asi one training og Deivesed vaciny avzsions oe ositue Senet amter sammie, |B Sart be Prtciovton mecomdtetencne detve favhebamien nH feast om Sa eatty mentonne mecabnes et i a age ag Gaon denotes 2 xtomey Rartage ee,"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "ipcr",
        "ocr_text": "INDIVIDUAL PERFORMANCE COMMITMENT AND REVIEW FORM cal Government Unit of Davao del Sur conmitso eh “price, Brown and Patterson University Oe ee ONT a Ste scone meme TepBVEMDEMATCN 1984 wot and agro 1 be ate oF Alan Hunan of, the starment ate foo oe —— foe poprowed bh Ashley Sellers Gordon Williams jomiee Je Deinere waining sessions conduct ofat eastone raningor Reusealemnastess (34 15 2 compensa arena eee etn, Reazcen ° uae tio. eesotteene” |° |S SF Supenisor a maccomaunmene Raine tamate | ! porte Tea} vo T, toes sonproyanromeey 4 i 1168 Soodnnien olenenasner, [ove exenmon program cooranates ane A SeRCRRISD LADS aRs O° pirates sceesstuly ‘Tnngnssmgn sonore —-emmnma Mpepuipaemignnme _ untiayecaner™™ meme soeremeinna Mustela’ ay cnmgremer 5 5 5 5 Final Average Rating 2 (31 13 ne"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "ipcr",
        "ocr_text": "deneatatinan te Brig onsiornet olen seis m2 te on 8 we nn [Pe extsnsicn siagrain conden nnn nie Suctese 1 Sim sianoreyaane i Cort Shaavteret een fan i4) we bereits se One Rating or Balan ware cceoe seats ate tat ‘er canny Be Bieri Pov NO asserectingion ang Falive inert etn ina fasah ane ‘Sta skier! asamae dom 1 Hany CES zoel iy tealee adie [abe age Ras gar nue FHT 8 atber s merge"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "ipcr",
        "ocr_text": "perennial anemone [4"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "ipcr",
        "ocr_text": "INDIVIDUAL PERFORWAN: 'CE COMMITMENT AND REVIEW FORM Marie White ot me _ atkins Smith and Willams Academy one Local Hay Sg lfabela comm ceeran ayes ee Re SeArTRe oh own ae ca aS A Sve ceredansany hey “oof _Chestopne: Chen. Reviewed by [ate Aoeroved by 1 oe Holly Walace MD Lings Nerigomery T cxwoe ar Output i} THRLSSELY Lecseaamsaipamenseo meena |. otinsthitional corona [Babes susie 05 ae eases, Upc SII Sasso |, Replacing of LMS conens, Ueaaied at aninecss cons FT eamnecassroom weekly post Peat announcements snd Saammtewer || || se “eats 2 2 aofSsistance in program socibmnssion of complete conprance Pgreca oganzes coevrem free Cocmeniaion waSAnitel ein organs nes Frat ene Reg acestmoncowiane 1 3 4 _— \\4 |S i3i2 iF 4 t"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "ipcr",
        "ocr_text": "ROO DUN, MERTORUAICE COUMITIUEINT AND REVEW PORE Vite ote Cine Loca Greromam cat ot Inaitenta Smt Cor ae awe e ber oe 00 a Soe EE Ne Sececaruaye May “2018"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "ipcr",
        "ocr_text": "veut. PERPORUANCE ComMTHENT 40 Reve rom etl Write ote SE pee sort eter ans are be re a cmon ‘Act constants ae 1 “Sones RoE —| Sri eo char Inert eenesert ae rs 3 als 2 1 Boating of LMS content, ‘Updated ait Siassrooms MESES SOS Ssaroon ree co Seamer ||, | 2 Se compas sane, i eres OE S 4| 5 [Sar Final Average Rating 2 4 5 /3 Red Oey 2 Rey» tee ngs"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "ipcr",
        "ocr_text": "pues. PERECIWANEE COPSEMEDT ABD BENE TTS re abot comepenercenmse mae Se com atgen wate oes _ AIRES cea Soeaerecd bn BSH HH mania ce bets 3 a comes > pacar “Of LMS conte ° i i pene V paompeiorenecnmiam catia cas ccuet. wngmpegcracaseey® 2 1 eee union oven CaS wen EH soni, wegmemnecaess” |2 028 2 ss aizgialiearon piers SIS seas iene s ee 2 Se i pgamainomgran emanates seme » SEE eae SER Ub As compan AAUTVERERE ‘int Anarene"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "ipcr",
        "ocr_text": "Mare Wie re _Agingon. Smith and Wiliams Academy OF 90 Lees! Government Unt ef Ie abela comnts a age te te on te Mtarrert ce taoery wegen Frases ae be rocame meanest te meeanuarye May Dt stop Cron ome ome mat [Reviewed by [oa [ Heatly Watace MO Lunda Montgomery omer ee C enesiate Superenor Heed of Often 1 ome sat hecomptaneeats ‘as member or char 5 Commitiees, meagre nota wade wiee econ ata Ledatng of ontine ciasaroom pasting of MS content. Upgead ot orine casero and dg sre ting of announcements \\eurmg patcrme weexh post ane Monat ecco oe Assistance in program |S pmeon [npetmcpenemmae|. |at t | comenance dacumertaton savtemsiseacenacreman “Ruslamaneee |1 3 1 l 4 5 (3 2 2 sem) comet 2 teens) Pete tee"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "ipcr",
        "ocr_text": "INO VIDUAL PERFORMANCE COMMITMENT ANO REVIEW FORM Casey Ward of ne Ruiz Group Institute Othe Local Government Unit of Sorsogon _ ful Group Th rnscaied measures fre perovAugust June 2009 committo deter and agree tobe rated on tne boormenel ie towg neem My, Adam Rodiguez ee Date: sumer 61301 Reviewed by: ‘Aoproved by. Date Brandi Johnson Connie Rivera ‘August 182002 “immediate Supervisor ‘Head of Office output ‘tua Accomplishments Supervision of on the job ‘raining (OMT) students Wontorng reports forateastive _ gure non swarm Momiorngrepats ra eat, anaenlsTuR arene Participation in institutional cetcpaton at eastone intial |sSeerinenr ise 2 at research evaluation “Basefch evauation session Preparason of annua ymission of annual instructional plan oF _pemcenesans samvnes acomprenane lasers instar pan and course Suemmncnclenieyen sce anaee criescere™\" |2 2 2| 2 [ser Fina Average Rating 3 4 2 3 L ae"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "ipcr",
        "ocr_text": "IIOUR, PERFORMANCE, Casey Ward of tre ‘COMMITMENT AND REVIEW Fon ee ee bere 2 mi oe Reviewed by: [Baie id by [aie Brandl Johnson. 4 sour Connie Rivera ‘age 10200 -— =, aang Ome? STRESS” naa, [3 [als [= TREES [wrersnairmees [tenserner aia] s ee corso anus S Settee nr eet ane cena retiree 2lal2 2 steer Final Average Rating. 3] 2l3 g Dl ety, 2 pee Macaen 6 terege"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "ipcr",
        "ocr_text": "NOVIDURL PERTORLAMEE COMMITARENT Al REVIEW FORE tte io hanel Givamment den at BOFSogOn sommwto tine: ons ance Baines Be Ed doonowee Conrig Rivera aed 9 Orhoo i cope accor seer ane sommes Brastive po cote ion 4 Partcination ininsttvtnne Putpaton #2! east one natone jeceaich avaluation fegeate 304"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "ipcr",
        "ocr_text": "SonReasEnt PEREORITANES COMMATARNT ANE RENEW FDP Ruiz Qroug instinde _____ Ott hase Bowmament ue ef SoIsogor ie a i Tar a ir jo gE 2008 Casay Ward odors to ataecert fe Se Sipenision ofan Bee reports far at (Siig Ot wus 'S crag particratie T petepeten in atioontoneinatisiona |cusaraminnemantert | | 4 «| aaa” ene eetcnsemes = (tia) tee \" Fuacclasion ef annus eating finn wd mreeopsae nearest ORS ainim mpd beta iamcioe pero neds gene semaae s Cuesta bitiamncy oediness 4 Samy"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "ipcr",
        "ocr_text": "SOSVIOL PERFOR ANES CORWETAERT ANE REVIEN FORK. _ wupinsiiute tise knead Guaomecant ea af SISO Sutil Sabo: an egos ta Be ai on TpasasiG iS W heen de wi tas HCY EBERT Se peceeA DUBE Jusri@ 2069 cone 1 poe en tiejas 7M per raining iO. rapors for et ewe ee nig cubmified on time, ses ‘articipation in insittersl parieipatne oat ast ons insite ei ninensturn ss | research evaluation i ieseainh evakeation 22981 f essen actviy 408 Peeparatan af anna TZ iz |"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "ipcr",
        "ocr_text": "ANNOVIDUAL PERFORMANCE COMMSTIEERT ANC REVIER FORE __ cme ieee Goamemm unset Albay Hii Pec eM DeVOH LEAT itacony Blyd ottse sie buancleed ha tsi Bee Teayaaieston t ee Res “oniiating of lntionqante ana pertormnar toois Use of af feast iwo digital kiols a4 Integrator of [nicassroor net cen ion se fine alton age partion, vomsmomree i SRE ets RESESTEN a oy plationns rst poriawaee Penns eacicral Pe Aeacage Aas pot i 14)"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "ipcr",
        "ocr_text": "ROIVINAL PERSORMANC: MMETAENE Av REVIEW POE ianser opt o pe ete a ta ‘ervn acewe ana sone ne we esa 9, Sisdy Joho Evin Jones Han of Ot i so AEROS, sete Acconplstresse a wenn ance montored wezky substan oer pales integration of C7 tots c FON aire pO Gndimavutond went Sioat average Rasing |"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "ipcr",
        "ocr_text": "mpincsth, AEF ORMANCE COMANERRTNIEASST T omer nenmart uit STB scsas te be pbs eA REO ST __ _ Fhesaieick Us SS sgh Roane vin vs es aman Boyd ai te spaennens etn Wont cas eons Speen Jaendence ante’ ren ies cor ea aguas UES suction “att pean j imegrafion of jp clasaroors NsstruclN"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "ipcr",
        "ocr_text": "Vamp Poad ots sha staves vag “af sRegeri Ad performance Mansuone sence sg to cae [Medes Bence I aBOn GE GT ical je oesreom instruction | Parteioaten, campus acihaiey one ition evant least two digital Siaserocer ond is me institection. “awash Gataltewming 4 1 3 lalslala"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "ipcr",
        "ocr_text": "Sere oe aceon ERE mm Gem Ps eit “hay eraton Emp sores lar - = nme of student arenes core tee 4 1 \"and performance Mogae pe noe tntegraten of 198 Use ofat east wo gta tots vase agatcaes a cers ee Seemmcarea [4 4 5 (4 4"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "ipcr",
        "ocr_text": "INDIVIDUAL PERFORMANCE COMMITMENT AND REVIEW FORM, nareae des te Lee Govan nts oho] _connt sehr adage weed et Re Soacg ash cance Se eT tee beret PONO! Ca Baie Aeproved by Dae —Joe, Chambers [aay 232013 Daniel Michael March 16 2020 ovo =, ‘ett Acoma iene a mown rooms CERUERIGIMORRE creme [1] 3 2 4 |= “Sreacisafe freuen Meteiemeees” |, [> ||, SE [Fardiatonepicemede! Ceaterenimeimensons™ cremneramee= S 2 4 4 Final Average Rating Leen Qutty 2 efoeney 3 Tenens senge"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "ipcr",
        "ocr_text": "NUSARE, PERFORMARTE COMDETERENT AND REWIEW Fat a Sina Loess dormant Uae et Beshot 2d Hanae He pee yet ateaa IMS watts dln wi as ie lems merc SERS pa reece lasses fol aging st 8 ——s BE tepeE setey Aang STaecoeas a ames"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "ipcr",
        "ocr_text": "RDAIDUAL PERFORMANCE COMMITMENT AnD AeENY FORE 8 Sovemnaienitimtct Plghyof sr ta kser ang niga tte ma a PD cfene fares 2078 T ‘iucsaee inecaioe targotesnse naan Prgoaga fr gum improvement proposal ‘Teoorimens eos Sunmiied 2 corarlote fans nsimenimpatt wach, easaen wd so"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "ipcr",
        "ocr_text": "MOTE MMR ete eNt sc tng nl re sa LL age eS ahaa, flohal nee are we aye oe cs"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "ipcr",
        "ocr_text": "rest eommemnt hcl mt meno Lents sae =o three -—"
    }
]