[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "lab",
        "ocr_text": "important Lab Safety Rules LABORATORY SAFETY RULES Use safety shields or goggles when working with materials thai may solash or explode. 2. Keep aisies and exits clear of hags, steals, or equipment at Abways clean your work area and wash your hands before leaving the laboratory. Keep your workepace clean and organized t i 1 revent spills, accidents, or equipment damage. Wash your nands thoroughly before and after perfor ming any experiment. y and never mix tthe teacher s 6. Label ai unknown Report ail accidents, no matter how minor, to your instructor Immediately."
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "lab",
        "ocr_text": "KNOW the location of Important Lab Safety Rules Satety equipment ee F \\g7 gare einen nowy want £0 doin at the lab J case of an accident la Don’ taste or Don’ rink i Sniff chemicals at or in ab a Thoughtc LABORATORY SAFETY RULEs; Use Safety shields Or goggles when Working with Materials that May splash or €xplode, 2. Keep aisles and exits clear of bags, Stools, or equipment at all times. Always Clean Your Work area and wash your hands before leaving the laboratory, Keep your workspace clean and organized to Prevent Spills, Accidents, or equipment damage. Wash your hands thoroughly before Performing any experiment. 6. Label all containers Properly ang never mix unknown Substances whos the teacher s _ Report all accidents minor, to your instru and after NO matter how ctor immediately,"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "lab",
        "ocr_text": "Important Lab Safety Rules 9 awn, Corts | ress appropriately Know what to doin t ase of an accident Know the location of safety equipment Leave experiment: at the lab Don t taste or ssnift chemicals Don t experiment ‘on yoursett ThoughtCo LABORATORY SAFETY RULES Use safety shields or goggles when working with materials that may splash or explode. 2. Keep aisles and exits clear of bags, stools, or equipment at all times. Always clean your work area and wash your hands before leaving the laboratory. Keep your workspace clean and organized to prevent spills, ‘accidents, or equipment damage. Wash your hands thoroughly before and after performing any experiment. 6. _ Label all containers properly and never mix ‘unknown substances without the teacher s permission. _ Report all accidents, no matter how minor, to your instructor immediately."
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "lab",
        "ocr_text": "‘own wesvonot Important Lab Safety Rules safety equipment “ws ress appropriately Know what to do in ‘case of an accident Don t taste or snift chemicals Don t experiment ‘on yourself Dispose of ‘waste properly ThoughtCo. LABORATORY SAFETY RULES Use safety shields or goggles when working with materials that may splash or explode. 2. Keep aisles and exits clear of bags, stools, or equipment at all times. Always clean your work area and wash your hands before leaving the laboratory. Keep your workspace clean and organized to prevent spills, accidents, or equipment damage. Wash your hands thoroughly before and after performing any experiment. 6. Label all containers properly and never mix unknown substances, without the teacher s permission. Report all accidents, no matter how minor, to your instructor immediately."
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "lab",
        "ocr_text": "aly safety Bates Lportare Thought LABORATORY SAFETY RULES Use safety shields or goggles when working with materials that may splash or explode. gs, stools, or eq) Always your hanas thoroughly before and after performing 2 Report all accidents, no matter how ninor, to your instructor immediately."
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "lab",
        "ocr_text": "important Lab Safety Rules Fades the iastouctions ress appropitaness Thought”: LABORATORY SAFETY RULES Secure all loose items like notebooks anc cards to prevent acodents. ed tor your specific ical containers tightly closed when not in revent spills and evaporation. bronen equipment to the supervisor, Wasn your hands thoroughly before and after perfor ming any experiment. (and never mix unknown suts pea the teacher s Handle all biological samples carefully and dispose of therm properly affer use. ows gasp mrad wodeatise"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "lab",
        "ocr_text": "Know the location of we ean Important Lab Safety Rules 9 Follow the instructions Oon t play mad scientist a 2 WY tress ‘appropriately aS wines enon What to do in at the lab ‘case of an accident Dare taste or” S| Sniff chemicals Don t experiment ‘on yoursett Thoughtc. LABORATORY SAFETY RULES 4 Secure all (pose items like Notebooks and Cords to prevent accidents. 2 Use only the materials expen assigned for your Specific Keep chemical Containers tightly closed when not in use to prevent Spills an evaporation. Immediately report any spills, inj injuries, or broken equipment to the -'aboratory instructor Or supervisor. Wash your hands thoroughly before and after performing any experiment. 6. Handle all biolo. ical samples Carefully and dispose of t mM properly after use."
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "lab",
        "ocr_text": "wow pe vewen st Important Lab Safety Rules tery equoment Don t play mad scientist a Foto the introctions c Fe Dress appropriately t tab > oe é Sfeereieae oe atthe Thought Co. LABORATORY SAFETY RULES Secure all Ipose items like notebooks and cords to prevent accidents. 2. Use only the materials and tools assigned for your specific experiment. Keep chemical containers tightly closed when not in use to prevent spills and evaporation. Immediately report any spills, injuries, or broken equipment to the laboratory instructor or supervisor. Wash your hands thoroughly before and after performing any experiment. 6. Label all containers and never mix unknown Substances the teacher s permi . Handle all pean samples carefully and dispose of them properly after use."
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "lab",
        "ocr_text": "Thought LABORATORY SAFETY SULES Secure all loose items like notebooks and cords to prevent accidents. is assigned for your specific rt. g, Use only the materlais and t eX! tightly closed when not in Hon. rent to the Keep chemical contain use to prevent spills and evapore or broker equi ipervisor immediately report any sr laboratory i Wash your hands thoroughly before and after perferming any experiment. 8. Label all ce UNKAGWH SI Handle all biological samples carefully and dispose of thern properly after use."
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "lab",
        "ocr_text": "Important Lab Salety Rules Dory play none sctertat deliow the instruction id reat sporopristely 4 senesa the location sales equoment nperinent sh LABORATORY SAFETY RULES Secure all loose iterns like n tebooks and cords to prevent acct ents. nc} tools Gp for your speciic 2 Use only the materials a! t experiment Keep chemical containers tighth closed when not in use to prevent spills an evaporation. immediately report any: lis, injuries, OF broken equipment to the Jaboratory instructor of supervisor. Wash your hands thoroughly before and after performing any experiment. 6. Labetall containers properly and never mix unknown substances, itnout the teacher s permission. Handle all biological samples carefully and dispose of them properly after use."
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "lab",
        "ocr_text": "afer Rules taiportant Lal Thought LABORATORY SAFETY RULES , electrical outiels and ni short circuits. hand eAsuring Keap water away fo! equ pment fo pr Use fume hoods when workin with volalile oF har mf che mice Always double check labels before using any chemical or solution."
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "lab",
        "ocr_text": "Important Lab Safety Rules LABORATORY SAFETY RULES Keep water away fram electrical cutlets and equipment to prevent short circuits. 2, Leave the laboratory or your station and ensuring Li ied Off. rf any unusual smell, smoke, or chemical aitsin ini mediately to your instructer. 2 clothing of accessories Use fume hoods when working with voiatile or harmful chemicals. Ing a lab yourself Always double- check labels before using any chemical or solution."
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "lab",
        "ocr_text": "important Lals ee LABORATORY SAFETY RULES Keep water away from electrical outlets and equipment 16 prevent short circuits. 2, Leave ine laboratory ont and ensuring: all Repor any unusual smell, smoke, of reaction mediately to your instru: Tie back tong hair and a wearing loose clothing oF BOcessor during experiments. jes Use fume hoods when working with volatile or harmful chem F ry alice, 15, yer 8S Always double check labels before using any chemical or solution. 8. Always wear ps gown, gloves, ani"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "lab",
        "ocr_text": "wom tetvatoner Important Lab Safety Rules Bia) i _satey cquyement @ 3 Fatwa etrctons —_ Des pay mad eientiat s ae Cress aperopranty case of an aecidect LABORATORY SAFETY RULES Keep water away from electrical outlets and equipment to prevent short circuits. 2. Leave the iaboratory only after cieanir station and ensurin: at Hie, is tuned of t Report any unusual smell, smoke, or chemical reaction immediately to your instructor. Tie back long hair and avoid wearing loose clothing or accessories duting experiments. Use furne hoods when working with volatiie or harmful chemicals. 6. Always wear proper jeboratory attire, inciuding a lab gown, gloves, and safety goggies, to protect yourself from hamiful substances. Always double check labels before using any chemical or solution."
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "lab",
        "ocr_text": "« Important Lab Safety Rules givin ee Don t eat or ‘rink in lab Leave experiments 4g ff Know what to do in at the lab case of an accident Don’ taste or sift chemicals Don experiment fon yourselt Dispose of waste propery Thought LABORATORY SAFETY RULES Keep water away from electrical outlets and equipment to prevent short circuits. 2, Leave the laboratory only after cleaning your station and ensuring all equipment is turned off. Report any unusual smell, smoke, or chemical reaction immediately to your instructor. Tie back long hair and avoid wearing loose clothing or accessories during experiments. Use fume hoods when working with volatile or harmful chemicals. 6. Always wear proper laboratory attire, including a lab gown, gloves, and safety goggles, to protect yourself from harmful substances. Always double check labels before using any chemical or solution."
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "lab",
        "ocr_text": "ormevetens Important Lab Safety Rules Sate equipment Don t pay mad slentist 9 pet tha tutions mm a \\a/ ress appropriately ee Vi ‘the ab ase of an accident i y Dont eat or mame S ‘rik nD a Pesate prover v vv Don t experiment ‘on yoursett ThoughtCo. LABORATORY SAFETY RULES Do not touch or taste any substance in the laboratory unless instructed to do so. 2. Inform your instructor immediately if rey spill any chemicals on your skin or clothing. Report any unusual smell, smoke, or chemical reaction immediately to your instructor. Immediately report any spills, injuries, or broken equipment to the ‘laboratory instructor or supervisor. Wash your hands thoroughly before and after performing any experiment. 6. Handle all equipment and materials carefully, and report any damaged tools or containers to your instructor immediately. _ Handle all biological samples carefully and dispose of them properly after use."
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "lab",
        "ocr_text": "Thought co. LABORATORY SAFETY RULES Do not touch of taste any substance in the laboratory unless instructed to do so. 2, inform your instructor Imeediatety if you spit any chemicais en your skin or clofhi Reporl any un sual srneil, smoke, or chemical reaction immediately fo your instructor. Tapert any spi laboratory ures, oF broken equipment to the uctor er supervinor. Wash your hands thoroughly before and after performing any experiment. tals carefully, and Handle all biological samples carefully and dispose of them properiy after use."
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "lab",
        "ocr_text": "ab Safety Rules nt enti Follow the Instructions Done play ad cin ress appropriately xno what to doin 4 tease ofan accident ent Uumportant L atety equipment See nees it” “ctu Don t taste oF sniff chemicals Thought o. LABORATORY SAFETY RULES e any substance in the unless instructed to do so. pill any chemicals on Do not touch or tast laboratory 2, Inform your instructor immediately if you s| your skin or clothing. Report any unusual smell, smoke, OF chemical reaction immediately to your instructor. Immediately report any spills, injuries, or broken equipment to the Jaboratory instructor or supervisor. Wash your hands thoroughly before a! performing any experiment. 6. Handle all equipmers and materials carefully, and report any jamaged tools oF ‘containers to your instructor immediately. Handle all biolo ical samples carefully and dispose of them properly after use. ind after"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "lab",
        "ocr_text": "haportast Lab Safety Rules coitus the Sntaucttone mad aelentst Thought LABORATORY SAFETY RULES Do not touch or taste any substance in the taboratory unless instructed to do so. 2. inform your instructor mm: ely if you spi any chemicals on your iG. Report any unusual smell, smoke, or chemical reaction immediately to your instructor. ies, or broken aquipment te the ctor OF Supervisor. immediately report any laboratory inst Wash your hands thoroughly before and after performing any periment. diy. ang 5 tb your instru _ Handle all biological samples carefully and dispose of them properly after use."
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "lab",
        "ocr_text": "xeow he weationot Important Lab Safety Rules é f JV 1 tress appropriately ae 9 Leave experiments 4) 4” know what too in t the lab case ofan accident Don t taste or Sniff chemicals |! ‘v ThoughtCo. LABORATORY SAFETY RULEs Do not touch or taste any substance in the laboratory unless instructed to do so, 2. Inform your instructor immediately if you your skin or clot ing. Report any unusual smell, smoke, or chemical reaction immediately to your instructor. Immediately report any spills, injuries, or broken equipment to the .laboratory instructor or supervisor. Wash your hands thoroughly before and after Performing any experiment. 6. Handle all equipment and materials Carefully, and report any damaged tools or containers to your instructor immediately, Handle all Biological samples carefull and dispose of t Spill any chemicals on ly eM properly after use."
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "lab",
        "ocr_text": "ab Safety Rules know the Woeation of Important Li pn play ad scinti sy eqanment a ratow the tutions Nf] é A? ors prot t 7 coow wat 2 801% a cave of an accident ‘Dispose of waste properly Dorit taste OF sift chemicals DDor e experiment ‘on yoursett Thought Co. LABORATORY SAFETY Fi Keep water away from el equipment to preven 2. Inform your instructor immediately if yee spill any chemical your skin oF clothing. Report any unusual smell, smoke, OF chemical reaction immediately to your instructor. Read and understand all laboratory instructions and safety labels _ before handling any materials. Ensure that all electrical equipment is turn use to prevent hazards. Follow all laboratory rules and listen carefully to 's before, during, and after safety instruction: ‘experiments. matter how _ Report all accidents, NO. P minor, to your instructor immediately. ULES ectrical outlets and t short circuits. Is On ed off after 6."
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULES Keep water away from electrical outlets and equipment to prevent short circuits. 2. inform your veciat us Report any unusy reaction imm Read and understand ai before han i smell, smoke, or chemical lately to your instructor. ‘aicry instructions and Safety labels og any materials Ensure that all electrical equinment is turned off after use to prevent hazards. i) ng listen carefully to during. and aites nts. &. Follow all labo: sataty 8x) Report ail accidents, ho matter how minor, to your instructor immediately."
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "lab",
        "ocr_text": "LABORATORY Sarety RULES Keep water away from electrical outlets and equipment fo prevent short circuits. 2. Inform Your instructor fimmect: y u Spill any chemicals on thing mel, Smoke, or chemical te your instructor. tory insir Report any unusual reacton inmmediat Read and understand alt lab before hanc ons and safety labels als. Ensure that aff electrical equipment is turned off after US@ lO prevent hazards. 6 rc Report all accidents, no matter how minor, to your Instructor immediately."
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "lab",
        "ocr_text": "Thought 7 LABORATORY SAFETY RULES Keep water away from electrical outels and equipment te prevent short circuits. 2. talon your instructor immed yt uu Spill any chemicals on Report any unusual smell, smoke, or chemical reaction immediately to your instructor Read and understand ail labor instructions and safety labels 3 Defore handling any materials. Ensure that all electrical equipment is turned off after use fo prevent hazards. Report all accidents, no matter how minor, to your instrucior immediately."
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "lab",
        "ocr_text": "xoow tne veatonot Important Lab Safety Rules. Safety equipment ‘ an (as ra Dress appropriately Leave experiments 4 4” know what to doin at the lab p case of an accident 4 Don t eat or Don taste or ‘rink in tabs sniff chemicals |4 a ‘waste properly Don t experiment ‘on yoursett Thought Co. LABORATORY SAFETY RULES Keep water away from electrical outlets and equipment to prevent short circuits. 2. Inform your instructor immediately if you spill any chemicals on your skin or clothing. Report any unusual smell, smoke, or chemical reaction immediately to your instructor. Read and understand all laboratory instructions and safety labels _ before handling any materials. Ensure that all electrical equipment is turned off after use to prevent hazards. 6. Follow all laboratory rules and listen carefully to safety instructions before, during, and after experiments. Report all accidents, no matter how minor, to your instructor immediately."
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "lab",
        "ocr_text": "coow tye weaton se Important Lab Safety Rules safety equipment 3? Follow the instructions _ Dont Bay mad cient } = ress appropriately ck uy Leave experiments 44 9 Know what to doin at the lab case of an accident Don t taste or sniff chemicals Don t experiment ‘on yourselt Dispose of waste properly Thought© LABORATORY SAFETY RULES Secure all loose items like notebooks and cords to prevent accidents. 2. Store all personal belongings in designated areas away from the workbench. Use laboratory tongs or holders when handling hot glassware or equipment. Immediately report any spills, injuries, or broken equipment to the laboratory instructor or supervisor. Wear closed toe shoes to protect your feet from spills and sharp objects. 6. Know the location of safety equipment such as fire extinguishers, first aid kits, and emergency exits. Leave the laboratory in a clean and safe condition for the next users."
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "lab",
        "ocr_text": "Importans abe Safety Bules LABORATORY SAFETY RULES Secure all loose items like notebooks and COrds 16 pravant accidents, Ongied a 2 Store all pers Wear closed foa shoes to protect ur feet from suilfs and sharp obje is Ekcno, Leave the laboratory in a clean and Safe condition for the next users."
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "lab",
        "ocr_text": "wove wenene Lmportant Lab Safety Rules Don t play mad scientist Fotiow the instructions Thought Co. LABORATORY SAFETY RULES Secure all lpose items like notebooks and cords to prevent accidents. 2. Store all personal belongings in designated areas awa’ from the Workbench. y Use laboratory tongs or holders when handling hot glassware or equipment. Immediately report any spills, injuries, or broken equipment to the laboratory instructor or supervisor. Wear closed toe shoes to protect your feet from spills and sharp obj 6. Leave the laboratory in a clean and safe condition for the next users."
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY BULES Secure all loose items like notebooks and cords fo prevent accidents. 2. Store all personai belangings in de: from the workben: Use laboratory tongs or holders when handling hot Glassware or equipment. iramediaiely report any spi iaboratory aied areas away or broken equipment to the 7 ar supervisor, Wear closed toe shoes to protect your feet from spills and sharp objects. is fire Snow th extin Leave the laboratory in a clean and safe condition for ihe next users."
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "lab",
        "ocr_text": "fmportani Lab Safety Rules 5 Thought: LABORATORY SAFETY RULES Secure all loose items like notebooks and cords fo prevent accidents. 2. Sicre ali personal belongings in designated areas away frorn the workbench. Use laboratory tongs or holders when nandiing hot giassware or equipment. uries, or broken equipment to the OF SUDSTVIBOE. immadiately report any spit taboretory inst Wear closed toe shoes to protect your feet from spills and sharp objects. ety equipment such as fire id KS, anc emergency exits. Leave the laboratory in a clean and safe condition for the next users."
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "lab",
        "ocr_text": "Thought LABORATORY SAPETY RULES Know the proper procedure for using the emergency 8 shower and eye wasn siation. Use laboratory tongs or holders when handling hot glassware or equipment. wasle properly according to the schaal s d environmental guidelines. Be alent and focused at all times to prevent accidents and ensure safety. Keep all laboratory doors and windows closed during experiments to maintain proper ventilation control."
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "lab",
        "ocr_text": "apt Lab Safety Rules dmpert pprapsiaaely t LABORATORY SAPETY RULES Know the proper procedure for using the amergency shower ang eye wash station. 2. inform yout instructor immediate! cals On your skint gu Spill aly 1g. Lise laboratory tongs of holders when handing hot glassware OF equipment. laboratory waste Pro} noarding te the sehoo s safety and environs guidelines. Dispose of Be alert and focused af ali imes to prevent accidents and ensure safety. loan and orga! 705, oF broke cio? ry doors and windows closed nis to maintain proper A control. Keep all jaborato during exper v"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "lab",
        "ocr_text": "» Important Lah Safety Rules Thought LABORATORY SAFETY RULES Know the proper procedure for using the emergency shower and eye wash station. 2. Inform your instructor immediately if y your skin or cicthin Use laboratory tongs or holders when handling hot glassware or equipment. borainry waste properly according te the school s safety and environmental guidelines. pil any chemicals or Dispose of f Ge alert and focused at ail times to prevant accidents and ensure safety. Skee your wor the tis Keep all laboratory doers and windows closed during experiments to mainiain proper ventilation control."
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "lab",
        "ocr_text": "roowinevewen st Important Lab Safety Rules ‘afety equipment 9 fatow te ntrctns O20 ay mad aetit F oG Dress appropriately, C oposite rr) oceans Don’ taste or ‘snit chemicals Thought Co. LABORATORY SAFETY RULES Know the proper procedure for using the emergency shower and eye wash station. 2. Inform your instructor immediately if ‘spill any chemicals on your skin or clothing. Use laboratory tongs or holders when handling hot glassware or equipment. Dispose of laboratory waste properly according to the school s safety and environmental guidelines. Be alert and focused at all times to prevent accidents and ensure safety. 6. Keep your workstation clean and organized to reduce the risk of spills, fires, or broken glassware Keep all laboratory doors and windows closed during experiments to maintain proper ventilation control."
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "lab",
        "ocr_text": "ab Safety Rules Don t play mad scientist safety equipment 9 fotow te instructions an a ress appropriately »t t know what to doin ‘case of an accident Important L know the location of Leave experiments ‘at the lab ‘Don t taste oF sniff chemicals ThoughtCo LABORATORY SAFETY RULES for using the Know the proper procedure t emergency shower and eye wash station. 2. Inform your instructor immediately if you spill any chemicals on your skin or clothing. Use laboratory tongs or holders when handling hot glassware or equipment. Dispose of laboratory waste properly according to the school s safety and environmental guidelines. Be alert and focused at all times to prevent accidents and ensure safety. 6. Keep yout workstation clean and organized to reduce the risk of spills, fires, or broken glassware. Keep all laboratory doors and windows closed during experiments to maintain proper ventilation control."
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "lab",
        "ocr_text": "Important Lab Safety Rules come ne een aewenes ‘ ?. sonata ens ice eR Ser poet LABORATORY SAFETY RULES Secure all joose items like ords to prevent a without reading 2 notebooks and g. Never start an experiment wt the laboratory satety guidelines first Keep chemical containers fight! ty closed when not in use to pr event spills an evaporation. Tie back long hair and ayod wearing loose clothing oF accessories ag experiments. Always follow the laboratory instructor s directions carefully to ensure safe working environment. uctions pee ofr funders ar Ben io prevent stakes ‘and accidents Avoid using damaged or cracked glassware to prevent accidents."
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "lab",
        "ocr_text": "Know the location of safety equipment Don t play mad scientist So é in A 0 cress appropritety Leave experiments 4g ff Know what to don at the lab case of an accident Important Lab Safety Rules A Sir chemeats rTexperiment Ha on yourselt Thought Co LABORATORY SAFETY RULES Secure all loose items like notebooks and cords to prevent accidents. 2. Never start an experiment without reading the laboratory safety guidelines first. Keep chemical containers tightly closed when not in use to prevent spills and evaporation. Tie back long hair and avoid wearing loose clothing or accessories during experiments. Always follow the laboratory instructor s directions carefully to ensure a safe working environment. understand all instructions 6. Read an before Land. any experiment to prevent mistakes and accidents. Avoid using damaged or cracked glassware to prevent accidents."
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "lab",
        "ocr_text": "Know the location of Important Lab Safety Rules Safety equamene a Folow the instructions DON play mad sintg 7. ?¢ ress appropriately Leave experiments at the lab Thought. LABORATORY SAFETY RULES Secure all (pose items like Notebooks and Cords to prevent accidents. nt without reading the laboratory Safety guidelines first, Keep chemical Containers tightl closed when not in use to prevent Spills an evaporation, Tie back long hair and avoi id Wearing loose clothing or accessories during experiments. vironment, 6. Read nd understand all in: ictions before start a e mts t any exper} prevent mistakes and accidents, ‘Avoid using dama ged or cracked glassware to pre vent accidents."
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "lab",
        "ocr_text": "les fmportant Lab Safety Ru LABORATORY SAFETY AULEs Secure ail loose items like Notebooks and Cords fo prevent accidents Oraiory Salety Keep chamical containers tightly close. uSé to prevent spills Tle back long hair and avei d when not in 4nd evaporation, SS clei ing or accessories Always follow the laboratory instructs: carefully to ensure safe Worki 2d understand alt in, HUNG any experi Mistakes and aecicde! Avoid using damaged or Cracked glassware to Prevent accidents. Ss directions Ng environment,"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "lab",
        "ocr_text": "Important Lab Safety Rules Thought LABORATORY SAFETY RULES Secure all lose items like notebooks and cords to prevent accidents. 2. Never start an experiment without reading the laboratory safety guidelines first Keep chemical containers tightly closed when not in use to prevent spills and evaporation. Tie back long hair and avoid wearing loose clothing or accessories during experiments. Always follow the laboratory instructor s directions carefully to ensure a safe working environment. 6. Read and understand all instructions before starting any experiment to prevent mistakes and accidents. Avoid using damaged or cracked glassware to prevent accidents."
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "lab",
        "ocr_text": "“rower ccwent Important Lab Safety Rules safety equipment oe ee s i u om oy rg ae mo case of an accident Thought, LABORATORY SAFETY RULEs Do not touch or taste any substance in the laboratory unless instructed to do so. 2. Inform your Instructor immediatly yi i spill any chemicals on Never Pipette solutions by mouth; always use a Pipette bulb or filler’ Never perform unauthorized experiments or joie Of US@ equipment without Proper Supervision. Keep flammable materials away from Open ames and heat sources. before Sang understand all in io prevent mistal Always inspect safety e quipment before Starting any laborato; ry experiment."
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "lab",
        "ocr_text": "ve Thoughe LABORATORY SAFETY RULES: Ste any substance in ine MStructed to do sc son EVEr pipette sof pi UtNor ize ions by Mouth; aways use 3 2tté bulb ar filler Ne VF Pertern ung USE OquiDMent wi imabie materials away from aMes and heat Sources, open Always inspect Safety equipment before Starting any laboratory exderiment,"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "lab",
        "ocr_text": "Important Lab Safety Rules Don t play mad scientist Follow the instructions Thought LABORATORY SAFETY RULES Do not touch or taste any substance in the laboratory unless instructed to do so. 2. Inform your instructor immediately if you spill any chemicals on your skin or clothing, Never pipette solutions by mouth; always use a pipette bulb or filler. Never perform unauthorized experiments or use equipment without proper supervision Keep flammable materials away from open flames and heat sources. 6. Read and understand all instructions before starting any experiment to prevent mistakes and accidents. Always inspect safety equipment before starting any laboratory experiment."
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "lab",
        "ocr_text": "row ine wewen ot Important Lab Safety Rules ‘safety equipment Don t play mad scientist lesrepeiese BRIA teereiartrort eta me cecceees Don’ taste or ‘snitt chemicals ‘waste properly ThoughtCo. LABORATORY SAFETY RULES Do not touch or taste any substance in the laboratory unless instructed to do so. 2. Inform your instructor immediately if ‘spill any chemicals on your skin or clothing. Never pipette solutions by mouth; always use a pipette bulb or filler. Never perform unauthorized experiments or use equipment without proper supervision. Keep flammable materials away from open flames and heat sources. ead nd understand all instructions fore sta any experiment to prevent mistakes and accidents. Always inspect safety equipment before starting any laboratory experiment."
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "lab",
        "ocr_text": "row ne weationot ~Lmportant Lab Safety Rules ae crite a rolowtetnstrucions _ Deny mad scent (a S Leave experiments Know what to do in at the lab case of an accident jon taste or TEs Don t experiment ‘on yoursett ThoughtCo. LABORATORY SAFETY RULES Do not touch or taste any substance in the laboratory unless instructed to do so. 2. Inform your instructor immediately if you spill any chemicals on your skin or clothing. Never pipette solutions by mouth; always use a pipette bulb or filler. Never perform unauthorized experiments or use equipment without proper supervision. Keep flammable materials away from open flames and heat sources. 6. Read and understand all instructions before starting any experiment to prevent mistakes and accidents. Always inspect safety equipment before starting any laboratory experiment."
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULES Avoid blocking ventiation areas or fume hoods while conducting experiments. 2 Use oniy Work in pairs or groups only when permitted and maintain awareness of your surroundings. d and understand al fa before boratory instructions ard safety labels nandiing any svaterials, Do not run, play, or engage in horseplay inside the jJaboratery at any lime 6 Wash your har rougi every expenment to remove any tr Gai hazardous ma’ Handie all biological samples carefully and dispose of them properly after use."
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "lab",
        "ocr_text": "Important Lab Safety Rules Thought. LABORATORY S Avoid blocking yentiiatio whe conducting exp fe and 101 APETY RULES nareas or lume nods eriments. ne material eel for Your specific ase ont 2 Work in pales of groups only wher permitied and mainiain awareness of your surroundings. tions and safety jabels Read and undarsiand at jab pafore hand NS. De nat mn, play, OF engage In horseplay inside the iaporaiory al any dime ii of EVE uy ands thora' Bt h OUs i biological samp! of them proper Handie 2 es carefully ly after use. ‘and dispose"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "lab",
        "ocr_text": "feporiant Lal Safety Rules LABORATORY SAFETY RULES Avoid blocking ventilation areas or fume hoods while conducting experiments, fy the ry Work in iTS OF group main if awareness and understand before Do not TUN, play, or engage in horseplay inside the laboratory atan y time. 8 Handie all biclogical samples carefully and dispose of th eM properly after use,"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "lab",
        "ocr_text": "ems lmportant Lab Safety Rules pens py red wit ct Donen Dress apprapearey ° i rege experionet’ ete oe i TheughtCo. LABORATORY SAFETY RULES Avoid blocking ventilation areas Of fume hoods while conducting experiments. 2 Use only the materiais and tovis assigned for your specific experiment. when permitted and Work in pairs oF groups only t maintain awareness of your surroundings. Read and understand all aboratory instructions and safety labels ‘before hancling any materials. Do not run, play, OF engage in horseplay insi laboratory at any time. ‘Wash your hands thoroughly afier every experiment to remove any aces, of chemicals or nazardous materials. _ Handie all biological samples carefully and dispose of them properly after use. de the"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "lab",
        "ocr_text": "Important Lab Safety Rules Low the socation of satay encigmane Poliow the mrtevciions Deeft play mad oolentins F re Cress apprancittety Dew’ tte oF snitt chersicaie Thought LABORATORY SAFETY RULES Avoid blocking ventilation areas or fume hoods while conducting experiments. 2, Use only the materials and tools assigned for your specific experiment. Work in pairs or groups only when permitted and maintain awareness of your surroundings. Read and understand all laboratory instructions and safety labels before handling any materiais. Do not run, play, or engage in horseplay inside the laboratory at any time. 6. Wash your hands thoroughly after every experiment to remove any traces: ct chemicals or hazardous materia s. Handle all biological samples carefully and dispose of them properly after use."
    }
]