[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULES Ensure proper ventilation when working with strona smelling or toxic substances. 2. Be familiar with the location of fire extinguishers and first aid kits. Never remove chemicals or laboratory materials from the lab without permission. a. Keep your workstation clean and organized to reduce the risk of spills, fires, or broken glassware. Always follow the laboratory instructor s directions carefully to ensure a safe working environment. Never eat, drink, or store food inside the laboratory to avoid contamination or chemical ingestion. 7. Do not mix chemicals unless instructed to do so by your laboratory teacher. 8. Never start an experiment without reading the laboratory safetv auidelines first 9. Use safety shields or goggles when working with materials that may splash or explode. ‘hy 5."
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULES Ensure proper ventilation when working with strona smelling or toxic substances. 2. _Be familiar with the location of fire extinguishers and first aid kits. Never remove chemicals or laboratory materials from the lab without permission. 4. Keep your workstation clean and organized to reduce the risk of spills, fires, or broken glassware. Always follow the laboratory instructor s directions carefully to ensure a safe working environment. Never eat, drink, or store food inside the laboratory to avoid contamination or chemical ingestion. 7- Do not mix chemicals unless instructed to do so by your laboratory eacher. 8. Never start an experiment without reading the laboratory safetv auidelines first s. Use safety shields or goggles when working with materials that may splash or explode. 1. 5,"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULES Ensure proper ventilation when working with strona smelling or toxic substances. 2. _Be familiar with the location of fire extinguishers and first aid kits. Never remove chemicals or laboratory materials from the lab without permission. 4. Keep your workstation clean and organized to reduce the risk of spills, fires, or broken glassware. Always follow the laboratory instructor s directions carefully to ensure a safe working environment. Never eat, drink, or store food inside the laboratory to avoid contamination or chemical ingestion. 7 Do not mix chemicals unless instructed to do so by your laboratory teacher. 8. Never start an experiment without reading the laboratory safetv auidelines first. *. Use safety shields or goggles when working with materials that may splash or explode. 5."
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULES 1 Ensure proper ventilation when working with strona smelling or toxic substances. 2. __Be familiar with the location of fire extinguishers and first aid kits. Never remove chemicals or laboratory materials from the lab without permission. 4 Keep your workstation clean and organized to reduce the risk of spills, fires, or broken glassware. 5 Always follow the laboratory instructor s directions carefully to ensure a safe working environment. Never eat, drink, or store food inside the laboratory to avoid contamination or chemical ingestion. 7. Do not mix chemicals unless instructed to do so by your laboratory teacher. 8. Never start an experiment without reading the laboratory safetv auidelines first. 8. Use safety shields or goggles when working with materials that may splash or explode."
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULES Ensure proper ventilation when working with strona smelling or toxic substances. 2. _ Be familiar with the location of fire extinguishers and first aid kits Never remove chemicals or laboratory materials from the lab without permission. 4. Keep your workstation clean and organized to reduce the risk of spills, fires, or broken glassware. Always follow the laboratory instructor s directions carefully to ensure a safe working environment. Never eat, drink, or store food inside the laboratory to avoid contamination or chemical ingestion. 7 Do not mix chemicals unless instructed to do so by your laboratory teacher. 8. Never start an experiment without reading the laboratory safetv auidelines first 9. Use safety shields or goggles when working with materials that may splash or explode. 1. 5,"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "lab",
        "ocr_text": "ES when ware. LABORATORY SAFETY RUL or heat resistant glove hot eauipm glass Report ail vou ter how minor, to accidents, no matter ediatelv. instructor ir a yo ical equipment IS ture! after use to prevent hazards. Never perform unauthorized experiments oF use equipment without proper supervision. Make sure to ret torials to their proper pie Ensure that ali eler 3, OF EQUIP: Keep aisies and exits c 3 Do not touch of tasie any substance in the laboratory ‘iniess instructed. to da 50."
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "lab",
        "ocr_text": "LABORS BIORY SAFETY BUD LES Use longs or heat re: nand ne hol edu Ha Report ail accidenis, ny structor i Ensure s Never perform unautho me 5, of equipment in the laboratory"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "lab",
        "ocr_text": "Use tongs or heat resistant gloves when handling hot equipment or glassware. Handle chemicals with care and avoid direct inhalation of Report all accidents, no matter how minor, to vour instructor immediatelv. Always wear laboratory attire, including a lab gown, gloves, and safety protect yourself from harmful substances. Ensure that all electrical equipment is turned off after use to prevent hazards. Never perform unauthorized experiments or use equipment without proper supervision. Make sure to return all tools and materials to their proper places after ise Keep aisles and exits clear of bags, stools, or equipment at all timec Do not touch or taste any substance i in the laboratory"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "lab",
        "ocr_text": "Use tongs or heat resista handling hot equipment Mande chemicals with care ang nt gloves when OF glassware. a Tumes_ ee 4 oe Report ali accidents, no matter how minor, to ‘ays wear Proper ra attire, inchs 2 lab gown, Gloves, Ans safety goggies, to protest yourself j sell trom Danntul substances,\" Ctrical equipment is fumed off to prevent hazards, _"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "lab",
        "ocr_text": "Use tongs of heat: dling hot equip ¢, no matter how mind! mediately 3a palin Report all ac id your instructor i x laboratory attire, cal equipment is tun after use 1 prevent hazards. Never periorm unauthorized ext use equipment without proper jake sure to return ali tools and mater fais flee tes exits clear of ba: at al fires stance in tf Keep aisies ane stools, or equipmen ye laboratory t Do not touch oF al"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "lab",
        "ocr_text": "Do not pipette liq mouth; always use a pipette aid or bull Keep your workspace free from clutter to prevent accidents. Always double check labels before using any chemical oar solution Keep peat workspace clean and organized to prevent spills, accidents, or equipment damage. Do not mix chemicals unless instructed to do so by your laboratory teacher. Use caution when plugging or unplugging electrical equipment in the lal Always listen carefully to safety instructions before performing any labora’"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "lab",
        "ocr_text": "Do not pipette liquids by mouth; always use a pipette aid or bull Keep your workspace free from clutter to prevent accidents. Always double check labels before using any chemical or soliitinn ; Follow all laboratory rules and listen carefully to safety instructions ments Wash your hands thoroughl before and after rf any experiment. Keep yout workspace clean and organized to prevent spills, accidents, or equipment damage. Do not mix chemicals unless instructed to do so by your laboratory teacher. Use caution when plugging ort unplugging electrical equipment in the lal Always listen carefully to safety instructions before performing any labora’"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "lab",
        "ocr_text": "- ABORATO way SAPETY RULES pipelte liquids bY mouth; always use a ipeite aid or bulb. Do ne 18 Always dot ibie c ami keep your woksi check. labels before e using any Alor ach Follow nye wi rks ace clean mys c Don Use caution is Alway"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "lab",
        "ocr_text": "Do not pipette liquids by mouth; always use a pipette aid or bulb. Keep your workspace free from ‘clutter to prevent accidents. Always double check labels before using any chemical or salution Follow all laboratory rules and listen carefully to safety instructions before, during, and after e periments. ly before and after periment ex! Keep yout workspace clean and prevent spills, accidents, or equipment damaqe. tructed to do so by your laboratory Do not mix chemicals unless ins' teach Wash your hands thorough performing an’ organized to er. Use caution when plugging or unplugging electrical equipment in the la Always listen carefully to safety instructions before performing any laborato! activity."
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "lab",
        "ocr_text": "Do not ipette liquids b h; always use a p bi Dinette \"aid or or or bul ¥s Keep your workspace tree Always double check labels b Spr or aittion Follow all laboratory rule: Sn efully mix chemi chemicals ues bedi do Use caution when Plugging ou Always listen careful to"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULES Use tongs or heat resistant gloves when handling hot equipment or glassware. 2, Never eat or drink inside the laboratory to avoid contamination Report all accidents, no matter how minor, to vour instructor immediately. Know the location of safety equipment such as fire extinguishers, first aid kits, and emergency exits. Label all chemical containers properly to prevent confusion and misuse. Keep your workspace clean and organized to prevent spills, accidents, or equipment damaqe. Keep chemical containers tightly closed when not in use to prevent spills and evaporation. Keep aisles and exits clear of bags, stools, or equipment at all timac Never leave an ongoing experiment unattended at any time. 4. 6. th"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "lab",
        "ocr_text": "ORATORY SAFETY RULES loves when lassware. LAB Use tongs or heat resistant g handling hot equipment or g 3. Never eat or drink inside the laboratory to avoid contamination. Report all accidents, no matter how minor, to vour instructor immediately. 4. Know the location of safety equipment such as fire ‘extinguishers, first aid kits, and emergency exits. Label all chemical containers properly to prev confusion and misuse. ace clean and organized to ents, or equipment damage. closed when not in use to prevent spills an’ ti evaporation. 8. Keep aisles and exits clear of bags, stools, or equipment at all times leave an ongoing experiment unattended at any time. ent Keep your worksp prevent spills, accid 7. Keep chemical containers tighth 3. Never"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAF, Eve RULES Use tongs or heat resistant gloves when handling hot Equipment or glassware. 2. Never eat or drink inside the laboratory to avoid contamination, Report all accident: minor, to aid kits, and emergency exits, Label all chemical Containers Properly to prevent Confusion and Misuse, re extinguishers, first accidents, or equipi l ep chemical Containers tight| closed when not in use to Prevent Spills an evaporation. Keep aisles and exi ts clear of bags, stools, or Equipment at all timac"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "lab",
        "ocr_text": "Use tongs or heat resistant gloves when handling hot equipment or glassware. Never eat or drink inside the laboratory to avoid contamination, Report all accidents, no matter how minor, to vour instructor immediately. Know the location of safety equipment such CD extinguishers, first Label all chemical containers properly to prevent ona e Keep your workspace clean and organized to prevent spills, accidents, or equipment damage. Keep chemical containers tightly closed when not in use to prevent spills and evaporation. Keep aisles and exits clear of bags, stools, or equipment at all timec Never leave an ongoing experiment unattended at any"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULES fing hot equinom: tory 1) avid o matter how minor, to r immediately. extinguishers, first Report all accia your inst 2 Keep dents preve Keep your workspace Cl oF eQUuuyne mi Keep ais! nt unattended at any Never leave a"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "lab",
        "ocr_text": "Always wash your hands thoroughly after handling chemicals or laboratory samples. Keep your workspace free from clutter to prevent accidents. Tie back long hair and avoid wearing jewelry that miaht interfere with lab wor! Handle all equipment and materials carefully, and report any Do not run, play, oF engage in horseplay inside the laboratory at any time. Dispose of laboratory waste properly according to the school s safety and environmental guidelines. Do not mix chemicals unless instructed to do so by your laboratory }e Avoid leaning too close to reactions or open flames while observina experiments. Always listen carefully to safety instructions before performing any laboratory activity."
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "lab",
        "ocr_text": "Always wash your hands thoroughly after handling chemicals or laboratory samples. 1p Your workspace free from clulter to prevent accidents, Tie back long hair and avoid wearing jewelry mA that miaht interfere with lab wor! Handie ali equipment and materials carefully, and repert any g .Samaged tools of containers to your instructor mmediately, Do not run, play, or engage in horseplay inside _____the laboratory at anytime. _ ease jaboratory waste properly according tol fi ihe school s safety and environmental guidelines. s Do not mix chemicals unless instructed to do so by your laboratory je acher. Avoid leaning ton close to reactions or opan flames while i observing experiments. instructions before any jaborat lory activity. SE MARL AS Slee T ee nl ene ee oe"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULES Always wash your hands thoroughly after handling chemicals or laboratory samples. 2. _ Keep your workspace free from clutter to prevent accidents. Tie back long hair and avoid wearing jewelry that miaht interfere with lab wor! 4. Handle all equipment and materials carefully, and report any damaged tools or containers to your instructor immediately. Do not run, play, or engage in horseplay inside the laboratory at any time. Dispose of laboratory waste properly according to the school s safety and environmental guidelines. 7. Do not mix chemicals unless instructed to do so by your laboratory eacher. 8 Avoid leaning too close to reactions or open flames while observina exneriments Always listen carefully to safety instructions before performing any laboratory activity."
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "lab",
        "ocr_text": "long hair and ay that miohg interfere ‘andle aff equipment ar Mm ed tos} boratery choal s Safety an, Guidelines O Rot mix chemicals uni Structed to de so bY Your laborator Sacher Avoid Betions or Open flay S exoarmeanis '9 safaty nstructig E HOTY ack Mes while AS before"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "lab",
        "ocr_text": "Always wash your hands thoroughly after handling chemicals or laboratory samples. workspace Tie back long hair and avoid wearing jewelry that miaht interfere with lab wo! je all equipment and materials carefully, and report any i Ht NSTUCCOL IMME Do not run, play, or engage in horseplay inside the laboratory at any time. Dispose of laboratory waste property according to the school s safety and environmental guidelines. Do not mix chemicals unless peg to do so by your laboratory Avoid leaning too close to reactions or open flames while observina exoeriments. Always listen carefully to cell instructions before performing any laboratory activity."
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "lab",
        "ocr_text": "Use tongs or heat resistant gloves when handling hot equioment of glass S Never remove c! materials from the"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "lab",
        "ocr_text": "Use tongs 0 eat resisiant iii OF equipment 0 org is of jaboralory ernove hemica ission. Never’ materials from, the jab without perms Mande aqui ant and mate ret fully, pment s and damage... ith chemicals and ‘always ust nding nazerdous gupsiances. cts before: using them ar rect at Is when ha amage oF defer eepataty i"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULES sr heat resistant gloves when nt or glassware. ae z 2 or laboratory ssion. on any Handle all laborato hemicais and always use sydous substan ising there many a inform you! id bio"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "lab",
        "ocr_text": "Use tongs or heat resistant gloves when handling hot equipment or gla: How you teacher’ instructions careful before handing any materials, Never remove chemicals or laboratory materials from the lab without permission. Handle all equipment and materi lly, and rey ama IS Or ‘act with chemicals and always use Proper tools when handling hazardous substances. Check all equipment for damage or defects before using them in any experiment. Inform your instructor immediately if you spill any chemicals .__On vour skin or clothina. Avoid blocking ventilation areas or fume hoods while conducting riments."
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULES Use tongs or heat resistant gloves when handling hot equipment or glassware. a Never remove chemicals or laboratory materials from the lab without permission. 4. Handle all equipment and materials carefully, and report any damaged tools or containers to your instructor immediately. Handle all laboratory equipment with care to avoid accidents and damage. Avoid direct contact with chemicals and always use proper tools when handling hazardous substances. 7. Check all equipment for damage or defects before using them in any experiment. 8. |nform your instructor immediately if you spill any chemicals on vour skin or clofhina 9. Avoid blocking ventilation areas or fume hoods while conducting experiments. 5s."
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULES Never leave open flames unattended during experiments. 2, Stay alert and avoid horseplay or distractions while in the laboratory, Tie back long hair and avoid wearing jewelry that miaht interfere with lab work. 4. Never eat or drink inside the laboratory to avoid contamination and accidental ingestion of chemicals. Ensure that all electrical equipment is turned off after use to prevent hazards. Dispose of laboratory waste properly according to the school s safety and environmental guidelines. 7.) Work in pairs or groups only when permitted and maintain awareness of your surroundings. Ensure that all chemical waste is disposed of in properly lahaled enntainere Donothandle sharp instruments carelessly; always point them away from yourself and others."
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAF e 25 Stay alert and avoid horseplay or distractio Tie bac Never eat o; Ensure that that miaht in k long hair drink inside the laborato all chemical waste is dis; lahalad Do not handle sharp instru lem away from chemical: all electrical equipmen prevent haza cantainare iments cart b worl Is. Ids. yourself and others, ETY RULES unattended during ‘xperiments. ns while in the laboratory and avoid Wearing terfere with la jewelry to avoid Contamination and accidental ingestion of t is turned off s, according to guidelines. intain awareness POsed of in Properly elessly; always point"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "lab",
        "ocr_text": "Never leave open flames t unattended during experiments. y ar and avold herswplay oF distractions while tn the Inbvorateny Eas RS Tie back ong hair and avoid wearing yewerry that miaht interfere with lab wor! i Never eat or drink inside the laboratory to avoid contamination and PS. ntal ingestion o all electrical equip __after use to preventhazards. ‘Dispose c of laboratory waste proper! according to _ the school s safety and environmental guidelines. 4 Work in pairs or groups only when permitted and maintain awareness of your surroundings. Ensure that ail chemical waste is disposed of in properly ed lahelad enntainere ay _ Do not handle sharp instruments carelessly; always point"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "lab",
        "ocr_text": "bac g hal and avoid that reat intericre with ide the fa ite {electrical equipment ig furne use to prevent hazel ‘ds. ose of laboratory wasie properly é Disp the schools safely and enviro onmenial guid permitted and pau Werk in pairs of grou of ndings. ty thal after sure frat alt chernical waste is disposed of in propery halad en i . =) ays Pont Be not hand Ft"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "lab",
        "ocr_text": "Never leave open flames unatiende iments. in y the laboratan Tie back to ig hair and avoid wearing je that miaht interfere with lab OrK. Never sat or drink 2 is Kebe Ensure that all electrical equipment alter use to prevent f d of laboratory waste properly according fo _ ihe school s safety and savironmental guidelines Work in pairs or groups or nsure that ail chemical waste is disposed of fshelori can share instr"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "lab",
        "ocr_text": "Keep flammable subs' noes away frarn _hurners. nts het or electrical eit Ensure that all Sec sirical equip turned off 7 afier io prevent hazards, oo Tie back long hair and avoid wearing ioose clothing er accessories during experiments. Use laboratory tongs or holders whi handing hot glassware or pen fames white"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULBs Always wash your hands thoroughly after handling chemicals Or laboratory samples. Keep Your workspace tree from clutter to Prevent accidents Keep flammable substances a rs Nes _or electrical outlets 4 Never eat or drink inside the labo) accidental ingestion of chemi Ensure that all electrical equipment is turned off alter use to prevent hazards. avoid wearing loose Avoid leaning too close to reactions or Open flames while observina experiments, ongoing experiment Unattended at any time."
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "lab",
        "ocr_text": "Always wash your hands thoroughly after handling chemicals or laboratory samples Keep your workspace free from clutter to prevent accidents. Keep flammable substances away from burners matches or electrical outlets Never eat or drink inside the labo: contamination and Ensure that all electrical equipment is turned off after use to prevent hazards. Tie back long hair and avoid wearing loose clothing or accessories during experiments. Use laboratory tongs or holders when handling hot glassware or equipment. Avoid leaning too close to reactions or open flames while observina experiments. Never leave an ongoing experiment unattended at any"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "lab",
        "ocr_text": "Always wash your hands thoroughly after handling chemicals or laboratory samples. Keep your workspace free from clutter to prevent accidents. Keep flammable substances away from burners matches or electrical outlets Never eat or drink inside the laboratory to avoid contamination and accidental ingestion of chemicals. Ensure that all electrical equipment is turned off after use to prevent hazards. Tie back long hair and avoid wearing loose clothing or accessories during experiments. Use laboratory tongs or holders when handling hot glassware or equipment. Avoid leaning too close to reactions or open flames while observina exneriments. Never leave an ongoing experiment unattended at any"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "lab",
        "ocr_text": "ash Your “hands thorou ight ly afier handling of ETE or laborate 'y samples. Keep flammable ae away from bumers ma fches or electrical olitlets Tie back long hair and ‘avoid ‘wearing loose clothing or accessories during pedis Use laboratory t"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "lab",
        "ocr_text": "LSBORATORY SAPETY tRUL ES Do not pipette liquid Ss by m u always use a Recort alla Avid touch Do not run, pia y¥, or enga ge in horsep ine laboratory at any time. inink, or store food inside Pe lab to ave id contamiin atic an your work h your har vas bef Abways hancie cle"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "lab",
        "ocr_text": "Do not pipette liq mouth; always use a pipette aid or bulb Keep your workspace free from clutter to prevent accidents. Report all accidents, no matter how minor, to vour instructor immediately. Avoid touching your face, eyes, or mouth while hat cal materials to prevent contami a Do not run, pla ly, or engage in horseplay inside the laboratory at any time. Never eat, drink, or store food inside the laboratory to avoid contamination or chemical ingestion. Always clean your work area mae ween your hands before leaving the ratory. Always handle glassware carefully to avoid cuts and injuries. Use safety shields or goggles when working with materials that may splash or explode."
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "lab",
        "ocr_text": "ATORY SAFETY RULE quids by mouth, alwal ys use fife aid oF 1 io prevent acc LABOR Do not pipette i port 2 ail accicenis, NO matte your instructer wee r how minor, fo chemica De not run, play, the ‘bore store ey inside the laboratory x ar eat, drink, void coniam ration nemical inge ba a e."
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "lab",
        "ocr_text": "fall accicents no matter h how Minor, to or nn your instructer immediately, Avoid EEXGTigy BY HOrsepiay inside ra a any time. ak, or store food insid io avoid contarinatio or Always: clean your work Brea a e the laboratory a oe ingestic n. Always handle GESsiaL jf Use safe"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "lab",
        "ocr_text": "Do not pipette liquids by mouth; always use a pipette aid or bulb. Keep your workspace free from clutter to prevent accidents. Report all accidents, no matter how minor, to vour instructor immediatelv. Avoid touching your face, eyes, or mouth while handling chemicals or Do not run, play or engage in horseplay inside the laboratory at any time. Never eat, drink, or store food inside the laboratory to avoid contamination or chemical ingestion. Always clean your work area pnd wash your hands before leaving the ratory. Always handle glassware carefully to avoid cuts and injuries. Use safety shields or goggles when working with materials that may splash lode."
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "lab",
        "ocr_text": "ORAT ORY SAFETY RULES Hare OF y report broken we equipme en to the immediz maffunct y Use whoratory toals only ineir inte: Keep flam mabe substances 3 away from airnears AT he! oF al ie 3 be a Rea ad. and underst: sed Done Always weat gloves, anc 8 %"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "lab",
        "ocr_text": "port broken glassware or malfunctioning equipment to the instructo! Use laboratory tools only for their intended purposes. Keep flammable substances away from burners matches or electrical outlets Read and understand all instructions before starting any experiment to prevent mistakes and accidents. Do not run, play, or engage in horseplay inside the laboratory at any time. Always wear proper protective equipment such as lab coats, gloves, and safety goggles before starting any experiment. Use laboratory tongs or holders when handling hot glassware or equipment. Inform your instructor immediately ifyou spill any chemicals on vour skin or clofhina. Keep water away from electrical outlets and equipment to prevent short circuits."
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "lab",
        "ocr_text": "Immediately report broken glassware oF malfunctioning equipment to the instructor. Keep flammable substances away from burners matches or electrical outlets Read and understand ail instructions before starting any experiment smasonrnnnnannetO FEVER mistakes, and acide E ER Always wear proper protective equipment such as lab coats, * gloves. arid safety goggles before starting any experiment. * Use laboratory tongs or holders when handling hot glassware or A equipment. inform your instructor immediately you Spill any chamicais : on vour skin or clofhina 5 3) Keep water away from electrical outlets and equipment to revent short circuits. SEG EEL EEE"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "lab",
        "ocr_text": "Immediately report broken glassware malfunctioning equipment to Keep flammable substances away from frical avitie lay, or engage in horseplay 2 laboratory at any time. _ ve equipment such as la before slarting any exper Use laboratory tongs or holders whe: Cora inform your instructor y On vo"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "lab",
        "ocr_text": "LABORATORY SAFETY RULEs Immediately report broken glassware or malfunctioning equipment to the instructor. 2. Use laboratory tools only for their intended purposes. Keep flammable substances away from burners matches or electrical oritlets 4. Read and understand all instructions before starting any experiment to prevent mistakes and accidents. Do not run, play, or engage in horseplay inside the laboratory at any time. 3 Always wear proper protective equipment such as lab coats, gloves, and safety goggles before starting any experiment. 7 Use laboratory tongs or holders when handling hot glassware or equipment. 8. Inform your instructor immediately if you spill any chemicals on vour skin or clofhina 8. Keep water away from electrical outlets and equipment to prevent short circuits. 5."
    }
]