[
    {
        "image": "lessons1_synth_10_aug1.png",
        "label": "lessons",
        "ocr_text": "foe aesiyss Snizcine cere cave itn haha ane exhir aBtie cuetaten, Aap Scars theses ts Psoaoe wart, i i |icrogewne atuaroninene tanaka Secyoncratyayeenizenes | Grom dennayedimrscnotedormancediten sume sar cai Say, «Vk esi cet fe tas paris 9 gee cua arene reat |r ose Seas: Reg avira stan, eae GSN, Neneh ayaa WOMTEaEE Sues praia crayon siete zt, os pause cm Kain tesa®, cemarvearsie Barry ssn Tecatna pooner wrt maonads pseraten aise Gnrsims, nanoa on [sent sce, atry anata tes, ng tela. i"
    },
    {
        "image": "lessons1_synth_10_aug2.png",
        "label": "lessons",
        "ocr_text": "= Tayentad [meaner Sheptne Sonens: ese | eva an Leeman [pane Prion ear toes witin Nelieal ani ctu venient, eerste tis ow ary [eterna Apaiy Mey Vaecnes to Page wer aigrocones snd demonstrate ativctive witien 20 en vs a | esto! serty, Vadues: rouge! fer diverse perspectives anc pramaka cuura axareness tessgs Ticsais Reameg enone Anmytaae essay onset b i"
    },
    {
        "image": "lessons1_synth_10_aug3.png",
        "label": "lessons",
        "ocr_text": ""
    },
    {
        "image": "lessons1_synth_10_aug4.png",
        "label": "lessons",
        "ocr_text": "SRIVERSITY OF The BHLireRES ou {Yaar eae age scenes Sabin ‘SMerraton, apt trary tectes to PaSopne one “a Ceri Pasd sd 1shy spies anes Stray asters,» tse ivicieg wt ees muh sinstine: Raateig saponnn poo [vee esse exes terest srayjes wortshaate, Sommnatbe Saray soya nies bs, Santa pesenion arory sys satece. wing Wrssrey esc. teenie tnemtcrionen"
    },
    {
        "image": "lessons1_synth_10_aug5.png",
        "label": "lessons",
        "ocr_text": "teat Unive eRIrY OF THE PeALiPeN s fone “Tage 01 Grads Leenks ngratsd {Wine Raeme for i Shelton Suinnet: Looe: Sea 9 Frage orang Gag Te Ar ries eames yas mramancate HY eee pons nica sua ra revsgraa toe ia 9 meetae oratoratsng are |"
    },
    {
        "image": "lessons1_synth_1_aug1.png",
        "label": "lessons",
        "ocr_text": "hve ame foe | Disciplines subjects: Lesson Choate suey sagen me angaee Frain"
    },
    {
        "image": "lessons1_synth_1_aug2.png",
        "label": "lessons",
        "ocr_text": "erone mt sso BuceSer sig USRI poten ‘Sater poyuhenaingy. Cewansen esse! sonsiurae Surinam iets 0s, i Simone ae eognasta eae tr wan asta aeviseron 9 Setesa seas [neem ans ennaios: aha cactasn one” “A bos tupews town ene win deem inem 1 antcaie pigcne mnveren mpcones vheoen a soot oatintaety weno am ens wt Cunigiegr romeo ey | emcee, «anaes: Srrrate mental hewits RETIRING, Cg ESE Ciera, BA eivonete foe i [oes ements evan war enema toes i ans ees eaten wes ata Spans ca seo Raton: Werses exivonaton on sat snateabons, son lone tips reece ngaran Pen aorta tate wus, { | Bie dana swamp cos sa Wa oe WOM Frlgvine mana trices, eaten oxwtacatann Rance. ate petaiean Pope sr mone mit Eee cre treason Reve sso sosane esr preaaprns rnsrtenorowene nen “Shatcnniumesnns sh sonnet [Se Soe MR Surman atone Seren"
    },
    {
        "image": "lessons1_synth_1_aug3.png",
        "label": "lessons",
        "ocr_text": "Tage or Grade Level: integrated piucafises Subec ee Fenime For You nome [Rest | cen poyeenins. Geran cata seen ze acing et Mas \" Tay dsanon an aed anaes Tinka ies a 5 i Rotance a Prtapne vncer, Ske Anpip agente crn oaoe ecavares, ermate tetwaes [EOS dome oeeee ane vezapsze aomupuate stevernin anouaches «Atsione Develo i seg mses “ Viaiues: Promote menial Smaith pucweness, rasgeet ean: tanfetentivity, 2 recent of dics wi ovyehalngca' 4 VFocmsce Coas sivy acannon Sonmatve Botan erarinaton m Saenses Saesteatens, cate iste austzonant, useasen paper Wail sours sane ody Wo sssustes cuts! eonecaoons Raines i"
    },
    {
        "image": "lessons1_synth_1_aug4.png",
        "label": "lessons",
        "ocr_text": ""
    },
    {
        "image": "lessons1_synth_1_aug5.png",
        "label": "lessons",
        "ocr_text": "‘witegeated or Grade tes | picisines Subhert:| (ee [four names 1 aamesh Sith Silows moe reyensal ders wing DSS caren, Exon toi. ws ane actumneaugy, Derrectite 23h sein x ones Meni mah dapatie etme ew |e Semen in Mriippine cowtent. Skila; Apety agro’ ‘cries te nae snmicaros, ‘GHerensiaia Buweer: eran er tog reron recs neers POMBO ee asm acres we eens Se ee TILES se A peers aps omovies scx cena =| retest ef aos Ah pastoral Setar Famatre Cave stasy sts wanes, Saahan eves. se ces cuamiucsn rcv asseahn, case mofen mtg, Oe PS i Spi rary bh B62, “pons Sans, Prepnn R t 1 Biba Sagem sare os prataber, cute camnriations he sem"
    },
    {
        "image": "lessons1_synth_2_aug1.png",
        "label": "lessons",
        "ocr_text": "Tf rome ar [Bocas tenn i Faget ase Leanminae f Bors vaes yout of ctlewan squats vey seperate seston), Moa ants prwmane | soy ete rane. Vy seston anaytey end roeeneat [Vrouenge Gnbitinea vcattan 0 oer eqs so agree wen own | nesnarser anv veers enuatant, «Seas. Azsty seawusin of veates. agai oe i enscratenes: emai eaenacs bo itve Sturmnal pata acura, «Alu: Davie parctance mceon chang anc cuehtesce im ancy atta nies fo ese patna» tats Neocron toe Bonar ot aisumatins oaaeaug MISS phavensera oes Die impwrnToR SE preche maton sonaratisston i [pee i Ninn Gao 1 wanna renin tess save by one reves cestes en gE"
    },
    {
        "image": "lessons1_synth_2_aug2.png",
        "label": "lessons",
        "ocr_text": "ns Tintagranes revels stat? i] prciainesssubiets: Lesson: 1 \\ 4 so otnates ew ni Tameneramsir Fu, 08 H “Fics tens A ecw, SANA are: Aral $0900 Teceandan ang sesondorses an. ci [ee ee ox eee concurs i wae TE sae 1 \\ aoe 2 _gheromnesta Bt ipa PoE"
    },
    {
        "image": "lessons1_synth_2_aug3.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN. $209 Tee Easton mate Ae LESSON ACTIVITY INFORMATION Titer DETAILED LESSON PLAN IN DIFFERENTIAL EQUATIONS Your name: ‘Age or Grade Level: integrated Time frame for Disciplines Subjects: Lesson: Jeeeiter Hat Fest Year MATH 301 180 meses carp ant, Seud won erbam siing, henewan atsgnners sluion v Aaioy Ger ‘Sunmanve Sarre corena arcs etre eauaton pes pobemctovng eaceearee appieaten Project, ‘Scien calculators. graphing sohware. attended ‘cuatons reference tabes, sample poblens wih COMBE Solutions, modeing case stuses, practice. worksheets"
    },
    {
        "image": "lessons1_synth_2_aug4.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF THE PHLWPNES OHI Yisur Rai ‘Tine tanaior [cine aon smatertat Swe vainee year thecal wooo wig eee ats tcney as, Heh sta [tre stens epee, ves mamctagecgce ne aaehon mntrematice iaetenues io complex suubleK. Valves: A 90 atti waa oe 2. yy seve fester ant aecarcandr anaes, ehurutenies eqn nhos Pedeematheng ang ecotsance ooze mamsratice on ard wk pebian ag Seno [Seog eramation cover vain: ateentsyeaunson ‘oes. eaten zany astesd tse, seshoe 8 Yang subarea aunlinerateanca Wen, Fania oan wi eomnete solos, acai case states, ga ——|"
    },
    {
        "image": "lessons1_synth_2_aug5.png",
        "label": "lessons",
        "ocr_text": "Nae Frou ame a aeerre eners canoe sumer aoeny wren ant aaene Ge pce wurnk ewes we Oe"
    },
    {
        "image": "lessons1_synth_3_aug1.png",
        "label": "lessons",
        "ocr_text": "OELA SALLE UNWERSITY ein arg FAS ENT fg eS sa ak reas weno ‘Ges Taso Grane ct. iegated tone ve ‘STANDARDS, OBACTIVES, AGSESSNALINNS (A TERALS. rape bainans enacocmmns cag segs ramowrts Eoaaate erage sina eamemens eee semi. rae races sera wang man tee [ae ey amore sr connate ee er ciccn mpenouton tt card «dune Cones SHOT may. Ne {Fitrcze sees ono npr meommunasore ees en <A Cay {ema engine macnn one fee eras ae TE Tas Senge ecm os temmrnce ernemen to naenaia mane ene |nereome Cave wah ve paaganen Grey Groen eoiroatena, skalage Hamewenk Me IORENS emmatve: Gre wtatege pan pranentaton. eit cove yi piper iar aReIgerS ere ae a Hol Hanmee ene —— _ LESSON PROCEDURES OC wr seage mans ttee one oe peccposmmenperraneten) cop eenercae Son tose beet vmsennrocoe sree neces Tans necucins shor roma represen em wa SRiioemene shoes Bor nae vragen a A sencoce nen trop asus ab abe nas ee UMN feesensrath oomnemace wegen Paster $7! ent rest coe aeons semcerepe para maven ree [ess ———-4"
    },
    {
        "image": "lessons1_synth_3_aug2.png",
        "label": "lessons",
        "ocr_text": "DELASALLE UNIVERSITY 7 hm Tee wo ay [BENITA ORMANION ‘ie; DETAR igoncn Psan os Franti Manatevnt Yow tame ‘Aas 01 Grade evel. latngratied ‘ame fama for Oiseiptine Sebjocts: Lesson: i aust mens Steemteueeion ince ceeene _oseene Sane onrags Rerene cary BR ere eS H i Ret arty bt tapen Oa campers ol Rubs FMINTLT REO PVN scarey. 118 todstOn engemanen, wnd oO SAN Cantet BATT arcane Pos Fre Fores Samsewon ane dere ctamege acer nt eS GaN ADO Doras soreape Doky minal da pct tee ery cam annebe BaRIry ue Ve Pare SCH eta mbng wage cMmeA Re GOnORT We comnOnerD NALA BO EME | 298 $90 annonces Servuster Crea Wage fa ENE mr CANE SUES pm HE EEE sense, ee Beninevs coat tain. seataye managimers Gamers Ns Rane, AT aaigng terns tomes stern aging eke) gers jeramtaten ence !"
    },
    {
        "image": "lessons1_synth_3_aug3.png",
        "label": "lessons",
        "ocr_text": "“Tage Grade tava: ovegrarex Ying rae fr Sisiotines Sebiente besson! | sccumees vinne consteeg arts Peaaiie sPewatres Ng ypu CE 1 ra aiuto eernectah Stow sven rer.» Saae Sant NOY mates Pets / ae enenciacens fox Ivosinesy gases kittade: Uevetae ess Sawa apacochi, Vazsas: Prats cara tinene wectioes: pote ees sal cronconatng segs snics a Sms Jraee case sian, actos oamager seem samples mibay rps. resin OE i"
    },
    {
        "image": "lessons1_synth_3_aug4.png",
        "label": "lessons",
        "ocr_text": "suing svg! 8 sg. sentan for ast “Yates: Practce rainy a rsege"
    },
    {
        "image": "lessons1_synth_3_aug5.png",
        "label": "lessons",
        "ocr_text": "DE LASALLE UNIVERSITY i etn Tey ang | pteerated Time frame for Dislptines Subjects: Lesson, ‘Second Year"
    },
    {
        "image": "lessons1_synth_4_aug1.png",
        "label": "lessons",
        "ocr_text": "5 Viegas Bisciptines Subivcts: be ovation, aly Stay thao te Fs carats mijuewnise ae the epost,» hee: aaljze ray set sary harhage ar tavogni® ‘pes: ae apt fo eose pees 8 ae yrmistn are snes ning guides. Racy snatye wince, weteg ten ci sSRDURES"
    },
    {
        "image": "lessons1_synth_4_aug2.png",
        "label": "lessons",
        "ocr_text": "85 fost Within uatanny tree Aral jp eee sen. «Wan, H9 2! Swaroness thes Ee Restoe aces Sannane, ie Sse ona j Seises Prppon sey Toy ossavey gues. wane"
    },
    {
        "image": "lessons1_synth_4_aug3.png",
        "label": "lessons",
        "ocr_text": "ATENEO oi MANILA UsuMeRsyry Time Seana Yor { Discotines subinces: sersen. ahce Pspie era tes ts stn Sherwin sty acne Cine Gesstina dung ts SE, Anatice Wenn we Winn ane st st Fit Scary tr Anetin “abun Penta tts sacs eemegeate ents i ese ten 98 Merny soe age aes wasn he ote pmaistovcrouceraccy | Ronnath: tasting expanse facoah, a \"0 G08 Kasson tah ZEMES testy m sneotesver, duane SwPereremun, comrthentve Macey acs"
    },
    {
        "image": "lessons1_synth_4_aug4.png",
        "label": "lessons",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY ty staan rarnancennet [_ssonacriny nrommaton Title: DETAILED LESSON PLAN IN PHILIPPINE LITERATURE Your name: ‘Age Or Grade Level: integrated Time frame for Dawn Davis Fest Your v0 201 120 minees Femative: Reading response ous, smal goup discussions, textual nays worksheds, Sonmame ‘Anatycal essay on selected text, oral presentation on author research, comprehensive lery arate ‘Selected Prgpine Merry texts, multimedia presentation author Bograghes Kstorcal meine, rical eadng gces, terry anaiysis nas, wring templates. LESSON PROCEDURES tens ono tr do Sos tear nesoinn eto eure na eens Sioa Since (sm covacnonre eevee ean toe hana inten een"
    },
    {
        "image": "lessons1_synth_4_aug5.png",
        "label": "lessons",
        "ocr_text": "ai: integretart biseintinas Sugects: essen: 1 20 wieses Gon a and ies cemiouiens. «Gul: naire teat sass wo aporunrae arte “EERE fo Bo 65 ss fs ising etry bartage ane ron Beary sngagemant [remaiva: Reade mzonse aed, smal gus accuse \"yea oo sleet iit ea srasentvinn on aster"
    },
    {
        "image": "lessons1_synth_5_aug1.png",
        "label": "lessons",
        "ocr_text": "QE LASALLE UNIVERSRY"
    },
    {
        "image": "lessons1_synth_5_aug2.png",
        "label": "lessons",
        "ocr_text": "fategeacet Biscin Your name: i ‘Aan Hobbs avs Subjects: Lesson: TTB NBAnDs, SRIESHTS SS eeatnse tinteg ounesat ane x vstegie che issn Peocenbaes"
    },
    {
        "image": "lessons1_synth_5_aug3.png",
        "label": "lessons",
        "ocr_text": "DE LASALLE UNIVERSITY TLESSON ACTIVITY INFORMATION Tite: TETALED LESSON PLAN IN STRATEGIC MANAGEMENT Your name: ‘age or Grade Level: Integrated Time frame for Disciplines Subjects: Lesson: Aaron Hobs ‘Te Voor aus 3 omnes STANDARDS, OBJECTIVES, ASSESSMENTS MATERIALS “Peay business environments sing sae pemratves using aopopeate exten Crponatona capabities, Evatate sate vameworks. Fomaate satege pans consiseeg Trouiedge Wently ad expla the components of eaning, strategy formdation. mpmentaton, Five Forces framework, and develop tate rg contr» Sus: Conduct SWOT anaiyss. 20 Poe Femmatnve: Cave arayss pariopation, ove S860 incviual case ants Frnt: Group state pian presentation, exameaton, iamaan cae te, rae management Hames ME SHOT ays vempites fare arent samples, nu) reps. PERAEREEN COPE erent a"
    },
    {
        "image": "lessons1_synth_5_aug4.png",
        "label": "lessons",
        "ocr_text": "“ime fears For i | essen: soaning, srt os sou sesronninay Sania"
    },
    {
        "image": "lessons1_synth_5_aug5.png",
        "label": "lessons",
        "ocr_text": "smer (DT Tea acre aw oar =| jae DERE CESEON AUK A STRATES MAMAN Vow nome ‘Aes or Grade Leet. treated Yoee heen ter Tescotimes Subnet Lemon: we le ene ed =e | Su GRILCIIVES, ASSESOARENTS BPAATERIALS fare treme encanesh wing vingn eeuntt Ferma Wma pln emer ceretent canon trun semepe Monae cy pope wae a acre segs Cot Men inpometre. a vat Tae Cone! BHT aan. wy Pete s Fare Essay Sermon are oven Youngs Neoamansarend He Suancen ce Ate fare Sreege Deeg mete Sw ape 1H Var Nas amg Baan “Vines Mace eee eecconaag vi are me tances me ernest amine eM: poreninreatnd | Femara Cove S005 0% FOR eWID, BRCNANT aeTANONN WBA: harm HERES Daenaie Groas WENp DA BYRNE eu CONE Lily BROW ShIMNQY IERBINON neve sense noon ane enon Paton mets an anes Or Meenas weet onratt ene ne Us crn wasion CANIN rye we wna Wgmmt OeyNe he Gta tage Senemu en mera ae masa: ninco ie eevee me tanoe j"
    },
    {
        "image": "lessons1_synth_6_aug1.png",
        "label": "lessons",
        "ocr_text": "DELA SALLE UNIVERSITY coy cea nse INFORMATION, TLESSON ACTIVITY Eb LESSON PLAN IN PHILIPPI ETAL iE LITERATURE, Integrated Time frame for ‘age oF Grade Lev Disciplines Subjects:| Lesson: ‘Tied Year NG 201 120 mites ‘ASSESSMENT! 5 MATERIALS: ing ery contests. Demonsirate ota Tretean Colona Peed and etal ~ioowloe identity maior Snes and demons Develop aperesiaton for FI cdr entity. Vales terry engagement Foster respect fo Frappe wera cura teary bestage and recounce duerse pes pectves and promt re erary texts using aopropet satin of teary anatysi. Atude Boa of ertue ror awareness Ooh Fomaive: Ress resvose faecal essay on sence cxamiaton. ‘paras, smal gow Sscssions fn nor resenh, cm fest, xl presentation “cia analysis worksheets, Smatve venensve Merary ana Seectes Pages Her) reading ges, erry Tenis, mutimeda pres vis ais, wring template pars, ten tneine at TESSON PROCEDURES ang Anette \"Sorcenete rece ran wa treet es Scone cere reese a"
    },
    {
        "image": "lessons1_synth_6_aug2.png",
        "label": "lessons",
        "ocr_text": "DE LA SALLE UNIVERSITY Faesy eon a turan Deveepnet LESSON ACTIVITY INFORMATION Tite DETAILED LESSON PLAN IN PHILIPPINE LITERATURE, Your name: ‘Age or Grade Level: Integrated Time frame for Disciplines Subjects: Lesson: Joshua French Thi Year ENG 201 120 mites ‘STANDARDS, OBJECTIVES, ASSESSMENTS MATERIALS ‘Analyze Phippine rary txts wii istorcal and cutural contexts. Demonstrate enical thinking n Beary interpretation. Apply Kerary theories to Phippine works Krowiedge: Explain the characters ies of Piipine erature during the American Colonial Period and ‘dentfy major weters and the contrbutons «Ske: Analyze Rear texts using appropiate erica aopcoaches and demonstrate effective writen and orl communeation of rary analysis. -Atiude: Develop appreciation for Fin Berry heritage and recognize the oe of erature in nation buldng and ccutral identity. Values: Foster respect for verse perspectives and promote cutural awareness though Sera engagement. Formative: Reading response joumals, small group Escussions, terial analysis worksheets. Summative: ‘Analytical essay on selected text, oral presentation on author research, comprehensive Kerry analysis ‘Selected Pippi Merary texis, mutimeda presentation, author biographies, Historical timeline, eiical reading guides, Iterary analysis rubies, writing templates LESSON PROCEDURES"
    },
    {
        "image": "lessons1_synth_6_aug3.png",
        "label": "lessons",
        "ocr_text": "Titer i Asaiyue Phare Mara tents whe alas osesmeimen soni» |Techanage Bean we chacssteie of Poop earn nyt pPest ost eereay mage se aoe ton contenvons ist: Araby sera seus using senses Jolin to Puyne Haran baniage andre vstee: Fear vet he of twatre m eaanbny one Hioerse pepe ls euturs sesnarane Macy engagerent i ‘alia ales warkshaete Sanmatve soeamsh coma sve easy aeatis |"
    },
    {
        "image": "lessons1_synth_6_aug4.png",
        "label": "lessons",
        "ocr_text": "DE LASALLE UNIVE Pasay ena cen Ineegrmes Bissiplinen( Sab ra Vhyane trae (wats wt slots ard outwit angels. Dnenairte nical Aeon m Reary Sr Arety (by YASS Ko Pi Kak i kof Pape erate dry the Arvesoan Soin Pi oeety mores mt thay enthuse Daze Ray tt erp anoreenae cna sve oathes ang sometvate steve wattan soe ul coosrentanian ct Wen ara, Ase soa fr Fiz rary Desig |pesctnemy. us Fev mat tr err epee we onde conan mses ey {seer epee 1 Ss eecpon thee of arte m ating nd [Fonaten: Ressng sagas jail, sm esp ease arseyocs say on selected ex, a prevartae on putas sen coegachens ne Baty 203k [Geese Pat ery ten, tines pasonnio. aah beers onc nee ext gang, Siren nascent, | Tinea ad ans too was co ienre ic mort aay stent a cose siuee cua sence a taster) anemone ps nnn re i Gecarn uta: cane wena: th nao aig ey ean Sea Cis mS i san ic sta ti enemies Pose in eer :"
    },
    {
        "image": "lessons1_synth_6_aug5.png",
        "label": "lessons",
        "ocr_text": "DE LASALLE UNIVERSITY Mone aa Pyiiaine Papen cer teste wi 1 cree ac, ers acy erat te PIED 8S i Goong te Baan Seiad Be vaya esas spt wing sapraet sah ee se gh omnes RELAY SHS i rn mag sage ese inerire neg 302 eee re pesies sre geen nea AEE ME [iinneman tenon near (ce ey ane ove met [panain, sar gv Sarees, 13 t acanytiees rain Reng 388 wed panes. iy ee Sacre ovement A rn Pasren ces POEOT \\"
    },
    {
        "image": "lessons1_synth_7_aug1.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS. ase Ean se Ae LESSON ACTIVITY INFORMATION Tite: DETAILED LESSON PLAN IN PHILIPPINE LITERATURE, Your name: “Age or Grade Level: Integrated Time frame for Disciplines Subjects: Lesson: any Hi second Year ENG 201 120 mites “STANDARDS, OBJECTIVES, ASSESSMENTS MATERIALS ts. Demonstrate etizal thinking in Merry ‘prayze Phppne trary texts within historical and cultural conte interpretation. Apply Rerary theories to Phpine wots. Tynomiedge Expan the characteristics of Phppine erature ding the American Clorial Perio and dently major wrtes and ther conrutons Skis: Anatyze eran ters wing sppropsate cit “Shrovened and dementia effective writen andor communication of eran anaiyss.» Ate: creep spreciaton fot apne erry hertage and recognize the oe of erate in nation buking and canal Benny, Values: Foster respec for verse perspectives and promote util zwareness though eran engagement. Feanatne: Resding response jourals, smal group SSzussions, textual anaysis worksheets, Summative aia exsay on selected test, oral presentation on athe research, comprehensive era arayt Teaches Prappne teary texts, mutimeda presentation, author Bographies, historical meine, ciel reading guides, Iterary analysis ui, wring templates LESSON PROCEDURES ee tiun anne count mew) cancerice reece maaan we erste wt"
    },
    {
        "image": "lessons1_synth_7_aug2.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF Sa WTO TOMAS,"
    },
    {
        "image": "lessons1_synth_7_aug3.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS uo enw tan er [LESSON ACTIVITY INFORMATION. Tie: ‘DETALED LESSON PLAN IN PHILIPPINE UTERATURE ‘Your name: ‘Age oF Grade Level: integrated ‘Tame tome tor Disciptines Subjects: Lesson: ony ‘soone Your ‘hewyze Prappie terry texts wate Matera and owt! contents Demeratate ote hnking Mery rewpretcn hoo tery hecres to Prager wort Tinowieage Caplan tw chareclerstcs of Phigpre terme Gag he Amarcan Coral Parad and \\Gerety mar wrners and ter contre,» Shite: Anahye terry txts wang appropate ete epeaches and Gomenatate electve ween and or commancaten of erry anys. Athase Deven spercuton tr Figo erry hertage and recognce te lf lerary m natn bang Sr ‘canon ceveny Vaan Foster supect ter verve perpectves and poms cea meareness Prog ew ences Fomunve Reaang wipers rman imal gow Gucwavons esta anayen wonsheats Summative ewe eutay semcind Nast crt presentation on mater research. compranensive rary anaiyes a “ewcied Pragere ery texts mutmeda penenaton ater bayaghes, Naleres! tmeine cea ing putes, erry aniyn nas. wring Yomelae,"
    },
    {
        "image": "lessons1_synth_7_aug4.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS. 2 I PsN “Tage er Grade Level: [faterrated j eesone ee 1 exo 'S, ACRESSIALNYS RANE Ere be amientos Paps mera saeteeean, Sets Mes airy tess wing acon stow 1 tt sk ena ale wo Reaningrespinse ona. ah gous esaeesions, wstua wae wOreheoR spatial ensay an sezcted ink, ot encores mute ven, aamseensTe Hey ay sle [GEIR peteay wre wateeda pueune Ais Ropaen mncedinne omen"
    },
    {
        "image": "lessons1_synth_7_aug5.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS 220 Tea Baton tLe Ae LESSON ACTIVITY INFORMATION Tite: DETAILED LESSON PLAN IN PHILIPPINE LITERATURE Your name: ‘Age or Grade Level: integrated Time frame for Disciplines Subjects: Lesson: Army Ha Second Year ENG 201 120 minutes STANDARDS, OBJECTIVES, ASSESSMENTS MATERIALS ‘iaizs Phsppine Sear texts within stoncal and cual contexts, Demonsvateendcall thinking in trary interpretation. Apply Merry theares to Phppine wort, Selected Phippine itera tents, muti reading gues, lterary anaiyss mores, Nes presentation, author biographies, historical timeline, erical wrtg tempiates,"
    },
    {
        "image": "lessons1_synth_8_aug1.png",
        "label": "lessons",
        "ocr_text": "DELASALLE UNIVERSITY [Aa r Grad owe itegataa 17 | Dhceoes/ Seon: ‘lo ait psyehcinical Onarteny sing DS vik. Bevin Waingce, Deyebegies an vor [xterm osgetsesenacgy sokatn evs! vanity muncioetantg ms Sale] cuaan noe nmaens mained] 2 Pp te «Be: Aas Sap tea toemeescenon, oceans | evnsiaed aati, adress saene in anon Mer oerong Stee Vaee Ponte ne haart re on cataniney oo E een cannot evans oenegea ates ‘aati’ Case sy anata, Saqpeai ye Semmaive: Yeas exams on Soe Pritaoine cata hath esoee"
    },
    {
        "image": "lessons1_synth_8_aug2.png",
        "label": "lessons",
        "ocr_text": "DE LASALLE UNIVERSITY pemaee Teing aetearg LESSON ACTIVITY INFORMATION DETAILED LESSON PLAN IN ABNORMAL PSYCHOLOGY ‘Age or Grade Level: integrated Time frame for Disciplines Subjects: Lesson: Thi Year Psy 30 135 motes STANDARDS, OBJECTIVES, ASSESSMENTS MATERIALS Deserbe major psychoogeal cscrders using DSM S entra. Explain Botogial, prychologeal, and social ‘actors in psychopathoogy. Demonstrate cutwal senstvty in understanding mental heath, Koonledge: dentty symptoms and dagnoste enter for ansaty Gxordere, mood Gsorders, and ther ‘Prevalence in Philppine contest.» Skals: Apply agnostic ertera to case scenarcs. dtferentate between ‘noma and aboormal behave, and recognize appropdate intervention approaches. AIttude: Develop ‘empathy toward individuals with mental heath condtions and chalenge stigma surrounding psychological <Ssorder.- Values: Promete mental heath awareness, respect chet confdentiity, and advocate for \\ebica treatment of ncividuals wah psychalopeal Seortes Fomatve: Case study analysis, agnostic practice exercises, Gass Gscvssions on ecal scenarios, ‘Summative: Wetten examination on disorder cassticatons, case formation assignment, research pape on Phippine mental heath issues. ‘DSW S dagnoste manual exces, case study videos, symplom checkists, Pilpine mental heath statis, cultural considerations handouts, ethical guidelines LESSON PROCEDURES"
    },
    {
        "image": "lessons1_synth_8_aug3.png",
        "label": "lessons",
        "ocr_text": "DELA SALLE UNIVERSIY Grace ir peveeat Seven wing DES eta. Expnn Baoan TE seating ar peer eh, Denese att Sy Sy cance te woiety Geto. ed Gamma, a8 ake an rly dageesto ess to ova seat, sttenetats CeReee Nppeemtn enreecion versie.» Rtinte: VE a est eae eens os ge SEED 2ST in amacarns cre cans canter, see vate Re ‘ts paychengce Saaetas i engaty area ve Game. sen: Prime masts 1 pose wucone tain i raninn weantane, Baas SAAN 399 ere sjrates examination n deuce bounce tran sHNgamet Sener SI? | peseice mnt th ioe Si hagnante sono ances. cane soit Sets, HIS SA ‘pra conc OaNaNE7S MEINE A AES Fe mannonrmenmmecenn Dwar imcine actan pa eran tn 2 —"
    },
    {
        "image": "lessons1_synth_8_aug4.png",
        "label": "lessons",
        "ocr_text": "LASSLLE UNIVERSITY [se waa Tage or Grade vel tmgenind Vine Ganson \\ [osdeeccne Seon | Mak Banos 1 rete ver t 1 i eve any Lusrona [coeessie econt, symptewes soe dayne i preatance n Five coment,» Galle Asp Sagncetic sans ts euse snares, obras Pate emia ara sovannal benacin, ane reragnre aeerapnata Mtanantn soweasten ~Stiewe Deen censatny tonart eves v2 mares heah coions ast Sahanse ane sunmoreng veyehuageR | escntns «Vues. Praaite meniah oni auarevess, spect Ofer Ranetity a abvoast or eevee: necimern of taints wan peyatoiages dasrsere i simatne dimen wean on shin Cassiaxsa0 Tonner crease"
    },
    {
        "image": "lessons1_synth_8_aug5.png",
        "label": "lessons",
        "ocr_text": "DELASELLE pastes nter o en88 somnntos efteennie at soetet. «Sk: Aaply gees tonal eet abeama baovior, anor a empathy tenant indviiuate wt metal best comiions Seales, «valves Paanote mental heath amaeenas, fe loervenion apemuabes, Avis sts teaument of esse an psyenatng mist aes Sornmatve: ise ween"
    },
    {
        "image": "lessons1_synth_9_aug1.png",
        "label": "lessons",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY rey 2 ta worn Seeret LESSON ACTIVITY INFORMATION Tite: DETALED LESSON PLAN IN PHILIPPINE LITERATURE ‘Your name: ‘Age oF Grade Level: integrated Time frame for Disciplines Subjects: Lesson: Woam Jerking Fest You evo 201 120 mints ‘STANDARDS, OBJECTIVES, ASSESSMENTS MATERIALS ‘heiyze Papier text win atone and ert contents, emonstate ten sing merry ceezreaton App trary Decres to Pracore wor Ticewieage Expian te haraciratcs of Phagore terre aurmg te Amercan Cooma Parad aed every mane wrters and ter corerbutons Sh Anaiye terry tees wing approprate ote apprcaches and cemonstate Wace wetten and er communcaton of Rerary aya. Athuse Devete apprecation for Fine rary hertage and recog the rie of erate m naton baing and cota sentty Vahan: Foster rnpect for Gverve perspectives and promote cate auarerass Dough leery engagement Fomanre Reading waporse para smal gow Gacuavors, textual anayen worsheets Summative ‘Aniyten! essay on selected tert. or! presentation on athe research. comprehensive Marry anatyss eumesten Geaced Pagers lerny texts mutmeda peseraton author bayaghes, halons! tmeine, ote renang gases incur) anys nercs. ring teneiaes LESSON PROCEDURES [oneness Pee NONE erm ay Anan pes Cones meer we pevecune oo et nace womens come rey meh mnt mae nen dP BONA wan ‘Shaner atnes Ore enry evences et Su es engi comer acme Hae ‘Stenewe one tc Somes tou yuan yar enreten Pave tangs cus eee Pom To Teens comes comectnenen comme Pane cay Meteo ey crema mer UL —|"
    },
    {
        "image": "lessons1_synth_9_aug2.png",
        "label": "lessons",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY rans Eaton ron CEO TESSON ACTIVITY INFORMATION. Tite: SETRILED LESSON PLAN IN PHILIPPINE UTERATURE Your name ‘age oF Grade Level: Integrated Time frame for Disciplines Subjects: Lessor: Wasan Jerks Fest Yew NG 201 wren STANDARDS, OBJECTIVES, ASSESSMENTS MATERIALS Graze Pagpne ery ets wan nent a eaten cee Demonstrate crt! theking He) Gage Enon ow cron of Praga erie 0 6 AN eee suae Anayze ierary teats wag arora ‘aerety map eters an the cor rertage and rece the rie Cee ee save respect fr sere perapeines a pamela Ce eran Coon Peres and Gna youn asevssens, sta Fomane Rexang response us sree on anor reseacn, comeenens [pnayiea! ensay on selected tert, 07 Graves worsheets. Senmatve fe stecry ays Toneline, ert! Sipe arb rts manasa preston, ater Beans, MSG Selected 3 bres, wrtng tempts reading guses, teary 228 LESSON PROCEDURES"
    },
    {
        "image": "lessons1_synth_9_aug3.png",
        "label": "lessons",
        "ocr_text": "ATENEO DE MANILA UHIVEESiTy is Sosbes Prtzane nec tats win stove ane aute satan: Deere inspeieden. Fast erry thecrie te Prine wks, i Seay 2, —— Aoawisge Eiplan he th [OBC ee wae we area 1 Pippin iesatzn dng toe Anerson Ondo, Pod ad ie: Keyan este Res OSE appetite Cotes! ses dominate stevie witten avd ort samatnaton tt Stren wena, vaca P soos for igi Lesa harhays soa neon ee oth» Valves: East aspect fr vec perpen Seca eager oS trestar os mating an 0: dod pete nbd acenats t =| ora: Rest ncponre amis, Posytial essay a eleton est. et ereaertin on wi research"
    },
    {
        "image": "lessons1_synth_9_aug4.png",
        "label": "lessons",
        "ocr_text": "ATENEG OF kata UnNeR Pere eats: ti j Arwirze Ss tem tons etn mine J AateREAIe oe icons Deane eon Nee aray ances. Ath reece eo arse ancy Pt Fete enonstte enna oamoecnan ant peo sone Say simmer femen cenay seawenctony, SEnparse fea, wat wae tien i, 28 pevearcen Saovesens, texas anstss wenn unnedie mains menReEm sauce Mena aan, Avovseat asa an amtion Siaioe Macey tects, mations poten tac pole, tary aeaiein “ee 29. my Seiten"
    },
    {
        "image": "lessons1_synth_9_aug5.png",
        "label": "lessons",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Pansy o tact rere Onecare LESSON ACTIVITY INFORMATION Title: ‘DETAILED LESSON PLAN IN PHILIPPINE LITERATURE. Your name: ‘Age or Grade Level: integrated Time frame for Disciptines Subjects: Lesson: Wasa Jentes Feat Your eno 2 120 mente ‘STANDARDS, OBJECTIVES, ASSESSMENTS MATERIALS ‘Anayze Pragpne rary txts wan Pntoneat and cutis! contents. Demonatate crt thru m leray ireerprtaton Acplylerary hecres 1 Pragpowe works ~Krowedge Expian be Ghracterstes of Phigere invatize Gung te Anercan Comal Paros and sGerety mer witers and hae contrbatens Skits Anayze erry txts cing soproprate erties approaches and camonstrate tactve writen and ort communcaton of ery anaiyaa Attuse Devel apprecaton for Fp itrary hertage and recagnze he fle of iterate m maton balding and cata enety Vates. Foster respect for verve perspectives and promote cut aaareress Dough seer) ergagemert Fomatve Reading sponse oaras smal gow Sacussors, textual anaiyss worshees Summative ‘Atytea! essay on selected tent cral presentation on athe research, comprehensive larry aaiyss Selected Phagpre rary txts, mutmeda presersion auhor Dayaghes hatorcaltmeine, tea easng gades lterary aay nres, wring tenpates LESSON PROCEDURES"
    },
    {
        "image": "lessons2_synth_11_aug1.png",
        "label": "lessons",
        "ocr_text": "esional Deve anemone INQUIRY BASED LESSON PLAN [FreServiee™ sedreees | tary ane kha er Cooperating Teacher: Sniter Stern Shserecm: Sedenin, nands on investination farmat Sotegy Esalogy ahemiaty Are Stdoas Ne anctenss wits spaciainacan, bua mots coPsiderate to tell wor mot OL Bigidew Eslieuted Nine frome of Lasso) [3 Bip idea? uses the scientific inquiry i i pete) Philippine rivers, Siudents wit uncer fang ihat i Geestonts acosystoin heath is measure Bvovgnanentee ene cat inches, and thattuiman | actions have a '$ On environtgantal cuality, Essen ‘orfiving oreanisnis? How ean we m ns, Wisat kes INQUIRY SIILLS: Formulas vs bt water sualty and acenystem heal Hled experiments to tast hypotheses abest pollstion affos i and org ganize quantitative and qu A draw avidence pass indicators of wz ily (BH, dissolved oxy i nitrogen and phesprons ive environmental dat nitrates, phosphates) cles In aquatic ecesystems Describe bioi assessment Understand eutrophication proce acts LABORATORY SKILLS: Use water testing equipment and i ts safely and accurately Perform micres copie exainins rcorgar ion of water “ chservations systematically using ecientific i Bslation Calculate concentrations and compare values to water wwality standands H i ENVIRONMENTAL LITERACY: Recognize sources of eter pollution in Philopine { certimunities Evaluate the reiationstin betw: n jand use y Proose | evidence based solutions for ural and LABORATION ANG COMMUNICATION, Work ‘signed foles Present scientific Finck us using 7S and tables Defend conciusions using avidence from exnetimental age in pest review proses te"
    },
    {
        "image": "lessons2_synth_11_aug2.png",
        "label": "lessons",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Manila, Metro Manila Faculty of Education Professional Development INQUIRY BASED LESSON PLAN els Thomas Newman School, Grade De La Sate Santiago Zobel School Grade 9 Type of Laboratory and fiekt based learning, 30 Leiehaced Cooperating Teacher: Amber Glenn Classroom: students, hands on investigaton format ‘operating Teacher Content Area and Ecobgy Chomaty Are Students jo students wih special need, but mabaty Topi: Environmental Science Run Spel considerations fr fll work included esson Title: Water Quaity and Ecosystem Heathin Type of Inguiry Based Learning wih Scientic Phiippine Rivers Lesson Investigation and Data Analysis INSTRUCTIONAL PLAN Estimated Time frame of Lesson 150 1 Hg ier How do human activities impact aquatic ecosystems? This lesson uses the scientific inquiry Process to investigate water quality in local Philippine rivers. Students will understand that Questions): ecosystem heath is measurable through chemical and biological indicators, and that human actions have direct consequences on environmental quality. Essential questions: What makes water safe for living organisms? How can we measure ecosystem health? What is our role in protecting water resources? TL Objective s): INQUIRY SKILLS: Formulate testable questions about water quality and ecosystem health Design controlled experiments to test hypotheses about pollution effects Collect ‘and organize quantitative and qualitative environmental data Analyze data pattems to draw evidence based conclusions SCIENTIFIC KNOWLEDGE: Identify chemical indicators of water quality (pH, dissolved oxygen, nitrates, phosphates) Explain the nitrogen and phosphorus cycles in aquatic ecosystems Describe bioindicator organisms and their role in ecosystem assessment Understand eutrophication process and its environmental impacts LABORATORY SKILLS: Use water testing equipment and chemical reagents safely and accurately Perform microscopic examination of water ‘samples for microorganisms Record observations systematically using scientific ‘notation Calculate concentrations and compare values to water quality standards ENVIRONMENTAL LITERACY: Recognize sources of water pollution in Philippine communities Evaluate the relationship between land use and water quality Propose evidence based solutions for water resource management Appreciate the cultural and economic importance of clean water COLLABORATION AND COMMUNICATION: Work ‘effectively in research teams with assigned roles Present scientific findings using appropriate graphs and tables Defend conclusions using evidence from experimental data Engage in peer review process to improve scientific work"
    },
    {
        "image": "lessons2_synth_11_aug3.png",
        "label": "lessons",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES: Manila, Metro Mania Faculty of Education Professional Development INQUIRY BASED LESSON PLAN Preservice ‘Thomas Newman ‘School, Grade Tyee (De La Sate Santiago Zobel School Grade Laboratory and tetd based tearing, 30 ected Cooperating Teacher Amber Glenn Classroom: stucents, hands on investigation format Cooperating Are Stadests tio students wih speciai needs, bul mobiity ‘wlth Special conssterations for fied work mckided Inqury Based Learning win Scientific ‘Type -_ Investigation and Data Anaiyss 1 Big ides How do human actvites impact aquatic ecosystems? This lesson uses the scientific inquiry cord process to investigate water quailty in local Philippine rivers. Students will understand that Questions): cosystem health is measurable trough chemical and biological indicators, and tat human fctons have direct consequences on environmental quality. Essental questons: What makes water sate for ving organisms? How can we measure ecosystem healt? What is our role in protectng water resources? [ic Okjeciveoe RQUIRY SKILLS. Formulate testable questions about water quality and ecosystem health Design controlled experiments to test hypotheses about pollution effects Collect ‘and organize quantitative and qualitative environmental data Analyze data patterns to draw evidence based conclusions SCIENTIFIC KNOWLEDGE: Identify chemical indicators of water quality (pH, dissolved oxygen. nitrates, phosphates) Explain the ‘and their role in ecosystem assessment Understand eutrophication process and its ‘environmental impacts LABORATORY SKILLS: Use water testing equipment and chemical reagents safely and accurately Perform microscopic examination of water ‘samples for microorganisms Record observations systematically using scientific notation Calculate concentrations and compare values to water quality standards ENVIRONMENTAL LITERACY: Recognize sources of water pollution in Philippine communities Evaluate the relationship between land use and water quality Propose ‘evidence based solutions for water resource management Appreciate the cultural and ‘economic importance of clean water COLLABORATION AND COMMUNICATION: Work effectively in research teams with assigned roles Present scientific findings using ‘appropriate graphs and tables Defend conclusions using evidence from experimental data Engage in peer review process to improve scientific work"
    },
    {
        "image": "lessons2_synth_11_aug4.png",
        "label": "lessons",
        "ocr_text": "POUYTECHMIC UNIVERSITY OF THE PHILIPPINES Manda, Met Mania Faculty of Education Profes sional Devatopeent {NOUIEY BASED LESSON PLAN T Lavorstiey ae eas bates earring, 30 scare, ed an meant mt Ca camaro TR Big tees T fron go human actrbes apact 9qua s econjsiems” This esson uses he uoenhtic Ny Sseretat process io mvestigate water quatity in Kecat Pritipnine avers ‘Students wit understane hat H Quresttomst: Qrosystems nant 6 mensurabie ough erica and Mologicl ASN ang hat human | actors nave dect consequences on ancironmental aay esantal questions: What mares o fasure ecosvetio neatly? Wiha is our rote id abet water quality snd ecosystern pollution aiticts Collect | ateators of water quaity (gH Gsvolved caygan, rites, phosphates) Explain the stems Describe bioindicater organisms 1 nitrogen and phosphorus cycles in aquatic ecosy! | and thee role in ecosystem assessment Understand eutroptécaton process and its | amwwonvmentad impacts LABS TORY SKILLS: Use water testing equipsnent and i chemical reagents eafety a wccuraety *Perlerm microsconte axaminstion of water Comoles for mecoougaeisans Roca chsavations systeraaticaly using ecensc | ein» Cable constrains eed compan ves owas Wl, NT j GRVIRONMENTAL LITERACY, Recognize sonatas of woiet poiion in Priippine communities Evavuate the rétationsrip between land use and water quaity Propasa evidence based solutions for watar rasource nuanagement Apjveciaie the cutueal end ! eronomis importance of clan water COLLABORATION ANID COMMUNICATION. Werk \\ rectvely i research toams with meses res Prwsent scant foes wa | appropriate graphs ond tees ‘Defend conclusions using evidence fromm experimental | ata peer review process to improve scianttic BOM"
    },
    {
        "image": "lessons2_synth_11_aug5.png",
        "label": "lessons",
        "ocr_text": "TY OF THE OHISS UNIVE! PHILIPPINES stasita, Mateo M POUT Facuay of Eaoation Prntessional Develogen=\\ (HOUNRY BASED LESSON PLAN Tnimratory eng Heoztessen arena, 3) nen HTT 1 Da La Se Sentago 2 sautents, herds cn eesti ng Teacher Amber Ginn sis “saa wt oc an, AY Sit soars Sr fe ote ANS TV aegy Bstlagy Chena Eevanemnente Sete Vingiey Bavwa nen wnseenee [ reestgaton are Date fears 1 [Slates Qusey art 2 [Sooner fencer ETTORE FLAN ead its emt te eee TE Wieder co san aces oma sate ecosjaenns? Tris eran uses the ie nis Exerntiat prOcieEs te ineeatigals: pestns Guality i fecal Phiipsine rivers. Siodents wit andersiand frat al indicators, ana manner ait mveasuratie throuTh acrid a0 Bintog vrenens on anvronmnontal quan. Esvantiah questons: WiateaaReh oe rows can wa measure Bcosatre ReattN7 AHALIS OTANI i Cguedttoatahs acoveysi 1 tpi han div Enns ware sag tac ixing onan protecting wales s nouroes? Gia abe wate aaily aret ecosystem: Dooign rented avparimanis (0 tat hyptinaees about pation offOSks Collect i ged esgenize quantiotive and qualitative environmental data Analyze data pattems ty | law ouidorce based conasiana SCIENTIFIC KNGWLEDGE: teeny ctanica i 1 indicators of water quality (pH, dissolved oxygen, nitrates phouphates) Eeptaio the i i vomgen and phospente cycas in aquatic ecosystems Gescrlne blinicatar organist’: 1 | at thar rte in ecosyotam aseassmet Understand atop ation prceas and #2 1 | environments? frepacts LABORATORY SKILLS. Use water tasting equipment and i cisetely Peston enieroscopis examination of water chemical reagents safely and a: yeenples for iniezcorganisms Riecerd absereatorns systomatically using selantific \\ eusiation Cates acentrationn and compare valves to water quallly standards H j ERVIRCHMENTAL LITERACY: Facogrize sources of wesier pollution in Philipeine nities Exvaiuate the rlatiamhip betwen land use and water quality Propose i i evidence based eclutions for water rasouce management Appraciacs the cultural ond peateynic imporiance of clagn wale: COLLABORATION AND CORMUNEGRTION: Werk 1g wits aonigned roles Present sclantific Findinge using i ig Defond conclusions using avidence from experimental i process tn iprove aclentific wort t"
    },
    {
        "image": "lessons2_synth_12_aug1.png",
        "label": "lessons",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Quezon City, Metro Manila Faculty of Education Professional Development PROJECT BASED LESSON PLAN Te a ‘Susan Greer Teach —T prapone Source rignSchoaGrace 11 H7e60t Computer aboratory, 32 sudens, oe Level and ‘Cooperating Teacher: Brian Michel Classroom: | teams of 4, agie development methodology Cooperating ‘Teacher Content Area and Computer Science Business ‘Are Stents sugent win physcal dsabaty- adaptive Topic: curepreneurstip with Spectal ,eypourd and ergonome workstation provides Needs! Tason THe Toots App DeveopmentirPhippre TIPESF_ Project Based Learning wan Design TnekNg Lesson and Agile Development ‘Community Sokstons ss real community needs? This lesson challenges students to identify ms and develop mobile app solutions through design thinking and ‘understand that successful technology innovation requires bility. Essential questions: What problems in our community tually want to use? What makes T. Big tdea? How can technology adre Essential Philippine community proble Question s): agile methodology. Students will ‘empathy, iteration, and business viat need solving? How do we design technology ‘that people ac technology startup successful in the Philippines? PROJEGT MANAGEMENT OBJECTIVES: Apply design thinking process (empathize, define, deate, selopment Use agle methodology wih sprints, stand ups, and retrospectves Manage project tmeine, delverables, and team responsibiies Document development process trough Gesign urnals and progress reports TECHNICAL OBJECTIVES: Analyze user needs through nterwiews, practices and accessibity standards Develop tools and platforms Test and debug applications through Herat technical sokitons clearly to both technical and non technical audiences BUSINESS OBJECTIVES: ‘Conduct market research on existing solitons and competitor analysis Develop business model canvas, ‘denttying valve propostion, customer segments, revenue streams Create fnancial projections and funding requeements for Phipine market Péch startup ideas to panel using presentation and Gemonstraton skils COLLABORATION OBJECTIVES: Function effectively in verse teams wih assigned oes (project manager, designer, developer, tester) Resolve conficts constructvely and make decisions Gemocratealy Give and receive constructive feedback on work in progress Demonstrate accountability tor ndvidval contributions to team success ENTREPRENEURIAL MINDSET: Embrace fature as learning copportunty and persist through challenges Show creatwty and innovation in problem solving approaches Demonstrate cultural senstvty in designing for Flpino users Consider social impact and ethical implications of technology solutions Je cycies with user feedback Present"
    },
    {
        "image": "lessons2_synth_12_aug2.png",
        "label": "lessons",
        "ocr_text": "Foculty of Sducation Profoasional Faimeee (er a Bente re and T eoameusty i eRqJECT Manan Sanataet marker rs for ities contribs fo SRRGrty and peret tarcuem chetagen Shoe en Dewvarrate cutie! set SEEN OB, Proto tes! weap deveenert Use | Marge izunet omine, deieration, sat ATENEO DE MANILA UNIVERSITY Quezon City, bieia Neante Development PRIMECT- BASED LESSON PLAM Solence Hise Sciso! Grass 14 Sooperatig Teacher tear Nato Cowmecwiing SORETONED Teacher Briar Apc Bete S00 Develonmeset tor Brscaane 1 ROR Solving? Mow de we design echnotogy startup suecesstut design wournaie iano erogenas vaponis Burs, 20 ob seve Phase 2 Seton aod accaestty wavelarte Yoety and pinion Feet and deeug techetcal sututions cinty stem macsger, desler, aecetozer, testa | Gerecratcety Give ant racelve esnstrusten tena tse7 eu a Seotcainasetteceastony wssahne Wilh understay Se Re Big tear How sar: taoneatogy aadrees ray Piiipgine community sctieme ana davstey sob j Gerstloniay He rathocotogy. Stuente i onary, Weston, snd businass vabl inthe toam respon, 19 foitcalone thou Aecate cysies tachi es SOMBRE on Masti; Fone aint Sientiying vot sraposson cu Psieg vomivemente tee Biv Bmorstton okie COLLABOATI0) WN ORIRCTNES aes EMTREER ED sate Noe Fan ue Yipee Ctassreune mmriinity news’? This lawton 10 that success iachaiegs ity, Essential questions: What pra n technaiegy that people a VEER. Aeaiy tease tiki ences sets methosialogy wit seins, FESHMICAL OBNEOTIY viontoeo! atense Du emscetior araayeie hie BogMeNts, ae snes na market» Poh setup ey SHEURIA MINGSET:- Emerace tite as earning Reyes Prowe: Sn Aste Bevsiopinent ‘biemis bites Dosen ere Fitton etfociiats is dares voenetrste AY Bnd wnvaton a ste sii Py Cosines eos ansact ace ates i Canaries abscetory, 3 euaioe See of apie enseeonant ne Besos Learning wen een 7 IY WAR! ID UNE? Yat maxeg a epic, deta, idaste, tenis, and retcopmesveg* Heovocnss taauge 3 Aostrzs ener ome Menus iterviewe, Srmaaties Daaian ues tarteces falneang matte {Develop terete sem Bototjzas uste; memorials devekigener ‘il weer led Present E88 ORE TIVES: Bove bustiess restos carves, 1 Steate franca pabstons art Hi Daneluntay prenantation at H toons wt eseignas Boinet reagy ‘side win asin! dembity saoytine 1 500 empanaere mutstenin panied noon tltatel Tige Be Tama Se chlengea sadents niente 2 Solubons treugh design thinking ana Sut comamesnity aoe best {"
    },
    {
        "image": "lessons2_synth_12_aug3.png",
        "label": "lessons",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY ‘Suegon City, Meta Mania tion Prelessional Development S9GN PLY Baiipane Science Fgh Show Grate 11 Cocgeratng Teacter Bran Meher Sehooi, Grade Lovet ast Canperattng, Content Ar ft ugent with pioysion! disabety Pape: Si Splat ioc ane angen mn proved Moose Hyp Devesnerert 2 typeof op Thinke Conesrenty Sotstion j Bevsen Big hie? Essexat Qutestintsts ity needs” This lesson challenges studenss 6 aenity 2 communaty prot agile methoaoiugy. 8 empathy ms and develop magne app sclulans trowan design. thinking a tents wit understand thai successful atin, ant h need sowing? How dow rctogy stars fogy novation requires peas viability Eosenai auestons, iWrai eroblams in our cor hnstogy th 2 Priggines? PROJECT prototype, S:* Aupty desig tnking ou neni? Une ages ristncusiogy wa Fables, unc ede segaoneinites Os pregrens reports T 78, 3d ebsarvaten im Phiigpine 6 OTL Dijectiverse lampathice, define, Kea ints, stamps, and retsenecties smal develcement arcenes Proggh wae needs through mene, or mtectaces tokming mile practices CeSn May standaids Devsiog funetienai ape protiypes i ving aporaprste developer i ont ont otome Teatand eotee o | technical bons che Conduct market \\wenitfying value propesiion, ousiamer suncing requiremancs foc Stoysaie marie Pte cenonetan LABORATION OBE Wager, Sesigney 10 Rane! usin presentation an Furston af in divorse teceres Wh agape evsloper, ten) °F sttuctivaly ang make aeciuions iy Give and (enews sunetuctive feedback xa york m progress Damnnstrate accountabiny tual contmiioos 19 team a iAL MINDSET. Breucare fase 2 learning siengen Show cvsitivay ar imovancn a proater soving apprasches “al seeatuty m designing, 8 Consider scala: tnpset and etnea! noiegy eosin i stunt and persiet Mecgh ci"
    },
    {
        "image": "lessons2_synth_12_aug4.png",
        "label": "lessons",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Quezon City, Meto Manila Faculty of Education Professional Development PROJECT BASED LESSON PLAN Pre Service sana Susan Greer ‘School. Grade Seance High Sero Grage 11 Tye ot prone Se en c Corte 32 students, project us Cooper Taroom: seame of 4. apie development metnadciogy Teacher Contr Ave at Computer Science Buaness ‘Are Students |; yeugent win phyuce! daabaty adaptive ope: Enaepreneushe Sith Speclal yon and egonors oration pended Temen Tie: yous App Devetopmert for Pracone Type of Proect Based Learning wen Design Theing Communty Soxtons and Agie Development INSTRUCTIONAL PLAN Estimated Time frame of Lewon #6 Wig Ideal ‘How can technology address real community needs? This lesson challenges students to entty Philippine community problems and develop mobile app solutons through design thinking and ‘agile memodology Students will understand that successful technology innovation requires ‘empathy, flerabon, and business mability Essental questons What problems in our community need solving? How do we design technology that people actually want fo use? What makes technology startup successful in the Philipines? b _ TE Objectivets? pROJECT MANAGEMENT OBJECTIVES Aopy dengn nnang process (emeatnce, define, eate trotetype test) agp deveooment Use age metosoogy we sornesstand uon and revoapectves* Manage propct imeine, detverabies, and team responsbtes Document devetopment process Bough dency porno and progres reports TECHNICAL OBJECTIVES Analyze user needs trough ntervews cory. and ebservaton n Prapone commutes Desgn wer rtertacesfolown moble ape best tiictces anc access standards Develop Knctonal agp prototypes ving aperoorate ceveopent tron ard putorms Test and debug appkcatons Brough teratve cycles wih user feedback Present veerreca soutona ceary to bot technical and nontechnical audiences BUSINESS OBJECTIVES Conaust martet esearch on exutng solitons and comoetior anaiys Devetop busness made! canvas Gentnsng vaue propoation customer segments, revenue sears Create francis protons and Coons egoremenn for Prappne markets Ptch startup deas to pane ang presentation and Semoutaton suas COLLABORATION OBJECTIVES Functon eflectvety n dverse teams wen assigned voce iroect manager designer, Geveloper, tester) Resowe confit constructively and make decsione serocromahy Gre wn recone conatuctve feedback on work progress Demonstrate accoutapaty to ravcu contetena to team success ENTREPRENEURIAL MINDSET Embrace take as earning Coot and pervat Pou chalenges Show creatvty and prorat n prblem soNN9 aporoBches Deronst te cunt seratvty n desgneg fr Fapro users Conse socal roact and em rrotcatons of echnobgy voktens"
    },
    {
        "image": "lessons2_synth_12_aug5.png",
        "label": "lessons",
        "ocr_text": "SNEO DE MAMILA UNIVER: PROWECT BAS bevel ant Phassroene Conperating Soonsratng Teacher. Brian tastes Mooie fio Os roject Sage La\" nd Anse Dave s aunty probiems and develop mobile ang ssiution agile mathadalogy. Sugents y innovanion reauit y, Teraten, and business viability Essential questans What oro) ed sclng? How do 87 08, rotoiype. test 2on Gu udlogeoat Use agi neosetog Agoly sesgn thnkny process ‘empatnre, cate etponaibates Desumert ORL ORECTIVES Anata fesage prolect reine user neeas thous mterviews, olotypes using 2 yrles wi use ssdionces BUSIIESS competi unalone Develo bus 2 accessinity atenoaras Jools and platforms Test ang ah nig leary to bot Gondant marvel sesesrch on existing solutions an lerttying ve ore te 2 financial progestins arc ng requirenen for Pre teas wah S05 f¢ conmicts conebucttely ans inake sect sdhack on wore in erograss Demonsirat team sucoeas ENTREPRENEURIAL MIEDSE sity race tate as earvin \"ya persist tough shwtonges Shi cresivty a novation n prabiens ecleing app cemanetate =pteaton ura! seeatirty in desig hrs Gonsider saci hipaet ana eit"
    },
    {
        "image": "lessons2_synth_13_aug1.png",
        "label": "lessons",
        "ocr_text": "= PHILIPPINES: UNIVERSITY GE TH Dimer, Quezon CY sonal Development Faculty of Eaucation Pe PEREN TATED LESSON PLAN Gehoss Grate 16 Fe a mnacerd, beret actetiCs ee enreaaress araimireat hs Y quezon ty tt Yeacher i comer 1 sane itn sg aR Thee Reares ponte sonial os seayger? TH jester EMPOWSS students fp sages NE Stadane aterentated inat 1 ged Tens Assgorenis 1 ‘Big ides! 1 pow can wo US® ignguage 19 Ce | eer gies esse gusto: Wa Ae rina eswanang? wowsewe ‘ parlance ereote: nd logic it persuas sca? Wry is junportant tar ct to speak quionsncial \\ ues? i VoWreRe its of persuaei tamiar Piiepine ating Standards) ConstuC “suppart arguenents wt eleven saregargns ant 99 saps, evidence? Reuognize obvious Be spteerganized ners jaenice rors erectile Pr ERD t es miquesin questa agi et FEL Gbjectiverss ce wntrng (0858 compones i paragtanns 9° gamle texts TER 2 joiners | ear inesis | qunnces Anaivae Ft ya lechnigues ih 2avaCe i exceeding Standards) Sra gophistated mull gers gevorany pieces speeches, 05 Groposnts) Evaiwata be acess csfferont mvtrica} sratagies fof Y3TE sgaudiencess i synthesize 8 iipia perspectives OF ngrapiex Poitippine soit nes OFF i iat issnes vay eq to her {pve echie aS i tienedia viacald INTEREST. Statens choos? ‘censvomment, 2) Outtons £0 aes cchowe in audience (eee shoot administal DIFFERENTIATED BY LEARN 2s PROLE:* Vis su» fusanry tamer BEAD POT scvipie oF 2c quis learhore commana 0, te al wearne' al goveramet soa i se ents Kir ‘7 camenia’ i} Re pac averse BersnECves Reset ng fr parsons pafane APD aees af i"
    },
    {
        "image": "lessons2_synth_13_aug2.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES Diliman, Quezon City Faculty of Education Professional Development DIFFERENTIATED LESSON PLAN PreService Present Bryan Decker a ‘Quezon City High School Grade 10 preset, Flexible seating, 38 students, tered activites Laval nd Cooperating Teacher: Jule White Classroom: based on readiness and interest levels Cooperating Teacher Content Areaand Engish Language Arts Social Studies Ate Students 3 scents wan warng abies modi ‘Tople: aS with Special assignments, extended time, assstve technology Needs: Lesson Tithe: Persuasive Writing and Advocacy on ‘Type of Differentiated Instruction with Choice Boards Phiippine Social issues Lesson and Tiered Assignments INSTRUCTIONAL PLAN Estimated Time frame of Lesson 100 Big Idea’ How can we use language to create positive social change? This lesson empowers students to a become advocates for Philippine social issues through persuasive writing. Students will Question s): understand that effective communication requires understanding audience, purpose, and rhetorical strategies. Essential questions: What makes an argument convincing? How do we balance emotion and logic in persuasion? Why is important for citizens to speak out on social issues? TL Objective s): DIFFERENTIATED BY READINESS: TIER 1 (Approaching Standards): Identity the basic ‘components of persuasive writing (ciaim, reasons, evidence) Write simple persuasive paragraphs on familiar Philippine social issues Recognize obvious persuasive techniques in ‘sample texts TIER 2 (Meeting Standards): Construct well organized persuasive essays with lear thesis statements Support arguments with relevant evidence from credible Philippine sources Analyze persuasive techniques in advocacy campaigns and speeches TIER 3 (Exceeding Standards): Craft sophisticated mult genre advocacy pieces (speeches, op eds, proposals) Evaluate the effectiveness of diferent rhetorical strategies for various audiences ‘Synthesize multiple perspectives on complex Philippine social issues DIFFERENTIATED BY INTEREST: Students choose social issues that personally matter o them (poverty, education, environment, etc.) Options for diferent communication formats (writen, oral, multimedia, visual) *Choice in audience (peers, school administrators, local government, general public) DIFFERENTIATED BY LEARNING PROFILE: Visual learners create Infographics and poster ‘campaigns Auditory leamers develop podcast scripts or radio ads Kinesthetic learners ‘organize awareness campaigns or community forums Linguistic leamers write traditional Persuasive essays or speeches UNIVERSAL OBJECTIVES: Demonstrate understanding of Persuasive appeals (ethos, pathos, logos) Research Philippine social issues using credible ‘Sources Respect diverse perspectives while advocating for personal positions Apply feedback to revise and improve persuasive communication"
    },
    {
        "image": "lessons2_synth_13_aug3.png",
        "label": "lessons",
        "ocr_text": "san, Guezon City Faculty of Educution Professional Davekpment DIFFERENTIATED CHS PLAN, ivan Gocker Preserciae Laval and ooparatig Teacher suse White Ghesr00m: uses on imams ant niestieces | Coogeratiag } S etudecs 1a mpeg Gatatas orton esis, eeiendad une, oti techorings WoL ype frame of Vertes 8 io cruate positive social change? This tezvon empowers studanis te Beasts Bacome advocates fur Philippine social issues through pereuative writing. Students wi Gumaiomish: Ts ruerstard that etfertive communication radulvas understanding audience, purposE, and i | Ihetoricat eaiegies, Easen isi questions: What makes ar. argumront convincing? Movi do we: balance emotion and loaic in persuasion? Why is inportand for citzena tp spaak out on social hesues? ENATED BY REAL components af persuasive writing (claim, paragraphs on tanita: Phitppine -cognize obvious etsua sammie texts TER 2 (Meeting Standardsy Construct well organized gers i cizar thosis statements Sunport arguments with retew. i sources: Analyze persuasive techniques in advas a a i 1 Exceeding Stanasras): Craft soph genre nivorscy nieces (speouhes, op eds, proposals} Evaluaie the utiecteness of ditferani mhetancal syateuies for various audiences | Synihesize multiple perspectives on complex Phuliepine social iesies DiFFERERTIATED BY INTEREST: Students choose soviet insues fiat personally matter 18 them (poverty, enucatian, | environment, etc.) Cotions tor different communication formats (wsitien, oral, matimedia, vi | «Choice in audionce (pears, sdicipistrstors, [ocal government, general pumtic) i FERENTATED BY LEARNING PROFILE: Visual ieamers create infographis and poster -ampaigns Auditor, earners daveton podea: 1s oF vadio ats Kinesthe i onganize awareness campaigns or community Sonus Linguistic wearer: wile traditional i v¢ estoy OF Speeches UNIVERGAL OBJECTIVES: Demonavale undersianding of | persuasive apesais (ethos, pathos, ings) Researcn Ph) cial isaues | sources Respect divame perspact | te sevise and improve oersuasve sasens, evidence) Wits simele per issues suas"
    },
    {
        "image": "lessons2_synth_13_aug4.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY oF THE PHILIPPINES: Diliman, Geran CH of Education Professional Development TATED LESSON PLAN T Procave wera, 2 mse, se AGED cauned on rence ane tere 4 (cot ay ta pao t 1 aaing Tecer i We Capers ° peeve Taint Caren ele Sete Seat 4 owes t Tpnnaine aivong ane Agvoneny oF 1 1 iemanie tneenacesn oh | papers Soci EE i pp Vases azar be SS as [eres _ en ee i Be Ves’ Hews cass te ceca to cveaie pave 10 rarige’? Tris tassan EMPOTENS sivaemis | Beet |e ‘sneocatas foc Pngper® SHAT ceases racy persuasive Wend Shogete wt i Geiss remand teeth a ere sens: PROSE 2 | rectors stasegies sso 2 one aL AHS a HFT coming? oes rp iin a cxiza7s 9 OAK oxton 20088 coe exnotign an tage Ih persis TER 1 hes egoots, 2 9aNE? jah issues RecagTaes sandy: Conebct wargame potevont widen? casper sponte advoracy Bets reas fiero enancas HEARRDIES sigpine yaeial sours DFE ton oo st (py CEUEEEED purtten, ora osannd, visu pea guremnanvent ea USK? ‘ate jnsographics ane sot i inapiiedc @aers sje rections? 4 wagons ‘apgty toauba i 3 gure pare vend parsuscive ema pour cranial PHD od apencner TER 2 mpeacnss opes | partion tae: PIGS sqmnpte tents THER 2 entng Sa i gar inests S80! souroee Anata porsuazh texceediag Sanadandsk” Seah aopnisticated i peaposish> ‘Evaluate the offerte! Bente mutole sparspectvan mi samples FF guveriet Sete chooMs ‘eociat issues that parsers | eevatcarmant ats 3+ Gpsare “pesca oaresusoncaeot TAS ronnica i mua “peers, eanost acura ators GurERENTIATER By LEARNT ‘PROEILE: Visti nares caragaigns mpsaary antes ASEHCD peageast scrinss 07 18d 0 BCS \\ organice aerareness seg OF COLOIMES ‘dongine Linguistic Wernees peniuanine ease cTWES pamensrale Un | permanent (re ‘pumor sages) “esecich PERDAAS social corso Touran Reepeotene acopeesn wits ovo re BF DT 1 positon [green ad orev 2 communis"
    },
    {
        "image": "lessons2_synth_13_aug5.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF THE PHIIPPINES Ditimian, Quezon city Faculty of Education Professional Dk S apm 5) Fleubie seadng, 98 stucenin teced acavtine f Pated an reacties andintecest aval | BNwan Laoguage Ane Seca Comes fee Sots] Colt Spectat I rene cena sen egy fe Wiig ar Acivecany anh Bipe ot Disrentaed ieivuetion wth Cho Suerte | Prope Soc [tesen seat Tired Aawipernenty i eee HONAL Rag satel tinciamed cea 3] [E Bigtdear™ How car we uge ianguags to create poslive son a inge? Thes fescon empowers skatenis 9) Efaratial |_| become eceacetes tor Pralaomre sues through persuasive weting, Shicents wi i a le lane that eflectve co nmunicaton requitas understanding audignes, pupae, and i i Mnelovicl stategies. Easenta! cuestons: ¥Frat iakas an stgumort sony a Howdowe i Balance emotion ans iia ie paeuasions Whore issues? tant for Cizens ts speax cute saciat NESS: TER 4 [Aupoon FERENTIGTED 8Y READ components ofp petsvasive puraarapis on ssetes Pion feehniques in sameis texts THER 2 Mesing Stones so0088- Analyze persuasive techn ‘Exceeding Sencoras) | proposats) Evatuat advocacy campaigns and apes SISK sophisteated mut sance atvatecy nieces (spaeches, sp 0es ettectivens rirhetoriea sitategies for various auniienoes | 1 ses mullle Derspectives on complex Phitgpine eaciat isaues DIFFEREMnATED By DINTEREST: te SOCis! issues that porsunetiy cater to them ipoverty, education, t ++ Options fur diferent Communication formats (writier Shien autiozce oer, school administatare local gover DIEFEREHTIATES BY LEARNING PROELE campaigns Auditory lesiners develop podcast sexipts oy rade aeAeE carapaigns a: iu SSTUASIVE essays oF spoechos LINN fe Renuative anpsas (2bos, patios, teqos}-- Raveaich Philpgine social Sslutuas Respect diverse cecscecivs while savocat revise and inxien seercnicabon, ms mes, visual Arent general pubiicy i Viswal iearners create integraph nds Kinesthetic learner ty forums Linguistic teamers site traditional vonurstan 8 ust VAL OBJECTIVES: Demonestra"
    },
    {
        "image": "lessons2_synth_14_aug1.png",
        "label": "lessons",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Wetine of Teaching and Leeming Sciences Scot, Orta Sa Saweag aaa trea Temwan a {a Cvsveraeg Teacher: Oven Gangane (Caerocee: Serowe porary, student. Promes | NIT\" 4. ate Seven ene a -etapee sear tere coats soe oka be Eran Tyee of Sie ISTROTHIONT PLAN"
    },
    {
        "image": "lessons2_synth_14_aug2.png",
        "label": "lessons",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY ‘Quezon City. that Manta Insite of Tascting and Leaming Sci ade Levet ond De La Sate eid ‘Santino Zoom Schoct Grade 3 Cotoeraing Teacher Dyan Goreatar i inet rey ="
    },
    {
        "image": "lessons2_synth_14_aug3.png",
        "label": "lessons",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Quezon Gity, Mato Sania nstinte of Teaching and Learnieg 3 PROIEL BAS! Hern Fara BD LESSON F. Ge Ua Sale Santag: Zobe! Seno! Compe any Teasrer Dvign Suntan Compuin: obrcatory, 32 amon teases Of ate deveriprrenn maiesoogy | Cmputer Scamce Quaevene Erarsovereushio ceaaeee “VAre Sides egni oon pew canary aapiwe wlth spectat eee and emuvemeemustaien create seeds i (Wwe Tein tee Coveorment th Paipsre ESBral! pec sgnea ugar winiienips theeng Cemunty Sot aions, j hee anc bogie Devernpment 1 ane SCG TES fea Tipo To Big Wen Vio can wchnosagy aditess agi cone see tient Essentiot Priuppine community oroviens ani Gevelce mooie age solutions through Gesign mhivainy and | Questions: agde meinocology Se: eis wil undorstane that succacety! lechnoinyy novation 16 emnatny, eration, and business viability Essential questions Whal problems 5 cur cemmutity need solving? How do we design technolagy hat padpie actully wantin use? iat makes | mehnoteg startup success mn the Priipomes? ues! Rint ORVECTIVES: Roply Gemge: thnking prucest (ampeanas, Gefen, Memo, 1 BPE Ceri tiagnarh* Use Byte metNedongy wih speeits, stand une, and cewcepectwess | Menooe aupct nee datvaatis, ant tee caonninnes Doctarent Seveutinat Bra ene eas roan and pogene reps TECHICR OIF ES nays exw neeceinengn terves, | auveya. ane ota ate 1 Fréene eeerign Sani atti arg man ap eat Eeatens asd aec8cA8 Warda m *Devek Liner wee HRI OM Unt AeeaN CevezaneD ass arc eunlers Tes! a deb opp tars By nese teatock Pecans echr eeaene ears Wo moh ects a torical ascarcee DUSIMESE ORLETAES | Sic ain aneh ot nang FERS ara Competin Pnaynd Deven Raat (OSCR CaN i esunes ine spastic ates veyron, extras sede Crass Macs Uoeetor8 ars i ng recarerna ty Brine noraat PA vu oem bpd cng pevarsee ars secvae sstar oa, COUABORATION COJECTTAES Runstonalctvay 1 098 ars mM Bete! (poect rcaie, canine devine fee Resot a sorta canatrtwey arate veces | dmracvancahy «Cie ae eatin cet emadox on acre n prereae Dam nabai eecouriaty | eset exmeutons ess ueseas ENTREPRENEUR, WUDSET nase aN at MaRS venotinty a genat age cron \"Siew erat and onal a eRe eR ATOR RS Dorval senetng 5 den eg ee Figo aern Conroe Wes rps an ea i 1 mpacatons cf iecnnengy saKort"
    },
    {
        "image": "lessons2_synth_14_aug4.png",
        "label": "lessons",
        "ocr_text": "WimbtBA UNIVE aSITy ATENEO 0 quyezor city, Mevo Man acd Leeming 5} jastitute of Teaching Ch BASED LESSON PLAN ts, eR gooreatory, 3 abide gia cneesogenent EEE eo Ctassrovns gene oF Te Le Sate Stags ‘yen Sonaslet coxpacatng Teaser “jasbuny adseiee sion peated Trader an frgoness ost and Ade Deversoerant ig Jensen Chalten gee teda8 widenity b senadiogy raretserns incur communlly T riaw can teannavasy across a rinanine cornmusity problanss and ogy. Seacons nt necerstane Bh 1 emnpatty, era ie uginass viability Esser siete to we ouage mennaiogy frat eaante Ae rity war a use? ABLES aul in ah Pranppines wd emeaties, ocird pekospecives* G1 gens Se gio svete wh penststees DOS eg ESOS sey, ard, ML reams avercgrnenszccess mavens eee vr mens eg HAHN, eign ser wrt oes Ae ON | pen ong sae SECON prevent poise (Sovsme ach tee. | aesign pornais art pragass rapes 1 gurveye, and ote WR jn Driiggine coment ‘sokutiuns and companies gratyaia Devel 68 a5 MOEA) CEINAR H oe «creas areal romans 2A H ae grunge 8 eeamabe decors | i pravl eas 28 a cathe _yatorar segs, \"eve Pea rg. Funct atfectiaty ons vagens Danent « Espo 4 i sede Serer inp wene eet. Eo een x Paton mel 1 ergs DOR SSORATON DESELT | Gemorratzaly Gwe and recat entrain: Seocask a Hk doe becivhuat contents 10 e030 .coess ENTREPH te ey ate eevee ZOE ney cere Fe es Ca Seratanpant end ee! \\ ro ef Gactencngy SOMES engieation"
    },
    {
        "image": "lessons2_synth_14_aug5.png",
        "label": "lessons",
        "ocr_text": "ATENEO DEM AMILA URIVERS! ceiezon City, Met Manila nd Leaming Sciences uta of Toasting GOR PLAR PROJECT BASED ‘Songs bear T caveat oaeay { Vital, Gaade be Lhe aod 5 t cooperating Teacner Byler sear \\eesee ati Faaerer OY soars of ag Cia pnvsenteisaniey -etspine Teenctoron sevded sau a0 REG TIIOH Caste NER AEE Coonputer Sree BUSTS eeirupreneenetio a ~ [Tce sop Devetsaret fo Prauois T paaget Based Leueneny wh Cake THEE corners Santos [ewe a ae Deveromecs penne tne GEE TION AT, PLAN annem \"reeds? Tals testan ehatienges shee ng through denige thinking apd emmy arimoragy ads (row cae phitppine comaniaty problems and develo mobile 2op sotutar 5 gaestiowiars aa edstony. lane thot 3 shogy inet i agie metnadsions. stan Argh sesccenshal acter AACN i 2 ggertiat meatus: Wereat pinDie! nang fusiness viatitiy ow de we design tachnok nese saiaing? sere ote acy nana ESE? WOOL TSHERA | ecrpiony strtvy Success | opatise, dete, erate, eT WES. Apniy dain tanking present PROJECT MANBOEN Toatchype, est so agp covetepnet* Uae ane 2s ray wth aps, cep, an ceNESAACHER spe nara rengonetoates GOcimnant SeveSipTent NEES neous etorviows, ‘yee needs tous ve Dosis user atertnoze footing rachle sew HO i ental amp reovryes wor eee Cer esanens | Manage araject fmetne. dobre sORS, i sesign acca ar proarest eae i eee paichoenaten o rsp coe i rretes ane acorsobiy nunca D8V0EE i eae Mica ream oto ses mais YE feusch res | technica sclutio nical and norstechaical cinkerces BUSINESS OBECT | te ts oneness acre Tsing» Ps ve v8 1 eRe ge onto cone emeni, rere Sas 0S! Tocca at ee tom gre nF MEN AM BES esestaton 28 earns wttacnigned | Gerrontraton sts GOLLABOSATION OBIECTNES Functon etectveay or olzerte ngotve cantina canatractvely arstamate GSCREDS hi. QESECTVES BF cy leary toh fe Toe traest ana, ene, cet at) |e ee, cra a rete coneturveethach on won KOE Spenwitaie ascenntantty eyes, RIOUE» Embrace ae #8 HG canis sear asconss ETRE 1 gettin conten 1 epee ant pre rs atanges Sm! aR 1 erence ouaaca wencahy kenrg tr Faso WHS ications ef tects sotations snp ara ncn pene oe Consider sociatimpset are ethical!"
    },
    {
        "image": "lessons2_synth_15_aug1.png",
        "label": "lessons",
        "ocr_text": "UN VERSITY OF SANTO. TOMAS Manila, thetro Mania Sotlege of Eaucation Feachor Eevcation Sapatment DEMONS, LESSON PLAN as PeSvene Scenes High Shami oiaee w Stonare best Ccuserntey Teaser canes Wars Cooperation oes Teactice Content opie arsroons, le staterse, Reteesreueston format vein multmnecta supa nh Ltsrahe Prigpie odens te Neeing a eee macoe mages aE Tasehng was Uiretyg Discurcin aes Seas Oncioustess? Ths lesson expe Patipace anda etait canbe a 8} seston How ed tres awjerous by °d shape national 2 Riza s Noite Tangeve as Baty a iterary Questroniey: | Shadents wit w dently ommanon E55 Ste was ths novel con: He contemporan *itippine revoluton raethi venice for social change ana natona! Riga! use ficton tw extose colonial inusieeyy Sponish authorities? Vinat elevance does 4 have Y Pits Be ijectisgs istorinal context of Spanish cofonizatia ard literary devices i Noli hie ‘ilivpine eationetist may Explain the symbotiery tieuclors tnierpras Tangire Evalunie thy COMPRERENS) tepresanti 8 novel s ee of key characty 28505 aed jn textual evidones ‘ial wociety Compare cctoniaiera injustices wi h contemporary sociat i issues APPLICATION OBJECTIVES Agsiy itoray Swalysis teckniques to exaining H aacempts from the nays Connect historical the novels themes to ECTIVES: Exam Osconstuet the 13 te speciic scenes and characty el Philistine socio political stu {te sslationship betwoun tenstira and 5 26 RecTative Lechelaies ineastigg beck SYNTHE: é VES PS Malor themes Develop arg 86 Buvsonat responses to Ri OBJECTIVES: Assess the atfect torical acer stations ent adapt of eoeen hovel s strectun why Spanish wpceseetstions Sontinuing reteven Cheate visual RUMEN aot the rene’ vision for Flipino identity EVAL UA TIGA; i IvaneSS Of Herature as 3 tool for son of Rizals portrayal of tations. of the nove:"
    },
    {
        "image": "lessons2_synth_15_aug2.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS sania, Mote Mania Cellage of Edtsnation Teacher Education Department sPRATKALEGBON PLAN [Bresirtler ele i fied Gaxssnonme Ler snd ae ete cae a eats Cope Tsar cay es =| PGouteat ew tat | apne Lecatie Pagere Hs Topic: t Bo? t sae: a i Tet we Taryere: Cana “Tipe nf Bemorsteainn Tasch uth trast t i Linrary Sigetirece: [tow Diacunsion and dat sit 234? This lessen wnarines Soak [tte Spree toeguusse enaierey present hatched SOO Goes erature retort and shape natanal cansci ae ox _ Rust Not fe Tangara as bam 8 ieraty mavterpings and s cazaiyel for Praiypine revokes, ne Students well understand that erate’ coe ‘pe a powerlul vehicie for social change ane salonst caon wy expose cotonualinseticas? there Essestial quentions, Mow dia Rival aa fot cqneisared dangecnus oy Saanisn authonbes? What inpuse society? 1 ety sme i yany mas te | te coetemporary Phil ralewance a T Analyze the histcaicst context of Spanish colonization i icartity maior thames, characters, snd literary devices in Nal tej | Tangara Evaluate tie navel s impact ot Philogine nationalist movemont t COMPREHENSION OBJECT AVES: Explain the symbetiann of i represanting ‘sucis! clasoes and tretitutians interpret Rizal s catique dowonint society i chrough tantual evidence Compare coicniatere iniuations uate, carkemporary socks [issues APPLICATION OBJECTIVES.» Apel theray analysis tachiniques to oxaring 2 rovel Connect historical avant vive OBJECT at [ones y casing Rizal s be ta sgeniic soenes and character} excompis ftom motivations Relate the pearel s thames to cument Sripging sore pabtical situations Hi relationship between fitaatare and social ieform | ANALYSIS OBJECTIVES: Examine H Le econstmci the reee s structure and sethortien anti tho book SYNTHESIS OB; of the novel s majee themes Develop argexnents about the na Formulate pursonal msporrses te Rizal vision for Shipina iderdity EVALUATION H OBJECTIVES: Ausese the affectiverness ef inundure as a too! for sqcial cemaneniary \\ Suaiga the nistartent accuracy of Rizal portrayal of ens sitive eneederts i ieterpretations end ecaptations of the revel i ecstive techniques «investigate vity Spardmh TIVES: Cronte visual repreneniations eis condiuing mavance="
    },
    {
        "image": "lessons2_synth_15_aug3.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Manila, Metro Manila College of Education Teacher Education Department DEMONSTRATION LESSON PLAN poner Jose Patty Lewtand Pine Sconce High Sama Grows 10 [peo Standard ciassroom, 40 student, Level and Cooperating Teacher: Casey Ward (Classrecens lecture discussion format with muttmedia support Teter Content Area and Filipino Literature Philppine History Are Students 1 student wth hearing impairment sign Tople: Rees?! unavage meter patent tone vesting Taso Ties institutions Interpret Rizal cttque of colonial society through textual evidence Compare colonial era i issues APPLICATION OBJECTIVES: Apply literary analysis techniques to examine ‘excerpts from the novel Connect hist ‘orical events to specific scenes and character motivations Relate the novel s themes to current Philippi Investigate why Spanish 'YNTHESIS OBJECTIVES: Create visual representations Of the novel s major themes Develop arguments about the"
    },
    {
        "image": "lessons2_synth_15_aug4.png",
        "label": "lessons",
        "ocr_text": "UND RSITY OF SANTO TOMAS Maniia, evo Martie Coftege of Ex ation Teacher Education Department DEMONSTRATION SON PLAN Standard clapsrecen, 40 students, iocture eiscussene kamal wth mu patie Scarce Yan Schoaarde 1 bevel aod Cooperating Demmonnteation Teaching with inter Disoussnon and Anatyais “Exdimated Tine frame of Lesson TE Big bi How does iiterata 880\" ena Essontial || Rizal’ Not Me Tangere as bait 2 timary maienploce and a catayel 9 Phsiopine revulvion, | Quiescent ghiaents wi understand that Harature cx aul wehicis for seciai change and national i identity Esgental questions: colonial inqustioes? =) i Why was this novel considered dangerous by Spani i i rontemsctary Phitinpine society? eration, ance Gous fi ft colonia sinNolMe ation i erery dex sl rocrverrennt 1 m of key characters t Rizal s critique of usthoes with 1 Vangere Eveluate the novel’ impact on Phiippine H COMPREHENSION OBJECTIVES: Explain the sy nbot representing social classes are inetituilans rough textual evidence Seinpare coionia ors i porary 90c! Bssues APPLICATION OBJECTIVES. Apsly therary analysis techetques to examine j excegite from the novel Connect historical avents to specific scenas and character i mative ANALYS! ns Relate the novel s thames to IS CRJECTIVES. Examine the r ent Phiiapine soelo paitical sis jonship netween tte fue and social caform i + Deconstrct the novel s struotie and namative techniques investigate why Spanisty i authorities banned the book SYNTHESIS OBJECTIVES: Create visual representations: i of the novels maj ments ebout the novets contining relevance | ion for Fi Formulate personal VALUATION i OBJECTIVES Ass a8 a foul fer social commentary | Jaxige the historical accuracy af Rizal s portraye! of colonial society Critique modern ns aind adaptations of the novel ne idetity"
    },
    {
        "image": "lessons2_synth_15_aug5.png",
        "label": "lessons",
        "ocr_text": "OF SANTO TOMAS DEMONSTRATION LESSON PLAT Preserstes oens Wwe aa hee Staniowts oe _~; Needs: a jousness? ig den? Essential ucstionssy 25 both a literary mas erature can be ontty formation, Essential questions, How gic piene anid a cs y was th we contemporar HI Obgectiveis: the histon BJECTIVES. fnaly dering Re ne nove’ impact oF ENSION OBJECTIVES Expiaie ippine nation repre iting sccial classes age i ence Compare coioniatera excerpts from the navel Connect histarical evenis to sper ions Relate the novel themes te rant Philippine socic poltical sitvations OBJECTIVES Examine the relatfonship between fireralure ond social reform onstuct the novel s strusty and nartative techncaes lavestigate way Spanish wed the book SYNTHESIS thoy fe presentations cf the nevel s maja Develop arguovent continuing reley izal s vision for Filipine identity EVALUATION ORJECTIVES Asse: tiveness of murat be madlerr sq"
    },
    {
        "image": "lessons2_synth_16_aug1.png",
        "label": "lessons",
        "ocr_text": "DE LA SALLE UNIVERSITY ‘Manda Metro Manda College of Education Teacher Education Department INTEGRATIVE LESSON PLAN"
    },
    {
        "image": "lessons2_synth_16_aug2.png",
        "label": "lessons",
        "ocr_text": "DE LA SALLE UNIVERSITY Manila, Metro Manila College of Education Teacher Education Department INTEGRATIVE LESSON PLAN Preservice Carrie Shaw Scat Cle Uae ofan eet Tfarng, Meer carn 2 te ‘School Grade 12 Cooperating Teacher: e mixed ability levels, collaborative learning setup ‘Are Students 2 stugents wih visual mparment, 1 student ‘with Spectal wan ADHD accommodations provided Needs! Lesson Tite: ‘Quadratic Functions and Projectie Motion TYPe of Integrative, Problem Based Learning with Lessa, collaborative group work se =| INSTRUCTIONAL PLAN ‘Estimated Time frame of Lesson 120 Tig Ideal] How do mathematical functions mode! real world phenomena? This lesson integrates algebra Essential ‘and physics to demonstrate how quadratic functions describe projectile motion, Students will Question e s ‘explore the relationship between mathematical representations and physical observations, understanding that mathematics is a powerful tol for predicting and analyzing natural events. Essential questions: Why do objects follow curved paths? How can we predict where a projectile ‘will land? What is the connection between parabolas and motion? TL. Objectivets): KNOWLEDGE OBJECTIVES: Define quadratic functions and identify their characteristics (vertex, axis of symmetry, direction) Explain the physics principles governing projectile motion including gravity s effect Describe the relationship between quadratic equations and parabolic trajectories SKILLS OBJECTIVES: Graph quadratic functions and interpret key features in the context of projectile motion Calculate maximum height, range, and time of flight using quadratic formulas Conduct experiments ‘measuring projectile motion and collect accurate data Use technology (graphing calculators, simulation software) to model motion AFFECTIVE OBJECTIVES: ‘Appreciate the interconnection between mathematics and science disciplines Develop curiosity about real world applications of mathematical concepts Demonstrate persistence in solving complex, multi step problems PSYCHOMOTOR OBJECTIVES: Perform projectile motion experiments with proper measurement techniques Manipulate ‘simulation software to test various initial conditions Create visual representations of data through graphs and diagrams INTEGRATION COMPETENCIES: Synthesize concepts from mathematics and physics to solve authentic problems Apply critical thinking to analyze the accuracy of mathematical models Communicate findings using appropriate mathematical and scientific terminology"
    },
    {
        "image": "lessons2_synth_16_aug3.png",
        "label": "lessons",
        "ocr_text": "DE LA SALLE UNIVERSITY Manila, Metro Manila College of Education Teacher Education Department INTEGRATIVE LESSON PLAN Pre Service [peal Carrie Shaw School, Grade University ofthe Phippines integrated T9PEO! Heterogeneous classroom wih 35 students, ati ‘School Grade 12 Cooperating Teacher: Classroom: maced abiity levels, colaborative learning Sere Jacob Scott setup Content Area and ‘Are Students Mathematics Algebra Science Physes students wit visual impairment, 1 student Tople: with Special with ADHD accommodations provided Tesson Title Quadratte Functions and Projectie Motion T Pe of Integrative, Problen Based Learning with Lesson ‘colaboratve group work JE INSTRUCTIONAL PLAN Estimated Time frame of Lesson 22 1. Big Ideas How do mathematical functions model real world phenomena? This lesson integrates algebra a and physics to demonstrate how quadratic functions describe projectile motion. Students will Question s): explore the relationship between mathematical representations and physical observations, understanding that mathematics is a powerful tool for predicting and analyzing natural events. Essential questions: Why do objects follow curved paths? How can we predict where a projectile ‘will land? Whatis the connection between parabolas and motion? TI. Objectives): KNOWLEDGE OBJECTIVES: Define quadratic functions and identify their characteristics (vertex, axis of symmetry, direction) Explain the physics principles governing projectile motion including gravity s effect Describe the relationship between ‘quadratic equations and parabolic trajectories SKILLS OBJECTIVES: Graph quadratic functions and interpret key features in the context of projectile motion Calculate maximum height, range, and time of flight using quadratic formulas Conduct experiments, measuring projectile motion and collect accurate data Use technology (graphing calculators, simulation software) to model motion AFFECTIVE OBJECTIVES: Appreciate the interconnecti between mathematics and science disciplines Develop curiosity about real world applications of mathematical concepts Demonstrate persistence in solving complex, multi step problems PSYCHOMOTOR OBJECTIVES: Perform projectile motion experiments with proper measurement techniques Manipulate simulation software to test various initial conditions Create visual representations of data through graphs and diagrams INTEGRATION COMPETENCIES: Synthesize concepts from mathematics and physics to solve authentic problems Apply critical thinking to analyze the accuracy of mathematical models Communicate findings using appropriate mathematical and scientific terminology"
    },
    {
        "image": "lessons2_synth_16_aug4.png",
        "label": "lessons",
        "ocr_text": "DE LASALLE UNIVERS Fry Catlege of Exlscation Teacher Edcetign Geneetment recat LESSON PLan eterugerenace cissarcuen iced aby eons sen Ws 95 eszaense ‘Saborgtes teary Science. Fiaynies i Reese wn vate +| son cat [smgeet soavnic semen wove PRE ton Bae oT ears, Prot Rcsed Laurin wats} [ies camsoaratve groupe i ee re tr eee een fe Big teal How ca msitonaticg funenone nord Bhenarsena? This season integrase sige Fasoetied | 880 physics te damaaatate ow quaaroic funclons deunite preiockia moter. Students wis { Qusstlonse noe ‘alatlonstip betwwan magematon re Hl i santations snl physica! cosereations, “csiating tal matienates a sewer tool ine Essential questions: wiry ao os ‘sdicting and analyzing nawrad events, orton eae SeivaG Dal? How van wu siecict een 5 siojectie ¥ AS He GWoEn pareeas and mohan? i. Objectives one quastratic functions, ang idertity thes tek, axis af symnen diection) Exetain the physics RASRal iGiecte motion tnclucing revi’ ofact« Dose i Guatatic equations and aatatefis Yaisctories SKILLS OR JE CTWES: Graph quadraie i i sires agin Ny feso08 in the contest ot projectin mictlon Calnulate Saxiinirs height. range. ad time of igh sing quadrats tarmuias Condict eape measucing proectte re ard collect accurate dat 2 Use lechasiogy ieaphing Sutheace) te mode! mation AFFECTIVE Ci winelples i ‘ibe the relationship betwen | TIVES: | fe the Inteeconnotion beanai 1 athomatios and science dsetp \"83° Develops | Sutlosity about robardia 3 cations of mathematical foticepts Demonstrate Hi i Betnistence in solving com lok, multistep protlems Bs Petforn projectilo motion. eminent ith proper SY CHOMOTOR OB JE CY mossurenend technigare Maniniate i SPtulaton softwans to test visions 2 feniitions Siesta visual mysesentatinns of asta 1 | EtOuOe reeiis and disgams INTECRATIC METER i te ES. Synthasize con mathematics and py ephy cdticat sickens i APalyze the accuracy a math | mathematic at Hextings using appcapciate 939 Salve autheriie penile Be ete Communie,"
    },
    {
        "image": "lessons2_synth_16_aug5.png",
        "label": "lessons",
        "ocr_text": "DE LA SALLE UNIVERSITY Manila, Metro Manila allege of Education Teacher Education Department INTEGRATIVE LESSON PLAN Carrie Shaw ul Iniversity of the Phiippines Integrates ‘School Grade 12 Cooperating Teacher: Jacob Scott Type of Heterogeneous classroom wah 35 students, Clasroom: ‘ie ably levels, colaboratve ang ‘Mathematics Algebra Science Physics ‘Are ‘Students 2 students with visual impairment, 1 student ‘Quadratic Functions and Projectie Motion ‘How do mathemati nd physics to demonstrate how quadratic ‘explore the relationship between mathemat ‘understanding that mathematics is a powel Essential questions: Why do objects follow ‘cal functions model real world phenor mena? This lesson rojectile motion. Students will physical observations, fu tool for predicting and analyzing natural events ‘curved paths? How can we predict where a projectile functions describe p tical representations and x eemana? Wha ste connecton between parabolas and mOtOn? TI. Objectivets): inctions and identify their KNOWLEDGE OBJECTIVES: Define quadratic fu ‘irection) Explain the physics principles characteristics (vertex, axis of symmetry, governing projectile ‘motion including gravity s effect Describe the relationship between ‘OBJECTIVES: Graph quadratic ie equations and parabolic trajectories SKILLS ‘context of projectile motion Calculate collect accurate data Use technology (graphing measuring projectile motion and 0 model mation AFFECTIVE OBJECTIVES: calculators, simulation software) jate the interconnection between ‘rathematics and science disciplines Develop -al concepts Demonstrate \\OTOR OBJECTIVES: persistence in solving complex, multi step problems PSYCHOM Perform projectile motion experiments with Proper measurement techniques Manipulate ‘conditions Create visual representations of data simulation software to test various initial INTEGRATION COMPETENCI to solve authentic problems xy of mathematical ‘models Communicate fi entific terminology through graphs and diagrams: from mathematics and physics ‘Apply critical thinking to indings using appropriate"
    },
    {
        "image": "lessons2_synth_17_aug1.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES Citman, Guezon City Facuity of Education Professional Devatopment INQUIRY BASTD LESSON PLAN Tescbers __ DABS OVO oe a |feetcri Pass eimastincnaabae QRH iaoncy aaecoumounnase [teatand Coonmaing Teac Aut, Jeeaton Cssream eimentone arnt Teacher —__. nn one es ro adona wi apesut ronda, but mooety conaideraions tor fakt wore incase! inaeary Baved Wenning wits Schmit Srverigaton ai Data Anais i Endinyatsd Pime frame of Lewon 8 Brocess to investigate wai: guaiity in loc ai Phiionine nvers, Siudents wit understand hat i ecosystem noatt is measurable nrough chenical and biological mdicatore, and thst human i -sctons tive airect consaquences on anvwonmentai qualty Essamiai questions: Whatmares i Waver sate for tiving organisers? How can we measure ecosysten nein? What isaurrolem | i promehng water resources? ! Hi HW. Objectivers: jinauIeY Skis. Fomuate testable questions about water quaity ‘ond ecosystem | Realth Design controled exporiments to tent hypcthesas about poitution effects Collect | and organize quantilative and qualitative environmental daia Analyze data pattems t0 | craw evidence utsed conctutions SCIENTIFIC KNOWLEDGE: Icentity chemicat i i indicators of water quatity (pH, dissolved oxygen, nitrates, phosphates) Explain the i nétragen and phonphonus cyches in aquatic ecosystems Describe bicindicatar organisms: H St ther alain econystom asonesment Unerstand eutophicalion process and ts | Snvionmenta! impacts LABORATORY SKILLS. Use water testing equipment ani i chemical reagenis safely and sccurstaly Perform microscopic examination of water ! samples for microorganisms Recon! absetvations systematically using scientific i notation Calculate concentrations and compare values to wats quatily starcaris H ERVIRONMENTAI LITERACY: Recoguze scurcet of water potiution in Philippine | communities Evatuate the retutionship beiween lond use and waler quality Prowose evidence based solutions fer weter resource maragement Appreciate the cultura! and conor importance of clean water COLLABORATION AND COMMUNICATION, Work | ettactively in research tswmns with assigned rolee Presont scientitic findings using | appropiate crops and tables Deans concintens sin once tm experimen"
    },
    {
        "image": "lessons2_synth_17_aug2.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES, Diliman, Quezon city Faculty of Education Professional Development INQUIRY BASED LESSON PLAN PreService 7 Teacher: Davia Z Teva” Atoeo de Manta High Sena Grea 17 Tipe ar Laboratory and felt basea learning, 30 Level and Cooperating Teacher: Autumn Johnston Classroom: ‘students, hands on investigation format Cooperating ‘Teacher Tote \"#4 Sty Eeoogy Chemisty with Seta No students wit specianeeds, ba moby Topic: Environmental Science Rith Special considerations for held work included Weson Tile: water Quay and Ecosystem Hoan] Te Ingury Based Learning with Seenane Philippine Rivers: Lesson Investigation and Data Analysis, I. Big Ideas Oueations, B88 investgate water quaivinincernrn ne IL. Objective s): 's 10 test hypotheses about pollution effects Collect ve environmental data Analyze data patterns to IENTIFIC KNOWLEDGE: Identify chemical 'ved oxygen, nitrates, phosphates) Explain the ‘cles in aquatic ecosystems Describe bicindicator organisms and their role in ecosystem assessment Understand eutrophication process and its environmental impacts LABORATORY SKILLS: Use water testing equipment and and organize quantitative and qualitat draw evidence based conclusions SC} indicators of water quality (pH, dissoh Communities Evaluate the relationship between land use and water quality Propose evidence based solutions for water resource management Appreciate the cultural and ID COMMUNICATION: Work Present scientific findings using Using evidence from experimental entific work effectively in research teams with assigned roles appropriate graphs and tables Defend conclusions data Engage in peer review process to improve sei"
    },
    {
        "image": "lessons2_synth_17_aug3.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY oF THE PHILIPPINES, Diliman, Quezon City Faculty of Education Professional Development INQUIRY BASED LESSON PLAN, Pre Service Tenner David Meyer fchool, Grade Ceeree de Manta High School Grage 11 Type oF {aboratory and felt based learning, 39 Level and Cooperating Teacher Autumn Johostn Clnsroom: Cooperating Teacher INQUIRY SKILLS: Formulate testable ‘questions about water quality and ecosystem Design controlled experiments to test hypotheses about pollution effect Collect 2nd organize quantitative and qualitative rieionmental data Analyze data patterns te draw evidence based conclusions SCIENTIFIC KNOWLEDGE: \"dentify chemical indicators of water quality (PH, dissolved oxygen, a phates) Explain the nitrogen and phosphorus cycles in Sauatic ecosystems Describe biindicatee organisms 274 ther role in ecosystem assessment Understand eutrophication process ane its environmental impacts LABORATORY SKILLS: Use water testing equipment and chemical reagents safely and Pentel Perform microscopic examination of water Samples for microorganisms Record observations systematically using Scientific Notation Calculate c ions and compare values to water Quality standards ENVIRONMENTAL LITERACY. Recognize sources of i il communities Evaluate the relationship between land"
    },
    {
        "image": "lessons2_synth_17_aug4.png",
        "label": "lessons",
        "ocr_text": "JERSIDC OF THE PHILIPPINES Faculty of Eaucation Professional Developaiant WNQUIRY GASED LESSON PLAN Teacher: “ a =f a Schect. Grade Alenae $2 Marta righ Sere! Stace t Tipe ot Labee story and fesi tased earning, *: Levcbend 7 st Chasereonn: ne a an Cocaetatng Texhar. Auta Ashram sheerta binds on mosneaten Feteat aoUeN @cayySiEME? This lesson aves the Scwnnfic nquiry underetana sat fe noaugh chen cal and biological muicators, ated guat human ania! quailty E ential questions ‘Wrat MeKes mg ONG ATVSMS? [SOW CAN AO me ANUIO eDoEY ater Neg Angi Is Gur Tove se auaiity toes: Phiippine riers, Stderas wi ean is meascran actors nave dire et site for cachg consequences on anv Aeros pulate testable questices aba water quality and seonysran asnh esign contig expariments to test bypeteses about poliutea effects Colact UHL Objeottvens yguigey SKILLS Analy veer 406 oiparize quontiiative and qual ronments dat aia patterns to vee evidencehased conclusions SCIENIIFIC KNOWLEDGE. ktontify choin cal indicuters of aater quotity (ph, dissuived oxyaen nimatas, phos ohates} Extlan the 1 nitrogen en ghosphion ystems Gesciibe by enulcatey oxganisins ard their se in ear indarstand auropnic inpects LABORATORY SKILLS: Use water lasting aquiptnert sed ination of mace cycles in roma chanical eugents safaiy and eucurmely Peitorn miceescopin exami gies tor rnicionrganiems Recta ob rs Systematically notation Cate ations and comoure values te water qty ENVIROUAIENTAL LITERACY Recognize cowees of water colistion revues Evaiuate tite reintlonsship but ean ine wed Sclutions for water resource manageuent Amora onaiice of clear wales COLLABORATION AD COMMUN eliactively ia tasearch tems with as, grips and tables Defend canciusions using avigenice !om experiments! Engage in near roview cencans to iraprave 5 2 cone! iyned les Prosort scleniiic finginge using"
    },
    {
        "image": "lessons2_synth_17_aug5.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES Diliman, Quezon city Faculty of Education Professional Development INQUIRY BASED LESSON PLAN Preservice pleas David Meyer ‘School, Grade ‘Ateneo de Mania High School Grade 11 Type of Laboratory and field based learning, 30 Ccopentng Omang Toner Acer es, Cm stuns, handton reson fo Teacher Content Area and “Are Students Bidogy Ecology Chemisty No students wth special needs, but Topic: teeta Recast\"! consiseraton for fat won eine taswo Tit ter Guay and Ezoeysum Hann Leese’ lnqury Sased Lsaming wan Somme Philippine Rivers. ‘Lesson lnvestigatn and Data Analysis L. Big Ideay How do human activities im ont, Process to investigate water IL. Objectives: INQUIRY SKILLS: Formulate testable questions about water quality and ecosystem health Design controled experiments to test hypotheses about pollution effects Collect and organize quantitative and qualitative envirryventay data Analyze data pattems to drew evidence based conclusions SCIENTIFIC KNOWLEDGE: Identify chemical indi Phosphates) Explain the Describe bioindicator organisms rophication process and its water testing equipment and icroscopic examination of water ystematically using scientific chemical reagents safely and accurately Perform mic Samples for microorganisms Record observations «"
    },
    {
        "image": "lessons2_synth_18_aug1.png",
        "label": "lessons",
        "ocr_text": "URIVERSITY OF SANT TOMES: baeniia, Rete Manila gehacl of Education ars Hurnan Development LGT HASED LESSON PLAN Campanas iaboraitey, 32 atscer, pears of 6, aie cease TONE Schone rede tt eee Pape? iy rial Ge ta abe Gentioge Fame Lares wed Conseraans Tewener’ Mattar Mshy H pine predsd Thee Seis Faces on nat with Spectat| neyteoars and aerooome wait ceed i se age Deveioorret i ee ee ri ee RRC A Bessie Bae faecotisaea ed aden erty View can teonnotogy address 7 Thin weason cnatianges ining and i coremnuraty nods tears Birosigh Sesser ihe prune cemmunity problems and devsiop mobic 209 saat agie marmodntogy, Shadents wil understand that succosstu! technology ienewetian requis} snty Esunntat qasations. Waal eae ie Oar COMA i pagathy, lsration, and DUBINeE eae setving? Maw ge we Geaign tocneniogy at t permotegy stamun succession the PRiiopines? siocpia actualy wantin use? Wat maBeS “Tig Bonen beac peso ope, HNO, HES ren oor, eteeaup, ara rercensctats* Teves cCeRS EDR cove readin sah RHEE, ndtoces éosirg abe ape wat i apiroprate cevetaneact teotASEMS penkoiype, aout am app levees NY OBJECTIVE sa gts mstoecs rena pjec rn, sesraegi, and eas (26S Decunant cepesthy TELHDHOAL OBJECTIVES sons gomenutinn Design se! arene ep geCIOYDD wD rises, Heong Sa ae CYC AT pois anata Mrevoeat achionn Sew tt aarp mse rexescsh oa rsiatng wisn Sener sn ners ST, Cte ti a Page mse Po tay eas es eenortaten j Se ea Sos BBORETIONN OBECTIES *Fercton einen) 0S in ange Hy (eee cael nanagee, dealer sevWapes site” B67 onficte cgnstracintay ans ne Beene A Gece «Uwe ad tare CE eee ppach nn cov preayea* emasrtate DESIGN Sop ineticiuael sedition: U9 Oa METEEDE ENTREPRENEURIAL RANDSET. Errace fatire #2 tears Dy pest ray cece“ Boon ene HS omer asin Spe ' 1 Seen ena eetedy my seniny he Fam wen Ca, Goo geat a8 ORS: I | eoosnse ot econ aman"
    },
    {
        "image": "lessons2_synth_18_aug2.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF SANTO TOM Manila aerate Schoci of Education and Human Develsement PROUECT BASED LESSON ALAN eisea Potts i Bro service Seno}, Grade Wee ot Le Sate S08 Cooperating Teactter: Namnar Hey Seles! Grade 1h Level ane Ghose, Coop UPeaho Content A Popte sare Stadonis Teson Title ani to idanity gh davian thi Phtipping Qnestbiwde Questinntsit age methedoiog Use agi mst Loy With sprints CLLARCRATION ORES hy a cerooraticaty Give ann secewe constructive teedhank on work ENTREF Ardsations to al senstivty ih dasigning for Finns"
    },
    {
        "image": "lessons2_synth_18_aug3.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS: ante, tet Manity hos! of Education acd Homse Nevelopmant PRMECT. BASED LESRON PLAN [ReSenis eet Tren” Goatees Pow 4 = ae | One Sle Santis devi Sena Grage 1h Comet shesitery, Samide, opt | Conpstatin: Taner Data ety [Cmirwne soaea cha nas ewvecinannaioeey i i a oh Seer Socata Science Busia LAR ststeoc ain payne amceaty sacooine P | Sniestenemenes Merrow ans eycnome wastes pncine wpm .. { Mote App Deverpmsnd or Cameranty Solions ret ailment ana, Rotctued iar nar Suan Tog i Re Sapte Dew siogemany i Opa pon SHORES ~~ 7 vane eeadaay, PBIBGINS conmandyorbiens and caves nenae oe tteough design tinking and * \"| age mehadoiogy, Skatsnt wil uncatanet Eat succeastel inchnotogy innovation requires i i empathy, Aeration, sad busin ss visbilly, Esaental questions: stmat j j Reed cobving’? How do we dasign tectietogy thi j fechnatogy startup successtul in he Pritlopises’ tems in su sormuniy fenble achialy want io use? What makes a H CRRAEST MAAAGELGESY OBS TIES.- Sony mesg neni ocean (ewpwa® Seto, owe t fi, (est) i BOR deveionment Ue agte snethoiingy wit apents, standup, and: iatrompeetives | _ Tense iit tesa, sete sts, a tain epacsintien» Bacar aevetgrndpecone Pre ep i H G88 Kewnets anc progress reports TECHNIOAL OBS TIVES Araivze user sends through interviews, | veya, ats observation i Pitz eucrmuriies Durty vawrtetaons tke ete pp be H | Dactens ord arcwaneity standaris Davey cents! aep ocsteyeen using aporonrnte oe, etooeuiit | tows ana platforms Test and stag anpieatin Sirough teratiee cyeion wih sum tonaback Breet j | eeteieat sein soa ety scot ant ncn ena trocar Sevens een j Corrtict mertet research en essing nohtions ane cueneion anaes | Serttyen vote prapmdton, custome gegen. rece i Basie reaurenesta fr Propine market Pach at Semacsessation skis COUABORATION roe romeo meanayer Dewees uateoe macet cares Tue sees Creme ance ccojeetane ant up one 0 pans using censertetan ant OBSECTIVES: Fuctcten affecurey in civarne trome wit enaignat pe, Severe, test) Ressve cons consbuctvey ae mate aunaie eats Give aps rection cats Seach 8 wars Seegnest Dereon RRS coeston wor nusons TEEPE URS Ente ee cot) H Siparkantty and utsint Ueeagn chatonans Show crestuity and nowation 35 Prakieesoting spgrmaiien | Damenatate cute: sacaticty w desizing fr Hibino users Conaiter anon pact nahin i breisanora ortoernatoy cota"
    },
    {
        "image": "lessons2_synth_18_aug4.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Manila, Metro Manila ‘School of Education and Human Development PROJECT BASED LESSON PLAN react Chelsea Potts Teveltaa® De La Sate Santago Zobe! Schoo Grade 11 Type of Computer abo students, project 2 tory, 32 siden, Level and Cooperating Teacher. Nathan Key Cimsroom: seams of pte deveapment nchoonny Teacher ‘Sgeaet Arve Consinr Scance uohows ‘Are Stade 1 student with physical disabity adaptive Rub Special seyooard and ergonomic worstater perded Project Based Learning with Design Thinking ‘and Agile Development Community needs? This lesson challenges students to identify ‘2nd develop mobile app solutions through design thinking and need solving? How do we design technology that people actually want technology startup successful in the Philippines? IL. Objectivets): ‘nical and non technical audiences BUSINESS OBJECTIVES: \"ing solutions and competitor analysis Develop business model canvas Create frnancial projections and Pitch startup ideas to panel using presentation and Gemonstaton skits COLLABORATION OBJECTIVES: Function eflecel in verse teame wth assigned ‘oles (project manager, designer, developer, tester) Resolve conflcts constructively and make decisions Ghrmocratcaly* Give and receive constructive feedback on workin progress Demonstrate accounabaty {0 ndviual Contrbtons fo team success ENTREPRENEURIAL MINDSET: Embrace fale as Lamnng ‘pportnty and persis through chalenges Show creativty and innovation in problem solving approaches Demonstrate cutural sensivty in designing for Flipno users Consider social impact and ethical implications of technology solutions"
    },
    {
        "image": "lessons2_synth_18_aug5.png",
        "label": "lessons",
        "ocr_text": "URAVERSITY OF SANTO TOMAS saan, vaetro Maro School of Education and Hunvat Bevelaement GON PLAN PROICTGASED LES 1 Songener irs, 2 ats pwaeet f fexgmerk ratiesoeD De ba Sate Sarge 20a Lars a 1 Cooperating Tavern Nesta Rely cooperate i ro of a auabiey asset ewonisin casas 1° sent ot ge overs and aexurars canary Sensor t savnernnsrehennromnsrent sesrvetnsnarnnonstate ttn MTS nel chatenges 34 harneemnson fener tn 1” Big ideal Tow can tecnnstogy acres pea commmueaty news? TRIS HENGE De Beenitas prappine community problems na Gavel mpobie app sotubone tug design HaNNG a8 ret onceetane ai oneal wcrc NAMES sequres igre in aurcemmnity | Garsionislt age metacalogy. Statunt kal questions. Wohi 1 ennai, terascn, 200 pusinass Vstay E800 1 1 fend stv Hane ao we cen wnernaiegy DP penple ochusty nant a ase? What MARS 3 t \\eonnotogy sarap suceosstain the PIBBES? Thopay ange tarwing roan conasatca tes, ee 1 veircagenties veh sortie, aN, BS i raanage neoiect nee, eer arai rotten roxpanatiinn Denar Cxvehepesnt OLE treo 1 sseneg ena ore progeaas rept TECHNIC SOEJECTIVES:« Analyze seat reads theca SNE, i reread csicry Be PPHEDDIE COMDTAEED HOSP ‘uae wkertacen ctenatng mats 2P OS stayansits Deven Sane actin apt accra uel 5 sworn ape grshyoes Unisg ABeTearaR® AEVOISAMETE i eas a ptorne Te oe 8 sa tna arte cma ih tet ePSBESL OIE 1 nical akinesia ttt eae and nen tcivicel waSeea HISINESS ORIERTES | Sextet ae reve ting eM veenpeton snubs Geni WsNIeN? eS MIS i ssanatyne vane ronan, contort ‘segeneta, revenue eveans 7 Crate tense eh gr CIEDOS BE i {dng erent Pie a Fh om vo aati pectin 2 1 era mon OBIE Pn eNO an osnees (arate, aie, davon, omit)” Resave Sanh antntiely maamake eee me ec Sok nce Epes NTA HD ELSENAN 7 PRGIECT MANAGEMENT ORECTNES Cesuype, att pp doveiorinn ee ake TASS i umecrateay «S28 i for rained ores wan OR Bere RIAL, MANUSET: Batorace fake 3s CHD ene npr og cates Saweseals wn potins sth RAEFORTISS ar cera erty devi for Pane vers Catena me ores {"
    },
    {
        "image": "lessons2_synth_19_aug1.png",
        "label": "lessons",
        "ocr_text": "DE LA SALLE UNIVERSITY Manila, Metro Mania College of Liberal Arts Education Program DEMONSTRATION LESSON PLAN beats Thomas Ibarra Tee Gr Tania Scence High Schoo Grade 1 Type of Standard ciassroom, 40 students, Cooperetng C0OPEaing Teach: Cheeta Cinsroom: ctr dcosin tet woe ined Teacher ‘errngto Sr Tons Af 804 Foro Lterare Phapane History Sin atts stadent wth nearng mpaiments apn opie: Neat tt unovege tent prevent ton on eating Needs: Lesson Title: Nol Me Tangere: Cotonial Context and Type of ‘Demonstration Teaching with interactive Literary Senitcance Discussion and Analysis INSTRUCTIONAL PLAN Estimated Time frame of Lesson 20 1. Big Idea/ How does literature reflect and shape national consciot Essential usness? This lesson examines José | Seals Noll Me Tangereas both aiterary masterpiece anda celatats Philippine revolution, Questions): suidenis wil understera a \"Tul vehicle for social change and national COMPREHENSION OBJECTIVES: Ex {ePresenting social classes and institutions Interpret Rizal s critique of colonial society through textual evidence Compare colonial era injustices with contemporary social"
    },
    {
        "image": "lessons2_synth_19_aug2.png",
        "label": "lessons",
        "ocr_text": "DE LA SALLE UNIVERSITY Manila, Metro Manila College of Liberal Arts Education Program DEMONSTRATION LESSON PLAN [liad Thomas Ibarra Schea, Grade ania Scenes High Stel Grae 1 Type of Standard classroom, 40 stucents, kell ‘Cooperating Teacher: Christopher (Classroom: lecture discussion format wih multimedia be Harrington support Content Area and Fapino Lterture Phippine History “Are Students \"| ssasent with hessng mpaiment 230 pie: with Sj language interpreter present, front row seating Needs: Tesson Tile: Nou we Tangere: Colonial Context and Type of Demonstration Teaching wit Interactive Literary Signifeance Lewoon Discussion and Analysis INSTRUCTIONAL PLAN Estimated Time frame of Lesson 1. Big Idea’ How does literature reflect and shape national consciousness? This lesson examines José wd Rizal s Noli Me Tangere as both a literary masterpiece and a catalyst for Philippine revolution, Question s}: students wil understand that Iiterature can be a powerful vehicle for social change and national identity formation. Essential questions: How did Rizal use fiction to expose colonial injustices? ‘Why was this novel considered dangerous by Spanish authorities? What relevance does it have to contemporary Philippine society? TL Objective s): COGNITIVE OBJECTIVES: Analyze the historical context of Spanish colonization during Rizal s time Identify major themes, characters, and literary devices in Noli Me Tangere Evaluate the novel s impact on Philippine nationalist movement COMPREHENSION OBJECTIVES: Explain the symbolism of key characters representing social classes and institutions Interpret Rizal s critique of colonial society through textual evidence Compare colonial era injustices with contemporary social issues APPLICATION OBJECTIVES: Apply literary analysis techniques to examine ‘excerpts from the novel Connect historical events to specific scenes and character motivations Relate the novel s themes to current Philippine socio paltical situations ANALYSIS OBJECTIVES: Examine the relationship between literature and social reform Deconstruct the novel s structure and narrative techniques Investigate why Spanish authorities banned the book SYNTHESIS OBJECTIVES: Create visual representations of the novel s major themes Develop arguments about the novel s continuing relevance Formulate personal responses to Rizal s vision for Filipino identity EVALUATION OBJECTIVES: Assess the effectiveness of literature as a tool for social commentary Judge the historical accuracy of Rizal s portrayal of colonial society Critique modem interpretations and adaptations of the novel"
    },
    {
        "image": "lessons2_synth_19_aug3.png",
        "label": "lessons",
        "ocr_text": "DE LA SALLE UNIVERSITY Manila, Metro Manila College of Liberal Arts Education Program DEMONSTRATION LESSON PLAN [Pre Service Livers Thomas barra Sei Grade wana Scaos Hi ene Grae 1 ‘Type at standard classroom, 4 students, Lartand caspatna ester: Crete Classroom: etre discussion format with matimedia S Harrngton support Content Areaand Tre Students po Laerature Phppne Histon) 7 sudent wan neatng impalment- 807 Topic: with Speci language interpreter present, front row seating Needs! Tason Tike; wonite Tange: Coit Contest and TYPO Demonstration Teaching wi Ineractve Literary Significance Lesson Discussion and Analysis: INSTRUCTIONAL PLAN Est rature reflect and shape national consciousnes ‘oth a literary masterpiece and a catalyst fo ‘can be a powerful vehicle for social How did Rizal use fiction to expose by Spanish authorities? What rel .s8? This lesson examines José Philippine revolution. change and national colonial injustices? levance does ithave How does liter Essential Rizal s Noli Me Tangere as b Question s): students will understand that literature ‘dentity formation. Essential questions: ‘Why was this novel considered dangerous. to contemporary Philippine society? istorical context of Spanish colonization haracters, and literary devices in Noli Me nationalist movement bolism of key characters COGNITIVE OBJECTIVES: Analyze the hi during Rizal s time Identify major themes, ‘Tangere Evaluate the novel s impact on Philippine COMPREHENSION OBJECTIVES: Explain the sym representing social classes and institutions «Interpret Rizal s critique of colonial society through textual evidence Compare colonial era injustices ‘with contemporary social issues APPLICATION OBJECTIVES: Apply literary analysis techniques to examine excerpts from the novel Connect historical events to specific scenes and character ‘motivations Relate the novel s themes to current Philippine ‘socio political situations ‘ANALYSIS OBJECTIVES: Examine the relationship between literature and social reform Deconstruct the novel s structure and narrative techniques Investigate why Spanish “athoties banned the book SYNTHESIS OBJECTIVES: Create visual representations of the novel s major themes Develop arguments about the novel s continuing relevance Formulate personal responses to Rizal s vision for Flipno ident ity EVALUATION OBJECTIVES: Assess the effectiveness of Iterature a5 ‘ool for social commentary “judge the historical accuracy of Rizal s portrayal of colonial society Critique modem interpretations and adaptations of the novel TL Objectives"
    },
    {
        "image": "lessons2_synth_19_aug4.png",
        "label": "lessons",
        "ocr_text": "DE LA SALLE UNIVERSITY saan, tao MONS ate Eduration Program Colles of Ubeeat i Yangere Evatuate the novels COMPREHENSION OB ECTIVES: *"
    },
    {
        "image": "lessons2_synth_19_aug5.png",
        "label": "lessons",
        "ocr_text": "OE LA SALLE UNIVERSiTY Monte, Mato Manite"
    },
    {
        "image": "lessons2_synth_20_aug1.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES Diliman, Quezon City School of Education and Human Development INQUIRY BASED LESSON PLAN PreService ree Carly Pena School, Grade Universty of he Phippines integrated ‘Type of Laboratory and fet based learning, 30 fol ‘School Grade 8 Cooperating Teacher Classroom: students, hands on investigation format ‘Cooperating ee Teacher cone Content Area and Bisigy Ecology Chemistry ‘Are Students jo students with special needs, but mobilty Tople: [werner snes wlth special coneraor rhe work neue Loe ‘Water Quaity and Ecosystem Health in Bi Inqury Based Learning with Scienttic Phippine Rivers Lesson Investigation and Data Analysis INSTRUCTIONAL PLAN Estimated Time frame of Lewson |. Big Ideas How do human activities impact aquatic ecosystems? This lesson uses the scientific inquiry Quentin), Y922ss 0 investigate water quay in local Phitippine rivers, Students wil understand that ecosystem health is measurable through chemical and biological indicators, and that human actions have direct consequences on environmental quality. Essential questions: What makes water safe for living organisms? How can we measure ecosystem health? What s our role in protecting water resources? M1. Objective s): |NQUIRY SKILLS: Formulate testable questions about water quality and ecosystem health Design controlled experiments to test hypotheses about pollution effects Collect and organize quantitative and qualitative environmental data Analyze data pattems to draw evidence based conclusions SCIENTIFIC KNOWLEDGE: Identify chemical indicators of water quality (pH, dissolved oxygen, nitrates, phosphates) Explain the nitrogen and phosphorus cycles in aquatic ecosystems Describe bioindicator organisms and their role in ecosystem assessment Understand eutrophication process and its environmental impacts LABORATORY SKILLS: Use water testing equipment and chemical reagents safely and accurately Perform microscopic examination of water samples for microorganisms Record observations systematically using scientific notation Calculate concentrations and compare values to water quality standards ENVIRONMENTAL LITERACY: Recognize sources of water pollution in Philippine communities Evaluate the relationship between land use and water quality Propose evidence based solutions for water resource management Appreciate the cultural and ‘economic importance of clean water COLLABORATION AND COMMUNICATION: Work effectively in research teams with assigned roles Present scientific findings using appropriate graphs and tables Defend conclusions using evidence from experimental data Engage in peer review process to improve scientific work"
    },
    {
        "image": "lessons2_synth_20_aug2.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES Sehoat crams oc raee AMAT acer. caw nT Piilocinas intsorat le Reborn ang ‘poner aeing Teacher je stators hans Peibeses tearing, 30 ‘On iveatiaton Format | Pheri Piers co Big hier SW 60 han rye mein Rese ota of on | crocoee aina® achites act eqcate eccoysmmne? Three kes te scent Process io investata wos SiaHY ip local Philippine cisars. Saxdenis wnt yn saasuNanlG throua 2 an Disiogical inet, fic inauiry ersten that f eonsystern health ig actions ha Hers, and taihuman sag, seuences on anvtonmental qioity Exc suestons Wratmekee | ale sate for iving organiame’? tase can aes ecosysiznn heetty? Wtiatis ur i broteciing water reso, ras? j _ i INCHIRY SkHLS Formulate x bout water quali to test hynctheses about ize quansitas ont qualitctive envinor Serer evidence based constus Pesittn Design contreiest experiments puilution effects Bi dal Analyze Colisct Sate patterns ty IG KNOWLEDGE: iseaitty chemiea} tk qpality tpt diss SAYGEA, tttatos, phosphates} Explain | rivogen ard phosoraus cyciee Seal ecoeyston Describe iin atx expe dumg i ie it Scosyetem assesment Undorstant eueophleation process ands { Sevbonmental impacts LABORATOR) SKALS. Use water testing equipment and i chemical reagents safely atid accurately Pertorm miccoscenie examination of water i S8mples for microorganisms Re ‘coord cbservations Aviation Cateuiate j oncerivations end compains values to weter Ruslity etandanis H ENVIRONMENTAL UTERACY: Recognize Sources Of waier Pollution iss Philipines | COMmunities Evaluate the ‘lationsiiip between lard Use and weer lity Propose i @iiderce based sctutions for sator maven Pranage lean water COLLABORA TIO} teaivs with assigned ayes & andl tables | economic imports ohective iste the cutteral and HAND COMMUNICATION: Woe 1 Present scientific findings using i ond canchusions using 82 frees expadmentat avidin:"
    },
    {
        "image": "lessons2_synth_20_aug3.png",
        "label": "lessons",
        "ocr_text": "[Reser [cary Pena UNIVERSITY OF THE PHILIPPINES Diliman, Quezon City ‘School cf Education and Human Development INQUIRY BASED LESSON PLAN | Uniernty of tie PMppmes integrated |Otir Liowary one fe busca earner 30 ‘School Grade 9 Conpariting Teacher nm wr hands on wen ipaten tert Wig tear Event easton campasaar t co [isco neural wlth Spectas Conmiseranons for fk wore noha +s [eonreetteowene owe i ovestgator ané Date Arya Pritgpine Ravers, f INSTRUCTION SL PLAN Batinuaind Time Fromme of Lemon 6c nusran acevises urpact aquatc ecosyatams? Tis taston uses Bie scioniiic inquiry ‘0 investigate water quai tn local Phipoine rvars. Students wii understand mst ecovsystera healt 1s mensucabie hecugh chemical ain biological Inaycatory, and that human acbons have disct consequences on enaronmental quatty Essontal quesions: What wakes welar safe for tving organisms? How con we maasuce acosystem Nwaity? What is Out foe i roecing wate resources? je Objectives: KGLURY SKILLS: Formulate stale questions about water qunity and ecosystem eat Design controied experiments to text hypotheses about petltien effects Collect ard organize quantitative and qualitative environmental data Analyzo data patterns to draw evidence haved conchisions SCIENTIFIC KNOWLEDGE: identify chemical incicanors of mater quatty (pi, dtascived oxygen, rirstes, phosphates) Expiain tho sltroger and ghasphors cycles in emuntlc acosystems Usecaibe biindicator organises a ther oie in ecosystem ennessrmart» Undretand eutrophication proross an le wovironmentat impacts LABORATORY SKILLS: Use water testing eulpmont and chemical rangents safely and accurately Pedorn microscopic examination of water Samples for microonzarieme Racond cbsorvations sysiemetically using actentiic notation Calculate concentrations ant compare values to water quahty staredan s ENVIRONMENTAL LITERACY: Recognize sources of wetler pollution in Philippine communties Evaluate the rolations ip between lund use and water quality Propowe evidence based solutions fer water resource management Appreciate the cultura! and economic importance of clean water COLLABORATION ANE COMRIUNICATION: Wock ectively in research teams with sesigned oles Present scientific Gndings using |Settrare mann Detend conciusions using evidence from exoetimental _[ deta Engage in per roview process to improve sclertiic weak |"
    },
    {
        "image": "lessons2_synth_20_aug4.png",
        "label": "lessons",
        "ocr_text": "UNWERSITY oF THE PHIUPPINES Otienan, Quezon city Schoot of Educator ord Honan £¢ INQURY 2AED LcSEON PLAN See ] n"
    },
    {
        "image": "lessons2_synth_20_aug5.png",
        "label": "lessons",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES Diliman, Quezon City ‘School of Education and Human Development INQUIRY BASED LESSON PLAN re [canon ‘Scheel, Grade Unwersty of the Phigppnes integrated Tet Laboratory and fleld based learning, 30 Love and School Grade 9 Cooperating Teacher (Canerecms Students, hands on investigation format é =o aaa Bology Ecology Chemaatry [No students with special needs, but mobity a (aon [awe Lesson Tithe: ‘Type of Inquiry Based Learning with Scientific Investigation and Data Analysis 1. Big Ideas How do human activities impact aquatic ecosystems? This lesson uses the scientific inquiry esas process to investigate water quality in local Philippine rivers. Students will understand that Questions): ecosystem health is measurable trough chemical and biological indicators, and that human actions have direct consequences on environmental quality. Essential questions: What makes water safe for living organisms? How can we measure ecosystem health? What s our role in protecting water resources? MH. Objective s): INQUIRY SKILLS: Formulate testable questions about water quality and ecosystem health Design controlled experiments to test hypotheses about pollution effects Collect ‘and organize quantitative and qualitative environmental data Analyze data pattems to draw evidence based conclusions SCIENTIFIC KNOWLEDGE: Identify chemical indicators of water quality (pH, dissolved oxygen, nitrates, phosphates) Explain the nitrogen and phosphorus cycles in aquatic ecosystems Describe bioindicator organisms ‘and their role in ecosystem assessment Understand eutrophication process and its environmental impacts LABORATORY SKILLS: Use water testing equipment and chemical reagents safely and accurately Perform microscopic examination of water ‘samples for microorganisms Record observations systematically using scientific ‘notation Calculate concentrations and compare values to water quality standards ENVIRONMENTAL LITERACY: Recognize sources of water pollution in Philippine communities Evaluate the relationship between land use and water quality Propose evidence based solutions for water resource management Appreciate the cultural and ‘economic importance of clean water COLLABORATION AND COMMUNICATION: Work effectively in research teams with assigned roles Present scientific findings using appropriate graphs and tables Defend conclusions using evidence from experimental data Engage in peer review process to improve scientific work"
    }
]