[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "letter",
        "ocr_text": "ack gmail cam* 289 975 5530 DenpisGraham Scholarship Application Letter November 44, 3528 Senelarship Commities re Scholars Foundation 3906 Crawior iG Way Semangs burgh, FM Dear Ricky Pratt init my application for the Future Scholars iam honored to su As as but also contribute have consistently strived to not only excei academically cholarship will play Trade wi dedicated to a pivotal role in heiping me pursue my goa! of becoming an nable technology solutions. munity Center. I ve have dedicated countless hours to volunteering at the, EM (Science, Technolo: mentoring younger students in S ng my fove for learning end help been involved g. and Mathematics} initiative’ others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "letter",
        "ocr_text": "989 975 5530 iii Egibeck gmail com™ Dennisii2g Graham Scholarship Application Letter November 14, 2023 Scholarship Committee Future Scholars Foundation 906 Crawford Wa’ vay Seranoburgh. F Dear Ricky Pratt ‘or the Future Scholars Oumar mn. COOpEr Scholarship. only excel academically o submit my application f 1am honored t istently strived to not As a senior at ae Riorewnaven have consi GU 81924 but also contribute to the betterment of my community. believe this scholarship will play ursue my goal of becoming an Tageach dedicated to officer otal role in helping me pi a piv ions. sustainable technology soluti ‘0 volunteering at theyate See” Community Center. I ve students in STEM (Science, Technology, y love for learning and helping sustainable have dedicated countless hours t been involved in mentoring younger ineering, and Mathematics) initiatives, sharing technology in shaping 4 Eng' portance others understand the im of science and future."
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "letter",
        "ocr_text": "2ibeck gmail com 289 975 8530 Denpiscraham Scholarship Application Letter Scholarship Committee Future Scholars Foundation 906 Crawiord Way Serranopurgh, FM 77702 Dear Ricky Pratt fam honored to subrnit my application for the Future Scholars Schol As a senior at 723) i have consistently strived to net onty excel academically c but aiso Contribute to the better rolarship will play 3 pivotal role in helping me pursue my goat of becomiag an Wrage t “olficer Gedicated to sustainable technology solutions i have dedicated countiess hours to volunteering at th v Comrounity Center. EM {Se ve been involved in mentoring younger students in y ie Technology, Engineering, anc Mathematics) initiatives, sharing my love for learning and heiping others understand the importance of science and technology in shaping 4 sustainable future."
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "letter",
        "ocr_text": "ii 284 eck @gmail com 289 975 5530 Denpis Graham Scholarship Application Letter November 14, 2023 Scholarship Committee Future Scholars Foundation 906 Crawford Wa Nay Serranoburgh, F 7710 Dear Ricky Pratt c lam honored to submit my application for the Future Scholars Durham, Cooper Scholarship. As a senior at Tiow Anarene, have consistently strived to not only excel academically U 819: but also contribute 10 the betterment of my community. believe this scholarship will play coming an Trade search dedicated to a pivotal role in helping me pursue my goal of be sustainable technology solutions. have dedicated countless hours to volunteering at the yeig tity Community Center. I ve been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing my love for learning and helping others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "letter",
        "ocr_text": "FR Loco cipeggbecke arnail com” 200572258 an Dennis Granam Scholarship Ap plication Letter November 44, 2023 Scholarship Committee Future Scholars Foundation 906 Crawford Way Serranoburgh, F 7710 Dear Ricky Pratt e Future Scholars Durham Cooper Scholarship. ‘Academy t only excel academically cholarship will play dicated to y application for th have consisten y community- \\b tly strived to no elieve this S' ing an TeeareR” de officer am honored to submit m 4 John Traffioway \\drewhaven, As a senior at Faye GU 81924 ‘o the betterment of m but also contribute t me pursue MY goal of becom a pivotal role in helping sustainable technology solutions. teering at theyaasee® Community Center. I ve WAONS6 nology, ntless hours to volun’ in STEM (Science, Tec! have dedicated cou! been involved in mentoring younger students Engineering, and Mathematics) initiatives, sharing My love for learning and helping of science and technology in shaping 4 sustainable others understand the importance future."
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "letter",
        "ocr_text": "COt9S gmail, cony- (59 7 806 7664 and Heats eel, Scholarship Application Letter June OS, 2025 Schol ship Commitioe Future Scholars Foundation 349 Tanya Gateway: Rogerview, GU T6Q64 5964 Jonathan Ramires iam honore HOM for the Fey Asa senior al i have consist, He bettern vt but also contri acaden ent of my m helping me urs UE INY Goal of becoming AN Ree tecanoiogy solutions, ically Ship wifi DMUAtYy. bedi 4 Dlvotal role this sche dicated to tes been Inve E ring ing Younger gtue Community Center five Mentor ents in s EM (Science, Peering ang Mather Technolog, 'earning and helping ‘88 aNd technols You shank ing my fove others uncie importance Of scian, fe éture, 12 Sustainable"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "letter",
        "ocr_text": "uss ~~ e220’ t95 gmail com (691 606 7664 Mcintosh, Powell Scholarship Application Letter and Hamilton School June 05, 2025 Scholarship Committee Future Scholars Foundation 349 Tanya Gateway Rogerview, 16961 bear Jonathan Ramirez ‘or the Future Scholars Jajvis Group Scholarship. Academy am honored to submit my application f t only excel academically As a senior at opts own have consistently strived to no steventown, MI 70596 but also contribute to the betterment of my community. believe this scholarship will play verscenvst dedicated to a pivotal role in helping me pursue my goal of becoming an ®**% sustainable technology solutions. edicated countless hours to volunteering at the’ eer Community Center. I ve 78 students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing my love for learning and helping have di been involved in mentoring younger others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "letter",
        "ocr_text": "SUS Sott95 gmail cor 691 606 7664 Mcintosh, Powell Scholarship Appiication Letter and Hamilton School June 05, 2025 Scholarship Committee Future Scholars Foundation 349 Tanya Gateway REE Beat cu 16961 Dea Jonathan Ramirez {am honored to submit my application for the Future Scholars Cia Schoiarship. As a senior at oe ene oa. have consistently strived to not only excel academically but aiso contribute to the betterment of my community. betieve this scholarship will play a pivotal role in helping me pursue my goai of becoming an cep dedicated to sustainable technology solutions. $78 Wi have dedicated countless hours to volunteering at the’, == Community Center. I ve “Ooisin been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics} initiatives, sharing my love for learning and heiping others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "letter",
        "ocr_text": "(691 606 7664 WBE Ott95 gmail com® 0M cnt Pel Scholarship Application Letter June 05, 2025 Scholarship Committee Future Scholars Foundation 349 Tanya Gateway Rogerview, G' 16961 bear Jonathan Ramirez n for the Future Scholars Jamis Group Scholarship. ‘Academy am honored to submit my applicatio' d to not only excel academically As a senior at sgise sonan have consistently strive ‘Steventown, MI 70536 f my community. believe this scholarship will play but also contribute to the betterment 0 a pivotal role in helping me pursue my goal of becoming an Research acentst dedicated to sciences) sustainable technology solutions. ‘ours to volunteering at thel26\"\" Community Center. I ve mages have dedicated countless h in STEM (Science, Technology, involved in mentoring younger students d Mathematics) initiatives, sharing my love f d technology in shaping a sustainable been Engineering, an erstand the importance of science an ‘or learning and helping others und future."
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "letter",
        "ocr_text": "You Loco SBME tt95 @gmail. com (691 606 7664 Mcintosh, Powell Scholarship Application Letter and Hamilton School June 05, 2025 Scholarship Committee Future Scholars Foundation 349 Tanya Gateway Rogerview, GU 16961 Dear Jonathan Ramirez lam honored to submit my application for the Future Scholars Jarvis Group Scholarship. As a senior at i gd0aati#\" have consistently strived to not only excel academically ‘Steventown, MI 70536 but also contribute to the betterment of my community. believe this scholarship will play 1 Researcnscentst dedicated to sciences) a pivotal role in helping me pursue my goal of becoming a sustainable technology solutions. have dedicated countless hours to volunteering at the 3 2s,\" Community Center. I ve ‘GU 25491 been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing my love for learning and helping others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "letter",
        "ocr_text": "oe plication Letter Baker- Douglas Scholarship Ap Academy May 08, 2024 Scholarship Committee Future Scholars Foundation PSC 7781, Bog aBp Are pear Richard Thomas tion for ine Future Se holarsay Saroree yolarship. 108 ademically tam honored fo s nol ordy excel ac »Milg, i have consis ently strived tf of my comm rity. belleve laf becoming ao scholarship will play senior 2 at put also contribute the betterme tai rote in heiping Me pursue my goa dedicated 16 sustainable technology soiutions. ynunity Center. i ve Technolo and helping s hours to volunteering at students in my love for jearning have dedicated coun! 4 young! STEM (Scien peen involved in mentor dq Mathematics) initiatives, shading of science and qechnciogy a sustainable Engineering, an others understand The importance in si future."
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "letter",
        "ocr_text": "R 0 0437 “gjerqidithomas gmail con 7 4597 Gret paker Douglas Scholarship Ap Academy plication Letter May 08, 2024 Scholarship Committee Future Scholars Foundation PSC 7781 Box BLA bear Richard Thomas r the Future scholarSalhquy StpvenscholarshiP- As a senior at 1A RSRGN PW have consistently strived to not only excel academically but also contribute to the betterment of my community. believe this scholarship will play a pivotal role in helping me pursue my goal of becoming an \"nae dedicated to sustainable technology solutions. am honored to submit my application fo to volunteering at thesargrg aen. Community Center. I ve ee students in STEM (Science, Technology, earning and helping have dedicated countless hours involved in mentoring younger tics) initiatives, sharing my love for f science and technology in shaping a sustainable been Engineering, and Mathem others understand the importance 0 future."
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "letter",
        "ocr_text": "Baker Douglas Scholarship Application Letter Academy May 08, 2024 Scholarship Committee Future Scholars Foundation PSC i7eha BoKe Bh) Dear Richard Thomas: tion for the Future Scholaralhquy StevenScholarship. 1am honored to submit my applica ly excel academically Jacob Mil, have consistently strived to not on! As a senior at flat Sign but also contribute to ‘the betterment of my community. believe this scholarship will play dedicated to a pivotal role in helping me pursue my oal of becoming an Television pana sustainable technology solutions. Community Center. I ve dicated countless hours to volunteering at the::. have de in STEM (Science, Technology, involved in mentoring younger students been Engineering, and Mathematics) initiatives, sharing my love for learning and helping others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "letter",
        "ocr_text": "BekerDouglas Scholarship Application Letter AcaGemy May 08, 2024 arship Committee Future Scholars Foun: PSC 7781 Box 3 467 ABO Dear Richard Thomas ! am honored to submit my Teen for the Future ScnolarSalhg tevenScholarship. D0! rily strived to not excel academically of my community. believe this scholarship will play a pivotal role in helping me pursue my geal of beco dedicated to sustainable technology salutions. seas Community C ed countless hours to volur i have dedi been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing my love for learning and helping ce Of SC and technology in st g a susteinahi others understand the import futu"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "letter",
        "ocr_text": "UR 0 19 onttaWidthomas gmait cone7 45910437 Baker Douglas Scholarship Application Letter Academy May 08, 2024 Scholarship Committee Future Scholars Foundation PSC 7781 BoKe eT O Dear Richard Thomas | am honored to submit my application for the Future ScholarSalhquy StevenScholarship. As a senior at nfcclasiargh Biv have consistently strived to not only excel academically but also contribute to the betterment of my community. believe this scholarship will play a pivotal role in helping me pursue my goal of becoming an Fase. dedicated to sustainable technology solutions. have dedicated countless hours to volunteering at thezzsyrsgec Community Center. I ve been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing my love for learning and helping others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "letter",
        "ocr_text": "@gmait sor ROO4626625 49260 innol wgagidymantin@ Letier til Lewls scholarship Application December 36, 20283 Scholarship committee Future Scholars Foundation apo WES Cuistfasti we, MS 66237 i bear Steven Freeman Te LLC Scholarship. 4 academically e Future Scholars Mein strived to net only ex cholarshio will play ty application for th i arn honored to $4 As a senior 4 3 j have consistently 3) of my com aunity. believe tnis 3! D6 put also contribute ro the pettermernt O in helping me pursue MM dedicated to a pivotal role e technology solutions. ainabie Sus Genter. Nye eering at ine j have dedicated countless Nours to voll in mentoring your er students st HNciogy, love for learn ives, sharing MY yin shaping 2 sust g and pelping ainabie been involved and Mather 2 importance of Engineering sience and techno: others unders' stand th Future."
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "letter",
        "ocr_text": "ackews Scholarship Application Letter December 30, Scholarshio Committee Future Sch p2Q72 Miller Tivide West Chrstnashire, MS 66237 Dear Dear Steven Freeman pplication for the Future Scholars volarship, have consistent! strived to not only excel academically but also cor ibute to the be erment of my nmunity. believe this scholarship will piay 8 pivotal role in hi ng me pursue my goal of becoming an jeache, dedicated to primary echeol inable technology solutions, i have dedicated countle hour. volunteering at the , Community Center. t ve er students in STEM (Science, Technology, Seen involved in mentoring your note: Engineering, and Mathematics) initiatives aring my love for learning a ad helping hers understand the importance of science id technology ing a sustainable future."
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "letter",
        "ocr_text": "“caSsidymartin gmail corn6o4625685 y uiwcewis Scholarship Application Letter Academy December 30, 2023 Scholarship Committee 5 Foundanen Future SCne 52072 f inde WN o wisurashire, MS 66237 bear Steven Freeman eship cation for the Future Se tam hanored tO subm siently strived to not only excel academe ally {have const yotarshig wilt play As a ser smmunity. be f nut aise comibute to the be nent of dedicated to pursue my goa in helping me P 3 pivotal role 2 tecnnalogy solutions. sustaifta ve sated countiess hours [0 yunteering at the Come Cc 2 dadic STEM {Science, Techno tna. yager students g and he PING peen involved in sharing may 1Ove for iearnin En others ur yaerst gtics) nitiathves. a sustainable ing, and Matine a me portance of science a future."
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "letter",
        "ocr_text": "‘cassidy martin gmail seormes4e26695 A. HilLLewis Scholarship Application Letter ray December 30, 23 Scholarship Committee Fut Binge W Mi ier Scholars F Divide Wes nsunasnire, MS 66257 Sear Steven Freeman lam honcred to submit my application for the Future Scholars Meintyre LLC Scholarship. School not ony excel academically AS a senior at i have consistently strived to but also contribute we ins wette ant of my comrnunity. believe this scholarshio wil play pivetar role in ping me pursue my goal of becoming an dedicated to sustainable technology solutions. i have dedicated countless nours to volunteering at ihe 2 ,. Community Center. I ve been involved in mentor dents in ST ng younger s' 4 iScience, Technology, Engineering, and Mathematics) initiatives, sharing my love for ring and helping others understand the importance of science and technology in shaping sustainable future."
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "letter",
        "ocr_text": "YOUR Loco ‘\"@g sidymartin @gmailweork664626695 Hil Lewis Scholarship Application Letter Academy December 30, 2023 Scholarship Committee Future Scholars Foundation di ee ie nashire, Dear StevenFreeman am honored to submit my application for the Future Scholars “Ore Scholarship. As a senior at 33 S have consistently strived to not only excel academically Michael, ND 66524 but also contribute to the betterment of my community. believe this scholarship will play a pivotal role in helping me pursue my goal of becoming an Teacher, dedicated to primary school sustainable technology solutions. have dedicated countless hours to volunteering at the Zwei Community Center. I ve been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing my love for learning and helping others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "letter",
        "ocr_text": "962379650 fake and, Scholarship Application Letter May 21, 2024 Scholarship Committee Future Scholars Foundation 73398 Sai Ga ape Lake Christopher, VA 71542 Matthew Willis lam honored to submit my application for the Future ScholarSnieigs. AtkinsotScholarship, O01 80% have consistently strived to not only exc 4 he betterment of my community. believe this scholarship will play As senior at al academically but alse contri t an Clinical dedicated to cytogeneticist a pivetal role in helping me pursue my goal of becoming sustainable technology solutions. 2 Community Center. live i nave dedicated countless hours to volunteering at the, dents in STEM (Science, Technology, been in in mentoring you acing my fove for learning and helping cs) initiatives, shi Engineering, and Matnema ience and technology in shaping a sustainable others understand the importance future."
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "letter",
        "ocr_text": "“ane ylopez gmaihwom2062379650 darker and) Scholarship Application Letter May 21, 2024 Scholarship Committee Future Scholars Foundation tla Apt O93 Lake Christopher, WA71 540 Dear Matthew Willis - {am honored to submit my application for the Future ScholarShielgs Atkinsorscholarship As a senior at but also contribute to the betterment of my community. believe this scholarship will play a pivotal role in helping me pursue my goai of becoming an Msetcit dedicated to x have consistently strived to not only excel academically Baie sustainable technology solutions. have dedicated countless hours to volunteering at theyre ise Community Center. I ve been involved in mentoring younger students in noes ‘Science, Technology, Engineering, and Mathematics} initiatives, sharing my love for tearning and helping others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "letter",
        "ocr_text": "Tae Hane ylopez gmaikcom2062379650 fearker and Scholarship Application Letter May 21, 2024 Scholar. Committees Future Scholars Foundation 73298 Satin: Lake Christopher, WA 71542 Dear Matthew Willis am honored te ¢. mit my application for thy Future ScholarShisigs oo AS a senior at SAtkinsoScholarshin. chool 1\" AP have Consistently strived to Not oniy e: cademicaty but alse contribute to the bettermant o! f my community. be: lieve this scholar: pivotal roie in he iping me pu: Ship will play oa of becom 9 an Ciinicat dedicated to - cytogendticist Sustainable technology Solutions, have dedicated countless hours to volunteering at thet been involved in mer eee Community Center, ve ntoring younger st. fi students in STEN (S Eng ce, hnslogy, and Mathematics) atives, sharing my jove for jear others understand the importance of Scie) ning and helping future. NCS and techno; gy in shaping a Sustainable"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "letter",
        "ocr_text": "Tirnssthey Fe “Hane ylopez gmait ewn2062 2379650 fcarker and, Scholarship Application Letter May 21, 2024 Scholarship Compr we ne Lake Chek toph 38, WA 71542 Dear Matthew Willis bam honored te sale my application for the Future Sch. ‘lar Shields. AikinsomScholarship, Scho ved to not only excel academically AS a senicr at ve Consistently but also contribute to the betters F my community, i believe this scholarship will play pivotal role in help? me pursue my goal of becoming an. Clinical Sedicated to cylogenaticist sustainable technology so have dedicated countless hours to volunteering at the Community Center. I ve been involved in mentoring younger students in STEM (Sclence, Technology, 8) initiatives, sharing my jove for learning and helping others understand t ustainable importance of science and technology in shaping a future."
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "letter",
        "ocr_text": "R Loco 688 Timothy Terrace “hancylopez gmaitcom20623 79650 i seaker and Scholarship Application Letter May 21, 2024 Scholarship Committee Future Scholars Foundation Vicia aselbps Lake Christopher, WA 71542 Dear Matthew Willis ji PSC 5170. Box AS a senior at 126 AP but also contribute to the bett y goal of becoming an Flinical. dedicated to . cytogeneticist sustainable technology solutions. I have dedicated countless hours to volunte ering at the’! yoo been involved Ree ‘iq’ COMmunity Center. I ve in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing my love for learning and helping others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "letter",
        "ocr_text": "Navarro, Romero ani Vasquez Acadeny Scholarship Application Letter August 03, 2025 Scholership Committee Future Seholars Foundation 6350 Nicholas Underpass Bihe 572 New Natasha, NY 10445 Vanessa Effictt ! am honored to submit my application for the Future Scholars AS senior at ou i have consistently strived 7 Lop 30 424: but aiso contribute to ihe betterment o: academically f my community, believe this a me pursue my G Sustginable fechngiogy sol scholarship wilt play pivotal ro in helpin Cal of bi mn futions. iealed countless hour {0 Volunteering at the t. Coramunity Centar. ve Students in STEM (Scie ce, Technolog involved in mentoring younger Engineering, and Matherneti: 3} initiativ sharing my love for learning and help ‘er Understand the importance of se and technology in sha DING 4 sustainable future."
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "letter",
        "ocr_text": "y Lo ~“¥éHsenruth gmail com2264058026 Navarro, Romero Vasquez Acadonan Scholarship Application Letter August 03, 2025 Scholarship Committee Future Scholars Foundation 6350 Nichola Underpase Sif 2 New Natasha, NY 10445 Dear Vanessa Elliott Pursue my goal of becoming prods apist og dedicated to lopment Sustainable technology solutions. velop: have dedicated countless ho) Urs to volunteeri been involved Ng at the “Biche Community Center. I ve ait in mentoring younger students in STEM (Science, Technology, Engineering, and"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "letter",
        "ocr_text": "3 causkl SWyliams Senruth gmailcor 2264058026 Navarro, Romero asquez Acadenan’ Scholarship Application Letter August 03, 2025 Scholarship Committee Future Scholars Foundation 6350 Nichol, Underpvict Silke New Natasha, NY 10445 Dear Vanessa Elliott or the Future Scholars silva, Phillips and Scholarship. Delgado College AS a senior at sute a prts Staton have Consistently strived to not c 42451 only exce| academically oO but also Contribute to the betterment of pivotal role in helping me Pursue Sustainable technology solutions. my community. believe this Scholarship will play My goal of becoming AN proscar og dedicated to development have dedicated countless hours to volunteering at the oats Community Center. I ve TBE been involved in Mentoring younger stud ents in STEM (Science, Technology, Engineering, and"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "letter",
        "ocr_text": "264058026 -ijgRisenruth gmall cor? Bin. Navarro, Romero ae Scholarship Appli Vasquez Acade cation Letter August 03, 2025 Scholarship Committee Future an Foundation foe Niche inderpacs eStic 572 New News ha, NY 10445 ear Vanessa Elliott e and Scholarship. C ‘Sitve, Phil Scholars Se Eo tam honored to submit my application for the Future As a senior at ous mitt siaice, have consistently strived to not only excel academically betterment of my community. believe this scholarship will play dedicated to but also contribute to the coming an voatecees idle me pursue my goai of be a pivotal role in helping olutions. sustainable technology S$ olunteering at the SEEMS. Community Center. ve at in STEM (Science, Technology, e for jearning and helping able ated countless hours to Vv been involved in mentoring younger students initiatives, sharing my jovi and Mathematics) nce of science and technoleg' i have dedic Engi ineering, y in shaping sustain: others understand the importa’ future."
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "letter",
        "ocr_text": "Your Loco om jenisenruth gmail corm2264058026 Aa N : Tesques Ketone? Scholarship Application Letter August 03, 2025 Scholarship Committee Future Scholars Foundation P3po Nichglas Underpass Suite 572 New Natasha, NY 10445 Dear Vanessa Elliott | am honored to submit my application for the Future Scholars Siva, Ehilips anc and Scholarship. As a senior at suteatriopermoun, have consistently strived to not only excel academically DC 42451 but also contribute to the betterment of my community. believe this scholarship will play a pivotal role in helping me pursue my goal of becoming an ,,.xi prscess Aedicated to development sustainable technology solutions. have dedicated countless hours to volunteering at the ,x a Community Center. I ve been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing my love for learning and helping others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "letter",
        "ocr_text": "ad =giaven22 gmalt. ein (833 432 2889 —_ Schroeder, Newnrmy Scholarship Ap and Dillon ‘academy plication Letter May 17, 2025 Scholarship Committee Future Scholars Foundation 65 Mcdonald opis onal Laurietown, OH 26056 Dear Sara Price schotarsrazayez WiiamescholarshiP- d to not only excel academically munity. believe this scholarship will play f becoming aPolitic anissedicated to tne tant lication for the Future ored to submit my 4PP! consistently strive 1 arn hon As a senior at eet aaa 1 have go contribute to the ing me pur but 2! betterment of my com sue my goal o' a pivotal role in help sustainable technology solutions. Coramunity Cenier. I ve vo in STEM (Science, Technology, 7 learning and helping gd sustainable hours to voiunteering 2 students sharing ™Y love fol d technology in shapin dedicated countiess in mentoring younget matics) initiatives, jence an have been involved and Math Engineering, e importance of sci others understand ata) future."
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "letter",
        "ocr_text": "05215 Yc cosas sbaven22 @gmail corn 533 432 2889 and Dilen Acadeny. Scholarship Application Letter May 17, 2025 Scholarship Committee Future Scholars Foundation 0565 Mcdonald Per ts Apt. Poa Laurietown, OH 26056 Dear Sara Price | am honored to submit my application for the Future Scholars azquez WiliamsScholarship. As a senior at Apt 25 Bat Sear have consistently strived to not only excel academically but also contribute to ‘the betterment of my community. believe this scholarship will play a pivotal role in helping me pursue my goal of becoming aPoliticjan s dedicated to sustainable technology solutions. assista have dedicated countless hours to volunteering at thelist See Community Center. I ve been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing my love for learning and helping others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "letter",
        "ocr_text": "MdvenZz2 gmail com (833 432 2889 Schroeder, NEWETY Scholarship Application Letter and Dillon Academy May 17, 2025 Scholarship Committee Future Scholars Foundation 0865 Medopald Be Ap 222 Lauriezown, OF 26056 1 Dear Sara Price iifiamsSchols te cel academ will play application for the Future Scholarsvazties it oY tam nonored to suom ty strived to not only i have consist “tipute SS the betterment of my coramunity. ratieve this me pursue MY goal of becoming aPoll assis dicated ated to put aise co a pivotal role in he sustainable technology solutions. community Center. l ve aled countiess hours xo volunteering at the kr: in STEM (Science nnology, DING have dedic ger students ing younger been i in \\ initiatives, sharing my love for jearning and he sustainadle ad Mathema rechnology 8 shaping 4 Engineering, 4 tand the impo riance of science others under future."
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "letter",
        "ocr_text": "nade HB WEN22@ gmail com (693 432 2900 Schroeder, Newman and Dion Academy SChOlarship Application Letter May 17, 2025 Scholarship Committee Future Scholars Foundation ‘Flats Motongie Laurietown, OH 26058 Dear Sara Price am honored to submit MY application for the Future Scholarsva: 2qve2 WiliamsScholarship, A 372 Che Bun - institute AS a senior at Ao 2 Fel Sse, have Consistently strived to not only excel academically Setterment of my Community, believe this 5 Y goal of becoming 4Politician sdedicated to Sustainable technology solutions, assistant have dedicated countless hours to volunteeri ING at the? ge Beem seat? been involved in ment ae\" Community Center \"ve oring younger students in STEM (Science, Engineering, and Mathematics) initiatives, Sharing my jove for learnj others understand the importance of science and technology in shapi future. Technology, NG and helping Ng a Sustainable"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "letter",
        "ocr_text": "ond DilsnAcadeny scholarship Application Letter May 17, 2025 nolarst Ser io Cornmittee Future Scholars Foundation 0565 Mcdonald Fials Apt. 222 Laurieton vt, OH Dear Sara Frice iam honored to submit my application for the Future Scholarsvaza iiamsScholarship. ie As senior at 4} i have consistently sirlved to not only excel academically but also contribute to t oetterment of my community, belleve this sche ship will olay pivotal role in helping me oursue my goal of becoming ePolit iKiojan s rele assistant rable technolog Susi i have dedicated countiess hours to volunigering 2 f° Community Center. I ve been involved in mentoring younger students in STEM (Science, Technology, Enginee and Matt: aring my love for le g and helping others understand the Importance of science and tectinology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "letter",
        "ocr_text": "PO: tigtezieremy @gmaikoen6 44 aaoo Edwards Hall instiute Scholarship Application Letter June 23, 2025 Scholarship Committes Fy ture Scholars Foundation 2036: 3Mendesz pur Sule G96 Sat Brendan, Sp 51066 Alex Sanchez ban Ronored tos Orit my ar AS tion for the Future Scholars Ket SENior at farship, i have consistently SUived to noe ist academicatty ie betterment Stholarshin wii play Land dedicated to cf my communi Eby pivotal role in Helping ma pur WE MY goal of b Susta OMING an bie tai WDlogy Solutions. have dedicated countess hours tO Volunta: 9 at the, been NVOlved io Community Wy Center Pye S208 in mentoring younger Students jn STEM iScience, Technology, Engineering, SN Mathemati Uatives, sharing my love for learning ng others understand th importance of sci ence and technole in shaping a Sustainable"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "letter",
        "ocr_text": "redrighezieremy @gnraikesrs 444 8429 ral Edwards Hall Scholarship Application Letter dune 23, 2025 Scholarship Committee Future Scholars Foundation 90359 a Mer Zz Spur Suite neg East Brendan, SD 51066 Dear Alex Sanchez the Future Scholars Kelley Holland Scholarship. Shoot fam honored to suomit my application for have consistently strived to not only excel academ ally As a ser but also contribute t the betterment of my community. believe this scholarship wil play dedicated to a pivotal role in helping me pursue My goai of becoming an L . ° and sustainable technology solutions i have dedicated countless hours te volunteering at theg: Community Center. ‘ve ing younger students in fScience, Technoloay, been involved in ment Engineering, and Mathematics) inidatives, sharing my jove for learning and helping stainable others understand the importance of science and technology in shaping a sustain future."
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "letter",
        "ocr_text": "P~ rodrigtezjeremy @gnrail c6rR 444 8429 Edwards -Hall Scholarship Application Letter June 23, 2025 Scholarship Committee Future Scholars Foundation UP Ue Ors East Brendan, sD 51066 Dear Alex Sanchez | am honored to submit my application for the Future Scholars Kelley Holland Scholarship. As a senior at 3a8 flay Res have consistently strived to not only excel academically nt of my community. believe this scholarship will play but also contribute to ‘the betterme' dedicated to a pivotal role in helping me pursue my goal of becoming an Land sustainable technology solutions. have dedicated countless hours to volunteering at thessesegf apo Community Center. I ve been involved in mentoring younger students in STEM (Science, Technology, athematics) initiatives, sharing my love for learning and helping Engineering, and M able others understand the importance of science and technology in shaping a sustain: future."
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "letter",
        "ocr_text": "rouirigirezjeremy @gnraitieon6 444 a420 ae Edwards: Hall Scholarship Application Letter June 23, 2025 Scholarship Committee Future Scholars Foundation Sur Sere East Brendan, Sb 51066 Dear Alex Sanchez am honored to Submit my application As a senior at NGRESAREY, have consistently strived t {1678 fe to the betterment of m pivotal role in helping me pursue m Sustainable technology solutions, for the Future Scholars Keltey Hotiand Scholarship, Schoo} not only excel academically '¥ Cornmunity. believe but also contribut this scholarship will play Land dedicated to Y goal! of becoming an have dedicated countiess hours to volunteering at the, #5 been involved in mentoring younger Students in STEM Mathematics} initiatives, others understand the importance of future. Community Center i ve {Science, Technology, sharing my love for learning and helping science and technology in shaping a sustainabie Engineering, ane"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "letter",
        "ocr_text": "your Loco ~~ rodrigttezjeremy @gnraihic61h 444 8429 Edwards Hall Scholarship Application Letter June 23, 2025 Scholarship Committee Future Scholars Foundation Q0368 Mendsg East Brendan, SD 51066 Dear Alex Sanchez | am honored to submit my application for the Future Scholars ome Scholarship. As a senior at vigan BSey have consistently strived to not only excel academically but also contribute to the betterment of my community. believe this scholarship will play a pivotal role in helping me pursue my goal of becoming an L d dedicated to sustainable technology solutions. an have dedicated countless hours to volunteering at these seg aro Community Center. I ve been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing my love for learning and helping others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "letter",
        "ocr_text": "beards eRe lis @gmail com13 973 1522 Ortiz, Estrad id i i i Wilson University, Scholarship Application Letter October 09, 2025 Scholarship Committee Future Scholars Foundation 91435 Clinton Hats Nor Emilyhaven, FL 89143 Dear Alexandria Bowen: am honored to submit my application for the Future Scholars vee Coleg. Scholarship. As a senior at \"23hRid, HS have consistently strived to not only excel academically 43220 but also contribute to the betterment of my community. believe this scholarship will play a pivotal role in helping me pursue my goal of becoming an dedicated to Writer sustainable technology solutions. have dedicated countless hours to volunteering at the warring, Community Center. I ve been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing my love for learning and helping others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "letter",
        "ocr_text": "S68 Pry Hubba on Fallis gmail comp F13 973 1522 Wisohinveaty, Scholarship Application Letter October 09, 2025 Commuttes ponolarshly Future Scholars Foundation ou) 38 (into 1 Emilyaaven, FL 89443 bear Alexandria Bowen i arm honored to submit my application for the Future Scholars 4 T1SA Bard P. Gerytown AS 4 senior at i have consistently strived fo not only excel acader but alse contribute to the betierment of my community. believe this sechelarshis will play pivotal role in heining me pursue my goai of bec ted to aming Weiter ded sustainable te bnoiogy solutions. i have dedicated count Rours to volunteering at the, iia, Community Center. I ve oe STEM (Scie Engineering, and Mathematics} initiatives, sharing my love for jearning and helping been involved in men toring your stu ce, Technology, others understand the importance of science and lechnology in shaping 2 sustainable future,"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "letter",
        "ocr_text": "Be RELELFB his @gmail come\"* 743 973 1522 Ortiz, Estradaand Scholarship Application Letter Wilson University October 09, 2025 Scholarship Committee Future Scholars Foundation 9 igs Rink Emilynaven, FL 89143 Dear Alexandria Bowen ion for the Future Scholars Vega, Srlanet and Scholarship. Pairick College tam honored to submit my applicat t only excel academically {4 RogPaS have consistently strived to no As a senior at /Gayise 43220 but also contribute to the betterment of my community. believe this scholarship will piay dedicated to a pivotal role in helping me pursue my goa! of becoming Writer sustainable technology solutions. Ei) Sesh. Community Center. I ve l have dedicated countless hours to volunteering at these been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiative understand the importance of science and techn s, sharing my love for learning and helping other: ology in shaping 4 sustainable future."
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "letter",
        "ocr_text": "sells @gmail com 743 973 1522 WikonUnvaane Scholarship Application Letter October 09, 2025 Scholarship Committee Future Scholars Foundation 94435 Clinton 18 Ge Emilyhaven, FL 89143 dear Alexandria Bowen: i am honored to submit my application for the Future Schoiars Vette Cohen? Scholarship. AS a senior at 7154 Red Pass Garou, ! have consistently strived to not only excel academically 43220 but also contribute to the betterment of my community. believe this scholarship will play pivotal reie in helping me pursue my goal of becoming Writer dedicated to sustainable technology solutions. i have dedicated countless hours to volunteering at the, 2ytax7, Community Center. I ve been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing my love for iearning and helping others understand the importance of science and technology in shaping 2 sustainable future."
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "letter",
        "ocr_text": "¥ Lo eee FBllis gmai l come te 4 3 973 1522 Ortiz, Estrada a Wilson Univerene Scholarship Application Letter October 09, 2025 Scholarship Committee Future Scholars Foundation 91135 Clinton 1s Ss Rant Emilyhaven, FL 89143 Dear Alexandria Bowen am honored to submit my appli Vega, Skinner and AS a senior at TESA RR Rags tick Coles Scholarship. i dedicated to ; Writer sustainable technology solutions. have dedicated countless hours to volunteering at the7 Mecan, been involved wa elton, Community Center. I ve in mentoring younger students in STEM (Science, Technology, future."
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "letter",
        "ocr_text": "ahi WenerColege Scholarship Application Letter January 24, 2025 Scholarship Committee Future Scholars Foundation 3956 Ronald Falis New Aaron, KY 30257 der Laura Velasquez 1am honored to submit my application for the Future Scholars Powers ine Scholarship. y excel academically As a senior at tsa have consistently strived to not on but also contribute to the betterment of my community. believe this scholarship will play dedicated to a pivotal roie in helping me pursue my goal of becoming an Ming sustainable technology solutions. i have dedicated countless hours to volunteering at thei: z= Community Center. I ve been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing ry love for learning and hel others understand the importance of science and technology in shaping a sustainadle future."
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "letter",
        "ocr_text": "Gdge gmail corrr 767 212 9900 da Wene cues Scholarship Application Letter January 24, 2025 Sch Committee Future Scnolars Foundation 956 Ronald Falls New Aaron, KY 30257 Der Laura Velasquez. fam honored ts submit my application for the Future Scholars Pawers inc Scholarship. Scho = 1 have consistently AS a senior at 9S ved to not only academically but also contribut to the betterment of my community. believe this scholarship will play pivotal role in heiping me pursue my goai of becoming an dedicated to sustainable technology solutions. i have dedicated countless hours to volunteering at ther Community Center. I ve been involved in mentoring younger students in STEM iScience, Technology Engineering, and Mathernati Ss} initiatives, sharing my love for learning and hei ning athers understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "letter",
        "ocr_text": "Rames, Thompson Scholarship Application Letter January 24, 2025 holarship Committee Future Scholars Foundation 39868 Ro Falls New or iY 30257 Der Laura Velasquez © contribute to dedicated to the r. i ve r stude been involved in students in STEM Technology, eng ving, and es, sharing my love for learning and he others unde clence an stand the importance technaiogy in shan ing a sustaing"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "letter",
        "ocr_text": "meeerrodge g mai Corr: (767 21 2 9900 Ramos, Th j icati and Werner college ©Cholarship Application Letter January 24, 2025 Scholarship Committee Future Scholars Foundation 956 Ronald Fale HRS, KY 30257 Dear Laura Velasquez lam honored to submit my application for the Future Scholars Pawers Inc Scholarship. As a senior at (423i Reus C9 have consistently strived to not only excel academically $2763 but also contribute to the betterment of my community. believe this scholarship will play a pivotal role in helping me pursue my goal of becoming an opting dedicated to . Officer sustainable technology solutions. have dedicated countless hours to volunteering at theza seenars Community Center. I ve been involved in mentoring younger students in STEM (Science, Technology, Engineering, and Mathematics) initiatives, sharing my love for learning and helping others understand the importance of science and technology in shaping a sustainable future."
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "letter",
        "ocr_text": "idge gmail corrr 767 212 9900 Ramos. Thompson and Werner Colege ©ChOlarship Application Letter January 24, 2025 Scholarship Committee Future Scholars Foundation sh Nee Nea oer Laura Velasquez lam honored to submit my application for the Future er Schoiars Pay rs ing Scholarship. @) 1 Lave consistently strived te not only As a senior at} academically but aiso contribute to the betterment of my community. be! holarship will play pn 5 pivotal role in helping me pursue my goal of becoming an dedicated to sustainable technology solutions. i have dedicated countless hours to volunteering e Comraunity Center. va been involved fa mentoring younger students in STEM (Science, Technelogy, Engine ering, and Mathematics) initia ring ray love for learr g my and h ping and technology in shaping a sustainable 7 others understand importance of scien: future,"
    }
]