[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "letter",
        "ocr_text": "> — Z ed Dillon Morse Institute <Ai “Mnitehe l27 @genaess1990 —_\\ la. Gabrielhaven, AK 69755 University Student Letter Nathaniel Colon 93029 June 04, 2024 Avr REE Seanview, L 44158"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "letter",
        "ocr_text": "e) Dillon Morse Institute semikehell27 @gee8531990 paver; AK University Student Letter Nathanigi Colon oe tee frat Hardyton, NC 93029 June 04, 2024 Tina Tavtor avenue 228 Bo Seanview, iL 44153 ear Ms. nis Dear Ms Ren writi ti Cox, Bradley and Cox in A fication fi {am writing to you on behaif of y iy regarding your application for admission into our esteemed institution. Firstly, we would like to express our appreciation for your interest in pursuing higher education at our university. We have thoroughly reviewed your application materiais, including your academic acnievemenits and personal statement, and we are impressed by your passion for learning and commitment to excellence."
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "letter",
        "ocr_text": "Dillon” Morse qd cianilee frell27 @gMss63 990 Gal ge Nathani il Colon Tae NC ye University student Letter June 04, 2024 Tina Tavior Peta i eo Seanview, IL 44158 Dear Ms. Reals Cox, Bradley and Cox regarding your application for you on behalf of ‘Ta tversity 1am writing to ed institution. admission into our esteem in pursuing higher plication materials, ressed your interest ur ap! nt, and we are imp iation for ughly reviewed yO ateme ke to express Our appreci niversity. We have thorou' mic achievements a! arning and commitmen Firstly, We would li education at our u including your acade by your passion for le ind personal st t to excellence."
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "letter",
        "ocr_text": "Ditlon Morse institute /3844 Anceta 3s mecheli27 @gmasss19g0 University Student Letter Nathaniel Colon O8S7 avis Trait 93028 June 04, 2024 Tina Tavior 485 Rober Aveniie Ror So Seanview, il 44458 De Penni. Dear Ms, nnis o* Peek fam writing to you on behalf of Cox, Hadley and Cox regarding your a} admission into our esteemed institution, ication for TOF i, WE would like to Express our 4ppreciation for your education at our unive tin pursuing higher ave thoroughly MNciuding your academic ac PDlcation Materials, {and we are impressed"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "letter",
        "ocr_text": "University Student Letter Nathaniel Colon 0857 Davis Trail Se Hts O74 Hardvion, No 93029 June 04, 2004 Tina Tavlor 5 Avenue ROP Bs Seanview, L4445g weer fam writing to yOu on bet COX, Bradley inte our esteemed instity SSMIP Firstly, j WGuid like to 88 OUF appr fed your aPoRcation 3 YCUr academic achieven by your Passion far j i OF i: and per. Statement, and we are impressed cell ig anc commitment"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "letter",
        "ocr_text": "Ford Medina Institute 37; Jo BSattson @g API )536 6253 MO 80965 University Student Letter Anthony Roih 0142 Nancy Rapid Charyishire, AZ 35798 September 12, Roger Rar nary 26318 Kemp Haven New Amanda, MIN is"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "letter",
        "ocr_text": "e Ford Medina institute JG sattson @aBie 536 6259 MO 80965 University Student Letter Anthony Roth 0142 Nancy Rapid Chenytshie: 5798 September 12. 2025 Roger Rammrez an 26318 Kemp Haven New Amanda, M 61969 Dear Ms. Anna. ansen behalf of Johnson Ltd School regarding your application for tam writing to you on ed institution. admission into our esteem ion for your interest in pursuing higher plication materials, ssed t hiy reviewed your ap’ statement, and we are impre: id fike to express Our apprecia’ arsity. We have thoroug c¢ achievements and personal ent to excellence. Firstly, we woul education at our univ including your academi by your passion for learning and comrnity"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "letter",
        "ocr_text": "Vi 1a Gcaits 536 6253 MO 80965\" on g a) University Student Letter Anthony Reth 0742 Nane Rapid Chenyishire, Ay S798 September 12, me Roger Ramirez 26318 Kemp Haven New Amanda, MN 61969 Dear Ms, Hanna fam writing to you on behalf of Johnson Ltd Schoo} garding you admission into oyr esteemed institution. ‘fT application for Firstly, we would fike to express Our appreciatio educatio nm et our UNiversity. We t including your academ) is by your passion n for your interest in Pursuing higher reviewed YOU application Materials, for igarning and commitment to excellence,"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "letter",
        "ocr_text": "Ford Medina Institute RY N 536 6253 s1gsattson gi MO 80965 University student Letter Anthony Roth 0142 Nancy Rapid Cherylshi A 5798 September 42, 2025 Roger Ramirez fviay 26318 Kemp, Haven New Amanda, MN nna, Dear Ms. jansen ation for half of Johnson Ltd School regarding your applic am writing to you on be med institution. admission into our estee! tin pursuing higher materials, e impressed your interes iewed your application and we af uld like to express our appreciation for ity. We have thoroughly revi and personal statement, cellence. Firstly, we WO education at our universi including your academic by your passion for learnin' achievements g and commitment to ex’"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "letter",
        "ocr_text": "Ford Medina Institute Poe Re GaaHs ON GAH 536 6253 Mio BO965 df University Student Letter Anthony Roth 0142 Nancy ae Chevvishire, A 35798 September 12, Roger Ramirez vias 26318 Kemp Haven New Amanda, MN D rMs. Anna. Hansen YH writing to you ont 3° OF Johnson Ltd School garding your app: med institution, cation for admission inte ou Wwe would like to We hav Nic achiever impressed by your n for learning end commitment to excellence,"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "letter",
        "ocr_text": "4 Wiiey Ltd University Se A YRe ott @gras65e63062 WI 32093 University Student Letter Karen Martin 682 vason Creek enniferhaven, ME 30665 September 40, 2025 Jasmine 41429 Wendy Light Apt. 914 North Jenniferside, TN 02428 Dear Ms. Michael tam writing to you on behalf °F Paul an admission into id Sons College regarding your application our esteemed institution for Firstly, we would like to express our @ppreciation for education at our university. We have thor including your academic achie by your passio your interest in Oughiy revievy vements and person for fearning ang commitment to pursuing higher €d your application Materials, al Statement, anc we are impressed €xcellence."
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "letter",
        "ocr_text": "g >) wr a 408 Su Wiley Ltd University wie AVR Ott @graesse630g AN w 1 32093 University Student Letter Karen Martin 682 wason Creek enniterhaven, ME 30665 September 10, 2025 41129 Weng Light Apt. 914 orth Jenniferside, TN 02428 Dear Ms. Michael lam writing to you on beh alf of Pa admission into oyr esteem ul and Sons College regarding your application for €d institution,"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "letter",
        "ocr_text": "__ Wiley Ltd University Sai Pott @grgs6 5663062 University Student Letter caren Marin ia las on Creek Je HE ferhaver 320665 September 10, 2025 Jasmine 44129 4 Wendy Light Apt. 914 No Foster Fof mau and Sons College regarding your application for aamission inte med institution university. We have including your academic achi the ements"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "letter",
        "ocr_text": "/ GF oe Wiley Ltd University ranqe eeott grB665663062 West University Student Letter Karen Martin 682 Jason Creek enniferhaven, ME 30665 oraer el 10, Jasmine 41129 Wendy Light Apt. 914 North Jenniferside, TN 02428 Dear Ms. Michael | am writing to you on behalf of Paul and Sons College regarding y admission into our esteemed institution. our application for Firstly, we would like to express our appreciation for your interest in pursuing higher education at our university. We have thoroughly reviewed your application materials, including your academic achievements and personal statement, and we are impressed by your passion for learning and commitment to excellence."
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "letter",
        "ocr_text": "Wiley Lig University 405 Sus ie SRY ReOtt gragesee3ogs University Student Letter Jasmine ayaa 41928 Wendy Light Apt 814 Nort Jennie side, TN 02428 Dear Ms. Michael . Oster ham writing 2 1 On behalf o \"Paul and Sons Cov admission EME Institution, SiON into our este, ding your appl oY for Firstly, we War. ding Uke to exp Fess our appr for your interest j our Ursuing higher €d your ap YOur acadern, Bement, and commitment to exce"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "letter",
        "ocr_text": "Brown, mats iy azleslic @at 490 1899 ree University Student Letter Laura Johnson 6133 Will soni ae New/ Alicia, TN “Masao August 24, 025 Jennifer West A299 jason Fords Madremout, NC 84320 Dear Ms, Raven ierce ation for q to you on behalf of Reyes Group Institute \"egarding your ape admission into our esteemed institution in ours dy, we would We nat our university. We ha tion materi educa including your academic achievemer your passion for learning and c"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "letter",
        "ocr_text": "0 1899 University student Letter Laura dohnson 6133 surtimil Ay ps New Ag: TN BO42 August 24, pit fas) pe West 438 n Fore 4 North a renmun of Reyes Group institute Tes jam writing io y admissi jon i ing higher would like to exp Firstly, W"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "letter",
        "ocr_text": "Brown, Cr Vee Jimenez heae i yoaes Laura $133 Wiliams eesti 284 New Alicia, 48962\" August 24, 2026 Jennifer West Noah Argrensut, NC 84320 Dear Ms. Raven wTce esteem ved i institution. Firstly, education at our ur for your interest in pursuing higher vers ty. We have thorough (Teviewed your application materials, including ments and persona va! statement, and we ar: viment to ex ce"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "letter",
        "ocr_text": "isiezleslie at 490 1499 ~~ GU 40323 a University Student Letter Laura Johnson seman ANP BS New Alicia, TN 48942 August 21, 025 Jennifer West North Arsee EUS NC 84320 Dear Ms. Raven lerce am writing to you on behalf of Reyes Group Institute \"egarding your application for admission into our esteemed institution. Firstly, we would like to express our appreciation for your interest in pursuing higher education at our university. We have thorou including your academic achievements and by your passion for learning and commitme ghly reviewed your application materials, personal statement, and we are impressed nt to excellence."
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "letter",
        "ocr_text": "Baik 4e ciaaiiezt es fic @eye 400- 1499 U 40523 University Student Letter Laura Johneon 6133 nee lang. 4 Sumy Apt ew Alicia, TN ASOAZ August 2h, 2025 Jennifer West 4399 Jason Fords Nort Andremouth, CG 84320 Dear Ms. Raven Pierce ute regarding your ARDC. 9 you on behaif of Reyes Group insti s Our esteem eg ing 10 Express OUF BPPT sity, We have thor c achievement sion for learning and commitment"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "letter",
        "ocr_text": "Cr ZT Wogdard Walsh PWdopez @go 045- 2904 —_ la. a 4863 University Student Letter Logan Simpson 15080 Marquez lors Suite at ae February 21, Andrew Harris 14407 Joseph River Brendashirs4 Kis 95117 Dear Ms. Aa, lam writing to you on behalf of Wang Ha admission into Our esteemed as University regarding your application for institution, Firstly, we would like to express our appreciation for your interest in Pursuing higher Education at our University, We have thoroughly reviewed your application Materials, including your academic achievements and personal Statement, and we are impresseq by your Passion for learning and commitment to excellence,"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "letter",
        "ocr_text": "ae Wogdard Walsh HAoSe opez e0 945 2624 University Student Letter Logan Simpson 15080 Marquez BsskAine. Fone 21, Andrew Harris 14407 Joseph River siohashis, Me Dear Ms. An | am writing to you on behalf of Wang Haas University \"9 admission into our esteemed institution. arding your application for Firstly, we would like to express Our appreciation for your interest in pursuing higher education at our university. We have thoroughly reviewed your application materials, including your academic achievements and personal statement, and we are impressed by your passion for learning and commitment to excellence."
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "letter",
        "ocr_text": "University Student Letter Logan Simpson 15089 2 ts Ore uite 82. vem aie es ALY Clark a Wang- Haas Un uversity 12g"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "letter",
        "ocr_text": "Wood. ad B saylopex Gpg0 045- 2824 48636 uding your"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "letter",
        "ocr_text": "University Student Letter Logan Simpson Shore Suts ba8 hore Suite East Ann ne, ae 99813 Febuary 21, Andrew Harris 14407 Joseph River ar wri behalf of a arn writing to you on behalf o Wang Haas University admission into our esteemed institution. ike to express our appreciation for your ncduc vg Your by your cademic achievements ag"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "letter",
        "ocr_text": "Melon, Macias and Johnson University tebfivRouston @gi 234 ern0 University Student Letter Maria Becker 6002 Jacks SSON isiands East George NV Sagas October 20, 2024 oRe anda, 2733, isabelle nderpass Wonghaven, Vi 69491 iam writing to you on behaif of Buck Mccoy University '@garding your application for admisgion into our esteemed institution. UTNE Firstly, we would like toe express our appreciation for your interest in educa irsuing hi nm at our university. We f pplication ma including your acadamic ach and personal statem: and we are imp: by vour passion for learning and commitment to excelle Ce,"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "letter",
        "ocr_text": "Melton, Macasand Johnson tolitivhouston @g 234 6900 University Student Letter Maria Becker 6002 see aat eltae Hy 38888 October 20, 2024 Nanda. 2733 |sabella inderpass Wonghaven, VI 69491 Dear Ms. Kristy Daniels am writing to you on behalf of Buck Mccoy University regarding your application for admission into our esteemed institution. ation for your interest in pursuing higher ghly reviewed your application materials, statement, and we are impressed Firstly, we would like to express our appreci: education at our university. We have thorou including your academic achievements and personal by vour passion for learning and commitment to excellence."
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "letter",
        "ocr_text": "Melton, Macias and Johnsen University toRn vhouston234 G9n0 15872 University Student Letter Maria Becker 6002 east Shao Islands cen Ge Ny 2733 isabelia GRRE! Wonghaven, V1 69491 Dear Ms. Kristy ~” Daniels in for Jam writing to you on behalf of Buck Mccoy University \"garding your into our es ti med institution. nave thoroughly reviewed your application mat ts and pe statement, and we are impressed by yo HOM TOF learning ane comr"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "letter",
        "ocr_text": "Malton, Macias and Johnsen University houston 7g 234 6900 ADOFZ University Student Letter Mare Becker “een ie st 's ang George Abas Getober 20, 2024 YMARGS. 27233 Isabella (aa eebel Wonghaven, Vi 69497 Sear kde Krist, wear Nis. S Darieis your appiication for to our es of Buck Mecoy University fegar admissior Firstly, we would ike ty. We have roughly revi education at our univers! i, and we ar ng your academic achievements and personal impressed by your passion for fe amitment to excelle!"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "letter",
        "ocr_text": "e Meiton, Macias and Jehnsor: University toffiivhouston g 234 69t0 15672 University Student Letter Maria Becker epee deer George, ibaa October 20, 2024 anda. 2733. isabella rpass: Wonghaven, VI 69434 Dear Ms. Kristy, Daniels iting to you on behalf of Buck Mccoy University regarding your application for tam wr ution. admission into our esteemed instit! ation for your interest in pursuing higher Firstly, we would like to express Our appreci ion materials, education at our university. We have thoroughly reviewed your applicat! including your academic achieve: ersonal statement, and we are impressed by your passion for jearning and co ents and p mrnitment to excellence."
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "letter",
        "ocr_text": "Murpi Ay Lia Institute Unit ‘By uth gr MBBEEAT 1177 oa 2258. ai, i University Student Letter Cathy Smith 830 anne Blan Tina Raker 94 is CLA econ i 035 ion bet applicat for education at our univ"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "letter",
        "ocr_text": "‘ee J ____ Murphy Ltd Institute Hee ignith g m 8647 1177 ww \\i\\ aN d University Student Letter Cathy Smith 830 Ae Wage eared VA 18140 November 19, 2024 SEH Hf 0355: Dear Ms. Vyaittis, am writing to you on behalf of Berry, Black and Mitchell regarding your application for admission into our esteemed institution. Firstly, we would like to express our appreciation for your interest in pursuing higher education at our university. We have thoroughly reviewed your application materials, including your academic achievements and personal statement, and we are impressed by your passion for learning and commitment to excellence."
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "letter",
        "ocr_text": "Murphy Ltd institule Eabemnith grrewe647 1 177 University Student Letter Cathy Smith 830 Anne te anpike Suite Grimesp pert Pa November 19, 2024 Tina Raker 504 Wells Cliff Jesonbury, ef 03854 Dear frie AES ry, Black and Mitchell regarding your application for half af Catege tara wrt mission into our Wg higher our interest in pursy Firstly, we would like to ewed your applic inciudiy are HVipre wis and personal statement, cellence SKO ce. nd commitment to sien for learning"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "letter",
        "ocr_text": "ej Murohy Ltd institute Bag ephith omadise47 1177 University Student Letter Cathy Smith 830 Anre Tumplke Grittespart VA 18140 November 19, 2024 Tina Raker SER ot Dear Ms. paltick,. iam writing to you on behalf of Bery, Black and Mitchell regarding your application for admission into our esteemed institution Firstly, we would like to express our appreciation for your interest in pursuing higher education at our university. We have thoroughly reviewed your application materiats, including your academic achievements and personal staternent, and we are impressed by your passion for learning and commitment to excellence."
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "letter",
        "ocr_text": "] e] r sgt Ltd Institute axBeenith @gmesse47 1177 ew \\i\\ as 7 University Student Letter Cathy Smith 830 Anne Turnpike Suite 199 Grimespon. VA 1814 November 19, 2024 Tina Baker Jasonbury EL 0355: Dear Ms. Vyjittic, |am writing to you on behalf of Berry, Blarticas Mitchell regarding your application for admission into our esteemed institution. Firstly, we would like to express our appreciation for your interest in pursuing higher education at our university. We have thoroughly reviewed your application materials, including your academic achievements and personal statement, and we are impressed by your passion for learning and commitment to excellence."
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "letter",
        "ocr_text": "Nicclgin, and. Sons niitetiaigedecca @N5059 788 nate 24084 University Student Letter x ignaet vee May 22, 2025 Darren Sloan 98581 Rul Guzm: agen AR Soot, ONES on for pp interest in Gur Ruling ation for you sy for mat yet our ur cb your af have Torour ia onal statement t, and we are INCUNG your aca o exceller your passion for earnir te] commitment"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "letter",
        "ocr_text": "5ORBB University student Letter cnael Megas, USE, oGc seare May 22. 2025 Darren Stoan 3581 Ruiz Gioye Guzmanview, WA Jones writing to you on behalf of Rowland Inc College 9\" ding your appy for 2 ttution sur interest in purs higher regs our apprecia jation for yeu noroughly reviewe s materials, ion yy, WE WIDUIG F {your applical education at our including your aca acenc achievarnent e impressed nt, ard we at sand p by y your passion for learning and c commitment te excellence."
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "letter",
        "ocr_text": "Meclain and Sons Aofece Febecca ipsoso7RA May 22, 2025 Darren Sloan 6584 Ruiz Groye uzmanview, WA 58715 Dear scott Fe f 0 Rowland inc College \"ga! d institution. did tke to express our appreciation for y and person. ment to"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "letter",
        "ocr_text": "Darren Sloan $8581 Ruiz Grove Guzmaniview, WA 58715 Soott Jones nd Inc College ‘¢ ion,"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "letter",
        "ocr_text": "nitetatvedecca soso University Student Letter Mig ighael Minar: USEC jen 4 3o f May 22, 2025 Darren Sloan e508) Ruiz G Dyair ranVview 5874 Dear Ms. peott Jones Rowland inc College 9° ‘0 our esteemed institution ao! press Our apprec ation for your interest in pur Firstly, we cation m guid like te university. We have thoroughty reviewec your PUP education including y by your passion for iearning we are impre: sonal statement, an co achievements ana p Gur acacer and commitment to elence."
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "letter",
        "ocr_text": "75376 Bi rar Wheison ges3 257325 University Student Letter Gabriella Harris 916 Abbott. weer Suite 776 West Stacy, UT TAGE May 24, 2025 Melissa Taylor 1859 Whi Causeway aug £73 acheipart, IN 21444 Dea Ricardo. Dear Ms. Yayior iam writing to you on beha' Gh SESH inc Schoo Firstly, we our appreciation for your interest in pursuing higher aducation at our oreuanly reviewed your application rnateriais, +, nic achievements and personal nent, and we are impressed learning and comrnitment to excellence."
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "letter",
        "ocr_text": "Tran, Mclaughlin and Hart haranelson gas3257325 ss 69 University Student Letter Gabriella 4 us 29016 Abbott Motorway uhe 776 West totacy, UT May 24, 2025 Melissa Tayior ay ene 07a Rachelport IN 24114 Dear Ms, Ricardo Veat Ns. Acar jam writing to you on pehait of Steyerse oF inc admission into our esteemed institution. in pe iyour application mat erials, for your interes’ jation ly review nal statem: ul BODE je thoroug Firstly, we would Hike to express our university. We jeverents and eGuc. cademic n for learning and commitment to excener noe. includ! py your passio"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "letter",
        "ocr_text": "Tran, Mclaughlin and Hart fare rd elson Q863257325 me 69 University Student Letter Gabriella Harris Abb te) Motews uite 776 West Stacy, UT 7460! May 24, 2025 Melissa Taylor causeway Maite 073 Rachelport, IN 21114 Dear Ms. igaydo am writing to you on behalf of Stevenson Inc regarding your application for admission into our esteemed institution. Firstly, we would like to express our appreciation for your interest in pursuing higher education at our university. We have thoroughly reviewed your application materials, including your academic achievements and personal statement, and we are impressed by your passion for learning and commitment to excellence."
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "letter",
        "ocr_text": "Tran, Mclaughlin and Hart sheet matighelson ges325 7325 University Student Letter cans iat Harris Rott, Motorway 8 Suite 77 West Stacy, UT TABOS May 24, 2025 Melissa Taylor 4859 White Causeway es O73 Rachelport, iN 21144 Dear Mes icardo GOT ES Ricars 7 for behalf admission inte our esteemed i fam g to you on Steye sn ine $c fitution. ty. We have thorough iciuding you c achieve mpressed YOur Dass:"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "letter",
        "ocr_text": "ral ijahelsonc e96s257226 University Student Letter ones Harris Mowrwa Sue 776 West t stag, UT May 24, 2025 Melissa Tavior Dear Ms. Rigarg° lam writing to you on behalf of Stevens] Inc admission into our esteemed institution. regarding your application for your interest in pursuing higher wed your application materials, are impressed ur appreciation for vie al statement, and we Firstly, we would like to express ol education at our university. We have thoroughly re including your academic achievements and person: by your passion for learning and commitment to excellence."
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "letter",
        "ocr_text": "S32 ae Marquez, Ho and Hernandez Prob t65 graab2425969 ~~ University Student Letter Dr. Christopher Reaves 432 Kelert Street Ker erfurt, July 22, 2025 Denial Brown og Rep ieee Chaney: e, NM 20123 Dear Ms. Matthew | am writing to you on behalf 0 rift Fox and Barber regarding your application for admission into our esteemed institution. Schneid' for your interest in pursuing higher eviewed your application materials, e impressed Firstly, we would like to express our appreciation education at our university. We have thoroughly r including your academic achievements and personal statement, and we ar by your passion for learning and commitment to excellence."
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "letter",
        "ocr_text": "Marquez, Ho and Hernandez Acaderny *eeoert65 @graab2425969 Amyvile, RS 03244 University Student Letter Dr Chr topher Reaves 432 Rogers Street Kellerfurt, FM 35986 July 22, 2025 Danie! Brown 0408 Diaz Frace Une S34 chaneyvilie, NM S018: 123 Dear Ms. Maithew Baker i am writing to you on behalf of Schneider Fox and Barber inte our esteemed institution. Firstly, lucing your acagemic achievements ar nd persc nal statement, and we are impressed passion for learn nd commitment te excellen"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "letter",
        "ocr_text": "Marquez, Hel aral Hernandez A Pebxert65 @grBA52425969 7” ~~ 3244 University Student Letter Dr. Christopher Reeves 432 Rogers Street Kellerfurt, FM 35986 July 22, 2025 Daniel Brown 123° Dear Ms. Matthew neider, Fox and Barber regarding your application for Sch g to you on behalf of or iversity 1am writin d institution. admission into our esteeme: your interest in pursuing higher iewed your application materials, tement, and we are impressed ress our appreciation for We have thoroughly revi vements and personal sta d commitment to excellence. Firstly, we would like to exp! education at our university. juding your academic achie' arning an incl by your passion for le:"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "letter",
        "ocr_text": "e] Marquez, Ho and Hernandez Academy GBRITES @grBab2425969 3244 University Student Letter Dr. Christopher Reaves 432 Ragers Street Kellerfurt, FM 35986 July 22, 2025 ae ee jaz Trace connie NM Dear Ms. Matthew t if of Schneider, Fox and Barber c: fo) am writing to you on behalf of University regarding your appiication for admission into our esteemed institution. Firstly, we would like to express our appreciation for your interest in pursuing higher education at our university. We have thoroughly reviewed your application materials, including your academic achievements and personal statement, and we are impressed by your passion for learning and commitment to excellence."
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "letter",
        "ocr_text": "nt @PRI65 @grBab2425969 ac Cama Marquez, Ho and Hernandez Acad lemv University Student Letter Dr. Christopher Reavac 432 Rogers Street Kellerfurt, FM 35986 July 22, 2025 Daniel Brown 0403 une pd ace chanel ie, NM Dear Ms. Mat hew, am writing to you on behalf of Scheidt Nerety Barber regarding your application for admission into our esteemed institution. Firstly, we would like to express our appreciation for your interest in pursuing higher education at our university. We have thoroughly reviewed your application materials, including your academic achievements and personal statement, and we are impressed by your passion for learning and commitment to excellence."
    }
]