[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "librarygoal",
        "ocr_text": "Se; a Encourage reguier GUIS? library visite te build Strong study habits. a Cultivate g love for reading among students of all levels, Q Promote reading as a habit that Suppors lifelong learning. su orl faculty ang ES in their research ang Project needs, La Promote infor Mation Meraoy thr Promote Fesponsib and medi G friendly atm 3h effec CCUvE library instruction. a le use of information a resources. Ospiere within th heal community, ay Foster a;"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library Oo Encourage regular library visits to build strong study habits. Q Cultivate a love for reading among students of all levels. O Promote reading as a habit that supports lifelong learning. O Support faculty and students in their research and project needs. O Promote information literacy through effective library instruction. Promote responsible use of information and media resources. O Foster a reading friendly atmosphere within the school community."
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library a Encourage regular library visits to build strong study habits. Cultivate a love for reading among students of all levels. O Promote reading as a habit that supports lifelong learning. O1 Support faculty and students in their research and project needs. O Promote information literacy through effective library instruction. 5 Promote responsible use of information and media resources. O Foster a reading friendly atmosphere within the school community."
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library og Encourage regular library visits to buiid strong study habits. Cultivate a love for reading among students of all levels. Promote reading as a habit that supports lifelong learning. Support faculty and students in their research and project needs. Promote information literacy through effective library instruction. Promote responsible use of information and media resources. Foster a reading friendly atmosphere within the schoo! community."
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "librarygoal",
        "ocr_text": "Obiectives for the Library is) Encourage reguiar ilbrary visits to bulid strong study habits. Sl Cultivate a love for reading among students of all levels. Promote reading as a habit that supports lifelong learning. E] Supoori faculty and students in tt search and needs G Promote information literacy through effective library instr, Promote responsible use of information and media resources. Foster 4 reading friendly atrnosphere within the schoo! community. On."
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "librarygoal",
        "ocr_text": "im s] Objectives for the Library Promote Collaboration th res: Q a a Prom o Develop stud Lie] Pror 10te equal access io knowledge for ihe entire Student body. Support academic excellar quality informaii nee by providin: On services, ndepend ents’ apnrecia iO for research and reading, Expand access to both whale cal and library collecti ions arming materiais that digital Provide updated te Meet curriculum needs."
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library 0 Pomona ee 0 Promote Collaboration through Soup study areas and resources. cess to knowledge for th mic excellence by Providing quali ludy and academic Curiosity ai learners, 2 Promote equal ac: support acadey entire student body. og Promote ing: ©pendent st ty information Services, mong 5 Expand access to both Physical and digital library collections. Q Provide upddated leg ming materials that meet Curriculum needs,"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "librarygoal",
        "ocr_text": "Ob} ect ives for the Liprary ‘oup study areas and ihe entire student body. QQ Promote collaboration the resou al access fo Kt sowledge for i Promote edu providing quality information services. Support acad Promote independe c Develop students’ appreciation for research anc reading. a Expand access to both physical and digital rary col ilections. learning materials that meet iculum needs. O) Provide updated"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "librarygoal",
        "ocr_text": "Objective ives for the Library t1 Promote coliaboration th h group study areas and tf Develop students’ appreciation for research and reading. Expand acces ss to both physical and digita library collections. C1 Provide updated learning materials that meet curriculum needs."
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "librarygoal",
        "ocr_text": "Objectives forthe Library Promote collaboration throu, resour 5 Promote ual access to knowledge for the entire student q 5 Support academic excellence b fa] Promote independent sti gh group study areas and ces, body. providing Quality information services, ludy and academic curlosity among learners, Develop students’ appreciation for research and reading. 4 Expand access to both physical and digital library collections. Provide updated learning materials that meet curriculum needs."
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "librarygoal",
        "ocr_text": "ves for the we Son Objecti Encourage students to use library resources for persona growth. are timely access to books and online learning tools. Pal Enhance student ‘ais. ry instructi C1 Promote information literacy through effe Promote responsible use of information and media resources. ment through library led activities. Enhance student engaget"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library dent success through accessible leaming materials. O Encourage students to use library resources for personal growth. 0 Ensure timely access to books and online learning tools. o Enhance student access forcigiea and printed educational materials. O Promote information literacy through effective library instruction. 2 Promote responsible use of information and media resources. O Enhance student engagement through library led activities. O support stu"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "librarygoal",
        "ocr_text": "6) 4) Support student succe aming mate a Encourage students to use library resources for personal growth, Ensure timely access to books and online learning tools. ti Enhance st ai and printed actu Promote information literacy through effective Hbrary instruction. Promote responsible use of information and media resources. Enhance student engagement through library led activities."
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library o Support student success through accessible learning materials. O Encourage students to use library resources for personal growth. O Ensure timely access to books and online learning tools. oO Enhance student access to digital and printed educational materials. O Promote information literacy through effective library instruction. Promote responsible use of information and media resources. O Enhance student engagement through library led activities."
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library oOo Support student success through accessible learning materials. O Encourage students to use library resources for personal growth. O Ensure timely access to books and online leaming tools. oOo Enhance student access to digital and printed educational materials. O Promote information literacy through effective library instruction. Promote responsible use of information and media resources. O Enhance student engagement through library led activities."
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "librarygoal",
        "ocr_text": "| Object for the Library tC) Promote collabor: Provide up to date materials that support academic excellence. reading as a habit that supports lifeiong learning. weds. ch and project m Promote ty and students in their re £1 Support fecull Support academic projects with reliable and updated references. d digital ig mB Expand acc se to both physical an library collections. Encourage students io develop effective study and research habits."
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "librarygoal",
        "ocr_text": "bat eevbine wy fe gg ye he Be tee ery yy Objectives for the Library QO Provide up to date materials that support academic excellence \"2 Promote reading as a habit that supports lifelong learning. S. ffacully and stud hand project &) Support academic projects with reliable and updated references. 5 Expand access to both physical and digital library collections. Encourage students to develop effective study and research habits."
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library O Promote collaboration through group study areas and resources. O Provide up to date materials that support academic excellence. O Promote reading as a habit that supports lifelong learning. O Support faculty and students in their research and project needs. O Support academic projects with reliable and updated references. O Expand access to both physical and digital library collections. O Encourage students to develop effective study and research habits."
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for tl ‘. Library ty ie Li Group sludy area fi Promote collabo: is that support academic excellence. S Provide up to date m ading as a habit that supports lifelong jearning. in their rese O Promote () Support faculty anc si f Suppori academic projects with reliabie an d updated references. Expand access to both physical and digital libran collections. develop effec’ Encourage stud"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library O Promote collaboration through group study areas and resources Qo o date materials that support academic excellence. Promote reading as a habit that supports lifelong learning. Support faculty and students in their research and project needs. Provide up to- Support academic projects with reliable and updated references. Expand access to both physical and digital library collections. Encourage students to develop effective study and research habits."
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "librarygoal",
        "ocr_text": "ée Li brary neritic an te ncn nnn O ep, at brary visits COL urage reguile S 10 buitd stror g Sludy habits. 5 Pr omote equal @CCESS fo know} ledge for a) Strengthen res. search skil Tan environment the the entire stud. ent bi ilis rough guided HE courages Ody. iDrary actiyi tes, Ph and q Support academic Projects with reliable and uy updated references, Promote fesponsible use Of informati ion and medig resources Promote ibe ay programs that Support acadamig and personal growth,"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "librarygoal",
        "ocr_text": "Eno Promote eq Foster Support acadeny ‘Promote responsib and prograr OUFage reguiar lip ss Agthen rese ifahes aoe by Ua! access to POY Visits to Dulld s CCess to knowledge for the entire Student @ICH skis through iPHC 3) prdlects witk ole use of information Media resources Nal growth,"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library O Encourage regular library visits to build strong study habits. O Promote equal access to knowledge for the entire student body. O Strengthen research skills through guided library activities. C0 Foster an environment that encourages critical thinking and creativity. O Support academic projects with reliable and updated references. Promote responsible use of information and media resources. 0 Promote library programs that support academic and personal growth."
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "librarygoal",
        "ocr_text": "at = Sax ii ets Objecti ves for the Library a) Encourage regular library visits to build strong study nabits Sl Promote agual access lo knowledge for the entire student body. a gthen research ski through guided library activities. a] n environmen i ity. f] Support academi Promote responsible use of information and media resources. ograms that support a Promote library lamic and persor owth."
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "librarygoal",
        "ocr_text": "Objecti ives for the Lib 3 Encot sage reguiar library visits io bu Udy habits Promote equal access to snowiledge for the enti Strengthen research F Fos tudent badly. Skilis through guided library activities. a Creativity oniment the Support academics projects with reliable and updated O references, Promote responsible use of informati ion and media resources, Qs Promote library Programs that supr Support acaderni personal gro’"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library 0 Integrate technology to improve access to digital information. O Provide up to date materials that support academic excellence. O Strengthen research skills through guided library activities. oO Enhance student access to digital and printed educational materials. O Support academic projects with reliable and updated references. 5 Promote responsible use of information and media resources. O Foster a reading friendly atmosphere within the school community."
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library I Integrate technology to improve ace digital information. t academic exe h skills through guided library activities. i printed educational Provide up to date materials that sSUpDpO! Strengthen rese jecis with reilable and updated references Promote responsible use of information and media resources. Foster a reading friendiy atmosphere within the school community. Support academic pr Gg"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library o Integrate technology to improve access to digital information. Provide up to date materials that support academic excellence. Strengthen research skills through guided library activities. oC Enhance student access to digita! and printed educationai matenais. O Support academic projects with reliable and updated references. 5 Promote responsible use of information and media resources. 0 Foster a reading friendly atmosphere within the schoo! community."
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "librarygoal",
        "ocr_text": "cle ie is) o o Objectives Strengthen 1 research Enhance stu Support academic projects Promote r Foster a reading friendly atmosphere within the sc: Ratt tall upport academic exce Hable and updated references. responsible use of information and media resources. ol community. ugh g guided library activities."
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library O integrate technology to improve access to digital information. materials that support acade lls through guided library activities. al and printed educational Is. O provide up to date mic excellence. O Strengthen research ski o Enhance student access to digit material O Support academic projects with reliable and upda' 5 Promote responsible use of infor and media resources. g friendly atmosphere within the school community. ted references. mation 0 Foster a readin"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library O Encourage regular library visits to build strong study habits. 2 Cultivate a love for reading among students of all levels. O support academic excellence by providing quality information services. o Enhance student access to digital and printed educational materials. 0 Promote information liter 5 Promote responsible use of information and media resources. e students to develop effective study and research hab acy through effective library instruction. O Encourag its."
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library ty information services. oO Enhance student access to digital and Printed educational materials. QO Promote information literacy through effective library instruction, 7 Promote responsible use of information and media resources. a Encourage students to develop effective Study and research habits."
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library a Encourage regular library visits to build strong study habits. 4 Cultivate a love for reading among students of all levels. O Support academic excellence by providing quality information services. oO Enhance student access to digital and printed educational materials. O Promote information literacy through effective library instruction. Promote responsible use of information and media resources. O Encourage students to develop effective study and research habits."
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library r library visits to build strong study habits. ve for reading among students of all levels. uality information services. O Encourage regula 0 Cultivate alo academic excellence by providing 4 O Support ccess to digital and printed educational materials o Enhance student a O Promote information literacy through effective library instruction. 2 Promote responsible use of information and media resources. O Encourage students to develop effective study and research habits."
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "librarygoal",
        "ocr_text": "Objectives fo for the Library Go Encourage regular library visits to build strong study habits. Cultivate a love for reading among students of all levels. Support academic excellence by providing quality information services. oOo Enhance student access to digital and printed educational materials. 0 Promote information literacy through effective library instruction. Promote responsible use of information and media resources. O Encourage students to develop effective study and research habits."
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library a Encourage regular library visits to build strong study habits. 5 Encourage students to use library resources for personal growth. O Promote reading as a habit that supports lifelong learning. o Maintain an organized and efficient system for borrowing and returning S. O Develop students’ appreciation for research and reading. Promote responsible use of information and media resources. O Provide updated learning materials that meet curriculum needs."
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library o Encourage reguiar library visits to build strong study habits. a Encourage students to use library resources for personal growth. Promote reading as a habit that supports lifelong learning. Oo Maintain an organized and enicent system for borrowing and raturning KS. Develop students’ appreciation for research and reading. Promote responsible use of information and media resources. O Provide updated fearning materials that meet curriculurn needs."
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "librarygoal",
        "ocr_text": "o, Obje OT] Q a a f Encourage Encourag Develop st Students Promote respons Provide updat ves f for the L ibre F library iid stror Students to y ibrary re ding as ah t system for borrowing ang 5. appreciatio n for resear nsible use OF i and media res Sources, ted learning ma AUFCES for is; lait t Wal Supports (4 tifel ersonal growth. erong learn] ing, ch and reay ding. information iculum needs,"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library O Encourage regular library visits to build strong study habits. O Encourage students to use library resources for personal growth. O Promote reading as a habit that supports lifelong learning. oOo Maintain an organized and efficient system for borrowing and returning [el 0 Develop students’ appreciation for research and reading. Promote responsible use of information and media resources. O Provide updated learning materials that meet curriculum needs."
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for t rong study habits Encourage students to use library resources for personal growth. at supports lifelong learning. d returning Ci Develop students’ appreciation for research and reading. Promote responsible use of information and media resources. tl Provide updated learning materials that meet curriculum needs."
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library =) Encourage regular library visits to build strong study habits. Cultivate a love for reading among students of all levels. O Promote reading as a habit that supports lifelong learning. oO Promote independent study and academic curiosity among learners. O Provide a peaceful environment that enhances study focus. Empower students to become independent and effective learners. O Provide updated learning materials that meet curriculum needs."
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "librarygoal",
        "ocr_text": "age regu HOrary visits to build stro, 3 Siucly habits. Cultivate a love for reading aMong students of all levels Promote rea 4109 @S habit th Q Promote inc 2 £, iélong learning, atc ear S nig Provide peaceful that enhic &nvironment study focus. Empower Students to become independent 8nd effective learners. ST Broy; Ge updated learning Materials that meet ourr"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "librarygoal",
        "ocr_text": "Objecti rO r ore Quiar library vis Cultivate a love fo: f reading among students of all levels as a habit that supports lifelong learning, O Provide a peaceful environment that enhances study focus oe Empower students to become independent and effective learners. Provide u ipdaied learning materials that meet curriculum needs,"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "librarygoal",
        "ocr_text": "jar library vislis to bulld strong study habits Cultivate a love for reading among students of ail levels. rf Et Prom reading as a habit that supporis lifelong learning. penden lemi Provide a peaceful environment t Empower students to become independent and effective learners. Provide updated learning materials that meet curriculum needs. enhances study focus."
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library O Encourage regular library visits to build strong study habits. O Cultivate a love for reading among students of all levels. O Promote reading as a habit that supports lifelong learning. o Promote independent ae and academic curiosity among learner: O Provide a peaceful env 5 Empower students to become independent and effective learners. earning materials that meet curriculum needs. ironment that enhances study focus. O Provide updated |"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library Qo Encourage regular library visits to build strong study habits. Oo Support continuous learning through workshops and library programs. a Support academic excellence b oO Enhance student access to digital materials. o Yy providing quality information services. and printed educational Encourage creative thinking by Offering diverse learning materials. Support the academic mission of the school through quality services. Foster a reading friendly atmosphere within the school community."
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "librarygoal",
        "ocr_text": "Objective 2S for the Library SF Enoo purace requiar library 8 fo bulid strong stucy nabits. Support continuous fearing through workshops and library programs Si Support ac. g Enhance oviding quality information servi i icational Encourage creative thinking by offerir diverse learning materi Support the academic mission of the schoo! through quality services. E1 Foster a reading friendly atrnosphere within the school community."
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library O Encourage regular library visits to build strong study habits. O Support continuous learning through workshops and library programs. cellence by providing quality information services. O support academic ex inted educational o Enhance student access to digital and pri materials. O Encourage creative thinking by offering diverse lear! 0 Support the academic mission of the school through quality services. mosphere within the school community. ning materials. O Foster a reading friendly at"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "librarygoal",
        "ocr_text": "Objectives for the Library Qo Support academic excellence by Providing quality information services. oO Enhance student access to digital and printed educational materials. oO Encourage creative thinking by Offering diverse learning materials. 4 Support the academic mission of the school through quality services. O Foster a reading friendly atmosphere within the school community."
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "librarygoal",
        "ocr_text": "Ibjectives for the Lib: D Eno Q a bs a) as Support the academic mission of the school through quality services. Foster a reading ‘ffendly atmosphere within the schoai community, ourage to bull stro study habits, foport continuous fe arrung through workshops and libr: fary programs. niormation ShViCeS ucCationg! by offering diverse iearning mater ©"
    }
]