[
    {
        "image": "manual1_synth_10_aug1.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING Student Records Management Operations Manual ne the Stasent Serves and Recniia Division (SER) Onorations, Man ats shusonty, taste Wael This gn 2nd Stain understanding processes and Drocadutes relaiod aksiant Feconds and academic services, Ths SRO is corte i eticrent accurate, 8 eats managemant of stsdent inform Setelines ae based or, the Cate Srivacy Ac, CRED cages 8K nstintonal pox SSRD Mission To enainesin the int Poids timely, aceuste aauistaneg Uiity of shedert records THOUGH proven nai erttors eal fo student ing fonnation management SSRO Vision A Siture where student seconds Management is fut We aspire t set the stanctard tor exceten ly digitized, ICE in anaday cue, ad access records services Dieter SER ‘Wovidns ramet, courts, and sectosskoes S078 to ae strony Mobeni ta tagaststantonis of hunasty ant en craters CONPOBNTALNY gn Rry ME Be Era wt secty of sent Mematin 2408, CE Sap er sorties ProERAOL St ENRr eey UNTABILET Taig respeenty to atone wy wanszacence ony retaeity, Oijortives SAe00 28 Bs oti repost ofa ment aac Penns, \"sella set recesses 0: stsenteceecmann Sobtae 2iegsty and crates, of stent ec, Spar sa tutonaiconeasen Heese socosste ‘ashen Cats manaersent 5 Pate cuts of excetencn stains recone. maccayoosrs"
    },
    {
        "image": "manual1_synth_10_aug2.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING Student Records Management Operations Manua? introduction: ough professional to student information nv SSRD VISION A fut We asp! ere St. cessible Dietum INTEGRITY Maintain the nighest standards af noneoty and et CONPOENTIAUITY Protecting the pracy and eecurty of stuse st nfonesat Ajectives dest academia Mate eimaotn process requirements 3. Maistam tegity and confgentaay of studer treconds 4, Support matin ai rasearch through accurate sty er Sats aap 5 Foster 2 cumure af excetene reccids management"
    },
    {
        "image": "manual1_synth_10_aug3.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING Student Records Management Operations Manual Introduction: Welcome to the Student Services and Records Division (SSRD) Operations Manual. This guide assists students, faculty, and staff in understanding processes and procedures related to student records and academic services. ‘The SSRD is committed to efficient, accurate, and secure management of student information. These guidelines are based on the Data Privacy Act, CHED regulations, and institutional policies. SSRD MISSION To maintain the integrity and accessibility of student records through professional service. We provide timely, accurate assistance in all matters relating to student information management SSRD VISION Atuture where student records management is fully digitized, secure, and accessible. We aspire to set the standard for excellence in academic records services. Dictum SERVICE Providing prompt, courteous, and professional service to all stakeholders. INTEGRITY Maintaining the highest standards of honesty and ethical conduct. CONFIDENTIALITY Protecting the privacy and security of student information EXCELLENCE Striving for continuous improvement and superior quality. ACCOUNTABILITY Taking responsibilty for actions with transparency and reliability, Obj 1. Serve as the offeial repository of all student academic records. 2. Faciltate smooth processing of student requirements. 3, Maintain integrity and confidentiality of student records. 4, Suppor insttutional research through accurate student data management, 5, Foster a culture of excellence in student records management,"
    },
    {
        "image": "manual1_synth_10_aug4.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING Student Records Management Operations Manual Introduction: Welcome to the Student Services a assists students, faculty, and statin records and academic services. Tne SSRD is commited to effcient, accurate, and secure management of student are based on the Data Privacy Act, CHED regulations, and insttutonal policies (SSRD) Operations Manual. This guide ind Records Division procedures related to student understanding processes and guideli SSRD MISSION To maintain the integrity and accessibility of st provide timely, accurate assistance in all matters tudent records through professional service. We relating to student information management. SSRD VISION ‘A future where student records mana\\ We aspire to set the standard for excel .gement is fully digitized, secure, and accessible, lence in academic records services. SERVICE Proving prompt, courteous, and professional service toa stakeholiers INTEGRITY Mataning the highest standards of honesty and tical conduct CONFIDENTIALITY Protecting he privacy and securty of student information EXCELLENCE Stving for contnuous provement and super quay [ACCOUNTABILITY Taking responsiblity for actions wit transparency and resabsy. Objectives 1. Serve as the offcial epostory of al student academic records, 2. Facitate smooth processing of student requirements. 3. Maintain integrity and confidentiality of student records, ‘4. Support insthutonal research through accurate student data management 5. Foster a cuture of excellence in student records management."
    },
    {
        "image": "manual1_synth_10_aug5.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING Student Records Management Operations Manual inirveduction: {SSR} Cueradons Manual, This quids roo and Records Ghision fares reigtodt «student \\vasioone ts tae Suatent B60 ‘gasiat acai, foguly, and cet in undarstanding prociases an proce secovey and aeadanie wentnes: bad ip alent, accurate, and secre mn. Privacy Att, CHED raguiations, arid inlet vhe SSRE le comet agement of student infonaation TREE ional policies re acend wn tha Dats SSRO MISS the Integrity and acrasalbllty of student 1c a snaiters velating To maintain ons creas professional sevice. We provide tncety, aectnate ausistence fr te shadent infeemation management SSRD VISION A future where snatent renords mat Yee aspire to aol th standard for excellence a6 escibie, ement ts fudy agiized, secure, and ac caitemic records services. Dieser aNeR Prasiing oromet canta, cceesicoss serves to ah sisters agqregrarry panes te ig aerators) a0 eaeat contect oon seNTURLT Pret he 1207 298 #25808) stent oemaaon srapepvespaen ac wages CSS reney end reba seing toe cee EXCGLEN oe actions woh Wore7e ARCATA FY Taking Fanpenes ijecttves snes a a pasty af wi kaso anaes O10 ste asrocth poseeesbag of eden NOSTEENS 4. itn ttagty ed cordnssiny of #5E versed. «4, Supt neta coneanch BO OHSS abaient sata oxmmogereent Foster aeuinze o excttence br SEN ATES era"
    },
    {
        "image": "manual1_synth_1_aug1.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF CRIMINAL JUSTICE EDUCATION SSRD_ Policies and Guidelines Manuat fatradnction: This marwat contains operational guidelines for the Stucent Services and Reconis Division ensures Consistency, efficiency and compliance in student records management within Cothege of Crminei Justice Education. The SSRO maintains the integrity and security of student information This edition, eflective Acaemic Veer 2020 2021, complion wath nationat legisiation and ecucationsl stanceds SSR MISSION To meintur: the integrity and accessititty of studsot incon thuough professional sevice We Provige Unaly, accurate assislunce In at matters resting to siudant informatica management SSRD VISION Yo oecome Bie mata often tr scent recor management Pitoome higher educaten, dubigunned by cur Guaraknert i ACCU RLY and Gunere® Barve, We iverage tactnciogy 19 create 2 ahidemt corserse od Dirtwom INTEGRITY Upteicing hctrenty an otiical wes etarss m a8 ogee SERVICE EXCELLENCE Onierng quatty sare Het exvetts expacteteans, CONFIDENTIALITY -broteting shader hormone hire weciey. TEAMWORK. Cobabcrting efectve) ts 2eneve uttutone| chmecivas CONTINUOUS BPROVEMENT Seeking cater ways to verve Pengo newason Objectives 1 Mantae Ceclcain Caron Of a eves Studer cometance xh CHED regains 2 Prosees shedeet requnets es acaceme Govaerts efelenty. 2 bestement secure eystere fa stages ant eyckseten of shiSer? edoxmancn, 4 Provion secure eterna 22 shscerty tacit, 20 atreraee parece 5 Enaure commence win the Data Brivacy Act of 2012"
    },
    {
        "image": "manual1_synth_1_aug2.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF CRIMINAL JUSTICE EDUCA’ a SSRE Policies and Guidelines Manual sis manual cont ational guid Recads Bivision. tt nee tor the ens efficiency, and com 2 in student ment witha of Criminal Justic fective Acedemic Year 202 SSRD MISSION Tom servic. ain the integiity an provide tirnaly nanageriet To ecoina the model ule for shudent sevorae ms Bictasa AMEE 0M TEAMNAIORK Cok form"
    },
    {
        "image": "manual1_synth_1_aug3.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF CRIMINAL JUSTICE EDUCATION SSRD Policies and Guidelines Manual Introduction: This manual contains operational guidelines for the Student Services and Records Division. It ensures consistency, efficiency, and compliance in student records management within College of Criminal Justice Education. ‘The SSRD maintains the integrity and security of student information. This edition, effective ‘Academic Year 2020 2021, complies with national legislation and educational standards. SSRD MISSION To maintain the integrity and accessibility of student records through professional service. We provide timely, accurate assistance in all matters relating to student information management. SSRD VISION To become the model office for student records management in Phlppine higher education, distinguished by our ‘commitment to accuracy and superior service. We leverage technology to create a student centered ‘environment, Dictum INTEGRITY Upholding honesty and ethical standards in all operations, SERVICE EXCELLENCE Delivering quality service that exceeds expectations. CONFIDENTIALITY Protecting student information with the highest security, ‘TEAMWORK Collaborating effectively to achieve institutional objectives. CONTINUOUS IMPROVEMENT Seeking better ways to serve through innovation Objectives 1. Maintain accurate records of allenrled students in compliance with CHED regulations. 2, Process student requests for academic documents effeenty 3. Implement secure systems for storage and protection of student information 4, Provide accurate information to students, faculy, and authorized personnel 5, Ensure compliance with the Data Privacy Act of 2012."
    },
    {
        "image": "manual1_synth_1_aug4.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF CRIMINAL JUSTICE EDUCATION SSRD Policies and Guidelines Manual Introduction: ‘This manual contains operational guidelines for ihve Student Services and Records Division tt ensures consistency, effictancy, exd compitance in student records manageme t within Cobege of Caminal Justice Education. ‘The SSRD maintains the integrity and sscutity of student information. This ecition, effective ‘Academic Year 2020 2021. complies with national iegssiation and educalonal standards. SSRD MISSION ‘Yo maintain the integrity and accessibility of student recerds through professional service. We provide timery, accurate assistance in all matters reinting to student information management SSRD VISION To beccere the marel fice for student recorce management w Phiirpine huge edunstin, cetrensahen by ce Ccoarrdcrant to accuracy and superior strvice. Ve leverage tachnctogy to create a viudent centered oneroncoect Dicrumr INTEGRITY Unroiting honesty and ation standeeds af operations. SEAVICE EXCELLENCE Detvarng qualty service that exceeds cxpecteaors, CONMOENTIALITY Protectng etident wtormation wit tw highest security TEAMWORK Cobboretng eerily to achieve antnannm ance CONTHHUOUS IMPROVEMENT Seetung Deller says fo serve Owough mmoraton ‘Dhjectives 1. Mabon accurate reurts of af erected stalls m comptance wan CHED requaetint, 1 Process sticent eequesit fer academe Cocumerts oferty 9. lmgicmant vecurs nyzions ft siorage and profecten of student keratin. 4. Provide ccursen fernation So Stade, lacy, ext ativriced perso 5 Ermure conptance wih tee Duta Privacy Act of 2012"
    },
    {
        "image": "manual1_synth_1_aug5.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF CRIMINAL JUSTICE EDUCATION SSRD Policies and Guidelines Manual Introduction: This manual contains operational guidelines for the Student Services and Records Division. It ensures consistency, efficiency, and compliance in student records management within College of Criminal Justice Education ‘The SSRD maintains the integrity and security of student information. This edition, effective ‘Academic Year 2020 2021, complies with national legislation and educational standards SSRD MISSION ‘To maintain the integrity and accessibility of student records through professional service. We provide timely, accurate assistance in all matters relating to student information management. SSRD VISION ‘To become the model offce for student records management in Phitppine higher education, datngushed by our commment to accuracy and super service We leverage technology to create a student centered enveonment, Dictum INTEGRITY Uphotiing honesty and ethical standards in all operations. ‘SERVICE EXCELLENCE Detvering quaity service that exceeds expectations, CONFIDENTIALITY Protecting student information wit the highest securty ‘TEAMWORK Colaborating effectively o achieve insttutonal objectives. CONTINUOUS IMPROVEMENT Seeking better ways to serve through innovation, Objectives 1. Mantan accurate records of al enroled students n complance wih CHED reguistons 2 Process student requests for academe documents effeenty 3 Implement secure systems for storage and protection of student nformaton 4 Provide accurate nformaton to students, facuty, and authored personnel ‘5. Ensure compliance wth the Data Privacy Act of 2012."
    },
    {
        "image": "manual1_synth_2_aug1.png",
        "label": "manual",
        "ocr_text": "manual ensures compii 2022 2023, SARMS MISSION ‘SARMS VISION A future where stu We aspire to set the st GRADUATE SCHOOL Student Records Management Operations Manual"
    },
    {
        "image": "manual1_synth_2_aug2.png",
        "label": "manual",
        "ocr_text": "GRADUATE SCHOOiL Student Records Management Operations Manual lairoduction: ‘This manuai serves 23 the offeist guide for the Student Atairs end Records Management Sysiom (SARIS). 1 outings potines, guidetines, end standare operating procedures for managing seucect reccrds and acsdemic documentation within Graduale Schoo, Developed in accordance witt CHED Memorencum Orders and me Data Privacy Actot2012, this manuel ensues compliance wit nagonal slardarcs. This editon was updated in Acasemic Yeor 7022 2023, SARMS MISSION ‘To mainviain the integrity and accessibility of stvient moods thvaugh professional sevice We provide timely, accurate assistance in all mattars relating to student infermation manegement. SARMS VISION A future where stugent records inanagement is fully digitized, secure. and accessible We aspwe to set the stanard for exceitence in academic records services. Dictum INTEGRITY Uptating honanty and otres! atanaar de n ak operates, SERVICE EXCELLENCE Detiewiny ausity wesviee tt c ceets expectations CONFIDENTIALITY Promtctog shatent adixeaiin with the hes? securty TEANORK Cuboreren etiectveny i acinove Petsaserai cate 4O8 CONTINUOUS laPROVEMENT Soaking bater ways to serve trough innovation Oijectives 1 Extabéah compronenanve «tucent records awnagement syziens, 2 Process af student banesctions wih eticiency and accuracy. ‘2. Provect slucent ntormation touch caus! aecury neaatzes, 4 Provite tahing 1s erate p oteswional competonen records manegem ect 5 Contenovely inprove syttera and procedures to enhance verve Quay"
    },
    {
        "image": "manual1_synth_2_aug3.png",
        "label": "manual",
        "ocr_text": "GRADUATE SCHOOL Student Recards Managernent Operations Manual Intradection: This sanual serves as the officiat guide for the Sudeni Allaire anc Recoras Managemant System ‘SARMS) outlines policies, quidgtines, and siendand one for managing sudan! rerords an academe dacumontation witiin Graduate Scie Developed ip accerdance with CHED Memorandum Gaiers and the Sata Privacy Aci af 20 dition was undated in Academic Yea ance with natisnal stenaards. 7 ust ensin2$ comp! 2022 202. SARMS MISSION sds through prufessicial sevice, Ye “nformotion management To maintaln the integrty atid aocessibilty of student rec ce in all mat ss telating 19 stuc provide timely, accur SARMS VISION Atuiure where student r We aspire to set the standard for exes lence in academic recoras services ietuce nd sini standart fo operations RATEGRITY Uphating honesty EU PHOE stoning quasty serves that exceedis exprciatins. LITE. Brekacsing stapes chriation wie Oe highest secursy TEAMWORK Cotatondag sHectiedy we astave striations! cbjecties CONTINUOUS NPROVEMENT Seskiuy Deller ways t eerve thea now isen, jective ensue student cocneds raanecuriet system. 2 Broveas at stadent bantacions win efcleney and nccuree 15 Frotcet stadant nisenatin tivough cohust secunty masses, 4. Frovite vaining o eneure grafeesional eonastenoe m records management S, Coninsoualy improve aystema und procemues toennance servis atk"
    },
    {
        "image": "manual1_synth_2_aug4.png",
        "label": "manual",
        "ocr_text": "GRADUATE SCHOOL Student Records Management Operations Manual Sranual ensures compliance with national standards. Ths edition as updated in Academic Year 2022 2023. SARMS MISSION Dictum INTEGRITY Ushoting honesty and etal standards in al operations SERVICE EXCELLENCE Detvering qualty service that exceads expectations CONFIDENTIALITY Protecting student information wih the hhest security, TEAMWORK. Cotaboratng eect to acheve msttutonal ebectves CONTINUOUS IMPROVEMENT Seeking beter ways to serve through innovation Objectives Estabish comprehensive student records management systems 2 Process allstusent transactions wih etflency and accuracy Protect student information though robust securty measures 4+ Provide traning to ensure professional competence in records management 5 Contnucusiy mprove systems and procedures to enhance service qualty"
    },
    {
        "image": "manual1_synth_2_aug5.png",
        "label": "manual",
        "ocr_text": "GRADUATE SCHOOL Student Records Management Operations Manual Antreduction: ‘This manuat cerves 23 the oficat quide for ine Student Ataire and Feecordis Management System (SARMS). cuttings pohcies, quidelines, ang stanaard eperatng procedures for managing student records ona academic documentation within Graduate Scrcot, Developed in accordance with CHED Maniciardum Orders ano the Oula Prtvacy Act of 2012, this manu! ensures compilerice with nstons! stanaards, This aditon was, upcaied in Acagemnic Year 2022 2023 SARMS MISSION ‘Yo maintain the integrity and accessitiity of student recurs through professiunsi service. We provide timely, accurate assisiance in elt matter relating to student Information management SARMS VISION Atuture where student records management is fully digitzea, secure, and accessibi. We asprre to set the standart for excefence in academic recoras services. Dietum WNTEGRET Unhoiting honesty ars wea! stendande in af cperancce SERVICE EXCELLENCE Geivering quay service thet exceeds expectaiins, CONFIDENTIALITY Provecting student intonation win the haghest sect, TEALINORK Calaborating ettecticely to achaeee nnthianca! obyectves CONTINUOUS IMPROVEMENT Seeiang baiter says to saree ieugh tmovation Odjectives 1 Eatabath censaretenswe stusontrocotcs menagerrert yates, (2 Procese af rtuden, Wanssctions wih Micency anni accuracy 3. Protect stucent formation wovgh robusi securty nasser. 4. Prove easing to enaure pictetcienas comamterce m corde punagerrent 'S Contououely improve systema and prorecires io annance arms quaity"
    },
    {
        "image": "manual1_synth_3_aug1.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING SRMO Operations Manual introduction: nerds Management Office. Ht nant withie font Ps witains opermenal gui istency, efficiency, and compliance in siudert mexonds manag ing of sitsinnt information. This edition, effective at jegislation and educational standards. SEMO maintains the Integy and secu Academia Year 2024 2025, complies with nal SRMO MISSION n the intogyl rough professional sevi ame zibility of student records 2 We E relating te studer? information management in ait vat SRMC VISION de managunset, knows tor rvecvation, affoasrey, ces ayant tat peavies seamless Tobe renignized ae a verter of exodtonce etudont ren and commamen dots necanty. We enaion 2 taciologsay at oceans white maraning pony Bicwm LACE Peesing proragt, caurtzeva, anid prcfensinnal cerive to at siasehators shreet slandsacts of honesty and ethical corset AITEGRITY Manteiving tie CONFIDENTIALITY Protecting tas mivacy and vecunty cf shatant formation EXCELLENCE Shiving te emntzccus imorevertent ane supaior Quay ACCOUNTABILITY Taking resp anc! yesaby 3 for sotioes wth vanapacenc: Objectives cond fal exrcted stucvata ik compliance wit CHED regviatons, 4, Maintain acc 2 Pronene atugent sesuesta fw academic doctraants ef 2. iriemest aecone aston for stotage axed protecson of atusentinicamaten, nd thorized personnes 4. Provide acsurate formation lo startenta, 0 5, Encune comgianes wth the Data Pri"
    },
    {
        "image": "manual1_synth_3_aug2.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING SRMO Operations M Laateadwe thom iooanak contais 0 james for the Sta Vas encures consistency utfiriency J eshte Ceanage of Fhursieas gity ard socurty of st oe Jona egiskven ang saucen on St 8 complies watt Readers teers theouah pet Jo maimann tne in penidy trey a ng fo stuctert SRO VISIO Neen dic paanog he hayhest tuatares fee goa etme nor wiTeGinT be wat aig sure aly tes sen a Hanepmeney 279 :ekaD FARLITY Takes tapes Objretives Bar tae aC RT PeITrSE TAS See atacetN Ss ranma no Eyccene atid 3 boywanart cacute eyatens fo storage ang ptetecton of ate ator aie cee carne ate ee Da hey"
    },
    {
        "image": "manual1_synth_3_aug3.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING SRMO Operations Manual ‘Tes ronal contains operetiona! geiceines for the Shaiont Rovonds Manayement Off fosures consistency, ficiency, and congbaace in student eeccrds managamant shin Salter of Morsing. The SRMO maintains the imogrity and sacurty of skitent information. This Acanteesic Year 20242003, complies with nasties SRRIO MISSION Fo malta the imeqrty and accessibity of sistent seco through pwotessional service. provide tinaly, accurate assistance in a matters mating ta infomation managment. SRMO VISION Tabs secgpized ata cee of eevehincs in akiden recente manages, knows ke eva, tiny, {6 comets a is teccthy. We anvisin a echraiogialy atvennes syaiem fal rovides eaniane BoceR8 aie maintaining arian: Pete SERVICE. Proving seurnnt, cnariecus, and penfer nal service to al siatchotiers, SYTESRETY tSsincaineng the higheat sioxiends ot hamosty anu asbiced cunt SORFIOENTIALI mn rowing the neway ant securky of enicant eformaten, Ubiecdizex {MBG accurate recarts of xt eseanc aniserts meumpbice wh GHED caspantinns 2, Pretusa student ments tor acaduente Sacserente ofc my 3. implant ancure ayes tor wioraye are piston cf ahi information Proviie accurate bSovnatiet to ohudects, fnoisy, and acnyezed agrsone! 4, naire compare wt the Daa Prvacy Aci af 2012"
    },
    {
        "image": "manual1_synth_3_aug4.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING SRMO Operations Manual Introduction: This manual contains operational guidelines for the Student Records Management Office. It ensures consistency, efficiency, and compliance in student records management within College of Nursing. The SRMO maintains the integrity and security of student information. This edition, effective ‘Academic Year 2024 2025, complies with national legislation and educational standards. SRMO MISSION To maintain the integrity and accessibility of student records through professional service. We Provide timely, accurate assistance in all matters relating to student information management SRMO VISION Tobe recognized as a center of excellence in student records management, known for innovation efficiency, ‘and commitment o data securty. We envision a technologicaly advanced system that provides seamless access while maintahing privacy, Dictum SERVICE Providing prompt, courteous, and professional service to all stakeholders. INTEGRITY Maintaining the highest standards of honesty and ethical conduct. CONFIDENTIALITY Protecting the privacy and securty of student information, EXCELLENCE Striving for continuous improvement and superior quaity, ‘ACCOUNTABILITY Taking responsibity for actions with transparency and reliably, Objectives 1. Maintain accurate records of al enroled students in compliance with CHED regulations. 2. Process student requests for academic documents efficient 3. Implement secure systems for storage and protection of student information 4. Provide accurate information to students, facuity, and authorized personnel 5. Ensure compliance with the Data Privacy Act of 2012."
    },
    {
        "image": "manual1_synth_3_aug5.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING anual RMO Operat egiity an cecutty of stude 125, complies with ir ihe integrity and accescibilty of siudant records through profeysional varices. We nee in all mailers relating fo student information manag CONFIDENT ni mformation, EXCELLENCE Striving te ADGOUNTABKITY Taking reapon: by for ac! Objectives accurate oF al enseer stisents in nd protection of student afore"
    },
    {
        "image": "manual1_synth_4_aug1.png",
        "label": "manual",
        "ocr_text": "GRADUATE SCHOOL SRMO Poitcies and Guidelines Manuai intraduction: Ths manual aueves as tho oMficial qudte for (SRMO} It caxttines policies, Stade records and acadecn Wis cnwual ensures compliance wath Academic Yaar 2024 2022 SRMO MISSION To mointain the wieority anc ac Brovide terely eccuaie assistance in a8 matiars SRMO VISION Te Darome Se moCe! ofc fy saudeei TeLores managere” Lorentrent to eccuray ord euowru eevee Wee tape eovecnnare Dictuw, PROFESSIONALISN Conducting manewen wi: Coreeten ACCURACY Eng SROURITY Soteguarang stasent etoemaacn agoest easiliity of student ecorts thy WG (rece ane cormmcmecs A a estore neererens ist Student Records Management Othra Gwdetres. cos starrtand aperating ie docsmentaiion within Suacuicte. Developed w accordance with CHED Memoxancken cho one nuticod standards Tide Forrdures toc managing oI the Data Privacy et of 2012 Silicon 4s gdated in Melati 10 student ctcamation management un Phage Nahar mcncaton, eatrguahed ty xe echecingy to create stitent certered 0. Courbeny, aed reanect 8 docurectitcn SFPSIICY Optmeng pronetes ts ont rey serve ceive’) WNOVATION. Embracing tectneiouw areiore Letycer 6: Objectives fer ae urate Prony ct nd cemctes Baie a1 constane oF uy cP Eh CHED repuisien e 2 Proce ehatert iegi ets ke Be Aseme axcaments athcenty 2 leetenent recice arshwin fo srsce ad ct Lien 4 Provele actwwate mtormatin to shaseas 1S Braue cometorce oth tre Data Pr acy Act 2082 ehcent romaton feeder at mamore ns perso!"
    },
    {
        "image": "manual1_synth_4_aug2.png",
        "label": "manual",
        "ocr_text": "GRADUATE SCHOOL SRMO Policies and Guidelines Manual Introduction: This manual serves as the official guide for the Student Records Management Office (SRMO). It outines policies, guidelines, and standard operating procedures for managing Student records and academic documentation within Graduate School Developed in accordance with CHED Memorandum Orders and the Data Privacy Act of 2012, this manual ensures compliance with national standards. This ecltion was updated in ‘Academic Year 2021 2022 SRMO MISSION To maintain the integrity and accessibility of student records through professional service. We Provide timely, accurate assistance in all matters relating to student information management. SRMO VISION Te become the model offee for student records management in Phlppine higher education, distinguished by our commitment to accuracy and superior service. We leverage technology to create a student centered environment. Dictum PROFESSIONALISM Conducting ourselves with competence, courtesy, and respect. ‘ACCURACY Ensuring precision and correctness in all records and documentation, ‘SECURITY Safeguarding student information against unauthorized access. EFFICIENCY Optimizing processes to provide timely service defvery. INNOVATION Embracing technology to improve services continuously. Objectives ‘Maintain accurate records of all enrolled students in compliance with CHED regulations 2. Process student requests for academic documents efficienty, 3. Implement secure systems for storage and protection of student information. 4. Provide accurate information to students, faculty, and authorized personnel. ‘5. Ensure compliance with the Data Privacy Act of 2012."
    },
    {
        "image": "manual1_synth_4_aug3.png",
        "label": "manual",
        "ocr_text": "+ nawetain accuse cers 2 Preesen shasect requeats ter irae ue pretences Aare pleat pace ys 4 Prove aoe 5. Greore compaones oe sereetonn ro ene, txt 308 ay COEGRIOE HE CHED SPIRO. serine convsnests ees auinonees pareanent, pn Prteasy fet of 2012"
    },
    {
        "image": "manual1_synth_4_aug4.png",
        "label": "manual",
        "ocr_text": "GRADUATE SCHOOL SRMO Policies and Guidelines Manual Introduction: This manual serves as the official guide for the Student Records Management Office (SRMO). It outlines policies, guidelines, and standard operating procedures for managing student records and academic documentation within Graduate School. Developed in accordance with CHED Memorandum Orders and the Data Privacy Act of 2012, this manual ensures compliance with national standards. This edition was updated in ‘Academic Year 2021 2022. SRMO MISSION To maintain the integrity and acces: of student records through professional service. We provide timely, accurate assistance in all matters relating to student information management SRMO VISION ‘To become the model offce for student records management in Philippine higher education, distinguished by our ‘commitment to accuracy and superior service. We leverage technology to create a student centered ‘environment Dictum PROFESSIONALISM Conducting ourselves with competence, courtesy, and respect. ‘ACCURACY Ensuring precision and correctness in all records and documentation. SECURITY Safeguarding student information against unauthorized access, EFFICIENCY Optimizing processes to provide timely service delivery. INNOVATION Embracing technology to improve services continuously. Objectives 4. Maintain accurate records ofall enrolled students in compliance with CHED reguations. 2. Process student requests for academic documents efficienty. 3. Implement secure systems for storage and protection of student information. 4, Provide accurate information to students, faculty, and authorized personnel '5, Ensure compliance with the Data Privacy Act of 2012."
    },
    {
        "image": "manual1_synth_4_aug5.png",
        "label": "manual",
        "ocr_text": "GRADUATE SCHOOL SRMO Policies and Guidelines Manual Introduction: This manual serves as the official guide for the Student Records Management Orfice (SRMO). It outlines policies, guidelines, and standard operating procedures for managing student records and academic documentation within Graduate School. Developed in accordance with CHED Memorandum Orders and the Data Privacy Act of 2012, this manual ensures compliance with national standards. This edition was updated in ‘Academic Year 2021 2022 SRMO MISSION To maintain the integrity and accessibility of student records through professional service. We provide timely, accurate assistance in all matters relating to student information management. SRMO VISION ‘To become the model office for student records management in Philppine higher education, distinguished by our ‘commitment to accuracy and superior service. We leverage technology to create a student centered ‘environment. Dictum PROFESSIONALISM Conducting ourselves with competence, courtesy, and respect. ACCURACY Ensuring precision and correctness in all records and documentation. ‘SECURITY Safeguarding student information against unauthorized access. EFFICIENCY Optimizing processes to provide tnely service delivery. INNOVATION Embracing technology to improve services continuously. Objectives 1. Maintain accurate records ofa enrolled students in complance with CHED regulations 2 Process student requests for academe: documents efferent 2. Implement secure systems for storage and protection of student noxmaton 4, Provide accurate information to students, facuty, and authored personnel ‘5. Ensure complance withthe Data Privacy Act of 2012."
    },
    {
        "image": "manual1_synth_5_aug1.png",
        "label": "manual",
        "ocr_text": "LEGE OF PUGINEERING AND TECRNOLGOY SARMS yes and Guidelines Manuai Pal Areroaue tear g evceas Managenon Ses! wing stusent Sat die Cot Gurae For the S Ts mera ISARMS: Asulines oviies Juidannes ant x socanen a cotds aid acave! as Daveinaaa in aceroance it: OMED Memorandom Ores and tne Ca suited on Aeagennc YOR\" nie! anaes commie mith Nawunar atardanas This wdibon wat SARIS MISSION 2 semive a5citnliy of stugent muons thrmugh proies so to student intoemahos seansgemert fo macriain the integyty side uenmly, accurate assistance in all matters vob GARMS VISION LE cent renoria manage pent 6 Mrikeyee rat Low tr arise Wek cevage tebe: 19 2ragie 2 tasent en Tenet) gc cuta y aret actos one pokeapeay teveee eM aeNraers Mastaren 92 Hapneat atonesios At Nonny ane SOR Buta: WALT Y Pootecteg me pracy a cercity 21 ance at tormence: oa HCE Sh8 he cor nOn eee cuenet ons nee ty COOUNTARNITY Taeeg tenes ir nigrs obs tanscm anes ore teeta, Odpertives as ection oestey oh Lane trp te ana contaninats Chenega arog SEO eatistonarevesron Praugh suede Sse Ea nanegurren 3 Poke sete Staten tetaide manager"
    },
    {
        "image": "manual1_synth_5_aug2.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF ENGINEERING AND) ECMBOLOGY SARMS Policies and Guidelines Manual Introduction: ‘Tis manus! sorves 95 tha official quide for the Striunt Allaire and Records Management Syste (SARNS) MLnubines poleies quidetinas, and ulanient operating proceiknas int manaming siden ngineering and Technology records andl arademic dscumentainn within Geilege of 2 Memorandum Orders and the (ata Privacy Act of 2042, thie pated in Accuinenc Year Devolopea im accordance sith manual sesutee compliance with satonal standards, Tews edition 2022 2028. SARMS MISSION To mainiain thw integrity and accessibiity of stent reconds through professional service. We peoskde tinaly, accurate assistance in ali maiters relating to student infuxmnation management. SARMS VISION “To become the intel attea for utadeat reccedy managuinend in Prieyine feher sduextion, cnteguctsed by our Seenibeot ko atseenay aoa gugeion servioe Wis kevneaze Taeelpy to creabs 3 vbatent center ever iHchaw SERVICE. Bhoebng peumpk, ouurtonan, and pesteewional verve Wd xtenaitees INTEGRITY Maintaning he highest atanaievie of nonexty nnd ethicat cont SONPIDENTIALY -Frctecting ie greracy ana uarcrty of stxdont eforrration Bree ‘Senep or centrucun impecvacnert anc apes quality ASCOUNTARLITY -Tetiny veszonsioity for antes wt taneparancy and retake GAppetives 1 Serve ws ie often nenasiny of a stoner? aeanorie recor 2. Fecdiate smacth srocoeaing ef shataal exasremee és 9. Minton hugrty am nection of mers esas, 4, Support netnatncal reeewrcth worse Wate shader date management 'S. Faber culewe of excedorce i atusnns resonls management"
    },
    {
        "image": "manual1_synth_5_aug3.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF ENGINEERING AND TECHNOLOGY SARMS. Policies and Guidelines Manual Introduction: ‘This manual serves as the official guide for the Student Affairs and Records Management System (SARMS) ttoutiines policies, guidelines, and standard operating procedures for managing student records and academic documentation within College of Engineering and Technology. Developed in accordance with CHED Memorandum Orders and the Data Privacy Act of 2012, this, ‘manual ensures compliance with national standards. This edition was updated in Academic Year 2022 2023 SARMS MISSION To maintain the integrity and accessibility of student records through professional service. We provide timely, accurate assistance in all matters relating to student information management SARMS VISION ‘To become the model office for student records management in Phiippine higher education, distinguished by our ‘commitment to accuracy and superior service, We leverage technology to create a student centered environment Dictum SERVICE Providng prompt, courteous, and professional sevice foal stakeholders. INTEGRITY Mantanng the highest standards of honesty and ethical conduct CONFIDENTIALITY Protectng the privacy and securty of student information EXCELLENCE Striing for contevous mprovement and superior qualty ACCOUNTABILITY Taking responsibity for actons wan transparency and relabilty. Objectives 1. Serve as the official repostory of al student academic records 2, Facitate smooth processing of student requirements 3. Mantam ntegrty and confidently of student records 4, Support insttutonal research through accurate student data management, 5, Foster a culture of excellence in student records management."
    },
    {
        "image": "manual1_synth_5_aug4.png",
        "label": "manual",
        "ocr_text": "LEGE OF ENGINEERING AND TECHNOL SARMS igelines Manual Policies and Gul de! teiredertion: 19 we Bre oficial PAGE Spe hg StgSNNt ANH and Reconts panagemsnt Syste epemures 1 managing shugent “this manual 92890\" reaping) tout canes stant eperained PP vg poche, SuRteHOe cm carage of Esginearng and Faannandy recurs as posse sacament2so? sat Developadin accensance wit CHER seaman Otets an tre Data PEE pet of 2042, ie vanes wien nauenal erasaros, FAS @BFSE ‘yas ungated Is Acaderés YRAE sual anasto comme ce 2020 2523 SARMS MISSION “To maintaie the integgity ard access grve in a8 inatiers meting eamation areNyeent grevige tinely, accurate 259 Saas VISION esbacinae te race tice for stecn rere? snanrarnet Peso ge aE ALIN, SACRE NEMS owe are ta accuracy are sure nero rege technciogy to ore 2 GER eneceurant Digtow nicest sexvine to 98 sakenoicers erate Proving prowek caetnos, ad Bree cegrecne¥- aici eget sancads oF NEA wE extioal sand conPIneNLaT 4 Prolene boy ae S80UY ander nee LECH. Senn he cones creer Bd Te AEDS scene aL Takang repe ame For ACIORS WA AARP ng sabe Ohpetives 1 gare on te ofteiaksegantiny of ab ster anatase 4 Foctlate emauti processing of secant Peurtenmss 5, tanta cingrly and conbcentinty of atadens ease 4. Seyaeetngtivtonaisaaeeact Hoe sonst 45 Fontes a cature of avoebunte ataler R228 ENTE"
    },
    {
        "image": "manual1_synth_5_aug5.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF ENGINEERING AND TECHNOLOGY SARMS Policies and Guidelines Manual Introdu: This manual serves as the official guide for the Student Affairs and Records Management System (SARMS). Itoutlines policies, guidelines, and standard operating procedures for managing student records and academic documentation within College of Engineering and Technology. Developed in accordance with CHED Memorandum Orders and the Data Privacy Act of 2012, this. manual ensures compliance with national standards. This edition was updated in Academic Year 2022 2023 SARMS MISSION To maintain the integrity and accessibility of student records through professional service. We provide timely, accurate assistance in all matters relating to student information management. SARMS VISION To become the model ofce for student records management in Philippine higher education, distinguished by our ‘commitment to accuracy and superior service. We leverage technology to create a student centered ‘environment, Dictum SERVICE Providing prompt, courteous, and professional service to ll stakeholders. INTEGRITY Maintaining the highest standards of honesty and ethical conduct. CONFIDENTIALITY Protecting the privacy and security of student information EXCELLENCE Striving for continuous improvement and superior quality. ACCOUNTABILITY Taking responsibilty for actions with transparency and reliability, Objectives 1. Serve as theofficial repository ofall student academic records. 2. Facltate smooth processing of student requirements 3. Maintain integrty and confdentiaity of student records 4, Support institutional research through accurate student data management 55, Foster a culture of excellence in student records management."
    },
    {
        "image": "manual1_synth_6_aug1.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING SSRD Operations Manual Introduction: ‘This manual serves as the official guide for he Student Services and Records Division (SRD) outlines policies, guidelines, and standard operating procedures for managing student records and academic documentaton within College of Nursing Developed in accordance with CHED Memorandum Orders and the Data Privacy Act of 2012, this ‘manual ensures compliance with natonal standards. This editon was updated in Academic Year 2021 2022 SSRD MISSION To maintain the integrity and accessibility of student records through professional service. We provide timely, accurate assistance in all matters relating to student information management. SSRD VISION ‘Tobe recognized as a center of excetence in student records management, known for Rnovation, efciency, ‘and commitment to data securty. We envision a technology advanced system tat provides seamless access whte mantaning pracy Dictum SERVICE Providing promt, courteous, and professional service fo al sakenokders, INTEGRITY Mantaning the highest standards f honesty and etical conduct CONFIDENTIALITY Protecting he privacy and securty of student information EXCELLENCE Sewing for continuous improvement and superior quay [ACCOUNTABILITY Taking responsibly for actone wih wansparency and retablty. Objectives 1. Manta accurate records of a eneoted stadents in comptance wih CHED regains 2 Process student requests for academic documents eficienty +. implement secure systems for storage and protection of student formation, «4 Provide accurate information to students, facut, and autorized personnel 5. Enawe comptance wih the Data Privacy Act of 2012,"
    },
    {
        "image": "manual1_synth_6_aug2.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING SSRD Operations Manuai Intredection. ‘This manuat serves as the official guide for he Shadent Services and Records Division (SSRO}. outines polices, guidelines, and standard operating procedures for mnanaging student records and acsdemic documentation witin College of fuursing. Developed 1 accordance with CHED Merorangum Orders and ine Data Privacy Act of 2012, thts manual ensures comphance with nationat standards This egiaon wos updated in Academic Year 2021 2022 SSRD MISSION To maintain the intogity and accessibihty of student records through professional service We provise timely, accurate assistance in ali maiters relating to student information manapernent SSRD VISION Tobe recegizet as 5 conker of axcetence m student reconts management, tnown for enovatn, efficiency, and conmmement 19 date wecurty. We e vaien 9 leciinainge my avencen aystom inet proreds seBmiess excees whie mantanns oematy Dicom SERVICE Provatng prome!, courteous, and proteescow terme to 2? sishauacere, WTEGRITY suintaneng De nghant siendards oF honwaly ant etheat conmct CONFIDENTIALITY Protecting the prtuacy and encurity of etudant information, EXCELLENCE Siting fee comtowcns ergrovement and wapecior Gray. ACCOUNTARCITY Toking respuneluaty for sete wen transparency an ratibity Objectives Hartam accurate recede of al earctee snvtents Wo cometance with CRED regen 2. Procens student requests tor acantemic documents aficsenty, 3. ngiement secure sysiens fr storage ana onaecten of shadent iamaton. 4. Provice accwate nvormaiion to atusents, aculy, art wnitrires pacsonnet 5. Erawe compliance win the Data Privacy Act cf 2012,"
    },
    {
        "image": "manual1_synth_6_aug3.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING SSRD Operations Manual Introduction: This manual serves asthe offcial uide or the Student Services and Ri cutines policies, Quidelines, and standard operating procedures for m academic documentation within College of Nursing, tecords Division (SSRD). It 'anaging student records and seaal ensures compliance with national standards. This edition was updated in Academic Year 2021 2022, SSRD MISSION ‘5 Ensure compliance with the Data Privacy Act of 2012"
    },
    {
        "image": "manual1_synth_6_aug4.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING SSRD Operations Manual Autroduction: This manu2t serves as the off outiinas nods Guide for the Stident Services ang Reconts ‘operating pracesuires ‘ellos of Nursing, Division (SSRO), 8 fai mansizing 3 Reirelings, ane stan: io decumentation within hse records ang bed in aeaedaance manual ensures com 2024 2002 IB OHED Merrerancum Crore ane the Date Privacy het of 082. liane with national standaras, This eation was SpCated in Acarienve ¥. SSRO MISSION sintain the integrity and ace essihil Provide tinely, securate 'y of student recon Sscugh professional s Student iatermstion view We aesis SERB VISION Ds cecognieit as a canto of exci Aus commana te data Becuriy, We ‘sc0908 whe mabsaning nvacy Bicton SERWC Fee a eebete Sanegs nbee, keaen tor neat, sticlene erie a tetcieaty advance syatem Brovides seamiess By MISOTe, courtenus, snd weleeeional service wf stokcahassers SITY Rita, the Aimee stand of horasty ace shal eonkict DENTIALITY Bhevacting the P80 sccurty of susiant exormatiy ENCE» Sting tar rehire smerwament ast susan gusty ACCOURTAWLIAY Taking cesconsiiy tor actnon With racapavency ani coat, Ohjeetives Fiaais acetate 8 ef af enatad stacents cocnsiance wits CHEE oe Process student requests fo avadens doevanenis efficient, fenrlerant socio ayslame to worse and ton of efudent starmaton, 4. Provide ane aids wiormstisn to wuts, to 84 ethos werent 8. Ensue ence Yoih Se Data Pomasey hetot 2012"
    },
    {
        "image": "manual1_synth_6_aug5.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF NURSING SSRD Operations Manual Introduction sifcial quude ov ine Studer lara operating pH9Pe 2 scusnentatio rwsthin Cotage oth yeoance with CHED pedi ace sth natenai stand S8RD MISSION jity vf sted re mall watiel sity a Yo mraintain peostdo Ene SSRD VISION To be reoe! 1g privacy mating tha tagnest sta EXCELLENCE Stn"
    },
    {
        "image": "manual1_synth_7_aug1.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF COMPUTER STUDIES ARSS Student Handbook Oudines policies, Guidelines, and standard ooersting procedure: sadeenic documentation wihin Cotege of Computar Stowe, Developed in accortance wiih “HED Skemorancum Oniers anc Ue (ata Pvwcy Actot 2012, is Sranual erscies compliance weth national standards. This eation was updetec hs Academic Yur 2021 2022, ARSS MISSION ‘To maintain the intogpity end accessibility f stutient veconts theough professional veriive. We Provise thnmly, accurste aesistance {n 98 mamters relating to student tormation management ARSS VISION: Atature wnere student records We aspire to set the standart Dietwm PROFERSONALISH Conc trg curveiret win competence, courany, and vespect accuRECY Management 's fully digitized, secure and accessinie. {OF excottenice in academic records services. Bower prectota sex ccrrectnees a0 recat ane Gacsamecistcn SECURITY. Sateen thet eat att ener mcene SP PICIENY Coty acto proe Mat ere dtvery POOUATIONtnecacr eto 8 mycoevaven carrey, Chpcctives \"Eva comacenrane sae recen anegenartsyane Pre AM MUsene Waban Wh eMcency and arcurney 2 Pretec shen emai 20g ohn eect enn 4 tron vance mens pres comets neces manana Centre torove sysons ana roceskees wo athance secs vty"
    },
    {
        "image": "manual1_synth_7_aug2.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF COMPUTER STUDIES To maintain the integity and accessibility of ‘al matters relating to student information provide timely, accurate assistance in ARSS VISION ‘Atuture where student records We aspire to set the standard for ARSS Student Handbook Introduction: ae eran ave sc ge be Next Rei wt SU STE ra re grr omg Penne mane ne caame documentaton witun cotege of Compu Suet rnvearnctance wm cn warn se DES AOL menual ensures compliance wit national standards. “This edition was updated in Academic Year 2021 2022. RSS MISSION student records through professional service. We management. 2 process af student wansactons win efcmncy ans #°<¥25Y +5. Protect student information rough robust SECU meBBER 4 Provide traning to ensure professional 5. Continuously merove systems and competence in records management. procedures to enhance service quaity,"
    },
    {
        "image": "manual1_synth_7_aug3.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF COMPUTER STUDIES ARSS Student Handbook Introductio ‘ational standards, This editon was updated in Academic Year 2021 2022 ARSS MISSION 'Y of student records through professional service We Provide timely, accurate assistance in all matters relating to student information management ARSS VISION A future where student records manat igement is fully digitized, secure, and accessible We aspire to set the standard tor exc ellence in academic records services Dictum PROFESSIONALISM Conductng ourseives wth competence, courtesy, and respect ACCURACY Ensuring precision and correctness in al records and documentation SECURITY Safeguarding student nformaton agaist unauthorzed access EFFICIENCY Optmaing processes to provide tmely service deivery INNOVATION Emoracing technology to mprove services continuously Objectives 1 Estabish comprehenswe student records management systems. 2 Process al student transactons wah eftcrency and accuracy 3 Protect student information through robust securty measures 4 Prove traning to ensure professional competence mn recotss management 5 Contruously mprove systems and procedures to enhance service qualty"
    },
    {
        "image": "manual1_synth_7_aug4.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF COMPUTER STUDIES ARSS Student Handbook introduction: This manuat serves 2s he official guide thr he Academic Recorus #nd Shident Servicus (ARSS). tt culines poticies, guidelines, ana stancund aperating proceduias for managing stwaant records and academic documentation within Callege ot Computer Stasis Developed in accordance with CHED Mnmorandum Orders and the Data Privacy Actot 2012, vs manuat ensures comatiance with nasons! sténcacds, This eaiton wes updated in Acadainic Yaar 2021 2022 ARSS MISSION To maintain the irogilty and accessibility of student records trough professional sevice. Wa provide timely, accurate assistance in ai mettars relating to student inamation managemett, ARSS VISION Afulure where student records management Is fuly Wigitzed, secure, and accessiole. We aspire to set the standard for excellence in academic records services, Dieta PROFESSIONALISM Contuetng curselver wih compaterce. courteay and vespeck ACCURACY Ensuring nzromion and comectnees af recceds and sncumertation SECURITY Ssteguarcing student hforewion agaist unasthorized a c958. EFFICIENCY. Optinaing arocetats to provide tracly service every INNCVATION Embracing tecteciegy te imovove services coninucsty Objectives 1. Eslsttan commrenenaiva stator tessece marogemnert systare ‘2. Pracess af student vansactions with eflinency and accuracy. 3. Plect sadertinkurmation Prough butt secrty menses, 4 Fonte waning to erature pretnanionn comomtence i cecarts managment 5. Contauozsly wncrove ayatems and procedures to entwnve service Quai."
    },
    {
        "image": "manual1_synth_7_aug5.png",
        "label": "manual",
        "ocr_text": "SOMPUTER STUDIES ARSS Student Handbook Introduction: ed Stuclant Services ARES). ‘Oard aerating procedures fer managing shucentrecsias and gs ot Computer Suutios F292, this in cational shandars, This edition was ungated in Academie Year ARSS MISSIO! To snaintain the integrily and acces provide tinaly, accurate ass tity of student seconds through oretessional service, We Matters relating te stusien! information n snagement tance in ARSS VISION unue where student We aspire to ards inanagentel {the standard tor excellence in academic secure, ang accessitie ‘orcs ses wih competence, couteny, and aspect ACOURACY Eneuring precios ans correctness w abrenairs and. oneoatan, UPITY Safeguarding stusont on agaist wnauiverizas ances, FICSRHCY Optancing pcuceszen ma pine tel servicw d INNO CTIGH Embraning tectowiogy io irareve nerve: soerenuoly Ghjoctives blah covaprehensive student records macagement 2. Process it ckaieat tansactiona wit elfeieacy 2, Protest afedent information thei rokunt sewurly ea Brewis talon ty encure professional competent sreverds management 5. Contranuniy improv aystems ans wocetures to enhane!"
    },
    {
        "image": "manual1_synth_8_aug1.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF ARTS AND SCIENCES SSRD Policies and Guidelines Manual Introduction: This manual serves as the official guide for the Student Services and Records Division (SSRD). It ‘outlines policies, guidelines, and standard operating procedures for managing student records and academic documentation within College of Arts and Sciences. Developed in accordance with CHED Memorandum Orders and the Data Privacy Act of 2012, this ‘manual ensures compliance with national standards. This edition was updated in Academic Year 2021 2022. SSRD MISSION To serve as the official custodian of student academic records. We uphold the highest standards of accuracy and professionalism while supporting students throughout their academic journey SSRD VISION ‘To become the model offce for student records management in Phiippne higher education, distinguished by our ‘commitment to accuracy and superior service. We leverage technology to create a student centered environment Dictum PROFESSIONALISM Conducting ourselves with competence, courtesy, and respect. ACCURACY Ensuring precision and correctness in allrecords and documentation SECURITY Safeguarding student information against unauthorized access. EFFICIENCY Optimizing processes to provide timely service delivery, INNOVATION Embracing technology to improve services continuously Objectives. 1, Establish comprehensive student records management systems, 2, Process all student transactions with efficiency and accuracy. 3. Protect student information through robust securty measures. 4. Provide traning to ensure professional competence in records management 5. Contnuously improve systems and procedures to enhance service qualty"
    },
    {
        "image": "manual1_synth_8_aug2.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF ARTS AND SCHENCES SSR. Poticies and Guidelines Manual Introduction: he aficiss J Services ant Renords Givision (SRUF os, and standard oper ing stucent zeconts and gusting atnin Coliege of Arts and hig mareal oer procedures for maneg! ouinen solic rie documentation w science: acai developed to ancort temargniumn Orars anc the Nate Peivary ASHE bis rem? evga coragaance witb sakow: sianares. TH dion was updated in Academie Y98E 2024 2022. SSRD MISSION ‘Te seve au the offciat cuninaian of enscant aeatene yds, We uphold the highest standards of ‘gqouracy snd profassionation while supparina s rey secaegve Hehe CANES LOUIE SRD VISION free education, dings y 20° ap semana Poi ‘wis everage tecrnciaay 10 creat foi shen ghadend comsved ro tvenome to corel fg pusueeey ard superar Fever oommenaent enusrsrent Gictane pan resgiontaLish Gendccting noreaves wah SPINA souttagy, Ane espe “agouRAeY thawing prea ane corectaens eRe oe secumatati secur Salgusding suse orn agai ane 8 acces. EFPIORINCY. Optimizing processes 10 reevH E Emly FRCS sever ove sarvises eoninucunly WAHOWATION Objectives «_eavennan conorearave sae 2108 RAEN 7S process at wbsdent ezowatiione win alfcinny aml OCIS cgi votes Secu MEDS 4, Protect etudent formation cheosionad eoerpetense PIECES MAEM ans 2 4 Decne tren uns eeoconunes to enhance serving sly ‘5 Comics imyews aysten"
    },
    {
        "image": "manual1_synth_8_aug3.png",
        "label": "manual",
        "ocr_text": "UGLLEGE OF ARTS AND SSRD Policies and Guidelines Manuai introduction This manial serves ae the ofciat guide forthe St i outings p01 2 pre c ad ans Developed in accomiance with CHED Momorandum Or manual e 024 2022. “a with nationel sta in Academic Yeat rag comple SERD MISSION To seive as the custedian of shident ation whi aemic 8. We uphe pighesi stardards of oughout thelr academic jou AD VISION ths moved office far sh rent Io arcu ste aw Dieta SIONALISN. Consucting ourselves with ADCURACY Easuring 7 SECURITY Satequavding hy tent incemation egeinat urauineroad access EFFICIENCY Optimizing processes to pravie timely ser ATION Embracing t ‘Ghfectives 2 ae sixtent venenctions with effeimney aw! aceurany 2 stafon! anrmatin trea ny measwes, jo trating to ensure pro manegeinant Sonitsaoueny iuprave sysiems und process to entoes vice quay,"
    },
    {
        "image": "manual1_synth_8_aug4.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF ARTS AND SCIENCES SSRD Policies and Guidelines Manual fatraduction: This msnnat serves as the othclas quitia for he Student Sanvices and Records Division (SSR) oultnes policies, guidelines. ond suundaré crerabng procedures tor managing student recoras and acadumi: docunsantator, within Cotiege at Ars ano Sciences Developed in accordance with CHED Memorangum Orders and the Data Privacy Act of 2012, tris, manus! ensures compliance witt nazonat standatds. This edition was updated in Acagomic Year 2021 2022. SSRO MISSION To serve a: the ciicial custodion of student acagemic records We uphard the highest standams of BecUTAcy ana prolsssionalisin while supporting studenss tioughout thelr academic journey. SSRO VISION To beccnve tne madel ofice tor stinsent ecores manayensent in Shipping hafver eoueaiion datagsehed Dy aw camentient to accuracy ard muperes service. We leveract Vectnulouy te create a stutert caeret et tevcenment, Dictum PROFESSIONALISM Cond ctry: ourrelven with conpelence, coutesy, and reapect, ACCURACY Eneuring preciion an correcinwas in a8 records avd documentation, SECURITY Safeguarding cadens niemation apainat unauthoreen acceas, EFFICIENCY Optimizing processes to provide trnety service daierery. INNOVATION Emiaceg vechnangy to enarive sceviows conamens y, Objectives 1. Prantoh comscahennicn stucant ree ue macaayenart evsteins 2. Proceas at atudact waneaeions wan aelaney and accuracy. 2 Protect sbalert atcaranion Prougn subst aecw ty meme 4, Prove tating '2 aceuls promsors compmteres arace ds marapemert 5 Contessousiy enprave aystens and procecures 12 enhance cevvice qually."
    },
    {
        "image": "manual1_synth_8_aug5.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF ARTS AND SCIENCES 88RD Policies and Guidelines Manual traduction: ic (SSRD) iuclentroconds and academic documentation within Colioga of Aros and Seiences, Davetsped in ancurdance with CHED Nenorandum Orders and ihe Data Privacy Act of 2642, 2 meanuat ensures c ce with national atzncards. This adition yas upaated in Academic Year 2one 2n22 SOR MISSIO! To curs ay the official cuslodian of student academic records. We uphold the righest ofa accuracy atid profeasionatisin ahife sunporing stidents throughout treir academic journey. SSRD ViStON To become the mods ofee for student recoids management in FPappinw hai education, ietngiuthes by owe commen te aceureey airs eugerior servkis, We leverage tech et a sluceni cuntered envieanent Bieter PROFESSIONALISM Corshucting wurveves wit competence ROCURAGY Roauring precision ant sorectneus iret eecnres and documentation SECURNY Satquaniang eumtent otra syuinat uutiarred access, iY Optimizing proceasue to prota temiy servers datvery. FNRIOVATION Embracing tecteilagy *o improve servines conticnusty Ghjeciives 1, Saleen comprehensive student tecurds mangement systens 2. Precienk AE stodent eanauritn wnt tency avd a 2. Protiet ahucent information trguah robust aacutty maaeires, 4. Provide taining io ensure professional compete 19 tw enhance sacvice gusty. 5 Continaously mrave eyetens an procs"
    },
    {
        "image": "manual1_synth_9_aug1.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF Bl JUSINESS ADMINISTRATION SARMS Student Handbook student records af “The SARMS is committed 10 -Tnese guidelines are based on SARMS- MISSION “To maintain the integrity and provide timely, accurate ass! SARMS VISION ‘future where student re We aspire SAMS) Operations Manual 1 Afairs and Records ‘Management System processes and procedures related to ists students, faculty, and nd academic services. efficient, accurate, af staffin understanding student information. nd secure management of institutional policies ‘the Data Privacy Act, CHED regulations, and i accessi stance in is tullydigitzed, secure, and accessible. cords management in academic records services to set the standard for ©"
    },
    {
        "image": "manual1_synth_9_aug2.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF BUSINESS ADMINISTRATION SARMS Student Handbook"
    },
    {
        "image": "manual1_synth_9_aug3.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF BUSINESS ADMINISTRATION SARMS Student Handbook Antroduction: Weicomne to he Shien fairs anc Records Managumoni System (ARMS) Operations Manual. ‘This guide anaists students, faculty, and stain understancing proceseas ana proomdunes rotated to Student recomds ard academic services, The SARMS ts commulted 1 efficent, azcurate, and secure menagemont ot siudent informavon Those guidelines are based on te Data Privacy Act, CHED regulations, and insthitonal polices: SARMS MISSION ‘To maintain the integity and accessibility of student records thmugh professional service. We Provide timely, sccursie assistance in a matters wlating to student intorroation managment SARMS VISION A future where student records management ts fully digtized, secure ana accessitte ‘We aspire to set the standard for exceitence in academic records services. Otc PROFESSIGNALISM. Conauctny vernatras wih corpetence, courtery, and reepect ACCURACY Ensuring preciaion ana correctness in ab records and documentation SECURITY. Satacunning student bdurmaton against enamored acces. EFFICIENCY Optrinng scceasas m provide lam Bervece Geivery INNOVATION Emtracng tectnoiogy to mprove rervices contnucushy Objectives 1. Serve 28 ine clon sepostory of of student academe recocs. 2. Fettate srieath procesniog of dees rears (3 Mewtar mtegrty wis contueraaty of sieart teceray 4. Svonet national rostereh Wrough accurate seasen da manazerart Fonter 8 suture of ercetence m student rescrde managemset"
    },
    {
        "image": "manual1_synth_9_aug4.png",
        "label": "manual",
        "ocr_text": "COLLEGE OF BUSINESS ADMINISTRATION SARMS Student Handbook Intraduetian: aicome t ne ‘Stcent Aare and Records Manageanent Systems (SAPMS) Operations Marat ‘This Quid assists shsents wena i tercanten orcas un pocedees noes ‘Sassen records ene academic services erent, accuraia, ang. The SARMS Is commented ‘These ‘on Die Date Fvacy, Sacre management of sugent information, Widelows are based ‘Act CHED regulations, and incite tonal pauses SARMS MISSION sence ct ace ae ns gh psa ence We Annoy, sce eltncs na mates nb ester Moreno SARMS VISION D Seve 8 oP costo ae aa recone 2 Fectiae wrcch moreeting uf stertsendremans 4 Movtan eget ne cotta osteo recone SOE oe een ep se Hate ts renagenoe 5 ter ern ncn mss recede merge"
    },
    {
        "image": "manual1_synth_9_aug5.png",
        "label": "manual",
        "ocr_text": "BUSINESS ADMD WSTRATION SOLLE SARMS Siudent Handbook Istrieinction oicoane to the Stedent fairs and Reconsh saanagement Systarn (GARMS} Daarations Man ris guide ats students fasts, and STA FT vrnderstanding provesens and procedures rotaied 12 rds and academic servicas. shdent 1300 niga to aMlexert, nocurate, and S¢ sed on te aa Privacy Ast, The ARMS is co\" These quigetines ore SARMS MISSION ional service. We ation management of stadent records throug pial fag te student inh Jn the intogilty wna access! ance in at matters tet ‘Fo mei provide timely, accurate a SARMS VISION sible ry sigitized, seoute, ans is Tut st records management S in acader stature where stuce we aspire to set th tor excellent Dich PROPESSIONALIEM Condi deg ennetves wi cpa, ecimasy, Hehe -gerneny 1 ak records 2nd documentation. AoQURRO Baaurng arcing 20 sareqting shade itoration spiel unas 12° se ‘optimbing procanses to provide anely aBvE® epee vost song tachmokegy to arprave Hervises CO INNOVATION fmt <mnjecties ofisiat pantry of ah lucent academic recon 4 Serve ea Oi cessing of student requirements 5 Bacebate aman D a Motes una ent corona of suas (era «4 Sogpert tutional casearch Besaigh Secure hat aba mICETEN 5 anucesmt aye 0 axcotenice in staan’ eT"
    },
    {
        "image": "manual2_synth_11_aug1.png",
        "label": "manual",
        "ocr_text": "OFSICE OF THE REGISTRAR F ABSENCE POLICY CTICOM IMPLEMENTING 5 Student eave Guide 1 Paes The Student Leave HS Hes: Bean stablished to provide clear and #16 iesplementation of manual rafiects comprehensive iucat welfare, eee! acieninis lostheotion: F commtmars fidence efficieney ative sitiance with Repurtic da, th ps ation Act of 1984) and su subsequent CHES academic and admicistanive pao niabitity ameOrk ensure: od with integrity are transparency, 3 This manual addresses the proved: various aspec ews, tegiuinemerts, ond guidelines ther govern th ecisionmaking °g a9d ensures anifotrn app of Siixiert leave guidelines. prow 1g Hotaitars tool for neesses, H serv seatlal Ne policies outlines herein ba reer developer thes fensive consul Petsonne! Re Sen relevance and sttectiveness in inctoding focuity ave ton with sak oh evaluation and meeting the instiiution s ribets, studem administratiy, will be undensken 15 maine educational odjectiv fective Academic Year 2022 2099 th Previon manual ecotnes. the inti related matters, replacing alt alt Hesuances and guidelines Berg the sects OF BS mpm of 5 are CaN Covnge ef Comal seston Page tone"
    },
    {
        "image": "manual2_synth_11_aug2.png",
        "label": "manual",
        "ocr_text": "OFFICE OF THE REGISTRAR COLLEGE OF CRIMINAL JUSTICE EDUCATION LEAVE OF ABSENCE POLICY PRACTICUM IMPLEMENTING Student Leave Guidelines ‘on the implementation of institutional policies within College of Criminal Justice Education. This manual reflects our commitment to academic excellence, student welfare, and administrative efficiency In accordance with Republic Act 7722 (Higher Education Act of 1994) and subsequent CHED memoranda, this policy framework ensures that all academic and administrative processes are conducted with integrity, transparency, and accountability. ‘This manual addresses the various aspects of student leave guidelines, providing detailed procedures, requirements, and guidelines that gover these processes. It serves as an essential tool for decision making and ensures uniform application of policies across all departments. “The policies outlined herein have been developed through extensive consultation with stakeholders including faculty members, students, and administrative personnel. Regular evaluation and revision will be undertaken to maintain relevance and effectiveness in meeting the institution s ‘educational objectives. Effective Academic Year 2022 2023, this manual becomes the authoritative reference for all ‘elated matters, replacing all previous issuances and guidelines, M _ Legal Basis ‘The aserty tr tos poey maul 8 Sew tm te fohowing igs! and mathatonst secon: 1 Rape At Mo. 7722 The Hager Evasion Act of 1004, which estabianes he Commansion on Higher Eavcaton and preven for me puter o nape ener wuinters 12 Revert CHED Memerantion Onders and Crear presenting poscis. standard, and queinas for higher education te ores 3. Repute Act Mo. 10173 -Data Povey Act of 2012, mandating te protection ant ecuety of persana ata mehaing went tomato «4 instant Mandate and Adtarty an presented nthe Unverty Char nd approve by he Commasion on Higher Eaveaton, 1s Bear Reston No. 2020 22. sanoreng te formulation and mptomentstion of en poley manual witin Colage of Comins Nate Kacaton Page tof 8"
    },
    {
        "image": "manual2_synth_11_aug3.png",
        "label": "manual",
        "ocr_text": "OFFICE OF THE REGISTRAR COLLEGE OF CRIMINAL JUSTICE EDUCATION LEAVE OF ABSENCE POLICY PRACTICUM IMPLEMENTING Student Leave Guidelines Hh Rationale ‘The Student Leave Guidelines has been established to provide clear and comprehensive ‘on the implementation of institutional policies within College of Criminal Justice Education. This manual reflects our commitment to academic excellence, student welfare, and administrative efficiency. In accordance with Republic Act 7722 (Higher Education Act of 1994) and subsequent CHED memoranda, this policy framework ensures that all academic and administrative processes are conducted with integrity, transparency, and accountability. ‘This manual addresses the various aspects of student leave guidelines, providing detailed procedures, requirements, and guidelines that govern these processes. It serves as an essential tool for decision making and ensures uniform application of policies across all departments “The policies outlined herein have been developed through extensive consultation with stakeholders including faculty members, students, and administrative personnel. Regular evaluation and revision will be undertaken to maintain relevance and effectiveness in meeting the institution s ‘educational objectives. Effective Academic Year 2022 2023, this manual becomes the authoritative reference for all related matters, replacing all previous issuances and guidelines. I, Legal Basis “The author fr this poScy manual is derived rom the folowing legal and insttutona sources 1. Repub Act No, 772 The Higher Education Act of 1008, which estabished the Commission on Higher Eaton and proves for the regation of higher education instutions. 2. Relevant CHED Memorandum Orders and Ciculars presenting polis, standards, and guelnes for higher Prippines 4. Regube Act No. 10173 Data Privacy Act of 2012, mandating the protection and secuity of personal data inching student cscaton athe tomaton 4: sttutional Mandate and Authority 2s preserbed inthe University Charter and approved by the Commission on Higher Education +5, Boar Reston No. 202022, uthrzing the formation and implementation ofthis poSey manual wihin Colege of Criminal Justice Eeveaton, Page 1 of 8"
    },
    {
        "image": "manual2_synth_11_aug4.png",
        "label": "manual",
        "ocr_text": "OFFICE OF THE REGISTRAR COLLEGE OF CRIMINAL JUSTICE EDUCATION LEAVE OF ABSENCE POLICY PRACTICUM IMPLEMENTING student Leave Guidelines 1 Rationale The Student Leave Guidelines has been established to provide clear and comprehensive guidance on the implementation of institutional policies within College of Criminal Justice Education. This manual reflects our commitment to academic excellence, student welfare, and administrative efficiency In accordance with Republic Act 7722 (Higher Education Act of 1994) and subsequent CHED memoranda, this policy framework ensures that all academic and administrative processes are conducted with integrity, transparency, and accountability. This manual addresses the various aspects of student leave guidelines, providing detailed procedures, requirements, and guidelines that govern these processes. It serves as an essential tool for decision making and ensures uniform application of policies across all departments. The policies outlined herein have been developed through extensive consultation with stakeholders including faculty members, students, and administrative personnel. Regular evaluation and revision will be undertaken to maintain relevance and effectiveness in meeting the institution s educational objectives. Effective Academic Year 2022 2023, this manual becomes the authoritative reference for all related matters, replacing all previous issuances and guidelines. H Legal B ‘The author fortis coiey manual is cervas fom the folowing legal and insttutona sources: 1. Rapubie Act No. 77 the regulation of higher education institutions. ‘The Higna Eouoaton Act of 1804, whionextabishes the Commission en Hignr Esuoation and provides for 2. Relevant CHED Memorandum Orders and Circulars preserting poicis, standards, and guidelines for higher education in the Poppies. 42, Republi Aet No, 10173 Data Prvaoy Act of 2 formation mandating the protection and security of personal data incising student 4. Institutional Mandate and Autocity as presorbed inthe Unversity Charter and approved bythe Commission on Higher Education. 5, Board Rascuton No, 2020 Esveaton _authorzing the formulation and implementation ofthis poly manual within Golege of Criminal Justice Page 1 of 8"
    },
    {
        "image": "manual2_synth_11_aug5.png",
        "label": "manual",
        "ocr_text": "OFFICE OF THE REGISTRAR (COLLEGE OF CRIMINAL JUSTICE EDUCATION LEAVE OF ABSENCE POLICY PRACTICUM IMPLEMENTING Student Leave Guidelines 1 Rationale The Student Leave Guidelines has been established to provide clear and comprehensive guidance on the implementation of institutional policies within College of Criminal Justice Education. This manual reflects our commitment to academic excellence, student welfare, and administrative efficiency In accordance with Republic Act 7722 (Higher Education Act of 1994) and subsequent CHED memoranda, this policy framework ensures that all academic and administrative processes are conducted with integrity, transparency, and accountability This manual addresses the various aspects of student leave guidelines, providing detailed procedures, requirements, and guidelines that govern these processes. It serves as an essential tool for decision making and ensures uniform application of policies across all departments, ‘The policies outlined herein have been developed through extensive consultation with stakeholders including faculty members, students, and administrative personnel. Regular evaluation and revision will be undertaken to maintain relevance and effectiveness in meeting the institution s educational objectives. Effective Academic Year 2022 2023, this manual becomes the authoritative reference for all related matters, replacing all previous issuances and guidelines. H Legal B ‘The author fr this posey manual is derived rom the folowing legal and insttstona sources: 1. RapubSe Act No, 7722 The Higher Edveation Ast of 1904, which estabsshed the Commission on Higher Eaton and provides for the regulation of higher education institutions. 2. Relevant CHED Memorandum Orders and Circulars preserbing polcis, standards, and guidelines for higher education in the Prippines. 3. Republe Act No. 10173 -Data Privacy Act of 2012, mandating the protection and security of personal data incluing student Information, 4. Institutional Mandate and Authority as presorbed inthe University Charter and approved by the Commission on Higher Education 5. Board Resolution No, 2020 22, authozing the formulation and implementation of tis poScy manual within Colege of Criminal Justice Esveation Page 1 of 8"
    },
    {
        "image": "manual2_synth_12_aug1.png",
        "label": "manual",
        "ocr_text": "STUDENT AFFAIRS OFFICE COLLEGE OF COMPUTER STUDIES ADMISSION REQUIREMENTS: PRACTICUM IMPLEMENTING sucort azeayen Process 1 Hancoale ines ten stvasent scinivaicas process within This policy manual establisnes compratensive (sade consistency, traneparency, ond feemneas Cateye of Comenter Studies, tis derigned 12 aneie ‘the mplementation of acadeirie police and orocedures Theo developinand ot this manual isin ceaponne t the ped fer standardized processes tet CHER) regulations and institstiona’ standards We compty wath Ceeneriasion on iigher Eaucation ve provid laa iertin: to shales acuity, ane aastinive sta reer) et rignes, responsitiities, and procedures the officia reteconce for ak matters rstating to student ads ston process commutator, with academic dupartronts, scent 1s to ensure is raevence and etivctivencss [Ad provistons hevwin ore atigniec with the unversfys mmission and vesices of providing cuatity ede ston andi maintaining acadarnic exceience Rear ardvew orn! uptates ai bee conducted to rence cunvinuad compliance sith excizing «cic sions SASHES are MANY ropdrenarss peumic Yoo 2024 2005 mpd suparsadas a previous versions, A8 pactest to (amiSariae tharvacteve sith ane adhere t2 This manual serves 05 Whhes been carchity devetcped through organizations, and udrrinietrative of Tres edition is effective Ac: members of the gcadane community 29 &7 the policies Cuttined in tts mana cannaree 2 te Wsere age aascenes term mca em wd Laeming he ean 2 CoE) tamarwncon ose Parma Hone sete auny nmanes agent SPD pnd sent eters Mare wanes nes ceweney D0 cohen wn we oe gem em AEG 4 aguas nee 19175 (Dama Povey AN eae Te «s ocenty Cran Prong te age townsen ae Ba agate sven pease OnE ty me eenaranens a esenercticr neaseree Dounce Min pean We TEDIES, ame sw sarge ted inphemarnsnss 2 gewey Mares We TES ane bones"
    },
    {
        "image": "manual2_synth_12_aug2.png",
        "label": "manual",
        "ocr_text": "STUDENT AFFAIRS OFFIC COLLEGE OF COMPUT ADMISSION REQUIREMENTS RAENTING shale Aeoisains ProCens PRACTICUM IMPLE i Rationale This arasah eC tADENT eS: comnprahensive agunetions for studert atiminsictt Process thin: Softee of Computer Stutias, IS piged Yo enesue constancy, FOFPOFERSH: set falinass in genre. powesee ond EISCEGUTES plerventation of 329 “The development ofthis mast 72 ply th Commiesion a Highs Ecc aime to pride car eration 10 procishins sropansittition, ard F This mond serves ag the off i has been caretly developed jor, ured acintatiet oh gh pela aoe are igre she university s piscton ora eqiuestion egal mvmetaheng acaioris excallerce Regedar review caped upstate rt continast compilane? with evelvini sstucations stardans aed regulatory Tees standardized processes thet agi standart. It thew aghts, reaponse to the nena Ho (CHEDY seguations and inst cui, ered aceinesicstive Stal sagan rg eating to shdont acmieston ROSS iy acadtesc dapartments, shiek and effectiventss. ied vakorance for at ral theough consuttation val es to anpure tie welavanee oh precineg oly 5 lt be conducted 1 ag35 and supeasanies RESON sessions, Af ven wit ane 2ohare (O lag teens deze. Year 2326 soonsrty Be 6 carnal This edition 0 affective Act rrvamtbers of the acacertc the pevictes outlined in this F i Legal Basis al net ws tbe ney PES samptanee eon sa ET, _peniitt a08 EE Pes tpneianny rarer oa PE ep ot a 7128. re Eee of candacin, a sates oan BPM een Poise 4 Gen arrenins Cotes PORES pen sg qty avez, AMS pac SE espn) cone ste ot teach pee te ten AD gous any Sm 4. Rep fot 0 ce heen ae pet cer “a wcvaty ona Freese en al go insta cage sa van ct wns ere gage, emsning 9 es 4 we page tat acute Deane Ronse AF"
    },
    {
        "image": "manual2_synth_12_aug3.png",
        "label": "manual",
        "ocr_text": "STUDENT AFFAIRS OFFICE COLLEGE OF COMPUTER STUDIES ADMISSION REQUIREMENTS, PRACTICUM IMPLEMENTING student Admission Process 1 Rationale This policy manual establishes comprehensive guidelines for student admission process within College of Computer Studies. It is designed to ensure consistency, transparency, and faimess in the implementation of academic policies and procedures ‘The development of this manual is in response to the need for standardized processes that ‘comply with Commission on Higher Education (CHED) regulations and institutional standards. It ‘aims to provide clear direction to students, faculty, and administrative staff regarding their rights, responsibilities, and procedures ‘This manual serves as the official reference for all matters relating to student admission process It has been carefully developed through consultation with academic departments, student organizations, and administrative offices to ensure its relevance and effectiveness ‘All provisions herein are aligned with the university s mission and vision of providing quality ‘education and maintaining academic excellence. Regular review and updates will be conducted to ‘ensure continued compliance with evolving educational standards and regulatory requirements, This edition is effective Academic Year 2024 2025 and supersedes all previous versions. All members of the academic community are expected to familiarize themselves with and adhere to the policies outlined in this manual Legal Basis ‘hes manual ued wader th athorty of and w complance wih te fotowng legal atnanents 1 Reputie Act No 7722 (Maher Eaucaton Act of 190) -Estabishng he tamewart fer hgh education aémnstaton and reguaton ne Pracoees 2 CHED Memerancim Onsen -Parseiaty hove rising 10 qulty assurance, academe standards, and student were hohe 2 Reputhe Act No 10179 (Oats Prvacy Act of 2012)- Governing the colacton wae. and protection of perons! formation mekiing 4 Unversty Charter Proving the egal foundation and autonty fr the estabishment and mplementaton of msttvtona pokes an reguatons ‘5 Acateme Counet Resokton No. 72 2024, proving the adopton and mplementaton of ths pokey tamewart Page tof 14"
    },
    {
        "image": "manual2_synth_12_aug4.png",
        "label": "manual",
        "ocr_text": "STUDENT AFFams OFFICE ‘GE COLLEGE OF Coney Stuns: ADMISSION REQUIREMENTS 4 IMPLEMENTING sersens pcrmsion Rationate This polly inanval astabtishes compredensive Sudelinss for student admission proses within puter Stuiss. itis designed te ensue cansiatas mmariation of academic policies ant pecedures The devsloprent of thy manual I in respceise to the nea for stares Sean wh Comission on Higher Education (CHED: aims to pravice ctear direction ta students, fac fasnonsibtities, and oraceduns, tearsparney, ard tainess in adlzat processes thet feqdations and instituonal stacdards It ‘ly, and ediminisirative staff negarling tei its, This manual eves an ihe officiel refwsace for aif {thas been carefully develonod througls vansultatie ganizations, and aniats matlers celating to student admiest OP process, with academic depactments, student relevance and effectivenass Wve offizas fo ensure its AS penisions heaein are aligned wit the univer education el maintaining academic sxcesiar: Snsuma contiomad compliance with avoiving 4 ‘his ection is atioctive Acadanilc Year 2024 2025 and Supersedes all peovious versions. All pombers of the academic communtiy are exnented to tanita themselves with and adhore to ths policing outlined in this manual Be Legat Basis ‘Sano aa 19 oaborty a ont came Lith ten tge ois f ARDANE At Se 728 ator Ei fof 998 Eaton tn enranr ee Si aceon sanitation nes nipitice ts Presengs 2 OED Neeerenie SEPA ous ming gay maine. nnd send, an USE te fae 3 Rags Bathe. FoAT8 see Sevaey sat ot Sate sna, Se webcast sent pre cement Y hares Prestng es ttn sn sey epticone Fe etter ad ighamaetison of nthnna eg a 1 Academie Coane Resehdan Wa, 12. sevreong the asin a encanto tha ey tarnan,"
    },
    {
        "image": "manual2_synth_12_aug5.png",
        "label": "manual",
        "ocr_text": "STUDENT AFFAIRS OFFICE COLLEGE OF COMPUTER STUDIES ADMISSION REQUIREMENTS, PRACTICUM IMPLEMENTING ‘student Admission Process. 1 Rationale This policy manual establishes comprehensive guidelines for student admission process within College of Computer Studies. It is designed to ensure consistency, transparency, and faimess in the implementation of academic policies and procedures. ‘The development of this manual is in response to the need for standardized processes that ‘comply with Commission on Higher Education (CHED) regulations and institutional standards. It ‘aims to provide clear direction to students, faculty, and administrative staff regarding their rights, responsibilities, and procedures. This manual serves as the official reference for all matters relating to student admission process It has been carefully developed through consultation with academic departments, student organizations, and administrative offices to ensure its relevance and effectiveness. Al provisions herein are aligned with the university s mission and vision of providing quality ‘education and maintaining academic excellence. Regular review and updates will be conducted to ‘ensure continued compliance with evolving educational standards and regulatory requirements. This edition is effective Academic Year 2024 2025 and supersedes all previous versions. All members of the academic community are expected to familiarize themselves with and adhere to the policies outlined in this manual H _Legal Basis Ths mara asued verte ahorty ofan in comphance withthe flowing ga estrone 1. Republe Act No. 7722 (Higher Education Act of 1904) Esabishing the framework for higher education imitation and region inthe Pragpnes 2 CHED Memorandum Orders Parity those relating to quaty assurance, academic standards, and student welfare ghee eascaton nations 13. Republe Act No, 10173 (Data Privacy Act of 2012)- Governing the colecton, use, and protection of persona information meluing stucent reco 4. University Charter Proving the egal foundation and authoty forthe esabishment and implementation of nstevtonl poles and regaatons 5. Academie Counei Reschtion No. 72 2024, approving the adoption and mplementaton ofthis polcy framework Page 1 of 14"
    },
    {
        "image": "manual2_synth_13_aug1.png",
        "label": "manual",
        "ocr_text": "STUDENT AFFAIRS OFFICE GRADUATE SCHOOL ADMISSION REQUIREMENTS PRACTICUM IMPLEMENTING stsert ‘admission Process 1. Rationale ‘This poliey manual provides the framework for student admission process within Graduate ‘School Trestablishes clear standards, procedures, and guidelines that ensure quality, consistency and 1 and institutional regulations compliance with national need for systematic and transparent jes that directly affect students’ ‘academic progress and welfare. It regulations, requirements, and procedures into a single authoritative ‘The creation of this compreher implementation of palic consolidates all relevant document. ncils, student representatives, and administrative fence of the academic community, It ing compliance with Developed in consultation with academic co4 sfices, this manual reflects the collective wisdom and experi incorporates best practices jin higher education: administration while maintain CHED standards. Al policies and procedures outlined inthis manual are designed to suppor the institution s ‘commitment to academic excellence and student success. They provide clear pathways for <tadents to achieve their educational goals while paintining high standards of academic integsty edition takes effect in Academic Year 2022 2023 and shall remain in force until revised oF This superseded by subsequent issuances 1. Legal Basis spemmatnsnaa nse vance neem we eer TS cottage tamer x ger aveston son 208 ES 1. Repu het No. 7722 (Wher Eeation Ae ot 1008) inthe Pripenes 2 ncn memorandum Ones Paty hse reaing 1 ul) A casei standart, 2d student wetae in BGP ceucatoninsttions. 13, Repub Act No. 0173 (ata Privacy Ae of 2012) Governg me coseston AS and protection of personal formation neleg student records 4 sr pungent tne eros nmr SNS regations. ny tramenct Page 1 of 14"
    },
    {
        "image": "manual2_synth_13_aug2.png",
        "label": "manual",
        "ocr_text": "STUDENT SEFAIRS OFRICE ADMISSION REQUIREMENTS NG 4 IMPLERE PRACTICU Bat sake cass within Graduate Senoc! tency, and tha Famewark for student sdinission This policy manual orevide: 5 thal ensure quality, cons at staridat ana in edtes, ated establishes ch coanpliance with 9 entation af pol ates dooument, relevant cegulations: natwes, and vith academic councils, student represe of the ncariamnle comm 1e¢ in cansoitatios reflects the collective wisdom and experi this best practices set education administration white maintaining comptanee with esigned to son s They provide clear pathways for jemic integrity apport the inst ntlined in ths raany cellence and student utile meintaining high st dans of ac educational go Year 2022 2023 and shall remain in fore until revised or This edition takes eftect ia Acadert a sen ef persona wtoraton ie"
    },
    {
        "image": "manual2_synth_13_aug3.png",
        "label": "manual",
        "ocr_text": "STUDENT AFFAIRS OFFICE GRADUATE SCHOOL ADMISSION REQUIREMENTS PRACTICUM IMPLEMENTING suse omaeen process ee pon nc Yor 23209 ate ae 8S Superseded by subsequent issuances 1. Legal Basis un mares a ances rina ments pum eto 772 ape East het HA) ne Pracones cuey Venere oor Panes ener we) ASE eoseme start ocean menor 1 mapas het te. 1073 oa Prva Met of 2) coven neers es 4 Ueernty Cnaeer never e ee tec ne meer me ans enes paonton No 67 2022 eecery ves oe mgr 3 Pt Page 114"
    },
    {
        "image": "manual2_synth_13_aug4.png",
        "label": "manual",
        "ocr_text": "STUDENT AFFAIRS OFFICE GRADUATE SCHOCL JISSION REQUIF MENTS PRACTIC! M IMPLEM indent Acissinn Process ‘ovides the framework for student admission process within Graduate School ia policy manual pr fees stablishes clear standards, procedures, and guidelines that ensure quality, consistency, and Jamngilance with national and instituifo al eeguiatione stematic and transparent The creation af thls comprehens anes implomentation of policies thet directly a and wolfare. it 2s ail relevant roy 28 and procedures into a single authoritative Developed in consultation with ac councils, student representatives, and admiristraiiv erie commn: offi this man: «i exparience of t iy. fe nce with best practices compli CHED siandards, silnulion s clear pathways for dards of academic integrity ct in Academie Year 202: til revised or went issuances. u sis esis Set No 7 tea Mat of 1808 acvoantuin Onies “Paint tena 1 4. Unversity Grantor Pen ting 5 Boatenia Goan Reason No. 7 2 Pege 1 ord"
    },
    {
        "image": "manual2_synth_13_aug5.png",
        "label": "manual",
        "ocr_text": "STUDENT AFFAIRS OFFICE GRADUATE SCHOOL ADMISSION REQUIREMENTS PRACTICUM IMPLEMENTING stent Admeson rovers, L Rationale ‘This policy manual provides the framework for student admission process wahin Gracuate School. Mt establisives claer standards, proceduies, and guidelines that ensure qual ty, consistency, and compliance wih natiana! and institutions veg tetions Wwe croation of this comprshensive manus addresses the need lor systematic end transparent implementation of policies thet directly atfect students’ academic progress and welfare. !t consolidates a relevarit regulations, roquire nents, and procedures into a single authxtave cocuinert, Developed in consutation with academic councils, student rapeasentatives, and acirinistrative offices, this manual reflects the collective wisdom and exparience of the academic community. tt incorpormes best practices in higher education administration while rosiaining compliance with CHED stendaris All poticies and erecoduras cxtined in this manue! are designed to support the institution s commvitment to scadsmic excallence and student success They provide clear paitways for stusents to achieve their educationa! gosis white maintaining high standaris of academic integrity This ecition takes effect In Acadernic Year 2022 2023 and shalt remain in force until revised or suoenaded by svesequent Issuances Legal Basis Th aed oP eed inter ihe amet ot avi m Somplarte Ah the Lowy Oye natn ment:: 1 Pepitie Act Me. 7722 igs Feveaton Wt of 11) Extabbeing te tenn evan far nga wesnahCn sbcemieatcs md Mth fe Mesa 2 CHRD Menownudam Cedi Fonte) one ung 0 guy atswaree, aeademc sancants, ane suaNn witre ion eee neces 23 Repu Ast Ne. 10173 (Osta Pruaey Act of 2012). Geneming he etesson wa, aod puecten of yarns! domaine behing aeatert rea, 4 Unersey Chater Paving the ng teratoma Stent fr the nabbed implemen nasa Behn Yd orgensers 5. Aenteric Coract Resehtin Mo ST 2022, aarsvi a atounon and inglempcttiun ef et pascy Fame. age ot 16"
    },
    {
        "image": "manual2_synth_14_aug1.png",
        "label": "manual",
        "ocr_text": "ACADEMIC RECORDS MANAGEMENT OFFICE (COLLEGE OF BUSINESS ADMINISTRATION ENROLLMENT POLICIES AND PROCEDURES PRACTICUM IMPLEMENTING fomenest tenagenant Spstere 1 Rationale This policy manuel provides the frarework fe: envoliment managerrent system win Cotoge of Business Administration. astablzhes clear standanis, prococres, and! guidelines thot ensure qality, consistency, and compliance with national and insiitutiona seguiations. The creation of this comprehensive manual addresses the need for systematic end transparent implernentation of polictes that diretly alfect students’ academic progress end welfare. it consclicetes aif retevant reguiatinns. requirements, and procedures into a singe autnortatv document ‘This ection takes effect in Academic Yowr 2021 2022 and shall remain in force unt -evised or Supormadied by subsequont issuances a Legal Busts ‘Tae tty tt pohcy mart Carr tom the folowing age! aid Potnctona sees,"
    },
    {
        "image": "manual2_synth_14_aug2.png",
        "label": "manual",
        "ocr_text": "ACADEMIC RECORDS MANAGEMENT OFFICE BUSINESS ADAUIG TEA Tiogs ERROULMENT POLICIES 4) PRACTICUM Imei in UA BiOvIdes the framowa! Ht estan snanagement sy Des Clear Stanswds, proceduies, ard guidelines tier srsure iO) Nations! and institutional regulations suaity, consisterey, anc co Hie Need for aystematio and enis azadenic proms 3, and pescodures transpaten 8 aiid welfare, It consolidates all relevan document nt Fequiations, remsremuy intO Single authedative urls Student <8 the ccllactive wisdom and expe 8S 9 higher education adrainint resented 8, this manual rf incoiporstes best prac CRED and administratva \"8 Of the academia com, ously ration white snaimtatning eomplisense yobh invad in thie macuad ic excel ate oe goed te NCe and student success, They ‘ational goats whitn maint Supeo the institution s brovide cleur pathways foe if edu: ing high standards of acar ie integrity The esfition takos affact in A Superseded dy subsequent i ademic Year 2623 wanes, 2023 ans a Legal Basis Ways EAS wattcrens someon es Ms T33 ve mepation SB ROREE CMED Macrarcim Cc and Gest sensei saiont. ance a Pregeres Baier to nah we Biers Resa cee"
    },
    {
        "image": "manual2_synth_14_aug3.png",
        "label": "manual",
        "ocr_text": "ACADEMIC RECORDS MANAGEMENT OFFICE COLLEGE OF BUSINESS ADMINISTRATION ENROLLMENT POLICIES AND PROCEDURES PRACTICUM IMPLEMENTING Enrotment Management System us Rationale This policy manual provides the framework for enrollment management system within College of Business Administration. It establishes clear standards, procedures, and guidelines that ensure ‘quality, consistency, and compliance with national and institutional regulations. ‘The creation of this comprehensive manual addresses the need for systematic and transparent implementation of polices that directly affect students’ academic progress and welfare. It rervalidates all relevant reguations, requirements, and procedures into a single authoritative document. Developed in consultation with offices, this manual reflects the coll incorporates best practices in higher CHED standards. Al policies and procedures commitment to academic exc Students to achieve their educational goals wrile maintaining high standards ‘This edition takes effect in Academic Year 2021 2022 and shall remain in force unt revised or superseded by subsequent issuances. ‘academic councils, student representatives, and administrative lective wisdom and experience of the academic community. It ‘education administration while maintaining compliance with outlined in this manual are designed to support the institution s ‘llence and student success. They provide clear pathways for of academic integrity. I. Legal Basis Tne axthoy for he pey manual is derived from th flowing legal and isttutona sources 1. Repub Act No saa The Her Easeaton het of 194, which establahed he Commission on Hohe Eaventon ard pees 1 the mpdation of higher education instintions, 2. Relevant CHED Memorandum Orders and Cxeulars preserting pois, standards, and Pracones. 4. Repubbe Act No. 10173 Data Pvacy Act of 2012, mandating the rection a guidelines fot higher education nthe curt of personal data including student (nformation. «4 lnstavionat Mandate and Authoty 28 preserbed nthe sdation and implementation of this posey manual witin Cobege of Business Page 1 of 15, University Charter and approved bythe Commission on Higher Esueation ‘5. Board Resolution No, 2006 21, authoring the form a"
    },
    {
        "image": "manual2_synth_14_aug4.png",
        "label": "manual",
        "ocr_text": "ACADEMIC RECORDS MANAGEMENT OFFICE COLLEGE OF 2US E95 AOAMETRATION ENROLLMENT POLCIES AND PROCEDURES PRACTICUM IMPLEMENTING et ee 1 Rationaic Devucped in constion wih academic counchs, student rapasectaives, and admintecive ctlices, this menual retects the colectiva wisdom and axporience of ‘pet while maimaining high slanderds oP academic integrity This edition tons atfect In Academic ‘Yoon 2021 2022 and shat remain in fovea until revised or SUDSTSOJed by Subsequent issuances. He Legul Bosis Ta sooty a Mn patey manatsdareod rem Oe tow gal an etnies sees Cimento EE Th pas Gran att 18 a xb Comey en Hap Eso se pvt ON easton of Nga wsaraten erencere J Remar CM tamed Caton aa Cotas poverty chon, sardth, oes yet hr Wi acs he Pare 2 Rewstie Nes Me 19079 Data Prva Set ot 200 2. mcdving he weecton and nec efpecvore daa waht statent eemaee hecnemeal Mamtace wes haart eons i tw Unewany Chae an samved By te Canesten oo Hee ses Beard Reneioner Me. 2008 21, axtonaing te fossa tnd emetatan o! the Holy mama wee Cassy of Devens Amara Foge iat 3s,"
    },
    {
        "image": "manual2_synth_14_aug5.png",
        "label": "manual",
        "ocr_text": "ACADEMIC RECORDS MANAG! coh CF BUSINESS ADMINISTRATION AnD PR @8NT POLE URES BNROLLA ICUM IMPLEMENTING zretmont tiacegement System PRA’ 4 2 within College of wides thw framework tor anvallment management xy as clear standarts, procedures, and guidelines that enue ‘This policy manual p: Business Administration, it eetablish: qusity, consistency, and coaspllance with nations! and inetitutional requ! aes ihe need for systematic and transparent nesdiemic srogress and welfaie. H ‘The creation of this comprahensive mi implementation of policios that direntiy atfec consolidates all relevant regulations, requirements, anc procedures into a single authoritative document ctademnic councils, stusient representatives, and administrative: ive wisdom and expailence of the academic convnunity. tt ration while mainiaining compliance with cont with facts the coll 28 Developed in coi vffiogs, this manual incomorates best practi OHED stand: [AM policies ancl grocadures sailined in this manual are designed to aunpert tive ins commirnient to acadornis exceltonce and student succuss Thay provide clear pathways: for gernie Year 2021 2022 and shit rarasin in lores until revised oF ‘his auition takes othe superseded by subsequent ff Lega! Basis aad Sed fm the fang mga ns neta ances The mane te is pat ctin act No. TIM. Tea tiger Edoraon Het of 1004, nbien antaviniion te Connie on Pighee Eduction a prove fot fa sepcine of igs esacion nt 12. Reinvaot OHED Menesanen Covers and Gnosis erenriing pela, sianaine, and gaiteinns fe hee eaeGn he rasp, ancaig he eracton an sere of peenona Gata ine sing st 5 Repos ia {0559- Raa Prssay ba and evn ty she Gennaio ae High Bato, 45. freien Stansate i arty an prance a fhe Urey vain Casaye a Bored Racehtan No, MCE\", wshuraing Se faenaton sed eaeeaaton oP poy aH Asrnseatir Page tof"
    },
    {
        "image": "manual2_synth_15_aug1.png",
        "label": "manual",
        "ocr_text": "STUDENT SERVICES OFFICE COLLEGE OF BUSINESS ADMINIS TRATION LEAVE OF ABSENCE POLICY, PRACTICUM IMPLEMENTING Sadent Leave Guisennes f Rationale This policy manual provides the framework fer stintent lenvo quidalines wethin Catlagn of Business Administzation esiabhshes ciew standaris, procedures, end guidelines that ensure quatily, consistency. and compliance with nsticral cnd institutions) equations, ‘The creation of this comprehensive inanus! addroxses the need for systematic and transparent implementation of policies that directly altect students’ academic progress and weltone. it congoligatus ail relevent regulations, requirements, and procedures into a singte auihosunive: document Doveiaped in consutiation with academic counci s, student reurasentatives, and adawustrative cffices, this macual riects the collective wiedcwn and oxpmionce of the academic communt y, it competes best practices in highes education edministration while msintairing compliance wth CHED standente Ail pabcies ond procedures outined in this manual ore designed to supe the institution s commitment to academi¢ oxcelence and studest success They provide cleat patioways for stxtends to actiave ihm: educator quois wavle maintaining righ standards cf academic: integety This edition tikes affect in Academic Year 2021 2022 ani sha rennin in force until revised or superseded by subsequent i2suances He Lepat Bs is Tha mraty for poly masa done Heo Kwing Nope an mani scares 1 Reptte Aut Mo 722 -The Ngee: Evagnen Mel of TOL whan encnieiet a Comm atin se Meg Leveaion we peices ty a enpdaen of ge whae mn satsitene 2. Rraars COMED Maw euanes Cnhes Se Aba RNs BALLER ACRE ke ENR Sor Ng ecu Oe 3 Rapeahs keto 9 79 Data Pray Ae e207 mandnton th peaacton an veoty pumene eR medwny Bacar stemame 4 earcsa assis ane KAUN ab erent’ 84 Usiceny Charatan Ace ty ie Comimatn 9 High Baten. 1 nue Peseutor Ne 261, aaranainy te tema ant pment ty Bakcy mia! nthe Cage of Bowens Page tots"
    },
    {
        "image": "manual2_synth_15_aug2.png",
        "label": "manual",
        "ocr_text": "STUDENT SERVICES OFFICE COLLEGE OF BUSINESS ADMINISTRATION LEAVE OF ABSENCE POLICY PRACTICUM IMPLEMENTING Student Leave Guidelines 1 Rationale This policy manual provides the framework for student leave guidelines within College of Business, Administration It establishes clear standards, procedures. and guidelines that ensure quality consistency. and compliance with national and institutional regulations, The creation of this comprehensive manual addresses the need for systematic and transparent implementation of policies that directly affect students’ academic progress and welfare It Consolidates all relevant regulations. requirements. and procedures into a single authoritative document Developed in consuitation with academic councils. student representatives, and administrative offices, this manual reflects the collective wisdom and experience of the academic community It incorporates best practices in higher education administration while maintaining compliance with CHED standards ‘All policies and procedures outlined in this manual are designed to suppott the institution’ commitment to academic excellence and student success They provide clear pathways for students to achieve their educational goals while maintaining high standards of academic integrity This edition takes effect in Academic Year 2021 2022 and shall remain in force until revised or superseded by subsequent issuances, HW Legal Basis The mamery fort py manus sewed hom a ohowng gto matter sowcen 1 Recuate Act No 7722. The Magner Eaveaton Act f 184 whch enabinned te Commation on Meper Eaucaton and proven ter Oe ropuaton of mapas eascaton matttors leevirt CHED Memerenein Onsen Crear prserting pleas standarsh an pateines ter meer ecccaton me Precores 3 Repuote Act Ne 10172. Duta Prvacy Act of 2012 mandating he protector and secty of perma cata nekcing sasent inetnsiona Maraate and Astor on prevented he Unvernty Charter and approve by tte Commanion on Harer Eavcaton 5 oars Resohton No 2008 21 aumerang th formation and mplementaton of th pohcy manus! wenn Colege of Bares Aemnavaton Page of 8"
    },
    {
        "image": "manual2_synth_15_aug3.png",
        "label": "manual",
        "ocr_text": "STUDENT SERVICES OFFICE COLLEGE OF BUSINESS ADMINISTRATION LEAVE OF ABSENCE POLICY PRACTICUM IMPLEMENTING Student Leave Guidelines 1 Rationale This policy manual provides the framework for student leave guidelines within College of Business ‘Administration. It establishes clear standards, procedures, and guidelines that ensure quality, consistency, and compliance with national and institutional regulations. ‘The creation of this comprehensive manual addresses the need for systematic and transparent implementation of policies that directly affect students’ academic progress and welfare. It consolidates all relevant regulations, requirements, and procedures into a single authoritative document. Developed in consultation with academic councils, student representatives, and administrative offices, this manual reflects the collective wisdom and experience of the academic community. It incorporates best practices in higher education administration while maintaining compliance with CHED standards. All policies and procedures outlined in this manual are designed to support the institution s ‘commitment to academic excellence and student success. They provide clear pathways for students to achieve their educational goals while maintaining high standards of academic integrity This edition takes effect in Academic Year 2021 2022 and shall remain in force until revised or superseded by subsequent issuances. Legal Basis ‘The authocty fr his potcy manuals derives rom the fofowing egal and nsttutonal sources: 1. Repue Act No. 7722 The Higher Education Act of 1904, which estabished the Commission on Higher Education and provides for the regulation of higher education institutions. 2. Relevant CHED Memorandum Orders and Circulars preserbing policies, standards, and udeines for higher education in the Proven 3. Republe Act No. 10173 -Data Privacy Act of 2012, mandating the protection and securty of personal data including student 4 Institutional Mandate and Auhorty as prescribed in the Universty Chater and approved by the Commission on Higher Education 5. Board Resolution No, 200821, authorizing the formuiaon and implementation ofthis poScy manual wahin Colege of Business Asmneraton Page 1 of 8"
    },
    {
        "image": "manual2_synth_15_aug4.png",
        "label": "manual",
        "ocr_text": "STUDENT SERVICES COLLEGE OF BUSINESS ADMINISTRATION OFFICE ‘Ai policies and procedures To peademic excellence and student SUCCESS ae cn et Yo 0 2 sna nae ASS superseded by un Legal Basis senor on py ae cette eg ne TST ve Raean 2 poe 1. Rape het Wo. 7722 The Hep EOS te reqatin of ter eoseaton MaRS 12 Reevaet CHED pecores Rape het Mo. 10173 Data Prva Met ‘5 Boars Renohsion No 20062 oe nents, wt gstoen tr ap won oS emerention Ores and Creda eens SS sermon pct ene rn"
    },
    {
        "image": "manual2_synth_15_aug5.png",
        "label": "manual",
        "ocr_text": "STUDENT SERVICES OFFICE COLLEGE OF BUSINESS ADMINISTRATION LEAVE OF ABSENCE POLICY PRACTICUM IMPLEMENTING ‘Student Leave Guidelines I Rationale igned to support the institution s They provide clear pathways for ing high standards of academic integrity Ai eaton takes effect in Academic Year 2021 2022 and shall remain in force until revised or ‘Superseded by subsequent issuances H. Legal Basis"
    },
    {
        "image": "manual2_synth_16_aug1.png",
        "label": "manual",
        "ocr_text": "OFFICE OF STUBENT DEVELOPMENT couse: OF ARTS ANE Si sce ORAD NG SYSTEM AND Pou PRACTICUM IMPLEMENTING acasers Gracing Stance L Ridion THis policy manual provides the frame and Scinnces tt establishes cte nsistency, and i for academic grading ar Standards, procedure npllance with nationa’ aad institutional regulations tandards within College af Aas and guide 8 that enst tial, creation ofthis comipreheneive manual eddresses tha need for sy policies that directly aflect matin ae franspar stud S ant welfare. i at regulations, requitemerts, and procedires into 2 single autho doo ‘dent reprasentatives, and adm! offices, this ne experience of inistrative I refiscts the collective wisdom ay omraunity. iseomperates best practices ia cation adtninisiration wale maintaining compliance: with HED standards \"ed 10 Support tha jes ©. They provide clewr peihways for Stinients to achieve their educational stamiands of eeadainis inteon goals whi y This edition superseded 078 202 and shail Fomaits fn force until reviged or a. Tie minal sae wade action oF an ee pee th Te era at xcomde Repute betta, 72 igre Eoveaton aes 2 904) 2 ‘nthe Prone Sagar msaton street we agua 5B Menioransum Sede Fania tore ming io asaty mateaice seas 202 Gevaert obec a8 and ethan of person on omiaing Grater. Proving te ep Seon wd ett 4, Araonmie Coun Regatten Noo se rea the scan ans metemenaion of iba geity tamevots Page tof"
    },
    {
        "image": "manual2_synth_16_aug2.png",
        "label": "manual",
        "ocr_text": "OFFICE OF STUDENT DEVELOPMENT COLLEGE OF ARTS AND SCIENCES GRADING SYSTEM AND POLICIES PRACTICUM IMPLEMENTING ‘Academe Grading Standards L Rationale"
    },
    {
        "image": "manual2_synth_16_aug3.png",
        "label": "manual",
        "ocr_text": "OFFICE OF STUDENT DEVELOPMENT COLLEGE OF ARTS AND SCIENCES GRADING SYSTEM ANG PaLicies Rationabe This policy manual provides t a0 Sciences it establishes clage st andere Within Catega of Arts consistency, and 'Srdatds, peoceaies, aed ouidetis The cretion of this Comprehensive manta implerwenistion cf pebcns ‘uderts' academic prosrans ant welfare tt eorcotidates at relevent seea5us the need for systomatic and tanspruent hat racy attoct “eelatons. renperarerte. ara pre Secuneet 8 HORS 9 Sipe autbesitative Derrahopt i consutatinn, rerensertatives, and ae ninvstative etian@ of the acadamic community ty wnistratice wile maintaining compsiance ith At policies ane orcas cttined in chis DSA Ow designed to sun GOR the institurce s Comat neat (0 academic mcoilance ay! stunt Success They provide clea: pathways for SMudants to acliave their oi atte maintsicion tam siwndants of academe integnty, This edition takns etfect ‘C0 70 2021 set shat remain in torce unt revised a Legal Basis TOP 8 ta ee 4 nano of ome henge ee Roa wa anaes 9» Rape i My PS Reepmer ES Berton set Hs POM Foinss A307 onan e cmacten wag eC peta tem oe iy"
    },
    {
        "image": "manual2_synth_16_aug4.png",
        "label": "manual",
        "ocr_text": "OFFICE OF STUDENT DEVELOPMENT COLLEGE OF ARTS AND SCIENCES GRADING SYSTEM AND POLICIES PRACTICUM IMPLEMENTING Academe Grading Standards implementation consolidates ail relevant Developed in consultation with offices, this manual reflects the incorporates best practices in higher CHED standards i pina procacres etn tis anal eno SFE Pe Ty commitment to academic excellence and student sadents to achieve their educational goals while maintaiing ‘This edition takes effect in Academic Year 2020 2021 and superseded by subsequent issuances, Ls Legal Bases um mats end re ety nd compan wm en a IS Tr nen 72 pep enn e188) en A SE noe Pacers +2 CED Memeranon Cntr Prtesiaty eve sing 0 ty UREN. mentee stancart, 2nd start wire oem eaters 2. Repu Aat No rn oa Pay At et 22) Cmerig aan a, me pt es eA tent recor ee pty net onan nny he ma en 8 ES eet 5 Acateme Comet Reventon No se, approving e tng snd mgemarason te ptey ame Page tof 12"
    },
    {
        "image": "manual2_synth_16_aug5.png",
        "label": "manual",
        "ocr_text": "OFFICE OF STUDENT DEVELOPMENT COLLEGE OF ARTS AND SCIENCES, GRADING SYSTEM AND POLICIES PRACTICUM IMPLEMENTING Aceaense Gracng Stardaeis 1 Rationale This policy marust provides the framework: for acadomic grading standards within College of Ants ond Sciences. Westobishes clen starters, pracechrus, arc guidelines that ensure quality Consistoncy, aod compliance with national and institutional regulations ‘The creation ofthis comprahensive manal adckesses ths naad fr systematic und Mansparert limplomentstion of policies that directly atiect students’ academic progress and wie. ft Consolidates al retevart veqations, requoments, and procecices Ino single ahoriative document Developed in consutatton with academic councis, student topresentatives, art adminivirative cfees, this manuel reflects the colective wiadom and experience of he acaderie community ‘ncerpexates bast practices i higher eckscation administration while maintaining compionce with CHED standecds, All policies end procedures outined in this mance! aw dasigned to support the institution s comntznent to academic excuilance and student suceaes. They provide clear pathways for Statrons to achieve thie ec ationel goals wee maintaining high standards of academic ntegity ‘This edition takes effect in Academic Your 2020 2021 ‘nd shali remain in force unui revised o ‘Superseded by subsequent issuances H Legal Basis The mara sd oar ares of ad compharce wth downy igs womens LR Aa Ne TE cepes Biscason hat 1806 Escaotng re Sarna Mes wasn meron a mate bbe Prigpines SEAS Merten Cae, Paicdaiy a eg ally Ment seen wants. shat eae m bahar Peco rociatent Sr Ne Ne HHT Sia Pavey ht d2133 Covernrg a teen, st. ad tein pense Mtameten vety seart veecats A Smear «Prog ie 5 tonseion ant aateety fs 9 esther td tnenetsi of nso penn 0 secre Aeateria Crue? Reventon Nc. $2035, seyavng a Neption we br ghemaeininn of tn pele; tamanee Page vert?"
    },
    {
        "image": "manual2_synth_17_aug1.png",
        "label": "manual",
        "ocr_text": "ADMISSIONS AND RECORDS OFFICE COLLEGE OF ENGINEERING AND TECHNOLOGY ENROLLMENT POLICIES AND PROCEDURES PRACTICUM IMPLEMENTING Envotment Management System 1 Rationale This policy manual provides the framework for enrollment management system within College of Engineering and Technology. It establishes clear standards, procedures, and guidelines that ensure quality, consistency, and compliance with national and institutional regulations The creation of this comprehensive manual addresses the need for systematic and transparent implementation of policies that directly affect students’ academic progress and welfare. It consolidates all relevant regulations, requirements, and procedures into a single authoritative document Developed in consultation with academic councils, student representatives, and administrative offices, this manual reflects the collective wisdom and experience of the academic community. It incorporates best practices in higher education administration while maintaining compliance with CHED standards [All policies and procedures outlined in this manual are designed to support the institution s ‘commitment to academic excellence and student success. They provide clear pathways for students to achieve their educational goals while maintaining high standards of academic integrity This edition takes effect in Academic Year 2023 2024 and shall remain in force until revised or superseded by subsequent issuances Legal Basis ‘The maorty fr tha polcy marut 9 Senet the tohowng apa and rattitena sowces 1 Repstie het No 7722 The Mgr Easeaton Act of 1904, when estabiahed te Commasion on Higher Eaton an proves for ie mepistn of hope ecto masters 2 Reievart CHED Memorancin Orders an Cecio presenting poten, standarah, and gadeines for ghar waucaton cones 1 Repu het Ne 10173 Data Prey Act of 2012, mandanng the protecton and secwety of pervs cae mensing stent etomaten «4 steal Mandate and Autonty a8 pronertad ma Unverty Charter and aproved by Commas on Magner Essen 1 Bowe Reventon No 2084 23, asmonang te formation and mpmentaton fhe pokey mart wane Cotage of Enpreeeng and Tectroegy Page tof 1S"
    },
    {
        "image": "manual2_synth_17_aug2.png",
        "label": "manual",
        "ocr_text": "ADMISS ONS AND RECORDS GFFICE nee oi EOHNO! GINEERING At ENROLLMENT POLIGIES AND PROCEDURES PRAC This policy manual agement system within Ce ced Enginessing and nd guleotne ensure quality, consistency ional regulations, The creation of this comprehensive manual addiesses the need for sy implemen tht directly alfect student nie progres: consol lations, requ and proceriures inte document eloped in c resentatives, and administrat es. this manu: incorporates be sdam and experience of the academts oramenity while maintaining compliance with D standar uppoit the institution s ess. They provide v 3 while inainta usient ar pathways for mic integrity nigh stancaris of ‘This edition tshes effect ‘ea 2022 2024 and shell remnain in fore sin! oF superseded by subsequent issuances B Legal Basi spe ut Na, YIZD. The Maas Sésennn Pt of 194, ui etait the Caomiion a Higher Esenion ad prow fr Redeion’ GHD Romerancun Grears hs Ciel tgs ates ay Bet of 2082 arson dts netainy ster 4 fowtnvions Mansa ang Rutonty a proses mth: Univers Ghee wel anervae ay te Cannes on Migr Biuomon 18 Pecos i, 200425, sutneing the tonnutt (soko ma 9"
    },
    {
        "image": "manual2_synth_17_aug3.png",
        "label": "manual",
        "ocr_text": "§ AMD RECORDS OFFIC ADMISSION ENGINEERING AND TECHNOLOGY LEG JOS AND PROOEOUR ENROLLMENT POL “LIM BABLEMENTING Entmene tsongement Srstr onanate p Sattase of nes thet rarsval prowides: the framework for enrolment marayeenent 2 tern Joy. H esiabishes clear stardards, provacures, 204 de “end ceinplionce with national and institutional regetations Engineating and Teche onsiatenty, congue quality ayistesges the eoed tor systematic and affont stulents acader s progress and wef Jdroments, and prowedums into a single authoritative ‘The creation of this comprahensive i implementation of policies that drectly gilations, 1a sconseticiat document. cative Sevsloped in consuitation with academic cauncls, ester! SF sesesitatives, and adi i rofiets tho catoctive sindon: sad experience of the acadectie commraatity. 1 in jighsr education admirastraicn wile maintain come offices, this ara esigned to support the ins ns. They provide cleat petinaays fo y high siandarde af acece wal are and grovedures caalined in shis mem All potie commitment to academic excellence and student Ses te ena students to achieve their educational goals jos in fares unlit revi ADA aed shall 0 rakes offect in Academic Year 202) ie Issacs, This exiticr separated by subs H Legat Sasie tue mtn spy cae ne ra oni wn IU EMSS gate ae pre 19 «eit to 1708 The yer Educa et BS wh ese oe Sass oo IE eager of Nie aan COURSES ransacss, ast gis forge ean su Raiacont OHEQ Manarartn Orta w8 Se Pigpines sc bugn Poveny et ot 722, ting ne cain ae cy of nea aa He 2 agua Act aud sporty Yon Demonia Higher tation Mmante aus Richy a8 sree the roves syleneratin of B88 £0 {ebe2s, coarng Se cabon 28 saan He"
    },
    {
        "image": "manual2_synth_17_aug4.png",
        "label": "manual",
        "ocr_text": "ADMISSIONS AND RECORDS OFFICE (COLLEGE OF ENGINEERING AND TECHNOLOGY ENROLLMENT POLICIES AND PROCEDURES PRACTICUM IMPLEMENTING Enrotiment Management System 1 Rationale This policy manual provides the framework for enrollment management system within College of Engineering and Technology. It establishes clear standards, procedures, and guidelines that ensure quality, consistency, and compliance with national and institutional regulations. ‘The creation of this comprehensive manual addresses the need for systematic and transparent implementation of policies that directly affect students’ academic progress and welfare. It consolidates all relevant regulations, requirements, and procedures into a single authoritative document. Developed in consultation with academic councils, student representatives, and administrative offices, this manual reflects the collective wisdom and experience of the academic community. It incorporates best practices in higher education administration while maintaining compliance with CHED standards All policies and procedures outlined in this manual are designed to support the institution s commitment to academic excellence and student success. They provide clear pathways for students to achieve their educational goals while maintaining high standards of academic integrity This edition takes effect in Academic Year 2023 2024 and shall remain in force until revised or superseded by subsequent issuances. H Legal B ‘The author fr this posey manual is derived rom the folowing legal and insttstona sources: 1. RapubSe Act No, 7722 The Higher Edveation Ast of 1904, which estabsshed the Commission on Higher Eaton and provides for the regulation of higher education institutions. 2. Relevant CHED Memorandum Orders and Circulars preserbing polcis, standards, and guidelines for higher education in the Prippines. 3. Republe Act No. 10173 -Data Privacy Act of 2012, mandating the protection and security of personal data incluing student Information, 4. Institutional Mandate and Authority as presorbed inthe University Charter and approved by the Commission on Higher Education 5. Board Resolution No, 2084 23, authorzing the formulation and implementation ofthis pofcy manual within Colege of Engineering and Technolgy. Page 1 of 15"
    },
    {
        "image": "manual2_synth_17_aug5.png",
        "label": "manual",
        "ocr_text": "ADMISSIONS AND RECORDS OFFICE COLLEGE OF ENGINEERING AND TECHNOLOGY ENRCLLMENT POUDIES AND PROCEDURES PRACTICUM IMPLEMENTING tneman Managemen Sym 1 Rationale"
    },
    {
        "image": "manual2_synth_18_aug1.png",
        "label": "manual",
        "ocr_text": "STUDENT SERVICES OFFICE (COLLEGE OF ENGINEERING AND TECHNOLOGY GRADUATION REQUIREMENTS PRACTICUM IMPLEMENTING begree Completion Standards 1 Ratio This policy manual establishes comprehensive guidelines for degree completion standards within College of Engineering and Technology. It is designed to ensure consistency, transparency, and faimess in the implementation of academic policies and procedures. ‘The development of this manual is in response to the need for standardized processes that ‘comply with Commission on Higher Education (CHED) regulations and institutional standards. It aims to provide clear direction to students, faculty, and administrative staff regarding their rights, responsibilities, and procedures. This manual serves as the official reference for all matters relating to degree completion standards. It has been carefully developed through consultation with academic departments, student organizations, and administrative offices to ensure its relevance and effectiveness. All provisions herein are aligned with the university s mission and vision of providing quality education and maintaining academic excellence. Regular review and updates will be conducted to ensure continued compliance with evolving educational standards and regulatory requirements. This edition is effective Academic Year 2023 2024 and supersedes all previous versions. All members of the academic community are expected to familiarize themselves with and adhere to the policies outlined in this manual Legal Basis “This poy is promulgated pursuant tothe folowing legal bases and insttutonal authority: 1. Repube Act No. 7722 Higher Education Act of 1904, which provides for the regulation and governance of higher education Insttutions inthe Pippin. 2. CHED Memerandum Order No 20, Seis of 2013 General Esveation Curriculum: Hotste Understandings, ntlactual and Cive Competencies. '3. Republi Act No. 10173 -Data Privacy Act of 2012, ensuring the protection of student information and privacy rights. 4 Institutional Chater and By Laws, granting authority to establish policies and reguations forthe effective administration of academic programs. 5. Board of Trustees Resolution No. 43, Seis of 2023, authoring the implementation ofthis poScy manual Page 1 of 16"
    },
    {
        "image": "manual2_synth_18_aug2.png",
        "label": "manual",
        "ocr_text": "STUDENT SERVICES OFFICE COLLEGE OF ENGINEERING AND TECHNOLOGY GRADUATION REQUIREMENTS the policies outlined in this Page tof 16"
    },
    {
        "image": "manual2_synth_18_aug3.png",
        "label": "manual",
        "ocr_text": "STUDENT SERVICES OFFICE ‘COLLEGE OF ENGINEERING AND TECHNOLOGY GRADUATION REQUIREMENTS PRACTICUM IMPLEMENTING Degree Compietion Standards L Rationale This policy manual establishes comprehensive guidelines for degree completion standards within College of Engineering and Technology. It is designed to ensure consistency, transparency, and fairness in the implementation of academic poli and procedures. “The development of this manual is in response to the need for standardized processes that ‘comply with Commission on Higher Education (CHED) regulations and institutional standards. It aims to provide clear direction to students, faculty, and administrative staff regarding their rights, responsibilities, and procedures. ‘This manual serves as the official reference for all matters relating to degree completion standards. It has been carefully developed through consultation with academic departments, student organizations, and administrative offices to ensure its relevance and effectiveness All provisions herein are aligned with the university s mission and vision of providing quality ‘education and maintaining academic excellence. Regular review and updates will be conducted to ensure continued compliance with evolving educational standards and regulatory requirements. This edition is effective Academic Year 2023 2024 and supersedes all previous versions. All members of the academic community are expected to familiarize themselves with and adhere to the policies outlined in this manual. I. Legal Basis “This poly is promugates pursuant to the folowing legal bases and institutional authority 1. Repute Act No. 7722- Higher Education Act of 1804, which provides forthe reguation and governance of higher education inattutions inthe Pippies. 2. CHED Memorandum Ordet No. 20, Seve of 2013 General Education Curicuum: Hokstc Understanding, Intdectual and Civic Competencies. 13 Republic Act No, 10173 -Data Privacy Act of 2012, ensuing the protection of student information and privacy Habis. 4 nsthutional Chater and By Laws. grating athorty to establish polcles and reguations forthe effective administration of academic progams 5. Board of Trstees Rescltion No. 439, Sees f 2023, authorizing the implementation ofthis pocy mana Page 1 of 16"
    },
    {
        "image": "manual2_synth_18_aug4.png",
        "label": "manual",
        "ocr_text": "ADUATIGN REQ! PR .CTICUM IMPL NTING tages Gompiston sineaants 1 Rationale This policy manus! establishes Jagroe completion standards within omprahensive guidelines far Guoltege of Engineering and Technology. itis desig 15s in the Implementation of acadamic policies to ensure consistency, transparency, and fait The development of this manuai is response te the need for standardized processes that soinply with Goran ission on Highet Education (CHED) regulations and institutional siandarts alms fo provide clear direction te stucien adres respon pr matter 5 rotating to deer jon weit vefully develepes student organizations, and adinir emis. dep trative offices to and olfectivencss e university s 1 ion of providing Gu 8 will be co: excellence Regular review and uptat ted to cation ving ety ds and regulatery requirements ve A This edition is ademic Yew 2003 2024 ond s mere the poiicies out -edes alt previous versions. Al ize themselves wilh of the academic community are expected te fa in this manual Ho Legal Ba: lwiaduns Hotia Ungeetandngs ities ans One 4. Regutrs Ret ata Pay Ae cg the estention of abet fsmaton ans prey vis 4 teathuion: Chater ae By Laws, gran atin to esti nats ae cegiains fn the fan a 15, Bande Tastee: Rescoson Mo, 409, Sue of 2928, athoriny the inplemeson of hs eoley Page 1 of 6"
    },
    {
        "image": "manual2_synth_18_aug5.png",
        "label": "manual",
        "ocr_text": "ES OFFICE STUBENT SERVIC! 4 Oyine Compntan Btensoras widolines for degtee comaplation stenstards witiin igned fo ensure consistency, transparency, and ares. f ecaden anwial is in response to the need tor standardized js fons end institution ristrat ne develop aply with, Comeatssion on Higher io students, faculty, and adm jucation (CHED) regu i matters relating to degre completion departments, This menus as the official rotsrence for andaris, It has bean carefully developed torou nizations, anu administrative olfices te ensure consultation with ca 15 herein are aligned with the university s mission ard vision of pro je gular review ond updates: sndards Ail provi ard segulatory pomselves with and adhere to runity ate expected to fat the goticies outlined in this manust 6 Legal Basis {is potey meena pc end to te owing ap aes and nation ora Hepat At Ne. 772 snsitane ta Penne vis fra reguiaton av govamance of bigbe aduaton CHRD Meinavedion Sete Ho. Gane Beiessen Cus ted ane cv Holans Unsrmzediogs, ttn"
    },
    {
        "image": "manual2_synth_19_aug1.png",
        "label": "manual",
        "ocr_text": "ADMISSIONS AND RECORDS OFFICE COLLEGE OF ARTS AND SCIENCES LEAVE OF ABSENCE POLICY PRACTICUM IMPLEMENTING stugentLeave Guidelines 1 Rationale This policy manual provides the framework for Sciences It establishes clear standards. proc consistency, Student leave guidelines within College of Arts and \"edutes. and guidelines that ensure quality and compliance with national and institutional regulations The creation ofthis comprehensive manual addresses the need for systematic and transparent implementation of policies that directly affect students’ a consolidates all relevant regulations, reqi document icademic progress and welfare It Juirements, and procedures into a single authoritative Developed in consultation with academic councils, student representatives, and administrative offices, this manual reflects the collective wisdom and ex incorporates best practices in higher education adminis CHED standards perience of the academic community. It ation while maintaining compliance with All policies and procedures outlined in this manual are designed to support the institution s Commitment to academic excellence and student success They provide clear pathways for Students to achieve thelr educational goals while maintaining high standards of academic integrity This edition takes effect in Academic Year 2024. -2025 and shall remain in force until revised or Superseded by subsequent issuances Legal Basis Suace Wah he takowng eg ost (gre Eoveator Ac of 1984). Eatansanng the ramensm ft hg eautaton aomastaten ana eguatn 2 CHED Memoransum Orsen Pacvary tose routing fy asswarce acaceme starearss and stusest wate ogre 3 Rescese Act Mo 10973 \\Data Posey Act of Governng the colecton use, and pcteston of personal ntommaton neueng 4 Unversity Chater /0rg 1 aga founcaton anc atrorty fone estabiatment ang mpementalon of nsitona sono ana reguatont sci Resouten No 82 aecrovng the aceten ang mpenent y cage sr"
    },
    {
        "image": "manual2_synth_19_aug2.png",
        "label": "manual",
        "ocr_text": "1D RECORDS OFFICE ADMISSIONS At OF ARTS AND SCE coue ENCE POLICY LEAVE OF ABS! siden LBMWENTING Shedenticav PRACTICUM IMP i ional thie policy manwai provides the ftamaunck for student faave guide jehin Coiage of Arts 828 nil quidefines that ensure quel soar standards, peneedures. rabliahes eornplian reguiations Sciences. consisionsy. national and instindions 0 with the reed far syeternatic and transparent 1c progress ars) weitare. ft gle sutheattatiee 1g mersiad atesses omovehensiv y affect students’ acadi Tine creation of this implementation of pall aotearoa reevant regulations, requlrersorsS, and provaducas into 3 IR document tatives, and administrative eommurity 2 of the axadenic vents ang corniane otha collective wisdom and expsti ghar education aeriietration tile mo afticas, this manuel ates best practices 10 innompor are designed to support the insti a They provide clear pathwreys for ndgrds of ecadamlc Integy are procectares outlines in this mance! snain in force uri ro HAA RODH awd sha Veer 8 rca ne wutaty t s cosine wi te fran sesvsnects sisal 2 re sie sents seed ws 1 Repubie Aa: No. TPER GPE! spun a 3b 1) Eataaing te fran ty Sees Ld scity pxurten, aeons creases sees «Pesca One Te one roca to ctr, oe, me nen IRN IAS instore a. ep hot vo, 19172 Daa Pay Akt tent re vera arses eating nee tenon at Sa pn etnies sos npn an eta A repairs smergan of s pty amen 1, sepa na wie 379 5, meade Cones) Reaeaen"
    },
    {
        "image": "manual2_synth_19_aug3.png",
        "label": "manual",
        "ocr_text": "ADMISSIONS AND RECORDS OFF OF ABSENC! Student Leave Guraelines SUM IMP 1 Rationale This policy manuel provides the framework for ctucent leave guidelines within College of Acts and tandards, procedures, and guidelines that ensuie qua tutional requlations ih nsive manual addiesses the need for atic and transparent syste! gress and welfare. tt authoritative implementation of policies that dinecily affect stuclents’ academic or consolidates afl reh vant regulations, requbement nd procedures into a sing ntatives, and adminis the academic cortmun hile maintaining Developed in consuttation with academic councils, ice dent iepres acts the callective wisdom and expe ices in higher educ: of incorpo CHED standards. this manual ompllance with best pra All policies and procedures outlined in this manuel are designed and st e support the institution s commitma) dort success. They provide students ve thelr educational gosis while raintain! This edition takes affect in Academic Year 2024 21 superseded! by subsequent issuances. Scie ning ha! estore: 2 Bat No. YT nee Essonien Sat of 18} -Escaisting ths kamewark fr ghar ahvcaton aoniisvaton ant sel 12 CHER Meniersndum Order Paula soning ma sent"
    },
    {
        "image": "manual2_synth_19_aug4.png",
        "label": "manual",
        "ocr_text": "ADMISSIONS AND RECORDS OFFICE <CTICUM IMPLEMENTING sw: provides the framework for stent leve gui is and procedures, aad quidal 126 within College of clear stench thal ensure quality, ations. The id for oy ie F procers dacuinenit Developed in consuttay ‘ear pat! igh standards of academic Inieyy ised ov 4. Republic Fat 13 (Data Pivany Rat 2 Uswvesty Cramer Frenting tu al fesndains and atc far the aslacnhmect ant 5 headene Covied Resohaiun No BROOM _asti was cnglamentavon ofthe ge"
    },
    {
        "image": "manual2_synth_19_aug5.png",
        "label": "manual",
        "ocr_text": "ADMISSIONS ANG RECORDS OFFICE COLLEGE OF ARTS AND SgtEn LEAVE OF ABSENCE POLICY PRACTICUR IMPLEMENTING Susans aw L Rationale Ris palicy manual provides the Framework for student jaave guidelines wit Scionces. It establishes cleu ‘The creation of this ceansrehensive x Implesnantation of policies that sin conselidetes 2 mbes doeurnerd Developed in consultiion with seaanie councils. sti offices, this mans wiflects the colle WED standard, Al policies and pucechinen cuttinud in this manual commitment to aceon students to 5 This edition takes affect In Academic Veer 2024 2025 supersanten by subwaqueid iesuenzes Ho Legal Basis 8 ea sue re Sheahan ot aes camseanes wi he ies 1 Rapa fa hy, Te oleae Eesone Ani of 1668). Esztbatng the ite PS. 2 ERED Wesson Ges «Patios mast miteg to ity asstence eAcstun vei 2 Renate no i. 179 ata Prey Ast of 20405 ster kates SEY One Peta me inset on an asta ee eg roettion, 5 Asatte Sounet Pepohton he, ane, nenual addresses the need for systematic and trans; y atfert staderts! acadwmic proyrens and wielforn, ‘eguistions, respivements, srl procedures into o single authadtative ve wisdom and experince of the ansdormie conn incarpatates best practices in tigher aducction adralnisteat Sameer Seong Pe caer snk ed ete rs tomatic Seseitnas pacert UGaNE roprewantatives, sridi aeministrative waity. while maintaining compliance with azo dhasigned to sunpet the instidian s excelience and student success. They provide ce eve their edducstional quais white maintain 5 patlanasys foe 0g high standards of academia ‘niagrtty aad shall camain in forme until revised or v8 ng loser fev hes eascaten miata mis tation SHRI Marsa, anc snssot Weare higher woteg snort 0 mip"
    },
    {
        "image": "manual2_synth_20_aug1.png",
        "label": "manual",
        "ocr_text": "ADMISSIONS AND RECORDS OFFICE (COLLEGE OF CRIMINAL JUSTICE EDUCATION ADMISSION REQUIREMENTS PRACTICUM IMPLEMENTING ‘student Admission Process 1 Rationale This policy manual provides the framework for student admission process within College of Criminal Justice Education. It establishes clear standards, procedures, and guidelines that ensure quality, consistency, and compliance with national and institutional regulations. The creation of this comprehensive manual addresses the need for systematic and transparent implementation of policies that directly affect students’ academic progress and welfare. It consolidates all relevant regulations, requirements, and procedures into a single authoritative document. Developed in consultation with academic councils, student representatives, and administrative offices, this manual reflects the collective wisdom and experience of the academic community. It incorporates best practices in higher education administration while maintaining compliance with CHED standards All policies and procedures outlined in this manual are designed to support the institution s ‘commitment to academic excellence and student success. They provide clear pathways for students to achieve their educational goals while maintaining high standards of academic integrity This edition takes effect in Academic Year 2023 2024 and shall remain in force until revised or superseded by subsequent issuances. I Legal B ‘This manual i issued under the authorty of and in comptance with the folowing lagal instruments: 1. Repube Act No. 7722 (Higher Education Act of 104) Establishing the framework for higher education administration and regulation in the Prine. 2. CHED Memorandum Orders -Pariculay these relating to qualty assurance, academic standards, and student welfare in higher ‘esveation instutons. 3. Repub Act No. 10173 (Data Privacy Act of 2012) Governing the colecton, use, and protection of personal information incuding student recone 4. Unversity Charter Providing the legal foundation and authority forthe estabishment and implementation of institutional pscies and regulations. 5, Academie Council Resolution No, 98 2023, approving the adoption and implementation ofthis poScy framework. Page 1 of 14"
    },
    {
        "image": "manual2_synth_20_aug2.png",
        "label": "manual",
        "ocr_text": "ADMISSIONS 4ND RECORDS OFFICE OH OF ORBAMAL g SuCA TION ADMISSION REQUIREMENT PRACTICUM IMPLEMENTING ident Astnssen Process This policy manial arovicies the trarnenso Grirminal Sustice E4ucation. 1 stadt} for student iximissien process within Cottage of Nr standards, priced, and quidal and institutionat requdations Mion of this compretensive manus! sadresses 2 nplemoniatica of policies that directly afteet ete ines that engure ‘The cre Heel for systematic and tra emic progres tS, and procatiues parent B58 and welfare. tt to 2 single authuttative “is document 168 all relevan’ 26 ations, requleernens Developed in consultation with acatemic eouncite student regres: ‘Ses, this manual ratiacts. the collective wiedoen intorparates best practices in higher educa! CHED starmsands tives, and ac arid experience of the a iministratice atemic community. ration wide maintaining exny adi lance with All policies and procedures cetiined! in cominiteent te 3 students to ach Tanisai se denignad to bu e exeationce and wudent ve thelr educations! coals why eet the ions ways for 888. Thay provide clear is maintaining Nigh standards of acavderm megrity This edition takes ffect in Ar ade Superseded by suber Year 2 tances, nit vised ot TR Marc ti unde te sare Far camp re 8 tong ge eedcneete Rese Ast No Ti3e SELES Steer 08 ane hein sting 2 NEE Hhemorar sins eters Kanter, assert wetive m nghae rons eettcteos Pe BM 17 Dae Bary At 281) doen ct ae ing Foran cepts MSY te esatetme ard sleretsten 4k Yaies ang 5 sas Co Reason e C6325 sewing mateo st pets oth cen tren Pane 5 ot te"
    },
    {
        "image": "manual2_synth_20_aug3.png",
        "label": "manual",
        "ocr_text": "ADMISSIONS AND RECORDS OFFICE COLLEGE OF CRIMINAL, JUSTICE ROUCATION ADMISSION REQUIREMENTS PRACTICUM IMP ENTINEE Shotees sateiaion Process L Rationale “This poticy mami provides the framework forested admission Process veithin Cottage of ice Pekcation Hestallishes clear Stardvads, procedures, and guidelines thas ensure ce yath netonal and inetitutlonal magulations, Canina Ju quality. oncesteney, and pamptian ‘Tho crtion of tis ccmpmohonaive manval addrasaas the need for systematic and Harsparent iropiameeiation of petcies that dectly effect suxiants! acadomnic progross =8 walters. If Comscidaies alt ielevant regulations, cocairaments, and grcceckares into single author scum, deveiupad in coasuttetion wilt acartemnic: coune! cffions, this manual mflcts the collective wisdor ord experience of the a sresrporstos best practices in higher edcencs ackrinssteation se enainttairéng cormpliance CHED stendacis rie cammeranity. it rod in thie manual are designed supped the institstlon s 2. Thay provide clear pathways for high standascs of academic integrity 2 policies ard procedures cat commitment to acarpmks excelience and stadant success seadonts te achieve theit educations’ goss while maintaicing 2 force until meagan oF “Tria exitien takes. fect in Anadernis Voor 202 2024 and shail remain superseded by cubsequort issuances Bhogal Basis “tes ans ane atc nn ay of ae Sapa Se Sane ah eee dx rarer ebvemsn woieasan wad aa egation ht of YU) Sumani th Honcewor 1 pats Act He PEE Oto ee Patypioes 2. enema tara Panay engl my mc, Serie aims, a ant wan 8 AE [PAs RE Lage ft Sn, N03 ata ey Aaa SOND Gavin een arta gst onnatan eck sweyhrich anzitestat memati eer ote sagen he socgte aed ersienentin #5 py Mow fb pesuass Suoed Senetun Ho SEO seve Page tote"
    },
    {
        "image": "manual2_synth_20_aug4.png",
        "label": "manual",
        "ocr_text": "ADMISSIONS AND RECORDS OFFICE COLLEGE OF CRIMINAL JUSTICE EDUCATION ADMISSION REQUIREMENTS PRACTICUM IMPLEMENTING shoe aman P= 1 Rationale College ves cerapinte we on process within a Criminal Justice Education. frestablishes clear standards, procedires and gdlioes tnt quality, consistency. “ systematic and transparent Trerentation of polices that rect Stet procedures: Cres krona, regs _ document cones pconsutation wth academic councils, SAS offices, this in en ances each Developed : \"nnde maintaining compuance wih CHED standards. designed to support the institution s"
    },
    {
        "image": "manual2_synth_20_aug5.png",
        "label": "manual",
        "ocr_text": "ADMISSIONS AND RECORDS OFFIC! EOF CRIMINAL JUSTIOE EDUCATION ADMISSION REQUIREME? NTS, PRACTICUM IMPLEMENTING srasent admission Procers Rationale C286 within College of eres, an guidelines th 2nd Compliance with nstional and institutional rexuéations, The creation of this comprehensive manu: imploinantation of policies thet direc: ihe need for systematic iy affect students’ academic progres Heitemants, and pro and transparent and welfare it dates all relevant veyutations document academic Davelojsed in consultation with ounclls, student representatives, and scmnlnisteat offcss, this manna! raficts tha collective wisdcm snd experience of the academic sommunity. tt incomorases best practices in higher education administration while raat taining compliance with All policies and procedin outlined in this manual a stasigned fo support the nt fo Stacemic excellence and student success. They provide Students to achieve their educational goals wile ng high standards of acadon This adition takes affect in Acagemi: Year 2023 2004 and shall emain ded by subsequent Issirr force unt mevised or D. Legal Resin 21d in oorpharow ath Da stow lag ntornens 4. Ruse det Wo. 7122 dtghor Baassten Act of 1958, Fsuctatag the essen for higher afc 8 Prapnes SHED Merecedin Ohturs arias those ‘seta Yo att aoreance, arate Wondaré, am totam ween gar 8 Reiss Bot No. 1UNPS 22012} Cowaring es cocton se, ae petectee cf persant lc nhc Met Grama Foritng Se ng tan a8 ct Yn eeashovent ma snus ot tena ears 5 sas 9 Cok Hemalsion Wo, 12909, epi te ado 8 minarets of is wey Kami Page tof"
    }
]