[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM ecame part of your f al record, [All questions contained in this questa aE uary 18 physical exam Fabri Previous ov referring Gector Thomas Jen ings Acute Appendicitis Acute Ba _ Appendicitis Chest Pain Rive side ajuation alr institute Postoperative Observation Acute” “Appendicitis Severe Dehydration-"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "medicalrecord",
        "ocr_text": "All suestions co, tained in CORBIS Ore Strictly rficlentiad anes vai OMe part of your ie Jacqueline Baldwin ave diganoseed i Controlled Type fi I Diabetes Mel Acute A Append ppendicitis Ay Acute Euitis Chest Pa) ia] atic [Postoperative Observation n Acute+ [Appendicitis Severe sorte: +"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions trict ord Name (ast frst Mz) Jacqueline Baldwin (16 pos: Mareh 27 2003 Marital status Li Single j Partnered Married {]Oworcea Widowed Previous or referring doctor. Thomas Jen nings Date of fast physical exam: February 15 2025 PERSONAL HEALTH HISTORY u st any medical provlems that other doctors Controlled Type I Diabetes Mel fitus Surcertes Acute Appendicitis Acute ide Appendicitis Chest Pain eel rSigé __Evalyation Hed Institute. S87 Seperate ESS Medical Center. Have you ever nad a blood transtusion? “Ty IN |"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record. Name (Last, First, ML) Jacqueline Baldwin Om OF _ poe March 27 2003 Marital status: OSingle [)Partnered [JMarried [JSeparated [JDivorced [JWidowed Previous or referring doctor: Thomas Jen nings Date of last physical exam: February 15 2025 PERSONAL HEALTH HISTORY Childhood iliness: _— [] Measles []Mumps [Rubella [Chickenpox [Rheumatic Fever [J Polio Immunizations and dates: Lae Ci Pneumonia OC Hepatitis O Chickenpox O influenza OC MMR Measles, Mumps, Rubella _| List any medical problems that other doctors have diagnosed Controlled Type II Diabetes Mellitus Surgeries Year Reason Hospital L Acute Appendicitis Acute ‘Appendiditis Chest Ri ersid 2583 Ppengicits ChestPain Wealth Institute. Other hospitalizations Year Reason Hospital 846 {Rostoperative, Observation, Acute CityCare 7 +Appendicitis Severe rati ppendits Severe Dehyératon Medical Center Have you ever had a blood transfusion? Oy ON Allergies to medications Name the drug Reaction you had Hospital Insect Stings Anaphylactic shock Greenfield Provincial Hospital i"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record. Jacqueline Baldwin Om OF vos: March 27 2003 (Separated (Divorced (Widowed Name (Last, First, MI): Marital status: OSingle [Partnered (Married Date of last physical exam: February 15 2025 previous or referring doctor: Thomas Jennings PERSONAL HEALTH HISTORY Childhood iliness: CU Measles (Mumps DRubella CT Chickenpox Rheumatic Fever DD Polio Immunizations and dates: Treats Diener DD Hepatitis C1 Chickenpox |G infiuenza (MMR Measles, Mumps, Rubella List any medical problems that other doctors have diagnosed Controlled Type II Diabetes Mellitus Surgeries Year Reason Hospital L Acute Appendicitis Acute 4 A A T wn L 3038 Appendicitis Chest Pain 4 River side Evaluation Healt nstitute Other hospitalizations Year Reason Hospital +Postoperative Observation Acute] CityCare +Appendicitis Severe Dehydration TM edi cal C enter _ Have you ever had a blood transfusion? Oy ON Allergies to medications Name the drug Reaction you had Hospital Insect Stings Anaphylactic shock Greenfield Provincial Hospital"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM Ail questions contained in th 2 are strictly confidential Anthony Rice Sandra Jackson Severe Migraine Nsode rest Pain Evaluation yperiensive Pain Eva ation Chest valuation lyation Chest vation"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL Hy} Ali questions containad in this questionnaire ore 5 trictly STORY Form Contidential anc wiij become part of Your medicet record, Name dose Farsi, My Marital status: bon: Novae 02 OO worced Previous or referring acto: O Widowea immunizations and Gates: that other doctors Chronic Fati evere @. Migraine Epi isode Ches| Pain Eva’ Hy nation ypertensive __Crisis i Che 1E ation Ch Pain Bali Observation stoperses"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM Alt questions contained in this questionnaire ars strictly confidential and will become part of your enadical record. a ighaseaetd sets ——_ sencra Jackson ae “Chronic Fatigue Syndrome i Severe Mi yraine Epi: sode Chest 4 C ed Pain Eval aon ypartensive 4 is i Y pepeains ation Bah ga we eH ned [side + Pain Observation _ \\Heal vers institute —— i Hospital Our Lady “Lady of Hope se Medical Center —— _Reactic weaction you hed od __ ica sens Skin rash"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record Name (Last, First, MI) Anthony Rice Om Or vos November 02 Marital status: OSingle CPartnered OMarried (Separated (Divorced (Widowed Previous or referring doctor: Date of last physical exam: August 04 2011 Sandra Jackson PERSONAL HEALTH HISTORY Childhood illness: [Measles [JMumps [Rubella [] Chickenpox _[] Rheumatic Fever [1 Polio Immunizations and dates: asics Cirneanen D Hepatitis O Chickenpox O influenza (C1 MMR Measles, Mumps, Rubella List any medical problems that other doctors have diagnosed Chronic Fatigue Syndrome Surgeries Year Reason Hospital L 4883 So all ree E isode Chest L ain Evaluation ertensive Crisis\" iMedia al pecion Other hospitalizations Year Reason Hospital Che in at Ches tL T pan TWA Navation, Cafive vers side Observation THealt stitute Have you ever had a blood transfusion? Oy On Allergies to medications Name the drug Reaction you had Hospital Penicillin Skin rash Our Lady of Hope Medical Center"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM Ali questions contained in this questionnaire ore sirictly conficiential and will become part of your medical record oF ook: Novempgr 02 CiSeparated ClPartnered Previous or hnabintnd ee _ Sandra Jackson Date of last physi surgeries [Yer “Reason _ L ob Severe, Mi raine E isode Chest at ain Evaluation Hypertensive L {Pain Even Crisis eae ‘fbn | Reason Hospital ee eee | Ghee ingeye ation, Chest ce sits (| 1996 Observation _ {Healt isi ute | —- | Atiergies to medications p= I <i Name the drug T” Reaction you had Jil n eciae cea Penicillin |"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "medicalrecord",
        "ocr_text": "(MEDICAL HISTORY FORM A ntained in (his Questronnane 4 strecth al and will bc e part of your medical record Mame cast First, 0) Colin Brown M pon. February 20 2023 Marital starus Stegie }Partnered ares Previous or reterring doctor Ashiey Bauer Date of jasr physicai exam: August 16 1998 PERSONAL Childhood liiness 1882 Severe ‘e Dehydration Acule ‘Metr. ro Saar Appendicitis’ Acute Appendici tis 3 Hospit a Other hospit Year Q72 “sg Severe Dehydration, “Our Lady of f Hope O08 “Pneumonia. Pneumonia” Medical Center _ Have you ever hao 8 blood transfusion? dications"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this uestionnaire are strictly confidential and will become part of your medical record Name (ast, First, m1) Colin Brown Om OF vos: February 20 2023 Marital status: OSingle O Partnered OMarried OSeparatea ODivorcea QWidowed Previous or referring doctor: Ashley Bauer Date of last physical exam: August 10 1998 PERSONAL HEALTH HISTORY Childhood iliness: [Fj Measles (Mumps ORubella Oi Chickenpox O Rheumatic Fever FJ Polio Immunizations and dates: O Tetanus O Pneumonia CO) Hepatitis CO. Chickenpox O influenza Co MMR Measles, Mumps, Rubella List any medical Problems that other doctors have diagnosed Mild Respiratory Infection Surgeries Year Reason Hospital I Severe D hydration Acute ro General 1885 Appendicitis Acute wpa tis Metro, Gene Other hospitalizations —T Reason Year Hospital 7 Severe Dehydration ~-Our Lady of Hope~ {Pneumonia Pneumoniat+ Medical Center Have you ever had a blood transfusion? Oy on Allergies to medications Name the drug Reaction you had Hospital Sulfa Drugs Itching Our Lady of Hope Medical Center"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record. Om Oe pos: February 20 2023 Name (Last, First, MI) Colin Brown Marital status: OsSingle (Partnered (Married (separated (Divorced (widowed Previous or referring doctor: Ashley Bauer Date of last physical exam: August 10 1998 PERSONAL HEALTH HISTORY Childhood lines: [)Measies [JMumps [JRubella [Chickenpox _ JRheumatic Fever [Polio ios CO Tetanus 1 Pneumonia Immunizations and dates: CO Hepatitis O Chickenpox CO influenza (MMR Measles, Mumps, Rubella List any medical problems that other doctors have diagnosed Mild Respiratory Infection Surgeries Year Reason Hospital 1882 Severe Dehydration Acute +Metro General Appendicitis Acute Appendicitis ospita Other hospitalizations Year Reason Hospital Severe Dehydration ~Our Lady of Hope} +Pneumonia Pneumonia; Medical Center || Have you ever had a blood transfusion? Oy ON Allergies to medications Name the drug Reaction you had Hospital Sulfa Drugs Itching Our Lady of Hope Medical Center"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record. Om OF bop: February 20 2023 Name (Last, First, MI) Colin Brown Marital status: DSingle [Partnered (Married Ciseparated [JDivorced [JWidowed Previous or referring doctor: Ashley Bauer Date of last physical exam: August 10 1998 PERSONAL HEALTH HISTORY Childhood illness: CU Measles (Mumps (GRubella U0 Chickenpox (7 Rheumatic Fever 0 Polio Immunizations and dates: O Tetanus iets D Hepatitis 0 Chickenpox O influenza (1 MMR Measles, Mumps, Rubella List any medical problems that other doctors have diagnosed Mild Respiratory Infection Surgeries Year Reason Hospital t Severe Dehydration Acute Metro General r Appendicitis Acute Appendicitis ospita Other hospitalizations Year Reason Hospital Severe Dehydration |Our Lady of Hope +Pneumonia Pneumonia? Medical Center || By. on Have you ever had a blood transfusion? Allergies to medications Hospital Name the drug Reaction you had Our Lady of Hope Medical Center Sulfa Drugs Itching"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are stric tly confidential and wil! become part of your medical record. Name a dase Ft Colin Brown OM OF bow: February 20 2023 Viarfeal sctus: _O Singte O Partnered Chwi wowed Previous of referring doctor: Ashley B aad ——w + Hospitai 2 —— i f “Severe D Deh dration Acute 1 fr 1862 [Appendicitis Acute ‘Appenditis + Metr Meteor : ace Dehydration tour ur Lady of Hope —{Pneumonia Pneumonia’ Medical Center |_Name the ci drug Reaction you had 7 | Sulfa Crugs itching Our Le Lady of Hope} Madicat Canier me Se di nf"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record. Name (Last, First, MI) Kristina Steele Om OF oboB: Decenbe 116 Marital status: OSingle (CJPartnered (Married Ciseparated ODivorced (Widowed Previous or referring doctor: John Hall Date of last physical exam: August 15 2021 PERSONAL HEALTH HISTORY Childhood iliness: CD Measles (Mumps (Rubella OU Chickenpox CT Rheumatic Fever OD Polio Teti Pr mor Immunizations and dates: Liat Diipeaienie CD Hepatitis D Chickenpox O influenza (MMR Measles, Mumps, Rubella List any medical problems that other doctors have diagnosed Hypertensive Episode Surgeries Year Reason Hospital fr Ss Migraine Episode S 7 i i BSS Sie eRREEP Stern HERI S Rute Other hospitalizations Year Reason Hospital Severe Dehydration Diabetic 4 Complications Hypertensive Our Lady of Hope Crisis y Medical Center Have you ever had a blood transfusion? Oy ON Allergies to medications Hospital Name the drug Reaction you had Shellfish Swelling of lips or face |_ Divine Mercy Hospital"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this duestionnaire are strictly confidential and will become part of your medical re cord Name (ase, Firse, M1) Kristina Steele 1M CIE pop December 16 JMerned )Separated O Dworcea (Widowed Previous or referring doctor: Je fete Stor: “John Hall Marital status: D Single Partnered Date of last physical exam August 15 2021 “PERSONAL HEALTH 4 HISTORY _ Mumps_ —____| OC) Rubella Chic kenpox Qo Tetanus C] Polio 7 oo U) Pneumonia U Chickenpox t —_ CO Hepatitis C1 influenza List any medical problems that other doctors have diagnosed Surgeries Year Reason ee oe Hosp f ‘Sev Mi E id j Jes ‘Nigra! rae Fracurce ser \"He HST —{ Other hospitalizations — oo — - ——} a __Hospitar “Severe Dehydration p; Diabetic. [- ; Complications f Hypertensive {Our Lady of Hope- ris i edica al Center Allergies to Medications Name the drug Reaction you had"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All Guestions con ned in this questionnaire Hl become madical Kristina Steele Decgmnber NG doctor Jobn Hall _ her doctas Hypertensive Episode i erside a institute: f 3 severe Dehydration Diabetic Our Lads i Complications Hypertensive UF Lady of Hope { a ° Crisis” Medical Center ~"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record. Name case Fist M1) Kristina Steele Cm Or vos, Decgnber 16 Marital status: DSingle (Partnered DMarried Diseparated ODivorced [Widowed Previous or referring doctor: John Hall Date of last physical exam: August 15 2021 PERSONAL HEALTH HISTORY Childhood illness: UO Measles (Mumps CRubella U0 Chickenpox (Rheumatic Fever 0 Polio ca CO Tetanus CO Pneumonia Immunizations and dates: CO Hepatitis CO. Chickenpox C1 Influenza C1 MMR Measies, Mumps, Rubella List any medical problems that other doctors have diagnosed Hypertensive Episode Surgeries Year Reason Hospital r Ss Mi ine Episode S 7 1 1 186) Tpigeaheisacge Pectecrsem RWverside Other hospitalizations Year Reason Hospital Severe Dehydration Diabetic | Complications Hypertensive Our Lady of Hope Crisis Medical Center Have you ever had a blood transfusion? Oy On Allergies to medications Name the drug Reaction you had Hospital Shellfish Swelling of lips or face Divine Mercy Hospital"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM s contained in this questionnaire are strictly confidential and will become part of your medical record. Om OF Do: December 16 (Widowed All question: Kristina Steele Name (Last, First, MI): Marital status: DSingle (CPartnered (Married (Separated (Divorced Previous or referring doctor: John Hall Date of last physical exam: August 15 2021 PERSONAL HEALTH HISTORY (Mumps (Rubella Cl Chickenpox OC Pneumonia Childhood iliness: CO Measles (Rheumatic Fever CD Polio Immunizations and dates: Li ame CO influenza List any medical problems that other doctors have diagnosed Hypertensive Episode ee cn Year Reason r Ss Migraine Epi de S i i Jeg joerc Made pisode severe eS SF te. Other hospitalizations Hospital Year Reason Severe Dehydration Diabetic lo Complications H ertensive ur Lady of Hope pe Crisi Me Medical Center TISiS Oy ON ever had a blood transfusion? Have you Allergies to medications jou had Name the drug Reaction y‘ Hospital Shellfish ‘Swelling of lips or face Divine Mercy Hospital"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record. Name (Last, First, Mi) Charles Haas cm Gr vos: May 15 2017 Marital status: DSingle (Partnered [Married [Separated [Divorced (Widowed Previous or referring doctor: Jagmine Whitaker Date of last physical exam: May 28 2022 PERSONAL HEALTH HISTORY Childhood illness: []Measiles [JMumps [JRubella []Chickenpox [J Rheumatic Fever _[] Polio Tet Pn Immunizations and dates: O Tetanus O Preumonia CF Hepatitis OU) Chickenpox CO influenza (MMR Measles, Mumps, Rubella List any medical problems that other doctors have diagnosed Seasonal Allergic Rhinitis Surgeries Year Reason Hospital Severe Dehydration cred Fractured Arm Fractured Arm} wears jeart Other hospitalizations Year Reason Hospital Diabetic Complications Acute => ree Appendicitis Diabetic Complications ‘pro eter te! “Ig ital Have you ever had a blood transfusion? Oy ON Allergies to medications Name the drug Reaction you had Hospital Peanuts Shortness of breath CityCare Medical Center"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record Name (Last, Fist, M1) Charles Haas Om Gr vos: May 15 2017 Marital status: [JSingle [JPartnered [JMarried [Separated [JDivorced [JWidowed Previous or referring doctor: Jagmine Whitaker Date of last physical exam: May 28 2022 PERSONAL HEALTH HISTORY Childhood illness: UO Measles (Mumps CRubella UO Chickenpox CT Rheumatic Fever O Polio ies O Tetanus O Pneumonia Immunizations and dates: CO Hepatitis O. chickenpox C1 Influenza C1 MMR Measies, Mumps, Rubella List any medical problems that other doctors have diagnosed Seasonal Allergic Rhinitis Surgeries Year Reason Hospital r Severe Dehydration red_Heart r Fractured Arm Fractured Arm7 iyeacts! Pavi art Other hospitalizations Year Reason Hospital Diabetic Complications Acute 7 i 7 1e67 J appendicitis Diabetic Complications {pro Pree 1d ital Have you ever had a blood transfusion? Oy ON Allergies to medications Name the drug Reaction you had Hospital Peanuts Shortness of breath CityCare Medical Center"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "medicalrecord",
        "ocr_text": "and will become part of your me MEDICAL HISTORY FORM Ail questions contained iit pos May 15 201 7 tC] Widowed [i Givorced nave of last prysicat exars: May 28 2022 SONAL HEALTH HISTORY i igo! Severe Dehydration a) cred He rt g OF cured Arm py diate” arm Medical avilion abetic Complications Acute Greenfield Appendicitis Diabetic Camplications Provincial ospital"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "medicalrecord",
        "ocr_text": "AL HISTORY FORM recical racord. MEDIC ined in this quest ial andl will GECOr™ confident _ Charles Haas __ Name faarital status: doctors nave Seasonal All argic Rhinitis Severe Dehydration ifractured Arm Fractured an a Diabetic Complic fications Acute Gree (! allons “provincia al ip spital [Appendicl Diabetic Compiic:"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM his questionr will bec Severe Dehydration acre srs Fractured Arm Fractured Arn ved ical avillon 4 Appendisitis Diabetic Complications ~Provincia ro, gS Diabetic Complications Acute finctal Hog 7 ospital"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM confidentie me cart of your med: Name (act fist, ni) Carrie Nelson cm Oe cos: August 11 2002 Marital status cred qMarned Widowed Previous or referring rector irs. Amy Johnson Date of iast pinysical exam: Decent ‘Postop serative Observation ast. . cred an Regence aes Hear O06 I Severe Deh eration Severe 7 _ ql 3 i Migraine Ebisode S Severe “Mets iO 9 General y 4 1 Dehydration ospit a Have you ever had a biood tr: Aliergies to meaicatic:"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM come pert of your medi strictly conficlential and wil gained in this questionr pow. August 14 2002 _Caitie Nelson Teton: List any! mc vat probl ms that other a cred Hear Postoperative Observation Chest! ical Pa Pain Evaluation Acute 24 endictis Me Severe Dehydration Severe Migraine Episode Severe Dehydr:"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM ME questions co Narn Maritat Previous sand dates: 4 Popa Observation C Chest. ve ed Hj Hon Ac aa 2 88 4 |__ Pam gyaluation Acute ‘dical Pav Severe e Dehy ation Severe : Migraine Episode Severe i ‘Metn PO General Dehydration ospit 3"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this uestionnaire are strictly confidential and will become part of your medical record Name (Last, First, M1) Carrie Nelson Om OF vos: August 11 2002 Marital status: O Single O Partnered OMarried OSeparated ODivorcea OWidowed Previous or referring doctor: Mrs. Amy Joh inson Date of last physical exam: December 26 2003 PERSONAL HEALTH HISTORY “| Childhood lines: Measles.) Mumps C Rubella Ci Chickenpox Rheumatic Fever Polio Qa C Pneumoni Immunizations and dates: C tetanus Preumonia | O Hepatitis O Chickenpox O influenza 0 MMR Measies, Mumps, Rubella r List any medical Problems that other doctors have diagnosed Gastrointestinal Disturbance Surgeries Year Reason Hospital | L Postoperative Observation Chest. i Ss cred He yt 3838 Pan ppandigngcute Medics avilion, { T | —_| —I Other hospitalizations Year Reason T Hospital I Severe Deh dration Severe 4 4 Migraine Episode Severe Me ro General Dehydration T OSspI ta ai |__Have you ever had a blood transfusion? Oy On Allergies to Medications ‘| Name the drug Reaction you had Hospital Latex Sneezing and runny nose Eastview Doctors Hospital"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM Carrie Nelson ast, Firat, MEP eramagscctor Mrs, Amy Gastrointestinal D Johnson _ isturbance Date of fast m COME Pat art of ve pos: erative Observation Ghost eae Evaluation Acute fecic August 11 2002 Aical Gsaet Hon,"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM Ail questions contained in this questionnaire are strictly confidential and will become part of your medical record Ge Dor: March 23 1999 _ Teresa Lopez (Married (Separated CWidowed relering doctor: Bath Ramirez __ Date of last physical exam: June 18 2023 pu PERSONAL HEALTH HISTORY List any medical probleme that othor doctor es [Surgeries i Year Reason _ EEEEE _ EE SS eS eee ——E ——— | | | BREF compl GatbA@ ARNIRE Rack Dodi HeSpital ec faon nme a Ee areata ene ares eer a ________| Postoperative Observation +. abet Complications Chest Divine Mercy Pain Evaluation _ (Hospital ———_$ Aitergies to medications Name the drug Reaction you had Hospitat “| Greenfield"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM Alll questions contained in this questionnaire are strictly confidential and will become part of your medical record. Name (Last, First, M1) Teresa Lopez Gm OF vos: March 23 1999 Marital status: Single Partnered OMarried OSeparated ODivorced (Widowed Previous or referring doctor: Beth Ramirez Date of last physical exam: June 18 2023 PERSONAL HEALTH HISTORY Childhood illness: O Measles (Mumps O Rubella O Chickenpox []Rheumatic Fever [] Polio | 0 Tetanus OC Pneumonia Immunizations and dates: OC. Hepatitis OU) Chickenpox O influenza {| C2 MMR Measies, Mumps, Rubella —____]} |__ List any medical problems that other doctors have diagnosed Acute Lower Back Pain Surgeries Year Reason Hospital T Boowsona poneue 1 Compliéatons Asthins Aitack- Dochats YOM ita Other hospitalizations Year Reason Hospital Postoperative Observation ivi 4 Diabetic Complications Chest Divine Mercy ain Evaluation il P, Hospital 7 |__Have you ever had a blood transfusion? Oy ON |_ Allergies to medications L Name the drug Reaction you had Hospital Pollen Watery eyes Greenfield Provincial Hospital"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contanred in this questionnaire are strictly confidential and wili become part of your medical record. _ Teresa Lopez Om GF pos: Marci (Partnered CMarried ()Diverced Pretows' oF referring doctor: aa sereacotss Beth Ramirez ate of fast phy i i L us List any med medical problems that t other doctors have diagnosed | Acute Lower Back Pain oe i Re con REE Ea DockS2 YY ital a —{— oe 4 Postoperative Observation Diabetic Complications Chest Divine Mercy Pain Evaluati ___ Hospital = ain Evaluation “ese _| | a Watery eyes Greenfield Provincia! Hospital i a |"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record Name (Last First. MI) Teresa Lopez M F pos: March 23 1999 Marital status: Single (Partnered ]Marnied Separated (ODworced Widowed Previous or referring doctor: Beth Ramirez Date of last physical exam: June 18 2023 PERSONAL HEALTH HISTORY CJ Polio Childhood illness: Measles (J Mumps \"] Rubella (0 Chickenpox (J Rheumatic Fever Tetanus C Pneumonia Immunizations and dates: J] Hepatitis CO Chickenpox Influenza MMR Measles, Mumps, Rubella List any medical problems that other doctors have diagnosed Acute Lower Back Pain Surgeries Year Reason Hospital Pneumonia Diabetic, . Eastyjew Nee ‘Compheations Ast ma Attack- Doctors ospital 1 Other hospitalizations Postoperative Observation Divine Mercy Diabetic Complications Chest _ [ al Pain Evaluation Hospital Year Reason Have you ever had a blood transfusion? y ON. Allergies to medications Hospital Reaction you had Greenfield Provincial Hospital Watery eyes Name the drug Pollen"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM yuestions contained in this q slionnaire are strictly confidential and of your medical re feresa Lopez C Married _Beth Ramirez _ eumonia Diabetic 7 East ‘conf iauran Asthma tack Doctors Hospi ital: Posto perative Observation Divine Mal Diabetic Complications Chest fe E Hospital _"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM dential and wi bacome part of your Mm naire are strictly cor AH questions Severe aiigraine F Episode Acute yi Appendicitis iabetic Complications i f sth sn beauelentah™? Riverside Observation tea ye orci tute"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record Name (ast, First, MI) Alyssa Vasquez Om OF vos: August 27 2006 Marital status (Single (Partnered (Married (Separated (Divorced (Widowed Previous or referring doctor: Janet Mendoza Date of last physical exam: December 02 2015 PERSONAL HEALTH HISTORY Childhood iliness (Measles []Mumps [Rubella [J Chickenpox [J Rheumatic Fever [J Polio. T a CO Tetanus CO Pneumonia Immunizations and dates: CO Hepatitis C1 Chickenpox F) influenza CO MMR Measles, Mumps, Rubella List any medical problems that other doctors have diagnosed Mild Dehydration Surgeries Year Reason Hospital Severe Migraine Episode Acute CityCa re Appendicitis Diabetic Complications Other hospitalizations Year Reason Hospital 4+ Ches} Frain pyaluation Asthma ' t toperat iverside (MSpcancion? Hebel see ute. Have you ever had a blood transfusion? Oy ON Allergies to medications T Name the drug Reaction you had Hospital Dust Mites Hives Metro General Hospital"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HI ISTORY FORM F medical Alle this questiona nso MED Alyssa Vasquez OF 998: August 27 2606 Ci widowed Previous oy referring doctor, Janet Mendoza Date t CityCare- ‘Medical Center His Oheshp i Beales dthrne may eBWEl side. 1983. ______ Observation __ Health ‘Instiiute:"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record Name (Last First, ML) Alyssa Vasquez Om Ce vos: August 27 2006 Marital status: OSingle (Partnered (Married (Separated (Divorced (Widowed Previous or referring doctor: Janet Mendoza Date of last physical exam: December 02 2015 PERSONAL HEALTH HISTORY Childhood illness: [] Measles [JMumps [Rubella [Chickenpox []Rheumatic Fever _[] Polio eas O Tetanus Pneumonia Immunizations and dates: CO Hepatitis CO Chickenpox C1 Influenza C1 MMR Measies, Mumps, Rubella List any medical problems that other doctors have diagnosed Mild Dehydration Surgeries Year Reason Hospital r Severe Migraine Episode Acute 7 Cit Care t Appendiettis Diabetic Complications p fi y C t Other hospitalizations Year Reason Hospital T Cine Ell eller Asthma Checrn on ‘Health fe eute- Have you ever had a blood transfusion? Oy On Allergies to medications Name the drug Reaction you had Hospital Dust Mites Hives Metro General Hospital"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM Ail questions contained in this quest and will become wart of your medical record. immunization CityCare Meai cal Center pain 5 valuatio Asi as ostoperative Observation"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "medicalrecord",
        "ocr_text": "Alid 24 2620 Stacy Pace ve pos: June 2 cjmMarried January pate of fast physical exe\" Previous actured Arm a fe eentie veg Bshyaration ‘Pr rowneial H Feld tat tal: c i\" San Rafgel Community ospital aye -asthg va Mack Severe M Episode Fractured Ara"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record. Name cast Fist M1) Stacy Pace Om OF vos: June 21 2020 Marital status: OSingle OPartnered OMarried OSeparated ODivorced Widowed Previous or referring doctor: Christopher Flores Date of last physical exam: January 20 1997 PERSONAL HEALTH HISTORY Childhood illness: [] Measles [Mumps [JRubella OChickenpox _ [)Rheumatic Fever [] Polio Immunizations and dates: 1 tetas 1 Preumonia CO hepatitis OU. Chickenpox CO influenza C1 MMR Measles, Mumps, Rubella List any medical problems that other doctors have diagnosed Postoperative Recovery Status Surgeries Year Reason Hospital b 3018 Appentdiaate! ani Shteiration J Provingel [eS ital Other hospitalizations Year Reason Hospital Asthma Attack Severe Migraine San Rafael 7 7 Episode FracturedArm Community Hospital 5 Have you ever had a blood transfusion? Oy On Allergies to medications Name the drug Reaction you had Hospital Dairy Products Nausea and vomiting Eastview Doctors Hospital"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM on Name cease Fae As) Sta acy Pace sor o98 June 21 2020 Marital status Sangte Partnered “IMaraed Separater (1 lwerced J Wictowed Previous or referring doctor Christopher Flores Date of fast physical exam January 20 1997 PERSONAL HEALTH HISTORY Chiidhood itiness. Me linewunizations and gates Surgeries 5 4 5 Fr. Arm Acut ofl $018 rool SS Dehydration Pron SSEt ES: izations a) 4 Episode Fractured Arm _ Communi BS SSpital 2 “Asthma Attack Severe Migraine Have you ever had a blooo transfusion? ty N Allergies to"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM Fidentia’ and will become aire tly cont fin this question A questions cont Stacy Pace Mame dast, Fast, ML wate us: ng doctor “Christopher Flores _ \"Postoperative Recovery Status i Fractured Arm A 1 ‘Appendiait ‘Sévere Dshyaration 4 “asthma Attack Severe Migraine San an Rafas! Ep! isode Fractured Arm Community iSbpital +"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record. Name (ast, First, Mi) Stacy Pace Om OF vos: June 21 2020 Marital status: OSingle CiPartnered (Married CiSeparated ODivorced (Widowed Previous or referring doctor: Christopher Flores Date of last physical exam: January 20 1997 PERSONAL HEALTH HISTORY Childhood illness: [Measles [)Mumps [JRubella [] Chickenpox [Rheumatic Fever [J Polio Immunizations and dates: Lh an Ones CO Hepatitis O Chickenpox O influenza OC MMR Measles, Mumps, Rubella List any medical problems that other doctors have diagnosed Postoperative Recovery Status Surgeries Year Reason Hospital tT 7 8 j TAppencinie wan Boe ication T Provnesitcsotea Other hospitalizations Year Reason Hospital i Asthma Attack Severe Migraine San Rafael t zh af Episode Fractured Arm Semin Sb oital =| Have you ever had a blood transfusion? Oy ON Allergies to medications Nausea and vomiting Name the drug Dairy Products Eastview Doctors Hospital"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record. Om OF _ bos: December 13 Name (Last First, M1 Nicholas Estes Marital status: OSingle (Partnered (Married (Separated Divorced (Widowed Previous or referring doctor: Tri stan Estes Date of last physical exam: December 01 2019 PERSONAL HEALTH HISTORY Childhood iliness: []Measles [)Mumps _ Rubella Li chickenpox __ JRheumatic Fever__ [1 Polio Immunizations and dates: Lene 1 Pneumonia C Hepatitis 0 Chickenpox O influenza (CO MMR Measies, Mumps, Rubella List any medical problems that other doctors have diagnosed Upper Respiratory Tract Infection Surgeries _- Year Reason Hospital r pneumonia Acute Appendicitis “Our Lady of Hope fT Acute Appendicitis Medical Center —— Other hospitalizations Year T Reason Hospital +Pneumonia Asthma Attack? S red He 7 2034 7 Shest Pain valuation I iiedical ean Have you ever had a blood transfusion? Or ON Allergies to medications Name the drug Reaction you had Hospital Eggs Dizziness Divine Mercy Hospital 1"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record Nicholas Estes mu Oe coe Decgmper 13 Name (Last, First, MI) Marital status: Single Partnered Married Separated Divorced Widowed Previous or referring doctor: Tristan Estes Date of last physical exam: December 01 2019 PERSONAL HEALTH HISTORY Childhood iliness: Measles Mumps Rubella Chickenpox Rheumatic Fever Polio Immunizations and dates: [ED tence vn nas Pre oa List any medical problems that other doctors have diagnosed Upper Respiratory Tract Infection Surgeries Year Reason Hospital 1879 “Pneumonia Acute Appendicitis “Our Lady of Hope’ Acute Appendicitis Medical Center Other hospitalizations Year Reason Hospital 3931 Preumenla Amada’ vedestBaviion. Have you ever had a blood transfusion? Y N Allergies to medications Hospital Name the drug Reaction you had Divine Mercy Hospital Eggs Dizziness"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record Name case Fist M1) Nicholas Estes Om OF vos Decgpber 13 Marital status: OSingle (CiPartnered (Married CiSeparated ODivorced (Widowed Previous or referring doctor: Tristan Estes Date of last physical exam: December 01 2019 PERSONAL HEALTH HISTORY Childhood illness: Ui Measles (Mumps D Rubella 0 Chickenpox Rheumatic Fever Polio Tetanus Pneumonia Immunizations and dates: o Oo O Hepatitis O Chickenpox O influenza (MMR Measles, Mumps, Rubella List any medical problems that other doctors have diagnosed Upper Respiratory Tract Infection Surgeries Year Reason Hospital r Pneumonia Acute Appendicitis }Our Lady of Hope Acute Appendicitis Medical Center Other hospitalizations Year Reason Hospital 283) Prgumenia Aatnme Attack |, Sacred Heart Have you ever had a blood transfusion? Oy On Allergies to medications Name the drug Reaction you had Hospital Eggs Dizziness Divine Mercy Hospital"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY FORM All questions contained in this questionnaire are strictly confidential and will become part of your medical record, Name (ast, frst M1) Nicholas Estes Cm OF vos, Decgnber 13 Marital status: OSingle C Partnerea OiMarried [Separated [Divorced ]Widowed Previous or referring doctor: Tristan Estes Date of last physical exam: December 01 2019 PERSONAL HEALTH HISTORY Childhood illness: [Measles []Mumps __ JRubella [Chickenpox []Rheumatic Fever [J Polio Tet Pr Immunizations and dates: O Tetanus O Pneumonia CO Hepatitis OC Chickenpox C1 influenza CO MMR Measles, Mumps, Rubella List any medical problems that other doctors have diagnosed Upper Respiratory Tract Infection Surgeries Year Reason Hospital r Pneumonia Acute Appe endicitis +Our Lady of Hope Acute Appendicitis Medical Center Other hospitalizations Year Reason Hospital Tee Paine yTadNteCk sacred Heart Have you ever had a blood transfusion? Oy ON Allergies to medications Name the drug Reaction you had Hospital Eggs Dizziness Divine Mercy Hospital"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "medicalrecord",
        "ocr_text": "MEDICAL HISTORY ee StiOns cont, stionnaire are strictly contigs and will become part of your me PERSONAL Hz, “Pneumonia Acute Ay pendiciti t Acute te Appen iCitis to A s (Our L ady of Hope _ Medicai Center Phaume dla Asthma Attack: Cc hest ain Evaluation"
    }
]