[
    {
        "image": "meetingagenda1_synth_10_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY y Research and Development Office ACADEMIC COUNCIL MEETING AGENDA NO. 2024 025 DATE: December 28, 2025 FROM: Dr. Maria Santos, Chairperson EP OMOT-: sb eeee bon pete TPlenynuat cpt pay al bn om armed Lay Ls PROJECT: Strategic Planning for Curriculum Enhancement and Faculty Development Programs for Academic Year 2024 2025 1 CALL TO ORDER Roll call and determination of quorum Approval of agenda Approval of minutes from previous meeting (October 15, 2024) 1. ANNOUNCEMENTS AND COMMUNICATIONS Update on Commission on Higher Education (CHED} Memorandum Orders Upcoming accredifation visit by Philippine Association of Colleges and Universities (PACU) Recognition of faculty achievements and publications Student enroliment statistics for current semester [I]. CURRICULUM REVIEW AND DEVELOPMENT A. Proposed Program Revisions Bachelor of Science in Computer Science Integration of Artificial intelligence courses Bachelor of Aris in Communication Addition of igital Media Production track Master of Business Administration Updates to comply with CHED standards B. New Digital Media Production track Master of Business Administration Updates to comply with CHED standards B. New Course Proposals CS 301 Machine Learning and Data Analytics ENG 205 Creative Writing in Philippine Languages BUS 401 Social Entrepreneurship and Sustainable Business C. General Equcation Curriculum Reform Review of GE requirements alignment with K 12 program outcomes Proposed reduction of units to facilitate timely graduation integration of outcomes based education (OBE) framework IV. FACULTY DEVELOPMENT INITIATIVES Scholarship opportunities for graduate studies (CHED and university grants) Professional development workshops schedule (January June 2025) Research capacity building serninars »* Teaching excellence awards criteria and nomination process Mentoring program for new faculty members V. ACADEMIC POLICIES AND STANDARDS Revision of grading system and grade computation procedures Implementation of anti plagiarism software for student papers Guidelines for online and hybrid course delivery Academic integrity policy updates Student appeal and grievance procedures VI. RESEARCH AND PUBLICATION Research funding allocation for AY 2024 2025 Publication incentive program guidelines Partnerships with industry jar collaborative research Ethics review board orotocols and procedures University research journal editorial policies Vil. STUDENT WELFARE AND SUPPORT SERVICES Mental health and counseling services expansion Academic advising system improvements Library resources and digital database subscriptions Scholarship and financial assistance programs Career development and placement services Vill. BUDGET AND RESOURCES »« Budget allocation for academic programs and departments Facilities upgrading and classroom technology enhancement Laboratory equipment procurement priorities Faculty research and travel grants IX. UNFINISHED BUSINESS Follow up on previous action items and committee reports X. NEW BUSINESS Other matters for consideration X 1. ADJOURNMENT «© Next meeting i schedule: December 10, 2024, 2 00 PM, Admin Building Conference Room"
    },
    {
        "image": "meetingagenda1_synth_10_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIV ERSITY University Research and Development Office ING AGENDA NO. 2024 029 ACADEMIC COUNCIL MEET DATE: December 28, 2025 FROM: rograms Strategic Planning for Curriculum Enhancement and Faculty Development P Year 2024 2025 PROJECT: for Academic Yes 1. CALL TO ORDER Roll call and determination of quorum Approval of agenda Approval of minutes from previous 2024) il. ANNOUNCEMENTS AND COMMUNICATIONS Update cn Coramission oF Higher ~creditation visit by Philippine Association of Colleges and tics for current meeting (October 45, Education (CHED) Memorandum Orders Upcoming ac cognition of faculty achievements and publications liment statis WAND DEVELOPMENT A. Proposed Pro integration of Artificial intelligence COUTSES Bachelor of A Digital Media Production track Master of Business Administration U Course Propasals CS 301- Machine Learning and Data Analytics E neurship and Sustainable Business C. G Proposed reduction of Languages BUS 404 Social Entrepre Review of GE requirements alignment with K 12 program outcomes graduation integration of outcomes based education (OBE) framework IV. FACULTY DEVELOP Scholarship opportunities for graduate studies (CHED and university grants) Professional development workshops schedule (Januat June 2025) Research capacity building seminars Teaching excellence awards criteria and nomination process Mentoring program for new facully members V. ACADEMIC POLICIES AND STANDARDS Revision of grading sysiem and grade computation procedures implementation of anti pilagiarism software for student papers Guidelines for online and hybrid course delivery Academic integrity policy updates Student appeal and grievance procedures VI. RESEARCH AND PUBLICATION Research funding allocation for AY 2024 2029 Publication incentive program guidelines Parinerships with industry for collaborative research Ethics review board protocols and procedures University regearen journal editorial policies Vil, STUDENT WELFARE AND SUPPORT SERVICES Mental health and ling services expansion Academic advising system improvements Library igital database subscriptions Scholarship and financial assisiance programs Career development AND RESOURCES Budget allocation for academic programs and y enhancement Laboratory equipment procurement Follow up of previous action items and DJOURNMENT Next meeting Student enre gram Revisions Bachelor ris in Communication Addition of pdaies to comply with CHED standards B. New NG 205 Creative Writing in Philippine eneral Education Curriculum Reform units to facilitate timely MENT INITIATIVES of Science in Universities (PACU)® Re semester I. CURRICULUM REVIE Computer Science coOUunse and placement services Vill. BUDGET departments Facilities upgrading and classroom technoiog research and travel grants 1X. UNFINISHED BUSINESS x. NEW BUSINESS Other matiers for consideration XLA ce Room priorities Faculty 40, 2024, 9 00 PM, Admin Building Conferen oramittee reports schedule: December"
    },
    {
        "image": "meetingagenda1_synth_10_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY University Research and Development Office ACADEMIC COUNCIL MEETING AGENDA NO. 2024 025 DATE: December 28, 2025 FROM: Dr. Maria Santos, Chairperson PROJECT: Strategic Planning for for Academic Year 2024 2025 Items of Discussion: ems Of Discussion: Integration of Artificial Intelligence cour Digital Media Production track Maste Course Proposals CS 301 graduation Integration of out Scholarship Opportunities fo schedule (January June 20 Ccomes based education Program guidelines P Protocols and Procedures University resea SERVICES. Mental health artnerships with rch journal editor; and placement Services \\/]| departments Facilities up i Priorities Faculty researc committee reports x. NE schedule: December 1 0, h and travel grants IX. UNFINISHE W BUSINESs. Other matters for co 2024, 2 00 PM, Admin Building Con Curriculum Enhancemen EVELOPMENT A. Proposed Pro gnment with K 12 Program outc ial policies VII. STUDENT WELF ference Room t and Faculty Development Programs ses Bachelor of Arts j ftware for student Student appeal and Research fundi i ng allocation for AY 2024 2025 industry for Colla borative research Ethics review board ARE AND SUPPORT Mprovements Library nancial assistance Programs Career development dget allocation for academic Programs and enhancement Laboratory equipment Procurement D BUSINESs. Follow up On previous action items and nsideration x]. ADJOURNMENT Next meeting"
    },
    {
        "image": "meetingagenda1_synth_10_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY University Research and Development Office ACADEMIC COUNCIL MEETING AGENDA NO. 2024 025 DATE: December 28, 2025 FROM: Dr. Maria Santos, Chairperson PROJECT: Strategic Planning for Curriculum Enhancement and Faculty Development Programs for Academic Year 2024 2025 Items of Discussion: |. CALL TO ORDER Roll call and determination of quorum *« Approval of agenda Approval of minutes from previous meeting (October 15, 2024) Il. ANNOUNCEMENTS AND COMMUNICATIONS Update on Commission on Higher Education (CHED) Memorandum Orders Upcoming accreditation visit by Philippine Association of Colleges and Universities (PACU) Recognition of faculty achievements and publications Student enrollment statistics for current semester il]. CURRICULUM REVIEW AND DEVELOPMENT A. Proposed Program Revisions Bachelor of Science in Computer Science Integration of Artificial Intelligence courses Bachelor of Arts in Communication Addition of Digital Media Production track Master of Business Administration Updates to comply with CHED standards B. New Course Proposals CS 301 Machine Learning and Data Analytics ENG 205 Creative Writing in Philippine Languages BUS 401 Social Entrepreneurship and Sustainabie Business C. General Education Curriculum Reform Review of GE requirements alignment with K 12 program outcomes Proposed reduction of units to facilitate timely graduation Integration of outcomes based education (OBE) framework IV. FACULTY DEVELOPMENT INITIATIVES Scholarship opportunities for graduate studies (CHED and university grants) Professional development workshops schedule (January June 2025) Research capacity building seminars Teaching excellence awards criteria and nomination process Mentoring program for new faculty members V. ACADEMIC POLICIES AND STANDARDS Revision of grading system and grade computation procedures Implementation of anti plagiarism software for student papers Guidelines for online and hybrid course delivery Academic integrity policy updates Student appeal and grievance procedures VI. RESEARCH AND PUBLICATION Research funding allocation for AY 2024 2025 Publication incentive program guidelines Partnerships with industry for collaborative research Ethics review board protocols and procedures University research journal editorial policies VII. STUDENT WELFARE AND SUPPORT SERVICES Mental health and counseling services expansion Academic advising system improvements Library resources and digital database subscriptions Scholarship and financial assistance programs Career development and placement services Vil. BUDGET AND RESOURCES Budget allocation for academic programs and depariments Facilities upgrading and classroom technology enhancement Laboratory equipment procurement priorities Faculty research and travel grants IX. UNFINISHED BUSINESS Follow up on previous action Items and committee reports X. NEW BUSINESS Other matters for consideration Xl. ADJOURNMENT Next meeting schedule: December 10, 2024, 2 00 PM, Admin Building Conference Room"
    },
    {
        "image": "meetingagenda1_synth_10_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MAN! Uni LA UNIVERSITY and Development Office eit versity Research ACADEMIC COUNCIL MEETING AGENDA No. 2024 025 December 28, 2025 FROM: Or. Maria Sanios, Chairperson PROJEC Py Strategic Planning for Curricuturn Enhancement and Faculty Development Programs for Academic Year 2024 2025 Items of Dise on: CALL To ORDER Roi Cali and determin meeting (October 15, 2024) fh. ANN Education (CHED) Memorand ation of quorum A OUNCE) (ENTS A um Orders Une. Pproval of agends Approva ND COMMUNICATI Of minutes frorn pre IONS Update Vious on Commission on Higher oming accreditation visit by Philippine Association of Colleges and Universities (PACU) Recognition of faculty achievernents semester [H, CURR] CULUM REVIEW AND DEVEL Computer Science | integration of Antificial Digital Media Production track Course Proposals CS 301 Languages BUS 4074 Soci Review of G and publications Student enroll OPMENT A. Proposed Program Revis 1Ce in intelligence Courses Bachelor of Arts in Communication Addition of Master of By isine usINeSs Administration Updates to comply with CHED Standards B. New Machine Learning and Data Analytics ENG 2 ppine Sg j p ment statistics for current ions Bachelor of Scier E requirements Graduation e Integration of Scholarship Opportuniti schedule (January outcomes b &S for graduate ~June 2025) Research capacity buif Nomination process asec education (OBE hip and Sustainable Busine ‘eral Education Curr alignment wi Cilifate timely CULTY DEVELO studies (CHED and univers 205 Creative Writing in Phil al Entrepreneurs! SS C. Gene iculum Reform fh K 42 Program outcomes Proposed reduction of units to fa framewerk iV. FACI OPMENT INITIATIVES ity Grants) Professional q evelopment workshops ding seminars Teaching excellence awards criteria and Mentoring Program for new faculty members ACADEMIC POL Revision of Grading system and grade comp Papers Guid ine and hybri CIES A Utation Procedures lines for onl d course delivary ND STANDARDS Implementation grievance proce of antl plagiarisr Software for Student * Academic integrity Policy updates Student SPpeal and dures Vj, RESEARCH AND PUBLICATION Research funding Allocatior Publication incentive Program guidelines Part Nershins with j Protocols and D lior AY 2024 2025 Ndustry for collaborative fes arch Ethics review board Procedures University research journal editorial Policies VIL. STUDENT w SERVICES Mental health and counseling resources and digital database ELFARE AND SUPPORT Sérvices expansion Ac and placement Services VIL B eademic advising system improvements Library SUDScriptions Scholarship and financial 8ssistance Programs Ca UDGET AND RESOURCES Budget allocation for academic departments Facilities Udgrading and classroom technology enhancement Labo culty research and travel Grants IX, UNFINISHED BUSINESS Follow up On Previous action items and ittee reports x NEW BUSINESS. Other matters for consideration x1. ADJOURNMENT Next meeting Schedule: Deo 2 00 PMA ding Conference Room reer development Programs and ratory equipment Procurement Priorities Fa, comm ember 10, 2024 admin Buil"
    },
    {
        "image": "meetingagenda1_synth_1_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Offi DATE: November 09, 2025 FROM: Dr. Rosa Reyes, Director PROJECT: Annual Research Conference Planning and Research Calendar Year 2025 Ite ms of Discussion: plementation of et issue 2 fH]. RESEARCH CONFERENCE 2025 A C Sustainability: Research for Target Participants: 500 researchers, Students, indy Scientists and industry leaders) Plenary Sessions o discipline Poster Presentation sessions for student Conference Committees National Development\" Dat Technical Program Committee and Secretariat Committee . Budget and Funding Regi industry partners University budget all GRAMS A. Internal Research Grants e upport program Graduate thesis and di Publication RESEARCH GRANT PRO Undergraduate research s valuation criterig Monitoring and evaluation Procedures B. Externaj Fundi for Industry, Energy and Emergi research collaboration programs industry- compliance requirements V. ETHICS REVIEW BOARD Review guidelines for human subjects res fe) Search projects Training Programs on rights and technology transfer Proposal writing and grant and Manuscript preparatior COLLABORATION Mem Management training Data analysi seminars Research presentation skills *P Frogress reports from ongoing Research ou tput submission and complian ition and awards Program U cember 5, 2024, 10 00 AM, Research Offi hics review recommendations onference Theme and €S: March 15 16, stry partners B. Progr: researchers composition and responsibiliti Stration fees structure (faculty, Sponsored research Projects € report grity VI. RESEARCH OUTPUT AND py University research journal editori Workshops S software training (SPSS, R, NViv Community- Pdates on research- ce Conference Room ce of the Vice Chancellor for Academic Affairs RESEARCH COMMITTEE MEETING AGENDA No. 2024 012 Grant Management for Adoption of agenda Reading and US MINUTES Status of approved On Of research journal volume 42, Publicati Format Theme: 2025 Venue: Un am Structure n research trends ang Priorities Par. \"Innovation and iversity Convention Center Keynote Speakers (national allel technical Sessions by and recognition ceremony C. &S Logistics and Venue on Committee Sponsorship and Students, externa} Participants) Cost estimates and financial! projections fv. esearch grant allocation for 2025 n grants Application deadlines and Philippine Council International tion and Updates to ethical Research awards and Documentati Ocation Faculty r Ssertatio INg Opportunities DOST- h Grants and Scholarships Orientation for grant applica f pending research protocols e on research methodology and Statistics 0) Academic writing development Vil}. PARTNERSHIP AND Research Collaboration with local government based participatory research initiatives Ix, research projects Financial accountability and ce Impact assess ment of completed research X. related policies and guidelines"
    },
    {
        "image": "meetingagenda1_synth_1_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Office of the Vice Chancellor for Academic Affairs RESEARCH COMMITTEE MEETING AGENDA NO. 2024 012 DATE: November 09, 2025 F ROM i Dr. Rosa Reyes, Director PROJECT: Annual Research Conference P} Calendar Year 2025 Items of Discussion: !. ATTENDANCE AND PRELIMI epproval of minutes (September research proposals Imp! Committee Registration Fundraising Committee Sponsorship packages RESEARCH GRANT P Undergraduate researc impact &Sséssment VII. RESEA Proposal writing and and Manuscript prep COLLABORATION units International r MONITORING AND liquidation requirements Rese OTHER MATTERS .« Research XI. NEXT MEETING De D. Budget and Funding Regis for industry Partners grant management train aration seminars Memorand Search ne EVALUAT] cember 5, 2024, 10 00 AM, and Secretariat Committee arch output submission and co recognition and awards progra ing Data analysi Research Presentation skjl} um of Agreement with industry tworks and Partnerships Com ON Progress reports from on Dates: March 15- Workshops Ss so Parine Munity base Mpliance im ms Up Research Office Confe Research Grants and Schol S development Vill. PARTN TS Research collaborat; i going research Projects S$ Publication of research 7eme and Format Theme: journal volume 4 2, \"Innovation and 16, 2025 Venue: U location for 2025 Application deadlines and cedures B. External Fundin 9 Opportunities DOST Philippine Council arships International application and ,R, NVivo) d Participatory research initiatives IX. Financial accountability and Pact assessment of compieted research xX, related policies and guidelines rence Room"
    },
    {
        "image": "meetingagenda1_synth_1_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Office of the Vice Chancellor for Academic Affairs RESEARCH COMMITTEE MEETING AGENDA NO. 2024 012 DATE: November 09, 2025 FROM: Dr. Rosa Reyes, Director PROJECT: Annual Research Conference Planning and Research Grant Management for Calendar Year 2025 Items of Discussion: |. ATTENDANCE AND PRELIMINARIES Verification of attendance and quorum Adoption of agenda Reading and approval of minutes (September 20, 2024) Il. MATTERS ARISING FROM PREVIOUS MINUTES Status of approved research proposals Implementation of ethics review recommendations Publication of research journal volume 12, issue 2 Ill. RESEARCH CONFERENCE 2025 A. Conference Theme and Format Theme: \"Innovation and Sustainability: Research for National Development\" Dates: March 15 16, 2025 Venue: University Convention Center Target participants: 500 researchers, students, industry partners B. Program Structure Keynote speakers (national scientists and industry leaders) Plenary sessions on research trends and priorities Parallel technical sessions by discipline Poster presentation sessions for student researchers Research awards and recognition ceremony C. Conference Committees Technical Program Committee composition and responsibilities Logistics and Venue Committee +» Registration and Secretariat Committee Publications and Documentation Committee Sponsorship and Fundraising Committee D. Budget and Funding Registration fees structure (faculty, students, external participants) Sponsorship packages for industry partners University budget allocation Cost estimates and financial projections IV. RESEARCH GRANT PROGRAMS A. Internal Research Grants Faculty research grant allocation for 2025 Undergraduate research support program Graduate thesis and dissertation grants Application deadlines and evaluation criteria Monitoring and evaluation procedures B. External Funding Opportunities DOST Philippine Council for Industry, Energy and Emerging Technology Research CHED Research Grants and Scholarships International research collaboration programs Industry sponsored research projects Orientation for grant application and compliance requirements V. ETHICS REVIEW BOARD Review of pending research protocols Updates to ethical guidelines for human subjects research Animal ethics committee report Continuing review of ongoing research projects Training programs on research ethics and integrity VI. RESEARCH OUTPUT AND PUBLICATION University research journal editorial board report Publication incentive program implementation Intellectual property rights and technology transfer Research repository and database management Citation analysis and research impact assessment VII. RESEARCH CAPACITY BUILDING Workshops on research methodology and statistics Proposal writing and grant management training Data analysis software training (SPSS, R, NVivo) Academic writing and manuscript preparation seminars Research presentation skills development VIII. PARTNERSHIP AND COLLABORATION Memorandum of Agreement with industry partners Research collaboration with local government units International research networks and partnerships Community based participatory research initiatives IX. MONITORING AND EVALUATION Progress reports from ongoing research projects Financial accountability and liquidation requirements Research output submission and compliance Impact assessment of completed research X. OTHER MATTERS Research recognition and awards program Updates on research related policies and guidelines XI. NEXT MEETING December 5, 2024, 10 00 AM, Research Office Conference Room"
    },
    {
        "image": "meetingagenda1_synth_1_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Office of the Vice Chancellor for Academic Affairs RESEARCH COMMITTEE MEETING AGENDA NO. 2024 012 DATE: November 09, 2025 FROM: Dr. Rosa Reyes, Director PROJECT: Annual Research Conference Planning and Research Grant Management for Calendar Year 2025 ATTENDANCE AND PRELIMINARIES Verification of attendance and quorum Adoption of agenda Reading and approval of minutes (September 20, 2024) Il. MATTERS ARISING FROM PREVIOUS MINUTES Status of approved research proposals Implementation of ethics review recommendations Publication of research journal volume 72, issue 2 (ll. RESEARCH CONFERENCE 2025 A. Conference Theme and Format Theme: \"Innovation anc Sustainability: Research for National Development\" Dates: March 15 16, 2025 Venue: University Convention Center Target participants: 500 researchers, students, industry partners B. Program Structure Keynote speakers (national scientists and industry leaders) Plenary sessions on research trends and priorities Parallel technical sessions by discipline Poster presentation sessions for student researchers Research awards and recognition ceremony C. Conference Committees Technical Program Committee composition and responsibilities Logistics and Venue Committee Registration and Secretariat Committee Publications and Documentation Committee Sponsorsnip and Fundraising Committee D. Budget and Funding Registration fees structure (faculty, students, external participants) Sponsorship packages for industry partners University budget allocation Cost estimates and financial projections lV. RESEARCH GRANT PROGRAMS A. Infernal Research Grants Faculty research grant allocation for 2025 Undergraduate research support program Graduate thesis and dissertation grants Application deadlines and evaluation criteria Monitoring and evaluation procedures B. External Funding Opportunities DOST Philippine Council for Industry, Energy and Emerging Technology Research CHED Research Grants and Scholarships international research collaboration programs Industry sponsored research projects Orientation for grant application and compliance requirements V. ETHICS REVIEW BOARD Review of pending research protocols Updates to ethical guidelines for human subjects research Anirnal ethics committee report Continuing review of ongoing research projects Training prograrns on research ethics and integrity VI. RESEARCH OUTPUT AND PUBLICATION University research journal editorial board report Publication incentive program implementation Intellectual property rights and technology transfer Research repository and database management Citation analysis and research impact assessment Vil. RESEARCH CAPACITY BUILDING Workshops on research methodology and staiistics Proposal writing and grant management training Data analysis software training (SPSS, R, NVivo) Academic writing and manuscript preparation seminars Research presentation skills development Vill. PARTNERSHIP AND COLLABORATION Memorandurn of Agreement with industry partners Researcn collaboration with local government units International research networks and partnerships Community based participatory research initiatives IX. MONITORING AND EVALUATION Progress reports from ongoing research projects Financial accountability and liquidation reauirements Research oulput submission and compliance Impact assessrnent of cornpleted research X. OTHER MATTERS Research recognition and awards program Updates on research related policies and guidelines XL NEXT MEETING December 5, 2024, 10 00 AM, Research Office Conference Room"
    },
    {
        "image": "meetingagenda1_synth_1_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Office of the Vice Chancellor for Academic Affairs RESEARCH COMMITTEE MEETING AGENDA NO. 2024 012 DATE: November 09, 2025 FROM: Dr. Rasa Reyes, Director PROJECT: Annual Research Conference Planning and Research Grant Management for Calendar Year 2025 Items of Discussi |. ATTENDANCE AND PRELIMINARIES Verification of attendance and quorum Adoption of agenda Reading and approval of minutes (September 20, 2024) Il. MATTERS ARISING FROM PREVIOUS MINUTES Status of approved research proposals implementation of ethics review recommendations Publication of research journal volume 12, issue 2 ll. RESEARCH CONFERENCE 2025 A. Conference Theme and Format Theme: “Innovation and Sustainability: Research for National Development” Dates: March 15 16, 2025 Venue: University Convention Center Target participants: 500 researchers, students, industry partners B. Program Structure Keynote speakers (national scientists and industry leaders) Plenary sessions on research trends and priorities Parallel technical sessions by discipline Poster presentation sessions for student researchers Research awards and recognition ceremony C. Conference Committees Technical Program Committee composition and responsibilities Logistics and Venue Committee Registration and Secretariat Committee Publications and Documentation Committee Sponsorship and Fundraising Committee D. Budget and Funding Registration fees structure (faculty, students, external participants) Sponsorship packages for industry partners University budget allocation Cost estimates and financial projections IV. RESEARCH GRANT PROGRAMS A. Internal Research Grants Faculty research grant allocation for 2025 Undergraduate research support program Graduate thesis and dissertation grants Application deadlines and evaluation criteria Monitoring and evaluation procedures B. External Funding Opportunities DOST Philippine Council for Industry, Energy and Emerging Technology Research CHED Research Grants and Scholarships International research collaboration programs Indusiry sponsored research projects Orientation for grant application and compliance requirements V. ETHICS REVIEW BOARD Review of pending research protocols Updates to ethical guidelines for human subjects research Animal ethics committee report Continuing review of ongoing research projects Training prograrns on research ethics and integrity Vl. RESEARCH OUTPUT AND PUBLICATION University research journal editorial board report Publication incentive program implementation Intellectual property rights and technology transfer Research repository and database management Citation analysis and research impact assessment Vil. RESEARCH CAPACITY BUILDING Workshops on research methodology and statistics Proposal writing and grant management training Data analysis software training (SPSS, R, NVive) Academic writing and manuscript preparation seminars Research presentation skills development VII. PARTNERSHIP AND COLLABORATION Memorandum of Agreemeni with industry partners Research collaboration with iccal government units International research networks and partnerships Community based participatory research initiatives IX. MONITORING AND EVALUATION Progress reports from ongoing research projects Financial accountability and liquidation requirements Research output submission and compliance Impact assessment of completed research X. OTHER MATTERS Research recognition and awards program Updates on research related policies anc guidelines XL NEXT MEETING Decernber 5, 2024, 10 00 AM, Research Office Conierence Room"
    },
    {
        "image": "meetingagenda1_synth_2_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Graduate School Academic Committee =TING AGENDA NO. 2024 003 CURRICULUM COMMITTEE ME DATE: November 05, 2025 FROM: Dr. Antonio Cruz, Vice President PROJECT: Comprehensive Curriculum Review and Program Rationalization Study for All Academic Depariments MEETING PRELIMINARIES Attendance verification and establishment of quorum Approval of agenda anc supplementary materials Confirmation of minutes from previous session (September 30, 2024) Hi. UNFINISHED BUSINESS Follow up on curriculum revision proposals under review Status of CHED program compliance requirements Implementation progress of previously approved curriculum changes Hi. PROGRAM REVIEW AND EVALUATION A, Self Assessment Reports College of Engineering programs review summary College of Business Administration programs assessment College of Arts and Sciences programs evaluation Analysis of student performance and program outcomes B. External Assessments Accreditation visit findings and recommendations industry advisory board feedback compilation Alurnni and employer satisfaction survey results Benchmarking with comparable institutions VV. CURRICULUM DEVELOPMENT PROPOSALS A, New Program Offerings BS Data Science and Analytics feasibility study presentation Certificate Program in Digital Marketing proposal review MS Environmental Management curriculum framework Market demand analysis and resource requirements Financial sustainability and cost benefit analysis B. Program Modifications BS Nursing curriculum alignment with infernational standards BS Education specialization tracks expansion BS Psychology additional majors proposal Graduate program admission requirements revision C, Course Changes New course proposais (15 courses across departments) Course description and prerequisite updates Laboratory component enhancements General eaucation electives diversification V. OUTCOMES BASED EDUCATION IMPLEMENTATION Assessment of learning outcomes af program level Course learning outcome mapping and alignment verification Rubrics development for performance assessment Continuous quality improvement mechanisms Faculty training needs on OBE methodology VI. FLEXIBLE LEARNING MODALITIES Guidelines for online course development and delivery Quality standards for blended leaming courses Learning management system utilization training Assessment and evaluation methods for online learning Student support services for distance learners Vl. GENERAL EDUCATION CURRICULUM Review of GE program goais and student learning outcomes Integration of crilical thinking and 21st century skills Proposed reduction of GE units based on CHED guidelines Service learning and community engagement requirements Assessment of GE program effectiveness Vil. ACADEMIC CALENDAR AND POLICIES Proposed academic calendar for AY 2025 20268 Course offering schedules anc class programming Add drop and withdrawal policies review Grading system and grade point average computation Graduation requirements and residency mules 1X. FACULTY QUALIFICATION AND DEVELOPMENT Faculty qualification requirements per program Professional development neads assessment Graduate studies support for faculty upgrading Teaching load guidelines and adjustments Faculty performance evaluation criteria X, RESOURCE REQUIREMENTS Library resources and instructionai materiais Laboratory and classroom facilities needs Technology infrastructure requirements Budget allocation for curriculum implementation XI. QUALITY ASSURANCE Monitoring and evaluation framework Student feedback mechanism on curriculum Pericdic curriculum review schedule Documentation and records 7 STEPS AND ACTION ITEMS Assignment of working management Compliance with regulatory requirements Ki, NEXT S7 committees and fask forces Timeline for curriculurn revision implementation Next meeting: January 15, 2025, 9 00 AM, Academic Affairs Conference Hall"
    },
    {
        "image": "meetingagenda1_synth_2_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Graduate School Academic C CURRICULUM COMMITTEE MEETI ommittee NG AGENDA NO. 2024 009 DATE: November 05, 2005 FROM: Dr. Antenio Cruz, Vice Prasidant PROJECT: Comprehensive Curriculum Review and Program Rationalization Study for Al Academic Departments L MEETING PRELIMINARIES At Materials Confirmation of minute endance verification and establishment of quorum Approval of ag 8 from previous session (September 36, 2024) |], UNFINIGHE S$ Under review Status of CHED program c riculum changes |i, PROGRAM R Engineering programs review summary Co enda and Supplementary D BUSINESS -» Follow up on ompllance requirements implementation rogress of EVIEW AND EVALUATION A, Seif. College of llege of Business Administration programs assessment e College of Arts and Sciences Programs evaluation Analysis of stude ent performance and program outcomes B. External Assessments Accreditation visit findings and recommendations Indu satisfaction Survey results Banc} New Program Offerin curriculum revision proposal previously approved cur Assessment Reports Stry advisory board feedback compilation marking with comparable institutions IV, CU 98 BS Data Science Marketing proposal review «MS Environmental Man requirements Financial su Alurnni and employer RRICULUM DEVELOPMENT PROPOSALS A, and Analytics feasibility Study presentation Certifi ~ate Program in Digital agement curriculum framework Market demand an Stainability and cost benefit analysis B. Program Modifications +» BS Nursing curriculum alignment ndards BS Education specialization tracks expansion BS Psychology additional majors proposal Graduate program admission requirements revision C. Course Changes New Course proposals (15 courses across departments) Course description and brerequisite updates Laboratory component enhancements General education electives diversification V. OUTCOMES BASED EDUCATION IMPLEMENTATION Assessment of learnin program level Course learning outcome Mapping and alignment verification Rubrics Gevelopment for performance assessment Continuous quality improvement mechanisms raining needs on OBE methodology Vi. FLEXIBLE LEARNING MODALITIES Guidelines for online course development and delivery Quality standards for bien courses Leaming Management system utilization training Assessment and evaluation methods for online learning Student Support services for distance learners VI. GENERAL EDUCATION CURRICULUM Review of GE program goals and student learning outcomes Integration of critical thi ed reduction of GE units based on CHED sment of GE program effectiveness VI. mic calendar for AY 2025 2026 Course offering schedules and alysis and resource with international sta g GuUicomes at Faculty ded learning nking and 21st century skills Propas guidelines Service learning and community engagement requirements Asses ACADEMIC CALENDAR AND POLICIES Proposed acade; class programming Add drop and withdrawal policies review Grading system and grade point average computation Graduation requirements and residency rules 1x, FACULTY QUALIFICATION AND DEVELOPMENT Faculty qualification requirements per program Professional development needs assessment Graduate studies Support for faculty upgrading ustments Faculty performance evaluation crilerla X. RESOURCE REQUIREMENTS uctional materials Laboratory and classroom facilities needs Technol requirements Budget allocation for curriculum implementation XL QUALITY ASS mechanism on curriculum Periodic curriculum Pllance with regulatory requirements XI). NEXT STEPS committees and task forces Timeli ine for currleulurn revisio Academic Affairs Conference Hall Teaching load guidelines and adj Library resources and instr ogy infrastructure URANCE Monitoring and evaluation review schedule Decumeniation and records AND ACTION ITEMS Assignment of working framework Student feedback Management Com n implementation Next meeting: January 15, 2025, 9 00 AM,"
    },
    {
        "image": "meetingagenda1_synth_2_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Graduate School Academic Committee CURRICULUM COMMITTEE MEETING AGENDA NO. 2024 009 DATE: November 05, 2025 FROM: Dr. Antonio Cruz, Vice President hensive Curriculum Review and Program Rationalization Study for All PROJECT: Compre Academic Departments Ttems of Discussion: |. MEETING PRELIMINARIE roval of agenda and supplementary SHED BUSINESS Follow up on Implementation progress of sessment Reports College of t College of Arts and d establishment of quorum App September 30, 2024) Il. UNFINI ram compliance requirements AND EVALUATION A. Self As programs assessmen m outcomes B. External Assessments dvisory board feedback compilation Alumni and employer IV. CURRICULUM DEVELOPMENT PROPOSALS A. tation Certificate Program in Digital Market demand analysis and resource g curriculum alignment S Attendance verification an nfirmation of minutes from previous session der review Status of CHED prog hanges Ill. PROGRAM REVIEW ollege of Business Administration nce and progra materials Co curriculum revision proposals un previously approved curriculum c Engineering programs review summary Cc Sciences programs evaluation Analysis of student performa Accreditation visit findings and recommendations Industry a satisfaction survey results Benchmarking with comparable institutions New Program Offerings BS Data Science and Analytics feasibility study presen Marketing proposal review «MS Environmental Management curriculum framework requirements Financial sustainability and cost benefit analysis B. Program Modifications BS Nursin with international standards BS Education specialization tracks expansion BS Psychology additional majors proposal Graduate program admission requirements revision C. Course Changes New course proposals (15 courses across departments) Course description and prerequisite updates Laboratory co cements General education electives diversification V. OUTCOMES BASED EDUCATION IMPLEMENT mes at rse learning outcome mapping and alignment verification Rubrics development for performance mprovement mechanisms Faculty training needs on OBE methodology VI. FLEXIBLE LEARNING MODALITIES Guidelines for online course development and delivery Quality standards for blended learning courses Learning management system utilization training Assessment and evaluation methods for online learning Student support services for distance learners Vil. GENERAL EDUCATION CURRICULUM Review of GE program goals and student learning outcomes Integration of critical thinking and 24st century skills Proposed reduction of GE units based on CHED guidelines Service learning and community engagement requirements Assessment of GE program effectiveness VIII. ACADEMIC CALENDAR AND POLICIES Proposed academic calendar for AY 2025 2026 Course offering schedules and class programming Add drop and withdrawal policies review Grading system and grade point average computation Graduation requirements and residency rules 1X. FACULTY QUALIFICATION AND DEVELOPMENT Faculty qualification requirements per program Professional development needs assessment Graduate studies support for faculty upgrading Teaching load guidelines and adjustments Faculty performance evaluation criteria X. RESOURCE REQUIREMENTS nstructional materials Laboratory and classroom facilities needs Technology infrastructure tion for curriculum implementation XI. QUALITY ASSURANCE Monitoring and evaluation k mechanism on curriculum Periodic curriculum review schedule Documentation and records ith regulatory requirements XIl. NEXT STEPS AND ACTION ITEMS Assignment of working Timeline for curriculum revision implementation Next meeting: January 45, 2025, 9 00 AM, mponent enhan ATION Assessment of learning outco program level Cou assessment Continuous quality i Library resources and i requirements Budget alloca framework Student feedbac' management Compliance w committees and task forces Academic Affairs Conference Hall"
    },
    {
        "image": "meetingagenda1_synth_2_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY School Academic Committee Graduate CURRICULUM COMMITTEE MEETING AGENDA NO. 2024 009 DATE: November 05, 2025 FROM: Dr. Antonio Cruz, Vice President w and Program Rationalization Study for All PROJECT: Comprehensive Curriculum Revie Academic Departments Items of Discussion: d establishment of quorum Approval of agenda and supplementary |. MEETING PRELIMINARIES Attendance verification an materials Confirmation of minutes from previous session (September 30, 2024) ll. UNFINISHED BUSINESS Follow up on curriculum revision proposals under review Status of CHED program compliance requirements Implementation progress of y approved curriculum changes (ll. PROGRAM REVIEW AND EVALUATION A. Self Assessment Reports College of mmary College of Business Administration programs assessment College of Arts and Analysis of student performance and program outcomes B. External Assessments ndations Industry advisory board feedback compilation Alumni and employer ions IV. CURRICULUM DEVELOPMENT PROPOSALS A. tudy presentation Certificate Program in Digital m framework Market demand analysis and resource Nursing curriculum alignment previous Engineering programs review su Sciences programs evaluation Accreditation visit findings and re satisfaction survey results Benchmarking with comparable institut New Program Offerings BS Data Science and Analytics feasibility s Marketing proposal review MS Environmental Management curriculu requirements Financial sustainability and cost benefit analysis B. Program Modifications BS with international standards BS Education specialization tracks expansion BS Psychology additional majors proposal Graduate program admission requirements revision C. Course Changes New course proposals (15 courses across departments) Course description and prerequisite updates Laboratory component enhancements General education electives diversification V. OUTCOMES BASED EDUCATION IMPLEMENTATION Assessment of learning outcomes at Course learning outcome mapping and alignment verification Rubrics development for performance mprovement mechanisms Faculty training needs on OBE methodology VI. FLEXIBLE lines for online course development and delivery Quality standards for blended learning em utilization training Assessment and evaluation methods for online learning Student Vil. GENERAL EDUCATION CURRICULUM Review of GE program goals and student and 21st century skills Proposed reduction of GE units based on CHED t requirements Assessment of GE program effectiveness VIII. demic calendar for AY 2025 2026 Course offering schedules and Grading system and grade point average computation LIFICATION AND DEVELOPMENT Faculty qualification aduate studies support for faculty upgrading teria X. RESOURCE REQUIREMENTS ology infrastructure comme program level assessment Continuous quality i LEARNING MODALITIES Guide courses Learning management syst support services for distance learners learning outcomes Integration of critical thinking guidelines Service learning and community engagemen ACADEMIC CALENDAR AND POLICIES Proposed aca class programming Add drop and withdrawal policies review Graduation requirements and residency rules IX. FACULTY QUA rements per program Professional development needs assessment Gr d adjustments Faculty performance evaluation cri materials Laboratory and classroom facilities needs Techn curriculum implementation XI. QUALITY ASSURANCE Monitoring and evaluation Periodic curriculum review schedule Documentation and records XI. NEXT STEPS AND ACTION ITEMS Assignment of working n implementation Next meeting: January 45, 2025, 9 00 AM, requi Teaching load guidelines an Library resources and instructiona requirements Budget allocation for framework Student feedback mechanism on curriculum management Compliance with regulatory requirements committees and task forces Timeline for curriculum revisio Academic Affairs Conference Hall"
    },
    {
        "image": "meetingagenda1_synth_2_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Graduate School Academic Committee CURRICULUM COMMITTEE MEETING AGENDA NO, 2024 009 DATE: November 05, 2025 FROM: Dr. Antonio Cruz, Vice President PROJECT. Comprehensive Curriculum Review and Program Rationalization Study for All Academic Deparimenis Items of Disc MEETING PRELIMINARIES Attendance verification and establishment of querum Approval of agenda and supplementary materials Confirmation of minutes from previous session (September 30, 2024) fi). UNFINISHED BUSINESS Follow up on curriculum revision proposals under review Status of CHED program comp previously approved curriculum changes Hl. PROGRAM REVIEW AND EVALUATION A. Self Assessment Reports College of Engineering programs review summaly College of Business Administration programs assessment College of Aris and of student performance and program outcomes B. External Assessments fiance requirements implementation progress of Sciences programs evaluation Analysis Accreditation visit findings and recommendations Industry advisory board feedback compilation Alumni and employer satisfaction survey results Benchmarking with comparable institutions IV. CURRICULUM DEVELOPMENT PROPOSALS A. New Program Offerings BS Data Science and Analytics feasibility study presentation Certificate Program in Digital Marketing proposal review MS Environmental Management curriculum framework Market demand analysis and resource requirements Financial sustainability and cost benefit analysis B. Program Modifications BS Nursing curriculum alignment with international standards BS Education specialization tracks expansion BS Psychology additional majors proposal Graduate program admission requirements revision C. Course Changes New course proposals (15 courses across departments) Course description and prerequisite updates Laboratory component ennancemenis General education electives diversification V. OUTCOMES BASED EDUCATION IMPLEMENTATION Assessment of learning outcomes at program level Course leaming outcome mapping and alignment verification Rubrics development for performance assessment Continuous quality improvement mechanisms Faculty training needs on OBE methodology VI. FLEXIBLE LEARNING MODALITIES Guidelines for online course development and delivery Quality standards for blended igarning courses Learning management systern utilization training Assessment and evaluation methods for online learning Student support services for distance leamers VIL GENERAL EDUCATION CURRICULUM Review of GE program goais and student learning outcomes Integration of critical thinking and 21st century skilis Proposed reduction of GE units based on CHED guidelines Service learning and community engagement requiremenis Assessment of GE program effectiveness VIII. ACADEMIC CALENDAR AND POLICIES Proposed academic calendar for AY 2025 2026 Course offering schedules and class programming Add drop and withdrawal policies review Grading system and grade point average computation Graduation requirements and residency rules IX. FACULTY QUALIFICATION AND DEVELOPMENT Faculty qualification requirements per program Professional development needs assessment Graduate studies support for faculty upgrading Teaching load guidelines and adjustments Facuity performance evaluation criteria X. RESOURCE REQUIREMENTS Library resources and instructional materials Laboratory and classroom facilities needs Technology infrastructure requirements Budget allocation for curriculum implementation XI. QUALITY ASSURANCE Monitoring and evaluation framework Student feedback mechanism on curriculum Periodic curriculum review schedule Documentation and records management Compliance with regulatory requirements XI. NEXT STEPS AND ACTION ITEMS Assignment of working committees and task forces Timeline for curriculum revision implementation Next meeting: January 15, 2025, 3 00 AM, Academic Affairs Conference Hall"
    },
    {
        "image": "meetingagenda1_synth_3_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "Cc UNIVERSITY OF THE PHILIPPINES iniversity Registrar Office of the U G AGENDA NO. 9024 012 POLYTECHNI RESEARCH COMMITTEE MEETIN DATE: November 22, 2025 FROM: Or. Rosa Reyes. Director PROJECT Annual Research Conference Planning and Researcn Grant Management for Calendar Year 2025 ree TI acess nASOIOD 1. ATTENDANCE AND PRELIMINARIES Verification of attendance and quorum Adoption of agenda Reading and 2024) i. MATTERS ARISING FROM PREV ious MINUTES Status of approved ication f research journal yotume 12, approval £ minutes (September 28, if proposals implementation of ethics review issue 2. RESEARCH CONFERENCE 2025 A. Conference Theme Sustainability: Research for National Development’ Dates: March 1 5 16, Target participants: 500 researchers, students, industry partners B. Program Structure scientists and industry jeaders) Plenary sessions on research trends and priorities Para sentation sessions for student researche rs Research awards and reco Program Committee composition and responsibilities Logistics and Venue y and Sect ittee Publications and Documentation Coramitiee Sponsorship and mittee D. Budget and Funding Registration fees structure (faculty, studenis, external participants) ges for industry pariners Universily budget allocation Cost estimates and financial projections Vv. acuity research grant allocation for 2025 ants Application deadlines and fies DOST Philippine Council jarships international recommendations e Public and Format Theme: 9025 Venue: Univers Keynote speake el technical sess gnition ceremony ©. \"nnovation and ity Convention Center researc iS (national ions by discipline Poster pre nittees Technical Conference Come reiariat Comm Committee Registratio! Fundraising Com Sponsorship packa RESEARCH GRANT PRO ate research SUPP GRAMS A. internal Research Grants F ort pragram Graduate thesis and dissertation gf ng and evaluation procedures 8. External Funding Opportuni CHED Research Grants and Scho ntation for grant apoli Technology Research research projects Oriet otocols Updates to ethica pending research pr Continuing review of ongoing resé AND PUBLICATION n« intellectual propery is and research tics Undergradu evaluation criteria Monitor for industry, Energy and Emerging laboration programs cation and industry sponsored i rements V. ETHICS REV IEW BOARD Review of h Animal ethics commitiee report ty Vi. RESEARCH OUTPUT board report Publication incentive program implementatio and database rnanagement Citation analys Workshops of research methodology and statis software training (SPSS, R, NVivo} Academic writing iis development Vill. PARTNERSHIP AND ch collaboration with local government ch initiatives IX. ity and research col compliance requi lines for human subjects Training programs On res h journal aditorial Research repository _RESEARCH CAPACITY BUILDING t training Data analysis h presentation ski guide researc projects earch ethics and integr University researc rights and technology transfer impact assessment Vil Proposal writing and grant managemen quscript preparation seminars Researe dum of Agreement with industry partners Resear nd partnerships Community based participatory resear ng research projects Financial accountabil fiance impact assessment of completed res lated policies and guidelines and mar COLLABORATION Memoran units international research networks a! Progress reports from ongal MONITORING AND EVALUATION liquidation requirements Research ouipul submission and comp OTHER MATTERS °* Research recognition and awards program Updates on research re i NEXT MEETING December 5, 9024, 10 00 AM, Research Office Conference Room"
    },
    {
        "image": "meetingagenda1_synth_3_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Office of the University Registrar RESEARCH COMMITTEE MEETING AGENDA NO. 2024 012 DATE: November 22, 2025 PROJECT; Annual Research Conference Pianning and Research Grant Management for Calendar Year 2025 nnn one nae MGI EEO TERE BORER NETGEAR ND SONG ITEC ATTENDANCE AND PRELIMINARIES Verification of attendance and quorum Adoption of agenda Reading and approval of minutes (September 20, 2024) 1, MATTERS ARISING FROM PREVIOUS MINUTES Status of approved research proposals Implementation of ethics review recommendations Publication of research journal volume 12, issue 2 Hl, RESEARCH CONFERENCE 2025 A. Conference Theme and Format Theme: “innovation and Sustainability: Research for National Development” Dates: March 15 16, 2025 Venue: University Convention Center Target participants: 560 researchers, students, industry partners B. Program Structure Keynote speakers (national scientists and industry leaders) Plenary sessions on research trends and priorities Parallel technical sessions by discipline Poster presentation sessions for student researchers Research awards and recognition ceremony C, Conference Committees Technica! Program Commitiee composition and responsibilities Logistics and Venue tee Publications and Documentation Committee Sponsorship and g Registration fees structure (facuity, students, external participants) Sponsorship packages for industry partners University budget allocation Cost estimates and financial! projections HV. RESEARCH GRANT PROGRAMS A internal Research Grants Facuity research grant allocation for 2025 Undergraduate research Support program Graduate thesis and dissertatian grants Application deadlines and evaluation criteria Monitoring and evaluation procedures B. External Funding Opportunities DOST Philippine Council for industry, Energy and Emerging Technology Research CHED Research Grants and Scholarships International research collaboration prograrns industry sponsored research projects Orientation for grant application and compliance requirements V. ETHICS REVIEW BOARD Review of pending research protoccis Updates to ethical guidelines for human subjects research Animai ethics commitiee report Continuing review of ongoing research projects Training programs on research sthics and integrity Vi. RESEARCH OUTPUT AND PUBLICATION -« University research journal editorial board report Publication incentive program implementation Intellect rignts and technology transfer Research repositary and database management Citation impact assessment VII. RESEARCH CAPACITY BUILDING Workshops on r Proposal writing and grant management iraining Data analysis software training (SPSS, R, NVivo} Academic writing and manuscript preparation seminars Research presentation skills development Vill, PARTNERSHIP AND COLLABORATION »* Memorandum of Agreement with industry partners R uniis International research networks and partnerships MONITORING AND EVALUATION Prog liquidatio Committee Registration and Secretariat Cornamit Fundraising Committee 0, Budget and Fundin ual property analysis and research esearch methodology and statistics At eseéarcn collaboration with local government Community hased participatory research initiatives 1X. ress reports from ongoing research projects Financial accountability and n requirements Research oulpul submission and compliance Impact assessment of completed research X, OTHER MATTERS Research recognition and awards program Updates on research related policies and guidelines ‘1. NEXT MEETING December 5, 2024, 16 00 AM. Research Office Conference Room"
    },
    {
        "image": "meetingagenda1_synth_3_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Office of the University Registrar RESEARCH COMMITTEE MEETING AGENDA NO. DATE: November 22, 2025 F ROM Dr. Rosa Reyes, Director PROJECT: Annual Research Conference P Calendar Year 2025 2024 012 lanning and Research Grant Management for Items of Discussion: Sustainability: Research for National Develop Target participants: 500 researchers, students, indu scientists and industry leaders) Plenary sessions o discipline Poster presentation sessions for student Conference Committees Technical Program Comm Committee n research trends and priorities researchers Registration and Secretariat Committee Fundraising Committee D. Budget and Funding Regi Sponsorship packages for industry partners RESEARCH GRANT PROGRAMS A. Interna Stration fees structure (faculty, University budget allocation Cost esti Research Grants raduate thesis and dissertation grants Monitoring and evaluation procedures B. Exter Orientation mal ethics committee report Research repository and database management RCH CAPACITY BUILDING Workshops on rese agement training Community- ATION Progress reports from ongoing research projects liquidation requirements Research output submission and compliance Impact asses Research Office Conference Roo nal Funding Opportunities DOST- CHED Research Grants and Schol Adoption of agenda Reading and US MINUTES Status of approved Publication of research journal volume 12, A. Conference Theme and Format Theme: ment\" Dates: March 15 16, 2025 Venue: U stry partners B. Program Structure \"Innovation and niversity Convention Center Keynote speakers (national Parallel technical sessions by Research awards and recognition ceremony C. ittee composition and responsibilities Publications and Documentation Com Logistics and Venue mittee Sponsorship and students, external participants) mates and financial projections IV. Faculty research grant allocation for 2025 Application deadlines and Philippine Council arships International for grant application and ng research protocols Updates to ethical Continuing review of ongoing research ics and integrity VI. RESEARCH OUTPUT AND PU port Publication incentive program implementation Intellectual property Citation analysis and research arch methodology and Statistics Research collaboration with local government based participatory research initiatives IX. Financial accountability and sment of completed research X. dates on research related policies and guidelines m"
    },
    {
        "image": "meetingagenda1_synth_3_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Office of the University Registrar RESEARCH COMMITTEE MEETING AGENDA NO. 2024 012 DATE: November 22, 2025 FROM: Dr. Rosa Reyes, Director Research Grant Management for PROJECT: Annual Research Conference Planning and Calendar Year 2025 Items of Discussion: |. ATTENDANCE AND PRELIMINARIES Verification of attendance and quorum Adoption of agenda Reading and approval of minutes (September 20, 2024) Il. MATTERS ARISING FROM PREVIOUS MINUTES Status of approved research proposals Implementation of ethics review recommendations Publication of research journal volume 12, issue 2 Ill. RESEARCH CONFERENCE 2025 A. Conference Theme and Format Theme: \"Innovation and Sustainability: Research for National Development\" Dates: March 15 16, 2025 Venue: University Convention Center Target participants: 500 researchers, students, industry partners B. Program Structure Keynote speakers (national scientists and industry leaders) Plenary sessions on research trends and priorities Parallel technical sessions by Poster presentation sessions for student researchers Research awards and recognition ceremony C. m Committee composition and responsibilities Logistics and Venue Committee Registration and Secretariat Committee Publications and Documentation Committee Sponsorship and Fundraising Committee D. Budget and Funding Registration fees structure (faculty, students, external participants) Sponsorship packages for industry partners University budget allocation Cost estimates and financial projections IV. RESEARCH GRANT PROGRAMS A. Internal Research Grants Faculty research grant allocation for 2025 Undergraduate research support program Graduate thesis and dissertation grants Application deadlines and Monitoring and evaluation procedures B. External Funding Opportunities DOST Philippine Council ing Technology Research CHED Research Grants and Scholarships International ed research projects Orientation for grant application and RD Review of pending research protocols Updates to ethical mmittee report Continuing review of ongoing research ty VI. RESEARCH OUTPUT AND PUBLICATION m implementation Intellectual property discipline Conference Committees Technical Progra evaluation criteria for Industry, Energy and Emerg research collaboration programs Industry sponsor compliance requirements V. ETHICS REVIEW BOA guidelines for human subjects research Animal ethics co projects Training programs on research ethics and integri University research journal editorial board report Publication incentive progra rights and technology transfer Research repository and database management Citation analysis and research impact assessment VII. RESEARCH CAPACITY BUILDING Workshops on research methodology and statistics t training Data analysis software training (SPSS, R, NVivo) Academic writing Research presentation skills development VIII. PARTNERSHIP AND dustry partners Research collaboration with local government Community based participatory research initiatives IX. going research projects Financial accountability and eted research X. Proposal writing and grant managemen and manuscript preparation seminars COLLABORATION Memorandum of Agreement with in units International research networks and partnerships MONITORING AND EVALUATION Progress reports from on liquidation requirements Research output submission and compliance Impact assessment of compl OTHER MATTERS °* Research recognition and awards program Updates on research related policies and guidelines XI. NEXT MEETING December 5, 2024, 10 00 AM, Research Office Conference Room"
    },
    {
        "image": "meetingagenda1_synth_3_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Office of the University Registrar RESEARCH COMMITTEE MEETING AGENDA NO, 2024 012 DATE: November 22, 2025 PROJECT: Annual Research Conference Planning and Research Grant Management for Calendar Year 2025 tems of Di i ATTENDANCE AND PRELIMINARIES Verification of atlendance and quorum Acopticn of agenda Reacing and approval of minules (September 20, 2024) 1. MATTERS ARISING FROM PREVIOUS MINUTES Status of approved research proposals Implementation of ethics review recommendations Publication of research journal volume 72, issue 2 il. RESEARCH CONFERENCE 2025 A. Conference Themes and Format Theme: “Innovation and Sustainability: Research for National Development’ Dates: March 15 16, 2025 Venue: University Convention Center Target participants: 500 researchers, students, industry partners B. Program Structure Keynote speakers (national scientists and industry leaders) Plenary sessions on research trends and priorities Parallel technical sessions by &, discipline Poster presentation sessions for student researchers Research awards and recognition ceremony C. Conference Committees Technical Program Committee composition and responsibilities Logistics and Venue Committee Registration and Secretariat Committees Publications and Documentation Commitiee Sponsorship and Fundraising Committee D. Budget and Funding Registration fees structure (faculty, students, external participanis) Sponsorship packages for industry partners University budget aliccation Cost estimates and financial projections iV. RESEARCH GRANT PROGRAMS A. Internal Research Grants Faculty research grant allocation for 2025 Undergraduate research support program Graduate thesis and dissertation granis Application deadlines and s DOST Philippine Council for Indusiry, Energy and Emerging Vecnnology Research CHED Research Grants and Scholarships international evaluation criteria Vionitoring and evaluation procedures B. External Funding Opportunitie research collaboration programs industry sponsored research projects Orientation for grant application and compliance requiremenis V. ETHICS REVIEW BOARD Review of pending research protocais Updaies to ethical guidelines for hurnan subjects research Animal ethics committee report Continuing review of ongoing research projects Training programs on research ethics and integrity VL RESEARCH OUTPUT AND PUBLICATION University research journal editorial board report Publication incentive program implementation Intellectual property rights and technology transfer Research repository and database management Citation analysis and research impact assessment Vil. RESEARCH CAPACITY BUILDING Workshops on research methodology and statistics Proposal writing and grant management training Data analysis software training (SPSS, R, NVivc) Acacemic writing and manuscript preparation seminars Research oreseniation skills development VII. PARTNERSHIP AND COLLABORATION Memorandum of Agreement with industry pariners Research collaboration with local government units International research networks and parinerships Community based participatory research initiatives IX. MONITORING AND EVALUATION Progress reports from ongoing research projects Financial accountability and iguidation requirements Research output submission and compliance impact assessment of cornpleted research X. OTHER MATTERS Research recognition and awards program Updates on research related policies and guidelines AL NEXT MEETING December 5, 2024, 10 00 AM, Research Office Conference Room"
    },
    {
        "image": "meetingagenda1_synth_4_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Graduate School Academic Committee CURRICULUM COMMITTEE MEETING AGENDA NO. 2024 009 DATE: December 29, 2025 FROM: Dr. Antonio Cruz, Vice President PROJECT: Comprehensive Curriculum Review and Program Rationalization Study for All Academic Departments Items of Discussion: I. MEETING PRELIMINARIES Attendance verification and establishment of quorum Approval of agenda and supplementary materials Confirmation of minutes from previous session (September 30, 2024) II. UNFINISHED BUSINESS Follow up on curriculum revision proposals under review Status of CHED program compliance requirements Implementation progress of previously approved curriculum changes III. PROGRAM REVIEW AND EVALUATION A. Self Assessment Reports College of Engineering programs review summary College of Business Administration programs assessment College of Arts and Sciences programs evaluation Analysis of student performance and program outcomes B. External Assessments Accreditation visit findings and recommendations Industry advisory board feedback compilation Alumni and employer satisfaction survey results Benchmarking with comparable institutions IV. CURRICULUM DEVELOPMENT PROPOSALS A. New Program Offerings BS Data Science and Analytics feasibility study presentation Certificate Program in Digital Marketing proposal review MS Environmental Management curriculum framework Market demand analysis and resource requirements Financial sustainability and cost benefit analysis B. Program Modifications BS Nursing curriculum alignment with international standards BS Education specialization tracks expansion BS Psychology additional majors proposal Graduate program admission requirements revision C. Course Changes New course proposals (15 courses across departments) Course description and prerequisite updates Laboratory component enhancements General education electives diversification V. OUTCOMES BASED EDUCATION IMPLEMENTATION Assessment of learning outcomes at program level Course learning outcome mapping and alignment verification Rubrics development for performance assessment Continuous quality improvement mechanisms Faculty training needs on OBE methodology VI. FLEXIBLE LEARNING MODALITIES Guidelines for online course development and delivery Quality standards for blended learning courses Learning management system utilization training Assessment and evaluation methods for online learning Student support services for distance learners VII. GENERAL EDUCATION CURRICULUM Review of GE program goals and student learning outcomes Integration of critical thinking and 21st century skills Proposed reduction of GE units based on CHED guidelines Service learning and community engagement requirements Assessment of GE program effectiveness VIII. ACADEMIC CALENDAR AND POLICIES Proposed academic calendar for AY 2025 2026 Course offering schedules and class programming Add drop and withdrawal policies review Grading system and grade point average computation Graduation requirements and residency rules IX. FACULTY QUALIFICATION AND DEVELOPMENT Faculty qualification requirements per program Professional development needs assessment Graduate studies support for faculty upgrading Teaching load guidelines and adjustments Faculty performance evaluation criteria X. RESOURCE REQUIREMENTS Library resources and instructional materials Laboratory and classroom facilities needs Technology infrastructure Budget allocation for curriculum implementation XI. QUALITY ASSURANCE Monitoring and evaluation odic curriculum review schedule Documentation and records EXT STEPS AND ACTION ITEMS Assignment of working tion Next meeting: January 15, 2025, 9 00 AM, requirements framework Student feedback mechanism on curriculum Peri management Compliance with regulatory requirements XII. N committees and task forces Timeline for curriculum revision implementa Academic Affairs Conference Hall"
    },
    {
        "image": "meetingagenda1_synth_4_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Graduate School Academic Committee CURRICULUM COMMITTEE MEETING AGENDA NO, 2024 009 DATE: December 29, 2025 FROM: Dr. Antonio Cruz, Vice President PROJECT: Comprehensive Curriculum Review and Program Rationalization Study for All Academic Departments Items of Discussion: I. MEETING PRELIMINARIES Attendance verification and establishment of quorum Approval of agenda and supplementary materials Confirmation of minutes from previous session (September 30, 2024) Il. UNFINISHED BUSINESS Follow up on curriculum revision proposals under review Status of CHED program compliance requirements previously approved curriculum changes III. PROGRAM REVIEW AND EVALUATION A. Self As Engineering programs review summary College of Business Administration programs assessm Sciences programs evaluation Analysis of student performance and program outcomes B. Ext Accreditation visit findings and recommendations Implementation progress of sessment Reports College of ent College of Arts and ernal Assessments + Industry advisory board feedback compilation Alumni and employer satisfaction survey results Benchmarking with comparable institutions IV. CURRICULUM DEVELOPMENT PROPOSALS A. New Program Offerings BS Data Science and Analytics feasibility study presentation Certificate Program in Digital Marketing proposal review MS Environmental Management curriculum framework Market demand analysis and resource requirements Financial sustainability and cost benefit analysis B. Program Modifications BS Nursing curriculum alignment with international standards BS Education specialization tracks expansion BS Psychology additional majors proposal Graduate program admission requirements revision C. Course Changes New course proposals (15 courses across departments) Course description and prerequisite updates Laboratory component enhancements General education electives diversification V. OUTCOMES BASED EDUCATION IMPLEMENTATION Assessment of learning outcomes at program level Course learning outcome mapping and alignment verification Rubrics development for performance assessment Continuous quality improvement mechanisms Faculty training needs on OBE methodology VI. FLEXIBLE LEARNING MODALITIES Guidelines for online course development and delivery Quality standards for blended learning courses Learning management system utilization training Assessment and evaluation methods for online learning Student support services for distance learners VII. GENERAL EDUCATION CURRICULUM Review of GE program goals and student learning outcomes Integration of critical thinking and 21st century skills Proposed reduction of GE units based on CHED guidelines Service learning and community engagement requirements Assessment of GE program effectiveness VIII. ACADEMIC CALENDAR AND POLICIES Proposed academic calendar for AY 2025 2026 Course offering schedules and Class programming Add drop and withdrawal policies review Grading system and grade point average computation Graduation requirements and residency rules IX. FACULTY QUALIFICATION AND DEVELOPMENT Faculty qualification requirements per program Professional development needs assessment Graduate studies support for faculty upgrading Teaching load guidelines and adjustments Faculty performance evaluation criteria X. RESOURCE REQUIREMENTS -« Library resources and instructional materials Laboratory and classroom facilities needs Technology infrastructure requirements Budget allocation for curriculum implementation XI. QUALITY ASSURANCE Monitoring and evaluation framework Student feedback mechanism on curriculum Periodic curriculum review schedule Documentation and records management Compliance with regulatory requirements XII. NEXT STEPS AND ACTION ITEMS Assignment of working committees and task forces Timeline for curriculum revision implementation Next meeting: January 15, 2025, 9 00 AM, Academic Affairs Conference Hall"
    },
    {
        "image": "meetingagenda1_synth_4_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Graduate School Academic Committee CURRICL UM COMMITTEE MEETING AGENDA NO, 2024 009 DATE: Dr. Antonio Cruz, Vice President PROJECT: Comprehensive Curriculum Review and Program Rationalization Study for Al Academi Departments Materials Confirma verification and establishment of guOrUM Approval of agenga and Supplementary S$ from previous Session (Sentember 30, 2024) I. UNFINISHED BUSINESS Follow up on Status of CHED program compliance requirements impleme Wum Changes II, PROGRAM REVIEW AND Sel Assessment Reports College of Engineering programs review summary College of Business Administration Programs assessment College of Arts and Sciences Programs evaluation Analysis of Student Performance and Program outcomes B. External Assessments Accreditation visit findings and recommendations | board feedback compilation Aluranj and employer Satisfaction Survey results e Senchmarking with comparable institutions [Vy CURRICULUM DEVELOPMENT PROPOSALS A. New Program Offerings BS Data Science and Analytics feasibility StUCY presentation Certificate Program in Digital Marketing Proposal review MS Environmental Management curric Nanclal Sustainability and cost be Standards BS Edy Gram adrnissi tion of minute curriculum reyisi Sn proposals un iously abproved curriey! lon progress of EVALUATION A. Se! nidustry advisory ulum framework Market demand analysis and requirements Fj nefit analysis 8. Program Modifications F Ss Nursing curriculum Alignment on requirements revision C New course Droposais (15 departments) Course description and prerequi dates Laboratory component enhancements General education Siectives clversification V. OUTCOMES BASED EDUCATION iy PLE sment of learning outcomes at Program level Course learning ouicome development for Performance assessment Continuous Gu acuity training needs on OBE methodology Vi FLEXIBLE LEARNING MODALITIES development and delivery Quality stan ards for bj Courses Learning Management Zation training Assessment and 6valuation mathords for online learning Student SUBport Services for distance learners VIL GENERAL EDUCATION CURRICULUM Review of GE Program goals and Student nisgration of critical thinking and 24st Ceniury skills -roposed reduction of GE units based on CHED GE program effec eMmic Calendar for AY 2025 2026 Cour resource with international Graduate pre Gourse Changes MENTATION Asses goment verification Rubrics Mechanisms F Mapping and ali ality improvement Guidelines for online course fare fearing and community engagement requirements 4 ACADEMIC CALENDAR AND POLICIES Proposed acad Se offering schedules and class Programming Ada drop and wi indrawal policias review Grading sys system and grade point average computation dency rules ix, FACULTY QUALIFICATION AND DEVELO Graduation requirements and resi =LOPMENT Faculty qualification requirements Per program Professional! development needs te studies SUBDor for faculty upgrading Teaching load guidelines and adjustments Faculty performance evaluation criteria Xx. RESOURCE REQUIREMENTS Library resources and j lal materials Labora needs Technology infrastructure assessment Gradua nstructior Budget al Framework Student feedback mechanism on Curriculum P Management ~OmMpliance with reguiatory requirements XU. NEXT STEPS AND ACT] task forces Timeline for curriculum revision implementation Next im Academic Affairs Conference Hall tory and classroom facilities requirements location for curriculum implementation XL QUALITY ASSURANCE Monitoring and evaluation eriodic curriculury review schedule Documentation and records ON ITEMS Assignment of working eeting: January 15, 20995 S 00 AM ka F y commitieas and"
    },
    {
        "image": "meetingagenda1_synth_4_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Graduate School Academic Committee CURRICULUM COMMITTEE MEETING AGENDA NO. 2024 009 DATE: December 29, 2025 FROM: Dr. Antonio Cruz, Vice President PROJECT: Comprehensive Curriculum Review and Program Rationalization Study for All Academic Departments Items of Discussion: |. MEETING PRELIMINARIES Attendance verification and esta materials Confirmation of minutes from previous session (September 30, 2024) Il. UNFINISHED BUSINESS =» Follow up on curriculum revision proposals under review Status of CHED program compliance requirements Implementation progress of ROGRAM REVIEW AND EVALUATION A. Self Assessment Reports College of ss Administration programs assessment College of Arts and ance and program outcomes B. External Assessments dvisory board feedback compilation Alumni and employer blishment of quorum Approval of agenda and supplementary previously approved curriculum changes Ill. P Engineering programs review summary College of Busine Sciences programs evaluation Analysis of student perform Accreditation visit findings and recommendations Industry a satisfaction survey results Benchmarking with comparable institutions IV. CURRICULUM DEVELOPMENT PROPOSALS A. New Program Offerings BS Data Science and Analytics feasibility study presentation Certificate Program in Digital Marketing proposal review MS Environmental Management curriculum framework Market demand analysis and resource requirements Financial sustainability and cost benefit analysis B. Program Modifications BS Nursing curriculum alignment with international standards BS Education specialization tracks expansion BS Psychology additional majors proposal Graduate program admission requirements revision C. Course Changes New course proposals (15 courses across departments) Course description and prerequisite updates Laboratory component enhancements General education ectives diversification V. OUTCOMES BASED EDUCATION IMPLEMENTATION Assessment of learning outcomes at g and alignment verification Rubrics development for performance aculty training needs on OBE methodology VI. FLEXIBLE el program level Course learning outcome mappin assessment Continuous quality improvement mechanisms F LEARNING MODALITIES Guidelines for online course development and delivery Quality standards for blended learning courses Learning management system utilization training Assessment and evaluation methods for online learning Student support services for distance learners VII. GENERAL EDUCATION CURRICULUM Review of GE program goals and student learning outcomes Integration of critical thinking and 21st century skills Proposed reduction of GE units based on CHED guidelines Service learning and community engagement requirements Assessment of GE program effectiveness VIL. ACADEMIC CALENDAR AND POLICIES Proposed academic calendar for AY 2025 2026 Course offering schedules and drop and withdrawal policies review Grading system and grade point average computation Y QUALIFICATION AND DEVELOPMENT Faculty qualification requirements per program Professional development needs assessment Graduate studies support for faculty upgrading Teaching load guidelines and adjustments Faculty performance evaluation criteria X. RESOURCE REQUIREMENTS Library resources and instructional materials Laboratory and classroom facilities needs Technology infrastructure requirements Budget allocation for curriculum implementation XI. QUALITY ASSURANCE Monitoring and evaluation framework Student feedback mechanism on curriculum Periodic curriculum review schedule Documentation and records management Compliance with regulatory requirements XII. NEXT STEPS AND ACTION ITEMS Assignment of working committees and task forces Timeline for curriculum revision implementation Next meeting: January 15, 2025, 9 00 AM, Academic Affairs Conference Hall class programming Add/ Graduation requirements and residency rules IX. FACULT"
    },
    {
        "image": "meetingagenda1_synth_4_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Graduate School Academic Committee CURRICULUM COMMITTEE MEETING AGENDA NO. 2024 009 DATE: December 29, 2025 FROM: Dr. Antonio Cruz, Vice President PROJECT: Comprehensive Curriculum Review and Program Rationalization Study for All Academic Departments I tems of Discussion: 1. MEETING PRELIMINARIES Attendance verification and establishment of quorum materials Confirmation of minutes from previous session (September 30, 2024) ll. UNFINISHED BUSINESS Follow up on curriculum revision proposals under review Status of CHED program compliance requirements Implementation progress of previously approved curriculum changes Ili, PROGRAM REVIEW AND EVALUATION A. Self Assessment Reports College of Engineering programs review surnmary College of Business Administration programs assessment College of Arts and Sciences programs evaluation Analysis of student performance and program outcomes B. External Assessments Accreditation visit findings and recommendations Industry advisory board feedback compilation Alumni and employer Satisfaction survey results Benchmarking with comparable institutions IV. CURRICULUM DEVELOPMENT PROPOSALS A. New Program Offerings BS Data Science and Analytics feasibility study presentation Certificate Program in Digitat Marketing proposal review MS Environmental Management curriculum framework Market demand analysis and resource requirements Financial sustainability and cost benefit analysis B. Program Modifications BS Nursing curriculum alignment with international standards BS Education specialization tracks expansion BS Psychology additional majors proposal Graduate program admission requirements revision C. Course Changes New course proposals (15 courses across departments) Course description and prerequisite updates Laboratory component enhancements Genera! education electives diversification V. OUTCOMES BASED EDUCATION IMPLEMENTATION Assessment of learning outcomes at program level Course learning outcome mapping and alignment verification Rubrics development for performance assessment Continuous quality improvement mechanisms Faculty training needs on OBE methodolagy Vi. FLEXIBLE LEARNING MODALITIES Guidelines for online course development and delivery Quality standards for blended learning courses Learning management system utilization training Assessment and evaluation methods for online learning Student support services for distance learners Vil. GENERAL EDUCATION CURRICULUM Review of GE program goais and student learming outcomes Integration of critical thinking and 21st century skilis Proposed reduction of GE units based on CHED guidelines Service learning and community engagement requirements Assessment of GE programm effectiveness VII. ACADEMIC CALENDAR AND POLICIES Proposed academic calendar for AY 2025 2026 Course offering schedules and Class programming Add drop and withdrawal policies review Grading system and grade point average computation Graduation requirements and residency rules IX. FACULTY QUALIFICATION AND DEVELOPMENT Facuity qualification requirements per program Professional development needs assessment Graduate studies support for faculty upgrading Teaching load guidelines and adjustments Faculty performance evaluation criteria X. RESOURCE REQUIREMENTS Library resources and instructionai materials Laboratory and classroorn facilities needs Technology infra requirements Budget allocation for curriculum implementation X!. QUALITY ASSURANCE Mon framew Approval of agenda and supplementary structure itcring and evaluation ork Student feedback mechanism on curriculum Periodic curriculum review schedule Documentation and records management Compliance with regulatory requirements XI!, NEXT STEPS AND ACTION ITEMS Assignment of working committees and task forces Timeline for curriculum revision implementation Next meeting: January 15, 2025, 9 00 AM, Academic Affairs Conference Hall"
    },
    {
        "image": "meetingagenda1_synth_5_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN DEPARTMENT FACULTY MEETING AGENDA NO. 2024 018 tion Framework and Laboratory IP OYE: : PROJECT: Impiementation of Outcomes Based Educ Upgrading Project for Computer Science Programs sD SESE LESTE SIE EAT A LIT re SSSR LSTA RL LIST TEI and introduction of new faculty members Acknowledgment of faculty oals for current academic year I. ACADEMIC PROGRAM parison) Graduate |. OPENING REMARKS Welcome UPDATES A. BS Computer Science Program Enrollment trends analysis (5 year com employability and tracer study results Alumni feedback on program strengths and areas for improvement CHED tiance requirements and accreditation preparation B. BS inforrnation Technology Program Industry advisory complia eg board recommendations Articulation agreements with partner instit bi tions Internship and practicum placement updates C. Graduate Programs (MS Computer Science) Thesis and dissertation guidelines revision Comprenensive examination schedule and policies Graduate faculty qualifications review i, CURRICULUM AND INSTRUCTION implementation of OBE fearing outcomes assessment Syllabus review and updating requiremenis Course learning outcome (CLO) alignment with program outcomes instructional delivery modalities (face to face, onli hybrid) Student evaluation of teaching effectiveness LABORATORY AND FACILITIES Computer laboratory upgrading project time! Hardware specifications for laboratory computers Network infrastructure Equipment maintenance schedule and procedures results Best practices sharing session innovative teaching strategies WV. ine and budget Software licenses renewal and new acquisitions improvements Laboratory safety protocols and security measures V. FACULTY WORKLOAD AND ASSIG MENTS Teaching load distribution extension service assignments Committee memberships and ad ninistrative designations Adjunct and part time namer class offerings and faculty assignments VI. RESEARCH AND EXTENSION ity, DOST, CHED, private sector) for second semester Research and faculty recruitment needs Sur nel ad Department research agenca and priority areas Funding opportunities (unive Research collaboration with industry partners Extension programs with local government units and communities Faculty research outputs and publication tracking Vii, PROFESSIONAL DEVELOPMENT Conference attendance anc paper presentation opportunities Training programs on emerging technologies (Al, Cybersecurity, Cloud Computing) Certification programs for facuity (AWS, Microsoft, Cisco) Graduate studies support and scholarship op 5 with international universities VIN. STUDENT CONCERNS AND SUPPORT Academic Student organization activities and faculty adviser duties Faculty exchange program advising responsibilities and student consultation hours Peer tutoring program for struggling stucents Undergradua RS Department budget utilization anc financial report p and industry connections IX. ADMINISTRATIVE MATTERS « Event planning Procurement requests and purchase requis te research mentorship opportunities Career guidance itions Office supplies and instructional materials inventory (department week, recognition program) Documentation and records management X, OPEN FORUM Faculty concems, suggestions, and recommendations Discussion o pending issues and challenges Xi. CLOSING ams and assignments Next meeting: November 22, 2024, 3 00 PM, CS Conference hE REMARKS Summary of action i Roo"
    },
    {
        "image": "meetingagenda1_synth_5_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN College of Science ~- Faculty Council DEPARTMENT FACULTY MEETING AGENDA NO. 2024 018 DATE: October 19, 2025 FROM: Prof. Juan Dela Cruz, PROJECT: fear foto 7 tcomes Rase gu thon Framework anorar PRs fo implementation of Outcomes Based Education Framework and Laboratory Upgrading Project for Comouter Science Prograrns vc CNSR sgrssun eterno aaa ANNA TIN OPENING REMARKS Welcome and introduction of new facully members Acknowledgrnent of facully accomplishments anc awards Review of department goais for current academic year 1. ACADEMIC PROGRAM UPDATES A. BS Computer Science Program Enrollment trends analysis (5 year comparison) Graduate employability and tracer study results Alumni feedback on program strengths and areas for improvement e CHED compliance requirements and accreditation preparation B. BS information Technology Program Indusiry advisory board recommendations Articulation agreements with pariner institutions internship and practicum placement updates C, Graduate Programs (MS Computer Science) Thesis and dissertation guidelines revision Comprehensive examination schedule and policies Graduate faculty qualifications review iL CURRICULUM AND INSTRUCTION implementation of OBE learning outcomes assessment Syllabus review and updating requirements Course learning guicome (CLO) alignment with program outcomes Instructional delivery modalities (face to face, online, hybrid) Student evaluation of teaching effectiveness results Best practices sharing session innovative teaching strategies [V. LABORATORY AND FACILITIES Computer laboratory upgrading project timeline and budget Software licenses renewal and new acquisitions Hardware specifications for laboratery computers Network infrastructure improvements Laboratory safety protocols and security measures Equipment maintenance schedule and procecures Vo FACULTY WORKLOAD AND ASSIGNMENTS Teaching load distribution for second semester Research and extension service assignments Committee memberships and administrative designations Adjunct and pari time faculty recruitment needs Summer class offerings and facully assignments Vi. RESEARCH AND EXTENSION Depariment research agenda and priority areas Funding opportunities (university, DOST, CHED, private sector) Research collaboration with industry partners Extension programs with local government units and communities Faculty research outputs and publication tracking Vi. PROFESSIONAL DEVELOPMENT Conference attendance and paper presentation opportunities Training programs on emerging fechnologies (Al, Cybersecurity, Cloud Computing) Certification programs for faculty (AWS, Microsoft, Cisco) Graduate studies support and scholarship opportunities Facully exchange programs with international universities Vi. STUDENT CONCERNS AND SUPPORT Acacemic advising responsibilities and student consultation hours Student organization activities and faculty adviser duties e Peer tutoring program for struggling students e Undergraduate research mentorship opportunities Career guidance and industry connections IX. ADMINISTRATIVE MATTERS Department budget utiization and financial report e Procurement requesis anc purchase requisitions Office suppiles and instructional materials inventory Event planning (department week, recognition program) Documentation and records management X. OPEN FORUM Faculty concerns, suggestions, and recornmencdations Discussion of pending issues and cnallenges X 1, CLOSING REMARKS Summary of action items and assignments Next meeting: November 22, 2024, 3 00 PM, CS Conference Room"
    },
    {
        "image": "meetingagenda1_synth_5_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN College of Science Faculty Council DEPARTMENT FACULTY MEETING AGENDA NO. 2024 018 DATE: October 19, 2025 FROM: Prof. Juan Dela Cruz, utcomes Based Education Framework and Laboratory PROJECT: Implementation of O r Computer Science Programs Upgrading Project fo Items of Discussion: |. OPENING REMARKS Welcome and introduction of new faculty members Acknowledgment of faculty rent academic year \\|. ACADEMIC PROGRAM accomplishments and award f department goals for cur UPDATES A. BS Computer Science Program Enrollment trends analysis (5 year comparison) Graduate employability and tracer study results Alumni feedback on program strengths and areas for improvement CHED compliance requirements and accreditation preparation B. BS Information Technology Program Industry advisory board recommendations Articulation agreements with partner institutions Internship and practicum placement s revision Comprehensive updates C. Graduate Programs (MS Computer Science) Thesis and dissertation guideline amination schedule and policies Graduate faculty qualifications review III. CURRICULUM AND INSTRUCTION E learning outcomes assessment Syllabus review and updating requirements Course learning outcome (CLO) alignment with program outcomes Instructional delivery modalities (face to face, online, hybrid) Student evaluation of teaching effectiveness results Best practices sharing session innovative teaching strategies IV. LABORATORY AND FACILITIES Computer laboratory upgrading project timeline and budget Software licenses renewal and new acquisitions Hardware specifications for laboratory computers Network infrastructure improvements Laboratory safety protocols and security measures Equipment maintenance schedule and procedures V. FACULTY WORKLOAD AND ASSIGNMENTS Teaching load distribution for second semester Research and rvice assignments Committee memberships and administrative designations Adjunct and part time Summer class offerings and faculty assignments VI. RESEARCH AND EXTENSION da and priority areas Funding opportunities (university, DOST, CHED, private sector) industry partners Extension programs with local government units and communities Faculty research outputs and publication tracking VII. PROFESSIONAL DEVELOPMENT Conference attendance and paper presentation opportunities Training programs on emerging technologies (Al, Cybersecurity, Cloud Computing) Certification programs for faculty (AWS, Microsoft, Cisco) Graduate studies support and scholarship opportunities Faculty exchange programs with international universities VIII. STUDENT CONCERNS AND SUPPORT Academic advising responsibilities and student consultation hours Student organization activities and faculty adviser duties Peer tutoring program for struggling students Undergraduate research mentorship opportunities Career guidance and industry connections IX. ADMINISTRATIVE MATTERS Department budget utilization and financial report Procurement requests and purchase requisitions Office supplies and instructional materials inventory Event planning )e Documentation and records management X. OPEN FORUM Faculty (department week, recognition program concerns, suggestions, and recommendations Discussion of pending issues and challenges XI. CLOSING 22, 2024, 3 00 PM, CS Conference REMARKS Summary of action items and assignments Next meeting: November s Review 0 ex Implementation of OB extension se faculty recruitment needs Department research agen Research collaboration with Room"
    },
    {
        "image": "meetingagenda1_synth_5_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN College of Science Faculty Council DEPARTMENT FACULTY MEETING AGENDA NO. 2024 018 DATE: October 19, 2025 FROM: Prof. Juan Dela Cruz, of Outcomes Based Education Framework and Laboratory uter Science Programs PROJECT: Implementation Upgrading Project for Comp rs° Acknowledgment of faculty demic year Il. ACADEMIC PROGRAM -year comparison) Graduate d areas for improvement *- CHED Program Industry advisory d practicum placement Comprehensive Items of Discussion: |. OPENING REMARKS Welcome and introductio ishments and awards Review of department uter Science Program Enroll tudy results Alumni feedback on pro and accreditation preparation B. BS In ements with partner institution n of new faculty membe goals for current aca’ ment trends analysis (5 gram strengths an formation Technology s Internship an rtation guideli accompl UPDATES A. BS Comp employability and tracer s compliance requirements nes revision board recommendations Articulation agre updates C. Graduate Programs (MS Computer Science) Thesis and disse hedule and policies Graduate faculty qualifications review Ill. CURRICULUM AND INSTRUCTION abus review and updating requirements Course learning assessment Syll examination sc Instructional delivery mod Implementation fe) outcome (CLO) alignment with prog Student evaluation of teaching effecti LABORATORY AND FACILITIES Computer wal and new acquisitions Hardware specifications for labora Laboratory safety protocols and security measures Equipment maintenance schedule and proc RKLOAD AND ASSIGNMENTS Teaching load distribution for second semester Research and extension service assignments Committee memberships and administrative designations Adjunct and part time faculty recruitment needs Summer class offerings and faculty assignments VI. RESEARCH AND EXTENSION Department research agenda and priority areas Funding opportunities (university, DOST, CHED, private sector) Research collaboration with industry partners Extension programs with local government units and communities Faculty research outputs and publication tracking VII. PROFESSIONAL DEVELOPMENT Conference attendance and paper presentation opportunities Training programs on emerging technologies (Al, Cybersecurity, Cloud Computing) Certification programs for faculty (AWS, Microsoft, Cisco) Graduate studies support and scholarship opportunities Faculty exchange programs universities VIII. STUDENT CONCERNS AND SUPPORT Academic advising responsibilities and stu Student organization activities and faculty adviser duties Peer tutoring program for struggling stude duate research mentorship opportunities Career guidance ndustry connections IX. ADMINISTRATIVE MATTERS Department budget utilization and financial report ts and purchase requisitions Office supplies and instructional materials inventory Event planning )e Documentation and records management X. OPEN FORUM Faculty Discussion of pending issues and challenges XI. CLOSING Next meeting: November 22, 2024, 3 00 PM, CS Conference alities (face to face, online, hybrid) ctices sharing session innovative teaching strategies !V. ding project timeline and budget Software licenses tory computers Network infrastructure OBE learning outcomes ram outcomes veness results Best pra aboratory upgra edures rene improvements Vv. FACULTY WO with international dent consultation hours nts Undergra and i Procurement reques (department week, recognition program concerns, suggestions, and recommendations REMARKS Summary of action items and assignments Room"
    },
    {
        "image": "meetingagenda1_synth_5_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN College of Science Faculty Council DEPARTMENT FACULTY MEETING AGENDA NO. 2024 018 DATE: October FROM: PROJECT: Upgradin Items of Discussion: stems oF Discussion: I. OPENING REMARKS Welcome and introduction of new faculty members accomplishments and awards ES A. BS Computer Science employability and tracer Study results A compliance requirements and accreditati UPDAT board recommendations renewal and new acquisition improvements extension service assignmen faculty recruitment needs Department research agenda Research collaboration wit Faculty research outputs a Paper presentation Opportuniti Certification Programs for facu Implementation of Outco Laboratory Safety protocols and secu V. FACULTY WORKLOAD AND h industry Partners nd publication tracki 19, 2025 Prof. Juan Dela Cruz, mes Based Education Framewo, rk and Laboratory mputer Science Programs g Project for Co Acknowledgment of faculty Revie W of department goals for current academic year ||. ACADEMIC PROGRAM Program Enrollment trends analysis (5- and areas for improvement CHED hnology Program Industry advisory ternship and Practicum placement tion guidelines revisj Course learning -to face, online, hybrid) innovative teaching Strategies IV. d budget Software licenses S Hardware Specificatio ASSIGNMENTS Teaching load distribution for sec ts Committee member: ships and administrative design nd faculty assignments VI. RES tenance schedule and procedures ‘ond semester Research and ations Adjunct and Part time EARCH AND EXTENSION DOST, CHED, private Sector) rnment units and communities MENT Conference attendance and Cybersecurity, Cloud Computing) Ity (AWS, Microsoft Cisco) Grad i rt and Scholarship Opportunities €s Training pro"
    },
    {
        "image": "meetingagenda1_synth_6_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "IVERSITY OF SANTO TOMAS Finance and Management Office UNCIL MEETING AGEND UN ACADEMIC co ANO. 3024 025 DATE: October 23, 2025 Or. Maria Santos, Chairperson FROM: ent Programs nning for Curriculum Enhancement and Faculty Developm “ye, Lad PROJECT: Strategic Pla Year 2024 202 for Academic s from previous Items of Disct determination of quorum Approval of agenda Approval of minutes te on Commission on Higher MUNICATIONS Upda ion visil bY Philippine Assoc yements anc ons Student enrollment stati semesier Il MENT A. Proposed Program Revisians Bachelor of Science in Computer Science integration of Artificial intelligence courses Bachelor of Arts in Communication Addition of Digital Media Production track Master of Business Administration Updates to comply with CHED standards B. New Course Proposals CS 301 Machine Learning and Data Analylics ENG 205 Creative Wating in Philippine Languages BUS 401 Social Entrepreneurship and Sustainable Business C. General Education Curriculum Reform Review of GE re twith K 12 program ouicomes Proposed reduction of units to facilitate timely graduation Integration of outcomes based education (CBE) framework IV. FACULTY DEV ELOPMENT INITIATIVES Scholarship opportunities for graduate studies (CHED and universily grants) Professional development workshops schedule (January June 2025) Research capacity building seminars Teaching excellence awards criteria and nomination process Mentoring program for new faculty members V. ACADEMIC POLICIES AND STANDARDS Revision of grading system and grad tion procedures Imp! fiware for student Htocation for AY 2024 2025 Publication incentive program arch journal editorial policies ec advising sysiem improvements Library e cormputat ementation of anti plagiarism sor papers Guidelines for online and hybrid course delivery Acacem 5 Student appeal and Vi. RESEARCH AND PUBL ith industry for collaborative research Ethics review board acols and procedures University rese SUPPORT Ith and counseling services expansion Academi d financial assisiance programs Career development demic programs and ic integrity policy updates grievance procedures ICATION Research funding a uidelines Partnerships Wi Vi. STUDENT WELFARE AND ptions Scholarship an allocation for aca i CALL TO ORDER Roll cali and meeting (October 45, Education (CHED) Memorandum Orde Universities (PACU) Recognition of faculty achie CURRICULUM REVIEW AND DEVELOP iation of Colleges and NCEMENTS AND COM stics for current 2024) 4. ANNOU! rs Upcoming accreditat 4 publicati quirements alignmen prot SERVICES Mental hea es and digital database subscri resource and placement services VII. BUDGET AND RESOURCES Budget ng and classroom technology anhancemen Laboralary ec uipment procurement ion items and departments Facilities upgrad! priorities Faculty researcn and travel grants SS Other matters for cons committee reports X. NEW BUSINES schedule: December 40, 2024, 9 00 PM, Admin Building Conference Room IX, UNFINISHED BUSINESS Follow up on previous act ideration XI. ADJOURNMENT Next meeting"
    },
    {
        "image": "meetingagenda1_synth_6_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Finance and Management Office ACADEMIC COUNCIL MEETING AGENDA NO. 2024 025 DATE: October 23, 2025 FROM: Dr. Maria Santos, Chairperson Enhancement and Faculty Development Programs PROJECT: Strategic Planning fer Curriculum for Academic Year 2024 2025 CALL TO ORDER Roll call and determination of quorum Approval of agenda Approval of minutes from previous meeting (October 15, 2024) Il. ANNOUNCEMENTS AND COMMUNICATIONS Update on Commission on Higher Education (CHED) Memorandum Orders Upcoming accreditation visit by Philippine Association of Colleges and Universities (PACU) Recognition of faculty achievements and publications Student enrollment statistics for current semester lll. CURRICULUM REVIEW AND DEVELOPMENT A. Proposed Program Revisions Bachelor of Science in Computer Science Integration of Artificial Intelligence courses Bachelor of Arts in Communication Addition of Digital Media Production track Master of Business Administration Updates to comply with CHED standards B. New Course Proposals CS 301 Machine Learning and Data Analytics ENG 205 Creative Writing in Philippine Languages BUS 401 Social Entrepreneurship and Sustainable Business C. General Education Curriculum Reform s Proposed reduction of units to facilitate timely k IV. FACULTY DEVELOPMENT INITIATIVES Professional development workshops Review of GE requirements alignment with K 12 program oulcome graduation Integration of outcomes based education (OBE) framewor Scholarship opportunities for graduate studies (CHED and university grants) schedule (January June 2025) Research capacity building seminars Teaching excellence awards criteria and nomination process Mentoring program for new faculty members V. ACADEMIC POLICIES AND STANDARDS Revision of grading systern and grade computation procedures implementation of anti plagiarism software for student papers Guidelines for online and hybrid course delivery Academic integrity policy updates Student appeal and grievance procedures V1. RESEARCH AND PUBLICATION Research funding allocation for AY 2024 2025 Publication incentive program guidelines Pariners tips with industry for collaborative research Ethics review board protocols and procedures University research journal editorial policies VI. STUDENT WELFARE AND SUPPORT SERVICES Mental health and counseling services expansion Academic advising system improvements Library jevelopment resources and digital database subscriptions Scholarship and financial assistance programs Career d and placement services VU. BUDGET AND RESOURCES Budget allocation for academic programs and grading and classrcom technology enhancement Laboratory eguipment procurement departments Facilities up grants IX. UNFINISHED BUSINESS Follow up on previous action items and priorities Faculty research and travel reports X. NEW BUSINESS Other matiers for consideration XI. ADJOURNMENT Next meeting committee r schedule: December 10, 2024, 2 00 PM, Admin Building Conference Room"
    },
    {
        "image": "meetingagenda1_synth_6_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Finance and Management Office ACADEMIC COUNCIL MEETING AGENDA NO. 2024 025 DATE: October 23, 2025 PROM: Dr. Maria Santos, Chairoerson ps PROJECT: Strategic Planning for Curriculum Enhancement and Facul ty Development Programs for Academic Year 2024 2025 I. CALL TO ORDER Rol call and determin meeting (October 15, 2024) 1 ANNOU! Education (CHED) Memorandum Orders Universities (PACU) Recognition of facu semester il. CURRICULUM REVIEW AN Computer Science Integration of Artificia ation of quorum Approval of agenda Approval of minutes from previous CEMENTS AND COMMUNICATIONS Update on Commission on Higher Upcoming accreditation visit by Philippine Association of Colleges and ity achievements and publications Student enrollment statistics for current D DEVELOPMENT A. Proposed Program Revisions Bachelor of Science in Intelligence courses Bachelor of Arts in Communication Addition of Digital Media Production track Master of Business Administration Updates to comply with CHED standards B. New Course Proposals CS 307 Machine Learning and Data Analytics ENG 205 Creative Writing in Phillopine Languages »* BUS 401. Social Entrepreneurship and Sustainable Business C. General Education Curriculum Reform Review of GE requirements alignment with K 41 2 program outcomes Proposed reduction of units io facilitate timely graduation integration of oulcomes based education (OBE) framework IV. FACULTY DEVELOPMENT INITIATIVES Scholarship opportunities for graduate studies (CHED and university grants) Professional evelopment workshops schedule (January June 2025) Research capacity building seminars Teaching excellence awards criteria and nomination process Mentoring program for new faculty members V, ACADEMIC POLICIES AND STANDARDS Revision of grading system and grade computation procedures Implementation of anti piagiarism software for student course delivery Academic integrity policy updates Student appeal and grievance procedures VI. RESEARCH AND PUBLICATION Research funding allocation for AY 2024 2025 Publication incentive program guidelines Partnerships with industry for colla protocols and procedures University re laborative research Ethics review board search journal editorial policies VI. STUDENT WELFARE AND SUPPORT SERVICES Mental health and counsel c resources and digital databa Papers Guidelines for online and hybrid ing services expansion Academic advis ase subscriptions e Scholarship and financial assistance programs Career development and placement services Vill. BUDGET AND RESOURCES Budget allocation for academic programs and departments Facilities upgrading and classroom technoleay enhancement Laborator priorities Faculty research and travel grants IX. UNFINISHED BUSINESS committee reports X. NEW BUSINESS Other matters for conside schedule: December 4 0, 2024, 2 00 PM, Admin B ing system improvements Library y equipment procurement Follow up on previous action items and ration XI. ADJOURNMENT Next meeting uilding Conference Room"
    },
    {
        "image": "meetingagenda1_synth_6_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Finance and Management Office ACADEMIC COUNCIL MEETING AGENDA NO. 2024 025 DATE: October 23, 2025 FROM: Dr. Maria Santos, Chairperson PROJECT: Strategic Planning for Curriculum Enhancement and Faculty Development Programs for Academic Year 2024 2025 et nt Items of Discussion: |. CALL TO ORDER Roll call and determination of quorum Approval of agenda Approval of minutes from previous meeting (October 15, 2024) Il. ANNOUNCEMENTS AND COMMUNICATIONS Update on Commission on Higher Education (CHED) Memorandum Orders Upcoming accreditation visit by Philippine Association of Colleges and Universities (PACU) Recognition of faculty achievements and publications Student enrollment statistics for current semester II]. CURRICULUM REVIEW AND DEVELOPMENT A. Proposed Program Revisions Bachelor of Science in Computer Science Integration of Artificial Intelligence courses Bachelor of Arts in Communication Addition of Digital Media Production track Master of Business Administration Updates to comply with CHED standards B. New Course Proposals CS 301 Machine Learning and Data Analytics ENG 205 Creative Writing in Philippine Languages BUS 401 Social Entrepreneurship and Sustainable Business C. General Education Curriculum Reform Review of GE requirements alignment with K 12 program outcomes Proposed reduction of units to facilitate timely graduation Integration of outcomes based education (OBE) framework IV. FACULTY DEVELOPMENT INITIATIVES Scholarship opportunities for graduate studies (CHED and university grants) Professional development workshops schedule (January June 2025) Research capacity building seminars Teaching excellence awards criteria and nomination process Mentoring program for new faculty members V. ACADEMIC POLICIES AND STANDARDS »« Revision of grading system and grade computation procedures Implementation of anti plagiarism software for student papers Guidelines for online and hybrid course delivery Academic integrity policy updates Student appeal and grievance procedures VI. RESEARCH AND PUBLICATION Research funding allocation for AY 2024 2025 Publication incentive program guidelines Partnerships with industry for collaborative research Ethics review board protocols and procedures University research journal editorial policies VI]. STUDENT WELFARE AND SUPPORT SERVICES Mental health and counseling services expansion Academic advising system improvements Library resources and digital database subscriptions Scholarship and financial assistance programs Career development and placement services VIII. BUDGET AND RESOURCES Budget allocation for academic programs and departments Facilities upgrading and classroom technology enhancement Laboratory equipment procurement priorities Faculty research and travel grants IX. UNFINISHED BUSINESS Follow up on previous action items and committee reports X. NEW BUSINESS Other matters for consideration Xl. ADJOURNMENT Next meeting schedule: December 10, 2024, 2 00 PM, Admin Building Conference Room"
    },
    {
        "image": "meetingagenda1_synth_6_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Finance and Management Office ACADEMIC COUNCIL MEETING AGENDA NO. 2024 025 DATE: October 23, 2025 PROM: Dr. Maria Santos, Chairperson PROJECT: Strategic Planning seulum Er cant and Eacutty Devele racer AJDAL AS Strategic Planning for Curriculum Enhancement and Faculty Development Programs for Acadernic Year 2024 2025 i CALL TO ORDER Roll call and determination of quorum Approval of agenda Approval of minutes from previous october 15, 2024) 1. ANNOUNCEMENTS AND COMMUNICATIONS Update on Commission on higher meeting (Oc Education (CHED) Memorandum Orders Upcoming accreditation visit by Philippine Association of Colleges and Universities (PACU) Recognition of faculty achievements and publications Student enroliment statistics for current semester Ill. CURRICULUM REVIEW AND DEVELOPMENT A. Proposed Program Revisions Bachelor of Science in Computer Science Integration of Artificial intelligence courses Bachelor of Arts in Communication Addition of Digital Media Production track Master of Business Administration Updates to comply with CHED standards B. New Learning and Data Analytics ENG 205 Creative Writing in Philippine Course Proposals CS 304 Machine L Languages BUS 401 Social Entrepreneurship and Sustainable Business C. General Education Curriculum Reform mae Review of GE requirements alignment with K 12 program oulcomes Proposed reduction of units to faciltate time! graduation Integration of cutcomes based education (OBE) framework iv. FACULTY DEVELOPMENT INITIATIVES Scholarship opportunities for graduate studies (CHED and university grants) Professional development workshops schedule (January June 2025) Research capacity building seminars Teaching excellence awards criteria and nomination process Mentoring program for new faculty members V. ACADEMIC POLICIES AND STANDARDS Revision of grading system and grade computation procedures implementation of anti plagiarism software for student papers Guidelines for online and hybrid course delivery Academic integrity policy updates Student appeal and grievance procedures VI. RESEARCH AND PUBLICATION Research funding allocation for AY 2024 2025 Publication incentive program guidelines Partnerships with industry for c Haborative research Ethics review board protocols and procedures University research journal editorial policies Vil. STUDENT WELFARE AND SUPPORT SERVICES Mental health and counseling services expansion Academic advising system improvements Library resources and digital cataoase subscriptions Scholarship and financial assistance programs Career development and placement services VII. BUDGET AND RESOURCES Budget allocation for academic programs and ilities upgrading and classroom technology enhancement Laboratory equipment procurement h and travel grants [X. UNFINISHED BUSINESS Follow up on previous action items and s for consideration X!. ADJOURNMENT Next meeting departments Fac priorities Faculty researcl committee reports X. NEW BUSINESS Other matter schedule: December 10, 2024, 2 00 PM, Admin Building Conference Room"
    },
    {
        "image": "meetingagenda1_synth_7_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "—E MANILA UNIVERSITY ATENEO D office of the Vice Chancellor for Academic Affairs DEPARTMENT FACULTY MEETING AGENDA NO. 2024 018 DATE: December 04, 2025 FROM: prof, Juan Dela Cruz, atory Based Education Framework and Labor f Outcomes- er Science Programs PROJECT: implementation Upgrading Project for Comput Acknowledgment of faculty embers ACADEMIC PROGRAM t academic year Mi. iysis (5 year comparison) Graduate n program strengths and areas for improvement CHED BS Information Technology Program industry advisory paration B. ituti internship and practicum placement vision Comprehensive n of new faculty M tems of Discussion: curren {. OPENING REMARKS and awards Revi uter Science tudy results Al accreditation pre Welcome and introductio ew of department goals for Program Enroliment trends ana accomplishments ummni feedback o UPDATES A. BS Comp employability and tracer s ents and compliance requirem poard recommendations Articulation agreements with partner insti ter Science) Thesis and dissertation guidelines re eview Ill. CURRICULUM AND INSTRUCTION « Course jearning (MS Compu eview and UP very modalities (face raduate Programs e and policies ng outcomes program outco ctiveness results LABORATORY AND FACILITIES Computer laboratory new acquisitions Hardware specifications for tocols and security measur Laboratory safety pro’ ORKLOAD AND ASSIGNMENTS Teaching loa gnments Committee memberships an nt needs Summer class offerings and faculty assignments Vv rch agenda and priority areas Funding opportunities (university, post, CHED, Research collaboration with industry partners Extension programs with local government units an Faculty research outputs and publication tracking VIl. PROFESSIONAL DEVELOPMENT Conference attendance and paper presentation opportunities Training programs on emerging technologies (Al, Cybersecurity, Cloud Computing) Certification programs for faculty (AWS, Microsoft, Cisco) Graduate studies cholarship opportunities Faculty exchange programs with international universities Vill. STUDENT Cc D SUPPORT Academic advising responsibilities and student consultation hours Student organization adviser duties Peer tutoring program for struggling students Undergraduate research mentorship opportunities Career guidance tions VK. ADMINISTRATIVE MATTERS Department budget utilization and financial report and industry connec Procurement requests and purchase requisitions Office supplies and instructional jais inventory Event planning gnition program) Documentation and records management X, OPEN FORUM Faculty (department week, reco concems, suggestions, and recommendations Discussion of pending issues and challenges xl. CLOSING f action items and assignments Next meeting: November 22, 2024, 3 00 PM, cS Conference REMARKS °* Summary Room e faculty qualifications assessment Syllabus f mes instructional deli Best practices upgrading Pr aboratory compute es Equipmen d distribution for se tive designa |, RESE dating requirements -to face, online, nybrid) sharing session innovative teaching strategies IV. oject timeline and budget Software licenses rs Network infrastructure maintenance schedule and procedures cond semester Research and tions Adjunct and part time ARCH AND EXTENSION private sector) d communities updates c G examination schedul Implementation of OBE learni outcome (CLO) alignment with Student eva renewal and irmprovernents Vy. FACULTY Ww extension service assi faculty recruitme Department resea"
    },
    {
        "image": "meetingagenda1_synth_7_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Office of the Vice Chancellor for Academic Affairs DEPARTMENT FACULTY MEETING AGENDA NO, 2024 018 DATE: December 04, 2025 FROM: Prof. Juan Dela Cruz, PROJECT: implementation of Outcomes Based Education Framework and Laboratory Upgrading Project for Computer Science Programs Items of Discussion: 1. OPENING REMARKS Welcome and introduction of new faculty members Acknowledgment of faculty accomplishments and awards Review of department goals for current academic year I]. ACADEMIC PROGRAM UPDATES A. BS Computer Science Program Enrollment trends analysis (5 year comparison) Graduate employability and tracer study results Alumni feedback on program strengths and areas for improvement CHED compliance requirements and accreditation preparation B. BS Information Technology Program Industry advisory board recommendations Articulation agreements with partner institutions Internship and practicum placement updates C. Graduate Programs (MS Computer Science) Thesis and dissertation guidelines revision Comprehensive examination schedule and policies Graduate faculty qualifications review |Il. CURRICULUM AND INSTRUCTION Implementation of OBE learning outcomes assessment Syilabus review and updating requirements Course learning outcome (CLO) alignment with program outcomes Instructional delivery modalities (face to face, online, hybrid) Student evaluation of teaching effectiveness resuits Best practices sharing session innovative teaching strategies IV. LABORATORY AND FACILITIES Computer laboratory upgrading project timeline and budget Software licenses renewal and new acquisitions Hardware specifications for laboratory computers Network infrastructure improvements Laboratory safety protocols and security measures Equipment maintenance schedule and procedures V. FACULTY WORKLOAD AND ASSIGNMENTS Teaching load distribution for second semester Research and extension service assignments Committee memberships and administrative designations Adjunct and part time faculty recruitment needs Summer class offerings and faculty assignments VI. RESEARCH AND EXTENSION Department research agenda and priority areas Funding opportunities (university, DOST, CHED, private sector) Research collaboration with industry partners Extension programs with local government units and communities Faculty research outputs and publication tracking Vil. PROFESSIONAL DEVELOPMENT Conference attendance and paper presentation opportunities Training programs on emerging technologies (Al, Cybersecurity, Cloud Computing) Certification programs for faculty (AWS, Microsoft, Cisco) Graduate studies support and scholarship opportunities Faculty exchange programs with international universities Vill. STUDENT CONCERNS AND SUPPORT Academic advising responsibilities and student consultation hours Student organization activities and faculty adviser duties Peer tutoring program for struggling students Undergraduate research mentorship opportunities Career guidance and industry connections IX. ADMINISTRATIVE MATTERS Department budget utilization and financial report Procurement requests and purchase requisitions Office supplies and instructional materials inventory Event planning (department week, recognition program) Documentation and records management X. OPEN FORUM Faculty concerns, suggestions, and recommendations Discussion of pending issues and chalienges XI. CLOSING REMARKS Summary of action items and assignments Next meeting: November 22, 2024, 3 00 PM, CS Conference Room"
    },
    {
        "image": "meetingagenda1_synth_7_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "MANILA UNIVERSITY ATENEO DE Office of the Vice Chancellor for Academic Affairs DEPARTMENT FACULTY MEETING AGENDA NO. 2024 018 DATE: December 04, 2026 FROM: prof, Juan Dela Cruz. k and Laboratory Education Framewor rams PROJECT: Implementation of Outcomes Based Upgrading Project for Computer Science Prog ment of faculty embers EMIC PROGRAM ion of new faculty M s for curren Items of Discussion: |. OPENING REMARKS accomplishments and awa UPDATES A. BS Computer Science Progr employability and tracer study results Alu compliance requirements and accreditation preparation board recommendations Articulation agreements with pa updates Cc. Graduate Programs (MS Computer Science) Thes examination schedule and policies Graduate faculty qualifications r Implementation of OBE learning outcomes assessment Syllabus re outcome (CLO) alignment with program outcomes Instructional delivery Student evaluatio tiveness results ces sharing session innova project timeline and budget SO n of teaching effec Best practi LABORATORY AND FACILITIES Computer laboratory upgrading i renewal and new acquisitions ecifications for laboratory computers Network infrastructure le and procedures Hardware sp improvements Laboratory safety nd security measures Equipment protocols a Vy. FACULTY WORKLOAD AND ASSIGNMENTS Teaching load distribution for second se extension service assignments Cc nd administrative designations Adjunct and part time ommittee memberships 4 ulty recruitment needs Summer class offerings and faculty assignments Vi. RESEARCH AND EXTENSION search agenda and priority areas °* Funding opportunities (university, DOST, CHED, private sector) boration with industry partners Extension programs with local government units and communities outputs and publication tracking VII. PROFESSIONAL DEVELOPMENT Conference attendance and portunities Training programs on emergin urity, Cloud Computing) g technologies (Al, Cybersec for faculty (AWS, Microsoft, Cisco) holarship opportunities ams with international universitie SUPPORT Academic advising responsibilities and student consultation hours Student orga culty adviser duties Peer tutoring program for struggling students Undergraduate researc Career guidance and industry connections IX. ADMINISTRATIVE MATTERS Departmen rts Procurement requests and purchase requisitions Office supplies and instructional ma planning (department week, recognition program) Docu ion and records management X. mentat concerns, suggestions, and recommendations nding issues and challen Discussion of pe REMARKS Summary of action items and assignments Next meeting: November 22, 2024, 3 00 P Room troduct department goal am Enrollment trends analysis (5 mni feedback on program strengths B. BS Information Tec utions Intern Welcome and in ds Review of arison) for improvement + Industry advisory -year comp and areas nology Program ship and practicum placement guidelines revision Comprehensive D INSTRUCTION nts Course learning line, hybrid) ategies IV. rtner instit is and dissertation I. CURRICULUM AN g requireme -to face, On tive teaching str ¢tware licenses eview Il view and updatin modalities (face maintenance schedu mester Research and fac Department re Research colla Faculty research paper presentation op Certification programs Faculty exchange progr nization activitie h mentorship opportunities t budget utilization and financial repo terials inventory Event OPEN FORUM Faculty ges XI. CLOSING M, CS Conference"
    },
    {
        "image": "meetingagenda1_synth_7_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Office of the Vice Chancellor for Academic Affairs DEPARTMENT FACULTY MEETING AGENDA NO. 2024 018 DATE: December 04, 2025 FROM: Prof. Juan Dela Cruz, PROJECT: Implementation of Outcomes Based Education Framework and Laboratory Upgrading Project for Computer Science Programs Items of Discussion: |. OPENING REMARKS Welcome and introduction of new faculty members Acknowledgment of faculty accomplishments and awards Review of department goals for current academic year II. ACADEMIC PROGRAM UPDATES A. BS Computer Science Program Enrollment trends analysis (5 year comparison) Graduate employability and tracer study results Alumni feedback on program strengths and areas for improvement CHED compliance requirements and accreditation preparation B. BS Information Technology Program Industry advisory board recommendations Articulation agreements with partner institutions Internship and practicum placement updates C. Graduate Programs (MS Computer Science) Thesis and dissertation guidelines revision Comprehensive examination schedule and policies Graduate faculty qualifications review Ill. CURRICULUM AND INSTRUCTION Implementation of OBE learning outcomes assessment Syllabus review and updating requirements Course learning outcome (CLO) alignment with program outcomes Instructional delivery modalities (face to face, online, hybrid) Student evaluation of teaching effectiveness results Best practices sharing session innovative teaching strategies IV. LABORATORY AND FACILITIES Computer laboratory upgrading project timeline and budget Software licenses renewal and new acquisitions Hardware specifications for laboratory computers Network infrastructure improvements Laboratory safety protocols and security measures Equipment maintenance schedule and procedures VV. FACULTY WORKLOAD AND ASSIGNMENTS Teaching load distribution for second semester Research and extension service assignments Committee memberships and administrative designations Adjunct and part time faculty recruitment needs Summer class offerings and faculty assignments VI. RESEARCH AND EXTENSION Department research agenda and priority areas Funding opportunities (university, DOST, CHED, private sector) Research collaboration with industry partners Extension programs with local government units and communities Faculty research outputs and publication tracking VII. PROFESSIONAL DEVELOPMENT Conference attendance and paper presentation opportunities Training programs on emerging technologies (Al, Cybersecurity, Cloud Computing) Certification programs for faculty (AWS, Microsoft, Cisco) Graduate studies support and scholarship opportunities Faculty exchange programs with international universities VIII. STUDENT CONCERNS AND SUPPORT Academic advising responsibilities and student consultation hours Student organization activities and faculty adviser duties Peer tutoring program for struggling students Undergraduate research mentorship opportunities Career guidance and industry connections IX. ADMINISTRATIVE MATTERS Department budget utilization and financial report Procurement requests and purchase requisitions Office supplies and instructional materials inventory Event planning (department week, recognition program) Documentation and records management X. OPEN FORUM Faculty concerns, suggestions, and recommendations Discussion of pending issues and challenges XI. CLOSING REMARKS Summary of action items and assignments Next meeting: November 22, 2024, 3 00 PM, CS Conference Room"
    },
    {
        "image": "meetingagenda1_synth_7_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Office of the Vice Chancellor for Academic Affairs DEPARTMENT FACULTY MEETING AGENDA NO. 2024 018 DATE: December 04, 2025 FROM: Prof. Juan Dela Cruz, PROJECT: Implementation of Outcomes Based Education Framework and Laboratory Upgrading Project for Computer Science Programs eS Items of Discussion: |. OPENING REMARKS Welcome and introduction of new faculty members Acknowledgment of faculty accomplishments and awards Review of department goals for current academic year Il. ACADEMIC PROGRAM UPDATES A. BS Computer Science Program Enrollment trends analysis (5 year comparison) Graduate employability and tracer study results Alumni feedback on program strengths and areas for improvement CHED compliance requirements and accreditation preparation B. BS Information Technology Program Industry advisory board recommendations Articulation agreements with partner institutions Internship and practicum placement updates C. Graduate Programs (MS Computer Science) Thesis and dissertation guidelines revision Comprehensive examination schedule and policies Graduate faculty qualifications review II]. CURRICULUM AND INSTRUCTION Implementation of OBE learning outcomes assessment Syllabus review and updating requirements Course learning outcome (CLO) alignment with program outcomes Instructional delivery modalities (face to face, online, hybrid) Student evaluation of teaching effectiveness results Best practices sharing session innovative teaching strategies IV. LABORATORY AND FACILITIES Computer laboratory upgrading project timeline and budget Software licenses renewal and new acquisitions Hardware specifications for laboratory computers Network infrastructure improvements Laboratory safety protocols and security measures Equipment maintenance schedule and procedures V. FACULTY WORKLOAD AND ASSIGNMENTS Teaching load distribution for second semester Research and extension service assignments Committee memberships and administrative designations Adjunct and part time faculty recruitment needs Summer class offerings and faculty assignments VI. RESEARCH AND EXTENSION Department research agenda and priority areas Funding opportunities (university, DOST, CHED, private sector) Research collaboration with industry partners Extension programs with local government units and communities Faculty research outputs and publication tracking VIl. PROFESSIONAL DEVELOPMENT Conference attendance and paper presentation opportunities Training programs on emerging technologies (Al, Cybersecurity, Cloud Computing) Certification programs for faculty (AWS, Microsoft, Cisco) Graduate studies support and scholarship opportunities Faculty exchange programs with international universities VIIl. STUDENT CONCERNS AND SUPPORT *« Academic advising responsibilities and student consultation hours Student organization activities and faculty adviser duties Peer tutoring program for struggling students Undergraduate research mentorship opportunities Career guidance and industry connections IX. ADMINISTRATIVE MATTERS Department budget utilization and financial report Procurement requests and purchase requisitions Office supplies and instructional materials inventory Event planning (department week, recognition program) Documentation and records management X. OPEN FORUM Faculty concerns, suggestions, and recommendations Discussion of pending issues and challenges XI. CLOSING REMARKS Summary of action items and assignments Next meeting: November 22, 2024, 3 00 PM, CS Conference Room"
    },
    {
        "image": "meetingagenda1_synth_8_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Office of the Vice Chancellor for Academic Affairs STUDENT AFFAIRS COUNCIL MEETING AGENDA NO. 2024 031 DATE: January 14, 2026 FROM: Ms. Carmen Torres, Director PROJECT: Student Welfare Enhancement Program and Campus Life Improvement Initiatives for Academic Year 2024 2025 Items of Discussion: |. CALL TO ORDER AND PRELIMINARIES Welcom e remarks and roll call Approval of meeting agenda Approval of previous meeting minutes (October 28, 2024) Il. STUDENT ORGANIZATION UPDATES Registration status of student organizations for current academic year Student government election results and officer induction Budget allocation for student activities and events Compliance with student organization guidelines and policies Recognition of outstanding student organizations III. STUDENT DEVELOPMENT PROGRAMS A. Leadership Training and Formation Student leadership seminar schedule (November December 2024) Officer training for student organization executives Values formation and character development workshops Outreach and community service programs B. Cultural and Arts Programs University week celebration planning (February 2025) Inter college cultural competition guidelines Student performing arts groups support Art exhibits and talent showcase events C. Sports and Recreation Athletic program updates and training schedules Inter university sports competitions participation Intramural sports league organization Sports facilities maintenance and improvement Sports scholarship and financial assistance IV. STUDENT WELFARE AND SERVICES A. Counseling and Mental Health Expansion of counseling services and Mental health awareness campaign planning Crisis intervention protocols and referral system Peer personnel edical Services counseling program development Partnerships with mental health organizations B. Health and M University health center services and operating hours Health insurance coverage for students Medical emergency response procedures Health and wellness programs (nutrition, fitness, disease prevention) C. Financial Assistance Scholarship application process and requirements Student loan and emergency financial assistance Work study program opportunities Discount schemes and payment arrangements V. STUDENT CONDUCT AND DISCIPLINE Review of student handbook and code of conduct Disciplinary cases and resolution procedures Anti bullying and harassment policy implementation Drug free campus programs and interventions Student grievance mechanism and due process VI. RESIDENTIAL LIFE (DORMITORY MANAGEMENT) Dormitory occupancy rates and room assignments Facilities maintenance and improvement needs Dormitory rules and regulations compliance Resident assistant program development Safety and security measures Vil. CAREER AND PLACEMENT SERVICES »* Career counseling and guidance programs Job fair and recruitment activities planning Resume writing and interview skills workshops Alumni mentoring program implementation Industry linkages and internship placements VIII. STUDENT FEEDBACK AND CONCERNS Results of student satisfaction surveys Student suggestions and recommendations Town hall meeting with student leaders Response to student petitions and appeals IX. CAMPUS SAFETY AND SECURITY Security personnel deployment and training CCTV monitoring and campus surveillance Emergency preparedness and disaster response drills Traffic and parking management Student identification and access control X. BUDGET AND RESOURCES Student affairs budget utilization report Funding requests for programs and activities Revenue generation from student services XI. ANNOUNCEMENTS AND NEXT MEETING Upcoming events and important dates Next meeting: December 18, 2024, 2 00 PM, Student Center Conference Room"
    },
    {
        "image": "meetingagenda1_synth_8_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Office of the Vice Chancellor for Academic Affairs STUDENT AFFAIRS CO UNCIL MEETING AGENDA NO. 2024 031 DATE: January 14, 2096 cae FROM: Ms. Carmen Torres, Director PROJECT: Student Welfare Enhancement Program and Campus Life Improvement init Academic Year 2024 2025 iatives for D PRELIMINARI IES We! inutes (October 28, 2024) for current acaden previous meeting m Organizations emic year Stu for student activities and events Compl outstanding Student organizations Student leaders come remarks and roll i. STUDENT ORGA dent governme lance with Student call Approval of Meetin NIZATION UPDATES nt election resuits and officer induction Bu Organization guidelines ang Policies il, STUDENT DEVELOPMENT PROGRAMS A. Leadership Training and Formation ship seminar Schedule November December 2024) Officer trainj Values formation and character devel Arts Programs ing for student organization exec opment Workshops Outreach ang co University week célebration plan Student Performing arts SmMmunity service Programs B. ning (February 2025) Inter college cultural com 2etitian guidelines GFOUDS Support Art exhibits and talent Showcase events C. Sports and Recreation Athletic Program updates and training Schedules inter university sports competitions Participation Intramural Sports Organization Sports facilities maintenance and improvement Spo STUDENT WELFARE AND SERVICES 4. Personne! Mental h iS league Rnancia! assistance hy. Counseling and Mental fealth Expansion of th awareness cam 9 agenda Approy al of Registration statu dget alfoca Hon Recognition of ulives Cultura! and ris Scholarship and eal OUNSeling Sé rvices ang paign Planning Crisis interventian Protocols and referral System Peer counseling brogram development Partners hips with menta! h University health Center services {ai health organizations B. Health and Medica} Services rance Coverage for Students Medica! emergency Health ang wellness Programs (nutrition, fitness, disease Prevention) C F iNancial Assistance Scholarship application Process and requirements Student loan and emergency financial &8sistance Work study Drogram Opportunities Discount Schemes and Payment arrangements Vv. STUDENT CONDUCT AND DISCIPLINE Review of Siudent handbook @NG code of conduct Disciplinary Cases and resolution Procedures Anti. uilying and harassment Policy j G Tree Campus Programs and interventic and Operating hours Health insy response Procedures mplementation Dru due process yj. RESIDENTIAL LIFE CNS Student grievance Mechanism and (DORMITORY MANAGEMENT) Dormitory Sccupancy 1 assignments Facilities maintenance ang improvement n assistant Program deve} raies and room €Guiations compliance Resident AND PLACEMENT SERVICES eeds Dormitory rules and p opment e Safety and Security measures VIL CAREER Career idance Programs Job fair and recruitment activities planning Resume Writing and interview Skills workshops Alumni Mentoring Drogram implementation industry linkages and internship placemenis VEL. STUDENT FEEDBACK AND CONCERNS Results of Student Satisfaction Surveys Student Suggestions ang recommendati Town hall meeting with Student leaders Response to Student Petitions ang appeais IX, CAR SECURITY Security Personne! deployment and training CCTV 7 Preparedness and disaster X. BUDGET AN Reve COUunseling and gu MPUS SAFETY AND 1onitoring ang campus SUIVEillance e Emergency response drills Traffic and Parking ma lagement Student identification and access contral D RESOURCES. nt affairs budget utilization report Funding requests for Programs and activities NUE generation from student Services XI]. ANNOUNCEMENTS AND NEXT MEETING Upcoming events and important dates +* Next meeting: December 18, 2024, nter Conference Room Stude 2 00 PM, Student Ce"
    },
    {
        "image": "meetingagenda1_synth_8_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Office of the Vice Chancellor for Acadernic Affairs STUDENT AFFAIRS COUNCIL MEETING AGENDA NO. 2024 031 DATE: January 14, 2026 js, Carmen Torres, Director BOOT. me . neg i td 7 o tat Lane PROJECT: Student Welfare Enhancement Program and Campus Life Improvement Initiatives for Academic Year 2024 2025 er CALL TO ORDER AND PRELIMINARIES »« Welcome remarks and roil call Approval of meeting agenda Approval of previous meeting minutes (October 28, 2024) 1. STUDENT ORGANIZATION UPDATES Registration status of student organizations for current academic year Student government siection results and officer induction Budget allocation for student activities and events Compliance with student organization guidelines and policies Recognition of outstanding student organizations Hl. STUDENT DEVELOPMENT PROGRAMS A. Leadership Training and Formation Student leadership seminar schedule (November December 2024) Officer training for student organization executives Vaiues formation and character development workshops Outreach and community service programs 8. Cultural and Afis Programs University week celebration planning (February 2025) inter college cultural competition guidelines Student performing arts groups support Ari exhibits and talent showcase evenis C. Sports and Recreation Athietic program updates and training schedules Infer university sporis competitions participation Intramural sports league organization Sports facilities maintenance and improvement Sports scholarship and financial assistance [V. STUDENT WELFARE AND SERVICES A. Counseling and Mental Health Expansion of counseling services anc personnel Mental health awareness campaign planning Crisis intervention protocols and referral system Peer counseling srogram development Parinerships with mental health organizetions B. Mealth and Medical Services University healin center services and operating hours Health insurance coverage for students Medical emergency response procedures Health and weliness programs (nutrition, finess, disease prevention) C. Financial Assistance Scholarship application process and requirements Student loan and emergency financial assistance Work siudy program opporiunities Discount schemes and payment arrangemenis V. STUDENT CONDUCT AND DISCIPLINE Review of student nancbook and code of conduct Disciplinary cases and resolution procedures Anti bullying and harassment policy implementation Drug free campus programs and interventions Student grevance mechanism and due process Vi. RESIDENTIAL LIFE (DORMITORY MANAGEMENT) Dormitory occupancy rates and room assignments Facilities maintenance and improvement needs Dormitory rules and regulations compliance Resident assistant program development: Safety and security measures VI. CAREER AND PLACEMENT SERVICES Career counseling and guidance programs Job fair and recruitment activities planning Resume writing and interview skills workshops Alumni mentoring program implementation industry linkages and internship placements VU. STUDENT FEEDBACK AND CONCERNS Results of student satisfaction surveys Student suggestions and recommendations Town hall meeting with student leaders Response to stucent pelitions and appeals Ix. CAMPUS SAFETY AND SECURITY Securify personne! deployment and training CCTV monitoring and campus surveillance Emergency preparedness and disaster response crills Traffic and parking management Student identification and access contro! Xx. BUDGET AND RESOURCES Student affairs buaget utilization report Funding requests for programs and activities Revenue generation fram student services Xl. ANNOUNCEMENTS AND NEXT MEETING Upcoming events ana important dates Next meeting: December 18, 2024, 2 00 PM, Stucent Center Conference Room"
    },
    {
        "image": "meetingagenda1_synth_8_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Office of the Vice Chancellor for Academic Affairs STUDENT AFFAIRS COUNCIL MEETING AGENDA NO. 2024 031 DATE: January 14, 2026 FROM: Ms. Carmen Torres, Director PROJECT: Student Welfare Enhancement Program and Campus Life Improvement Initiatives for Academic Year 2024 2025 Items of Discussion: stems OF Discussion: |. CALL TO ORDER AND PRELIMINARIES Welcome remarks and roll call Previous meeting minutes (October 28, 2024) Il. STUDENT ORGANIZATION organizations for current academic year Student government election result for student activities and events Compliance with student organization guid outstanding student organizations III. STUDENT DEVELOPMENT PROGRA Student leadership seminar schedule (November December 2024) Officer Values formation and character development workshops Outreach and Cc Arts Programs University week celebration plann Student performing arts groups support Art exhib Approval of meeting agenda Approval of UPDATES Registration status of student S and officer induction Budget allocation elines and policies Recognition of MS A. Leadership Training and Formation training for student organization executives ommunity service Programs B. Cultural and ing (February 2025) Inter college cultural competition guidelines its and talent showcase events C. Sports and Recreation Athletic Program updates and training schedules Inter university sports competitions Participation Intramural Sports league organization Sports facilities maintenance and improvement Sports Scholarship and financial assistance IV. STUDENT WELFARE AND SERVICES A. Counsel Seling and Mental Health Expansion of counseling services and Personnel Mental health awareness campaign i isis j counseling program development Partnerships with mental health organizations B. Healt University health center services and operating hours response procedures Health and wellness programs Scholarship application process and requirements ance Work study Program opportunities Discount schemes and payment arrangements V. STUDENT CONDUCT AND DISCIPLINE Review of student handbook and code of conduct Disciplinary cases and resolution Procedures harassment policy implementation Drug free camp Anti bullying and US programs and interventions Student grievance mechanism and due process VI. RESIDENTIAL LIFE (DORMITORY MANAGEMENT) Dormitory occ assignments upancy rates and room and improvement needs Dormitory rules and regulations compliance Resident ety and security measures VII. CAREER AND PLACEMENT SERVICES Career Job fair and recruitment activities €sume writing and interview Skills m implementation Industry linkages and internship placements VIII. STUDENT ults of student Satisfaction Surveys Student Suggestions and recommendations ers Response to student petitions and appeals IX. CAMPUS SAFETY AND SECURITY «+ Security personnel deployment and training CCTV monitoring and Campus surveillance Preparedness and disaster response drills Traffic and parking management Student identification and X. BUDGET AND RESOURCES Student affairs budget utilization report Funding requests for progra Revenue generation from student services XI. ANNOUNCEMENTS A ND NEXT MEETING Upcomin important dates Next meeting: December 18, 2024, 2 00 PM, Student Center Conference Room h and Medical Services dents Medical emergency nutrition, fitness, disease prevention) C. Financial Assistance Student loan and emergency financial assist Health insurance coverage for stu counseling and guidance programs workshops Alumni mentoring progra FEEDBACK AND CONCERNS Res Town hall meeting with student lead planning *R Emergency access control Ms and activities g events and"
    },
    {
        "image": "meetingagenda1_synth_8_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Office of the Vice Chancellor for Academic Affairs STUDENT AFFAIRG COUNCIL MEETING AGENDA NO. 2024 034 DATE: January 14, 2026 TED ¥, “ “pe es FROM: Ms, Carmen 'ofres, Director PROJECT: Student Welfare Enhancement Program ana Campus Life improvement initiatives for Academic Year 2024 2025 I. CALL To ORDER Previous mee AND PRELIMINARIES Welcome remarks anc roll ting minutes (Oo call Approva} of mesti Clober 28, 2024) Vy, STUDENT ORGANIZATION UPDATES R n status of Student ection results &Nd officer induction Budget allocation Student Organization guidelines and policles s Recognition of Student Ofganizations tf STUDENT DEVELOPMENT PROGRAMS A, Leadership Training Student leadership seminar schedule (November December 2024) Officer training fer Student o Values formation ang character Seveloprnent workshops Qutre ach and community service Programs B. Cultural and Arts Programs University week celebration Planning (February 2025) inter college Cultural competition guidelines Student Performing arts STOUDS support Art exhibits and lalent showcase events C. Sports ang Recreation Ainletic Program updates and training Scnedules jr OmMpetitions PaNicipation Intramural Sports league Sports facilities maintenance ang improvement Sports Scholarship and financial assistance [y, STUDENT WELFARE AND SERVICES A. Counsell Ith Expansion of COUNSElINg services and Mentai health awareness rvention protocals and referral System Peer ental health Organizations B. Health and Medic insurance Coverage fc Organizations for culrent academic year Student Jovernment el for student activities ang events °C -OMpliance with Ad agenda Approval of @nd Formation ition executives ler university Sports c Organization Ag and Mental Hes Personne! campaign planning Crisis inte pment Partnerships with m counseling Program develo University health center Services and Operating hours Health response procedures Health and well of Students Medicai emergency 1 SS programs (nutrition, fitness, disease prevention) C, Financial Assistance Scholarship application process and requirements Student loan and emer Program opportunities Discount scheme gency financial assistance Work study alrangements V. STUDENT CONDUCT AND DISCIPLINE e S and resolution proc ~bullying and S and payment ode Of condy Dlinary case cedures Anti implementation Drug free CaMpus programs and interventions Student grievance mec LIFE (DORMITORY MANAGEMENT) Dormitory Occupancy rate ites maintenance and impro nt needs Dormitory rules and regulations compliance Resident assistant Program develop Security measures Vi. CAREER AND PLACEMENT SERVICES COUNSEling and guidance Programs Job fair and recruitment activities planning Resume writing and i workshops Alumni Mentoring program implementation FEEDBACK AND CONCERNS Results of stude Town hail meeting with student ieaders Response to student SECUR ersonnel deployment and training «CG res TV monite eSPONSS Cris Trart X. BUDGET AND RESOURC CES Studen Gent affairs budget uti! Revenue generation from stud Review of student h harassment Dalicy due process Vij. RESIDENTIAL assignments Faci] andbook and ct Disej S and room veme ment Safety and Career nlerview skilis and internship placements VAL STUBENT Sand recommendations CAMPUS SAFETY AND ring and CAMPUS surveillance e Emergency anagement Student identificat Industry linkages petitions and appeals (x. iTy e Security p Preparedness and disaster ion and access control lization report runcing requests for programs ent services XI. ANNOUNCEMENTS AND NEXT MEETING Upcoming events and g: December 18, 2024, 2 00 PM, Student Center Confe and activities important dates Next meetin rence Roam"
    },
    {
        "image": "meetingagenda1_synth_9_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES ing Department Council A NO. 2024 031 College of Engineer AIRS COUNCIL MEETING AGEND STUDENT AFF DATE: January 09, 2026 FROM: Ms. Carmen Torres, Director PROJECT: Student Welfare Enhancement Program and Campus Life Improvement Initiatives for Academic Year 2024 2025 Items of Discussion: emarks and roll call Approval of meeting agenda Approval of |. CALL TO ORDER AND PRELIMINARIES Welcome Fr previous meeting minutes (October 28, 2024) Il. STUDENT ORGANIZATION UPDATES Registration status of student organizations for current academic year Student government election results and officer induction Budget allocation and policies Recognition of for student activities and events udent organization guidelines outstanding student organizations T PROGRAMS A. Leadership Training and Forma Student leadership seminar schedule (November December 2024) Officer training for student organization executives Values formation and character development workshops Outreach and community service programs B. Cultural and Arts Programs University week celebration planning (February 2025) Inter college cultural competition guidelines Student performing arts groups support Art exhibits and talent s C. Sports and Recreation Athletic training schedules inter university sports Intramural sports league facilities maintenance and improvement Sport: assistance IV. ERVICES A. Counseling and Mental He and campaign planning Crisis intervention protocols an hips with mental health organizations B. Healt University health center services and operating hours Health insurance coverage for students response procedures Health and wellness programs (nutrition, fitness, disease prevention) C. Financial Assistance Scholarship application process and requirements Student loan and emergency financial assistance Work study program opportunities Discount schemes and payment arrangements V. STUDENT CONDUCT AND DISCIPLINE Review of student handbook and code of conduct Disciplinary cases and resolution procedures Anti bullying and harassment policy implementation Drug free campus programs and interventions Student grievance mechanism and due process VI. RESIDENTIAL LIFE (DORMITORY MANAGEMENT) Dormitory occupancy rates and room assignments Facilities maintenance and improvement needs Dormitory rules and regulations compliance Resident assistant program development Safety and security measures Vil. CAREER AND PLACEMENT SERVICES °¢ Career counseling and guidance programs Job fair and recruitment activities planning Resume writing and interview skills workshops Alumni mentoring program implementation Industry linkages and internship placements Vill. STUDENT FEEDBACK AND CONCERNS Results of student satisfaction surveys Student suggestions and recommendations Town hall meeting with student leaders Response to student petitions and appeals IX. CAMPUS SAFETY AND SECURITY Security personnel deployment and training CCTV monitoring and campus surveillance Emergency edness and disaster response drills Traffic and parking management Student identification and access control ES Student affairs budget utilization report Funding requests for programs and activities dent services XI. ANNOUNCEMENTS AND NEXT MEETING Upcoming events and December 18, 2024, 2 00 PM, Student Center Conference Room Compliance with st tion \\|. STUDENT DEVELOPMEN howcase events competitions participation s scholarship and financia alth Expansion of counseling services d referral system Peer h and Medical Services Medical emergency program updates and organization Sports STUDENT WELFARE AND S Mental health awareness personnel counseling program development Partners prepar X. BUDGET AND RESOURC Revenue generation from stu important dates Next meeting:"
    },
    {
        "image": "meetingagenda1_synth_9_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES College of Engineering Department Council STUDENT AFFAIRS COUNCIL MEETING AGENDA NO. 2024 031 DATE: January 09, 2026 ia ROM: Ms. Carmen Torres, Director HT cop, 7 rad ifn i iW PROJECT: Student Welfare Enhancement Program and Campus Life Improvement initiatives for Academic Year 2024 2025 i. CALL TO ORDER AND PRELIMINARIES Welcome remarks and roll cail Approval of meeting agenda Approval of previous meeting minutes (October 28, 2024) Il. STUDENT ORGANIZATION UPDATES Registration status of student organizations for current academic year Student government election results and officer induction Budget allocation for student activities and events Compliance with student organization guidelines and policies Recognition of outstanding student organizations I]. STUDENT DEVELOPMENT PROGRAMS A. Leadership Training and Formation Student leadership seminar schedule (November December 2024) Officer training for student organization executives Values formation and character development workshops Outreach and community service programs B. Cultural and Arts Programs University week celebration planning (February 2025) inter college cultural competition guidelines Student performing arts groups support Art exhibits and talent showcase events C. Sports and Recreation Athietic program updates and training schedules Inter university sports competitions participation intramural sports league organization Sports facilities maintenance and improvement Sports scholarship and financial assistance IV. STUDENT WELFARE AND SERVICES A. Counseling and Mental Health Expansion of counseling services and personnel Mental health awareness campaign planning Crisis intervention protocols and referral system Peer counseling program development Partnerships with mental health organizations B. Health and Medical Services ir University health center services and operating hours Health insurance coverage for students Medical emergency response procedures Health and wellness programs (nutrition, fitness, disease prevention) C. Financial Assistance pie) Scholarship application process and requirements Student loan and emergency financial assistance Work study program opportunities Discount schemes and payment arrangements V. STUDENT CONDUCT AND DISCIPLINE Review of student handbook and code of conduct Disciplinary cases and resolution procedures Anti bullying and harassment policy implementation Drug free campus programs and interventions Student grievance mechanism and due process VI. RESIDENTIAL LIFE (DORMITORY MANAGEMENT) Dormitory occupancy rates and room assignments Facilities maintenance and improvement needs Dormitory rules and regulations compliance Resident assistant program development Safety and security measures Vil. CAREER AND PLACEMENT SERVICES Career counseling and guidance programs Job fair and recruitment activities planning Resume writing and interview skills workshops Alumni mentoring program implementation industry linkages and internship placements Vill. STUDENT FEEDBACK AND CONCERNS Resuits of student satisfaction surveys Student suggestions and recommenaations Town hall meeting with student leaders Response to student petitions and appeals IX. CAMPUS SAFETY AND SECURITY Security personnel deployment and training CCTV monitoring and carnpus surveillance Emergency preparedness and disaster response drills Traffic and parking management Student identification and access conirol X. BUDGET AND RESOURCES Student affairs budget utilization report Funding requests for programs and activities Revenue generation from student services XI. ANNOUNCEMENTS AND NEXT MEETING Upcoming events and important dates Next meeting: December 18, 2024, 2 00 PM, Student Center Conference Room"
    },
    {
        "image": "meetingagenda1_synth_9_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES College of Engineering Department Council STUDENT AFFAIRS COUNCIL MEETING AGENDA NO. 2024 031 DATE: January 09, 2026 FROM: Ms. Carmen Torres, Director PROJECT: Student Welfare Enhancement Program and Campus Life Improvement Initiatives for Academic Year 2024 2025 eer ene AAP Items of Discussion: |. CALL TO ORDER AND PRELIMINARIES Welcome remarks and roll call Approval of meeting agenda Approval of previous meeting minutes (October 28, 2624) Il. STUDENT ORGANIZATION UPDATES Registration status of student organizations for current academic year Student government election results and officer induction Budget allocation for student activities and events Compliance with student organization guidelines and policies Recognition of outstanding student organizations Il]. STUDENT DEVELOPMENT PROGRAMS A. Leadership Training and Formation Student leadership seminar schedule (November December 2024) Officer training for student organization executives Values formation and character development workshops Outreach and community service programs B. Cultural and Arts Programs University week celebration planning (February 2025) Inter college cultural competition guidelines Student performing arts groups support Art exhibits and talent showcase events C. Sports and Recreation Athietic program updates and training schedules inter university sports competitions participation Intramural sports league organization Sports facilities maintenance and improvement Sports scholarship and financiai assistance IV. STUDENT WELFARE AND SERVICES A. Counseling and Menta! Heaith Expansion of counseling services and personnel Mental health awareness campaign planning Crisis intervention protocols and referral system Peer counseling program development Partnerships with mental health organizations B. Health and Medical Services «+ University health center services and operating hours Health insurance coverage for students Medical emergency response procedures Health and weliness programs (nuirition, fitness, disease prevention) C. Financial Assistance Scholarship application process and requirements Student loan and emergency financial assistance Work study program opportunities Discount schemes and payment arrangements V. STUDENT CONDUCT AND DISCIPLINE Review of student handbook and code of conduct Disciplinary cases and resolution procedures Anti bullying and harassment policy implementation Drug free campus programs and interventions Student grievance mechanism and due process VI. RESIDENTIAL LIFE (DORMITORY MANAGEMENT) Dormitory occupancy rates and room assignmenis Facilities maintenance and improvement needs Dormitory rules and reguiations compliance Resident assistant program development Safety and security measures Vil. CAREER AND PLACEMENT SERVICES Career counseling and guidance programs Job fair and recruitment activities planning Resume writing and interview skills workshops Alumni mentoring program implementation Industry linkages and internship placements Vill. STUDENT FEEDBACK AND CONCERNS Results of student satisfaction surveys Student suggestions and recommendations Town hali meeting with student leaders Response to student petitions and appeals IX. CAMPUS SAFETY AND SECURITY Security personne! depioyment and training CCTV monitoring and campus surveillance Emergency preparedness and disaster response drills Traffic and parking management Student identification and access control X. BUDGET AND RESOURCES Student affairs budget utilization report Funding requests for programs and activities Revenue generation from student services X1. ANNOUNCEMENTS AND NEXT MEETING Upcoming events and important dates »* Next meeting: December 18, 2024, 2 00 PM, Student Center Conference Room"
    },
    {
        "image": "meetingagenda1_synth_9_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES College of Engineering Department Council STUDENT AFFAIRS COUNCIL MEETING AGENDA NO. 2024 031 DATE: January 09, 2026 FROM: Ms. Carmen Torres, Director PROJECT: Student Welfare Enhancement Program and Campus Life improvement Initiatives for Academic Year 2024 2025 Mand |. CALL TO ORDER AND PRELIMINARIES Welcome remarks previous meeting minutes (October 28, 2024) Il. STUDENT ORGANIZATION UPDAT organizations for current academic year and roll call Approval of meeting agenda Approval of ES Registration status of student Student government election results and officer induction Budget allocation for student activities and events Compliance with student organization guidelines and policies Recognition of outstanding student organizations Ill. STUDENT DEVELOPMENT PROGRAMS A. Leadership Training and Formation Student leadership seminar schedule (November December 2024) Officer training for student organization executives Values formation and character deveiopment workshops Outreach and community service programs B. Cultural and Arts Programs University week celebration planning (February 2025) inter college cultural competition guidelines Student performing arts Groups support Art exhibits and talent showcase events C. Sports and Recreation Athletic program updates and training schedules inter universily sports competitions participation Intramural sports league organization Sports facilities maintenance and improvement +* Sports scholarship and financial assistance IV. STUDENT WELFARE AND SERVICES A. Counseling and Mental Health Expansion of counseling services and personnel Mental health awareness campaign planning Crisis intervention protecois and referral system Peer counseling program development Partnerships with mental health organizations B. Health and Medical Services University health center services and operating hours Health insurance coverage for students Medical emergency response procedures Health and weliness programs (nutrition, fitness, disease prevention) C. Financial Assistance Scholarship application process and requirements Student loan and emergency financial assistance Work study program opportunities Discount schemes and payment arrangements V. STUDENT CONDUCT AND DISCIPLINE Review of student handbook and code of conduct Disciplinary cases harassment policy implementation Drug free campus programs and interventions Student grievance mechanism and due process VI. RESIDENTIAL LIFE (DORMITORY MANAGEMENT) [ ormitory occupancy rates and room assignments Facilities maintenance and improvement needs Dormitory rules and regulations compliance Resident assistant program development Safety and security measures Vil. CAREER AND PLACEMENT SERVICES Career counseling and guidance programs Job fair and recruitment activities planning Resume writing and interview skills workshops Alumni mentoring program implementation industry linkages and internship placements VIL STUDENT FEEDBACK AND CONCERNS Results of student satisfaction surveys Student suggestions and recommendations e Town hall meeting with student leaders Response to student petitions and appeais IX. CAMPUS SAFETY AND SECURITY Security personne! deployment and training CCTV monitoring and campus surveillance Emergency preparedness and disaster response drills Traffic and parking management Student identification and access contro! X. BUDGET AND RESOURCES Student affairs budget utilization report Funding requests for programs and activities Revenue generation from student services XI. ANNOUNCEMENTS AND NEXT MEET ETING Upcoming events and important dates Next meeting: December 18, 2024, 2 00 PM, Student Center Conference Room and resolution procedures Anti bullying and"
    },
    {
        "image": "meetingagenda1_synth_9_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES College of Engineering Department Council STUDENT AFFAIRS COUNCIL MEETING AGENDA NO. 2024 034 DATE: January 09, 2026 FROM: Ms. Carmen Torres, Director I ROJECT: Student Welfare Enhancement F rogram and Campus Life improvement initiatives for Me Acaderr Hc Year 2024 2025 1. CALL TO ORDER AND PRELIMINARIES S° Welcome remarks and roll call Approval of meeting agenda Approval of Previous meeting minutes (October 28, 2024) Il. STUDENT ORGANIZATION UPDATES Registration status of student organizations for current academic year Student government election results and officer induction Budget all and events Compliance with student organization guidelines and policies Rec ident organizations i. STUDENT DEVELOPMENT PROGRAMS A. Leader Siudent leadership seminar schedule November December 2024) Offic Values formation and evelopment workshops ANS Programs University week celebration planniy Student performing arts QFOUPS support Art exhibits and tal Program updates anc training schedules inter ur organization Sports facilities maintena STUDENT WELFARE AND SERV] personnel Mental F counsel for student activities ocation outstanding st ognition of ship Training and Formation &F training for stude; Outreach and community se ng (February 2025) Inter eo nt organization executives character d rvice programs RB. Cultural and lege cultural compe evenis C. Sports and liversily sports competitions p Ace and improve tition guidelines ent showcase Recreation Athletic articipation intramural Spons league ment Sports scholarship and financial assistance NV. CES A. Counseling and Mental Health Expansion of lealth awareness campaign planning Crisis interven NG program development P University heal counseling services and ion protocols and referral system Peer i artnerships with mental nealth organizations B. Health and Medical Services and operating hours Health insurance Coverage for students * Health and wellness programs (nutrition, fitne Schoiarship application process 388, disease Prevention) C. Financial Assistance S and requirements Student loan and Program opportunities Discount schem G emergency financial assistance Work study Mes and payment atrangements Y. STUDENT CONDUCT AND DISCIPLINE Review of student handbook and code of conduct Disciplinary cases and resolution procedures harassment policy implementation Drug free can DUS Programs anc interventions Student due process Vi. RESIDENTIAL LIFE (DORMITORY MANAGEMENT) Dorrni assignments vement needs Dorm fety and security th center services Medical emergency response procedures Anti bullying an grevance mechanism and tory occupancy rates and room tory rules and regulations compliance Resident AND PLACEMENT SERVICES Career planning Resume writing and interview Skis mship placements VII. STUDENT Gent suggestions and recomme and appeals bx. CAMPUS SAFETY AND Facilities Maintenance and impro istant program development Sa Measures Vil. CAREER counseling and guidance Programs Job fair ang recruitment activities workshops Alumni mentoring program implementation Industry linkages and inte FEEDBACK AND CONCERNS Results of student Satisfaction Surveys Stu Town hall meeting with student igaders Response to Student petitions SECURITY Security personnel deployment and raining «coTy monitoring and CaMPUS Surveillance e Emergency Preparedness and disaster response drills Traffic and barking Management Student identific Xx. BUDGET AND RESOURCES Student affairs budget utilization report Funding requests for programs and activities Revenue generation from student Services X], ANNOUNCEMENTS AND NExT MEETING Upcoming évents and important dates Next meeting: December 18, 2024, 2 09 PM, Student Center Conference Room SS ndations ation and @CC8SS contro!"
    },
    {
        "image": "meetingagenda2_synth_11_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Scroo! RESEARCH COMMITEE AGENDA #202411 sasuary 94 2026 miondal 13 University Board Fo: AGENDA IMINARIES Ateacenes and quoi Adonts AOVAI. OF MINUTES (Gulober §, 7024) Mi DIRECTOR S REPORT Research owtouts (current academic yoar Facully pidhcation atahstics Exteel funding secured and pending Research conferance attandunce fy, RESEARCH GRANT APPLICATIONS 4. internat Grants (Diniversiy Funding) Facutty research proposals tor eva Student research supoari applications Rudgel sllacstion recommendations B External Grants COST POIERD (research In prioniy areas Industry snonaniad research mifatves vail: AOBAR font noceds for appreast Review ef numer subjects researc ARCH CONFERENCE fagenda i aP allaboratie BOARD Pending research 1 ampliance with ethical guidelines Vi RE tainabie Innovation\" Gal! for papers and abevacts +H hig ealictaton Commies astigninants and i lies Vit PUBLICATION SUPFORT afion assistonoe program guidelines Journal aricte processinys support» Book publication incenbu aclivides Vil, INTELLECTUAL, PROPERTY Fatent and consright applica “onovaton and incubation osntar ‘aecouninbitity aTY BUILDREE AT MEETING vers FoR eal sanference “Budget and HG RESEARC! uesis and modifications Tasninal reports and outpuls X, CAPAC anon Statistical analysis taining Grant welling seminars Kt. fl +» Progress eaports submissinn ings ants «Extension n Research mathoesiogy w December 40 2024 Next College Wide Meeting: ast Meeting: Morsay, Febriay 03, 2026, 14 20 AM Venue: University Beard Room"
    },
    {
        "image": "meetingagenda2_synth_11_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Graduate Schoat ROH COMMITTEE AGENDA #20244 4 sanuisy G4, 2026 Monday 33007 rensity Bones Foor AGENDA ELIMHARIES Aterstancs and quorum Adapton of agends 3. APPROWAL OF MINUTES OFES REPORT Research outs tor camtent academic yaar Faculty sublication sa sasod pret pending Research conference afienaarce IV. RESEARGH GRANT starna! Grants (University Funding) Faculty research propasals te evaluation Skater aynamh supannt applications Budgal alocaten recaramsnuations B. Exenial Grants DOST PCIRERD rmanaich penjects «HED resensrh in got arsas «Industy eposucrmd researc instatves ©, ieinatonal vaton «Partnership with ASEAN untae! sites Jointreaaarch prgects proposals ¥. ETHICS REVIEW renenrch grotacots for spprowat Rayrew of fiuman aakiects raseaich Anna? ics compliance wih eftical quidalines VL RESEARCH! CONFERENCE 2025 Conien «Gali fv papers and wbobarts Remote speates invitation Budgetand pasignmasts and reuponsitulises Vs PUBLICATION SUPPORT caton assistance prograe guidelines.» Joumat niicle processing support» Bouk publication incentives Research dimemination activiies VIL 9ITELLECTUAL PROPERTY «Patent and comsrigtd apascatinns Tecnneiagy banster onportenities Conmesciatizaton af search auiputs Innovation and weubabon center codiatue BCRITORING OF GHGOING RESEARCH Progress reports suleenkesion Financial 2 reports anet outputs X GAPADITY BUM OMG abwriing 86 7 MERTING. Paving commitae upitatas theme “ustainabte innovatia sponsarsnip solicitation Comics ce requirements Extaasion requests and modifications Fserinat Revegich matrodsiagy workshops Siaistical analysis training Gr er 0, 2084 Naxt Colieaa Wide Meeting: Next Mewting: Monday, February 05, ‘2026, 14 30 AM Venus: University Board Roun"
    },
    {
        "image": "meetingagenda2_synth_11_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Graduate Schoo! RESEARCH COMMITTEE AGENDA #2024 11 January 04, 2026 Monday 13 00 PM University Board Room AGENDA PRELIMINARIES Attendance and quorum Adoption of agenda Il. APPROVAL OF MINUTES (October 5, 2024) Il. DIRECTOR S REPORT Research outputs for current academic year Faculty publication statistics External funding secured and pending Research conference attendance IV. RESEARCH GRANT APPLICATIONS A. Internal Grants (University Funding) Faculty research proposals for evaluation Student ‘esearch support applications Budget allocation recommendations B. External Grants DOST PCIEERD research projects CHED research in priority areas Industry sponsored research initiatives C. Intemational Collaboration Partnership with ASEAN universities Joint research projects proposals V. ETHICS REVIEW BOARD Pending research protocols for approval Review of human subjects research Animal ethics ‘committee updates Compliance with ethical guidelines VI RESEARCH CONFERENCE 2025 Conference theme: “Sustainable Innovation” «Call for papers and abstracts Keynote speakers invitation Budget and ‘sponsorship solicitation Committee assignments and responsibilities VIl. PUBLICATION SUPPORT Publication assistance program guidelines Journal article processing support Book publication incentives Research dissemination activities Vil. INTELLECTUAL PROPERTY Patent and copyright applications ‘Technology transfer opportunities Commercialization of research outputs Innovation and incubation center Updates IX. MONITORING OF ONGOING RESEARCH Progress reports submission Financial accountability ‘equirements Extension requests and modifications Terminal reports and outputs X. CAPACITY BUILDING Research methodology workshops Statistical analysis training Grant writing seminars XI. NEXT MEETING: December 10 2024 Next College Wide Meeting: Next Meeting: Monday, February 03, 2026, 11 30 AM Venue: University Board Room"
    },
    {
        "image": "meetingagenda2_synth_11_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Graduate Schoo! RESEARCH COMMITTEE AGENDA #2024 11 January 04, 2026 Monday 13 00 PM. University Board Room AGENDA PRELIMINARIES Attendance and quorum “Adoption of agenda Il. APPROVAL OF MINUTES (October 5, 2024 IL DIRECTOR S REPORT Research ‘outputs for current. Extemal funding sec Faculty publication statistics ESEARCH GRANT osals for evaluation Student Grants DOST PCIEERD, ch initiatives C. Inter ing research protocols Committee updates Financial accountability CAPACITY BUILDING Research methodology worksho, PS Statistical analysis training December 10, 2024"
    },
    {
        "image": "meetingagenda2_synth_11_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Graduate Schoo! RESEARCH COMMITTEE AGENDA #2024 11 January 04, 2026 Monday 13 00 PM University Board Room AGENDA PRELIMINARIES Attendance and quorum Adoption of agenda Il, APPROVAL OF MINUTES (October 5, 2024) I. DIRECTOR S REPORT Research outputs for current academic year Faculty publication statistics External funding secured and pending Research conference attendance IV. RESEARCH GRANT APPLICATIONS A. Internal Grants (University Funding) Faculty research proposals for evaluation Student research support applications Budget allocation recommendations B. External Grants DOST PCIEERD research projects CHED research in priority areas Industry sponsored research initiatives C. International Collaboration Partnership with ASEAN universities Joint research projects proposals V. ETHICS REVIEW BOARD Pending research protocols for approval Review of human subjects research Animal ethics committee updates Compliance with ethical guidelines VI. RESEARCH CONFERENCE 2025 Conference theme: \"Sustainable Innovation” Call for papers and abstracts Keynote speakers invitation Budget and sponsorship solicitation Committee assignments and responsibilities Vil. PUBLICATION SUPPORT Publication assistance program guidelines Journal article processing support Book publication incentives Research dissemination activities Vill. INTELLECTUAL PROPERTY Patent and copyright applications Technology transfer opportunities Commercialization of research outputs Innovation and incubation center Updates IX. MONITORING OF ONGOING RESEARCH Progress reports submission Financial accountability requirements Extension requests and modifications Terminal reports and outputs X. CAPACITY BUILDING Research methodology workshops Statistical analysis training Grant writing seminars XI. NEXT MEETING: December 10 2024 Next College Wide Meeting: Next Meeting: Monday, February 03, 2026, 11 30 AM Venue: University Board Room"
    },
    {
        "image": "meetingagenda2_synth_12_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "DELA SALE UNIVERSI Ty Satege of Engin ing CURRICUL URE COMMIT TE e AGENDA #2026. 22 Newemberes, zoos Wesnestay 18 60 Pag University Board roo AGENDA PCAUL TO ORDER 9 PEPROWAL OF saiisre fSeetember 15, 99, REVISION 8, Bacteine Pa, ouraNS <BR By 248 CURRIOUL Las Rey 688 Adecisaton mae, OnE Pe igs ey AE ARGS \"ih fdsekatng Upeatag Marketing APRON ot ecnrrnseccy ann sma «RS Pee oa, Adehition st SUSHIRE Crgsrteaponal trace Sinica psychoiagy pracseum sideiines companes Thatology cose co i208 option o on 8, PIN «Raster op Smvrshonshve xg nd Anatytice Marite asseaesnany VIR Of GE tenn \"DRING Stuer «intmuration omninng outcomes aii 9g OLicomIBS «Pray HOt 28t canbery esi Sime Coro ina nenis Vi Hil Stands foe Gerd sytem ‘esming Vii ACAGERe: 98 Teqviremants F pattons «Academe toad inate Ber Remaster Siting ana Bansleting policies MS AND GEAGLINES x ADJOURN Next Coliege Wide Meeting: Fiext Meeting: Thasrsdtay, December Sa 2228, 15 90 ony Verne: University Beant Foner,"
    },
    {
        "image": "meetingagenda2_synth_12_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Engineetini AGENDA #202427 SuRRICULUM COMMITTE oversver 08 75 Wedeesday B08 PRA wersity Board 200! AGENDA 46 gazay tk CURRIC! oq Ussated aunon o! ok OF MINUTES eptern nasa Ageraniean marct m Nae pores and 58 ees APPROW! Jon of e054 psyctiois matieacie’ gy practicum gusaannes BS ouige tesion B Gradumte jon compa comprehensive 77% 2 cunsicu auigamen eh sy ryentory ¥. GEN ety ines Aderinisteation and not in Educational 5 Data Soance and 808) +95 aia S posal> agantation jcaltor yan PROP! Resource rea pichinue Review of E16 ehajopine Shadles E mapping ane asses sang Ove QuicoMes- sgmenticals RUbAES EDUCATION CUR! new GE etectives am yearning outcomes 258 fog Student portato 1626 it ONLINE AND FLEXIBLE LEA Be ora etveny Quety tanesarde SF OTE courses Learning st syste SACADEMIS POLICIES Preseauisie (> iraments yanstecting pawwies ‘shifung and sige pat semester stent Meoting: Thursday, Dec"
    },
    {
        "image": "meetingagenda2_synth_12_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY College of Engineering CURRICULUM COMMITTEE AGENDA #2024 22 November 05, 2025 Wednesday 16 00 PM University Board Room AGENDA CALL TO ORDER Il. APPROVAL OF MINUTES (September 15, 2024) Il CURRICULUM REVIEW AND REVISION A. Bachelor Programs BS Business Administration major in Marketing Updated marketing courses for digital era Integration of e commerce and social media BS Psychology Addition of Industrial Organizational track Clinical psychology practicum guidelines BS Biology Laboratory component enhancement Research methodology course revision B. Graduate Programs Master of, Business Administration Thesis and non thesis option comparison Comprehensive examination updates Master of Arts in Education Major in Educational Leadership proposal Alignment with K 12 curriculum IV. NEW PROGRAM PROPOSALS BS Data Science and Analytics Feasibility study presentation Market demand analysis Resource requirements assessment Faculty qualification inventory V. GENERAL EDUCATION CURRICULUM Review of GE leaming outcomes Proposed reduction from 36 to 30 units New GE electives in Philippine Studies Integration of 21st century skills VI. OUTCOMES BASED EDUCATION Program learning outcomes alignment Course mapping and assessment tools Rubrics development for major courses Student portfolio requirements VIl. ONLINE AND FLEXIBLE LEARNING Guidelines for hybrid course delivery Quality standards for online courses Learning management system training Assessment methods for remote learning VIll. ACADEMIC POLICIES Prerequisite requirements review Grading system clarifications Academic load limits per semester Shifting and transferring policies IX. ACTION ITEMS AND DEADLINES X. ADJOURNMENT Next College Wide Meeting: Next Meeting: Thursday, December 04, 2025, 15 30 PM Venue: University Board Room"
    },
    {
        "image": "meetingagenda2_synth_12_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "|. CALL TOORDER REVISION A. Bach 'elor Programs BS Business. Courses for digital era Integration of Industrial Organizational track Clin DE LA SALLE UNIVERSITY College of Engineering CURRICULUM COMMITTEE AGENDA #2024 22 November 05, 2025 Wednesday 16 00 PM University Board Room AGENDA ILAPPROVAL OF MINUTES (September 15, 2024) I CURRICULUM REVIEW AND ‘Administration major in Marketing Updated ‘marketing -commerce and social media BS Psychology Addition of ical Psychology practicum guidelines BS Biology Laboratory rch methodology course revision B. Grad luate Programs Master of Business Administration Thesis and non th Program learning outcomes alignment Next College Wide Mi eting: ‘Thursday, December (04, 2025, 15 30 PM Venue: University Board Room"
    },
    {
        "image": "meetingagenda2_synth_12_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Catlege of MMITTEE AGENDA #212422 CURRICULUM CO! November 08, Weanesvay sone Pie University Board Roam AGENDA wa ating {APPROVAL GF MINUTES (eptember 15, 2024) i, CURRICULUM Fi Easiness Administration major in Marketing Wncaies mcneree anit 30cia! media BS Paychology Adaition of 2408 BS ciniogisten oF Chinican psycholagy practicum guidatines BS Biclagy Laboratory 8, Grsauate Prageams Ma titi ia Cganizational ack tancement- Research hensive examinatic cpraparison 8 ignmant with S12 nalytics Feasthiity stusly presentazen Baris: Faculty qualification inventory V. GENERAL fase oF Proposed red lve Integration of 21st century sills Vi. OUTCOME rip peoposat 83 Date Soiens NEW PROGRAM FR demanis anaiysis 8 EOUCATION CURRICULUM New GE electives in Potppine EDUCATION Progam inaming outcomes alignirent ours meaning and assess Sjevalonmnent ior maror courses Student portiohlo receive cS nicatir ford eource da) ity standards for online courses uainng Asseesme 1 roview Grading sysiem: I ACTION ITEMS AND DEADLINES K. ADJOURHMENT requirements assessment AND Learning managements te Fe siting potioies Next Coilege Wide Meeting: day, Decsenber 04, 2025, 15 36 Ff Venue: University 8: Next Mectiog: T"
    },
    {
        "image": "meetingagenda2_synth_13_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS eal cauege AGENDA #2024 22 SURRICULUM COMMITTE! fipcommbat 93, thowsday eau PM jeeeeily Board Roar AGENDA APPIROHAL OF MINUTES (Sapte: jth CURRICULUM REVIEW AND rating Updated wearke5NO ag Business Sava major mM ‘and social media oS Psychology posers of Bioksay -Latnenaey coors fur digital ‘sack Chica paycrology avecHe mn quinelenns wea. Ceacuae Prengrarne Mester industis Ceganicatona! srmemeneccesnent Peeseate EOI coutse f re nasiresation Taste ON NEE ‘option compariaan Comorenonth gxgangnaen Upeeies sored Lendatehit BORA wera quricaiom BS bata Geence anc Reaves Foatealy gaudy presentation Martict esamant- Facuity qvaircation toeeaty GENERAL L CAL, FOUR! REVISION A Bachotor Prog act enn ~irtegenbor of e eDnenerea me mand anys Resse rerareran RHCMLUM Revien aE mamung oubomes Propesad fectibon Ft Te wis itis VI ETCOMES BASED EDUCATION CUR! New GE electives it EERAICATION Program iezming QUEENS sgevsionerent fos ‘eavastinns ior yd coee GobVsny Ce taining» Assecerent ethos f0 nok 12D vata i POLES Hore rgegwon Beare 10RE WH PT SOMES! Gracey syste tae ARID DEADLINES X, ACHOURNMENT sie Stucies tmvegnaan af 21k sen nts Cqurge sRApBING OF rermenis vt, ONLINE AND FL ins Cots 4 naneseenant teats RubTiCs EXDLE LEARNS penekoring pabeles We, ACTION STEMS. Next Colleae Wide Meating: 926, 12 00 Pid Yeu: Arivarsity Board oon Next Meeting: Monday, January 06,"
    },
    {
        "image": "meetingagenda2_synth_13_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "RSITY OF S, ANTO TOMA, CURRICULUM COMMITTEE AGI d Thursaay 1530 Pht University Board Reon AGENDA VAL OF MINLITES [eptember 15, 20 1 Programs BS 8 tegration of QCURRISULUM REVIEW AND pds! Paychology lactium guiclofines BS Biology La ‘on, Grariuate P: snl vith KA cb iuay present: sation invanlory ¥, CENE CATION CUR: OLICIES Prerequiste require ng tensioning Next Collene Wide Meating ny darwary xing: Mon 2"
    },
    {
        "image": "meetingagenda2_synth_13_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "SITY OF SANTO TOMAS UNIVE aucation GENDA #2004 22 ty Boarg Raum AGENDA (September g) QURAICUL OM REVIEIN AND renee atid asa iniegeation sizational rack 198 16 fe, Programs Mast yee exinat Businass Adminisvatinn sipesis opnOn compansen jonai Leadership Srop08a! lone and anantcs. Fea Faculty quatifeston jens assess™ attong otCor JN CURRICULUM Rev LUCA New GE elecuves maging ands es «Student od dojo requirements vil ONLINE AND FLEX we Learning Quatiy staewtars for oni £6 jaagnning Vi ACADEMIC on yb Gusdeunes fe methons (or rs rons Acagieone 19a Wenits any arte 5 x ADJOURN Next College Wide Mesting: y OR esa Ueiv plewting: Monsay. January 9"
    },
    {
        "image": "meetingagenda2_synth_13_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS ‘Cotege ct Education CURRICULUM COMMITTEE AGENDA 82024 22 Oecamber 03, 2025 1530 PH University Beard Roon AGENDA CALL TOOKDER 4. APPROVAL OF MINUTES (September 16, 2024) ®. CURRICULUM REVIEW AND REVISION 4. Bache Programs BS Business Administration major in Marketing Undated marketing ‘course for cig! ers Intugration of e cormaice and social magia BS Psychology Addon af industrial Organizational track Clinica! osyenelogy practiuum guidelines «BS fkuiegy Laboratory ‘component enhancement. Research methocoingy course revision B Graduate Programs Aigater of Business Administration Thesis and non tiesis option companson Comprenensive exanvnaton updates ‘Master 01 Ans in Education Mayor in Estucetona: Leadership propose! Alyinmet! at) K 12 carriculume Iv, NEV! PROGRAM PROPOSA S BS Dawa Science and Aneiyts Feasibtity study presentaton Matket ‘Semmind anatysis Resource requirements aseassneni Faculty qualiics on inveniory V. GENERAL EDUCATION CURRICULUM Review of GE earning oulccmes Proposed reduction trom 3h to 20 une» ew GE sioctves in Pritipping Studies «Integration of 7131 conury exits VL OUTCOMES BASED EDUCATION Program iouming ouicomas alignment Course mapping and assessment loots «Rubrics Geveionrant for major courses Stucant pordotio requirements Vi! ONLINE AND FLEXIBLE LEARNING ‘Geicetinas tor nyorid Course deitvary Quail standards for ontice cournes *Leannng management system ‘airing; Asseeuiment methods tot remote leneréng VI. ACADEANG POLICIES Prerequisite requirements Festa Grading system clarticavons Acedenvc toa limits pet semester Shifting and Wansternrg policies. 1 ACTION /TEMS AND OEADLINES X. ADJOURNMENT Next College Wide Meeting: Next Mesting: Moniiay, January 06, 2026, 12 09 Pkt Venue: University Board Room"
    },
    {
        "image": "meetingagenda2_synth_13_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS College of Education CURRICULUM COMMITTEE AGENDA #2024 22 December 03, 2025 Thursday 15 30 PM University Board Room BS Biology Laboratory luate Programs Master of 1g and assessment tools Rubrics LINE AND FLEXIBLE LEARNING Fe ee, Grading system clarfications Academic oad limits per ‘Semester Shifting and transferring policies \"ACTION ITEMS AND DEADLINES X. ADJOURNMENT Next College Wide Meeting: Next Meeting: Monday, January 06, 2026, 12 00 PM Venue: University Board Room"
    },
    {
        "image": "meetingagenda2_synth_14_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Catlege GENEA 2024) Hl. CURRICULUM APPROVAL OF MINUTES (Septemnper 4 .e35 Adm ation malar in comeane: ehhancement Adiainistiaton Major in E 5+ BS Data lysis Resuurve requirements assess CURRICULUM Now GF ipoine Studies aster of Ar NEW PROGR, ip HeOpOsal Alignment with K 12 eur bility sh tal fallen inventory GEN! demand at eouc ow of eamniag oulcames alignin ents Course mapping and assestmen! tuo! Rubric SRNING« ceyelopme) 1 s for entine o% AGADEM ig managemeni system waning Asgeasment met site requirements tons Arademic NES X, ADSOUR! Noxt Callege Wide Meeting: Next esting: Monday, December 02, 2028, 08 c 09 30 AM Venue: Cail"
    },
    {
        "image": "meetingagenda2_synth_14_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Cotege of Libera! Arts CURRICULUM COMMITTER AGENDA #2024 22 reovenber 10, 2025 Viednesaay 1400 PH Cohoga Dean s Cree AGENDA C CALL TOORDER H APPROVAL OF MAUTES (September 15, 2024). CURRICULUM REVIEW AND REVISION A Bacnetor Programs BS Business Adzrinisraton majerin arbatng Updates markabng courses ‘ot digital era dagratn of 6 cummance and son! media BS Peycholouy Aion ot ‘ndustial Orguntzational rack. Ciiokat peychiogy prechcum guidetnes BS Biology Laboratory component ennancemant- Reseaich maihedciogy course revision 8 Graduate Progra Maar cf Suamoss administration Tie and nov mwsts opdon comparison Comprehensive examination uPsaine ave of Ats in Eaucaton Major in Eaucatonat Leadersnip oroposal Alignment afth X 12 curmcuium New! PROGRAM PROPOSALS +85 Data Scionco and Anaiytes Faasiity study presentation Market ‘dommand enalysia Resource requrumenis asseatment Facuy cuaitcation inventory V. GENERAL EDUCATION CURRICULUM Reviee of GE leaming outzomes Proponed reduction For 36 30 unis ew GE etectves ln Phisppine Studies integration of 2 Yat conta ekits Vi OUTCOMES SASED EDUCATION Prageam inarwng cutconnes alignment “Course manping and aesessmwnt loss Rubs devaiopmentor major cournes Student portoio requlraments Vit ONLINE AND FLEXIELE LEARHING ‘Cadets for hybrid coue delivery» Quality standards for onfins courses -Leemany manacemer 975tm trang Assoterant matnods or sarnote looming VIR. ACADEMIC POLICIES Preseauritererirensents fever” Grading sytem ciaricadune AcaGanKc 109d Bits per secrestar« Stifing end Fanseiring pobcies 1%. ACTION ITEMS AND DEADLINES X. ADJOURNMENT Next College Wide Meeting: Next Meeting: Monday, December 02, 2025, 05 30 AM Venue: Caltege Deen s Office"
    },
    {
        "image": "meetingagenda2_synth_14_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SAN cotege of Lue ATS RICULUM COMMITTEE AGENDAS CURRICUL Weenesda sane gig Oe college Os AGENDA srber 15, 20240 8 _xbon malar sn arkating ag Peyehaiogy Arties CIR RIGULUM REVIEW AND ~ypaatee rrarketing OF MINUTES (See! asiness HCN social media quidelingr “58 ve revising 8. Graduate Prosar pensive examination gh 12 curriouium presentation Market FOORDER I APPROVAL stor Pragrams BE ameggration f e ooinmerce 38 rack. Diinical peyenoieay oF geseasen melnadoiogy £9! ea noneteess option comparizor:- COMP signet 1AM REVISION A Ba? poursas tor digital corganizaioni ceompenent ents Business Aamuinistration ipcates tontar of rts in Eoucation Wah NEN PROGRAM PROPOSALS alysis Resource 3) CURRICULUM Revie hip proposal eapieily Sly jiacrton invantory 6 reduc fro 26 to 39 Hie tae SBASEL wot Je jntagration Gf Sst cee ig outeo! ‘pizslent portono rexplrernents vdgrds far 09% ONLINE AND FLEXIELE LEARING* mmanagereen syste igo vequirsime sterning psticies ayeiopinent for snes for nytt COUT! ality 8 rermety saarring Vit. ACADEN agademnic 12s fist g AEIOURNMENT Prereauts shiting and a se ele seessinant meinen xem cianifcation: DEADLIN Next Goltleae Wide Meating: G30 Axe Venue: Cellege 02, 2625, 09 Dean s Office Next Metin"
    },
    {
        "image": "meetingagenda2_synth_14_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Cotege of taberal ANE SMRICULUM COMMITTEE AC (WDA, #2024 72 eK LUE EWEN ABD Nembst rustration Mee ORDER RPP i PUSAN IRS ys ara -wotngrataan of anganonat Chinwcal Dyer: rathoroen 1 Marte payer age practicum guawins 1S BS ca cenauate Pre ampranac ive 2! eect RAT wT fo Make Ai. ALL TO. nn Hastert ot ranstion 223803 dusting companient pusiness Aatenistiaien ntasier ot Ar EQUTAM SEW PROGRAM PROF siancamant «Resear wise paayor th ES scar 2 tev es Data Since ane Faiyace Fes mre qumimcarsn enventoy SE amants asseswurantF posed fedtcinis tons 76 70 Jeon Comsat nai Lenaersiy COpOSH A! poopentabes 5 Resputce \"se\" cana OEATION CURRICULUM Ramee 1 OF e205 aromas Pr veo Sruaien skagegiatn c2 27s ceritany Sus SuTCONES BASED ard assessment FLENSLE LEARKICNG se map! Raw GE arom ees i aTeRt Prat couves BANTTRTE OM OnE AND et ie caiagenent torr aye cores uGAns ITI ements vecetmien fo eg course seers Au Ae darts to one CORRES LES! naniagerant aye” te egg vi) AGATIENNG FOLIGIES F088 wits ranuirement ‘pouting aia warehest “POMS tavnang- Aneesament net samest wits y+ azadamic ia g avsten tentics ADJOURNMENT evi xa th ACTING TE Next Colleqn Wide Moeting: say December 2, ih, 94 Aer Cohege"
    },
    {
        "image": "meetingagenda2_synth_14_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "Next Metting: Moeday, UNIVERSITY OF SANTO TOMAS College of Liverat arts CURRICULUM. COMMITTEE AGENDA 2024 22 Novemder 10, 2025 Wednestay 14 00PM College Dean s Ortce Next Cotlege Wide Meet) H Decamber 02, 2025, (0930 AM Venue: Colage Dean s OFcs"
    },
    {
        "image": "meetingagenda2_synth_15_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA Goltege of Science ACADEMIC COUNCIL AG! cember $0, 2026, Wecnosda: 28 00 AM versity Board Room, AGENDA projections Hon status af programs TY. ACADEMIG PROGRANES AND i Gf unwversity gracing aystor rege HULUW! MATTERS Approval of naw courses across eallegue Program revision a} education cunteutun peat ss euistration peticies with partner schoots Vi FACULTY DEVELOPMENT Sonclarsniy grants for graduale studies Facutty exchange ergram ment bintget allocator pnd financlat 2id updates Student SEARCH AND INNOVATION ‘Complises with CHED stansianga Quaity improvemtont intiatie POLES Proposed academic calendar ter AY 292 implementation af feasible learning eriey petlions V. OURR: prCRAg lS Gon coliny Grade appeate and stadent fh Services expansion Scnotars ot Career deveisoment progrants Wit upper! services asse: Sasearch ayenca osurities Funding apparunises and grants University reseaich journal slave Resnarch ethics training sequiremen 2 LINKAGES MOAs with inte iwersites ‘iustry collaborailen programs Conwpunily extension init ELISGEYARY MATTERS Arasiomie busiget uillizabon rep: MATTERS Xi ADJOURNNENT $03. Bums engages’ sisiies &, Kucaing requests tam colleges Xt OTHER, Next College Wids Meeting: Next Mesting: Monday, January 12, 2026, 12 00 PM"
    },
    {
        "image": "meetingagenda2_synth_15_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DEN ANILA UNIVERSITY A CABEMIC COUNGIL AGENDA 4202419 Decamber 09 2025 Universi AGENDA OPENING REMARKS CONFIRMATION nyoeator and nations! anthent Welcome address by the Vice C mbat 26, 2024) Ml, REPGRTS A. Vice Gh scully coraplement and hiring updates Acadian uation Or Tar A summary gistrar Student 1 program pert nagement undat and erojechans improvesnent er for AY 20 ation policies with ACULTY DEVELOPMENT Scholarship urani ‘acuity -xcellence award ‘opportunities STUDENT WELF support sor development suaget alloc on Schojarship an RESEARS! ital Health aid updates «SI AND INNCVATION Rest ethics taining 7 istry catia TARY MATTERS Acader MATTERS <li ADJOURNMENT Next Collene Wide Meeting 12, 2026, 13 00 PM Venue. Uaiver Monday, tant ict Room"
    },
    {
        "image": "meetingagenda2_synth_15_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY cocege of Science CADEMIC COUNCHL AGENDA #2024 19 Ceramber 99 2006 Heanasir OR OO AM tucwesteity Boars ROOF AGENDA 1 OF ENING REMARKS invocation a6 NSN recone wasr08 ye eed CHANEY 8 CONFIRMATION OF MIUTES (8 7024} he REPORTSA vion Chancetes 1 Acanenec ABAES Semester encoimens sucrmany Facute complement sind hing uraates ACACE TE program pertanence res B Universe ROGETAL SUSE vmaragament ides Craduatan Hatsts ang orayerdone Cresentat evaruabon proceaises ONES tee Guaity Asauemince Accredeanon SSS at progres TED aaancasds «Cay mrevaeDeTE RSE YEE Ty ACADEMIC PROARAMS AND BOLiCkS Progaset 20 wae 2035 2026 Revisen of UNE IAT sen eapigmaniatin of tance toaitanyg DOREY acoder ona) ane wrlegry DOHC AG appeats and STuDe pertans V CURRICULUM MATTERS ‘apnea’ of row courses BUUB8 cORETES* Program revise propose Gomnata’ educaieo Cun pe anes Cross cagesranon NOHees we gearter 00 S Vi FACULTY DEVELOMMENT Seroiarsrie 08\" wy tor graduate sauces “Facets axchaoe program opeatunsnens Te Ecng CHEMIE ppd exena Pretaassnal GoveKeOINeTL pudgat etecavon STUDENT WELFARE Menta! nest meres expereson SCR aIaIITID aNd FMA a6 upcates puoport ersten agsesarennt: Cao vreceiogenant programs vid RESEARCT AtiD RNOVATION Rove arch aqencia prunes *FUreS pontine 27a grant U2 esearen jours etabes RABAT tries tranung requirements Ot PARNER SAN? AND UHKAGES ORS aath snvermapons! UBT siDeS Meaney ZOADOHANCN BFF COMMAS esranasch inibateen Aun engagement genewes BUDGETARY MATIERS Acagarne Tse bebo capes Funny eueste trom cotleges Xt OTHER BATTERS XX AD JOSHNMENT sauder Next Coliege Wide Meeting: Board Room COM Vorue Usiverety"
    },
    {
        "image": "meetingagenda2_synth_15_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "ATEN! O DE MANILA UNIVERSITY College ef Science ACADEMIC TOUP FENDA #2024~ AGENDA university 6 {CULUM MATTERS Aporo iy andl Integrity paticy with partner iy exchang sem beget a copper NTY euipporl serie <i finenciat AOS rors industry coltaboration pesgrams TIERS Ac |QURNMEN ETARY M “emie Next College Wide Meeting ary 12, 2028, 13 06 PM Venue: Univ (Fone"
    },
    {
        "image": "meetingagenda2_synth_15_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY College of Science ACADEMIC COUNCIL AGENDA #2024 19 December 09, 2025 Wednesday 08 00 AM University Board Room AGENDA OPENING REMARKS Invocation and national anthem Welcome address by the Vice Chancellor I CONFIRMATION OF MINUTES (September 25, 2024) I REPORTS A. Vice Chancellor for Academic Affairs ‘Semester enrollment summary Faculty complement and hiring updates Academic program performance metrics B. University Registrar Student records management updates Graduation statistics and projections Credential evaluation procedures C. Director for Quality Assurance Accreditation status of programs Compliance with CHED standards Quality improvement initiatives IV. ACADEMIC PROGRAMS AND POLICIES Proposed academic calendar for AY 2025 2026 Revision of university grading system Implementation of flexible learning policy Academic honesty and integrity policy Grade appeals and student petitions V, CURRICULUM MATTERS Approval of new courses across colleges Program revision proposals General education curriculum updates Cross registration policies with partner schools VI FACULTY DEVELOPMENT Scholarship grants for graduate studies Faculty exchange program opportunities Teaching excellence awards criteria Professional development budget allocation VIL STUDENT WELFARE Mental health services expansion Scholarship and financial aid updates Student ‘support services assessment Career development programs Vill, RESEARCH AND INNOVATION Research agenda priorities Funding opportunities and grants University research journal status Research ‘ethics training requirements IX. PARTNERSHIPS AND LINKAGES MOAs with international universities Industry collaboration programs Community extension initiatives Alumni engagement activities X. BUDGETARY MATTERS Academic budget utlization report Funding requests from colleges XI. OTHER MATTERS Xil. ADJOURNMENT Next College Wide Meeting: Next Meeting: Monday, January 12, 2026, 13: 00 PM Venue: University Board Room"
    },
    {
        "image": "meetingagenda2_synth_16_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY College of Education ACADEMIC COUNCIL AGENDA #2024 19 December 25, 2025 ‘Thursday 1630 PM ‘Agmnavaton Buking, Conference OPENING REMARKS Invocation and CONFIRMATION OF MINUTES (September 25, 2024) li Industry collaboration programs BUDGETARY MATTERS Academic MATTERS Xil. ADJOURNMENT AGENDA ‘national anthem Welcome address by the Vice Chancellor I REPORTS A. Vice Chancellor for Academic Affairs udget utlizaion report Funding requests from colleges XI. OTHER Next College Wide Meeting: Next Meeting: Friday, January 21, Conference Hall 2026, 13 00 PM Venue: Administration Building,"
    },
    {
        "image": "meetingagenda2_synth_16_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY: College of Education ACADEMIC COUNCIL AGENDA #2024 19 December 25, 2025 Thursday 16 30 PM ‘Administration Bulking, Conference AGENDA OPENING REMARKS Invocation and national anthem Welcome address by the Vice Chancellor I CONFIRMATION OF MINUTES (September 25, 2024) II REPORTS A. Vice Chancellor for Academic Affairs ‘Semester enrollment summary Faculty complement and hiring updates Academic program performance metrics B. University Registrar Student records management updates Graduation statistics and projections Credential evaluation procedures C. Director for Quality Assurance Accreditation status of programs Compliance with CHED standards Quality improvement initiatives IV. ACADEMIC PROGRAMS AND POLICIES Proposed academic calendar for AY 2025 2026 Revision of university grading system Implementation of fexible learning policy Academic honesty and integrity policy Grade appeals and student petitions V. CURRICULUM MATTERS Approval of new courses across colleges Program revision proposals General education curriculum updates Cross registration policies with partner schools VI FACULTY DEVELOPMENT Scholarship grants for graduate studies Faculty exchange program opportunities Teaching excellence awards criteria Professional development budget allocation VIL STUDENT WELFARE Mental health services expansion Scholarship and financial aid updates Student ‘support services assessment Career development programs Vill. RESEARCH AND INNOVATION Research agenda priorities Funding opportunities and grants University research journal status Research ethics training requirements IX. PARTNERSHIPS AND LINKAGES MOAs with international universities Industry collaboration programs Community extension initiatives Alumni engagement activities X. BUDGETARY MATTERS Academic budget utlization report Funding requests from colleges XI. OTHER MATTERS Xl. ADJOURNMENT Next College Wide Meeting: Next Meeting: Friday, January 21, 2026, 13 00 PM Venue: Administration Building, Conference Hall"
    },
    {
        "image": "meetingagenda2_synth_16_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY College of Etucation ACADEMIC COUNCIL AGENDA #2024 19 Gecmnonr 25 2025 Thursday 1636 Pat Aamrateton Besding, Centerence AGENDA LOPENING REMARAS Invocston and nations! anthem Welcome adicvess by the Vice Chancellor CONFIRMATION OF MINLITES (September 26, 2024) it. REPORTS A. Vice Chiencetior tor Academic Atairs Credential evatuation procedures C. Director for Quaity Assurance Anccestitation status of programs» Compliance with CHED standards Quatity imeravementiniBatves WV ACADENIC PROGRALS ANU POLICIES Propcesd academic catonda: for AY 2025 202 Ravision of university grading system nplementztion of feicbie teaming policy Academic honesty and intagnly policy Grade appeals and ctudant patitions V. CURRICULUM MATTERS Apcroval of new courses actoss cottages Program revision Proposals Generel education cutnculum updetes Cross registaton poticias with partner schoois Vi. FACULTY DEVELOPMENT Schotarship granis tor graguale siudive »Fecuity exchange program: opportunities Teaching eaceilance awards critnra Professional development nycp9t allocation: Vil STUDENT WELFARE Manta! neaith services expansion Schotareivp and financial aid updates Stxtent ‘Suppor Services assesment Career development programs VIE. RESEARCH AND RINOVATION Rasvarch agenda peianmes Funding opportunites and grants University research journal statis Research ‘ethics training requitemonts IX, PARTRERSHIPS AND LINKAGES MOAS with (etematonal universities industry coPsboraton programas Commun mxtensicn initatves Alumni engazement actaties X. BUDGETARY MATTERS Acasemic budget ubitzaton reo21t- Funding requasts trom cokeges Xi OTHER, MATTERS AIL ADJOURNMENT Next College Wide Meeting: Hert Musting: Friday, January 21, 2026, 13 00 PM Venue: Adminisirstion Building, Conterence Hail"
    },
    {
        "image": "meetingagenda2_synth_16_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY College of Education ACADEMIC COUNCIL AGENDA, #2024 19 December 25, 2025 Thursday 16 30 PM Administration Bulling. Conference AGENDA ation and national anthem CONFIRMATION OF MINUTES (September 25, 2024) Ri Semester enrollment summary Faculty complement and hi metrics B. University Registrar Student records managem Credential evaluation procedur Compliance with CHED standards POLICIES Proposed academic cal ippeals and student Program revision Partner schools VI Faculty exchange program ‘ofessional development budget allocation Vil ‘Scholarship and financial aid updates nt» Career development programs Vill RESEARCH AND INNOVATION Research agenda priontes Funding opportunites and grants University research journal status ties taining requirements X. PARTNERSHIPS aN LINKAGES MOAs with international univers Industry collaboration programs Community “xtension inilabves Alumni engagement actvites x BUDGETARY MATTERS Academic budget Lbzation report Funding requests tom colleges x1 OTHER Proposals General education cui FACULTY DEVELOPMENT Sch opportunities Courses actoss colleges iculum updates Cross registration policies with “Pi Student Research ities MATTERS XIl. ADJOURNMENT Next College Wide Meeting: Next Meeting: Friday, January 21. 2026 13 00 PM Venue: Administration Building, Conference Hall"
    },
    {
        "image": "meetingagenda2_synth_16_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY College of Education ACADEMIC COUNCIL AGENDA +#2024 19 December 25, 2025 ‘Thursday 16 30 PM ‘Administration Buiing. Conference AGENDA tional anthem Welcome address b) 25 2024). REPORTS A. Viee Chancellor for Academie Affairs ining updates Academic program performance OPENING REMARKS Invocation and nat y the Vice Chancellor Il CONFIRMATION OF MINUTES (September Semester enrollment summary Faculty complement and hi metrics B. University Registrar Student records management updates Graduation statistics and projections Credential evaluation procedures C. Director for Quality ‘assurance Accreditation status of programs Compliance with CHED standards Quality improvement initiatives IV. ACADEMIC PROGRAMS AND POLICIES Proposed academic calendar for AY 2025 2026 Revision of university rading system Implementation of exible learning policy Academe onesty and integrity policy Grade appeals and student petiions V. CURRICULUM MATTERS approval of new courses across colleges Progra) revision proposals General education curiculum updales cross tegistration policies with partner schools Vi FACULTY DEVELOPMENT Scholarship grants fro late studies Faculty exchange program opportunities Teaching excellence awards crea professional development budget allocation VI. STUDENT WELFARE Mental health services expansion Scholarship and financial aid updates Student support services assessment» Career ‘development programs VII. RESEARCH AND INNOVATION Research agenda priorites Funding opportunites ‘and grants University research journal status Research Shee training requirements IX. PARTNERSHIPS AND LINKAGES MOAS with international universities Tndustry collaboration programs Community extension initiatives Alumni engagement activities X BUDGETARY MATTERS Academic budget uilization report» Funding requests from colleges X! OTHER MATTERS Xil ADJOURNMENT radu Next College Wide Meeting: Next Meeting: Friday, January 21, 2026, 13 00 PM Venue: Admini Conference Hall stration Building,"
    },
    {
        "image": "meetingagenda2_synth_17_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHMID UNIVERS: ITY OF THE PHILIPPINES Cotege of Areniinctire TY MEETING AGENDA #202493 AGENDA Rel cal of facuny mamicere «Vacate 5 euteS of prewiows meeting (ciober fy 224304 CEMENTS CHED Siemorandtum on ner 8 combes 2024) Pac SUDmIBKION OF sat! and mou seemE HEF enratmT! ECSU TOOROER AND ATiennay BAD APEROVAL 95 OF wore I 88 Materials ty Curren, iC alttes Anaizsis of progesin bens ge Statees etna 8. Cureuirn Rovisy Pumas teyisione t 89 Ging ed TORENS «He asective ese tp BBG megrat z University Netware stensaras Assnsement of Buiter saming Outoonien +A, atteinenant Se SFOBOUS SameRIee «Acton pans foy provement amas y PeqUreeDS sna Ceadtiines Ele RESEARCH ant ExTENEiar, S88 BOON aTe pepesats fo connontym wiaueniany Shs Vi FACULTY REVEL OpAEE i «cw Sn pedagagicst inasaéons ‘ocang om 1S Reeseren auataat Pubiieaton uae udies cefialarshig Nd Saeulty researey Pores Taning Comersncs partopsation, ang papas RresEntstons yy, T CONCERNS «Acca Sing Schedules Stedait feedtuscx gn ‘ecching oftectvoneta «Peer Fetns0ing rogrsie impiomantatg TRATVE MATTERS Biztgot nt Seit08 Scuiprent erat fects vy RIOMANCE Rens Citic Honig BUSINESS Open Sut top {BeLkty concerns x Ag sCURtRMEeeT Rext College Wide Meeting: Net Rating Westnesisay, Saswacy 19 2028, 12 00 py M Wense: Lkesee Conternce Roam"
    },
    {
        "image": "meetingagenda2_synth_17_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Cofege of Architecture 2024 08 FACULTY MEETING AGENDA December 24 2025 day 7200 PH Library Comferenos Rom AGENDA yaritication of stat «batters arising rom HE Rol malt of facutty nesses bing (Orbe 12, 201 [GALL TG ORDER AND ATTENDANE AND APPRONA, OF MINUTES Manutss of previous vrirtes Sf ANUAGUNCEMENTS CHED Mannoranaat OF canticuiume updates Upasning ver Zona} Fac evelopment somenat a” OBE ‘nplementation Ipgate Cuvee eure ews cetodiiabon visit eeceents jae mateials W_ACADERIG PROGRABS A Entolinon arvastar anvellmerit statistics» Afahysis er evoce eauraen Bor arava sriegeasot 1A ate sutmassion of ovat ano ofomagram tends and sudantcebanton 8, Cure enposeet revisions te BE Engineering PMI ty Hotcork standadds ©, Assazsment as eamang Oulcomen Review of CLO atalren On Repaateh ue jen. ‘unrest gre nous sexnester Acton plans Rit ingeawement areas RE: recquironants are readline “Extension BOR prepasens fr community enagameit PUOKTOF cpcontves and iacultyresach grants Vi, FACULTY je sageheT Ceacuata studies arsenate onpartiniten Training om pedagog innees® torenne partivpatan ane baer presanaians Vi DENT CONCERNS Academie ouvising schecuies ‘sardont ingdback o1 wacnins eHecivenest PEt iii MATTERS Busger aiacanan for deparenact svimplemenistion YE ADB «ane cansuttation senetuten 0 mentoring (4% ‘cit Scuipmnent ane tactitas msiOiene SUSINESS Open fun forsee soneams ADI stext Cotiege Wide Heeting: sasmey 18, 2026. 4200 PM Yenrs- Library Conference Reom Mart Baeting: Wedroacy."
    },
    {
        "image": "meetingagenda2_synth_17_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES College of Architecture NDA #20741) ACULTY MEETING AGI i 24, 2025 1405 9M Litrary Conference Fe AGENDA LCALLTOORO! AND APPROVAL ABHOR visil Pecemb: call of feculty members Verification of ouorumn READING of previous meeting (Ocmher -CHED Memoranduss on curtinats Fapuity deve nina on OBE inipien WV, ACADEMIC PROGRAMS A Eniatlme senieaiay ecrttment statisics Analysis of pragram trends and student retention 6. Guriculum: Roview Proccsad revisions to £8 Engine jective courses for approval ration of University Network stands samant of Student Loatrlag Outoomes Review of CLO atisinmentior previous semester «Acti ntarees V RESEARCH AND EXTENSION Research output on ine opiates Liocomings PAASCU. CAs 9 for improve cororunities Haining on ped ONCER paper prozenistions Vil caching affectivenses Pe mamtoring program implementaion Vis ADR IVE MATTERS Guduel aliccation for department hand waintenance needs Ott COMER ‘Open forutn for fecuity concerns X. AQJOURNMENT NS Academia e 8 ana consuttation schastules Next Gollege Witie Meatine: nesday, January 18, 2076, 12 00 PM Yi Next Mounting: We nut: Libary Confesanice Room"
    },
    {
        "image": "meetingagenda2_synth_17_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "“OLYTECHNIC UNIVERSITY OF THE PHILIPPINES of Architecture FACULTY MEETING a AGENDA LCSLL TOORDER anp 4 FENDANCE eQH AND APPROVAL OF seuiTES minutes Ml ANNOUNCEMENTS Acsraditation vsti (Decem Subteission of tof culty ances #26 Ci previous ‘napting \"CU On curr fetopinent te We ACADERH uforogiam tre *Veiitestion of quoruy (Cribs: 16, 202 ters arising trom ng PARSE 9? ORE inigiementaaign RAMS A. Bre Svilab: and cours Setiesisr erioliment statistics «a, 90 Printz *Reminger on tment Upiate Current Ras B74 Stideoi rstonton. 8. Cuniculam wiew S29 revisions to BS Engmagnng PN New elective courves fr aproy, University Network slandards 6, Agge seMenL Of Stun at Leaning improverentareas V. Rese “ivoration cage Danek Revish Of. attainment fo) Bravisua seme ARCH AND EXTENSICH «Roses URNS Grsiageme t+ Publica ENT Graguay Action: plans to IS AN deadtines S hueully research tunities Training on geaiay Foren y dies schotarsiin Sosical wnovEtKis Contenders Participation sna pacar i! NT CONCERNS Acadamic schigin 8 Sched tints ont Feedba on fe, ena ATIVE May TE: 8 Maintenance noes: ET Yor acuty aORiNG effect Vil. ADIs Huawet aioe: hours an HEN tiveness Pag, hae fOr aeparimns Nsuitation ected, Off Next ColiegeWige Meeting: osdiy, Jarenry 18, 2036 42 09 PA Venue: Library Neat Mosting, Wed"
    },
    {
        "image": "meetingagenda2_synth_17_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY O PHILIPPINES syehitectur NDA $2924 03, Friday 4400 Lpiaty Conference Rem AGENDA LGALLTOORDER AND A AND AFPROVAL OF MIN nutes ill ANSGUNCEM vation vi fon of eyed jon ef quctum HR y+ Motters ani wn Reviaw ASI penta Side) sie( Action plans for isnprovement a aas V, RESE jeadiines & SPOH AND EXTENSION Re for community engag io statics ‘atid paper prasantations Vi k on teaching “Budget ‘on for éeparte eo X OTHER ahd consuitation schecul Next Coltega Wide Meeting: ry, January 18, 2026, 12 00 PM Venu -@ Reem Noxt Meating: Wee! Library Conier"
    },
    {
        "image": "meetingagenda2_synth_18_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY Schoo! of OMICS FACULTY MEETING AGE IDA #202408 Decomper a8, 2628 Monday 1200 PM University Boars Room AGENDA call of faculty marsibars Veritcatinn vious meeting (clover £0, 2 Hof guReUE HY READING 14) Matters atising bom the tovlure aptates Upcoming PAASCL ‘Obit Nomina! on ORE implementation Ramender an WV. ACADEMIC PROGRAMS Enrollment Sherine sts Saalysn of pogram: ends ana sudant tention B Suuricutues Review POSSE revisions ty BS Engineering programs New elecdee courves to SuprOVE! «integration of ASEAN M89 C. Assessment o* Sagaat teaming Outcomes Reviow of LO athinment for Pcb00 plans for imorovemaet areas V RESEARCH ANS EXTENSION Recearen outpot Mauiraments sn deadtnas Extension crogram pie gegement- Publicanon incentees ang tacuiy research grants ate studies schelaesiug onparkevties Training on pedagagica! in ‘anketence gartcipaticn ant STUDENT CONCERNS As Student feeaas Mentoring props mplemeniatan Vii, ADMINISTRATIVE a activibes Eguipmant anc ta BUSINESS Opa praise 6 reditaton visit ef syttabt ana course mavatict Update Curent somes ally Network skenoge Brevious semester \"sais foe narnemuniy e ACULTY SEVELOBMENT crac: Bevations Ce Comic advising aches ape presentation aching electivensss «Py ATTERS Budge ationation for agnarteent Ss Of se hours an censultaton schedules i OTHER fern tee faculty concerns X, ADJOURNMENT bance Next College Wide Meeting: Next Masting: Monday, January 02 2026. 45 39 ang Venue. Univ ty Board Room"
    },
    {
        "image": "meetingagenda2_synth_18_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY oot of Economics MDA #2024 08 130 PM University Board Reon AGENDA ication oF quorum READING piatlers arising from t PARSCU ayy Reeenindter om NDANOE Roll cai offeculty mamners Wert wos migeling (Getaber 0, 2028) aco 5 impiemera’ [CALL TOORDER AND ATT auinutes of pte CHED Kacurandurn or currieian Faculty development semanar on OF WW ACADEMIC PROGRAMS 4. ciate CUMS enrollment atatisics Anatysis of program wend roigndion 8. Curneutumn Reviaw arramn ots Enguieesing progrant «Fis gloclve courses for 3PRFO E vintegiavan of ASEAN naarus ©, Assessment of Stagant Leaming Cusleames Hew of CLO atainment OF 1s (or provement ares Extensign peogram mean: sig Vi, FAGLILTY DEVELOP “at innowaticnit Conarence particine 145+ Avasiemic aawising seed! 1 Suadent frednack on teachis iotnentabin vith ADMIVISTRAVE MATEERS Buttget 35572 iaintanance needs *Cttoe nous and consutiaticn schedules x. 01 f AOURNMENT 5 ii, ANNOUNCEMENT December 2 subnussier sem Prenosed Fe LUnevarsty Netwerk sta previous semuster Action Bl nig and awadines for corrmnsty €P980 caste Suis sobistsetp sane musentabons VEL sive ate tact esearch raining of pedeaos fle sg progearn i activities Equinerent pan fone for tacuity cl Next Galiege Wile Meeting: 03, 2026, 11 50 AM Venus: University Bes Row Nxt Meating: Monday, Jant"
    },
    {
        "image": "meetingagenda2_synth_18_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY ‘Schoo of Economics FACULTY MEETING AGENDA #202408 December 06, 2025 Monday 1200 PM nwversity Board Room AGENDA LGALL TO ORDER AND ATTENDANCE Rol call ot faculty members Verifcabon of quorum i, READING AND APPROVAL OF MINUTES Minutes of previous ineatng (October 19, 2624} MuBers arising from the minutes 1. ANNOUNCEMENTS CHEO Memorandum an cutnicuium updates Upenming PAASCU acereddaton weit (December 2024) Facuity development sarainay on OSE implementation Reminder on ‘subnussion of syabt and course materials V. ACADEMIC PROGRAMS A Enrollment Update Curent ‘semestar enrutinent etabstce Analysis of program tends and student retenton 8. Cumcutum Raview Propased revisions to BS Enginsering mograins New elective Courses fr approval integration of ASEAN University Hetworr standards ©. ascassment of Student Leaming Quicomes Revie of CLO attainment ior preidcus sementnr Anion plans tor improvement areas V. RESEARCH AND EXTENSION Research output requirements and deadiines Eaenwin progam propusais tor community engagoment Publicabor incentives and faculty researcn gran s Vi. FACULTY DEVELOPMENT Graduate studies schoiarshia Leppartunities Training on pedagogical innovator Conference pactiopaton ano paper presentations Vi. STUDENT CONCERNS Academic advising schedules Stident leadback on teaching efiecovenes Peer mentoring program implementation Vii, ADMINISTRATIVE MATTERS Budget alfocation for dopariment ‘activites Equipinant ang factiaes mainienance needs Offios hours and Consuttaton schedules IX. OTHER, BUSINESS Oper forum for faculty concems X. ADJOURNMENT Next College Wide Meeting: Next Meating: Monday, January 03, 2020, 11 20 AM Venue: University Board Reorn"
    },
    {
        "image": "meetingagenda2_synth_18_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA Salis UNIVERSITy Schoo! of Economies FACULTY MEETING Ac December 98, 2625 Monday Rao pe University Board Room AGENDA {GALL TO ORDER AND ATTENDANCE Rot AND APPROVAL OF aint ‘minus Hh ANNOUNCE REN TE Scerediation vst Oscomber OF Recity members Vesttcason og er aa, Raw meNENg (eines 40, 2o3e4 “SHED Memorsaum on cumasiem wp 8 2024). Fecuty develoumant ssntnas gn OBE imp ar on Subeisiten Of stab ape course reaterate BY ASAEARG PROGRAMS A. Enrolment Upsiate Currant ERnASr eoraiinent aoites «Ansiyce oT orogtam Pris ane abudact anton Cuttouiusn Review Proposed mvisicns SS Enpinesing orograme «Mei elecme Sofons fr Sopseve!« niegestn of aN siversite Network suandanie AStensmentof Seidert teaming ica“ Resieas of S 6 atainenant ne Srevious Sammester «Acton signs tap ovement teas Y RESE AR atury EXTENSION escarcd eutoys ISdOFEIENS 3008 deoatines EManisien $rOt 8\" Rian or commun engaome He Pubkestion PMBS BM fac BVI FACULTY DEVEL caseny Crate states chabert SBoerhinites -Trsing on pecagsgieas sea ltlins -Coniecence psstcinstion aet pa STUDENT CONCERNG Acausmie 68 Scheie Shaan Sent, ine EE EeoGteM tnelementatan Vie Apa TRATVE MATTERS «Budget stecaten tr separimana actaties HBA CliNOS mantenace nee «Cie BOUIS cd conaesiation sone, BUSINESS «Can forum fr facuy concems x AJOL BRREaY ck HDI \"8 atising hom the miog PARASOL erwentaas Reming Par oneseinatons Ue 0 fosithing eftectminesy Puce i OTNER Next College vyigg Hee! ext Meeting: Monday, Jenuny 63, PON 1 90 ane ting: Venue: University Beard fiaan"
    },
    {
        "image": "meetingagenda2_synth_18_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY School af Seq Ss FACULTY ME Ni STING AGE NDA #2004 Becembar gg, 2005 Nandsy sity Boast Soy US MeUiIg (Datel D Memerancm 28) Pew ova CEMENTS CHE; Decent 8 OF SYA! and TolMol staistes «An sivsis ofp Proposes revisions 8S Engineonne Unwersity Network standin BFS ¥lOUS seenestar ap requirements cnet ei eens and fxcutty reswarch grants yp OpReranites Trainin, STUDENT Cone, Aocredtation visit ‘Matlars arising tro 7 Raticahars usdaies Upcoming PAA Ron! Seba: On ORE trptementa On «Re SABEDIC PROGRAMS 4 Emcor nt pda 24 *O9Tem Weds amet st 2. Curious “eS New shestive caursas for anioyan SC. Asseosment ct Sticien 3m (la for imprevainent a HINES Extension progran a the ‘antretention m Reve vniegraton cFasean, Review oF CLO atiainment inp ND EXTENSION Rr community engsgonien! «Pus ACOLTY GRVEL CME ET «Gradua Shuties set gical mnevatinn, Parkeipalior Student tescthncg ISTRATIME MATTERS «p, Renae Needs Of Cutty concerns x AEy vee: thea edities actatieg Bu feaching eftectver igo sticeaton partment ice hears Next Cotege Wide Me. Next Meeting: Monday, Senuary 23 gag 44, OAM ating: Verse ¢"
    },
    {
        "image": "meetingagenda2_synth_19_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY College of Engineering RESEARCH COMMITTEE AGENDA #2024 1 4 January 15, 2026 Tuesday 09 00 AM Engineering Building, Room 307 AGENDA APPROVAL OF MINUTES (October 5, demic year Faculty publication statistics ttendance IV. RESEARCH GRANT Faculty research proposals for evaluation» student mendations B. External Grants DOST PCIEERD stry sponsored research initiatives C International research projects proposals V- ETHICS REVIEW imal ethics 1m Adoption of agenda PRELIMINARIES Attendance and quo\" ant aca’ 3024) ll, DIRECTOR S REPORT Research ‘outputs for curre extemal funding secured and pending Research conference at APPLICATIONS A. Internal Grants (Universtiy Funding) research support applications Budget allocabon recom research projects CHED research in prio are indus Collaboration «Partnership with ASEAN universities Join BOARD Pending research protocols for approval Review of Murs subjects research Ani committee updates compliance with ethical ‘guidelines VI. RESEARCH ‘CONFERENCE 2025 Conference theme: “Sustainable innovation” Call for Paper ‘and abstracts \"Keynote speakers invitation Budget and sponsorship solicitation Commitee ‘assignments and responsibiies Vil PUBLICATION SUPPORT Publication assistance program guidelines “Journal aftcie processing support Book publication incentives Research dissemination activities Vil INTELLECTUAL PROPERTY Patent and copyright applications Technology transfer opportunities ‘Commerialization of research outputs Innovalon ‘and incubation center updates IX. MONITORING OF ONGOING RESEARCH Progress reports submission Financial accountability requifements Extension requests ane vodifications Terminal reports and OutDUIS X. CAPACITY BUILDING Research methodology workshops Stalstcal analysis raining Grantwriing seminars Xt NEXT MEETING: December 10 2024 Next College Wide Meet rsday, February 07, 2026, 12 00 PM Venue’ Engineering Building, Room Next Meeting: Thur 301"
    },
    {
        "image": "meetingagenda2_synth_19_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "RESFARCH COMMITTEE AGENDA #2024 11 1y $5, 2028 vesday 05 05 AM siding, Room 201 SGENDA acadenic year atlendane ts Univer Furing)» Paouty iy at ce. RESEARCH ropanals to ov: nal funding secuied ang pending Rasearch eo ip wilh A ding research protocois tor anor universti 2 Inncvation” Cait et a ‘SUPPORT citstion Gernmtee a updates KM RESEARCH Pro submiseion requirements Extey Wheations Tesainal aps Roseaic n matnodi “3 Siatisticat anale s waming Grant we becea 40, 2024 Next College Wige Meats Ag: 2626, 12 00 PIM"
    },
    {
        "image": "meetingagenda2_synth_19_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY College of Engineering RESEARCH COMMITTEE AGENDA #2024 11 January 15, 2026 Tuesday 09 00 AM Engineering Building, Room 301 Student DOST PCIEERD Next College Wide Meeting: Next Meeting: Thurs: 301 ‘day, February 07, 2026. 12 00 PM Venue Engineering Building, Room"
    },
    {
        "image": "meetingagenda2_synth_19_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "DE LA SALLE UNIVERSITY otieye of Ena RESEA H COMMITTEE At DA #207 anuaiy 36 Jock aM AGENDA EL MAR nls) DRECTIRS popes Agupton of agente togese h oumucs ed arg parar serra nee atancasce N RESEARCH ORAL? Teseaten sauyeit aprucatens «Budgie aoraye7 1 wirsiabane B Paterna! Grants arch nor SE y spons zit seas AUN ASHAR universities «Joint rasa proval «Fremen ot nurnas ssoycts inseaich Rrimal ames vuigetins VI RESEARCH CONFERENCE 2028 Pentgience sali for vaners and aor Kasnate speak: fespeneatives VIE PUBLNATION SU souma! aricte processt LpRoeear eoich piocets tors O yhgbses G fatenations! lebotahion Parinersmis brmects ospessis V ETHEG REVIEME BOAR ee teeistera engi ance wit etnicor ance pragtar guide’ supp 2. Ainek pulmo incsetaes aa seennaier actyibes Val MVTELLEC T ons le uP copresh! aoRNE: An siogy tanstat upyrtuntes Comme aization at ene Walon AMS neiteahern 5 RESEASCH te Exianor meguects ang mod! Tata 206% ane cota PARAL Deseaicn ve (aan! arcing semanas At ht Next College Wide fiecting: feenng Voursday Feicay 07, 2026 12 00 PMV"
    },
    {
        "image": "meetingagenda2_synth_19_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "DE LASALLE UNIVERSITY 1 Eraginesls pa g2024 14 conege 0) RESEARCR COMMITTEE AGI ganas 18, 2028 Tyas engineering tauteing, Rants 208 AGENDA 4 APPROVAL OF HAINUTES (OCDE 5, PRELIMINARIES AENEAN art quomars AstaBOn OF AGREE RECTORS REPORT H25208 “quant for currant acadarie rope Facaity pubsication SiatSHES aterdanct NM. RESEARCH GRANT again Shader ing Research: CORES? sje Facatty eSeaTeD orypanute tit OF veonvon secomsmendiatin® Eovrnal Grate OST PCRS vey eros GURY SPONBIES aoacon ngguven witratGRy ein rasearch projects ropes Y gree PEVEW 20243 8 8 exon Bat 8 APPLICATIONS jagnarch suppoit ape! caret a DO gernat 30 cetsonns Badge research ia auinivessity Fu equate wots’ ‘Caonabereton Pannarsio #a Agga universtif BORRE Pandit sper awe HURT euniects research Acer SECS pasinaten 20 va Vi RESEARCH CONFERENS agai «oaterence ‘apeiracts Keynoes SOURS. imnmtaton euaget and Ba CATION SUPPORT 4 raeponsibaities Vit PU secenven hae. “Butane panscsaray sscration COmew Pasyeaten assistance preGran Ge rn are proaasing SUDHA” ook putea Tensiearch aessenunation oesies POTELLEC TUAL PROPERTY»? sent at AYEIEOL AEDES ngy waneter opportunites” ‘Gonmemerciairation of osearen puiguts rnavaon are NEEDRI aintar See ogress reports seTiaton FE aground PALATY BALIN 43 RESEARCH ventivcares TevtTine ass raining” Gant ee 4 reports and outDsts vonriass XI NEXT LCF CNGON reget 5 Slats AY MONITOR err mstnscicgy woreanOr ecaniver 19 2024 Next Cotiege- Wise Meabinses: ses Mating: Trusty Fees OF PEG, 1200 PM weenue: Engines? puting, RO 304"
    },
    {
        "image": "meetingagenda2_synth_20_aug1.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES: Graduate Schoo! DEPARTMENT COUNCIL MEETING AGI ADA AES Decambss 24, 2028 Therey 0 30 ABs otege Haan s Stee AGENDA QO RING PRATER AND ATIENDAHOE 8 AEFREVAL OF ME REPORT Daparunont accomsittimants fas Ms TEE ion ot acalty anaeeenacte W. OPROGRAH DEVELOPMENT Ne Soa cheat mosigencs ang wesehinee earing OS 492: Siockehaln TexAniPay ‘ang Appticaions pr eauwen rondest ard srorocqatiney 8 Latpocatory Upgrading Pre west Cannister eboratowy sresina rlanieare and sofware specitrations Budget aquernants ore turwting sountas ©. wraasy ‘Parinesships« miersbip onagram excxanata Acviscyy 1aa s 765 emanations» Savsiryacadoine Hokage peivites FACULTY MATTER Facuiy logging for nant ser ching assignenants ane sdesignaiane Professional ceveropmant necdis assessment Aartoonanien avaluaion procedures Vi STUDENT AEFAIRS Stade organization achvibes and ford» AnaseiS poriormance anaiyes by #87 aiegahie and finanbici sasistance prngrans “Daveer placement and SAE petgtions Yi QUALITY eos with CHEG reauicerments “Preparation for accecitaton wists Secumentation and secares management= Cantinunts impraverentintiatts Vie. RADGET NG FINGAIOE Sirsencia rant FE ear Prosaiemectsequaste ana puoRase s sauce alnaion St HGP be SPECIAL FING AND ncorass Cisseraom and facility teste &, NEXT Bf (DA AND PREVIOUS MEWUITER ian temmlomentstion Praposals 68 208: Discusaion avaivon oF Next College Wide Meeting: jubry 18, 2025, 13 09 PRE Verce: Colleges Devt Cifice Next Meeting: Tauroday"
    },
    {
        "image": "meetingagenda2_synth_20_aug2.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Graduate Schoo! DEPARTMENT COUNCIL MEETING AGENDA #202415 December 24, 2025 ‘Thursday 10 30AM College Dean s Office AGENDA OPENING PRAYER AND ATTENDANCE II, APPROVAL OF AGENDA AND PREVIOUS MINUTES I ‘CHAIR S REPORT Department accomplishments forthe quarter Updates on strategic plan implementation Recognition of faculty achievements IV, PROGRAM DEVELOPMENT A. New Course Proposals CS 305: ‘Artftal ntoligence and Machine Learning CS 402: Blockchain Technology and Applications «Discussion gn course content and prerequisites B, Laboratory Upgrading Project Computer laboratory renovation timeline «Hardware and sofware specifications» Budget requirements and funding sources C. Industy Partnerships internship program expansion Advisory board recommendations Industy academe linkage petites V. FACULTY MATTERS Faculty loading for next semester Teaching assignments and designations «Professional development needs assessment» Performance evaluation Procedires v. STUDENT AFFAIRS Student organization activities and funding Academic performance analysis by Yeat level Scholarship and financial assistance programs Career placement and alumni relations VI ‘QUALITY ASSURANCE Compliance with CHED requirements «Preparation for accreditation visit» Documentation and records management Continuous improvement initiatives VI BUDGET AND FINANCE Financial reportfor coment fiscal year Procurement requests and purchases Resource allocation for programs SPECIAL CONCERNS Faculty workioad concerns Classroom and facility issues X, NEXT MEETING AND ADJOURNMENT Next College Wide Meeting: Next Meeting: Thursday, January 18, 2026, 13 00 PM Venue: College Dean s Office"
    },
    {
        "image": "meetingagenda2_synth_20_aug3.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Graduate School DEPARTMENT COUNCIL MEETING AGENOA e215 December 24, 2025 Treneaay O33 AM Caroge Dean s OFS Next Cotiege Wide Meotints: est Mesting Thecsday, Jey a6, 2028, 1200 Pet Vert, Se Dean s Office"
    },
    {
        "image": "meetingagenda2_synth_20_aug4.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Graduate School DEPARTMENT COUNCIL MEETING AGENDA #2024 15 December 24, 2025 Thursday 10 30 AM College Dean s Office AGENDA |. OPENING PRAYER AND ATTENDANCE II, APPROVAL OF AGENDA AND PREVIOUS MINUTES II CHAIR S REPORT Department accomplishments for the quarter Updates on strategic plan implementation Recognition of faculty achievements IV. PROGRAM DEVELOPMENT A. New Course Proposals CS 305; Artificial Intelligence and Machine Learning CS 402: Blockchain Technology and Applications Discussion ‘on course content and prerequisites B. Laboratory Upgrading Project Computer laboratory renovation timeline Hardware and software specifications Budget requirements and funding sources C. Industry Partnerships Internship program expansion Advisory board recommendations Industry academe linkage activities V. FACULTY MATTERS Faculty loading for next semester Teaching assignments and designations Professional development needs assessment Performance evaluation procedures VI STUDENT AFFAIRS Student organization activities and funding Academic performance analysis by year level Scholarship and financial assistance programs Career placement and alumni relations VIl. QUALITY ASSURANCE Compliance with CHED requirements Preparation for accreditation visit» Documentation and records management Continuous improvement initiatives VI. BUDGET AND FINANCE Financial report for current fiscal year Procurement requests and purchases Resource allocation for programs IX. SPECIAL CONCERNS Faculty workload concerns Classroom and facility issues X. NEXT MEETING AND. ADJOURNMENT Next College Wide Meeting: Next Meeting: Thursday, January 18, 2026, 13 00 PM Venue: College Dean s Office"
    },
    {
        "image": "meetingagenda2_synth_20_aug5.png",
        "label": "meetingagenda",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Graduate School DEPARTMENT COUNCIL MEETING AGENDA #2024 15. December 24, 2025 ‘Thursday 10 30 AM College Dean s Office AGENDA OPENING PRAYER AND ATTENDANCE Il, APPROVAL CHAIR S REPORT Department accomplishments for th Recognition of faculty achievements IV. PROGRAM DE Artificial Intelligence and Machine Leaming CS 402: on course content and prerequisites B. Labor timeline Hardware and software specifications Budi Parinerships «Inemship program expansion Advisory board recommendations. Industry academe linkage activities V. FACULTY MATTERS Faculty loading for next semester Teaching assignments and Seslgnations Professional development needs assessment «Performance evaluation procedures VI STUDENT AFFAIRS Student organization activites and funding Academie Performance analysis by year level Scholarship and fancil assistance programs «Career placement ang alumni relations Vil. QUALITY ASSURANCE Compliance with CHED requirements «Preparation for accreditaton visit Documentation and ‘ecords management “Continuous improvement initatives Vill BUDGET AND FINANCE Financial report for Current fiscal year Procurement requests and purchases Resource allocation for rograms IX. SPECIAL CONCERNS Faculty workload concerns «Classroom and facility issues X NEXT MEETING AND ADJOURNMENT \\L OF AGENDA AND PREVIOUS MINUTES lI, 'e quarter Updates on strategic plan implementation ‘VELOPMENT A. New Course Proposals CS 305: Blockchain Technology and Applications Discussion Next Colleqe Wide Meeting: Next Meeting: Thursday, January 18, 2026, 13 00 PM Venue: College Dean s Office"
    }
]