[
    {
        "image": "memo1_synth_10_aug1.png",
        "label": "memo",
        "ocr_text": "avis Inc academy of Technology] Qaxtiute vate 2008 08 12 To: Kimberly Flores n Up Subject: -,, Please be infor renovation starting No During this period, a temporary f Regular canteen opera s complete. The goal of this renova ining facilities and provide a more renovation i to improve d comfortable eating space. We apologi nformed that the can teen will undergo 0 until December 2. ‘ood kiosk will operate to serve students and s aff. tions will resume once the. tion Is vember ze for any use. Your patience and inconvenience this may ca understanding are highly appreciated as we enhance our sc hool s facilities."
    },
    {
        "image": "memo1_synth_10_aug2.png",
        "label": "memo",
        "ocr_text": "avis Inc Academy of Technolo, nstitute ACADEmy MEMORANDUM ”t 2008 08- 12 Christopher From: fame To: Kimberly Flores i Cay Clean Up py Subject; Environmental Arches Gan Please be informed that the Canteen will undergo renovation Starting November 10 unti uring this Period, a t €cember 2. 7 ‘€Mporary food kiosk wi near the gymnasium to Serve s udents and Staff. Regular Canteen Operations wil] resy renovation is complet Me once the ©. The goal of this renovation is Improve dining facilities and provide a More eating space. We apologize for an enience this may Cause. Your Patience ang anding are highly @ppreciated ag we enhance OUr school s facilities. Underst,"
    },
    {
        "image": "memo1_synth_10_aug3.png",
        "label": "memo",
        "ocr_text": "Davis Inc Academy of Technology] nstitute ACADEMY MEMORANDUM Date2008 08 12 From: Cine To: Kimberly Flores ject: __ Campus Clean Up Drive and Subject: ..,fannontal Awareness Campaign Please be informed that the canteen will undergo renovation starting November 10 until December 2. During this period, a temporary food kiosk will operate near the gymnasium to serve students and staff. Regular canteen operations will resume once the renovation is complete. The goal of this renovation is to improve dining facilities and provide a more comfortable eating space. We apologize for any inconvenience this may cause. Your patience and understanding are highly appreciated as we enhance our school s facilities."
    },
    {
        "image": "memo1_synth_10_aug4.png",
        "label": "memo",
        "ocr_text": "AVIS INC Academy of Technol nstitute vorrecnoloey| —_—. x Date2008 08 12 Christopher From: Crgeee To: Kimberly Flores ject: ._ Campus Clean Up Drive and Subject: «ronmental Awareness Campaign Please be informed that the canteen will undergo renovation starting November 10 until December 2. During this period, a temporary food kiosk will operate near the gymnasium to serve students and staff. Regular canteen operations will resume once the renovation is complete. The goal of this renovation is to improve dining facilities and provide a more comfortable eating space. We apologize for any inconvenience this may cause. Your patience and understanding are highly appreciated as we enhance our school s facilities."
    },
    {
        "image": "memo1_synth_10_aug5.png",
        "label": "memo",
        "ocr_text": "ed that the canieen will undergo renovation starting Novernber 10 until December 2 During this period, a temporary food kiosk will operate near the aymnasium to serve students and staff. Regular canteen operauons will resume once the The goal of this renovation is es and provide a more e. We apologize for any inconvenience this may cause. Your p ence ang understanding are highly apprec atecl as we enhance our school s facilities. Please be inform eating spa"
    },
    {
        "image": "memo1_synth_1_aug1.png",
        "label": "memo",
        "ocr_text": "Green LEC ae School f Technology! vated 974 414 414 ease be informed that the Midterm fram Noyempber 4 to Nove uesied to submit their exam To ails students, p camming will b instructor to the Academy must settie ali during the test. on is greatly apprec ted f for a smooth and organized examination period, coopera"
    },
    {
        "image": "memo1_synth_1_aug2.png",
        "label": "memo",
        "ocr_text": "ease be informed that the Midterm from Noyerdoer, 4to November b lec to supmit their exam schedules ae ination will be Oy iors are Teques A Poe later than Ociob' 2G, Students to the Academic Office no ste all financial obligations before taking No student will be, allowed jo take the test without an examination permet, The use of mooie phones during exaras is strictly prohivited. eachers are reminded to rove clear instructions and fair ume alloiments during the test. Your cooperation iS greatly appreciated for 4 smooth and organizea examination period."
    },
    {
        "image": "memo1_synth_1_aug3.png",
        "label": "memo",
        "ocr_text": "Grgep LC Academy of Technology) Date 4 974 414 144 From: Shs! To: Michae! Danie! Subject: Pre f To all students, please be informed that the Midterm Examination will be held from Noyember 4 to November 8. ii “segeto s are re uested to submit verona sc ecules Gi WIC 6 ng later than Octo! f must satic all’ ic Office ne later then Bat jaking the seams, No student will be, allowed jo take the test without an examination permit. The use of mobile phones curing exams is strictly prohibited. Teachers are reminded to provide clear instructions and fair time allotments during the test. Your cooperation is greatly appreciated for a smooth and organized examination period."
    },
    {
        "image": "memo1_synth_1_aug4.png",
        "label": "memo",
        "ocr_text": "Academy of Technology? ed to subim later than 2 Stude tons befare taking the exams. will be. allowed fo take the fest wi Hithout an exannaton rai. The use of modile phone g exams is Strictly rohibited. Teachers are reminded to provide clear instructions and fair ime sapreciate 1g the test. Your cooperation is g eally apprecia to the Ac hes 3 C must setile all Nos sty"
    },
    {
        "image": "memo1_synth_1_aug5.png",
        "label": "memo",
        "ocr_text": "Grgen LLC Academy of Technology} ACADEMY MEMORANDUM ont 974 11 14 To: Michael Ganials Subject: Pre Figal Examination To all students, please be informed that the Midterm Aremination will be heid fram Noyemb r4to November B. instructors are requested to submit their exam scnedules to the Academi ice no later than October 20, Students must sett 2 ere rce a ter thn ore ta ing the exams. No student will be allowed fo take the test without an examination permit. The use of mobile phones during exams is strictly prohibited. Teachers are reminded to provide clear instructions and fair time allotments during the test. Your cooperation is greatly appreciated for a smooth and organized examination period."
    },
    {
        "image": "memo1_synth_2_aug1.png",
        "label": "memo",
        "ocr_text": "fs ey ees Cilla that ek willbe a Mental Awareness Week starting on October 21. Activities e seminars, counseli g 8 session ness “works! hep for both students and facu io at isast one event is encouraged for e yone. Te are asked to provide time adjustments for students participating the activities. The event aims to promote emotional well being and reduce stress among th ve schoo! community. Schedules of sessions will be posted on the bulletin beards. For inguiries, you may vi Cuigance Office during office"
    },
    {
        "image": "memo1_synth_2_aug2.png",
        "label": "memo",
        "ocr_text": "f cadaray of Technology} B2te Q03 03 16 The Guidance Office announces thai ther will be Niental Healin Awareness ek starting on October 21. Activities include serninars, counseling sessions, and a mindfulness workshop for both students and facuity. Attendance to at least one event is encouraged for everyone. Teachers are asked to provide time adjustments for students participating in the activities. The avent aims to promote emotional well being and reduce stress among the school comm Schedules of sessions will be posted on the bulletin bo: For inquiries, you may visit a Guidance Office during office Ours."
    },
    {
        "image": "memo1_synth_2_aug3.png",
        "label": "memo",
        "ocr_text": "“md Wieoe y Academy of Technology] nstitute P2t22003 03 18 From: Christopher Clarke To: David Parrish Subject: Faculty Meetin ‘Announcement TsahinAviarSnees Wek Sacisatoa ee wb ke a Mental include seminars, counseling sessions, and a mindfulness workshop for both students and faculty. Attendance to at least one event is encouraged for everyone. Teachers are asked to provide time adjustments for students participating in the activities. The event aims to promote emotional well being and reduce stress among the school community. Schedules of sessions will be posted on the bulletin boards. For inquiries, you may ee Guidance Office during office ours."
    },
    {
        "image": "memo1_synth_2_aug4.png",
        "label": "memo",
        "ocr_text": "Acaderny of Technology] Tor Davi Subject: The Guidance Offic ennounces that there will be a Menta health Awareness Week starting on October 21 Ac tes include seminars, counseling sessions, and a mindfulness workshop for both students and faculty. Attendance to at least one event is encouraged for everyone. Teachers are asked to provide time adjustments for Students participating in the activities. The event aims to promote emotional weil being and reduce sireas among the school ommunity, les of sessions will be posted on the bulletin boards. oh Sched For inquiries, you may visit the Guidance Office during office hours."
    },
    {
        "image": "memo1_synth_2_aug5.png",
        "label": "memo",
        "ocr_text": "Academy of Technolegy: OX 5 that there wil be B on Gorober 21. Ne G facuity. Attendance t a for everyone. Teac The Guidance Officg 2 Health Awareness 1 f include seminars, CON i for both students 6 workshop least One event is encouraged asked to pre je time adjusiments for studeris Pat an the activites. The event aims fo promote émon aing and reduce siress arneng the school co munity. ons will be posted on the bulleln poards. . during office dules of ses For inquiries, You may visit ne Guidance O hours."
    },
    {
        "image": "memo1_synth_3_aug1.png",
        "label": "memo",
        "ocr_text": "cee be Academy of Technology) ACADEMY MEMORANDUM Date 982 06 19 From: Chistopher To: Jamie Nelson Subject: student Orientation Program This is to inform all faculty members that the deadline for submission of final grades is December 13. Grades must be encoded in the online ae and verified by the department heads before submission. Late entries will not be accepted to ensure timely release of report cards. Faculty are reminded to double check accuracy and Sc eness of grade records. The Registrar s Office will be open from 8 00 AM to 5 00 PM to assist with grade encoding issues. Please comply strictly with the deadline to avoid administrative delays."
    },
    {
        "image": "memo1_synth_3_aug2.png",
        "label": "memo",
        "ocr_text": "Fitzpatrick, Academ: of Technolo; catipbalP 29 5, Academy ACADEMY MEMORANDUM Date 1 9982 06 19 From: Chaistopher To: Jamie Nelson Subject: student Orientation Program This is to inform all faculty members that the for submission of final grad Open from 8 0 to 5 00 P O assist Ging Issues. Please comply Strictly with deadline to avoid admini"
    },
    {
        "image": "memo1_synth_3_aug3.png",
        "label": "memo",
        "ocr_text": "Fitzpatrick, A f Technol Serene. 24 4) cademy of Technology] ACADEMY MEMORANDUM EE Date: 982 06 19 From: Christopher Clarke To: Jamie Nelson Subject: student Orientation Program This is to inform all faculty members that the deadline for submission of final grades is December 13. Grades must be encoded in the online system and verified by the department heads before su mission. Late entries will not be accepted to ensure timely release of report cards. Faculty are reminded to double check accuracy and comple eness of grade records. The Registrar s Office will be open from 8 00 AM to 5 00 PM to assist with grade encoding issues. Please comply strictly with the deadline to avoid administrative delays."
    },
    {
        "image": "memo1_synth_3_aug4.png",
        "label": "memo",
        "ocr_text": "Fazpatrick, Academy of Technology) Ser ACADEMY MEMORAN DUM Ee vate: 982 06 19 From: Shaetcone’ To: jamie Neison Subject: Sudent Orientation Program This is to inform ali faculty members that t for submission of final i in the online Syston and Office will be open from 8 00 AM to 5 00 PM to assist Piease comply strictly with with grade encoding issues i the deadline to avoid administrative delays."
    },
    {
        "image": "memo1_synth_3_aug5.png",
        "label": "memo",
        "ocr_text": "Fitzpatrick, CSP Ey Academy of Technology] ANDUM ACADEMY MEMOF ee Date] 982 06 19 From: Christopher To: Jamie Nelson Subject: student Orientation Program This is to inform all faculty members that the deadline for submission of final grades is December 13. Grades must be encoded in the online system and verified by the department heads before submission. Late entries will not be accepted to ensure timely release of report cards. Faculty are reminded to double check accuracy and conte eness of grade records. The Registrar s Office will be open from 8 00 AM to 5 00 PM to assist with grade encoding issues. Please comply strictly with the deadline to avoid administrative delays."
    },
    {
        "image": "memo1_synth_4_aug1.png",
        "label": "memo",
        "ocr_text": "ee Academy of Techaclegy} Attearti High isare Student fesclere. Th Attention ail club adyi SIS ay ast dent leaders: The annual Sche I Clubs alt wil e held on Noveinbes 19 at the gymnasium Each organization is required fo ced t - Saree a prepare a booth Showcasing their activilies and achievements. Booth setup will begin at 7 00 AM. and judging starts at 10 00 AM, Prizes wil be awarded for Best Booth and Most Active Organization. This event alms to promote Student involvement and leadership, Please coordinate with the Stu ent Affairs Office for boaih assignments and ofher logistics"
    },
    {
        "image": "memo1_synth_4_aug2.png",
        "label": "memo",
        "ocr_text": "tion all ch a War Ge iS rs and sty jent lez ers: Tha is F wll don Nees mber Each organization is required lo “air ‘Casing their activitie 38 and th setup wil beq at 7 00 AM. and 70 fi t a 0, Mi. Prizes be g BWarded for Best Sooth and Most Aci This event aims lo promote Student sadershin. Please cor A cinate with the nt t Affaji rs Office for booth ass anmenis: and se logistics."
    },
    {
        "image": "memo1_synth_4_aug3.png",
        "label": "memo",
        "ocr_text": "Silva, Matth ang yaione Academy of Technology] ACADEMY MEMORANDUM pa\" 2009 08 1 8 Christ From: Hosea To: Connor Gonzales J ibmissi Subject: Sul mission, ef, Grades Attenti ll clu advisers and student leaders: The annval School Ba Fat an held on Svein r 15 at the gymnasium. Each organization is required to prepare a booth showcasing their activities and achievements. Booth setup will begin at 7 00 AM, and judgin starts at 10 00 AM. Prizes will be awarded for est Booth and Most Active Organization. This event aims to promote student involvement and leadership. Please coordinate with the Stud nt Affairs Office for booth assignments and other logistics."
    },
    {
        "image": "memo1_synth_4_aug4.png",
        "label": "memo",
        "ocr_text": "Attention club apvige is and ANG dent leaders: The annyal Sct abe clubs air will be nel aon N ots [ae 1B at the gymnasi um, Each organization is require prepare a booth showcasi ng iheir activities and achievements. Booth setup will begin at 7 00 AM, and judging starts at 10 00 AM. Prizes will be awarded for Best Booth and Most Active Organization. This event aims to promote student involvement and igadershi Please coordinate with the Student Affairs Office for booth assignments and ofher ea bed"
    },
    {
        "image": "memo1_synth_4_aug5.png",
        "label": "memo",
        "ocr_text": "cademy of yechnoiegy] AttentiPR ali club advigers an nj jeaders: The BS ACG a Rabs Fa S and se ENS syembel 48 nee ayn ANASIUM. Soh arganizau as is requirec to prepare a Gg their activit ies and booth showcasin é achievem ents. Booth getup wil Tpegin at f 7 00 AN, and judging starts at 10 00 AM Prizes will be awarded for Best Booth and Most Active Organization. This event aims to promote student involvement 4 and leadershi Dp. Please, cogrdi nate with nthe: Stugg nt Affairs, Office for pporh assighMen other iogiste"
    },
    {
        "image": "memo1_synth_5_aug1.png",
        "label": "memo",
        "ocr_text": "Gomez and Academy of Technology! University 2020 12 08 Te: Lance Kennedy Subject: Fire and ‘artha sake Driti Notice Please be ji rmed that the school will conduc’ eart gua e die on Set 58 at exactly Shs ALE ‘An Students, teachers, and Staff are required to Participate. Department heads must ensure that everyone in their respective areas follows proper Safely Procedures. The drill will simulate evacuation and emergency response Piplocols. Everyone is reminded to stay caim and follow the instructions of Safety marshais. This activity is part of our disaster Preparedness Program and aims to promote awareness and Safety in times of emergencies,"
    },
    {
        "image": "memo1_synth_5_aug2.png",
        "label": "memo",
        "ocr_text": "ebitioneare Guton thatthe school wit cone ue Pi students, teachers, and staff are required fo participate. Depariment heads must ensure that everyone in their respective areas follows proper safety procedures. The drill will simulate evacuation and emergency response protocols. Everyone is reminded to stay calm and follow the instru tions of safety marshals. This activity is part of ourd t He) asier preparedness program ana aims fo promote awareness and safety in times of emergencies"
    },
    {
        "image": "memo1_synth_5_aug3.png",
        "label": "memo",
        "ocr_text": "Academy of Technology] Subject: Ke Dail Please be i informe that the School will cc earthqual é drilon O ober 5 at exactly siudents, teacher 's, and staff are required to participate. Departmen it heads must ensure that everyone in their respective areas follows proper safety procedures. The driti will simulate evacuat ergency response rotocols. Everyone reminded to stay calm and foilow the instructions of safety marshals. This activity is part of our disaster preparedness program and aims to promote awareness and safety in times of emergencies."
    },
    {
        "image": "memo1_synth_5_aug4.png",
        "label": "memo",
        "ocr_text": "ng Academy of Tec chaology) Dated 2020- 12 08 From eo mes pei nfor fred that schoo} wi} ase i at isd Py 2 srthquake dhe October geet exac idents, teachars and Department g: a are re ane ‘to ads must ensu re that 2 i thelr respect @reas follows proper “ty Procedures. The drili will simulate evacuatior f emergency ses cols Everyone is eming d to stay Ollow the instr Safe ym rsne y Is part o dness program and aims °SS aNd Safety in times o Ong UG a Ay participate. aster io promote f emergencies,"
    },
    {
        "image": "memo1_synth_5_aug5.png",
        "label": "memo",
        "ocr_text": "Pigase be informed that the will conduc earth take d Ley ron eee OF v SP A idents, teachers, and staff are required ‘to participate. Department heads must ensure that everyone in their respective areas follows proper safety procedures. The drill will simulate evacuation and emergency response protocols. Everyone is ee to slay calm and follow the instructions a safety marshals. This activity is part of our disast preparedness program and aims to promote awareness and saiet ty in times of ernergencies."
    },
    {
        "image": "memo1_synth_6_aug1.png",
        "label": "memo",
        "ocr_text": "eee Academy of Technology] bate 2004 01 08 Christopher From: \"Ciarke To: Tammy Harrington ject: Annual Foundation Day suble beiebiaion ule ee She were like Wa Relies all sae eae to return borrowe oks on or before e dates. Overdue Books GiRSRCar a daily fine he 88 peetiein. Students with pending library accounts will not be allowed to borrow new materials. The library will also hold a Book Donation Drive next month to expand its collection. Donors may submit their books to the library front desk. A certificate of appreciation will be given to those who contribute. Let us work together to maintain a responsible ieee culture within the school."
    },
    {
        "image": "memo1_synth_6_aug2.png",
        "label": "memo",
        "ocr_text": "Davi 8 ne Acadamy of Technology] ae Pa 49 PR 1 08 The Library Reid tel like \"3 remind alls Sas Ne to IOKS OF due Boke Wie ie y fine ee paeeaenn eustens with ary accounts will not be s. The library will also Ohl month fo expand ifs collection. Donors Gay sl sul, their books fo the library front desk. A ceriificate of appreciation will be i 2 who wontons. Let us work together to a responsibie reading cuiture within the school. a Book eae ta maintain"
    },
    {
        "image": "memo1_synth_6_aug3.png",
        "label": "memo",
        "ocr_text": "Ee Academy of Technology} The Library Office would tike to return bor rOweG books on or b Overdue books vil incur a dai Students with pending libr allowed to borrow new, Thaterials. 7 The [i brary vail also hold a Book Donation Drive next ama to expand lis tion. Donors n submit their books to the library front desk. A cerificate of appreciation will be given to those. who contribule. Let us work together to maintain a responsible reading culture within the school. salle ct ee to"
    },
    {
        "image": "memo1_synth_6_aug4.png",
        "label": "memo",
        "ocr_text": "Davi S SUL: Academy of Technology} lleG The Library ce would like to rhs a students io turn borrowed Pooks. on or before i due dates. books will incur a caily fine “ote ritem. Students with pending library accounts a Be be allowed to borrow new maierials. The library will aiso hold a Book Donation Drive next month to eS and its collection. Donors may submit their books to the library front desk. A certificate of appreciation will be given to those who contribute. Let us work together to maintain a responsible reading culture within the"
    },
    {
        "image": "memo1_synth_6_aug5.png",
        "label": "memo",
        "ocr_text": "Oey! Academy of Technology} like to remind all students to an ot b go re their ayes date allowed to borrc h Bid é Don WO library front des Ke! noo!"
    },
    {
        "image": "memo1_synth_7_aug1.png",
        "label": "memo",
        "ocr_text": "King Lid Acaderny of Technology} Institute Subject: o To all senior high sch at your work imr al students, please be advised y i ientation will be held on October 28. Attendance ndatory for all Grade 72 students as this orientation provides essertial guidelines for your immersion depicyrment. industry partners will also be present to discuss expe fons and workplace conduct. Students must wear compiete school uniforms and bring notebooks for important notes. The event will take place in the school auditorium at 9 06 AM. Your punctuality and attentiveness are expected."
    },
    {
        "image": "memo1_synth_7_aug2.png",
        "label": "memo",
        "ocr_text": "King Ute Academy of Technology) ee bate 2023 05 14 From: Chiistopher Clarke To: Dana Nelson Subject: Libra Book Retum and jonation Drive To all senior high school students, please be advised that your work immersion orientation will be held on October 28. Attendance is mandatory for all Grade 12 students as this orientation provides essential guidelines for your immersion deployment. Industry partners will t to discuss expectations and workplace Students must wear complete school uniforms and bring notebooks for important notes. The event wi take place in the school auditorium at 9 00 AM. Your punctuality and attentiveness are expected."
    },
    {
        "image": "memo1_synth_7_aug3.png",
        "label": "memo",
        "ocr_text": "King Ltd Academy of Technology} institute ViORANDUM ee 22t 2023 05 14 Frome larke To: Dana Nelson 2 Library Book Retum and Sunlects Donaton Srive To all senior high schooi students, please be advised that your work immersion orientation will be held on October 28. Attendance is mandatory for ali Grade 12 students as this orientation provides essentiai guidelines for your immersion deployment. Industry partners will also be present to discuss expectations and workplace conduct. Students must wear complete schoo! uniforms and bring notebooks for important notes. The event will take place in the school auditorium at 9 00 AM. Your punctuality and attentiveness ara expected."
    },
    {
        "image": "memo1_synth_7_aug4.png",
        "label": "memo",
        "ocr_text": "King Ltd academy of Technology] Institute a pate2023 05 14 From: Chistopher Clarke To: Dana Nelson Subject: Library Book Retum and Donation Drive To all senior high school students, that your work immersion orientation will be held on October 28. Attendance is mandatory for all students as this orientation prov! i for your immersion deployment. Industry pa also be present to discuss expectations and workplace conduct. Students must wear complete school uniforms and bring notebooks for important notes. The event will take place in the school auditorium at 9 00 AM. Your punctuality and attentiveness are expected."
    },
    {
        "image": "memo1_synth_7_aug5.png",
        "label": "memo",
        "ocr_text": "King L. ic Bead omy of Technology) insti To all senior high school students, please be advised that your work immersion orientation 2 will be held on idanc mandatory for all Grade 12 Students as this orientation provides essential guidelines for your immersion Geployment, industry partners will also be present ta discuss expectations and workplace ict. Studen orriplet Sooo! uniforras tS Must wear bring no teboo oKS for important r a 3 the school auditorium at ¢: y and attentiveness are é punctual"
    },
    {
        "image": "memo1_synth_8_aug1.png",
        "label": "memo",
        "ocr_text": "xcademy of Technology} 9719 04 06 ad to announce that ration will oe on The school adrninisiration is plea the -annal Foundation Day Ce e 8, S eaitoral shows Spanment, tions. All deparim ig are ence nuraged to howcase their talents. Students are designated attire for the parade. be posted on the officia: bulletin ake part in this joyous occasion with enthusiasm and pride. Further detail board. Let us"
    },
    {
        "image": "memo1_synth_8_aug2.png",
        "label": "memo",
        "ocr_text": "Academy of Technology} The school administration is pleased to announce that ibe annual Foundation Day celebration wil be on December 6. The theme for this year s event is ‘Celebrating Excellence and Unity.’ Activiti will Include a parade, cultural shows, and Wt department competitions. All departments are encouraged to participate and showcase their talents. Students are reminded io wear their designated attire for the parade. Further details will be posted on the official bulletin board. Let us all take part in this joyous occasion with enthusiasm and pride."
    },
    {
        "image": "memo1_synth_8_aug3.png",
        "label": "memo",
        "ocr_text": "Sete Academy of Technology] ee bate 20 19 04 06 Christ To: Ronald Porter j Work Immersion Onentation Subject: WF NSAP Students. The school administration is pleased to announce that the annual Foundation Day celebration will be on December 6. The theme tor this year s event is ‘Celebrating Excellence and Unity.’ Activities will include a parade, cultural shows, and inter department competitions. All departments are encouraged to participate and showcase their talents. Students are reminded to wear their designated attire for the parade. Further details will be posted on the official bulletin board. Let us all take part in this joyous occasion with enthusiasm and pride."
    },
    {
        "image": "memo1_synth_8_aug4.png",
        "label": "memo",
        "ocr_text": "sens Ae Academy of Technology] bate2019 04 06 Christopher From: \"Cie To: Ronald Porter ject: Work Immersion Orientation Subject: Work (ange Students. The school administration is pleased to announce that the annual Foundation Da celebration will be on December 6. The theme for this year s event is ‘Celebrating Excellence and Unity.\" Activities will include a parade, cultural shows, and inter department competitions. All departments are encouraged to participate and showcase their talents. Students are reminded to wear their designated attire for the parade. Further details will be posted on the official bulletin board. Let us all take part in this joyous occasion with enthusiasm and pride."
    },
    {
        "image": "memo1_synth_8_aug5.png",
        "label": "memo",
        "ocr_text": "sone Sale Academy of Technology] ee 201 9 04 06 Christopher om: Clarke To: Ronald Porter ject: Work Immersion Orientation Subject: Wor imumersias Students The school administration is pleased to announce that the annual Foundation Day celebration will be on December 6. The theme for this year s event is ‘Celebrating Excellence and Unity.' Activities will include a parade, cultural shows, and inter department competitions. All departments are encouraged to participate and showcase their talents. Students are reminded to wear their designated attire for the parade. Further details will be posted on the official bulletin board. Let us all take part in this joyous occasion with enthusiasm and pride."
    },
    {
        "image": "memo1_synth_9_aug1.png",
        "label": "memo",
        "ocr_text": "Academy of Technology} All t leaching and non- jeachi atter nd the upcoming The Serninar wi Fire By rolecti On ane y ance fi re prevention tech ictly mani tored for Eve IS advised Tor outds 8 Suiee le For ut dor dr to keep fa) édi by ‘the Bureau of ergency fi rhe Segpinat mul hipurpose hal UF SChOOl a safa 9 0 (Rh"
    },
    {
        "image": "memo1_synth_9_aug2.png",
        "label": "memo",
        "ocr_text": "Rodrigues ae Academy of Technology] ACADEMY MEMORANDUM Date 2007 09 09 From: Chytstopher To: Derek Olson Subject: Scholarship Ariicatin and Renewal All teaching and non teaching staff are required to attend the upcoming fire safety seminar on October 22. The seminar will be conducted by the Bureau of Fire Protection and will focus on emergency response and fire prevention techniques. Attendance will be strictly monitored for documentation purposes. iiepe is advised to wear comfortable clothing E i for outdoor drills. The seminar will start at 8 30 ‘n the mufipurpose all Let Us Wor Sage er to keep our school a safe place for everyone."
    },
    {
        "image": "memo1_synth_9_aug3.png",
        "label": "memo",
        "ocr_text": "@ required to minar on October i by the Bureau of All teaching andr alte and t ine 22. The Fire Prot gency response and fi idance will be ored for d octet advised to wear con outdoor drills. 2 multipurpose hall 3 keep our school a safe pla purposes."
    },
    {
        "image": "memo1_synth_9_aug4.png",
        "label": "memo",
        "ocr_text": "Rodriguez and Rodriguhege Academy of Technology] ee vate2907 09 09 From: ‘Christopher Clarke To: Derek Olson lication and Renewal Ipdate subject: 82°\"? Arp All teaching and non teaching staff attend the upcoming fire safety seminar on October 22. The seminar will be conducted by the Bureau of Fire Protection and will focus on emergency res jonse and fire prevention techniques. ‘Attendance will be strictly monitored for documentation urposes. Ever one is advised th comfortable cots i r outdoor drills. seminar will sta t 8 30 Min the multipurpose hall Let us wor together to keep our school a safe place for everyone."
    },
    {
        "image": "memo1_synth_9_aug5.png",
        "label": "memo",
        "ocr_text": "Academy of Tecknulegy] Srmoaneneeacacwrirnantmirwneta inten anneinnntvtnrnsen bate 2007 68 09 Feo: Ye: Subject foe “eemccnranenann retin 5, Au teaching and non leaching staff attend the upcom| Ing fi fire safety sem _22. The saminar will ne conducted by the Bureay 1 of Fire Projection and will focus on emergency response and fire prevention techniques. Attendance wil be strictly monitored for docurnentati ion Big poses. Everyone is advised to wear comfortab! cae lothing 9 5H! AME r outdoor drills, The Seminar w will start et he the multipurpose hall Let us wor together to keep our school a safe lace for everyone. are required to inar on October"
    }
]