[
    {
        "image": "memo2_synth_10_aug1.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines University of Banks Youngtown OFFICE OF THE PRESIDENT 2020 05 07 MEMORANDUM NO468 -2006 T bs 2 ‘ Director of Student Affairs FROM faculty of Teonagement —=: Canteen Re ovation and,. Temporary God yalieGe Notice s that renovation work will begin 4 0. The Canteen Committee announce on November 40. 2 0. During this period, 4 temporary food kiosk W! operate neat the gymnasium to serve students and staff, 3 0. Normal operations will resume by n completion of the improvements. 4 0. The renovation aims to provide a more spacious and comfortable dining area. o--- We apologize for any inconvenience this may cause. 6 0. Thank you for your patience and cooperation during this upgrade. /.0. For your guidance and compliance. a Adam Duncan 7 President ce Concemad OMfeiait Records Fis"
    },
    {
        "image": "memo2_synth_10_aug2.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines University of Banks Youngtown OFFICE OF THE PRESIDENT 2020 05 07 MEMORANDUM NO 168 -2006 * Director of Student Affairs ——..* Cantee ovation Temporary ood Servic Lites 1 0. The Canteen Committee announces that renovation work will begin on November 10. 2 0. During this period, a temporary food kiosk wi operate near the gymnasium to serve students and staff. 3 0. Normal operations will resume by December 2 upon completion of the improvements. 4 0. The renovation aims to provide a more spacious and comfortable dining area. 5 0. We apologize for any inconvenience this may cause. 6 0. Mas ye for your patience and cooperation during this upgrade. 7 0. For your guidance and compliance. =~ Adam Duncan President Ce Concemed Officials Records File"
    },
    {
        "image": "memo2_synth_10_aug3.png",
        "label": "memo",
        "ocr_text": "University of Banks Youngtown OFFICE OF THE PRESIDENT 2020 05 07 MEMORANDUM NO4 89 2006 Director of Student Affairs SUBJECT Canteer enovatio nd Temporary ood Sérvice Notice 1 0. The Canteen renovation work will begin on November 7 i period, a it mporary food kiosk will operate t near the un to serve stuc i nd staff. 3 0. Norme erations wil resume by fon alms tor completion ort th impr com may c"
    },
    {
        "image": "memo2_synth_10_aug4.png",
        "label": "memo",
        "ocr_text": "University of Banks Youngtown OFEICE OF THE PRESIDENT 2020 05 07 MEMORANDUM NO 468 -2006 eo Director of Student Affairs of To FROM meee Canteer enovation Temporary Food Service otice 4 0. The Canteen Committee announces that renovation work will begin on November 10. 2 0. During this period, a temporary food kiosk wil operate near the gymnasium io serve students and staff. 3 0. Normal operations will resume by December 2 upon completion of the improvements 4 0. The renovation aims to provide a more spacious and comfortable dining area. 5 0. We apologize for any inconvenience this may cause. 5 0. Thank you for your patierice and cooperation during this upgrade. 7 0. For your guidance anc compliance. Adam Duncan President"
    },
    {
        "image": "memo2_synth_10_aug5.png",
        "label": "memo",
        "ocr_text": "Uni iversity of Banks Youngtown GFFICE OF PRESTOENT 2020 05 07 ibd NOs -2006 Director of Student Affairs FROM fe sy A SUBUECT nporary PSs novatio _lemporary od Servi vice. \\oti ice announces that renovation WOrk wll! begin ing this period a temporary food kiosk will Siuide nts and staff. 3 0. Normal 1 0. The Canteen Committees on November 10. 2 0. Duri Ooperale near tha gymnasium to serve operations Wil resume by Dec: ember 2 up improvemenis. 4 4 0. TH 1 completi ion of the Fenovation airs to Drovide a more Spacious and Mfortable inj ing area. 5 0. We &pologize for any inconvenience this May cause, 6 6. Thank you for your patience and coope; upgrade. 7 6. sation during this For your guidance and compliance Asam Duncan Presider aia"
    },
    {
        "image": "memo2_synth_1_aug1.png",
        "label": "memo",
        "ocr_text": "Academy of Burns Alisoniand OFFICE OF THE PRESIDENT 1977 10 11 MEMORANDUM NO 594 1985 Program Chair for Accountancy FROM 5 Fecul wis SUBJECT lid erm Exa ination Schec Jule ar nd Ae minders TO 1 0. The Acadamig Offige wishes to announce that the Mic erm Examination will comme from Voyember 4 to Ne ber &. 2 0. All instructors requested io finalize their exam questions and submit copies to the department chair by October 25. 3 0. Students must ensure that they have settled ail school obligations prior to the examination week. 4 0. Class advisers are encouraged to remind their students ab ination permits. 31 5 0. Observance of proper conduct during examinati expected at limes. 6 0. Kindly extend full cooperation for the smooth conduct of this academic activity. 7 0. For your guidance and compliance. Dr. Mary Haynes MD Presidant re Pa ae"
    },
    {
        "image": "memo2_synth_1_aug2.png",
        "label": "memo",
        "ocr_text": "Rent demy of Burns Alisoniand Acac ENT OFFICE OF THE PRES 4977 10 11 MEMORANDUM NO521° 4G85 be Program Chair for Accountancy “4h Facy FROM 5 sdhedu mand ds mem po tees le. ans =e {ors secmsaee cca 4 mig Of ce wishes. i ANMOUNCS, thal the, Mi ier (= 3 ge trom h Nove ber 4 io Novernbel 3. AQ) isituc are to Analize t a Gul jestions and guibm sto the t chair by Gotober 2 Q. V Students rust ens' re hy i they have d all schoo! obligations. prior io the yamination week. 0. Ciass advisers are encouraged fo remind thelr siuc ts about examine ion permits. ser conduct during examinato ons iS ad atall for the S smooth cath nduct of this 6 6, Observance of prop *imes. 6 0. Kindly extend full cooperation academic activity. 7 0. For your guidance and compliance."
    },
    {
        "image": "memo2_synth_1_aug3.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines Academy of Burns Alisonland OFFICE OF THE PRESIDENT 1977 10 11 MEMORANDUM NO52} -1985 Program Chair for Accountancy Faculty of Nursing ENce z and Health Sciences —..* id er m Examination sfficte ule and Reminders 1 0. The Academig Offi Rwishes 9 @NGuembe tha af the Migtern Examination will comme’ ge from er ovem inst ruc Of are requested to nalize t eir exam questions ‘and submit copies to the department chair by October 25. 3 0. Students must ensure that they have settled all school obligations prior to the examination week. 4 0. Class advisers are encouraged to remind their students about examination permits. 5 0. Observance of proper conduct during examinations is expected at all times. 6 0. Kindly extend full cooperation for the smooth conduct of this academic activity. 7 0. For your guidance and compliance. TO a Dr. Mary Haynes MD resident Ce Concemed Officials Records. File"
    },
    {
        "image": "memo2_synth_1_aug4.png",
        "label": "memo",
        "ocr_text": "Academy of ‘Burns Alisoniand OFFICE OF TRE PRESIDENT 4977 10 11 MEMORANDUM NO594 -1985 me Prograrn Chair for Accountancy f Nursing cence cect per me cae Office wis shes i FROM oleie eee 2 a announce that the Midterm E 2 NV mination ce overber &. 2 0 Sera org are request ed to question Is and abit copes 9 the department chair by October 25. 3 0. Students must enst e that they have gattied all schoo! obligations prlor to the examination k. 4 9. Class advisers are encoure aged to remind the rudents about examination p ermits. 5 0, Observance of proper conduct during examinations is ex ected at all times. 6 0. Kindly extend f full epoperation for the smooth cone ct of ihis academic activity. 7 0. For your guidance and Hiance. 4 0. The A will con rom N 35 amoet inalize ine @"
    },
    {
        "image": "memo2_synth_1_aug5.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines Academy of Burns Alisonland OFFICE OF THE PRESIDENT 1977 10 11 MEMORANDUM NO591 -1985 me ‘Program Chair for Accountancy ae idterm Examination sels ule and Reminders 1 0. The Academic Office wishes to announce that the Midterm Examination wil ne ne ge from No vishes (9 fy Runes thas ther Wer ctor are requested to tinalize their exam questions and submit copies to the department chair by October 25. 3 0. Students must ensure that they have settled all school obligations prior to the examination week. 4 0. Class advisers are encouraged to remind their students about examination permits. 5 0. Observance of proper conduct during examinations is expected at all times. 6 0. Kindly extend full cooperation for the smooth conduct of this academic activity. 7 0. For your guidance and compliance. —_= Dr. Mary Haynes MD resident Ce Concemed Officials Records File"
    },
    {
        "image": "memo2_synth_2_aug1.png",
        "label": "memo",
        "ocr_text": "mR College of Green South Nicholaschester orrice OFT We PRESH NT 2000 03 19 MEMORANDUM RO 5G4- 4983 Assistant Dean for Student Development his] suBJECT General rPacu ity Meeti ng Announcelnen ae, seneral Faculty h Meeting will be held on October 28 at ine schoo! idiionum,. 2 9. Attendance is ‘mandatory for teaching and non- ning personnel. 3 0 1 important updates on licies. upcoming events, and student welfare e pragrams will t heads 2 are encouraged io prepare brief d to be 4 0. This is to ANPOUnc academic 20 be di scussed. ). Department their respectv ive concerns, 3) ryone Is. expecté 6 0, Snacks will be reparts on nce. punctual and Served alter the meeting. 7 attentive thi roughout the session. 7.§. For your guidance and complia Joshua t Nguyen 7 President Cfieiate"
    },
    {
        "image": "memo2_synth_2_aug2.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines College of Green South Nicholaschester OFFICE OF THE PRESIDENT 2000 03 19 MEMORANDUM NO564 -1983 a Assistant Dean for Student Development FROM copie SUBJECT: General Faculty Meeting Announcement 1 0. This is to announce that a General Faculty Meeting will be held on October 28 at the school auditorium. 2 0. Attendance is mandatory for all teaching and non teaching personnel. 3 0. Important updates on academic policies, upcoming events, and student welfare programs will be discussed. 4 0. Department heads are encouraged to prepare brief reports on their respective concerns. 5 0. Everyone is expected to be punctual and attentive throughout the session. 6 0. Snacks will be served after the meeting. 7 0. For your guidance and compliance. ==> Joshua Nguyen President Ce Concemed Officials File"
    },
    {
        "image": "memo2_synth_2_aug3.png",
        "label": "memo",
        "ocr_text": "© To FROM SUBJECT 1 0. This is t Republic of the Philippines College of Green South Nicholaschester OFFICE OF THE PRESIDENT MEMORANDUM NO564 -1983 0 announce that a October 28 at the school auditor teaching and non teac be discussed, 4 0. reports on their res Punctual and atte Served after the Ce Concemed Officials Records File 2000 03 19 General F. Pective Concerns. 5 0. Ntive t broughout the se meeting. 7 0. F Or your g ium. 2 0, Atte Assistant Dean for Student Dev mi ia General Faculty Me nnouncement elopment eting veryone is ©xpected to be 'S Sion. 6 0. uidance and Snacks will be compliance. => Joshua Nguyen President"
    },
    {
        "image": "memo2_synth_2_aug4.png",
        "label": "memo",
        "ocr_text": "Rooublic of cs College of Green South Nicholaschester OBFICE OF THE PRESIDENT 2000 03 19 MEMORANDUM NO564 -1983 bid Assistant Dean for Student Development FROMM nd SUBJECT General Faculty Meeting Announcement _ j ai Faculty Meeting will be held on October 28 at the schoo! auditorium. 2 0. Attendance is mandatory for all teaching and non teaching personnel. 3 0. important updates on academic policies, upcoming events, and student welfare programs will discussed. 4 0. Department heads are encouraged to prepare brief reporis on their respective concerns. 5 0, Everyone is expected to be punctual and attentive throughout the session. 6 0. Snacks will be served after the meeting. 7 0. For your guidance and compliance Joshua Nguyen ve President é"
    },
    {
        "image": "memo2_synth_2_aug5.png",
        "label": "memo",
        "ocr_text": "Coll ege of Green South Ni holaschest OFFICE OF THE PRESIDENT 2000 03 19 MEMORANDUM NO 5¢ “4983 tudent Development ¥9 Agsistant Dean for S FROM SUBJECT ent. iG with bet ae on ie Faculty Meeting all g 8. ep ariment ‘ active concems. 5 0 eryon 3 th roughout tf je session. 6 0. 1g. 7 6. For your guidance and n chs will be compliance. is punctual ant v served after ine meetin Joshua Nous 2"
    },
    {
        "image": "memo2_synth_3_aug1.png",
        "label": "memo",
        "ocr_text": "Inst itute o of Olsen Angelaside 4979 02 10 MEMORANDUM NO 473 -1998 ' Head of Guidance and Counseling FROM eee. Me lental Health Awareness eminar. S che ule 1 0. The Guidance informs alls Awareness ‘Seminar wall take: piace on on promoting emotional bal nee and ma Aitenda vie to at Mental Health the evant wil focus ademic tress. 3 0. 6 na L Z sing bas mindt ulnes 38 within our schoo community. guidarice and compllance."
    },
    {
        "image": "memo2_synth_3_aug2.png",
        "label": "memo",
        "ocr_text": "ines He of the institute of Olsen Angelasidé OKFICE OF THE PRESIDENT 1979 02 10 MEMORANDUM NO473 -1998 - Head of Guidance and Counseling FROM Cx iv aan guavecT =: Mental Heal rachedule s that a Me tal Health bai 20. the vent oa cus stress. 3 0. levels. 4. G. Office informs ii take piace on ce and 4 0, The Awarenes gs Semin in on promoting emotiona b Attendance to af least one Faculty members are requested activity. Suest counselors oa menial ath ron facilitate ‘the discussions. 6 0, Let us iake this opportunity to pr well- being and mindiuin within our school community. 7 0. “For your guidance and comp Hance. James Crane President"
    },
    {
        "image": "memo2_synth_3_aug3.png",
        "label": "memo",
        "ocr_text": "segintic ul the Phiippines institute of Olsen Angelaside OFFICE OF THE PRESIDENT 1979 02 10 MEMORANOUM NO473 1998 Head of Guidance and Counseling FROM ee Me tal Healt reness ntal Healy f hed ul nce Office informs: students tha rawill take place on ®ec fo a 2 0 it ,oting emotional balance and managing 4 t seat one $s! nis enc ouraged for all d to allow sit ude 5 to participate in this and mental heait ith professionals will at us take th oppariuntt ty to prioritize vn Out schoo! ymunity, 7 0. For your sth. focus Faculty membe ty 5 0. facilitaié ihe disc well being and minal ess W guidance a"
    },
    {
        "image": "memo2_synth_3_aug4.png",
        "label": "memo",
        "ocr_text": "Republic of the Phitippines Institute of Olsen Angelaside OFFICE OF THE PRESIDENT 1979 02 10 MEMORANOUM NOY 73 1998 Head of Guidance and Counseling FROM Cop a yo and Media Studies SUBJECT mrurceramam: It Me sat a Awarggess ah 1 0. The Guidan Office informs !! students that nial Awareness 8 Suidar will as place an BohsHee ped bat Theta eat On promoting emotional balance and managing academic stress. 3 0. Attendance to at feast one session is encouraged for ali grade jevels. 4 0, Faculty mernbers are requested to allow Students to participate in this activity. 5 0. Guest counselors and menta} health professionals wil} facilitate the discussions. 6 0. Let Us take this Opportunity to prioritize well being and mindfulness within our school community. 7 0. For your guidance and compliance Jarnes Crane va President 7 Ce Concemed Offesis. Records Pte"
    },
    {
        "image": "memo2_synth_3_aug5.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines Institute Of Olsen Angelaside OFFICE OF THE PRESIDENT 1979 02 49 MEMORANDUM NG473 4 998 Head of Guidance ang Counseling FROM Comm “RRR gion ans SUBJECT Mental Healt swareness wit Pecuaaneneminar Schedule Awaranagts sfuidance aise, |ntorms Befitidents ha Therakertealty on Promoting emotional balance and managing academic strass. 3 0. A St one session js encouraged for ali grade feveis. 4 9. Aor tcene facilitate the d James Crane “A President 4 C6 Concomes OFiniaig Reconde"
    },
    {
        "image": "memo2_synth_4_aug1.png",
        "label": "memo",
        "ocr_text": "Academy of Collier THE PRESIDENT OFFICE OF To Coordinater for Community Extension Services FROM facu Eng meee Submission of Final srades diine ads are f n timeline. For"
    },
    {
        "image": "memo2_synth_4_aug2.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines Academy of Collier Mikechester OFFICE OF THE PRESIDENT 2025 03 04 MEMORANDUM NO334 -1971 TO Coordinator for Community Extension Services FROM Enginezeing —- Submission of Final rades Deadline 1 0. The Registrar s Office reminds all faculty members to submit their final grades not later than December 13. 2 0. Grades must be encoded accurately in the online grading portal. 3 0. Verification and approval by department heads are required before final submission. 4 0. Late entries will cause delays in report card processing and must be avoided. 5 0. Assistance will be available at the Registrar s Office during regular working hours. 6 0. Kindly adhere strictly to the given timeline. 7 0. For your guidance and compliance. Mary Owens re esident Ce Concemed Officials Records. File"
    },
    {
        "image": "memo2_synth_4_aug3.png",
        "label": "memo",
        "ocr_text": "Academy of Collier echesier PRESIDENT OFFICE OF THE 2025 03 04 MEMORANDUM NOQ34 1974 TO Coordinator for Communi ity Extension Lag eirat ats Services ily members te submit their J o grades noi later S Shan is} ce emb s rust be encoded ately in the online grading, carta aed verifica on and appr oval by fe Oo. 4 ate e sire ed before ca rd proc eG At ithe Re Office “dt r iven t imeline. 7 0. For UTS. 6 0 6. Kir your gu uidance and i comp Mary Owens President"
    },
    {
        "image": "memo2_synth_4_aug4.png",
        "label": "memo",
        "ocr_text": "Z Republic of the Philippines -& Academy of Collier i Mikechester OFFICE OF THE PRESIDENT 2025 03 04 MEMORANDUM NO 334 -1971 To Coordinator for Community Extension Services FROM Engineering SUBJECT Submission of Final rades Deadline 1 0. The Registrar s Office reminds all faculty members to submit their final grades not later than December 13. 2 0. Grades must be encoded accurately in the online grading portal. 3 0. Verification and approval by department heads are required before final submission. 4 0. Late entries will cause delays in report card processing and must be avoided. 5 0. Assistance will be available at the Registrar s Office during regular working hours. 6 0. Kindly adhere strictly to the given timeline. 7 0. For your guidance and compliance. Mary Owens resident Ce Concemed Officials Records File"
    },
    {
        "image": "memo2_synth_4_aug5.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines Academy of Collier Mikechester OFFICE OF THE PRESIDENT 2025 03 04 MEMORANDUM NO334 -1971 Coordinator ie Community Extension e TO rvices REM Ea SUBJECT . F Submission of Final rades Deadline 4 0. The Registrar s Office reminds all faculty members to submit their final grades not later than December 13. 2 0. Grades must be encoded portal. 3 0. Verification and approval by accurately in the online gradin department heads are required before final submission. 4 0. Late entries will cause delays in report card processin and must be avoided. 5 0. Assistance will be available at the Registrar s Office during re ular working hours. 6 0. Kindly adhere strictly to the given timeline. 7 0. For your guidance and compliance. Mary Owens resident Ce Concemed Officials Records File"
    },
    {
        "image": "memo2_synth_5_aug1.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines University of Buchanan New Debra OFFICE OF THE PRESIDENT 2024 04 18 MEMORANDUM NO959 -1992 39 Principal of the Senior High Schoo! Department FROM Facult enrol ——,* Emergency Preparedness and afety Drill 1 0. The Office of Student Affairs announces the conduct of an Emergency Preparedness Drill on October 25. 2 0. All students, teachers, and staff must articipate to ensure familiarity with evacuation routes. 3 0. Safet marshals will be assigned to guide each department during the activity. 4 0. Participants are reminded to remain calm and follow proper safety protocols. 5 0. The drill will simulate earthquake and fire evacuation scenarios. 6 0. Cooperation from everyone is essential for the success of this safety initiative. 7 0. For your guidance and compliance. =~ Jeremy Watson President Ce Concemed Officials Records File"
    },
    {
        "image": "memo2_synth_5_aug2.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines University of Buchanan New Debra OF THE PRESIDENT 2024 04 18 OFFICE MEMORANDUM NO252 -1992 Principal of the Se partment nior High School De TO FROM Faculty of Information suByecT Emergency Preparedness and afety Drill 4 0. The Office f Student Affairs announces the conduct of an Emergency Preparedness Drill on October 5. 2 0. All students, teachers, and sta must partic ate to ensure familiarity with evacuation routes. 3 0. Safety marshals will be assigne department during the activity. 4 0 Participants are reminded to remain calm ‘and follow proper safety 0. The drill will si a d fire evacuation essential for the success rotocols. t 0. Cooperation from everyone IS idance and compliance. scenarios. 6 0. Orr: this safety initiative. 7 0. For your gu a Jeremy Watson President ce Concemed Officials Records File"
    },
    {
        "image": "memo2_synth_5_aug3.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines University of Buchanan New Debra OFFICE OF THE PRESIDENT 2024 04 18 MEMORANDUM N0259 1992 i ‘Principal of the Senior High School Department FROM Faculty be norormation a Emergency Preparedness and afety Dri 1 0. The Office of Student Affairs announ reparedness Drill on O ces the conduct of an Emergency Ctober 25. 2 0. All students, teachers, and Staff to ensure familiarity with Evacuation routes. 3 0. Safet marshals will be assigned to guide eac| department during the activity. 40, articipants are reminded to remain calm and follow Proper safety Protocols. 5 0. The drill will simulate earthquake and fire Evacuation Scenarios. 6 0. Ooperation from everyone is €ssential for the SUCCess of this Safety initiative. 7 0. For your guidance and Compliance. must Rartici at —S.. Jeremy Watson President Ce Concemed Officiais Records File"
    },
    {
        "image": "memo2_synth_5_aug4.png",
        "label": "memo",
        "ocr_text": "University New Debra ENT OFFICE OF TI 1E PRES 2024 04 18 memoraNnnuMm NO252 1992 70 Principal of the Senior High School Department alion FROM supseer reparedness and ill Emergency 4 9. The Office of Student Affairs announces the conduct of an Preparedness Drill on Octobe' 36, Ail students. feachers, and sta must part 5 ensure famillanly with evacuation routes. 3 0. Safety marshals igned te guide each department during the activity. 4 0. Partic 3 are reminded to remain calm and follow proper saieily protocols. 5 0. The drill wis nulate garihquake and fire evacue jon scenarios. 6 9. Cooperation from everyone ig essential for the success of this safety initiative. 7 0. For your guidance and compliance."
    },
    {
        "image": "memo2_synth_5_aug5.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines: University of Buchanan New Debra OFFICE OF THE PRESIDENT 2024 04 18 MEMORANDUM NOQ52 1992 we Principal of the Senior High School Department FROM Faculty of ‘omens suBvecT Emergency Preparedness and afety Dri ee ces the conduct of an Emergency 4 0. The Office of Student Affairs announ Preparedness Drili on October 25. 2 0. All students, teachers, and staff rust participate to ansure familiarity with evacuation routes. 3 0. Safety marsnals will be assigned to guide each department during the activity. 4 9. Participants are rerninded to remain caim and follow proper safety protocols. 5 0. The drill will simulate earthquake and fire evacuation i for the success scenarios. 6 0. Cooperation from everyone is essentia tive. 7 0. For your guidance and compliance this safety initia _ _ Jeremy Watson President /"
    },
    {
        "image": "memo2_synth_6_aug1.png",
        "label": "memo",
        "ocr_text": "institute of Smith Bakerport OFFICE OF THE PRESIDENT 1994 09 23 MEMORANDUM NO453 -202 TO Coordinator for Community Extension Services FROM Faculty of Arts a and Sciences SUBJECT: aa! Book Return and 1 0. The Library Of for returning borrow will incur the st gach books gle er ASTON 2 _ e that the deadline Y ‘aterials is on Y November 2 0. Overdue ifems d fine of F5 00 per day. 3 0. Stucenis with wed to borrow ne 3 ; Donation f rye N ver 0. onors will appreciation or in ribution, 6 0. Let us w maintaining our library s resources, 7 0. For you compliance."
    },
    {
        "image": "memo2_synth_6_aug2.png",
        "label": "memo",
        "ocr_text": "insti tute of Smith Bakerport OFFICE OF THE PRESIDENT 1991 09 23 MEMORANDUR NO453 2023 To 4 Coordinator for Community Extension Services FROM Faculty of Arts and Sciences Library Book Return and _Donation Drive. SUBJECT 1 0. The Library Office wouid like to remind ev veryone that the deadii iin for returning borrowed materials is on No vember 5. 2 0 Overdue tems will incur aes standard fine of ®5 00 per day. 3. 0. Students with unreturned book S wi bn no wt: Book cio borrow nev ae lals until jheir accounts area aig BRoK opation rive aiso be held trom November 1 rom Syembet gnors wy recel e cer herine of apprecia ia eer contribution. 6 0 1 Left us work together in maintaining mi ene resources. 7 0. For your guidance and compliance. pane Brennan President"
    },
    {
        "image": "memo2_synth_6_aug3.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines Institute of Smith Bakerport OFFICE OF THE PRESIDENT 1991 09 23 MEMORANDUM NOv53 -2023 TO Coordinator for Community Extension Services FROM Faculty of Arts and Sciences SUBJECT: Library Book Return and Donation Drive 1 0. The Library Office would like to remind everyone that the deadline for returning borrowed materials is on November 5. 2 0. Overdue items will incur the standard fine of ®5 00 per day. 3 0. Students with unreturned boo ks will yh be Book d to borrow. new Pals be. pot their ageounls arg Gea onation tly ie wi er 1 3 0. B Iso Qnors wi I Tecei g cert feates OF Sppreciation or their 21 285 0 0 et us work together in maintaining our library s resources. 7 0. For your guidance and compliance. —S Daniel Brennan President Ce Concemed Officials Records File"
    },
    {
        "image": "memo2_synth_6_aug4.png",
        "label": "memo",
        "ocr_text": "Re institute of Smi th Bakerport OFFICE OF THE PRESIDENT 1991 09 23 MEMORANDUM NO453 2023 To Coordinator for Community Extension Services PROM Faculty of Arts and Sciences SUBJECT oe Library Book Return and __ Donation Drive. 4 0. The Library Office would like to remind everyone that the deadiine for returning borrowed materials is on November 5. 2 0. Overdue items will incur the standard fine of #5 00 per day. 3. 0. St udenis with unreturned books will not be ailowed to borrow. new spateria is poe fhelt accounts af cleared 40 QOK LOL ation Drive will aise be } rom Novembe vein Ser 2 30. cae be Che wilt feceive cer ficales of appre A No her contribution: ef us wor together in aintaining our library s resources. 7 0. For your guidance and compliance. Danie! Brennan if President y,"
    },
    {
        "image": "memo2_synth_6_aug5.png",
        "label": "memo",
        "ocr_text": "Institute of Smith Bakerport OFFICE OF THE PRESIDENT 1991 09 23 MEMORANDUM NO453 -2023 70 Coordinator for Community Extension Services FROM Faculty of Ars and Sciences ee Library Book Return and Donation Drive 1 0. The Library Office wouid like to remind everyone that the deadline for returning borrowed materials is on Novernber 5. 2 0. Overdue ilems will incur the standard fine of 5 00 per day, 3 0. Students with unreturned books will oy be eek io porrey pnew materiais until their 4, accounts are cleat JAE BOK onation Drive will aiso be heid trom Novernber 4 to November |. 5 0. Donors will recelve cet iCales CT appreciation jor their contribution. 6 0. Let us work together in maintaining our library s resources. 7 0. For your guidance and compliance Dgniei Brennan Presigent"
    },
    {
        "image": "memo2_synth_7_aug1.png",
        "label": "memo",
        "ocr_text": "institute of Lee OFFICE OF THE PRESIDENT 2020 07 24 MEMORANDUM NO 939 -2003 To Dean of the College of Business Administration FROM SUBJECT Work Immersion Orientation “tor Grade 12 Students tc inform all Grade 12 students that the ation will be held on October 36 2 0. Attendance is ent Wil provide important guidelines ance industry instructions. 3 0. Representa’ from partner companies will discuss workplace conduct and expe ons. 4 0. Students must wear uniforms and bring notebooks mportant notes. 5 0. Teache; requested to accompany th i ry Classes during the orientation. 6 0. Your punctuality and coopera re hight reciated. 7 0. For your 2 ion a aniy a guidance and complian Joyce Smit President - a CMficials"
    },
    {
        "image": "memo2_synth_7_aug2.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines Institute of Lee West Carl OFFICE OF THE PRESIDENT 2020 07 24 MEMORANDUM NO335 -2003 To Dean of the College of Business Administration FROM Festa pene SUBJECT Work Immersion Orientation for Grade 12 Students 1 0. The Principal s Office wishes to inform all Grade 12 students that the Work Immersion tientation will be held on migtaber 30 2 0. Attendance is compulsory as this event wi provide !mportant guidelines and in ustry instructions. 3 0. Representatives from partner Companies will discuss workplace conduct and €xpectations. 4 0. Stud uniforms and bring notebooks for important notes. 5 0 T requested to accompany their i i orientation. 6 0. Your Punctuality and cooperation are highly appreciated. 7 0. For your guidance and compliance. <> Joyce Smith President Ce Concemed Officials cords File"
    },
    {
        "image": "memo2_synth_7_aug3.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines Institute of Lee West Carl OFFICE OF THE PRESIDENT 2020 07 24 MEMORANDUM NO 339 -2003 To Dean of the College of Business Administration Faculty of Architecture FROM and Design sueect Work Immersion Orientation for Grade 12 Students 1 0. The Principal s Office wishes to inform all Grade 12 students that the Work Heater ey rientation il be held on ebay 2. _2 0. Attendance is compulsory as this event will provide important guidelines and industry instructions. 3 0. Representatives from partner companies will discuss workplace conduct and expectations. 4 0. Students must wear proper uniforms and bring notebooks for important notes. 5 0. Teachers are requested to accompany their advisory classes during the orientation. 6 0. Your punctuality and cooperation are highly appreciated. 7 0. For your guidance and compliance. a Joyce Smith President Ce Concemed Officials Records: File"
    },
    {
        "image": "memo2_synth_7_aug4.png",
        "label": "memo",
        "ocr_text": "insti tute of Lee West Carl FTBEP RESHIENT OFFICE O 2020 07 24 MEMORANDUM NO332 2008 Dean of the College of Business TS Administr ration FROM ‘ £6 suevesy Work immersion n Orientation for GI rade 12 students ice wishe 3 to inform all Grade 12 students that the nel an Octane’ 2 9. Aitencance is ation ji be provide important dg gh @s and “GUSTY A discuss Work pu jeri, will p ins etfuc sin Ae sontall from paniner companies netic’ i and axpectations. AY ‘9, Students must proper uniforms and bring notebo SOKS for mportant notes. 5 0. Teachers are, requested [6 pany their advis lasses during the orientation. 6 0. Your punciuadly ang cooper nigh ty appreciated. 7 0. For your"
    },
    {
        "image": "memo2_synth_7_aug5.png",
        "label": "memo",
        "ocr_text": "Repub institute of Lee the Philippines OFFICE OF THE PRESIDENT 2020 07 24 MEMORANDUM NO999 2003 10 Dean of ihe College of Business Agministration FROM meses’ “Work Immersion Orientation for Grade tudents 1 9. The Princinal s Office wishes to inform all Grade 12 students that the Work Immersion Orientation will be held on October 30, 2 0. Attendance is compulsory as this event wil provide important guidelines and industry instructions. 3 0. Representatives from partner companies will discuss workplace conduct and expecta’ Students must wear proper uniforms and bring notebooks for important notes. 5 0. Teachers are requested fo accompany their advisory classes during the orientation. 6 0. Your punctuality and cooperation are highly appreciated. 7 0. For your guidance and compliance. f Joyce Smith f"
    },
    {
        "image": "memo2_synth_8_aug1.png",
        "label": "memo",
        "ocr_text": "Univ orsity of Effect East Karen THE, PRESIDE NT 1972 06 02 MEMORANDUM NO23Q 198 90 Director of Student Affairs FROM culty of A ana Science SUBJECT Annual Foundation Day Celebration ad to announce t the 2 0. Ths years Cats ine upcoming eme 's 4 9. The school administration is please Foundation Day Celebration of December 6 2 ‘Celebrating E xcellence ang Unity. 3 0. Depart prer rel pre exis its, and Pp orformances. ALC nd th b g their as igned attire 5. Qo ions wit be d de during the clo ing cereme any 6 0. ven th ro and pric Letu 7 9. Nicole Wagnel Pragident"
    },
    {
        "image": "memo2_synth_8_aug2.png",
        "label": "memo",
        "ocr_text": "Univ ersity of Effect East Karen OFFICE OF THE PRESIDENT 1972 06 02 MEMORANDUM NO939 1990 ee sae of Student Affairs FROM SUBJECT istration is pleasec rat on On scember 6 4, 0. Fot tngation ‘Day y ‘Celebrating Exce ier re preset atten d the par ipet tion s will b rate our s school s ac aeverents n your guidance and ‘com ounce the upcoming This year s S theme 5 6 fet"
    },
    {
        "image": "memo2_synth_8_aug3.png",
        "label": "memo",
        "ocr_text": "University of Effect Easi Karen OFFICE OF THE PRESIDENT 1972 06 02 MEMORANOUM NOp39 -1990 Director of Student Affairs FROM Facuily of Arts and Sclences TO ——— Annual Foundation Day Celebration 4 0. The school administration is pleased to announce the upcaming Ray ation D r n Der ar Thi aria t ais Foundation Day Celebration on December 6. 2 0. This year s theme is ‘Celebrating Excellence and Unity.’ 3 0. Departments are encouraged to prepare presentations, exhibits, and performances. 4 0. Students must attend the parade wearing their assigned attire. 5 0. Winners competitions will be recognized during the closing ceremony. 6 0, Let us celebrate our school s fevemenis with enthusiasm and pride. 7 0. For your guidance and compliance."
    },
    {
        "image": "memo2_synth_8_aug4.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines University of Effect East Karen OFFICE OF THE PRESIDENT 1972 06 02 MEMORANDUM NO 939 -1999 To FROM SUBJECT Director of Student Affairs Faculty of Arts and Sciences Annual Foundation Day 1 0. The schoo Foundation Day Celebration on December 6. 2 0. This Celebrating Excellence i Ce Concemed Officials Records File Celebration administ ration is pleased to announce the upcomin i year s theme is ~~ Nicole Wagner President aa"
    },
    {
        "image": "memo2_synth_8_aug5.png",
        "label": "memo",
        "ocr_text": "Republic the University of Effect East Karen OFFICE GF THE PRESIDENT 1972 06 02 MEMGRANSUM NO23p -1990 ie Director of Student Affairs FROM Facuity of Arts and Sciences Annual Foundation Day Celebration SUBJECT 1 0. The school administration is pleased to announce the upcoming Foundation Day Celebration on December 6. 2 0. This year s therne is ‘Celebrating Excellence and Unity.\" 3 0. Departments aré encouraged to prepare presentations, exhibits. and performances. 4 0. Students must attend the parade wearing their assigned attire. 5 0. Winners of competitions will be recognized during the closing ceremony. 6 0. Let us celebrate our school s achievements with enthusiasm and gride. 7 0. For your guidance and compliance, Nicole Wagner Presidant -"
    },
    {
        "image": "memo2_synth_9_aug1.png",
        "label": "memo",
        "ocr_text": "Troy MEMORANDUM NO508 “19 U8 -7U TO FROM SUB. Fire Safety Training and &88 Prograrn 1 6 The Human OFfice ann Safely Training wilt with the Bureau of for outd the schoot s $¢ ve 5 id con ay"
    },
    {
        "image": "memo2_synth_9_aug2.png",
        "label": "memo",
        "ocr_text": "Republic of the Philippines University of Troy West Brett OFFICE OF THE PRESIDENT 2006 04 14 MEMORANDUM NO508 4975 aan Director of Student Affairs FROM and Management SUBJECT Fire Safety Training and Awareness Program ounces that a Fire Safety Training will i if Fire 4 0. The Human Resource Office ann be conducted on October 22 in cooperation with the Bureau Protection. 2 9. Attendance is re uired for all teaching and non teaching personnel. 3 0. The training will inc ude lectures and hands on exercises On fire prevention. 4 0. Participants are advised to wear comfortable attire suitable for outdoor activities. 5 0. The goal of this program !S to strengthen the school s safety measures. ©.V. Ee 's active participation is highly encouraged. 7 0. For your guidance and compliance. Anita Gray President ce Concemed Officials Records Fie"
    },
    {
        "image": "memo2_synth_9_aug3.png",
        "label": "memo",
        "ocr_text": "Uni versity of 7 Troy West Brett OFFICE OF THE PRESIDENT 2006 04 14 MEMORANDUM NOS -1975 to Director of Student Affairs Facu' FROM and M SUBIECT Fire Safety Training and Awareness Program 4 0. The Human Resource Office announces that a Fire Safety Training will be conducted on October 22 in cooperation with the Bureau of Fire Protection. 2 0. Attendance uired all teaching and non teaching personnel. 3 6. The training wi iclude lectures and hands on e fire prevention. Participants are advised fo wear comiort table attir able for outdoor activi The goal of this program is to sit hool s safety m case 6 0, Everyone s active partici encouraged. 7 0. Fer your guidance and compliance. Anita Gray President"
    },
    {
        "image": "memo2_synth_9_aug4.png",
        "label": "memo",
        "ocr_text": "University of Troy West Brett OFFICE OF THE PRESIDENT 2006 04 14 MEMORANDUM NOsgg -1975 _ Director of Student Affairs FROM Fi Safety Training and ‘Awarenes S Program ire gately y raining wil required 13 6. The train wil include res and ha antion. 4 0 pants are ised to wear con e for outdoor activities. 5 0. The goal of this program is to streng Vs safety measures. 6 0. Everyone s active pariicipation is hic encouraged. 7 0. For your guidance and compliance. ce ©"
    },
    {
        "image": "memo2_synth_9_aug5.png",
        "label": "memo",
        "ocr_text": "Republic of Universi OFFICE OF THE PRESIDENT 2006 04 44 MEMORANDUM NOne 1075 tor of Student Affairs FRO S SUuBuECT Fire Safety Training and Awareness Program 1 0. The Suman Resource Office @nnounc be conducted On October that a Fire Safety T, ay Training will Operation with the Bureau re Protection, 2 6 Attendance 1 for all teaching and non- 1. 3 0. The train) i 2aching lectures and hands on &xercises on are advised to wear comfortable attira 5 0, Of this program is to strengthen es. 6 0. yone s active Participation is highly encouraged. 7 0. Far YOU guidance and compliance. 5 0 Anita Gray President"
    }
]