[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "minutes",
        "ocr_text": "tof Education 'S.¥. 2001 1998 SCHOOL MEETING At 9 00 AM, the Finance Committee gathered to deliberate on the budget for the next academic yea. The Accountant presented expenditure reports highlighting increased costs in utilities and maintenance, Dy. Santos proposed real ocating funds from travel to instructional materials. After discussion, the motion was approved. The committee also agreed io implement digital expense tracking to enhance transparency. A follow up meeting was set to finalize the new budget pian. The meeting ended at 10 45 AM. Department of Education"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 19 Division of South Stephanie District af LAKE iene Duarte, Page and Davis University 3.¥% 32001 1998 SCHOOL MEETING At 9 00 AM, the Finance Committee gathered to deliberate on the budget for the next academic year. The Accountant presented expenditure reports highlighting increased costs in utilities and paintenance Ur Santos proposed reallocating funds from travel _ to instructional materiais. After discussion, the motion was approved. The committee also agreed to impiement digital expense tracking to enhance transparency. A follow up meeting was set to finalize the new budget plan. The meeting ended at 10 45 AM. Department of Education"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 10 Division of South Stephanie District fam ba Eview rte, Page and Davis University s Y. :2001 1998 Dua’ SCHOOL MEETING At 9 00 AM, the Finance Committee gathered to deliberate on the budget for the next academic year. Th Accountant presen reports highlighting increased costs in utilities and painter rtund r. Santos ropose reallocating unds from travel _ to instructional materials. After discussion, the motion was approved. The committee also agreed to implement digital expense tracking to enhance transparency. A follow up meeting was set to finalize the new budget plan. The meeting ended at 10 45 AM Department of Education"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 16 Duarte, Page and 0 $.%. 2001 199 SCHOOL MEETING At 9 00 AM, the Finance Committee gathered to deliberate on the budget for the next academic year. The Accountant presented expenditure reports highlighting increased costs in utilities and maintenance Dr. Santos proposed realiocating unds from travel _ to instructional materials. After discussion, the motion was approved. The committee also agreed to implement digital expense tracking to enhance transparency. A follow up meeting was set to finalize the new budget plan. The meeting ended at 10 45 AM. Department of Education"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 10 Division of South Stephanie District of ,,bake Duarte, Page and Davis University S2001 1998 SCHOOL MEETING At 9 00 AM, the Finance Committee gathered to ‘deliberate on the budget for the next academic year. The Accountant presented expenditure. reports highlighting increased costs in utilities and maint sTe e3, Dr. Santos proposed reallocating funds from travel to instructional materials. After discussion, the motion was approved. The committee also agreed to implement digital expense tracking to enhance transparency. A follow up meeting was set to finalize the new budget plan. The meeting ended at 10 45 AM. Department of Education"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 3 Division of North Jeremyton District of +,N8Mna White, Gonzalez and Hernandez University S.¥. 31973 1974 SCHOOL MEETING The meeting commenced at 9 00 AM with the Dean welcoming all department chairs. The agenda focused on the preparation for the upcoming CHED program accreditation. Dr. Santos presented the updated self evaluation reports from each department. Several revisions were recommended, articularly in the area of student outcomes assessment, Ms. Dela Cruz vol nieered t consolidate the fir final ocument for submission committee agreed to as lize Lne'| report by next day. he meeting adjourned at 10 45 AM with allim members reminded their deliverables. Department of Education"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "minutes",
        "ocr_text": "Dapartm nent of Education sng 3 SCHOOL MEETING Them eeting commenced at 9 09 AM with the Dean welcoming all department chairs. The a enda focused on the Preparation for the Upcoming CHED Program accreditati ion. Dr. oantos presented the updated Self evaluation reports from each department Several revisions Were recommended, Particularly in the area of Student Oulcomes a assessment. f\\ S, a. vol inteered ‘9 Consolidate fhe final ocument for suby \"SSION T committee ih a9 eed to finalize the report by next Friday Th ne meeting adjourned at 10 45 9AM Afiith p gil emp ‘ers reminded al Ss Fs] les. Department of Education"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 3 Division of North Jeremyton District of +N Mnq White, Gonzalez and Hernandez University S.¥. :1973 1974 SCHOOL MEETING The meeting commenced at 9 00 AM with the Dean welcoming all department chairs. The agenda focused on the preparation for the upcoming CHED program accreditation. Dr. Santos presented the updated self evaluation reports from each department. Several revisions were recommended, articularly in the area of student outcomes assessment, Ms. Dela Cruz volunteered, to consolidate the final ocument for submission, The committee agreed to finalize the report by next Friday. The meeting adjourned at 10 45 AN with all mem we reminded Department of Education"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 3 Division of North Jeremyton District of +N8Mna White, Gonzalez and Hernandez University S.¥. 31973 1974 SCHOOL MEETING The meeting commenced at 9 00 AM with the Dean welcoming all department chairs. The agenda focused on the preparation for the upcoming CHED program accreditation. Dr. Santos presented the updated self evaluation reports from each department. Several revisions were recommended, articularly in the area of student outcomes assessment, Ms. Dela Cruz vol nieered t consolidate the fir final ocument for submission committee agreed to ons lize Lne'| report by next riday. Ho meeting adjourned at 10 45 AM with allim members reminded their deliverables. Department of Education"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 3 Division of North Jeremyton District of Weltind White, Gonzalez and Hernandez University 5 x. :1973 1974 SCHOOL MEETING Department of Education"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 19 Division of Wiast Rohert Austin Anlerson institute nw 2047 -~ 2002 SCHOOL MEETING The Research Committee meeting started at 1 30 PM with Dr. Cruz presiding. The members reviewed the list of approved faculty research proposals s for 2026 mplementation. Funding allocations were discussed, emphasizing priori ritization for studies aligned with institutional goals. Mr. es raised concerns about the del layed disbursement of previ ous grants. The Chair assured follow up with the Finance Office to expedite processing. The committee also planned a midyear research colloquium to snowcase ongoing studies. The meeting concluded at 3 10 Ba Department of Education"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "minutes",
        "ocr_text": "Department of Education Division of WWast Robert District ofMarkian Austin Anderson institute S Y. 2017 2002 SCHOOL MEETING The Research Committee meeting started at 1 30 PM with Dr. Cruz presiding. The members reviewed the list of approved faculty research proposals for 2026 implementation. Funding allocations were discussed, emphasizing orioritization for studies aligned with institutional goals. Mr. Reyes raised concems about the delayed disbursement of previous grants. The Chair assured follow up with the Finance Office to expedite processing. The committee also planned a midyear research colloguium to showcase ongoing studies. The meeting concluded at 3 10 Department of Education"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 16 Division of West Robert pistrict ofMarkton Austin Anderson institute S.¥. 2047 2002 SCHOOL MEETING The Research Committee meeting started at 1 30 PM with Dr. Cruz presiding. The members reviewed the list of approved faculty research proposals for 2026 implementation. Eunding allocations were discussed, emphasizing prioritization for studies aligned with institutional goals. Mr. Soe raised concems about the delayed isbursement of previous grants. The Chair assured follow up with the Finance Office to expedite processing. The committee also planned a midyear research colloquium to showcase ongoing studies. The meeting concluded at 3 10 Department of Education"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "minutes",
        "ocr_text": "Departmen nt of Edue ation Regi on 19 Division Wines Rohe; rt District oMarktey Austin Andersan Ing sii tute 201? ~ 2002 SCHOOL MEETING The Researc itlee meeting Started af 1 30 Pag y Cru iZ Presiding. The members revieu ey the list of Approved faculty research Proposals for 2026 implementation, Fun fe ING allocations were iSCussed, a zing Pri wont ‘zat eo tor Siudies aligned with in the Fin lance Office to 6 xpedite process; ing. The commi tee al te) 0 pian NNd am} idyear research co ploqui UM tO showeas ge! ng Studies, Th meeting conclude ‘di at 3 10 PM. Department oF Education"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 49 Division of Wast Rohert District of Markton Austin Anderson Institute S.% 2017 2002 SCHOOL MEETING The Research Committee meeting started at 1 30 PM with Dr. Cruz presiding. The members reviewed the list of approved faculty research proposals for 2026 implementation. Funding allocations were discussed, emphasizing prioritization for Studies aligned with institutional goals. Mr. Reyes raised concerns about the delayed isbursement of previous grants. The Chair assured follow up with the Finance Office to expedite processing. The committee also planned a midyear research colloquium to showcase on oing studies. The meeting concluded at 3 10 Department of Education"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 3 Lake Brooke rict of Port Jose Lopez, Biter and Lara College »2003 1964 SCHOOL MEETING The Student Affairs Comm ittee convened at 10 00 AM to dis cuss student disci pine and guidance interventions. Ms. Lopez presented the quarterly report showing a decrease in disciplinary cases. The committee highlighted the positive impact of the peer counseling program. Mr. Villanueva proposed expanding the mentoring initiative to first year students. The motion was unanimously approved. Plans for the upcoming student leadership training were also finalized. The meeting adjourned at 11 25 AM. Department of Education"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 3 Division of |gke Rraoke District of Port Jose Lopez, Ritter and Lara College S Y. 2003 1984 SCHOOL MEETING The Student Affairs Committee convened at 10 00 AM to alsese student discipline ana guidance interventions. Ms. Lopez presented the quarterly report showing a decrease in disciplinary cases. The committee highlighted the positive impact of the peer counseling program. Mr. Villanueva proposed expanding the mentoring initiative to first year students. The motion was unanimously approved. Plans for the upcoming student leadership training were also finalized. The meeting adjourned at 11 25 AM. Department of Education"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 3 Division of Lake Rranke Le Sigtrict of Port Jose Lopez, Ritter en Lara College ¥. 2003 1984 SCHOOL MEETING The Student Affairs Committee conven 9 00 OAM to a scuss student gat line and guidance interventions. Ms. Lopez presented the quarterly report showing 4 decrease in disci plinar cases. Fhe comm ittee highlighted the posit ve impact of the peer counsel ing program. Mr. Villar nueva proposed expanding the mentoring initiative to first year students. The motion was unanimously approved. Plans for the upcomi ing student leadership io training were also finalized. The! meeting adjourned at Department of Education"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 3 Division of Lake Rronke District of Pot Jose Lopez, Ritter and Lara College S.¥. 2003 1984 SCHOOL MEETING The Student Affairs Committee convened at 1 Toe AN to discuss student discipline and guidance interventions. Ms. Lopez presented the quarterly report showing a decrease in disciplinary cases. The committee highlighted the positive impact of the peer counseling program. Mr. Villanueva proposed expanding the mentoring initiative to first year students. The motion was unanimously approved. Plans for the upcoming student leadership training were also finalized. The meet aqjourned at Department of Education"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "minutes",
        "ocr_text": "Departrnent of Education Region 3 Division of Lake Rranke District of Port Jose Lopez, Ritter and Lara College 5.¥ 2003 1984 SCHOOL MEETING The Student Affairs Committee convened at 1 0 00 AM to discuss student discipline an guidance interventions. Ms. Lopez presented the quarterly report showing a decrease in disciplinary cases. The committee highlighted the positive impact of the peer counseling program. Mr. Villanueva proposed expanding the mentoring initiative to first year students. The motion was unanimously approved. Plans for the upcoming student leadership training were also finalized. The meeting adjourned at 11 25 AM. Department of Education"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 4 PVvisiorR6bertsoncheste District &rvstalville Mcfarland td Institute \"+2002 2014 SCHOOL MEETING esign and online teachi r INg. The members discussed Possible p ED for certificati an suggested conduct é 1NE proposal was acce will be im _ mMplemented next seme committee a ISO approved the b training materials. he meeting 0 15 AM. Department of Education artnerships with On Opportunities. Mr. nga ntify faculty training pted and ster. The udget for ended at"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 4 DiVIsIONRAbertsanchaster District Srystalville Mcfarland id institute SY 2002 2044 SCHOOL MEETING At 8 30 AM, the Faculty Development Committee gathered to finalize the schedule of upcoming training workshops. Dr. Mendoza presented the proposed lineup of facilitators for instructional design and online teaching. The members discussed possible partnerships with CHED for certification opportunities. Mr, Tan suggested conducting a pre assessment to identify faculty training needs. The proposal was accepted and will be implemented next semester. The committee also approved the budget for training materials. The meeting ended at 10 15 AM, Department of Education"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "minutes",
        "ocr_text": "artrment of Education nivisiorgebbertsonchester District erystatville Mefariand i td institute Dep SCHOOL MEETING At 8 30 AM, the Faculty Development Committee gathered to finalize tne schedule of upcoming training works Dr, Mendoza presente i the prof lineup of facilitators for instructional design and online teaching. The members discussed possible partnerships with CHED for certification opportunities. Mr. Tan suggested conducting 4 pre assessment to identify faculty training needs. The proposal was accepted anc will be implemented next semesier. The committee aiso approved the budget for training materials. The meeting ended at 10 15 A Department of Education"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 4 DivisionrR6bertsanchester District rvstalville Mcfarland td Institute S.¥. :2002 2014 SCHOOL MEETING At 8 30 AM, the Faculty Development Committee gathered to finalize the schedule of upcoming training workshops. Dr. Mendoza presented the propose lineup of facilitators for instructional design and online teaching. The members discussed possible partnerships with CHED for certification opportunities. Mr. Tan suggested conducting a pre assessment to identify faculty training needs. The proposal was accepted and will be implemented next semester. The committee also approved the budget for training materials. The meeting ended at 10 15 AM. Department of Education"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "minutes",
        "ocr_text": "Department of Region 4 OWwisionbertsonchester District Erystaivilie Mefarland td lnstitufe °%:2002 2014 ducation SCHOOL MEETING At 8 30 AM, the Faculty Development Commitiee gathered to finalize the schedule of Upcoming training workshops. Dr. Mendoza presenied the propose lineup of facilitators for instructional €sign and online teaching. The members discussed Possible partnerships with CHED for certification Opportunities. Mr. Tan Suggested conducting a pré assessment to identify faculty training neéds. The Proposal was accepted and will be implemented next semester. The committee also approved the budget for training materials. he meeting ended at 10 15 AM Department of Education"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "minutes",
        "ocr_text": "Department of Division of Education Region 11 New. Districthunaburah Austin and Sons S Y, 72009 University 2011 SCHOOL MEETING The meeting of the Libra ry Committee Ww S Called to prder at 2 00 P lOrarian in C ar recent acquisition of 7 Ye reported on the New electronic and e books. Th fore) gestion and Scheduled resources discussed Strategies to Increase student utilization of gj ital archives. M Proposed holding an Orientati On library databases Th approved the Sug It for November. Issues related to outdated physical Collect raised, T © meeting wa 3 20 PM. IONS were also S adjourned at M Department of Education"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 44 Districthunaburah Austin and Sans University 5% 2008 2014 SCHOOL MEETING The meeting of the Library Committee was Called to. order at 2 00 PM. The _iDrarlan in Charge reported on the recent acquisition of new electronic resources and e books. The group discussed Strategies to increase Student utilization of igital archives. Ms. Rivera Proposed holding an orientation series on library databases. The committee approved the suggestion and scheduled it for November. Issues related to ouldated physica collections were also raised. The meeting was adjourned at 3 20 PM Department of Education"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 144 Division of New Jacob _ Districthunaburah Austin and Sons University S.% :2009 2011 SCHOOL MEETING The meeting of the Library Committee ‘as called to order at 2 00 PM. T i roan in Charge resoried on ihe recent acquisition of new electronic resources and e books. The group discussed strategies to increase student utilization of digital archives. Ms. Rivera proposed holding an orientation series on library databases. The committee approved the suggestion and scheduled it for November. Issues related to outdated physical collections were also raised. The meeting was adjourned at 3 20 PM. Department of Education"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 44 Division of New .lacob Districthunaburah Austin and Sons University S Y. 2009 2011 SCHOOL MEETING The meeting of the Library Committee lled to order at 2 00 PM. The fi FARA In Cha ge esol on ihe recent acquisition of new electronic resources and e books. The group discussed strategies to increase student utilization of digital archives. Ms. Rivera proposed holding an orientation series on library databases. The committee approved the suggestion and scheduled it for November. Issues related to outdated physical collections were also raised. The meeting was adjourned at 3 20 PM. Department of Education"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 74 districthundburah Austin and Sons University SCHOGL MEETING The meeting of the Library Committee was called to order at 2 00 PM. The L_ibrarian in Charge reported on tne recent acquisition of new electronic resources and e books. The group discussed strategies to increase student utilization of digital archives. Ms. Rivera proposed holding an orientation series on library databases. The committee approved the suggestion and scheduled it for November. Issues related to outdated hysical collections were also raised. The meeting was adjourned at 3 20 PM. Department of Education"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "minutes",
        "ocr_text": "Department of Education Division Martin 11 OC Schoo} SCHOOL MEETING The College Council meeting began at 9 15 AM, presided over by the Dean. The main agenda covered the revision of the college mission and vision statements. Dr. Navarro presented proposed updates aligning them with institutional strategic goais. The members deliberated on phrasing and thematic consistency. After several revisions, the final version was approved unanimously. The Dean directed the Secretariat to prepare the formal document for dissemination. The meeting ended af 10 30 AM. Department of Education"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "minutes",
        "ocr_text": "Department of Education Regien 4 Division OF Distrigarnse Martini} C Se S.¥% 12076 1974 chester SCHOOL MEETING The College Council meeting began al 9 15 AM, presided over by the Dean. The main agenda covered the revision of the college mission and vision statements. Dr. Navarro presented roposed updates aligning them with institutional strategic goals. Ine members deliberated on phrasing and thematic consistency. After several revisions, the final version was approved tinanimously. The Dean directed the Secretariat to prepare the formal document for dissemination. The meeting ended at 10 30 AM. Department of Education"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 4 Division of cadehe th Distriayn sevchester Martin | C School S Y. :2010 1971 SCHOOL MEETING The College Council meeting began at 9 15 AM, presided over by the Dean. The main agenda covered the revision of the college mission and vision statements. Dr. Navarro presented proposed updates aligning them with institutional strategic goals. The members deliberated on phrasing and thematic consistency. After several revisions, the final version was approved unanimously. The Dean directed the Secretariat to prepare the formal d ent for dissemination. “the meeting ended at 10 30 AM Department of Education"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 4 Division of th distrRayinsevchesiear Martin 11 C School S.% 22010 1974 SCHOOL MEETING The College Council meeting began at 9 15 AM, presided over by the Dean. The main agenda covered the revision of the college mission and vision statements. Dr. Navarro presented proposed updates aligning them with institutional strategic goals. The members deliberated on phrasing and thematic consistency. After several revisions, the final version was approved unanimously. The Dean directed the Secretariat to prepare the formal document for dissemination. Tne meeting ended ait 10 30 AM. Department of Education"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 4 Distr aynsevchester Martin! 1 C Schoo! SCHOOL MEETING The College Council meeting began at 9 15 AM, presided over by the Dean. The main agenda covered the revision of the college mission and vision statements. Dr. Navarro presented proposed updates aligning them with institutional strategic goals. The members deliberated on phrasing and thematic consistency. After several revisions, the final version was approved unanimously. The Dean directed the Secretariat to prepare the formal document for dissemination. The meeting ended at 10 30 AM. Department of Education"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 44 Division of East Ambertown District of oy, Howell Group University S.% 54899 1976 SCHOOL MEETING The Administrative Committee met at 3 00 PM to discuss building maintenance concerns. Mr, Cruz from the Facilities Office reported issues with air conditioning units in several classrooms. The committee approved emergency repairs and requested immediate quotations from suppliers. A proposal to schedule routine inspections every quarter was raised and adopted. Ms. Reyes suggested a feedback mechanism for reporting facility issues. The plan will be implemented through the campus portal. The meeting was adjourned at 4 05 PM. Department of Education"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "minutes",
        "ocr_text": "Depariment of Education Regior noid Division of Ea ast An nbertown Dh je ia owel! NG false) Uni iversity irs g 1975 SCHOOL MEETING The Adminig ey yy Committee met ai 90 PM to di Iscuss building r. Cruz from mal nienance concen the rec! ilities Office reported issues Wil Crsonditioning units in several clagsrooms. The committee approve airs and requested amergency Fep: immediate quotations from suppliers. A proposal to sc chedule f routine inspections every ised and adopted. Ms. Reyes suggested a feedback mechanism f for reporting facility issues. The plan will be imple iemented through al. The meeting was the campus porta adjourned at 4 05 PM. Depart srant of Education"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 11 Division of East Ambertown District of ;,,New, Howell Group University S Y. :1999 1976 SCHOOL MEETING The Administrative Committ 2 00 O discuss ‘Building at Maintenance concerns. Mr. Cr the Facilities Office reported sev irom air conditioning units in several Classrooms. The committee approved emergency repairs and requested immediate quotations from suppliers. A Proposal to schedule routine inspections every quarter was raised and adopted. S. Neyes suggested a feedback mechanism for reporting facility issues. The plan will be implemented through the campus portal. The meeting was adjourned at 4 05 PM. Department of Education"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 14 Division of East Ambertown District of ch NEM ner Howell Group University S.¥. :4999 1976 SCHOOL MEETING The Administrative Committee met at 3 00 PM to discuss building maintenance_concerns. Mr, Cruz from the Facilities Office reported issues with air conditioning units in several classrooms. The committee approved emergency repairs and requested immediate quotations from suppliers. A proposal to schedule routine inspections every quarter was raised and adopted. Ms. Reyes suggested a feedback mechanism for reporting facility issues. The plan will be implemented through the campus portal. The meeting was adjourned at 4 05 PM. Department of Education"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "minutes",
        "ocr_text": "Depart ment of education Region 14 ok ‘Dist “ict of Ch Howell Group University 24999 1976 scHooL MEETING The eo mR istrative Committee met at 0 PM to discuss build ng nce concems. mail ERE the Facilities ‘Office reportec S air conditioning U units 3 rittee approve’ classrooms. The com nairs and re requester? emergency fet from suppliefs. immediate quotations roposal to schedule rou itine inspections 5 raised and adopted. every quarter rwa Ms. Reyes suggested a feedback orting facility issues. mechanic for rep ibe implementer through The plan will the campus portal. The meet ng was adjo ourned at 4: 05 PM. Department of Education"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "minutes",
        "ocr_text": "Department of Education vision of South Courtney SCHOOL MEETING The Extension Services Committee _ convened al 1 00 PM under the leadership of Dr. Garcia. The grou reviewed the evaluation results o community outreach projects. it was noted that participation from student organizations increased by 30%. Mr. Bautista suggested expanding partnerships with local government units. The proposal was supported, and a memorandum of agreement draft will be prepared. The committee also olanned a tree planting drive in November. The meeting conciuded ai 2 40 PM. Department of Education"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 3 Division of South Courtney District Mavidstad Turner 1 C School 5% :1990 1995 SCHOOL MEETIN The Extension convened G Services Committee 1 00 P der th leadership of bt Cane The’ x reviewed the eval rou ation results O community outreac projects: It was noted that Participation fr organizations increased Bautista Suggested e partnerships with local om student by 30%. Mr. xpanding government prepared. The committee also Planned a tree planting drive in November. The meetin ‘40 PM Department of Education 9 concluded at"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 3 Division South Courtney District Mavidstad Turner 11. School 5 7%. 34990 4995 SCHOOL MEETING The Extension Services Committee convened at ‘60 PM under the jeadersnip of UT. Garcia. The group reviewed the evaluation results O community outreach pro ects. li was noted that participation rom student organizations increased by 30%. Mr. Bautista suggested expanding partnerships with local government units. The proposal was supported, and 3 memorandum of agreement draft will be prepared. The committee also planned a tree planting drive in November. The meeting concluded at 9 40 PM. Department of Education"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "minutes",
        "ocr_text": "Department of Education Division of South Couriney District dhavidetaci Turner} iC School 3 654990 1995 SCHOOL MEETING The Extension Services Committee convened at 1 00 PM under the leadership of Dr. Garcia. The group reviewed the evaluation results of community outreach projects. it was noted that participation from student organizations increased by 30%. Mr. Bautista suggested expanding partnerships with local government units. The proposal was supported, and a memorandum of agreement craft will be prepared. The committee also planned a tree planting drive in November. The meeting concluded at 2 40 PM. Department of Education"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 3 Division of South Courtney District dJavidstad Turner | C School S.¥.: 1990 1995 SCHOOL MEETING The Extension pervices Committee convened at under the leadership of Dr. Garcia. The grou reviewed the evaluation results o community outreach projects. It was noted that participation from student organizations increased by 30%. Mr. Bautista suggested expanding partnerships with local government units. The proposal was supported, and a memorandum of agreement draft will be prepared. The committee also planned a tree planting drive in November. The meeting concluded at 2 40 PM. Department of Education"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "minutes",
        "ocr_text": "Department of Education Division of Doudiasview DistriDegonboroudh Cantrell Mav University SCHOOL MEETING The meeting of the Academic Council was held at 8 45 AM to review new course proposais. Dr. Ramos presented the revised curriculum for the Bachelor of Science in Computer Science program. Concerns about faculty qualifications for new electives were raised. [ne Dean assured that training wil be provided before implementation. The members voted unanimously to endorse the proposai to the Board of Trustees. Pians for curriculum mapping were also discussed. The meeting adjourned at 10 00 AM. Department of Education"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region 6 Division of Douqlasyi iew Distr i etonborouch Cantrel eee University 980 2023 SCHOOL MEETING The meeti ing of the Academic Council was held at 8 45 AM to review new course proposals Dr. R amos presented the revised curriculum for the Bachelor of Sci lence in Computer Science program. Concerns about faculty qualificati lons for new electives were laised. ap be D Dean assur id that training will be Provided before implementation. The members voted Unanimously to endorse the proposal to the Board of Trustees. Plans for curriculum mappi ng were also discussed. The meeting adjourned at 10 00 AM. Department of Education"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region Division of Douclasview DistridPefonberouah Cantrell Mav University 5.% 24980 2023 SCHOOL MEETING was held at 8 45 AM to reyiew new course proposals. Dr. Ramos presented the revised curriculum for the Bachelor of Science in Computer Science program. Concerns about faculty qualifications for new electives were raised. The Dean assured that training wil be provided before implementation. The members voted unanimously to endorse the proposal to the Board of Trustees. Plans for curriculum mapping were aiso discussed. The meeting adjourned at 10 00 AM. The meeting of the Academic Council Department of Education"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "minutes",
        "ocr_text": "Department of Education owen of Douciasview stridDegonborauan Cant ral Si M ay University S.% 4980 2023 SCHOOL MEETING The meeting of the Academic Council was held at 8 45 AM it) review new course proposais. Dr. Ramos presented the revised curriculum for the Bachelor of Science in Computer Science program. Concerns about faculty qualifications for new electives q were fal ised. i e Dean assu ured that _ training will be provided before implementation. Tne members voted unanimously to endorse the proposal to the Board of Trustees. Plans for curriculum mapping were also discussed. The meeting adjourned at 10 00 AM Department of Education"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "minutes",
        "ocr_text": "Department of Education Region Division ofDoudlasview DistridDe onborough Cantrell May University SCHOGL MEETING The meeting of the Academic Council was held at 8 45 AM {0 review new course proposals. Dr. Ramos presented the revised curriculum for the Bachelor of Science in Computer Science program. Concerns about faculty qualifications for new electives were raised. The Dean assur d that training will be provided before implementation. The members voted Unanimously to endorse the broposal to the Board of Trustees. Plans for curriculum mapping Were also discussed. The meeting adjourned at 10 00 AM. Department of Education"
    }
]