[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "minutes",
        "ocr_text": "Region 13 Division of Suh Massevland Bailey LLC University MINUTES OF MEETING orig, Republic of the Philippines F(] 2) Department of Education C Ske Research Ethics Board Review Session SCHOOL YEAR1973 1989 2004 02 06 A. MEMBERS IN ATTENDANCE Chiropodis Amv Tavlor Equities trader ndrea Perez Haematologis' Maria Campbell Automotive engineer Martin Decker B. MEMBERS NOT IN ATTENDANCE C CALL TO ORDER The, Research Ethics Board meeting was called to order at 2 30 PM under the leadership of Dr. Perez. D. APPROVAL OF MINUTES E. MEETING PROPER: The Quality Assurance Committee meeting began at 8 15 AM. Dr. Reyes presented the initial indings from the internal audit of academic processes. Several inconsistencies in documentation were identified. The committee agreed to conduct orientation sessions on proper Joven keeing. Ms. Lopez suggested developing a checklist for departmental compliance. The poeeee. was approved and will be implemented by next semester. The meeting concluded at 9 45 AM."
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "minutes",
        "ocr_text": "Fa atten, F Republic of the Philippines 7/ BY q F Department of Education 3 2 Region 13 te Division of $24 Massevland Bailey LLC University MINUTES OF MEETING Research Ethics Board Review Session SCHOOL YEAR1973 1989 2004 02 06 A. MEMBERS IN ATTENDANCE Chironodis Amv Tavilor Equities trader Andrea Perez Haematologist Maria Camonhell Automotive engineer Wartin Decker B. MEMBERS NOT IN ATTENDANCE C CALL TO ORDER The. Research Ethics Board meeting was called to order at 2 30 PM under the leadership of Dr. Perez. D. APPROVAL OF MINUTES —, MEETING PROPER: The Quality Assurance Committee meeting began at 8 15 AM. Dr. Reyes presented the initial findings from the internal audit of academic processes. Several inconsistencies in documentation were identified. The committee agreed to conduct orientation sessions on proper record keeping. Ms. Lopez suggested developing a checklist for departmental compliance. The proposal was approved and will be implemented by next semester. The meeting concluded at 9 45 AM."
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "minutes",
        "ocr_text": "Martin Decker 5. MEMSERS NOTIN ATTENDANCE CALL TO ORnER The Research E Board meeting wasc aA to order at 2 30 PM under the leadership of Dr. Perez. APPROVAL OF MINUTES E, MEETING SRopER: _ The Quality Assurance Committee meeting began at 8: SA i, Dr Re cresented the initial intern al audit of academic enta were id ntitiec The committee BC) EG condu ict one! on proper record- ‘Keeping. Ms LOPEZ Sugg sted developing a checklist for deparimental compliance. The proposal wes approved and wil be implemented by next semester. The 1 meeting concluded at 9 45 AM,"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "minutes",
        "ocr_text": ", Bailey Liv University MINUTES OF MEETING A, MERGERS IM ATTENDANCE Chiropodis Amv Tavinr Martin Dec! 5. MEMBERD NOT Od ATTENDANCE CALL TO O83ER The. Research Ethics Board meeting was called to order at 3 30 PM under the leadership of Dr. Perez. D. APPROVAL OF MAUTES E, MEBTING PROPER: The Quality Assurance Cornmittes meeting began at 8 15 AM. Dr. Reyes presented the intial findings from the internal audit of academic processes. Several inconsistencies in documentation were ideniified. The committee agreed 6 conduct orentation sessions on proper record keeping. Ms. Lopez suggested developing a checklist for deparimentar compliance. The proposal was approved and wil be implernenied by next semester, The meeting concluded at 9 45 AM,"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "minutes",
        "ocr_text": "260 A MEMBERS ay ATYENDANCE CALL TO ORoER The. Research ethics Board meeting was called t order at 2 30 PM under the leadership of Dr. Perez. O. APPROVAL oF RANUTES The Quality Assurance Committee Mestine began at 8 15AM. Or Reyes presented the inital findings from the internal audit of academic processes. Several inconsistencies in documentation were identified. The committee agreed to conduct orientation Sessions on proper record keeping. Ms, Lopez Suggested developing a checklist for deparimental compliance. The proposal was approved and will be implemented by next sernester. Tha meeting concluded at 9 45 AM."
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "minutes",
        "ocr_text": "cody Ray DANCE MENMERS Hot ATTEN Le] CALL TO ORDER g was called to order at 9 00 AM py ME Santos, Chairperson of ine Procurement Committes. p. APPROVAL OF MRITES The meeting of the Research Ethics Board started at 2 29 PM. Dr, Perez awed ihe, pending proposals for ethical Clearance. Bch study Was evaluated based on participant saiely and data canfidentiatity, One proposal was returned for revision due to incomplete consent JOpms. The co nifies relteraied adherence 10 insptwional ethics policies. ‘A traming Session On research integrity was scneduled for January. The meeting concluded at 4 00 PM."
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "minutes",
        "ocr_text": "ery Reputtc of tho Pheippres Ff AE Deparment of Education ‘9 & Ry 42 ale Drésion of 59, Jonestown Rodriguez Jordan University MINUTES OF MEETING Procurement Committee Reguiar Meeting SCHOOL YEAR 990 2011 2022 05 03 MEMBERS it ATTENDANCE Pharmacoloc Rethanv Mavis nsuancepae Jennifer Martin Health visitor John Kina Ctinical psychologist Cody Ray f MEMBERS NOT IR ATTENDANCE Cc CALL TO ORDER The meeting was called to order at 9 00 AM by Mr. Santos, Chairperson of the Procurement Committee. D. APPROVAL OF MINUTES —, MEETING PROPER: The meeting of the Research Ethics Board tarted at 2 30 PM. Dr, Perez reviewed enc ing Beso Mon gthical clearance. a siudy was evaluated based on participant safety and data confidentiality. One proposal was returned for revision due to incomplete consent _forms. The committee reiterated adherence to institutional ethics policies. A ten ae Session on research integrity was scheduled for January. The meeting concluded at 4 00 PM."
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "minutes",
        "ocr_text": "gta? 4 Republic of the Philippines ‘/- a 3 F Department of Education t c p); a Region 12 Cae Nant Division of Sut Jonestown Rodriguez Jordan University MINUTES OF MEETING Procurement Committee Regular Meeting SCHOOL YEAR1999 2011 2022 05 03 A. MEMBERS IN ATTENDANCE Pharmacoloc Rethanyv Davis Insurance broker Jennifer Martin Health visitor John Kina Clinical psychologist Cody Ray B. MEMBERS NOTIN ATTENDANCE C CALL TO ORDER The meeting was called to order at 9 00 AM by Mr. Santos, Chairperson of the Procurement Committee. APPROVAL OF MINUTES MEETING PROPER: The meeting of the Research Ethics Board Started at 2 30 fo Dr ferez geyiewed the ending proposals for ethica clearance. Each Study was evaluated based on Participant Safety and data confidentiality. One Prop returned for revision due to incomplete consent forms. The semmitt reiterated adherence to Institutional ethics policies. A training session on research integrity was scheduled for January. The meeting concluded at 4 00 PM."
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "minutes",
        "ocr_text": "# AMS ot an University TEE SY nace sient nian St semen serene sonnet MINUTES OF MEETING y Meeting Procu MEMBERS NOTH ATTENOARCE G CALL TO ORSER The meeting was called to order at 9 00 AM by Mr. Santos, Chairperson of the Procurement Committee. D. APPROVAL OF MINUTES The meeting of the Research Ethics Board started at 239 PM. Or, Perez reviewed the, pending proposals for ethical clearance. Each study Was evaligied based on parlicipant safety and data confidentiality, One propas iwas returned for revision due to incomplete consent ‘forms. The commities reiterate i adherence to ingdtulional ethics policies. A waihing session on research integrity was scheduled for January. The mesting concluded at 4 00 PM."
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "minutes",
        "ocr_text": "i iAney, Republic of the Philippines i, “e (og) ad Department of Education 2. Jonestown Rodriguez Jordan University MINUTES OF MEETING Procurement Committee Regular Meeting SCHOOL YEAR1990 -2011 2022 05 03 a. MEMBERS IN ATTENDANCE Pharmacoloc Rethanv Navis Insurance broker Jennifer Martin Health visitor John Kina Clinical psychotog st Cody Ray B MEMBERS NOT IN ATTENDANCE c CALL TO ORDER The meeting was called to order at 9 00 AM by ME Santos, Procurement Chairperson of the Committee. D. APPROVAL OF MINUTES —. MEETING PROPER: The meeting of the Research Ethics Board started at 2 30 eM. Dr. Perez reviewe ending proposa s for ethica clearance. ach study was evaluated based on participant safety and data confidentiality. One pro osal was returned for revision aue to incomplete consent “fOr The Cc mmittee reiterated adherence to institutiona’ ethics policies. A training session on i ed for January. research integrity was schedul The meeting concluded at 4 00 P"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "minutes",
        "ocr_text": "Guailit t oO Stenhanie Garva G. MESBHRS NOT IW ATTERGANCE CALL TO ohoER The session was opened at 8 15 AM with Dr. Reyes presiding over the Quality Assurance Committee. G. APPROVAL DF TES E. MERYiR PROPER: AMP GHidaneg, Oftice team Eyres een wellness survey. Ms. Femandez reported an increase in counseling attendance. Dr, Villanueva emphasized the impartance of stress management programs during exam weeks. The group agreed to pilot a mental health awareness campaign. Partnerships with psychology interns from nearby universities were also explored. The meeting ended at 17 40 AM,"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "minutes",
        "ocr_text": "Hunter Horn 8. MEMBERS NOT WW ATTENDANCE CALL TO ORDER The session was opened at 6 15 AM with Dr. Reyes presiding over the Quality Assurance Committee. 0. APPROVAL OF SENUTES The Guidance Office team convened at 10 15 AM fo discuss the results of the midyear student wellness survey. Ms. Fernandez reported an increase in counseling attendance. Dr. Villanueva emphasized the lmportance of stress management programs during exam weeks. The group agreed io pilot a mental health awareness campaign. Partnerships with psycnclogy interns from nearby universities were also explored. The meeting ended at 17 40 AM."
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "minutes",
        "ocr_text": "MINUTES OF MEETING Quality A A. MEMBERS IN ATTENDANCE Phytotherap Stenhanie Garza o i ter Word eter Wood Charla Riark Hunter Horn MD Cc GALL TO ORnER The session was opened at 8 15 AM with Dr. Reyes presiding over the Quality Assurance Committee. D. SPPROVAL OF MINUTES E. MERTING PROPER: The Guide ce ine ned at G5 wellness survey. Ms. Fernandez reported an increase in counseling attendance. Dr. Villanueva emphasized the importance of stress management programs curing exam weeks. The group agreed to pilot a menial health awareness campaign. Partnerships with psychology interns from nearby universities were also explored. The meeting ended at 11 40 AM."
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "minutes",
        "ocr_text": "&, 8. Cc &. MEMBERS IN ATTENDANCE MEMBERS MONT Bg AMEMBANgE CALL TO ORDER The session was opened at 6 15 AM with Dr. Rayes presiding over the Quality Assurance Committee. APPROVAL GF MITES BEEING PeOpER: (he Guidance Office team gonvened at 10 15 AM fo discuss tha résul s of the midyear student wellness survey. Ms. Fernandez reported an increase in counseling attendance. Dr. Villanueva emphasized the importance of stress Management programs during exam weeks. The Group agreed tc pilot a mental health awareness campaign. Parinerships with psychology Interns from nearby universities were also explored. The meeting ended af 11 40 AM."
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "minutes",
        "ocr_text": "ory Republic of the Philippines F/ (= Department of Education Region 12 Sole Division steccaside Port Brookechester Smith Hall Academ MINUTES OF MEETING Quality Assurance Committee Session SCHOOL YEAR2016 1999 1986 02 03 A. MEMBERS IN ATTENDANCE Phytotherapn Stenhanie Garza Optometrist Peter Wood Dance movement pychateraghr Charlac Rlark Hunter Horn MD 8. MEMBERS NOTIN ATTENDANCE Sport and exercise Psychologist C CALL TO ORDER The session Was Opened at 8 15 M with Dr. Reyes presiding Over the Quality Assurance Committee. D. APPROVAL oF MINUTES E. MEETING PROPER: Guidance Offi ae, discuss the resuee fie midyest 10 13 4 Wellness surve Ms. Fernandez reported an increase in cou weeks. 3 mental health awareness Campaign. Partnerships with psycholo Y interns i were also explored. The meeting ended at 11 40 A"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "minutes",
        "ocr_text": "ory Republic of the Philippines F/ | Department of Education F Region 4 aA Disision of ake, “si Nicholasside Craig Ltd College MINUTES OF MEETING Admissions Commi ttee Policy Review SCHOOL YEA\\ R1983 2001 1995 02 03 MEMBERS IN ATTENDANCE pagggaurant Michelle Merarty Ranger warden Nicole Sandoval Financial planner Cynthia Moreno Melinda Ross MEMBERS NoT IN ATTENDANCE Sports administrator C CALL TO ORDER At exactly 2 00 PM, Ms. amos. Called the Admissions ommittee meeting to order APPROVAL OF MINUTES MEETING PROPER: Co System upgrades for the university network. Mr. OpeZz presented findin Causing connectivity issues. Th approved the purcha remaining funds from last s cybersecurity awareness sem Proposed for both staff and s Aquino volunte Schedule. The emester. A Inar was also students. Ms. ered to organize the tra ming, meeting adjourned at 2 35 PM."
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "minutes",
        "ocr_text": "5. MEMBERS NOT gy 4 GALL TO CRORE AMOS ca ommittee me APPROVAL OF POITES BERTING PROPER: At 1 00 PM, th etT Commi System upgrades for the u Lopez presented findings causing connectivity issues. The c approved the p urcnase of remaining funds from cybersecurity Aquino volunt schedule. The meeting awareness seminar proposed for bo ered fo of Lf PH} nda Ross lee met to evaluate niversity network. Mr. oF Guidated routers Ae committee new hardware using last semester. A Was also ih staff and students. Ms. ganize the 7 aning Mi. adjourned at 2 35 P"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "minutes",
        "ocr_text": "1083 26 Cynt Meiinda Ross 8. WAMMERS NOT IM ATTeNtancE C CALL TO ORDER At exactly 2 00 PM, Ms. amos, calied the Admissions fommittee meeting to order. D. APPROVAL OF MNUTES E, MEETING PROPER: At 4 00 PM, the IT Committee met to evaluate sysiem upgrades for the university network. Mr. Lopez presented findings on outdated routers approved the purchase of new hardware using remaining funds from last sernester. A cybersecurily awareness seminar was also proposed for both staff and students. Ms. Aquino volunteered to organize the training schedule. The meeting adiourned at 2 35 PR."
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "minutes",
        "ocr_text": "8 Lom E Mareno a Ross At exactly 2 00 PM, Ms. Ramos. called the Admissions ommittee meeting to order. SEPROVAL OF MINUTES MEETING PROPER: At 4 00 PM, the IT Committee met to evaluate sysiem upgrades for the university network. Mr. Lopez presented findings on outdated routers causing connectivity issues, The committee approved the purchase of new hardware using remaining funds from last semester A cybersecurity awareness Seminar was also proposed for both staff and Students. Ms. Aquino volunteered to organize the training schedule. The meeting adjourned at 2 35 PM."
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "minutes",
        "ocr_text": "Region Division of 42 s, Nicholasside Craig Ltd College Caan Republic of the Philippines (BS Department of Education c p); Nae” MINUTES OF MEETING Admissions Committee Policy Review SCHOOL YEAR1983 2001 1995 02 03 A. MEMBERS IN ATTENDANCE Fasttoeesee=\" Michelle Mccartv Rangerwarden Nicole Sandoval Financial planner’ Cynthia Moreno sports administrator Malinda Ross B. MEMBERS NOT IN ATTENDANCE C CALLTO ORDER At exactly 2 00 PM, Ms. amos. called the Admissions ommittee meeting to order D. APPROVAL OF MINUTES —, MEETING PROPER: At 1 00 PM, the IT Committee met to evaluate system upgrades for the university network. Mr. opez presented findings on outdated routers causing connectivity issues. The committee approved the purchase of new hardware using remaining funds from last semester. A cybersecurity awareness seminar was also proposed for both staff and students. Ms. Aquino volunteered to organize the training, schedule. The meeting adjourned at 2 35 PM."
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "minutes",
        "ocr_text": "MINUTES OF MEETING Publicati MEMBENS NOTIN ATTENDANCE The Publication, Board meeting was 0 fici ially opened at 1 45 PM by Dr. Fernandez. APPROVAL OF MEMUTES BRETING PROPER: Fi pie Evaluation Cormmittee meeting began AM. Dr. Ramos presented ihe performance tings from the previous semes ster, Several departments showed notable j improvements in g effec’ livene ness. Mr. Bautista recommended recogni iop pe erforming faculty during the recognition day. The commitfee supported the unanimously Plans to revise the aiuatl instrument for better objectivity were also discussed. The meeting pee adjourned at 11 00 i"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "minutes",
        "ocr_text": "if \\E 2 ‘Hematickschester 7 Samuelborough Wu Inc Institute MINUTES OF MEETING Publication Board Editorial P| SCHOOL YEAR1988 2003 04 22 lanning Meeting 2006 A. MEMBERS IN ATTENDANCE Christonher Price Charles Sanchez eer, site Marv Rallard Editor, azine wi\" Alexander Meza 8. MEMBERS NOT IN ATTENDANCE C CALL TO ORDER The ruiblication Oard meeting was official yY Opened at 1 45 PM by Dr. Fernandez. O. APPROVAL OF MINUTES MEETING PROPER: The Faculty Evaluation Committee meeting began at 9 30 AM: Dr. Ramos presented the performance ratings from the previous semester. Several departments showed notable improvements in teaching effectiveness. Mr. Bautista recommended recognizing top performing faculty during the recognition day. The committee supported the idea unanimously. Plans to revise the evaluation instrument for better objectivity were also discussed. The meeting was adjourned at 11 00"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "minutes",
        "ocr_text": "a, ning, fe Republic of the Philippines F 4 &) : i Department of Education C a ed Region 12 se Divistematickschester Samuelborouah Wu Inc Institute MINUTES OF MEETING Publication Board Editorial Planning Meeting SCHOOL YEAR1988 2006 2003 04 22 MEMBERS IN ATTENDANCE mert lallicar Christanher Price Company see\" Charles Sanchez Engineer, site Marv Rallard Editor, magazine “ceues\"\"* ~~ Alexander Meza MEMBERS NOT IN ATTENDANCE CALL TO ORDER The Publication, Board meeting was officially opened at 1 45 PM by Dr. Fernandez. APPROVAL OF MINUTES MEETING PROPER: The Faculty Evaluation Committee meeting began at 9 30 AM. Dr. Ramos presented the performance ratings from the previous semester. Several departments showed notable improvements in teaching effectiveness. Mr. Bautista recommended recognizing top performing faculty during the recognition day. The committee supported the idea unanimously. Plans to revise the evaluation instrument for better objectivity were also discussed. The meeting was adjourned at 11 00"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "minutes",
        "ocr_text": "A MINUTES OF MEETING Public red Alexander Meza C28 recognition day. The comm 8 MEMBERS NOT iN ATTENDANCE CALL TO ORDER The Publication Board meeting was officially opened at 1 45 PM by Dr. Fernandez. APPROVAL OF MINUTES MEETING PROPER: The Faculty Evaluation Committee r no began at 9 30 AM. Dr. Ramos presented the performance ralings from the previous semester. Several departments showed notable improvements teaching cliveness. Mr, Bautista recommended recognizing top performing faculty during the Be Supported the idea unanimously. Plans to revise the evaluation instrument for better objectivity were alsa The meeting was adjourned at 17 00 AM."
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "minutes",
        "ocr_text": "weHeinahckschester Samuelborouah Wu Inc Institute MINUTES OF MEETING Publication Board Editorial Planning Meeting SCHOOL YEAR1988 2006 2003 04 22 MEMBERS IN ATTENDANCE morBel2icer Christanher Price mene) Charles Sanchez Engineer, site Marv Rallard fea Alexander Meza MEMBERS NOT IN ATTENDANCE CALL TO ORDER The Publication oard meeting was officially opened at 1 45 PM by Dr. Fernandez. APPROVAL OF MINUTES MEETING PROPER: The Faculty Evaluation Committee meeting began at 9 30 AM. Dr. Ramos presented the performance ratings from the previous semester. Several departments showed notable improvements in teaching effectiveness. Mr. Bautista recommended recognizing top performing faculty during the recognition day. The committee supported the idea unanimously. Plans to revise the evaluation instrument for better objectivity were also discussed. The meeting Wwas adjourned at 11 00"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "minutes",
        "ocr_text": "ie, j Republic of the Philippines F/ 2 AY 2 Department of Education p) eX y Region 5 Sta mea Diisitreborvhaven East Ashley Ellison, Hernandez and Williams Institute MINUTES OF MEETING Environmental Management Committee Assembly SCHOOL YEAR2014 1999 2007 12 13 A. MEMBERS IN ATTENDANCE metal Anaela Pearson Tees! Suzanne Duos Industrial product designer Jacob Perry Horticuttural therapist Lisa Jones B. MEMBERS NOTIN ATTENDANCE C CALL TO ORDER The Environmental Management Committee meeting was called to order £8 30 A with Mr. Dela Cruz lea Ing the session. D. APPROVAL OF MINUTES —. MEETING PROPER: Th ni Relati Committee c d at 3 00 PMT see preparatmites co the annul committee approved the final program flow and logistics nnnagements. A proposal to establish an alumni sc olarship fund was raised and shgorsed. pr. Cruz yolunteered to draft the Policy guidelines for the sc olarship. The meeting concluded at 4 30 PM."
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "minutes",
        "ocr_text": "nscoinbly Assembly Environmental Mana: SCH. A. MENBERS tH ATTENDANCE Annela Pearson yzanne Duarte ab PF MEGRERS ROT BYTERDANCE B. C CALL TO ORDER The Environmental Management Comma meen was calle to order at 8 30 A with Mr. Dela Efiz leading the session. 2. APPROVAL OF MINUTES MEETIRG PROPER: The Aus! relations Committee convened at, 3 00 PM to ciscuss preparations for the annual homecoming event. Ms. Torres presented the ligt of confirmed attendees and Sponsorships. The commities approved the final program flow and logistics arrangements. A proposal to establish an alurmn scholarship fund was raised and endorsed. Dr. Cruz yolunieered to di ft the policy guicenne for the scnelarship. ise meeting concluded at 4 30 PM."
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "minutes",
        "ocr_text": "3 ATTENDSRCE é fq Pee Lisa a. MEMBEHS WOT ag RETERGANCE 2 Gaus TE ORDER The Environmental Management was calle Commitiee meeting 18 3 with Mr. to order at 8: A Dela Cruz leading the session. APPROVAL OF ONUTES MEETING pROrEE: abe Ajunant Relations Commiltee, convened at 4 00 PM to discuss preparations for ine annual homecoming event. Ms. Torres presented tne ygt of confirmed attendees and sponsorships. The committee approved ine final program How and logistics arrary jements. A proposal fo establish an alumni scholarship fund Was raised and e dorsed. pe Cruz oluriesred te drat n policy guide ines for ine gonoiarsnip. 1 meeting concluded at 4 30 PM."
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "minutes",
        "ocr_text": "MANUTES OF MEETING Envire ATTENDANCE Annela Pearsan ane Duane J Par Jones rs ATTENDANDE MEMBERS ie A 3. eewaRas S GALL TC ORDER The Envi ronmental Management Cc omm! ittee meeting was calle 8 30 AM Ww jth Mr. tg order at Dela Cruz ieacl ng the tO Sion. APPROVAL Ge MNUTES 5, MEETING PROPER: ons Coramities, convened at fot ine Ss annual resentee the The A Relat 3 06 BuO (discuss f prepa: aralions 0 bomin ngeé event. jist of confirm eG altendees anc The corm tee approve and logistics 2 i rangeme! nts. \"A esa ship establish an lumai gcnola dG. Dr. Cruz yolunt teer hole and endorse. nes for ine 5¢ poucy oul jen meeting concluded &"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "minutes",
        "ocr_text": "MINUTE A o MEMSERg Ney iN AUTENG ANCE CALL To ORDER APPROVAL oF MMU TES MEETING PROPER, Stations Comrnities iSCUSS preparatio ing event, Ms. confirmed a he cOommite k and logistics gr &Stablish an aluy and Sheereed F Sonvened at Ons forthe” annual &S presented ne 23 and Spo. oO ora ‘oved the final’ an ements Apr Clarshi IB fund was raised Dr. Cruz yor Gieered tod git the Policy guide IGS Tor the sohy lolarsh Up. Phe meeting o concluded al 4 30 PY."
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "minutes",
        "ocr_text": "8 MEMBERS MOT in ATTENDANCE CALL TO ORDER ne Alumni, Relations Com mmines meeting commenced at 3 00 PM, presided over by Ms. Torres. APPROVAL OF MINUTES MEETING PROPER: e Enviro nmental Manage ement carnmit ttee eting tarted at 8 36 AM. Mr. Dela Cruz reported ont initiative. The gF° reduce energy consul buiidl vale pre fthe campus recycling 5 furth The conv Ted of soliay panels reed fo conauct ty. i Pi ians for an oar Day ebration were ‘also outlined. The 10 00 AM. 1g 2 adjourned ai‘"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "minutes",
        "ocr_text": "reine Republic of the Philippines (= Department of Education C y) Region 3 Sas Division of }aks South Carrie Hood Inc School MINUTES OF MEETING Alumni Relations Committee Coordination Meeting SCHOOL YEAR1996 2001 1971 03 07 A. MEMBERS IN ATTENDANCE miscumiaté Seat \\Mhite “Danielle Gibson lity scientist Currtic Rlake Sales executive Walter Mcdaniel B. MEMBERS NOTIN ATTENDANCE C CALL TO ORDER The Alumni Relations Committee meeting commenced at 3 00 PM, presided over by Ms. Torres. D. APPROVAL OF MINUTES —, MEETING PROPER: The Environmental Pera Committee meeting started at 8 30 AM. Mr. Dela Cruz reported on the success of the campus recycling initiative. The group discussed ways to further reduce energy consumption in academic buildings. Dr. Navarro ee the installation of solar panels in select facilities. The committee agreed to conduct a feasibility study. Plans for an arth Day celebration were also outlined. The meeting adjourned at 10 00 AM."
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "minutes",
        "ocr_text": "MINUTES OF MEETING Alumni Relatio: A Curtis: Walter Meda B. MEMBERS NOT IN ATTENDANCE GALL TO GRDER The Alumni Relations Committee meeting commenced at 3 00 PM, presided over by Ms. Torres. DB. APPROVAL OF MINUTES —, MEETING PROPER: The Environmental Management Committee meeting started at 8 30 AM. Mr. Dela Cruz. reported on the success of ihe campus recycling initiative. The group discussed ways to further reduce energy consumption in academic. buildings. Dr. Navarro propesed the installation of solar panels in select facilities. The committee agreed to conduct a feasibility study. Plans for an ‘Earth Day celebration were also oullined. The meeting adjourned at 10 00 AM."
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "minutes",
        "ocr_text": "MINUTES of MEETING fg RS is ATTEND AMEE a Sent Wii Curtis Rave Walter Medaniej 8. MEMBERS miyr WATIERND ANCE The Alumni Rel Commitiea meetin at 3 00 Ply ations g commenced “t, Presided over by 8. Torres. 5. APPRova: or MINUTES EB Meets SROPER, The Environm iental Mana Ement Committes Meeting started af 8 30 AM. Mr Dela Cruz reported on the SUCCESS of fh initiative. Th Campus recycling group discussed Ways to further reduce energy consumption in academic buildings. Dy. Navarro Proposed the installation of solar Panels in select facilities. The Committes agreed to conduct a feasibility Study. Plans for an Earth Day Célebratian Were also outlined. The Meeting adjourned at 10 00 AM."
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "minutes",
        "ocr_text": "AMAWUTES OF MEETING rdination Meeting MEMBERS were ce reNANE 6 CAL TS oenER jumni Ret elations Co mmitee meeting comme need at 3: 00 PM, presided over Ms. Torres. ppenaval OF HUTES &. SARE TING PROPER: The E nvironmental Management Commitiee meeting started at 30. AM. Mr. Dela om, i pores on the success of the campus recycling iative. The group p discu ased ways tO further M redu ioe energy C consumplion if in academic. lidings. Or, Navarro Prop. at he installation The committee of solar panels in se ci facilities. a feasibility St tudy. Pians for an agreed 10 conduct Earth Day nerebratio on were also outined. The meeting adjourned 4 at 10 00 AM. bu"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "minutes",
        "ocr_text": "Faculty Evaluation Com oie, Republic of the Philippines F/ a Department of Education Region 1 A DIMSION Fat ig Ss Lake Monicachester Nelson PLC Universi MINUTES OF MEETING mittee Deliberation SCHOOL YEAR291g 2014 2003 10 08 A. MEMBERS IN ATTENDANCE Pension scheme si manager Rrian Vader Bookseller Kaylee Nichols Programmer, systems 4 Payehlogis counseling Ja B. C CALL TO ORDER to finalize the Flizaheth Evang mes Curtis MEMBERS NoT IN ATTENDANCE The Faculty Evaluation Committee rego Was called to order at 9 30 AM by Dr. Ramos. APPROVAL OF MINUTES 9 MEETING PRopER: At 2 00 PM the Admissi ons Committee met Screening guidelines for new applicants. Ms Ramos Presented Proposed adjustments to the e meeting co /ISed process will next admission cycle. The ncluded at 3 15 PM."
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "minutes",
        "ocr_text": "§ iN ATTENOAN ris cE fe c CALL TO ORDER The Faculty Evaluation Cormmillee meeting Was called to order at 9 30 AM by Dr. Ramos. APPROVAL OF MINUTES ce MEETING PROPER: Phi, the Admissions. Committee met guidelines for new At 2 00 F to finalize tne screening i ted proposed applicants, Mg. Ramos present adiustments to the entrance exam schedule. a the inclusion of an The committee approve online testing epuon, Mr, Bautista suggesied enhancing interview rubrics fo assess student motivation. The revised process wil take effect in the next admission cycle. The meeting concluded at 3 45 PM."
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "minutes",
        "ocr_text": "Republic of the Philippines F/ pe 3 Department of Education Region 10 oe Division fn £2¢ Lake Monicachester Nelson PLC University MINUTES OF MEETING Faculty Evaluation Committee Deliberation SCHOOL YEAR2016 2014 2003 10 08 A. MEMBERS IN ATTENDANCE Pensionscheme Rrian Vader Bookseller Kaylee Nichols Programmer, systems Flizaheth Evang Psychologist, os) James Curtis 8. MEMBERS NOTIN ATTENDANCE C CALL TO ORDER The Faculty Evaluation Committee Tong Vie Called to order at 9 30 by Dr. Ramos. APPROVAL OF MINUTES MEETING PROPER: At 2 00 PM, the Admissions Committee met to finalize the screening guidelines for new applicants. Ms. Ramos presented proposed adjustments to the entrance exam schedule. committee approved the inclusion of an online testing option. Mr. Bautista suggested enhancing interview rubrics to assess student motivation. The revised process will take effect in the next admission Sree The meeting concluded at 3 15 M."
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "minutes",
        "ocr_text": "ay ort, fst Republic of the Philippines (ie) a i i Department of Education Region 10 ‘ws Division @hnfvSace Lake Monicaches! ester Nelson PLC Universi MINUTES OF MEETING in Committee Deliberation YEAR2016 2014 2003 10 08 Faculty Evaluatio SCHOOL MEMBERS IN ATTENDANCE Pension scene Rrian Yoder seller ~— Kaylee Nichols ner, systems Flizaheth Fvans \"coma James Curtis MEMBERS NOT IN ATTENDANCE Programm CALL TO ORDER The Faculty Evaluation Committee meeting WS called to order at 9 30 AM by Dr. am p. APPROVAL OF MINUTES —. MEETING PROPER: At 2 00 PM, the Admissions Committee met to finalize the screening guidelines for new applicants. Ms. Ramos presented proposed adjustments to the entrance exam schedule. The committee approved the inclusion of an online testing option. Mr. Bautista suggested enhancing interview rubrics to asSeSS student motivation. The revised process will take effect in the next admission cycle. The meeting concluded at 3 15 M."
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "minutes",
        "ocr_text": "ootitny xe Republic of the Philippines F( 2 Department of Education Region 10 Ze Division @hnf2theite Lake Monicachester Nelson PLC University MINUTES OF MEETING Faculty Evaluation Committee Deliberation SCHOOL YEAR2016 2014 2003 10 08 A. MEMBERS IN ATTENDANCE eNmanager Rrian Vader Bookseller Kaylee Nichols Programmer, systems” Flizahath Evang Psychologist col unseling James Curtis B. MEMBERS NOTIN ATTENDANCE C CALL TO ORDER The Faculty Evaluation Committee meeting was called to order at 9 30 AM by Dr. Ramos. D. APPROVAL OF MINUTES —. MEETING PROPER: At 2 00 PM, the Admissions Committee met to finalize the screening guidelines for new applicants. Ms. Ramos presented proposed adjustments to the entrance exam schedule. The committee approved the inclusion of an online testing option. Mr. Bautista suggested enhancing interview rubrics to assess student motivation. The revised process will take effect in the next admission cycle. The meeting concluded at 3 15 PM."
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "minutes",
        "ocr_text": "nsuilation A 5. MEMBERS NOT iN ATTENDANCE CALL TO GREER At 1 00 PM, Mr. Lopez formally opened the IT Committee meeting to discuss system improvements. APPROVAL OF MINUTES MEETING PROPER: The meeting of the Publication Board was held at 1 45 PM to discuss the upcoming reiease of the institutional journal. Dr. Fernandez presented submitted manuscripts for peer review. Three papers were approved for publication after revisions. The Board emphasized the need for adherence to APA formatting guidelines. A workshop on academic writing was scheduled for interested ah! facuity. The meeting adiourned at 3 19 PM."
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "minutes",
        "ocr_text": "ae Caen es fo Republic of the Philippines i BY Fy B Department of Education C ~ Region 3 ee Sea” Division of isShu e Clarkfort Underwood Hemandez School MINUTES OF MEETING ems Upgrade Consultation YEAR1970 1970 2002 03 23 IT Committee Syst SCHOOL A. MEMBERS IN ATTENDANCE Cartoaranhe Paula Garcia Kncmanresevey Aimee Walters Programme researc! 4 ‘proadcasting tinivided Flizaheth Clark social researcher Katie Patton 3. MEMBERS NOT IN ATTENDANCE c CALLTO ORDER At 1 00 PM, Mr. Lopez formally opened the IT Committee meeting to discuss system improvements. p. APPROVAL OF MINUTES —, MEETING PROPER: The meeting of the Publication Board was held at 1 45 PM to discuss the upcoming release of the institutional journal. Dr. ic writing was scheduled for in academi The meeting adjourned at 3 1 faculty."
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "minutes",
        "ocr_text": "A. a Fa Republic of the Philippines F 4 S\\ | By Department of Education C , Region 3 2 Nene Division of 283i: Clarkfort Underwood Hemandez School MINUTES OF MEETING IT Committee Systems Upgrade Consultation SCHOOL YEAR1970 1970 2002 03 23 MEMBERS IN ATTENDANCE Cartoaraphe Pala Garcia eee coetimee Walters re Flizaheth Clark Social researcher Katie Patton MEMBERS NOT IN ATTENDANCE CALL TO ORDER At 1 00 PM, Mr. Lopez formally opened the IT Committee meeting to discuss system improvements. APPROVAL OF MINUTES MEETING PROPER: The meeting of the Publication Board was held at 1 45 PM to discuss the upcoming release of the institutional journal. Dr. Fernandez presented submitted manuscripts for peer review. Three papers were approved for publication after revisions. The Beard emphasized the need for adherence to APA formatting guidelines. A workshop on academic writing was scheduled for interested faculty. The meeting adjourned at 3 10 PM."
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "minutes",
        "ocr_text": "my atinty fo Republic of the Philippines i a\\ i é Department of Education C p); Region 3 2 ‘5 Division of ss, Clarkfort Underwood Hemandez School MINUTES OF MEETING IT Committee Systems Upgrade Consultation SCHOOL YEAR1970 1970 2002 03 23 A. MEMBERS IN ATTENDANCE rt Paula Garcia sne Aimee Walters id Flizaheth Clark Social researcher Katie Patton B. MEMBERS NOT IN ATTENDANCE C CALL TO ORDER At 1 00 PM, Mr. Lopez formally opened the IT Committee meeting to discuss system improvements. D. APPROVAL OF MINUTES —. MEETING PROPER: The meeting of the Publication Board was held at 1 45 PM to discuss the upcoming release of the institutional journal. Dr. Fernandez presented submitted manuscripts for peer review. Three Papers were approved for publication after revisions. The Board emphasized the need for adherence to APA formatting guidelines. A workshop on academic writing was scheduled for interested faculty. The meeting adjourned at 3 10 PM."
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "minutes",
        "ocr_text": "MINUTES OF MEETING IT Committee Systems Upgrade Consultation SCHOOL YEAR1970 1970 2002 03 23 A. MEMBERS IN ATTENDANCE Cartoaraphe Patila Garcia imee Walters Flizaheth Clark Katie Patton B. MEMBERS NOTIN ATTENDANCE C CALLTO ORDER At 1 00 PM, Mr. Lopez formally opened the IT Committee meeting to discuss system improvements. D. APPROVAL OF MINUTES E. MEETING PROPER: The meeting of the Publication Board was held at 1 45 PM to discuss the upcoming release of the institutional journal. Dr. Fernandez presented submitted manuscripts for peer review. Three papers were approved for publication after revisions. The Board emphasized the need for adherence to APA formatting guidelines. A workshop on academic writing was scheduled for interested faculty. The meeting adjourned at 3 10 PM."
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "minutes",
        "ocr_text": "Republic of the Phitippines i yy Catan 2 New Lisa Cohen Cervantes College MINUTES OF MEETING Guidance Office Wellness Meeting SCHOOL YEAR {993 1970 1984 04 08 MEMSERS It ATTENDANCE Karen Smith Danielie Rodriquez sepredu Denald Williams Tina Koch C lar genete: MEMBERS NOT IN ATTENDANCE >; CALL TO ORDER emandez ca meeting to order. APPROVAL OF MINUTES The Guidance Office team gguvgiied at TF orb Ail with MEETING PROPER: The Pr ment Committee convened at 9 00 AM with Mir Santos easing. he mem ers reviewed pending purchase requests from various departments. The cornmittee approved the acquisition of new laboratory equipment for the Engineering Department. Dr. Villanueva reminded members to observe government procurement policies. It was agreed that all requests should include at least three quotations. The meeting ended at 10 20 AM."
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "minutes",
        "ocr_text": "oy, Repuote of the Prikpaines j _ Department of Educstion iy Regron 13 A Dhision of ze Se New Lisa Cohen Cervantes Coilege MINUTES OF MEETING Guidance Office Weilness Meeting SCHOOL YEAR1993- 1970 1984 04 08 A’ MEMBERS IN ATTENDANCE SURE. Karan Smit Danieite Rodriquez ese Ananald Williams Tina Koch 8. MEMBERS NOT IN ATTENDANCE C CALL TO ORDER The Guidance Oflicg jean onvene ‘Mis. Fernandez calling he\" meeting to order. D. APPROVAL OF MINUTES ©. MEETING PROPER: The Procur nt Committee convened at 9 00 AMM with Mir, Santos GG. ne ned ot 3 reviewed pending purchase requests from various departmenis. The committee approved the acquisition of new laboratory eqrt ment for the Engineerin Department. Dr. Villanueva reminded members to observe government procurement olicies. {t was agreed thai ail requests shauid include at least three quotations. The meeting ended at 10 20 AM."
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "minutes",
        "ocr_text": "wh, 7 [A= ee Republic of the Philippines F 4 &) i Bb H Department of Education C *.! Region 13 SSE Division of 22 al New Lisa Cohen Cervantes College MINUTES OF MEETING Guidance Office Wellness Meeting SCHOOL YEAR 1993 1970 1984 04 08 MEMBERS IN ATTENDANCE metas Karen Smith “see Danielle Rodriquez Teevisonstimwideo prewuet Dnald Williams, Clinical molecular genet Tina Koch MEMBERS NOT IN ATTENDANCE CALL TO ORDER The Guidanc ce qgivped at 0: i ath meeting to order. APPROVAL OF MINUTES MEETING PROPER: The Pro nt Committee convened at 9 00 AM w ith Mr. Santos een he members reviewed pending purchase requests from various departments. The committee approved the acquisition of new laboratory equipment for the Engineering Department. Dr. Villanueva reminded members to observe government procurement policies. It was agreed that all requests should include at least three quotations. The meeting ended at 10 20 AM."
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "minutes",
        "ocr_text": "p. MEMBERS wy ATTENDANCE! Ka ime Koch &. MEMpERg MOT IN AT TENDANSE CAL TO orgs The G qgav nee at “Fo: EG J with “emandez call th “meeti ing to or APPROVAL or MRMUTES MEETING PROPER: The P rocurement Comm ittee co, AM ane Mi ‘Santos prasia, ing. reviewed pendir various departments. 3 1970 1984 04 08 der. ened at S00 Ne membars ig purchase 7 requests from The committee &bproved the go atisition of new laboratory, =ngineering D wepariment, remindey members to oh equipment far i Villanueva S8rve governn nent procurement Clicies. It yy requests should i inclu quotations. The meetin Was agreed that ali ude at least three 1g ended at 10 25 AM."
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "minutes",
        "ocr_text": "© GAters ORDER The Guidan nce Offi ce team Ggavened at 10: (2 AM with emandes Calling the Meeting to Order, APPROVAL OF winUTES MEETING PRopEE. gP Ka wath deme pt Commi tee convened at 9 00 A with antos pres) ding. “FN he mem ers eViewed naing j purchas Se requests from Various dep: pe The committee approved the acguisi tion ba Jipment for the Engineer ing De part ment Vil anueva remind ed members fo observe government Procurement police ies. It was Bgteed that alf requesis should include at least j three quotations. The ®eeting ended at 10 20 AM"
    }
]