[
    {
        "image": "narrativereport1_synth_10_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "City HIGH SCHOOL 8. City NARRATIVE REPORT The Community Extension Office organized an outreach program at Barangay San Isidro last November 3. Volunteers distributed food acks, school supplies, and hygiene kits to more, than 190 families. The event also included storytelling sessions and fun games for children. Partner organizations assisted in funding and logistics Seopa Residents expressed heartfelt gratitude for the SEhool s continued assistance. The ollice reaitirmed its commitment f° nurturing compassion and socia responsibility among students and staff."
    },
    {
        "image": "narrativereport1_synth_10_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "4 SCHOOL MARRATIVE REPORT ane Community Extension Office organized an otitreach program at Batangay San Isidro last} November 3. Volunteers distributed food packs, “school supp! ies, and hygiene kits to more, than, 100 families. The event also includec ‘storytelling sessions and fun games for “et nildren. Partner organi ations ass sisted in funding and logis tics support. Residents expressed heartfelt gratitude for the chool s continued assistance. The ort fice reaffirmed commitm vent to nurturing compassion and social responsibility among students and stat"
    },
    {
        "image": "narrativereport1_synth_10_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT The Community Extension Office organized an outreach program at Barangay San Isidro last November 3. Volunteers distributed food pacts. school supplies, and hygiene kits to more than, 100 families. The event also included s oryte ing sessions and fun games for children. Partner organizations assisted in funding and logistics support. Residents expressed heartfelt gratitude for the sghool s G ntinued assistance. The office reaffirmed its commitment fo nu uring compassion and socia i responsibility among students and staff."
    },
    {
        "image": "narrativereport1_synth_10_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "than 14 0 famiiegeen Seve i. oF The also inched storytellrig sions Sessions and fun games for childre responsibility a s d assistance, Th S commitmen UrINg Compassion an n. Partner n funding port. Residents gratitude for the 6 social Mong students and taff."
    },
    {
        "image": "narrativereport1_synth_10_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "City University of HGH SCHOOL NARRATIVE REPORT The Community Extension Office organized an outreach program at Barangay San Isidro !ast November 3. Volunteers distributed food packs, school supplies, and hygiene kits to ore, than 1 90 families. The event aiso included storytelling sessions and fun games for children. Partner organizations assisted in funding and logistics support. Residents expressed heartfelt gratitude for the School s continued assistance. The office reaftirmed its commitment fo urturing compassion and socia} responsibility among students and staff."
    },
    {
        "image": "narrativereport1_synth_1_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "MARSATIVE REPORT The Guicance Office successfully held a two day Menta! Health Awareness Program last October 15 16. The activity focused on helping students manage stress and emotional challenges during the academic year. Guest speakers from the Department of Health shared valuable insights on maintaining psychological balance. Over 300 students participated in the seminar and group discussions. Feedback farms revealed that 95% of participants found ihe event informative and engaging. The office plans to hold a follow up session next semesier to continue promoting mental wellness,"
    },
    {
        "image": "narrativereport1_synth_1_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "Schools D ntowe College of Miller N. _ HIGH SCHOOL, USNNY Thoms city NARRATIVE REPORT The Guidance Office successfully held a two day Mental Health Awareness Program last October 15 16. The activity focused on helping students manage stress and emotional challenges during the academic year. Guest speakers from the Department of Health shared valuable insights on maintaining psychological balance. Over 300 students participated in the seminar and group discussions. Feedback forms revealed that 95% of participants found the event informative and engaging. The office plans to hold a follow up session next semester to continue promoting mental wellness."
    },
    {
        "image": "narrativereport1_synth_1_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "College of Mi ill USN Thome 31688 9, FPO AP City NARRATIVE REPORT The Guidance Off a two day Menta Program challenges durin Guest $s eakers of Health shar maintaining Ps seminar and group Feedback for participan informativ ast October 15- plans to hold a semester to men ice SUCCES ms reveal ts foun e and engaging. Th Health Aw: ychological balance. Over 300 students participated in the discuss! follow up Sess ons. ed that 95% of the event e office ion nex’ continue promoting tal wellness."
    },
    {
        "image": "narrativereport1_synth_1_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "Schools Divisiow, College of Miller NATIO: town IGH SCHOOL NARRATIVE REPORT The Guidance Office SuCcessfully held a two day Mental Health Awareness Program last October 15 16. The activity focused On helping students anage stress and €motional Challenges ering the academic year. Guest s eakers from the Department of Healt shared valuable insights on maintaining Psychological ba ver 300 students Participated jn the seminar and group discussions. Feedback forms revealed that 95% of Participants found the event informative and engaging. The office Plans to hold a follow up session next semester to continue Promoting mental wellness."
    },
    {
        "image": "narrativereport1_synth_1_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "Schools DivisioggtyensontoWHY Qi College of Miller NATIONAL HIGH SCHOOL USHV Trompe, FPO AP City NARRATIVE REPORT The Guidance Office successfully held a two day Mental Health Awareness Program last October 15 16. The activity focused on helping students manage stress and emotional challenges during the academic year. Guest speakers from the Department of Health shared valuable insights on maintaining psychological balance. Over 300 students participated in the seminar and group discussions. d that 95% of Feedba deans yea ie event informative and engaging. The office plans to hold a follow up session next semester to continue promoting mental wellness."
    },
    {
        "image": "narrativereport1_synth_2_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE RESORT e of Student Affairs conducted ship Training V kshop for student officers on S 28. The workshop aimed to 5 ngthen teamwork communication, and problem solving among organization leaders. Activities included group challenges, leadership simulatio gt lectures from university Participants expressed enthus were awarded to thos ail sessions. The suc i demonstrated the sit iS commitment 1© responsibe leade Ship within the School community, who comp $5, of the ey"
    },
    {
        "image": "narrativereport1_synth_2_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "Republic of the Philippines Department of Education Region 7 ‘Schools Division Abhleymoufbity IONAL HIGH SCHOOL 9 Susan Lodge, Lake Ci sun yesanase CY NARRATIVE REPORT The Office of Student A irs, conducted a Office of Student Rorksho for student officers on September 28. The workshop aimed to strengthen teamwork, communication, an roblem solving amon organization leaders. Activities inc uded group challenges, leadership simulations, and guest lectures from university alumni. Participants expressed enthusiasm and appreciated the practical lessons shared by the facilitators. Certificates were awarded to those who completed all sessions. [he success of the event h demonstrated the stude ts’ commitment to nstratedale leaders Np oathin t e school community."
    },
    {
        "image": "narrativereport1_synth_2_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "nah ELC CHUOL NARRATIVE REPORT a OF] St ry ff: S my etesed Ts Cllge ot St der wt A WSs, conducted rainin Kshop for Student officers on Ser tember: 28, The Workshop aimed fo strengthen leamwork, oo Crmimunication, and eroblem solvin gam 1ONG oF ganization Saders, Acti Villes included Group chall lenges, je adership simu! ations, and Sues 8 from university alumni. 3 EXOressad Bnthusiasm and _ appr eci iated’ the Factical lessons Shared by the facifit fators. Certificatas Were awarded to those who “the ted all sass iS. 1 e SHCEESS, of ‘the even demonsirais Siuder nis” camr niiment o responapheSé legc ship within t School com mun) uty."
    },
    {
        "image": "narrativereport1_synth_2_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT .o Office of, 54 ydent Af airs is acersno rain! ing Wo rks student officers Of por 2 d to strengthen, workshop aimed teamwork, communication, and roblem salving arnong org nization leaders. Activities included group challenges. 'e2 ership simu ations, and quest lectures from university alumni. Participants expressed enthusiasm and a ‘Peciated th the pra .gj jassons shared by the faciitators. Certificates were aw arded to these who comp: leted all sessions. event The 2 success, of ihe demonstrate ah the sit det 5 cam mitment iofespons ble jeacersnip within t school community. he"
    },
    {
        "image": "narrativereport1_synth_2_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "| DepED 7 4 4 on Abhleymoutttt ONAL HIGH SCHOOL NARRATIVE REPORT The Office of Student irs, conducted a Leadership taining Wieser for student officers on September 28. The workshop aimed to strengthen teamwork, communication, and problem solving among organization leaders. Activities included group challenges, leadership simulations, and guest lectures from university alumni. Participants expressed enthusiasm and appreciated the practical lessons shared by the facilitators. Certificates were awarded to those who completed all sessions. The success of the event demonstrated the students commit ent to responsible leadership within the school community."
    },
    {
        "image": "narrativereport1_synth_3_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "i SCHOOL NARRATIVE REPORT The Library Department re orted a significant increase in book borrowing transactions during the month of November. A total of 4 245 books were checked out, surpassing the previous month s record by 30%. The introduction, of the oniine reservation system made it easier Tor studenis to access study materials. Additionally, the ‘Book Lovers Week’ ever encouraged reading through Tun challenges and rewards. Library staff noted improved discipline and responsibility among users. Plans are underway to expand digital collections to support distance learning."
    },
    {
        "image": "narrativereport1_synth_3_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "'s record by 30%, The syseduction of the online reservation system made it easier for students to access study materials, Additionally, the 'Boo Overs Week’ event encourage reading t rough fun challenges and rewards. Library staff noted improved discipline and responsibility pong users. Plans are underway to expan digital Collections to support distance learning."
    },
    {
        "image": "narrativereport1_synth_3_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "HIGH SCHOOL NARRATIVE REPORT iment reported significant snerease in bOOK borrowing wansactons during the month of November. A total of 1 245 books were checked out surpassing ine previous month s record by 30%, The introduction, of the onlin servation system made It aagier for students To access study materials. Additionally, the ‘Rook Lovers Week event encourages reading Through fun challenges and rewards. Library staff soted improved discipline an rs, Plans are responsibility among use ans collections tance learning. underway to expand digita io support cis"
    },
    {
        "image": "narrativereport1_synth_3_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "ff i p NARRATIVE REPORT ansactions during the month of November. A total of 1 245 books previous month s record by 30%. T 6, The introduction of the online reservation sysiem made it easier for students to the ‘Book Lovers Week' event encouraged reading through Tun challenges and rewards. Library staff noted improved discipline and responsibility among users. Plans are underway to expand digital collections"
    },
    {
        "image": "narrativereport1_synth_3_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "Republic of the Philippines Fae Department of Education 3 g Region 12 ae Schools Division of gg City Institute of Drake NATIONAL HIGH SCHOOL oes Zachary Couns. North City tatgyarsesteane™ Cit NARRATIVE REPORT The Library Department reported a significant increase in book borrowing transactions during the month of November. A total of 1 245 books were checked out, surpassing the previous month s record by 30%. The introduction of the online reservation system ton ot, easier for students to access study materials. Additionally, the Book Lovers Week’ e ent encouraged reading through fun challenges and rewards. Library staff noted improved discipline and responsibility among users. Plans are underway to expand digital collections to support distance learning."
    },
    {
        "image": "narrativereport1_synth_4_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT The Senior High School Department organized a Career Guidance Fair on October 22. Various colleges and universities participated to present their programs and scholarships to graduating students. phe event also featured talks from industry ineering, business, Aany students aporeciaied ihe opportunity to clarify their career paths. Teachers observes increased motivation among students after the fair. The department hopes fo make the Careet, Fair an annual eyent to conunuousiy GUIC ‘a learners in inelt post graduation choices. professionals in eng and the arts."
    },
    {
        "image": "narrativereport1_synth_4_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "oBrettburghity University of NAL HIGH SCHOOL s. City NARRATIVE REPORT The Senior High School Department organized a Career Guidance Fair on ctober 22. Various colleges and universities participated to present their programs and scholarships to graduating students. The event also featured talks from industry professionals in engineerin. business, and the arts. Many students appreciated the op ortunity to clarify their career paths. Teachers observed increased motivation among students after the fair. The department hopes to make the Carper Fair an annual event to continuously guiae earners In their post graduation choices."
    },
    {
        "image": "narrativereport1_synth_4_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "Republic of the Philippin arts. Many st appreciated the 6 ma toc ke the Car, ‘Ontinuous Post graduation rtme er F Ira Fy guides Department of Education 9, business, eels fy Pportunity to ari T paths, ieee observed increased Motivation among students nt hopes to gn annual event earners Choices, In their"
    },
    {
        "image": "narrativereport1_synth_4_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "Univer The Sen organized Republic Department of Educa Region 1 tion of the Philippines city Schools Division oBrettburgtt HH SCHOOL NATIO! shaw Rest A BrBtana, 98 sity of Erika 958 Nat NAL HIG! i g08. City NARRATIVE REPORT ior High Sc a Career Sctober 22. Various universities participa their program graduating students. featured talks from ineering, business, professio d the arts. nals in engin hool Department Guidance Fair on s and scholarships to The event also industry any students ortunity to clarify eachers observe"
    },
    {
        "image": "narrativereport1_synth_4_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "SCHOOL NARRATIVE REPORT ne Senior High Schoo! Department organized a Career Guidance Fair on yotober 22. Various colleges and universities participated to present their programs and scholarsnips to graduating students. The event also featured talks frorn industry professionals in engineering, business, and the arts. Mariy students appreciated the opportunity to clarify their career paths. Teachers observed increased motivation arnong studenis after the fair. The department hopes to make the Career Fair an annual eyent to cartinuously guide learners in their post graduation choices."
    },
    {
        "image": "narrativereport1_synth_5_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT The Research and Development Office conducted a campus wide Research Symposium on November _ The event showcased outstanding research projects from both students and faculty members. A total of 25 studies were presented covering topics in education, technology, and health sciences. Guest eva uators commended the articipants or their creativity an methodological rigor. Best Paper and Best Present r awards were given durin the closing program. The symposium successfully fostered a culture of researen excellence within the institution."
    },
    {
        "image": "narrativereport1_synth_5_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT The Research and Devel opment Office conducted a campus wide ae ron eympo sium on November snk a outstan beer goes projects from both students and facully members. A total of 25 studies were presented ce eting topic ics in education, echnology, and health sciences. Guest evaluators comm ender ed the participants heir crea and methodological rigor. Best ace and Best Presenter awards were given during the c losing program. The synipes tm successfully foste fed aol ture ao res earch excelle nce wit 8 institution."
    },
    {
        "image": "narrativereport1_synth_5_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "FHCRC, NARRATIVE REPORT The Research and Development Office conducted a campus wide Research Symposium on November The event showcased outstandi ing research projects from both students and faculty members. A total of 25 studies were presented covering topics in education, technoloc ay, and health sciences. Guest evaluators commended the participants for their creativity and methodological rigor. Best Paper and Best Presenter awards were given during the clasing program. The symposium successfully fos tered a cult ure of research excellence within the instilution."
    },
    {
        "image": "narrativereport1_synth_5_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "SH SCHOOL NARRATIVE REPORT The Research and Development Office cons pasta a campus wide Research Symposium on November 10. The event showcased outstanding research Bree from both students and faculty members. A total of 25 studies were presented cee overing topics in education, echnology, and health sciences. ee st eva u tors commended the participants r their crealivily and ‘methodol eles rigor. Best Paper and Sest Presenter awards were Given during the closi ng program. ne symposium successfully tered a cult ture. of research ost ence within the insiitution."
    },
    {
        "image": "narrativereport1_synth_5_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "8 Reyarisids ity AL HIGH SCHOOL w City NARRATIVE REPORT The Research and Development Office conducted a campus wide Research Symposium on November 10. The event ghowcased outstanding research projects from both students and faculty members. A total of 25 studies were presented covering topics in education, ehnology, and health sciences. Guest eval Uator, commended the participants for their creativity an methodological rigor. Best Paper and Best Pre enter awards were given during the closing program. The symposium successfull excafiones Gtr eof Fesearch"
    },
    {
        "image": "narrativereport1_synth_6_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "4. HIGH SCHOOL City Academy ofA MARRATIVE REPORT The Human Resource Office reported the cornpletion of a three day Staff Develooment Seminar held from October 5 to 7. The seminar focused On IMprOVING administrative eficiency and interpersonal communication. Resource speakers discussed time management, dala handling, and conflict resolution. Employees actively participated in group discussions and team ouillding activities. The HR Office received positive feedback frorn the participants Who found the topics relevant to thelr daily tasks. Future sessions are being planned to continue strenginening employee competencies."
    },
    {
        "image": "narrativereport1_synth_6_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT fice reported October 9 on improving admin! Sffici i] communication. and interpersona: CY. eakers discus Resource Sp ement, data handiing, and"
    },
    {
        "image": "narrativereport1_synth_6_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT The Human Resource Office reported the completion of a three day Staff Development Seminar held from October 5 to 7. The seminar Lipciised on improving administrative ciency and interpersonal communication. Resource speakers discussed time management, data handling, and conflict resolution, Employe 288 actively participated in 1 group discussions and team building ac UVIE ies, The HR Office received positive feedback from the partic ipants who found ine topi cs relevant to their daily tasks. Future sessions are being piann dt to continue strengthening employee competencies."
    },
    {
        "image": "narrativereport1_synth_6_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT The Human Re completion of a speropment Sem to continue strengthenin competenci Source O ffice reported three day Staff inar held from g employee es."
    },
    {
        "image": "narrativereport1_synth_6_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT The Human Resource Office reported the completion of a three day Staff Development Seminar held from October 5 to 7. The seminar focused on improving administrative e iclency and interpersonal communication. Resource speakers discussed time Management, data handling, and conflict resolution. Employees actively participated in group discussions an team building activities. The HR Office received positive feedback from the Participants who found the topics relevant to their daily tasks. Future sessions are being planned to continue strengthening employee competencies."
    },
    {
        "image": "narrativereport1_synth_7_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT The Campus Maintenance Unit Completed its scheduled duilding inspection and repair project for the third quarter. Severa! Classrooms received repainting and eiectrica! rewiring to ensure safety and comfort. The main water system was also upgraded to improve Sanitation facilities. The Project was accomplished ahead Ol schedule and within the aliccated budget. Teachers and studants expressed Satisfaction with the im roved learning environment, he unit Coniinues to Bpontor mainienance needs t uphold campus Salely standards,"
    },
    {
        "image": "narrativereport1_synth_7_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATryE REPORT The Campus Maintenance Unit completed its scheduled building inspection and repair broject for the third quarter, Several Classroorns received repainting and Slectrica} rewiring to ensure safety and comfort. The main water System was also UPGraded to improve Sanitation facilities, The broject was accomplishad ahead of Schedule and within the allocated budget, Teachers and students oxoressed Salisfaction with the improved learning environment. he unit continues to monitor Maintenance heeds io upneld Campus Safety Standards."
    },
    {
        "image": "narrativereport1_synth_7_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT The Campus Maintenance Unit Completed its scheduled building inspection and repair project for the third quarter, Severa classrooms received repainting and Slectrical rewiring to ensure safety and comfort. The main water system was also upgraded to improve Sanitation faciitias. The Droiect was accomplished ahead of Schedule and Within the allocated budget, Teachers and students expressed Salisfaction with the improved learning environment. The unit continues to monitor Maintenance needs to upNold CAaMpus safety Slandards."
    },
    {
        "image": "narrativereport1_synth_7_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT The Campus Maintenance Unit completed its scheduled ee inspection and repair project for the third quarter. Severa classrooms received repainting and electrical rewiring to ensure Safety and comfort. The main water system was also upgraded to improve Sanitation facilities. The project was accomplished ahead o Schedule and within the allocated budget. Teachers and students expresse Satisfaction with the improved learning environment. The unit continues to sponttor Maintenance Heeds ip upho Campus Safety standar, Ss."
    },
    {
        "image": "narrativereport1_synth_7_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "Institute of Skill aE SCHOOL NARRATIVE REPORT The Campus Maintenance Unit completed its scheduled puildin inspection and repair project for the third quarter. Severa classrooms received repainting and electrical rewiring to ensure safety and comfort. The main water system was also upgraded to improve sanitation facilities. The project was accomplished ahead of schedule and within the allocated budget. Teachers and students expressed satisfaction with the im roved jearning environment. The unit continues to monn maintenance needs i uphold campus sa ety standaras."
    },
    {
        "image": "narrativereport1_synth_8_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "Republic of the Philippines Department of Education Region 2 mn ANayneport ity ONAL HIGH SCHOOL City NARRATIVE REPORT The Registrar s Office successfully implemented the new online grade viewing system this semester. Students were able to access their academic records conveniently using their school accounts. The system reduced long queues during grade release periods and minimized paperwork. Technical support was provided to guide both faculty and Students in navigating the platform. Initial feedback Indicated A smooth transition and efficient performance. The Registrar s Office plans to integrate more features, including electronic request forms, by next year."
    },
    {
        "image": "narrativereport1_synth_8_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "2 sNaynepor® iy HGH SCHOOL City NARRATIVE REPORT The Registrar s Office successfully implemented the new online grade viewing system this semes er. Students were able to access their academic records conveniently USING their school accounts. The system reduced long queues during grade release periods and minimized paperwork. Technical support was provided to guide both faculty and students in navigating the platform. initial feedback indicated A smooth transition ang icient perrormance. The Registrar s Office plans fo integrate more features, including electronic request forms, by next year."
    },
    {
        "image": "narrativereport1_synth_8_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "Republic of the PI Department of E Region Schools Division NayneporC ity Cotege of cleanchester NATIONAL HIGH SCHOOL rest Noth City mre City NARRATIVE REPORT The Registrar s Office successfully implemented the new online grade viewing system this semester. Students were able to access their academic records conveniently using their school accounts. The system reduced long queues during grade release periods and minimized paperwork. Technical support was provided to guide both faculty and students in navigating the platform. Initial feedback indicated a smoot transition and Klee performance. _ The Registrar s Office plans to integrate more features, including electronic request forms, by next year."
    },
    {
        "image": "narrativereport1_synth_8_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "te, Republic of the Philippines lens De ne cation i “=< oS Schools Divison izyneport ity 7 (Cotege of Metanchester HIGH SCHOOL NARRATIVE REPORT The Registrar s Office successfully Implemented the new online rade viewing system this semester. Students were able to access their academic records convenien ly using their school accounts. The system reduced long queues during grade release periods and minimized Paperwork. Technical support was provided to guide both faculty and students in navigating the platform. Initial feedback indicated smooth transition and efficient performance. The Registrar s Office plans to integrate more features, including electronic request forms, by nex year."
    },
    {
        "image": "narrativereport1_synth_8_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "SCHOOL NARRATIVE REPORT The Rag gistrars Office succes ssfully imp! lemente the new online grade Vv yori aystem this semester, Students wére able to access their academic recorder. conveniently using iheir School accounts t ihe system reduced iong ayoues durin 9 Grade release perio S and minimized Paperwork, T: ect hnical Support was Provided t 10 Guide beth faculty and pudent is i in Navigating the dlatiorm, initial f edback Kindicated a sMooth trans a fee and effi cient per ormance, The Registrar s Office plans to inte aie more features including slectronic request forms, by next year,"
    },
    {
        "image": "narrativereport1_synth_9_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "% (i Defeps) NARRATIVE REPORT hoster yeical Education D vin Jefe UA (ara als from epartment and cultural events brought students, teachers, and sta friend] competition. The week lon activity promoted Sportsmanship, unity, and school pride. The Red Team emerged as the overall champion after winning several major events. Organizers noted a high level of Participation and discipline qvoughout the games. The Success of the intramurals retlected the stron sense o community within the school. together ft in"
    },
    {
        "image": "narrativereport1_synth_9_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "of the Philippines University of Th NARRATIVE REPORT The Physical Education Department hosted the Annual! Intramurals from tes er 14 to A anous sports and cultural events brought to ether students, teachers, and sta friendly competition. The week- “ong activity promoted sportsmanship, unity, and school pride. The Red Team emerged as the overall champion after winning several major events. Organizers noted a high level of participation and discipline throughout the games. Success of the intramurals The sues the strong sense o community within the school."
    },
    {
        "image": "narrativereport1_synth_9_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "City University of Tr 3H SCHOOL NARRATIVE REPORT The Physical Education Department hgsted the Annual Intramurals from Sues er 14 to #8. arous sports and cultural events brought together students, teachers, and staff in friendly competition. The week- long activity promoted sportsmanship, unity, and school pride. The Red Team emerged as the overall champion after winning several major events. Organizers noted a high level of participation and discipline throughout the games. Success of the intramurals The sues the strong sense o community within the school."
    },
    {
        "image": "narrativereport1_synth_9_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT The Physic Education Department e u urals from ostetel 14 to cs arlous sports and cultural events brought to ether students, teachers and staff in friendly competition. The week long activity promoted sportsmanship, unity, and school pride. The Red Team emerged as the overall champion after winning several major events. Organizers noted a high level of participation and discipline throughout the games. The success of the intramurals reflected the strong sense O community within the school."
    },
    {
        "image": "narrativereport1_synth_9_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "Unive GH SCHOOL NARRATIVE REPORT The Physical Education Depariment hosted the Annual Intramurals from clober 14 to 18. Various sports and cultural events brought together students, teachers, and stat in riendly competition. The week long activity promoted sportsmanship, unity, and school pride. The Red Team emerged as the overall champicn after winning several major events. Organizers noted a high level of participation and discipline throughout the games. The success of the intramurals reflected the strong sense of community within the school."
    }
]