[
    {
        "image": "narrativereport2_synth_10_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 2 Division ofNew Adamfort ‘Academy of National High School James, S37 smn Oras fet Sm SS we rate NARRATIVE REPORT INS 8 2015 2019 IL INTRODUCTION: This report presents an overview of the and achievements activities imple school s goals responsibility among students. i rts and dedic: tion documentation of the eff ty fhe Ne sGhoo community. ith OBJECTIV ES: 4. To strengthen the partnership between the school, parents, and the community. 2. To provide programs that encourage active involvement ponsibility for student and shared res ciirrescs"
    },
    {
        "image": "narrativereport2_synth_10_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "E NARRATIVE REPORT IN INTRODUCTION: w of the als ‘Of nurturin Tre sgt commun ity. 1. Tos strengthen the partnership beiween the school, parents, and the commun ity. 2. To provide programs that encourage active involvement and shared responsibility for student oe my ee"
    },
    {
        "image": "narrativereport2_synth_10_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 2 Division of New Adamfort Academy of National High Schoo! James, Soa7 smh Ohad gt 1 1 Siiberg. 30 75810 NARRATIVE REPORT wee 8 2015 2019 INTRODUCTION: 1 verview of the This report presents an over) and achievements school s goals responsibility among students. It serves aS documentation of the efforts and dedication shown by the entire school community. Ik. OBJECTIVES: 4. To strengthen the partnership between the school, parents, and the community. 2. To provide programs that encourage active involvement and shared responsibility for student ciirress"
    },
    {
        "image": "narrativereport2_synth_10_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 2 Division of New Adamfort Academy of National High School James. 19087 Smith Orchard Apt. 104, ‘Smmnberg, 90 76410 rlomaten NARRATIVE REPORT IN 2sss\" S Y2015 2019 L INTRODUCTION: This report presents an overview of the school s programs and achievements _ throughout the academic term. The activities implemented were aligned with the school s goals of nurturing excellence and responsibility among students. It serves as documentation of the efforts and dedication shown by the entire school community. Il. OBJECTIVES: 1. To strengthen the partnership between the school, parents, and the community. 2. To provide programs that encourage active involvement and shared responsibility for student siirreaii"
    },
    {
        "image": "narrativereport2_synth_10_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "82015 2019 L INTRODUCTION: This report presents an overview of the school s programs and achievements throughout the academic term. The activities implemented were aligned with the school s goais of nurturing excellence and responsibility among students. !t serves as documentation of the efforts pnd dedication YY 00) shown he entire sci communi it, OBJECTIVES: 1. To strengthen the partnership between the school, parents, and the community. 2. To provide programs that encourage active involvement and shared responsibility for student"
    },
    {
        "image": "narrativereport2_synth_1_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "Division oftNew Donnabury College of Nationai f cl Josh NARRATIVE REPORTAN ematics 8 9202 1 2024 L INTRODUCTION: The schoo! year was filled with meaningful experiences that aliowed both students and teachers to grow academically and personally. Various programs and activities were conducted to enhance learning and strengthen camaraderie. This report highlights the accomplishments and challenges encountered throughout the academic year. ti. OBJECTIVES: 1. To develop students’ leadership skilis through active Je beat in school programs. 2. To provide opportunities for teamwork and collaboration among learners."
    },
    {
        "image": "narrativereport2_synth_1_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 4 Division ofNew Donnabury College of Ny ch ‘gllege of National High School S| '5209 Diton Motorway Apt. 039, Por Regna, WV O8TTO NARRATIVE REPORFAN, $-¥2021 2024 L INTRODUCTION: ematics The school year was filled with meaningful experiences that allowed both students and teachers to grow academically and personally. Various programs and activities were conducted to enhance learning and strengthen camaraderie. This report highlights the accomplishments and challenges encountered throughout the academic year. I. OBJECTIVES: 1. To develop students’ leadership skills through active Patticipation in school programs. 2. To provide Opportunities for teamwork and Collaboration among learners."
    },
    {
        "image": "narrativereport2_synth_1_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "1 ie OREO EES 4. To develop stu‘ skills through a c in school prog oppor unities Tor teamwork Srahan a ntered tive participation ms. 2, To provide and yong learners."
    },
    {
        "image": "narrativereport2_synth_1_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 4 Division ofNew Donnabury College of National High School 8208 ton Motorway Apt 030 Pon Regma, wv et Te NARRATIVE REPORFAM ematics $-¥2021 2024 L INTRODUCTION: The school year was filled with meaningful experiences that allowed both students and teachers to grow academically and personally. Various programs and activities were conducted to enhance learning and strengthen camaraderie. This report highlights the accomplishments and challenges encountered throughout the academic year. I. OBJECTIVES: 1. To develop students’ leadership skills through active Neh teat in school programs. 2. To provide opportunities for teamwork and collaboration among learners."
    },
    {
        "image": "narrativereport2_synth_1_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 4 Division ofNew Donnabury College of National High School joshua J \\o0 Dillon Motonway Apt. 030, NARRATIVE REPORFdthematics 8 12021 2024 I INTRODUCTION: The school year was filled with meaningful experiences that allowed both students and teachers to grow academically and personally. Various programs and activities were conducted to enhance learning and strengthen camaraderie. This report highlights the accomplishments and challenges encountered throughout the academic year. Il. OBJECTIVES: 1. To develop students’ leadership skills through active participation in school programs. 2. To provide Opportunities for teamwork and collaboration among learners."
    },
    {
        "image": "narrativereport2_synth_2_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 4 Division of South Frank University National High School Collinsbur 33805 Jann Buh S48 299 NARRATIVE REPORT Science 8 2015 2017 1. INTRODUCTION: This narrative report aims to present the summary, ry of activities implemented during mester. Ut It fe ats the ontinuds {6 provide quali y sfaie srt and fool development among learners. The events conducted served as avenues for skill building and character formation. Il, OBJECTIVES: iF To enhance th iemic erformance of Fe idents fetign focused study sessions. 2 romote a positive nS environment that encourages gro and discipline."
    },
    {
        "image": "narrativereport2_synth_2_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE S A90H OU be PORT Science ~2017 L INTRODUCTION: This narrative report alms to present the summary of activities implemented during the s me Ii reflects the continue Hor fel hoo! 16 provide jualy e (ealie and holistic development amor conducted elit learners. The eve OF i served as avenues for: uilding and character formation. i. GBIECTIVES: To siete the agade mic peronmanes students through focused study sessions. 2. To Seer le a positive learning environment that encourages growth ana discipline."
    },
    {
        "image": "narrativereport2_synth_2_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 4 Division of tees South Frank Colinsbigan National High School 33805 Jason Burps Suse 300, Foadmanchester WA T3000 NARRATIVE REPORT Bcience 82015 2017 L INTRODUCTION: This narrative report aims to present the summary of activities implemented during the semester. It refl t ti efforts of the school 1 provide auenhe education and holistic development among learners. The events conducted served as avenues for skill building and character formation. Il. OBJECTIVES: h th ademic pateae nee Of students fale: focused study sessions. 2. To promote a positive learning environment that encourages growth and discipline."
    },
    {
        "image": "narrativereport2_synth_2_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT Bojance 8 2015 2017 i INTRODUCTION: This narrative port aims to pr summer ty ente 9 Se! r. Ht rretiects 12 nein A forts OFT school to provide education and holis' among leamers. The aa nd utcing ar i. OBJECTIVES: 1, To enhan performance idents iar ough focused study aoe 2 76 promote a positive iearnit fre) environment that encourages growth and discipline. ce the academic"
    },
    {
        "image": "narrativereport2_synth_2_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "x INPRO G This narra OBFEC EY 1 perro focused study promote a posi environ set ved as ARRATINE REPORT one ience SIGN, report aims to present the s implemented nG ts the CONUNUOUS s avenues for s character formation. To enhance the academic ormance of students through sions. 2. To ve learning urages growth oline ment ihat en and ¢"
    },
    {
        "image": "narrativereport2_synth_3_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "Departm ent of Education Region g Division of Academy of Nati Leonardview NARRATIVE REPORT 52018 2020 1 INTRODUC TION: reflection of the SuCCce: Danielside ional High English ves asa Ses and lessons earned during this peri f OBJECTIVES: 1. To strengthen interpersonal Ski To provide roe ingful experiences that earning to real lod. Communication and lls among students. connect classroom -life annlicatinne"
    },
    {
        "image": "narrativereport2_synth_3_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT English 5 3018 2020 i. INTRODUCTION: Throughout the schooi year, the instituilon has worked hard to maintain excellence in academics and exirgcurnicular programs. Teachers dents, and parents collaborated to achieve the goais get for the term. This report serves as a reflection of the successes d lessons learned during this p th GBIECTEVES: 4. To strengthen communication and interpersonal skills among students. \"2. To provide meaningful experiences that connect ciassr jearning to real life applications."
    },
    {
        "image": "narrativereport2_synth_3_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT English La INTRODUC PRON: Throughout the schoai year, the Astitution Nas work d hard to maintain excellence in qcedemics and extr curicl Programs. eachers, si Gents, an parents collaborated to achieve the goals This feport serves as q Set for the term, reflection of the Successes anc lessons earned uring this Period, ies He ORieCreyes; 1. To Strengthen Communication ang interpersonal Skills among students. 2. TO provide Meaningful ©xperiences that connect classroom ‘faring to real life 4poblicatione"
    },
    {
        "image": "narrativereport2_synth_3_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region Division of Danielside Academy of National High School Leonardview fe es Apt. 109, ide, KS 41008 NARRATIVE REPORT I8nglish 8 2018 2020 I. INTRODUCTION: Throughout the school year, the institution has worked ard to maintain excellence in both academics and extracurricu ay programs. Teachers, students, an parents collaborated to achieve the goals set for the term. This report serves as a reflection of the Successes and i Jessons learned during this period. Il. OBJECTIVES: 1. To strengthen communication and interpersonal skills among students. 2. To provide meaningful experiences that connect classroom learning to real life applications."
    },
    {
        "image": "narrativereport2_synth_3_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region Division of Danielside Academy of National High School Leonardview 708 Au Coke ta ards Apt, 199, soe, KS 41000 NARRATIVE REPORT ISnglish S 2018 2020 I. INTRODUCTION: Throughout the school year, the institution has worked hard to mal pian excellence in both academics and extracurricula programs. Teachers, students, an parents collaborated to achieve the goals set for the term. This report serves as a reflection of the successes and Jessons fearne during this peo Il. OBJECTIVES: 1. To strengthen communication and interpersonal skills among students. 2. To provide meaningful experiences that connect classroom earning to real life applications."
    },
    {
        "image": "narrativereport2_synth_4_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "NARRAT: §.¥2021 2024 Ls INPRODLC THON; IVE REPORT BL Hliping The achiever school, promote Ie leamwo; among stu fens. it also School community unite: mh OBJECTIVES: urDpose of this hatrative rey ment the di 1. To foster crea ivity and innovation through hands on learning activities. 2. To develop problem solvin Skills that prepare students for future challenges"
    },
    {
        "image": "narrativereport2_synth_4_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "L u ities, within the gned to 2 discipline Presents how tha 7 UMed to accomplish objectives He Onagerey PS: 1. To foster creativity and innovation through h learning activities 2. problem salving Skills that prepare Students for uture challanace"
    },
    {
        "image": "narrativereport2_synth_4_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 9 Division of Dillonstad Ingytute pf North National High School 42558 May Paza, Lewisbury, Fieee NARRATIVE REPORT Ij ipino $-¥2021 2024 1. INTRODUCTION: The purpose of this narrative report is to locument the different activities, achievements, and experiences within the school. Each event was designed to _ promote learning, teamwork, and discipline among students. It also presents how the school community united to accomplish shared objectives. IL OBJECTIVES: _ 1. To foster creativity and innovation through hands on learning activities. 2. To develop problem solving skills that prepare students for future challenges."
    },
    {
        "image": "narrativereport2_synth_4_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT Filisina 92021 2024 i INTRODUCTION: ae 4 aS O8Si¢ g, teamwork Hi OBIRCTIVES: 1. To foster creativity and innovation through hands on learning activities. 2. To develop problem solving skills that orepare students for future challencdes."
    },
    {
        "image": "narrativereport2_synth_4_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "i a EN ERODUC PEON: The pu arnong tude school comm UBER TES BS: 4. To foster creativity and innovation through hands on learning activities. “2, To develop probi solving skills that prepare siudents for future challenges. Vis"
    },
    {
        "image": "narrativereport2_synth_5_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "£ INTRODDC PON: 7 The Past so ctl Noo year was pe attic ipatior i from s teas ers, and Stak school programe. support both gex Persanal deve Summarizes 1. To prornot '@ physical wellness among stude Sports and recreational 10 encourage Cisciplin and spor’ ismanship at Marked by and meniai nits throug A activities? 2. Ne, Tespect, ali Smee"
    },
    {
        "image": "narrativereport2_synth_5_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 10 Division of Tonyside NARRATIVE REPORT LY, A209 $-¥2017 2021 L INTRODUCTION: The past school year was marked by active participation from students, teachers, and stakeholders in various school programs. These activities aimed to support both academic excellence and personal development. This report summarizes the nig lights of the school s achievements and initiatives. I OBJECTIVES: 1. To promote physical and mental wellness among students through sports and recreational activities. 2. o encourage discipline, respect, and sportsmanship at all times."
    },
    {
        "image": "narrativereport2_synth_5_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 10 Division of Tonyside College of National High School Pation. 1379 Britney Shoal Sute 770, Recdcncster, WY 30208 NARRATIVE REPORT I, ‘2100 S Y2017 2021 L INTRODUCTION: The past school year was marked by active participation from students, teachers, and stakeholders in various school programs. These activities aimed to support both academic excellence and personal pete This report summarizes the highlights of the school s achievements and initiatives. Il. OBJECTIVES: 1. To promote physical and mental wellness among students through sports and recreational activities. 2. o encourage discipline, respect, and sportsmanship at all times."
    },
    {
        "image": "narrativereport2_synth_5_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education egion 10 Division of ~Tonyside Coliege of Nati houl Pation “~ ies NARRATIVE REPORT f Naing $-¥2017 2021 INTRODUCTION: The past schooi year was marked by active participation from students, teachers, and stakeholders in various school programs. These aciivities aimed to support Doth academic excelience and personal pdr ig Leal This report summarizes the highlights of the school s achievements and initiatives. UW, GBINCTIVES: 1. To promote physical and mental! wellness among students through 9 and recreational activities. 2. 0 encourage discipline, respect, and sportsmanship at all times."
    },
    {
        "image": "narrativereport2_synth_5_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE RE S01 7 2024 LS INTRORVCTION: The past ech active pa teachers school suppor kehold 1 OME TIVES: 4. To promote physical and menial wealiness among students through sports and rect agonal activites. fo encourage discipiine, respect, Oo ee nctarmansnip at all Ames."
    },
    {
        "image": "narrativereport2_synth_6_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORTED S 92016 2018 1 5 INTRODUCTION: 3 dedicat ion to nent ana student oe nig. Each activity contributed to th wih ‘and s success of both learners and staff. HH OBJECTIVES: 1. To improve stude thinking and analyt through academic Compettions 2 2. To provide recognition and motivatio ion for outstanding artinwoarmantea nis’ cr cal"
    },
    {
        "image": "narrativereport2_synth_6_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "i it. NARRATIVE REPORT IN 52016 2018 ESTROBUC TION, narrative report a oO contributed to the g! both learn fs and staff OBIEC TES: i. To improve students’ critical thinking and analytical abilities through academic competitions. 2 To provide recognition and motivation for outstanding aohiavermants."
    },
    {
        "image": "narrativereport2_synth_6_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "IVE REPORT IN S 2016 2018 ELC TION: ie HL OBIE TIVES: 4. To improve students’ critical thinking and analytical abilities through academic competitions. 2. To provide recognition and motivation for outstanding anhievement"
    },
    {
        "image": "narrativereport2_synth_6_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 2 Division of New Raymond Iinstigte Of National High Schoo! 510 oy Lag em Dave NARRATIVE REPORT INS $-¥2016 2018 i. INFRODUCTION: This narrative report provides a detailed account of the significant accomplishments ‘and programs carried out b the school. It reflects. the institution s edication to continuous improvement and student centered leaming. Each activity contributed to the growth and success of both learners and staff. QBIECTIVES: 4. To improve students’ critical thinking and analytical abilities through academic COME etitions. 2. T6 provide recognition and motivation for outstanding arehievements."
    },
    {
        "image": "narrativereport2_synth_6_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT [5 S 3 2016 2018 This narrative account of the s mers anid ste Gh OBJECTIVES: To improve students’ critical thi inking and analytical abilities through academic com npetitio ons. Z. provide recognition and motivation for outs standing 4"
    },
    {
        "image": "narrativereport2_synth_7_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT EN $92018 2022 L INTRODUCTION: During the academic vear, the Sopool cd several pr fh OBJECTIVES: i. To cultivate environme ental awareness and responsibil ity among Students, bs ro enga je learners dh Su able ang eco friend Sch ‘ar prolects"
    },
    {
        "image": "narrativereport2_synth_7_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Institute of wh Sel ngage! National High Schoo! vile NARRATIVE REPORT IN 2222 S 2018 2022 1. INTRODUCTION: During the academic year, the school implemented several programs that promoted creativity, leadership, and responsibility. The cooperation of all stakeholders played a vital role in achieving the school s objectives. This report presents the outcomes and insights gained from these activities. IH. OBJECTIVES: 1. To cultivate environmen tal awareness and responsibility among students. 2. To engage learners in sustainable an eco friendly school projects."
    },
    {
        "image": "narrativereport2_synth_7_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 5 Division of Greenview Ingtitute of National High School hs oun Key sees NARRATIVE REPORT we $.¥2018 2022 L INTRODU! CTION: responsiblity stakeholders a a Vital eral in achieving I s Ol the schoo jectives. This report presents the outcomes an nd insights gained from these activities. i. OBJECTIVES: To cultivate environs nental awareness ity among TE GIs. o 3 renga e learners sustaiatigiects."
    },
    {
        "image": "narrativereport2_synth_7_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 5 Division of Greenview High Sebook NARRATIVE REPOR t Its 8 2018 2022 t iN PRODUCTION: ic yea, the school ms that the school s objectives. C the outcomes and insights gained from these activities. Mb OBIECTIVES: _ To cultivate navironmen awareness tad res ninety among students. 2. To engage iearners sugtal abie ai 282 trendly Scnoe projects."
    },
    {
        "image": "narrativereport2_synth_7_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT IN Fav\" 5 018 2022 — INFRODUCTION; During the academic year, the schooi implemented severa programs that promoted creativity, leadership, and responsibility. The cooperation of all stakeholders played a vital roie in achieving the school s objectives. This report presents the outcomes and insights gained from these activities. T. OBJECTIVES: 1. To cultivate fuironmental awareness and responsibility among students. 2. To engage learners aN sustainable a eco friendly schoo! projects."
    },
    {
        "image": "narrativereport2_synth_8_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 4 Division of East Dennischester Institute of National High School 29551 Bowen} char, NARRATIVE REPORT IN easton aoe, S Y2020 2023 Lb. INTRODUCTION: The following narrative report describes the key events and undertakings of the school during the year. These initiatives aimed to improve student engagement and academic performance. It also esis be collective efforts made. to uphold the school s mission and vision. Il. OBJECTIVES: 1. To support students’ emotional and social development through guidance programs. 2. To create a supportive school environment that prioritizes mental health."
    },
    {
        "image": "narrativereport2_synth_8_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REP 8 2020 2023 EN TRGBUCTION: The following narrative report describes the key events and undertakings of the school during the year, These initiatives aimed to improve student engagement and academic performance. lt also ines the collective efforts mace. to oul uphold the school s rnission and vision. 1 OBFECTIYES: 4, To support students’ emotionai and social development througn guidance programs. 2. To create a supportive school environment that orioritizes mental health."
    },
    {
        "image": "narrativereport2_synth_8_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT IN 2350) $-¥2020 2023 i INTRODUCTION: The following narrative report describes the key events and undertakings of the school during the year. These initiatives aimed to improve student engagement and academic performance. It also outlines the collective efforts made. to uphoid e school s mission and vision. i. OBIECTIVES: 4. To support students’ emotional and social development through guidance programs. 2. To create a supportive schoo! environment that prioritizes mental health."
    },
    {
        "image": "narrativereport2_synth_8_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT IN 8 42020 2023 t INTRODUCTION: The following narrative report describes ihe key events and undertakings of the school during the ye “hese initiatives aimed io improve student engagement ane 2 scemic performance. It also outli ihe collective efforts rr uphold ihe Schoo 'S mista and fi OREO PROVES: 4. To support students’ emotional and social development through guidance programs. 2. To create a supportive school environment that prioritizes mental health."
    },
    {
        "image": "narrativereport2_synth_8_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "Deparment of Education 1 NARRATIVE REPORT f 8 2020 2023 1, INFRODUCTION: The following narrative report describes the key events and undertakings of the school during the year. These initiatives aimed to improve student engagement and academic performance. It aiso outlines the collective efforts made to uphold the Schoo) \"S tester and td Ik OBJECTIVES: 1. To support students’ emotional and social development through guidance programs. 2. To create a supportive school environment that prioritizes mental health."
    },
    {
        "image": "narrativereport2_synth_9_aug1.png",
        "label": "Narrativereport",
        "ocr_text": "i ORIECTIVES: for future ctical and ased learning. 2. To provide re fo various industries and professions through immersion OYOCYams. To prepare st s throug"
    },
    {
        "image": "narrativereport2_synth_9_aug2.png",
        "label": "Narrativereport",
        "ocr_text": "PVE REPORT EN) SHPOT7 2024 NARRAT AN ERODEL THON: The se ingd yarious lee experience togeiner epportun moments from seaning nis report Ni mplisnments and met the period. ie CMEC TY ES 4, To prepare siudents for future reers through practical and skill based warning. 2 10 oF ide exnNosure to Various industries and professions through Immersion programs."
    },
    {
        "image": "narrativereport2_synth_9_aug3.png",
        "label": "Narrativereport",
        "ocr_text": "NARRATIVE REPORT S 89047 2024 ENTRODBUCTION: ear has bees produ udents participatin and extracurric’ ners and staff worked eaningtul aducational report highlights the ajor accom lishmenis and memorable raoments from the period. ctive and ool gin with st ite ORIECTIVES: 4, To pre students for Tuture careers through practical and akill based jearning. 2 To provide exposure fo various industries and professions throug mersion nroarams."
    },
    {
        "image": "narrativereport2_synth_9_aug4.png",
        "label": "Narrativereport",
        "ocr_text": "Department of Education Region 43 Division of West Snannonborough College of National High Schoo! faayes Ant tT fare NARRATIVE REPORT IN 435 555 S Y2017 2021 1. INTRODUCTION: The school year has been productive and inspiring, with students participating in various learning and extracurricular experiences. Teachers and staff worked together to provide meaningful educational opportunities. This report highlights the major accomplishments and memorable moments from the period. I. OBJECTIVES: 1. To prepare students for future careers through practical and skill based learning. 2. To provide exposure to various industries and professions through immersion programs."
    },
    {
        "image": "narrativereport2_synth_9_aug5.png",
        "label": "Narrativereport",
        "ocr_text": "L Hi. Department of Education Region 13 Division of west snannonsorough College of National High Schoo! Baker, $710 Jennter Vitages Apt 247, Not Jennter, OT {8b6 NARRATIVE REPORT IN Msi At. $%2017 2021 INTRODUC TION: OBJECTIVES: 1. To Prepare students for future careers through practical and skill based learning. 2. To Provide exposure to various industries and Professions through immersion Programs"
    }
]