[
    {
        "image": "nbc4612_aug1.png",
        "label": "nbc461",
        "ocr_text": "To the Compensation and Classi Plan for F; Embodied in National Com, Circular (NCC) No, 69 Lo Purpose wey tetla is inmued to estan Prescribe rules ang Beverning the imy of the Revised ©, and Position Clann” Plan for fac: iti in SUCs, HEIs TEls in accordance with the modified Common Criteria fi Evaluation (CCE) of faculty positions, 2 0 Coverage ang Exemption 3 0 Revised Point Allocation 31 (CC) so. Odie CCE and Cea ive Ci the ident of PASUC, Per Annexes and 2. the fo} here: 1 Nowin Pint allocation Tor teas S| ng “4 Pagsulongy”"
    },
    {
        "image": "nbc4612_aug10.png",
        "label": "nbc461",
        "ocr_text": "RAPORIC OF Fug PRR BPR ES DEPARTMENT OF BCDGET awn MANAGE: BALACANANG, BHA dune 1, 1999 Oo The Chairesan, Comeieeon Dbrecter Goneral, Tecinicat Awhority (7 SDA Hegely (SUC, and Hewes of CH oe Rights Educating Hi Education and Shdtis Develepneme of Stal Universities and Cotepes EE? -Bugervised Higher Education leetitutions CHRIS) sad ESTA Supservicod Vechaical Education faxtewtions FTES). amd AM Others Crmeenedt Hevining and Updating ihe Canpersaticg Clasaifiention Man for Paowty ©. Componnatios Chreuter e SUMIECT owned i cetahtiets ang press: ‘aiion Of the Revised iy fice ie SL lod Common Critorke for E vatloationy 28 Coverage ant Exemptiny SCS, HEis and Tig dance, swcept tesching and schocs which shall conthiae ide of the Depaitiment of 38 Rowised Polat Alneation 34 Consistent with the maxdified OCE 2 joindy esrnuh; Jovtributes Rvstuaion ‘hairman of CHED and PAY attached ieptomerting Giidelines aod follordep pit atocation for facuky positions Ammeses fant 3, the hereby adogted: i “Pwlongetisteossg sae Paguslongy” iw"
    },
    {
        "image": "nbc4612_aug11.png",
        "label": "nbc461",
        "ocr_text": "ASPURIC GF Tae eniLePiNeS REPARTMENT OF BUDGET AND vamiehia det te $9 MALACAMANS, WARTLA Jinve 1, 1388 ra ‘Yiu Chairman, Commisvan om Higher Educstion (CHED), the Mirectar oeneral, Teelieal Education and Skis Development Amtherity (PESDA) Heads of State Universities ami Citas (SUC), and Heads af CHED Superetaed Higher Eevadtion jnsiiiations (HEIs; aud TESDA Rupervised Technical Eaucation instinstions (74s), and All (thers Concerned SUBIRCT Revising amd Updating the Cenpensation and Position assificaGen Pian for Fecutiy Posttioss Kentodied iy Nationa! Compensation Clreutar (1003 Ne. 69 10 Perpese ‘Tins Ciralar ix ismued fo estwblich amd peoseriba raler and regulations goveming the daplemenistion of te Revised Campenistion aul Positia Chavaification Plan tor faculiy positions m SUCs, HEk and THis in accordance with the modified Comment Criteris for Ryaiustion (O01) of faulty positions, a Coverage and Exemption (Secular shail apply i ali Tacutiy positions in SLCs, Pile aad THis, imuliding caching povitions asigued to taburmtory chees except teaching and elated tcadang positions i secondary and chonemary schools which shall cantimar fg be. ‘i Gy the Teachers Preparation Pay Schedule of the Department of 3 0 Revised Poiat Aflucation 3} Comsdstont with the amundified OCE and Chsal joindy formulated amd proacsitert by the Theskden of B, Amiexes 1 and 2. heroby adegied: y Conkvtation Evaustion the Chutrnas of CHED and ASUS, por atachs! baplementing Guidslines sod swing pom allscation fur faculy pomtions is i i i “Tulong tulong sa pageutong!* hy {"
    },
    {
        "image": "nbc4612_aug12.png",
        "label": "nbc461",
        "ocr_text": "foerrera® e ‘ RELEASE 5 -, Capiead Mocexdy Bie iy ys ae Tue POOLE BUBGET AKD M. ABAGEMEST a RES 4 ET, the +O “The Chaiteaa. Commsiatet DMrector Cacer st Techniest Heucaiios and Wilkes Revelagnnest auathority PTESDAD Heats af Sate Universities and Colleges a aud teste af (HED Sap Uighte Education igatneans (ibisy an 5, aungervived Tasbodcat Peducus teeters reins and All Others Concernet Upton the Compenssos god Postiet Pigs for Faculty Positions Fyebedied i ational Gace Ne supsecT ftevising and Cissslfinstiowt Campensates Cpeuier 12 Purp wad preseibe goles oad ‘Ths sa is ime tS oatatstiels geet, tie iexplermentation af the jscah Cammpenerhor CLasiiication Plas for focalty position® io SLs, Hs anal TEs the aed Corean Ordena fox Eevaioation (06 4) of Exnalty pusiens. 2 8 Ths as invohesclinegs, ng, positions ganged 1 jataratery chesete Ft related 2em gg, omens sccomebary and cleat schools whieh yall cement to be cerverod bY the 7 vs Propaeatins Pap edule af the Preparimertt af Fduesting, Cxitane 38 Byer au Revised Point Adocatient Canetti Evaluation COE and Caualistne svat by the sent with the mosified ae womely fopmulaied geal gree the Pravikeatt of PASUC, BT ached bey caening, Cann Ant 1 and 2, Be ant gliosation [ot facolty postion is hesiy aiogiod: quinn of HED and and \"i"
    },
    {
        "image": "nbc4612_aug13.png",
        "label": "nbc461",
        "ocr_text": "HE PHILIPPINES f DEPARTMENT OF BUDGET AND MANAGEME MALACANANG. MANILA No. wr June 1, 1998 ro The Chairman, Commission on Higher Education (CHED), the Director General, Te i “ducation and Skills Development Authority (TESDA), Heads of State Universities and Colleges, (SUCs), and Heads of CHED. ‘upervised Higher Education Institutions (HEIs) and Tr DA Supervised Technical Education Institutions (TEIs), and All Others Concerned SUBJECT Revising and Classification Ph Compensation Updating the Compensation and Pp lan for Faculty Positions Embodied in National ‘ircular (NCC) No, 69 ‘osition Lo Purpose This Circular is Nsucd to establish and prescnbe rules and fegulations governing the implementation of the Revised Compensation and Position Classification Plan for faculty Positions in SUCs, HEIs and TEIs in accordan the modificd Co ce With mmon Cnteria for Evaluation ((¢ h) ot faculty positions 20 Coverage and Exemption This Circular shail apply to all faculty positions m SUCs, HEIs and TEls, including caching positions assigned to laboratory classes except teaching and related teaching positions in Secondary and clementary schools which shall continue to be covercd by the Teachers Preparation Pay Schedule of the Department of Fducation, ulture and Sports. J Revised Pont Allocation 3) Consistent with the modified CCE (QOC®) jomuy formulated and pres: the President of PASUC, Annexes and Qualitative Co, cnbed by the Ch, Per attached Implementing Guidelines and the following point allocation for fac Ulty positions is ninbution Evaluation and >, hereby adopted “Tulong tulong sa pagsulong! Sw"
    },
    {
        "image": "nbc4612_aug14.png",
        "label": "nbc461",
        "ocr_text": "BAP VEL OY THAR PATLINPINES a SEPARIMENT OF BUDGET AND MANAGEMENT Sade 4 FRieges é AEALACAMANE, MANILA dhe ELe aa gs Giete Recwese tiloe June 1, 1998 ra ‘The Chairmen, Cemminsion oe Uigher Edacation iCHED) she Direstor General, Techuicai Education and Skits Devriopunecet Authority (TESDA), Hawds of State Universities and Colleges is >, aed Ueadin af CHET Supervised Higher Edecutlens imviaion: (7Eis} am) TESA Sugersined Technical Uxtwestion lnatitythne (THIS), amt AL Other: Concerned SUBIBOT Revising and Updetingg the Compensation aud Paosithe: (essifiextion Plan for Facuty Positions Eeviexdied iv National Compensation Cirevlar (MOTT) Nin. 69 LS Purpee ‘The Chalar i: iesned to satabloh ond prescsibe cules aret iegutations governing ihe geolomcniatio: of ths Revised wmpensation and Position SSuitification Plas for faculty pusitions in SU s, HEIs and THis in accordamee welt the muntiicad Common Onteria for Evaluation (690) of froulty pasigann, 28 Coverage and Exemption poutor pata apply te a faculty Rovian: in SURS His and seid sleneay sch which sil canada. af the Uwparkacnt of aieatios, Ciba gad Sparts, 5 Revived Polat Alsewiion 3 5 wath the modified CCE and Qualitative acinintion fvaheation eiuheiod and pr PA “) fet attached Impions ing Ghudelines and a “1 and 2, the Fvlkaving polat alocetien ieee pen ate far Tauulty positions te A - “Pudeng tulougy see pagsalong!”"
    },
    {
        "image": "nbc4612_aug15.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BU MALACANANG, MANILA NATIONAL BUDGET CIRCULAR No. June 1, 1998 ‘The Chairman, Commission on Higher Director General, Technical Education and Skills Development ‘Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHED Supervised Higher Education Institutions (HEIs) and TESDA Supervised ‘Technical Education Institutions (TEIs), and All Others Concerned ating the Compensation and Position TO SUBJECT Revising and Upd Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 1 0 Purpose This Circular is issued to 4 qeremint in implementation of the Revoed, Compeaxion, so Classification Plan for faculty positions in SUCs, HE! i the modified Common Criteria for Evaluation (CCE) of faculty positions. 2 0 Coverage and Exemption ‘his Circular shall apply to all faculty postions in SUCS, HEIs and TE cud Cg ponions asigood 10 iaborlry clases except Mating Se ini ona i socondary and cemeéniary schools which shal Som related teaching PorrTcachers Preparation Pay Schedule of the Deparment of Education. Culture and Sports. 3 0 Revised Point Allocation 3 1 Consistent with the modified CCE and Qualitative Contribution Evaluation (QC) jointly formulated and prescribed by the Chairman of CHED and the President of PASUC, per attached Implementing, th Pred, the flowing point allocation for faculty posiions \"Tulong tulong sa pagsulong!” hw"
    },
    {
        "image": "nbc4612_aug16.png",
        "label": "nbc461",
        "ocr_text": "REPUSLIC OF YRS PHILIPS DEPARYMENT OF BUDGET AND MANAGEENT. MALACTAMANE, MANILA Ne. ssi dune 1, 1998 ro ‘the Chuirman, Communion on Higher Education (CHED), the Direciort wre, Torknical Education amt Skitix Develapment Authoriiy PTESDAS, Hinds of State Universities and Cotieges (Ca, and Heads of CHED Supervised Highkr Edurstian instiiutiens (HEIs: and TESUA Supervieed Techateal Fducation lastitution: (78s), and AU Others Concerned SUGSERCT Revicing and Updating the Compensation and Pasities Chesifieation Plan for Faculty Positions Emiedied in Natlonat Componmdtion Circular (NOC) Ne, 69 16 Parpase View Cirente is issued i cetablich amd preaceibe rales and regulations 4 geveraimg the lmplementation of the Hevised Cumpensaiion aad Fovltion “tassiicaion Plan for faculty positions in SUC aml TEs in acovrdance with the modified Common Criteria for Evaination (078) of Gaculty positions, 2 0 Coverage and Exemption &, HEis and TH, pt teaching ond chemmaiary achonis which shall comings ‘ay Schedule of the Deparment of seisted ieaching positions a seca in he eo by the Tear Eshisation, (altars aad Sporty. ‘@ Revised Point Allocation ab ‘stent with the mesdified COE and Qualéstive Contelbution Evaluation it ity formulated and prescribed by de Chelan of CHED ail the Prosdent of PASUC, per sitecked by piomenting ‘juidelines ard Annexes and 2, the following point allocation for facuky postions ix hhoreby adapied “Padeong felony sax prgsuiang)” is"
    },
    {
        "image": "nbc4612_aug17.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND MANAGEMENT MALACANANG, MANILA TO The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHED Supervised Higher Education Institutions (HEIs) and TESDA Supervised Technical Education Institutions (TEIs), and All Others Concerned SUBJECT Revising and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 1 0 Purpose This Circular is issued to establish and prescribe rules and regulations governing the implementation of the Revised Compensation and Position Classification Plan for faculty positions in SUCs, HEIs and TEIs in accordance with the modified Common Criteria for Evaluation (CCE) of faculty positions. 2 0 Coverage and Exemption This Circular shall apply to all faculty positions in SUCs, HEIs and TEIs, including (caching positions assigned to laboratory classes except teaching and related teaching positions in secondary and elementary schools which shall continue to be covered by the Teachers Preparation Pay Schedule of the Department of Education, Culture and Sports. 3 0 Revised Point Allocation 3 1 Consistent with the modified CCE and Qualitative Contribution Evaluation (QC8) jointly formulated and prescribed by the Chairman of CHED and the President of PASUC, per attached Implementing Guidelines and Annexes 1 and 2, the following point allocation for faculty positions is hereby adopted: \"Tulong tulong sa pagsulong!\" fw"
    },
    {
        "image": "nbc4612_aug18.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC G8 Tuan pai epwes GEPART MENT or SUEGET AND M4 AGEMENT TALACAMANS. Meanie ‘Sussees Ne. 355 dure 7, 100 Pe The Chaiaws, Commnidsios oo Higher Education SOHO, the Director General, Tecknieat Falweation aad Stilt Development Aadhorily (TESDAS, Heads ot Sate Uaiverstiles and Mieges (SEMZS}, ana Huse of CHED Supervised Higher Education Tastiiations CHE: ang TESDASapmevinesdt Tecbateat Educating Institations CPEis), nd AR Others Conesrsed SUBIECT Revising and Updating dhe Compensation snd Parities Classification Plan fer Racsit Positions Rarbedied by Naiiownt Comnpenation Circuter ENCOG Ne, go Parpeme Thie Clrsular kemsed i wanda 2 Revewing tu fyplomentstion of abe: Claceificniion Plan for froulty positions in SLs, the miextified Common Cyteris fay Eowhantion (€ 28 feeerage aasé Raenption Ties Clesuler shalt apely te all sicheling ‘caching Posiions sanigned s feluied inaching pesitions in scootiny and demeniery schiescle which shall contions in he covered by the Teackvers Prepanien Pay Schedats af te Department of Education, Culnae and Savers, faculty pugitiens ig SUC fe laboratory classe gx di Ruviead Poi Alkowatinn 42 Ceesdatont with the melified fe tly toeeulsted and Promctbes by the Chatresan lod of PANLIC, bet attached Implementing eek Ean 3 the ilewing gain aiocation for fe: CCK wd Quaditathe cnitibution Evaluation any sonttions iy WY Sehogtead: ree P aos) i “Vokosg tulimg sg Pigaudang!” je Lame J"
    },
    {
        "image": "nbc4612_aug19.png",
        "label": "nbc461",
        "ocr_text": "y TTI OFFICIAL’ SRELEASE REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AN MALACANANG, MANILA ONAL BUDGET CIRCULAR No. 41 June 1, 1998 ‘The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHED Supervised Higher Education Institutions (HEIs) and TESDA Supervised ‘Technical Education Institutions (TEIs), and All Others Concerned 1D MANAGEMENT 10 Compensation and Position Revising and Updating the bodied in National Classification Plan for Faculty Positions Em! Compensation Circular (NCC) No. 69 SUBJECT 1 0 Purpose jssued to establish and prescribe rules and regulations the Revised Compensation and Position in SUCs, HEIs and TEls in accordance with uation (CCE) of faculty positions. This Circular is governing the implementation of Classification Plan for faculty positions the modified Common Criteria for Eval 2 0 Coverage and Exemption This Circular shall apply to all faculty positions in SUCS, HEIs and TEls, including (caching positions assigned to laboratory classes except teaching and related teaching positions in secondary and clementary schools which shall continue to be covered by the Teachers Preparation Pay Schedule of the Department of Education. Culture and Sports. 3 0 Revised Point Allocation 3 1 Consistent with the modified CCE and Qualitative C ‘ontribution Evaluation (QCE) jointly formulated and prescribed by the Chairman of CHED and the President of PASUC, per attached Implementing Guidelines and ‘Annexes and 2, the following, point allocation for faculty positions is hereby adopted: \"Tulong tulong sa pagsulong!” fw"
    },
    {
        "image": "nbc4612_aug2.png",
        "label": "nbc461",
        "ocr_text": "fe SORFICMELy PRELEagE R a ee Shite Freres sities ALAC ASANG, MANILA dune 1, 8 The Chairmen. Ceauniedon on Higher Kawcation (CHED), the Pxrectar Gemerst. Teskwkest Education sag Skifls Devehopeest Authority (TESA) Heads af Stet Universities and Calteges (Sie, snd Heels of CHED Sugervisad Tigher Education igstitonons (HED am 7 267A Sapervieed Tehnicel Education leodieartions «TEI, and Ai Othees garcerned To Pe Updating te Compenation asd Ponder Chestficatton Plan ter Baenlty Vosition: Kurtadied) ts Nadionsl Coerepnnnations Cieeutar (HCC) Bee oe 18 Perpest presutiie oales ans rogedaticees juened ter establish aan si Commpornationt asd Postties this Cireuler ie governing Bie ignglemeaabon of the Hewen Clayification Plas tor f gupeidiona i SUC\", HEIs and TEs socontiarsen its 4 faculty postions. Cosamon Crteta for Rvalaation (COR) 3 fecnity pusitions 1 $UCs, HE aad TEs. ap jahoratery castes ceeeps hing arch ev ccimots which shall contiete af Be Dopartent of inching ‘naching velsved cogubing, pst ey te covered by He Edogation, Cains suse Ses 4 6 Heviged Poiat AReotiiek aalitative Cenmntbation Exahasiiens by dee Cheeimast of CHED and tod iapemonting , ond fog facelty positions 2} joint formuleted ead pecs tort of PASLIC, por alae Aaswxes anit 2, the fefiowing point silocation hereby adopted: ee | “Telong tulong sa pagestong!” ie Be"
    },
    {
        "image": "nbc4612_aug20.png",
        "label": "nbc461",
        "ocr_text": "La By 2 3 8 SEPURUC DF Tug PRR GES DEPART RENT OF BU DGEY MALACANANG, Mane Pap The Chuteman, Conamienon Ddrectar Cenerys, q Authority (TESBAy Mende aF0Cs ang Hewes oF lostitutions (HEIs) Edhication lestitaties Cy Chesificaten Pty Compensation Ole Circular is inened the eaplememation of Aastification Phas the codified Comes ‘Wteris ‘ernie and Exemption ss Cirenfar chair ayy Ge all mchuding aching: positions ase related seacking postions Hh socens 10 he covered fe Be 7 Eeiucotion. Culture ann Sparta Revived Point Allocation: Bt Wert With Ge modified faa Jointly formulaved and py: eM of PASLK per iamd 2, the Sokowieg, “F hongetutony cd if Le: and Updating ase Comp: te establish ang pr for faculty pamitinns Joe Evatuation (¢ Ymed te lob AND MANAGEMENT £0 Fp, hag) 4 Wels! Persesy Dison on fase So gat dune £, 190y on Higher Eduontion echnical Edvcsiion and met FE SDASunerviged Bx (TELS), ened All Ottery Cone: seottbe rales ane ica’ HEL and 1 Sacaky peesitionns jay SLUCs, HEIs and Qualisative TDR ES tseribed by the Baitman of alached Srplemon: peut alblecsting fay PM gsccdongg! ja a Teetinicat CEE enaation gut Position for Paeutty Pasiticars thar MOO) Ne ge 4 Nationa? Popuhaliensy RpsteatON and Positican i accordance with J of faculty Positions, aed TEbs, ‘Valaetion TED and ting Guldelines ang Of faculty popitions i"
    },
    {
        "image": "nbc4612_aug21.png",
        "label": "nbc461",
        "ocr_text": "h REPUBLIC OF THE PHLLIPPINES gy DEVARTMENT OF BUDGET AND MANAGEMENT MALACANANG, DIANA. 3 VO The Chairtaay, Comniisston on Higher Education (CHED), tse EXrector Generat, Technical ducaiion and Skitly Development Aathortiy (TESDA) Heads of State Universiiles and Colleges (SCs), and Heads of CHED Supervised Higher Education insiitutions (7Eis) and TESDA Supervised Technical Education tantitutions (TE 4s), and Alt Others Cuncerned SURMIECT Revising and Updating Ge Compensation sod Position Choasification Man for Faculty Positions Smbodtied in National Compensation Circular (NCC) Ne. 69 1 0 Purpose Thus Circular is teaued t) catablish and preaciite rujes and regulations govermeg ine wupicmertation cf the Revised Compensation and Postron Classification Plan for faculty poxitons in SUCs, HFis and TES in accordance with the oexifiod Comevwn Criteria for Evaluation (CCE) of faculty positions. 2 0 Coverage and Exemption hss Circular shall apply to ail faculty gositions m SUCs, MEis and TEs, techiding caching positions acdgned to labmiatory clatsca ox teaching and related toaching positions mi sccondary and cleneniary schools witich shall continus to be covered by the Teachers Preparation Pay Schedule of the Department af Faucation, Culture and Sports, 3 4 Revised Puimt Aldocation 34 Consistent with the modified CCE and Qualitative Contnbution Evahuation (Ke ointly formulsted and preseribed by the Chairman of CHED and the President of PASUC, por attacked implementing Guidelines amd Annexes ate ihe following post allocation for faculty positions is herby adopted: f RA “Yulong tul L/ 3 ulong fulong se pagsuioang! fw"
    },
    {
        "image": "nbc4612_aug22.png",
        "label": "nbc461",
        "ocr_text": "REPURLES OF THe PHIL SPE ES DEPARTMENT OF BUDGET AND BDA Sly) y MALACANANG, MARELA Po The Chairmen, Commission on Higher Education (HED), ike PMirector leneral, Teclwies] Education and Sijfls Tavclopmest Auvthority (PERBA), Meade of Bate Universities and Colleges (SUCs), and Hees of CHEDSepervsed Nigter Education insiltudioas GIRIs> aud Sh Ruperviend Technical Uducution fostitutions (TEis), and Al Others Concerned SUBIEC Revising and Updating the Compensation and Position ChesHicstion Plas for Faculty Pevitions Eerbodhal ln Matkunat Campensation Ciresiar (NCO) Ne. Oo Le Parga Thus Cisoular is imued te establish and pryscribe rokea and requisitions governmy ‘ie weplomentation af the Revised Compersation and Soest ‘Clasmification Pisn for faculty positions br SUCs, MES and TEs in accordance with the modified Cummon Criteria fov Evaluation (C08) of faculty gestions. 2 0 Cuversge and Exemption Yios Circular shali apply in all fneuky poeiions in SUCa, Hele and TEIs, including, leaching position: assignsd te leboraiory classes except ieaching and olvted tesching: postions in scooadary and clementary achools which shall comticae ip be covered by the Teachers Preparation Pay Sohedude af te: Department of Edteecation, Cultens and Sport, 38 Revised Point Allocation 3} Somsisinnt with tbe modified COR and Ceasitative Contibation Evaluation (OXCS) jomily foremulated and prenonibed by the Chairman of CHED aed the Preaiderd of FAS per attached laptomenting Guideles ami Aumexee amd 2, the following point gllocation for faculty positions is horely adopted: ee! baa) “Talony tulong oa pagesloug!\" fy ee |"
    },
    {
        "image": "nbc4612_aug23.png",
        "label": "nbc461",
        "ocr_text": "RRPURLIC GF Tay SLES BESSEEMEMS oe BUDGET AND Manag EMENY WALAR ANA we MANILA Saas aed ‘The Shnirenan, Commalssion as Higher Educuiion “MED, the Dirertor Geecrs!, Teckuteal Keueution amd Skills Development Shariiy TESTA) Heady of Bente Ualvenities and {SUCs), and Heads of CHED- Supervined igher Pducating insiitationn GHEIsy mod TESDMSaperviod Technirat Eviueating lntiastions {TEs}, and Al Dithers Conceyned SUMECT Revising and Upslating the Comipeisation and Pevatiinse ChesHiowion Pie far Faculty Positions Rebedied iy Nation Ceaapensaiion Creuse (MO Ne. 69 it Parpese Ties Gleeaber i ienued to establish and prosuthe ndes and Pegg aticney gowaning the implementation of ge Revised Compersadon ad Portion Chawsification Plan for fyouty peanticess i wad TEIe the masditied Comsecm Ceiteria fox Evalestion 2 6 Coverage and rempene ‘This Clroular shalt agpty to all facutn ating ceoching pocitions aeigned to baberatory chwsox ey od iganhing pnaltions i suuenelary nt levadnury achesohy: which thal comiis i be covered by he Toschers Preperation Pay Schedule af the Departnes af Tehwation, Outs Hd Syets, pesitions is SUC, Ei and THis, 34 Revised Poine Altacation 3 2 Consistent with the modified OOK and Qualltation Conuiadon (UCC) joins formutaied and proscribed by the Chaioman of Ct wend the Pavsident of PASUC, gar siiched Lepleencntios Gnidelines sad Amgexes 1 gest 2, tie following pois gilecution for facuhy pesitiony i heorwity: sateptedd iE Ce i * “Tatong tnelong wat posngsestesreg!"
    },
    {
        "image": "nbc4612_aug24.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND MANAGEMENT MALACANANG, MANILA 3 TO ‘The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHED Supervised Higher Education Institutions (HEIs) and TESDA Supervised Technical Education Institutions (TE1s), and All Others Concerned SUBJECT Revising and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 1 0 Purpose Ths Circular is issued to establish and prescribe rules and regulations Brvemune the implementation of the Revised Compensation and Position Classification Plan for faculty positions in SUCs, HEIs and TEls in accordance with the modified Common Criteria for Evaluation (CCE) of faculty positions. 2 0 Coverage and Exemption 3 0 Revised Point Allocation 31 Implementing Guidelines and Annexes and 2, the followi point allocation for faculty positions is hereby adopted: “Tulong tulong sa pagsulong!” fw"
    },
    {
        "image": "nbc4612_aug25.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND MANAGEMENT MALACANANG, MANILA 5 Bots NATIONAL BUDGET CIRCU LAR To The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHED Supervised Higher Education Institutions (HEIs) and TESDA Supervised Technical Education Institutions (TEIs), and All Others Concerned SUBJECT Revising and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 1 0 Purpose ne he ati issued to establish and prescribe rules and regulations Clanification Pla memetistion of the Revised “Compensation and “mae the modal an Scully postions in SUCS, HEIs and TEs in scan tan ee the modified Common Criteria for Evaluation (CCE) of faculty positions, 2 2 0 Coverage and Exemption 3 0 Revised Point Allocation 3 1 Consistent with the Chairman of CHED and the President of PASUC, per attached ing Guidelines and hercty dopant! 2 the following point allocation for faculty pags hereby adopted: “Tulong tulong Sa pagsulong!\" fw"
    },
    {
        "image": "nbc4612_aug26.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND MANAGEMENT MALACANANG, MANILA Zions NATIONAL BUDGET CIRCULAR No. 4 June 1, 1998 T0 ‘The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development (TESDA), Heads of State Universities and Colleges Education A (SUCs), and Heads of CHED Supervised Higher and ‘TESDA Supervised ‘Technical Institutions (HEIs) Education Institutions (TEs), and All Others Concerned SUBJECT and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 1 0 Purpose cca ned wish prea Te aca ce atin eRe, OTT ac sree, tT ins SE the modified Common Criteria for Fvaluation (CCE) ‘of faculty positions. 2 0 Coverage and Exemption re case nh apy way, pian SUS MEN an “nai i at a oe) SE a oi iti 8 i an hmeetay aco wich Si meen i y Schedule of the of 3 0 Revised Point Allocation 3 1 Consistent with the modified CCE and Qualitative Contribution Evaluation (QCE) joi te mote cried by the Chimes of CO Se COCE) Fejont of PASUC, por attached, 1 ing, Guidelines and he Pre ot nig, pt lnion for Sey Pema hereby adopted: Tulong tulong s4 pagsulong!\" jw"
    },
    {
        "image": "nbc4612_aug27.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND MANAGEMENT MALACANANG, MANILA Gots, TO Institutions (HEIs) and TESDA Supervised Technical Education Institutions (TEIs), and All Others Concerned SUBJECT Revising and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 1 0 Purpose ificati, som f3city postions in SUCs, HEts and TEle in accordant the modified Common Criteria for Evaluation “CE) of faculty positions, 2 0 Coverage and Exemption 30 31 Seer (QCE) jointly formulated and prescribed by the Chairman of CHED and Amen ttf PASUC, par attached Implementing Geis wt Annexes 1 and 2, the follows Point allocation for faculty positions is hereby adopted: \"Tulong tulong $a pagsulong!\" fw"
    },
    {
        "image": "nbc4612_aug28.png",
        "label": "nbc461",
        "ocr_text": "REPU BLAS oF TNE PRULAPPENES: A OE PARTMENT OF BUDGET AND MANAGEMENT f OFrIoE ss [Pp RELEASE MALATANASG, MANTA \\ faetrat Bes Higher duration HED, the risen OT jon and Suits Develapment The Chainned, Com io Director General ‘Vechoical Palen Awenority PERMOS), Peads of State Liniversities and Categes pcs and Hewds ot CHE uperviaed Higher Kdcation aetigutlons (HEIs) and TESD a. Supervines Teckniest Educates institations cYEiey and Ale One Concerned SUBIR T Revise ana Updating the Copperalies apd Pasties Classification Pe far Faculty Positions Emibedied is National Compensation Cacoulac oy Me. 6F po Purpee sigoular is teeucd 1 estaltish nde anal regulations ompensakor and Poster Janos WHR the i Os, HEIs and TEs accor! goplemer agiy PORTIS AbankeTs i giuaon (OCT fas gj Exemption ze Coverage a 4, HEIs and TEs aching at ai facet md to lahoraiory <faswes fare and clemcruary whol ParAsOn Pan sehedle oF dye TS eph es pipich shall continue cpariment of ¥dueation. Cats Pein Ablocaliott aa Revised CE anal Qualitative PASE Proskdert of ex (and 2, the To! adopted sullen! “Tydong tlong 3 PAE"
    },
    {
        "image": "nbc4612_aug29.png",
        "label": "nbc461",
        "ocr_text": "REPOULIC OF Tite PHIL yEY DEPARTMENT OF BUDGET AND MAD NACE MALACANANS, BAMILA ro The Cheieaen, Comission ax Higher Educullen (HED), the Threriurdieavent, Techuical Eaineaiion and Shile Devclogement Avaiewity (TERRA), Henle of State Universities and Cofieges (hss, om Hemle of CUIED Nuserised Higher Edanstion instiuaions (3Risi sm? TESEASupevvised Techadvat Exhuctiens Uatitetions (TEs), aad Al Cheers Commernedt SUBIECT Revising and Updating the Compensation wai Position Chustfication Pien for Pacutty Pusitions Emtuatied in Nation Compensation Cireeler (NOC No, 6 Ld Parpes: This Cirortae is iesugd establish and prescribe mike ond regeloiens gevurniag the boglemeniation the Beveet Compemamon ax Position Classifination Pian for faculty positions in NUC s, and TEs accordance with ihe omubiiiad Comwnun Criteria for Evaiustion (1 A faauhy pootinns. 14 «Cowersge and Exonption This Cascader shell amply i all feenkey pawtiova in SUC, HEIs amd TGs, invleding icaching pestis asigned to lvporslory clases except tacking and Plated teaching positions a mcondary and clewdutary schools which shell contimw: cowed by the Toschers Preparation Poy Schedas of the Depastuet of on, Uniturs and Spars 30 Reviee? Pormt Atosation aa per stashed “Wnplernwatt Avaemes 2 and 2, the following gem dlogdion for faculty postions hesety adapted: (a) “Tutemeg twlong a9 pergentang!™ 7 ie /"
    },
    {
        "image": "nbc4612_aug3.png",
        "label": "nbc461",
        "ocr_text": "OFFiCcrat PRELEaSE & BLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND MANAGEMENT MALACANANG, MANILA Central Rececds Owsiea No. 1 _ June 1, 1998 The Chairman, Commission on Higher Education (CHED), the Director General, T echnical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHED Supervised Higher Education Institutions (HEIs) and 7 ESDA Supervised Technical Education Institutions (TEIs), and All Others Concerned oO ating the Compensation and Position SUBJECT Revising and Upd Positions Embodied in National Classification Plan for Faculty Compensation Circular (NCC) No. 69 1 0 Purpose establish and presenibe rules and regulaons the Revsed Compensation and Position in SUCs, HFIs and TEIs in accordance with ons, This Circular is issued t povermng the implementaion ot Classification Plan for faculty positions the modified Common Crtcna for Evaluation (C. 1.) of faculty posits 20 Coverage and Exemption This Circular shall apply to all faculty positions in SUCS, HEIs and Tis, including caching positions assigned to laboratory classes except teaching and related teaching positions in sccondary and clementary schools which shall continuc to be covered by the Teachers Preparation Pay Schedule of the Department ot Fducation. Culture and Sports. 3 0 Revised Point Allocation 31 Consistent with the modified CCE and Qualitative Contnbunon Evaluation (QC) jomtly formulated and prescribed by the Chairman of CHIED and the President of PASUC, per attached Implementing Guidelines and Annexes and 2, the following port allocation for faculty positions 1s hereby adopted \"Tuloug tulong sa pagsulong!”"
    },
    {
        "image": "nbc4612_aug30.png",
        "label": "nbc461",
        "ocr_text": "2 a8 REP URL Be THE Bery DEPART MENS OF Bea CANA NES, MAME PES BURGE ANB MANAGE RGERry Vay The CRalrvoge, Commssing ox Higher Education tCHED, the Director Gemeral, Teeketows Federcaticns tad Shy Pevsispunesse Authority (TRSDA) Heady of Stage Usiversities ened Patloges (SUC. seg Heasy ag HED -Sirprervigess Hileber Ekitoutions Seatittiony PER? swayed TESBAS ‘what Peotnjest Education Tinettirtlions tTE s), ang AH Cihees Coscerney UhInCy Revauiay Sted Lipa tise Conipemaation ant Position Chew cgtigey Plax fer Puculey Poritinang Rttiending ot Nistiveas Canepensntivas Cleevier ISOC5 Ne, eo 18 Purposes This Cirvular ig ised te, Seah apt Prsctibe rules ang Welter: BOVINE By: aplermeetsticns F the Revieed Comnprenssticen aa Peeiicee Chissifeas on Plas: foe Reedley gersisions SUC. HEL aed TEEs by ordonwe seit the metified Common Crteyis foe Byalaating ie of faculiy pew, aN Coverage and Seaton Tigs Sucutae aball appiy we at Brenly positions in Si inching isuching postion, Hird ie laborstory faseny, Pedated RecDbiowe pasistere iy BUOERCY sed chess tes s 68 coved by the ts (cima Sati, Cubans iequt fey Pe OR Pehgpced cae"
    },
    {
        "image": "nbc4612_aug31.png",
        "label": "nbc461",
        "ocr_text": "4 1, REPUBLIC OF THE PHILIPPINES ) DEPARTMENT OF BUDGET AND MANAGEMENT S OFFIC Tae MALACANANG, MANILA 7 c REL ease Cortrol Rececds Dwvisieg June 1, 1998 ro The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHEI pervised Higher Education Institutions (HEIs) and T ESDA Supervised Technical Education Institutions (TEIs), and All Others Concerned SUBJECT Revising and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 1 0 Purpose This Circular is issued to establish and prescribe rules and regulations governing the implementation of the Revised Compensation and Position Classification Plan for faculty positions in SUCs, HEIs and TEIs in accordance with the modified Common Cnteria for Evaluation (CCE) of faculty positions 2 0 Coverage and Exem; pion This Circular shall apply to all faculty positions in SUCs, HEIs and TEIs, including ‘caching positions assigned to laboratory classes except teaching and related teaching positions in secondary and elementary schools which shall continue to be covered by the Teachers Preparation Pay Schedule of the Department of Education. Culture and Sports. 3 0 Revised Point Allocation 3 1 Consistent with the modified CCE (QC®) jomtly formulated and presi the President of PASUC, per ai Annexes and 2, the following p hereby adopted: and Qualitative Contribution Evaluation enibed by the Chairman of CHED and ttached Implementing Guidelines and point allocation for faculty Positions is “Tulong tulong sa pagsulong!\" fw"
    },
    {
        "image": "nbc4612_aug32.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET . Matecatene ene AND MANAGEMENT VO The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHE! Institutions (HEIs) and TESDA Supervised Education Institutions (TEIs), and All Others Concerned SUBJECT Revising and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 1 0 Purpose This Circular is issued to establish and prescnbe rules and regulations governing the implementation of the Revised Compensation and Position Classification Plan for faculty positions in SUCs, HEIs and TEls in accordance with the modified Common Cnteria for Evaluation (CCE) of faculty positions. 20 Coverage and Exemption This Circular shall apply to all faculty positions in SUCs, HEIs and TEls, including caching positions assigned to laboratory classes except teaching and related teaching positions in secondary and clementary schools which shall continue to be covered by the Teachers Preparation Pay Schedule of the Department of Fducation. Culture and Sports. 3 0 Revised Point Allocation 3 1 Consistent with the modified CCE and Qualitative Contnbubon Evaluation (QCE) jomtly formulated and prescribed by the Chairman of CHED and the President of PASUC, per attached Implementing Guidelines and Annexes and 2, the following point allocation for faculty positions 1s hereby adopted *Tulong tulong sa pagsulong!” fw"
    },
    {
        "image": "nbc4612_aug33.png",
        "label": "nbc461",
        "ocr_text": "SUBJECT Lo Purpose 2 0 30"
    },
    {
        "image": "nbc4612_aug34.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND MANAGEMENT MALACANANG, MANILA 3 TO ‘The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHED Supervised Higher Education Institutions (HEIs) and TESDA Supervised Technical Education Institutions (TEIs), and All Others Concerned SUBJECT Revising and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 1 0 Purpose This Circular is issued to establish and prescribe rules and regulations governing the implementation of the Revised Compensation and Position Classification Plan for faculty positions in SUCs, HEIs and TEls in accordance with the modified Common Criteria for Evaluation (CCE) of faculty positions. 2 0 Coverage and Exemption This Circular shall apply to all faculty positions in SUCs, HEIs and TEls, related teaching positions in secondary and elementary schools which shall continue to be covered by the Teachers Preparation Pay Schedule of the Department of Education, Culture and Sports. 3 0 Revised Point Allocation 3 1 Consistent with the modified CCE and Qualitative Contribution Evaluation (QCE) jointly formulated and prescribed by the Chairman of CHED and the President of PASUC, per attached Implementing Guidelines and Annexes 1 and 2, the following point allocation for faculty positions is hereby adopted: \"Tulong tulong sa pagsulong!” fw"
    },
    {
        "image": "nbc4612_aug35.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND ws apap cc MALACAMANG, STANILA ro ‘The Chairman, Commission on Higher Education (CHED), the Director Genera?, Technical Education and Sidtls Development Authority (TESDA), Heads of State Universtiies and Calieges (SUCs), and Heads of CHED Supervised Higher Education institutions (HEIs) ami TESDA Supervised Technics? Educeiion Institutions (TEts}, and AU Others Coacerned SUBJECT Revising and Undating the Compensation and Position Classification Plan for Faculty Positions Embedied in National Compensation Circular (NCC) No. 69 10) Parpesw This Circular is insued to catabtish and prescribe rules and reguiations governing di: implementation of the Revised Compensation and Positon Chewification Plan for freulty positions in SUCs, HEIs and THs in accordance with the mostified Commun Criteria for Evahuation (OCE) of faculty positions. 20 Cuverage and Exemption This Circular shail spply to ail faculty positions in SUCs, HEis and THis, including Waching ponitions assigned to laboratory classes excep! teaching and telated teaching positions in secondary and elementary schools which shall continue io be covercd by the Teachers Preparation Pay Schedule of the Department af Education. Cultexe aad Sports. 3 4 Revised Point Allocation 34 Consistent with dic modified CCE ond Qualitative Contribution Evaluation (QCE) jomily formuisted and presuited by the Chairman of CHED and Annexes i and 2, the foliowing pomt allocation for fheulty positions is hereby adopted: \"Tulong fulong sa pagsulong:” ie"
    },
    {
        "image": "nbc4612_aug36.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND sso idl MALACANANG, MANILA NATIONAL BUDGET CIRCULAR No. June 1, 1998 TO ‘The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHED Supervised Higher Education Institutions (HEIs) and TESDA Supervised Technical Education Institutions (TEIs), and All Others Concerned SUBJECT Revising and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 10 Purpose This Circular is issued to establish and prescribe rules and regulations governing the implementation of the Revised Compensation and Position Classification Plan for faculty positions in SUCs, HEIs and TEls in accordance with the modified Common Criteria for Evaluation (CCE) of faculty positions. 2 0 Coverage and Exemption This Circular shall apply to all faculty positions in SUCs, HEIs and TEls, to be covered by the Teachers Preparation Pay Schedule of the Department of Education, Culture and Sports. 3 0 Revised Point Allocation 3 1 Consistent with the modified CCE and Qualitative Contribution Evaluation (QCE) jointly formulated and prescribed by the Chairman of CHED and the President of PASUC, per attached Implementing Guidelines and Annexes and 2, the following point allocation for faculty positions is hereby adopted: \"Tulong tulong sa pagsulong!” fw"
    },
    {
        "image": "nbc4612_aug37.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC GF THE PIOLUFINGS DEPARTMENT GF BUDGET ANE MARAGEMEN’ MALATAMANG, MAMILA Fae 1, 1998 TO The Chairmen, Commission om Higher Education (CHET), the Tirector Genoral, Technical Sduestion and Shifis Development Axthorty (TEADA), Meuds of Siute Universities end otleges (SUCs), and Heads ef CHEN Supervised Higher fstucation inetHutions (292s) snd TESDA Superviaet Toxluicat Education ineiiation: (TEis), and Si Oibers Concert SURIECT Revising ol Undeting the Compensstion aad Position iassifieation Pian for Faculty Postlions Ravkextied in Notions) ompontation Circular (MOC) Ni. 69 1 9 Porpune ‘This CNvoular ix isgued to esiavlish and presethe rules and regulations govern the implemaniation of the Reovisst Compensedion and Poertion Classification Plan for faculty posinons in 5! and THis in accombarace with the esdificd Conenem Criteria fay f monly positions, 2% Cnverage and Faemption Pies (Souler shall apoly to all Taoulty pencaions m SUCe, Mis art THs, viding icaviting pouting assigaed tn bnbursiory clamos axcept teaching, ond teaching positions in scocidry and clemeniar mie which ahall comisus wed ty the Tescbors Preparation Pay af de Tenaiment of E: Education. Culture sad Sporis, 5 2 Ravined Port Afiecation BE Consis ent with the modilied COE and (ualitatiee Contibution Evaluation by fe md prescrited by the Chairman of (HED asd Prosidemt of PAS Fer siteched beplomecting Guklelines ax? tun 3, dhe following point aliveation for Paculiy posidiens wy adipted: eed iD, eel ‘Tudong telong co pereacdongt je cae |"
    },
    {
        "image": "nbc4612_aug38.png",
        "label": "nbc461",
        "ocr_text": "2 3 0 lasses except teaching and oe conan Paton in secondary md eee, et ich i {0 be covered by the Teachers iducation, E REPUBLIC OF Tug DEPARTMENT MALACANANG, TO The Chairman, Commission Director General, Tech Authority (TE: (SUCs), Institutions Education I SUBJECT Revising Classifi Compensation Circular (NCC) No. 69 Lo Purpose te inp hand posite ie ad ps Bovering the impl of the Revised (, ion and Position Classification Plan for fac Positions in SUCs, HEIs and in With the modified Common Criteria for Evaluation (CCE) of faculty Positions, 0 Coverage and Exemption This Circular shalt Preparation Pay Schedule of the Culture and Sports, Revised Point Allocation 31 \"Tulong tulong sa pagsulong!\" jw"
    },
    {
        "image": "nbc4612_aug39.png",
        "label": "nbc461",
        "ocr_text": "Lo KEPUGLIC GF THE PHILIPOINES DEPARTMENT OF BUDGET AND MANAGEMENT MALACANAMG. MANILA frorercrs. Q epriease TO ‘The Chairman, Commission on Higher Faucation (CHED), the Director General, Technical Education and Skilixs Deveinpment Authority (TESDA), Heads of State Universities and Colleges (SUCs), amd Heads of CHLED Supervised Higter Education lastitutions (HEis} sad TESDA Supervised Technical Education lastitutions (1 Eis). and Ail Others Concerned SUBJECT: Revising and Updating the Compensation and Povition Clansification Pian for Faculty Positions Exabodied in Natlonal Compensation Circular (NCC) No. 69 Lo Porpase This Cicalar is tesucd to establixh and presorths rules and reguistions goveming the implementation ef the Revised Compensation and Fosition Classification Pian for froulty positions in SUC, HEIs andl TEs in eccordance with the modified Common Criteria for Evaluation (CCE) of faculty positions 2 9 Coverage and Exemption This Circular shall apply to ali facuity positions in SUCs, HEIs and THs, inchiding tcaching positions astigned to laboratory clauses execpt teaching and related teaching positions in sevordary and clementary schools which shall continus to be covered by the Teachers Preparation Pay Schedule of the Department of Education, Culture and Sports. 3 4 Revised Poiat Allocation 3 4 Consistent with the modified CCE and Qualitative Contribution Evaluation (QCE) jointly formulated and proscribed by the Chakman of CHED snd the President of PASUC, per sitached Implementing Guidelines and Annexes and 2, the following point allocation for fanulty positions is hereby adepted: “Teleng tulong sa pagsulong!” fy"
    },
    {
        "image": "nbc4612_aug4.png",
        "label": "nbc461",
        "ocr_text": "Ba, kerveic or tue pHuwemes DEPARTMENT OF BURGET AND MANAGEMENT MALACANANG, MANILA TO 3 ‘The Chsirman, Commision on Gigher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of Soste Universities and Colleges (SUC), and Heads of CHED Supervised Higher Education fastitutions §=(HEis} and TESDA Supervised Technical Edacation institutions (TEIs}, and Alt Others Coacerned SUBJECT Revising and Updating the Compensation and Position Chasification Plan for Faculty Positions Kavbodied in Nationsi Compensation Clrevlar (NCC) Na. 69 1 00 Purpose ‘This Cireular is iwsucd to establish and presoribe rules and regulations gevering the implementation of the Revised Cumpensation ant Position Classification Pian for faculty positions in SUCs, HEIs and TE s in accordance with the modified Common Criteris foe Evaluation (CCE) af faculty positions. 2 6 Coverage and Exemption ‘This Circular shalt spply to all faculty pusitions in SUCs, HEIs and TEls, inchding coaching positions assigaed to laboratory clawex except teaching and related reaching positions in xccondary und clemétntary schools which sheli continue fo be covered by the Teachers Preparation Pay Schedule of the Department of Education. Culture and Sperts. 3 4 Revised Point Allocation 3 1 Consistent eth the modified CCE and Quatitative Contribution Evaluation {QCH) jointly formulated and prescribsei by the Chaistoan of CHED ard the President of PASUC, per asiached Implementing Guidelines and Annexes and 2, the following point allocation for faculty poritions is herohy adopted: “Tuloug tulong oa pagsulong!” fu"
    },
    {
        "image": "nbc4612_aug40.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND MANAGEMENT MALACANANG, MANILA SBottsts TO ‘The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHED Supervised Higher Education Institutions (HEIs) and TESDA Supervised Technical Education Institutions (TEIs), and All Others Concerned SUBJECT Revising and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 LO Purpose This Circular is issued to establish and prescribe rules and regulations governing the implementation of the Revised Compensation and Position Classification Plan for faculty positions in SUCs, HEIs and TEls in accordance with the modified Common Criteria for Evaluation (CCE) of faculty positions. 2 0 Coverage and Exemption ‘This Circular shall apply to all faculty positions in SUCs, HEIs and TEls, including (caching positions assigned to laboratory classes except teaching and related teaching positions in secondary and clementary schools which shall continue to be covered by the Teachers Preparation Pay Schedule of the Department of Education, Culture and Sports. 3 0 Revised Point Allocation 3 1 Consistent with the modified CCE and Qualitative Contribution Evaluation (QCE) jointly formulated and prescribed by the Chairman of CHED and the President of PASUC, per attached Implementing Guidelines and Annexes 1 and 2, the following point allocation for faculty positions is \"Tulong tulong sa pagsulong!\" fw"
    },
    {
        "image": "nbc4612_aug41.png",
        "label": "nbc461",
        "ocr_text": "AEPURLIC OF Tue pau peng DEPARTMENT OF gi BGEY ANT MA SAGERENT MALACAUANG, Manna x Sous dane 1, 1998 POG ISLC, and Heads of ce vapervised Higher Enteeation institutions CYEIn acd es -Sepervined Tecbedrst Eduondion lnutinations TUBE), and Alt Others Concemed SLRS Revising and Updating the Compemuition grt Beaation Chnsificution Plan tor Facute Positions Kashodied in Mationnt Cesperation ‘Cireutar (Ni Ea Tile im acconianas writs of fasalty pensions ae Coverage and Exemption Tha Cantuler shalt apply te ali faculty pesitions i SUC#, His aul THis, lading caching esiicne suigred to Ishersory clawes enc cpt teackire ared ated teacher ok th sicoembary and elemeuwry scheats shall comiane i he covered by the ‘Toachers Py, whe af the Depasment of Education, (elours and Sports, 4G Reviunt Point Alowahiny 32 Comdstent with the mnoiitied CCE and Qualassve Conivibution Eaatuation COXCH) ke al prewar By thy Chabyoas HED and fies Bre Bur attaches! huplomenting Guideline ate Annes f and 2 ihe inlivwing point atlowation for fecadty positions i hereby acluprad: ae: y “Fuleng tmtong sa segazlong! hy"
    },
    {
        "image": "nbc4612_aug42.png",
        "label": "nbc461",
        "ocr_text": "2 30 Oo Ce REPUBLIC OF THE PH DEP, \"ARTM| MALACANANG. MA) ILIPPINES ENT OF By; NILA TO The Chairman, Director General, Authority (TE: (SUCS), ang Higher Education Institutions (HEIs) ang TESDA Supervised Technical Education I, ns (TEIs), and Ay Others Concerned SUBJECT Revising and Updating the and Classification Plan for Faculty p, Embodied in National Compensation Circular (NCC) No. 69 Lo Purpose This Circular is to be covered by the Teachers Preparation Pay Schedule c 7 Education, Culture and Sports, Revised Point Allocation 3"
    },
    {
        "image": "nbc4612_aug43.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND MANAGEMENT MALACANANG, MANILA Fetus, June 1, 1998 TO The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHED Supervised Higher Education Institutions (HEIs) and TESDA Supervised Technical Education Institutions (TEIs), and All Others Concerned SUBJECT Revising and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 10 Purpose This Circular is issued to establish and prescribe rules and regulations Boverning the implementation of the Revised Compensation and Position Classification Plan for faculty positions in SUCs, HEIs and TEIs in accordance with the modified Common Criteria for Evaluation (CCE) of faculty positions. 2 0 Coverage and Exemption This Circular shall apply to all faculty positions in SUCs, HEIs and TEls, 3 0 Revised Point Allocation 3 1 Consistent with the modified CCE and Qualitative Contribution Evaluation (QCE) jointly formulated and prescribed by the Chairman of CHED and the President of PASUC, per attached Implementing Guidelines and Annexes and 2, the following point allocation for faculty positions is hereby adopted: \"Tulong tulong sa pagsulong!\" fw"
    },
    {
        "image": "nbc4612_aug44.png",
        "label": "nbc461",
        "ocr_text": "RRPURLIC OF Fee PRRUPERN ES DEPARTMENT OF BUDCET AND MANAG: motel SMALACANAND, MANTA GFrrey ay PELE AGE Gist Soeveds Ding Fin deate 1, 1998 3 F The Chairmen, Commission on Higher Ederation ACHED), the Erecior Carneral, Technical Education and Sidils Development Authucity CTESDA), Heads of Stale Universities aad Cotteges IX, and Heads of CHEDSupervised Higher Education Wattwtions OFFS) wet 7 ASugerviant Teehstent Education Institutions (T8is), and Al Others Concerned SURIECT Bavieing amt Updating the Compensation snd Position Ciaifievion Plan for Feculty Pestions Barbodied in Nethone! Compensation Oreuler (NOO} Na. 68 i Purpese Thy Cyonlar is immed t extahlish and presedhe mice and reguistions ihe maplonentatios of tine steed Comapowation aad Position on Plan for Gseukty positions i 3 HEb and THis in avcordeme with the modified Common Criteria for Bvaluats af faculty poxitians. LG Coverage ai Exemption hail apgdy io oll fanalty pesitions im SUCs, Gla ad Ths, ne auigand to lborsacy cise cxeepl feaching aid Ties Carcass hove Preparation Fay Sehodule of de Department of eiers and Spent, 28° Revised Part Allocution Chiditstive Contibuties Evaluation tly fecsena er pre ied oy te Chatman of 2 and the Prosidamt of F per ativcked Grqnementig: Chui Annexes i aud 2, thy folowing point obocation for laculty pasizons is herohy adonted: {oe Gigs | “Tulony tadong 2a pagswlong?” iw “ee) ."
    },
    {
        "image": "nbc4612_aug45.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OO Re paaneees a DEPARTMENT OF BUDGET AND Managemmwr fF OF Fig 41 MALACAMANS, MANTA EARL Eas g 4 Se 8 Motel Recoeds Whiting“ TE The Chairman, Commsinton on Higher Education (CHED), the VWroctor Geoeral, Techical Education and Sidivic Develapment Authority (PESDA), Heads of Sisie Universities and Oateges (Cs, wed Heats of CHT) Superviand itiginy Uducation fostitetians i) amt 6 TESDA Supervised Terhaival EGucation inetitations (TE s), and Ad Others Concemed SUBIROT Revining amt Updating the Campedmation aad Pesitiv: Ciusstication Pian for Fecuity Pasitions Embodied ix National Cempeesatons Cweular OCG Ne. 69 14 Burpee ‘Ties Cineuiar ie hwued tm sembiiah and presombc vies and capdation: govern He implementation of the Heviesd Compensation eral Position Clasailivation Pian Sr Gaouliy positions SUCs, HPs and THls tn accontance with the moriGied Cares Crtesis for Evaluation 10° A} of faculty postions 28 Covernge and Exemption The Circular shall appiy to all facuiry Bastions im SUCs, fils and TEs, aiding wah positions saigned ie lnbarutary classes except feching and related teacking pexaions in sevencary and chonentery schools which shall contiaug fo be covcred by dhe Poachers Proparation Pay Sabedels of de Departement of Eibwation Culture and Sports, 48 Revined Polat Aflecativn 3 4 Consistent wilt the modifi E aad Qualitative Contritution Budhation QOCE) jointly formaleed and peoecritugd by the (hatensn the President of PASUC, per attached teaplensenting fet tae 2, the folknving pote allocation for fax ley positions is 28 {Renae} } aed i se) “Wialeswepfseleg sez pogenbeigi”"
    },
    {
        "image": "nbc4612_aug46.png",
        "label": "nbc461",
        "ocr_text": "TER PHaLaPiNes OLEAN NY OF Runs MAIACAMANC Mane a No. Si Sune i, yo08 to The Chatenar, Commison 6) Higher bAlucatinn (CHED), the Droste fener), om snd kite Devetopament Authotin rR Universities HET Oepes iSO), end Heads of CHD Supervised igder Education Institutions CRRIst seg PRSD \\-Supervined Pechinicat Fdecanon fastituttans C25 3h) ait AH Ottery Concensed SUBGEGrY Rewrtig one Update oe OMIDONSELO ant Peesittors Cleaieation Mas fox Pacuts Sovithorrs Euabediod ix Nstivena! Com pensation Clrcuinr (6 CoNe. oy 10 Parpone oe rcubae Bre i> reste Bordon thon Phan jor fac: the modifies wd presurths the Revised Pustiors wm SECs ED MOOS Orton foe MVahuation <¢cc 4 valex and; Compensation oath Is unt le Coverage and Exemption The Cuoslar oy SPPI a facutty ouepony SUCS HEL ony Mlscing MOR POR aesioned fe ladewatory Clasnes SXCCR eoching and ‘Slated terchiny Pearders ogy “Coon age! choy, LEY Schools ut, nh chat] conte SOveTT MY the Foss bows Preparation ea, Net Of Be Tk Parent of Vetwaren. ‘et Ports, de Revised Pung Moesiica 1D stews Guidcionn ang BBY Pombory os ementiny OE POM allocation tor fay"
    },
    {
        "image": "nbc4612_aug47.png",
        "label": "nbc461",
        "ocr_text": "ARPUBLIO OF Hey PRL INES BEFARTMENY OF BEDGET ANS Manag MALACANANG MaNiEy Ne 4B uae h, lose ro The Chairmen, Cneminission on Higher Hdecation iCHED), the Dtrectin Geney Hi, Techical Eduestion and Shale Develuprrens Sostharite 4 A}, Reads State Univeraitiog and Colteges (800%), and Hears Sf CHED. Supervised Higher Eatwcstion lasdintions gre Is} ge op V Gupervised 7 eehinions Education Institutions fF hand AM Other; Coacernedt dating the Compensation HO Position fan for Facuky ‘caitions Eumbestied ja Nations treater ONC Cy Ne gy SUBIBEE YT Revising and Up Classifleation 2 Compensation io Purges This Civcidar ia umacd tay my the implementation of t Plan for faculny the modified Common c stabi, ah and greaceihe wales and Tenidlations Revised Compensation and p fon Ts arid This accontance wit Ml Bacay Pasitiors, be Coverage and Exemption Ths Circular stat apaly jo pacduddings on. Hee positions related feschang ge BS Sh Secondary 18 Ge Covered by the Edtucarion., (saltups sind Sparte, ACs, HEIs anu TER, M teaching and and cloncniary schools w ch shall comtinnise Proparation Pay Schedule of the Oeperteent of 8 Revised Poss Aliocation Ag i with the modified COE ard Ouslltative ly formulsted and prtseribed by the aman of CED gr PASUC, Par attached implementing Cruldeliives and the Solhsving pein acation for Stualiv positions is “Tuloag tutous sa Pagssebeineg? fy"
    },
    {
        "image": "nbc4612_aug48.png",
        "label": "nbc461",
        "ocr_text": "RAPUBLIC OF THE PHILIPPINES g EPAREMENT OF BUDGET AND MANAGEMENT MALACANANG, MANILA ae) ‘The Chairmoa, Commission on Righer Education (CHED), the Director Genersi, Technical Education and Skills Development Autharity (TESDA), Heads of State Universities and Colleges (SUC), and Heads of CHED Supervised Higher Education Institutions (HEIs) «ad ASapervised —Tecknicat Education institutions (TEIs), anc All Odrers Concerned SUBIECT Revising vnd Updating the Compeesstion ant Position Classification Plas for Faculty Positions Embedied in National Compensation Ctecutar NCC} No. 69 ie Paurpese This Circuiar is temucd to exabiah cod proserihe ruleg act regulations governing te implementaiion of the Revised Compensstinn and Position Cisssification Pian for faculty poninong m SUCs, HEIs and THis in accordance with Ure modified Common Criteria for Evahiation (OCT) ot faculty positions. 20 Caversge and Exemption The Circular shalt apply to ail faculty postions in SUCs, HEIs and TEs, including caching positions assigned to taborsiory classes oxcept ieaching and relited teaching positions m secondary and cementary schovis which shall continue to be covered by the Teachers Preparation Pay Scheduk of the Departmen of Fducation. Culture and Sports, sa Revised Puint Alucation 3 1 Consistent with the modified CCE and Qualitative Contribuwon Evaluation {CXE) jomily formulated sad presceibed! by the Chasman of CHED and the Prositent of PASUC, per stiached Lnplementing Guidelines ond Antwxcs 1 and 2, tee following point allocation for f ulty positions is hervhy adopted: Ry “Tulong talong sa pagsulong!” iy"
    },
    {
        "image": "nbc4612_aug49.png",
        "label": "nbc461",
        "ocr_text": "BEreALic OF Te FHLAPPINES DEPARTMENT OF BUDGET AND MANAGEMENT oO y (TESDA) Heads of State {SUCS, srt Heads of CHED- Jantiations: (Eisp et ESDA Supervised Technical Faucations Lnestitations (TEis), and AB Dihers Concerned suBIECT Revising ant Updating a sity Positions Embed Le Perpene qOVETRENS, Bre gropiementation of the Revised Compensation and Poston coer, py pm SU, lad TE a rues tie modified Commen Critevia for Evaluation (OCH) of faonlty pomiians ze Coverage and Prcsptian 30 Revised Potat Altocation 3 Comistent with the modified CCE and Qualitative Contribution Evahuation Com Ty fore and yreacbed Wy the Chena CHED and heresies Of Mine flowing pins aaton for fay poion hereby adopsod: i \"Pafong tul sa a bd dong sa pagssslong!"
    },
    {
        "image": "nbc4612_aug5.png",
        "label": "nbc461",
        "ocr_text": "To : i Director Cescrat, ‘echmical Education snd Siditts Authority (TESDA), Heads of State Universitios and Ceileges (SUC, and Heads ef CHED- Saperviced tiigher Education Institutions Gary is} amet TESDA Supervised Perhebcat Education Institutions (TEISh, and AW ‘Olivers Concerned SUBJECT Revising aad Updating the Compensation and Position Classification Plan for Positions Emnbadied fe Nationa? Compensation Clreufar (INCL) Ne. 69 18 Perpose This Circular is ixsued to cathbich and geveming the js Preseribe rudoe and regulations implemeniation of the Revised Compensation ani Position th moneda ety postions in SUC Hite an TE ence the modified Common Criteria for Evatuation (OOR) of facuhy positions 20 Coverage and Exemption to be covered by the Teachers Preparation Pay Schedile of the Depart Education. Cubure and Sports, aa Revised Point Akocation 34 Consistent with the (QC) jointly formutsted and Preseribed! by the the President of PASUC, y ret clap 2 the following point sllxstion for uly jrereby adapted: “Tatong tlong sa pogsutong!” ie"
    },
    {
        "image": "nbc4612_aug50.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND MANAGEMENT MALACANANG, MANILA 3 TIONAL BUDGET CIRCULAR No. 46 June 1, 1998 Te ‘The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHED Supervised Higher Education Institutions (HEIs) and TESDA Supervised Technical Education Institutions (TEIs), and All Others Concerned SUBJECT =: Revising and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 1 0 Purpose This Circular is issued to establish and prescribe rules and regulations governing the implementation of the Revised Compensation and Position Classification Plan for faculty positions in SUCs, HEIs and TEls in accordance with the modified Common Criteria for Evaluation (CCE) of faculty positions. 2 0 Coverage and Exemption This Circular shall apply to all faculty positions in SUCs, HEIs and TEls, including (caching positions assigned to laboratory classes except teaching and related teaching positions in secondary and clementary schools which shall continue to be covered by the Teachers Preparation Pay Schedule of the Department of Education, Culture and Sports. 3 0 Revised Point Allocation 3 1 Consistent with the modified CCE and Qualitative Contribution Evaluation (QCE) jointly formulated and prescribed by the Chairman of CHED and the President of PASUC, per attached Implementing Guidelines and Annexes and 2, the following point allocation for faculty positions is hereby adopted: \"Tulong tulong sa pagsulong!\" fw"
    },
    {
        "image": "nbc4612_aug6.png",
        "label": "nbc461",
        "ocr_text": "B, RAPUBLIC GY TRS PRILIFPINES DEPARTMENT OF BUDGET AND MANAGEMENT TO The Chairman, Commission on Sigher Education (CHED), the PXrector Generat, Tecknicai Extacation aad Skits Thevelopment Authority (TESDA), Heads of State Universities and Coteges {(SUCs), and Heads of CHED Supervived Higher Education Institations (HEIs) and TESDA Supervised Tovtrateal Education lastitutions (Eis), end Al Others Cancerned SUBJECT Revising and Updating the Compensation aot Pasiticn Clessification Plan for Faculty Positions Embodied in Nations! Compensation Chreviar {NCC} Na. 16 Purpose Thin Clreular is ined ty extablish and presvaibe rules and regulations governing the i of the Revised Compensation and Position Claseification Pian for faculty positions in SUC, HEIs and TEI: in socontance with the modified Commen Criteria for Evaleation (CCE) of faculty positions. 2 8 «Coverage and Exemption This Cireular shall apply to ail facalty positions in SUCs, Bis ang TEL, inchating tacking positions assigned to laboratory classes except teaching and to be covered by the Teachor Pr jon Pay Schedule of the Deparment of Education, Cultars and Sports. 3 6 Revised Pawnt Aifocation 3.) Consistent with the modified CCE and Qualitave Contribution Evaluscen frerehy adopted: i Tutong t dong!” 2 viong tdong sa pagsulong! ie"
    },
    {
        "image": "nbc4612_aug7.png",
        "label": "nbc461",
        "ocr_text": "AMP URL OY Fae PL BPE BEPARIMUNT oF BOOGEY ann MANAGEME RY MALACARASS, Manna “Totty fuse %, 199K TE ‘The Chairmen, Commission 38 Higher Education RCHEDR, the iBrecter tenere, Tochnitsl Educetion gad Skills Dovelosmens Aatiurity (TESDAL Heads af (VCO, sud Heade of CHET: Superviead Higner Educatien lastttians ER) aed E Fechaient Edieention iessthiedions THe) mt An Gibers Concerned SUB ieeyY Revitieg sxnugt Opisting the Cor peevation and Pinte Classifications Pian for Faculty Prsitions Eatetvodiod iy Narieuat Compensating Clrcistap (NOC) Nin oe 1a 28 citlar shal! apply io ali scaitty pesis soohtng pedtions eeipesd to laboratory mi te SUCe, Ete asd TER, Faxaus axeept tesching aad related teaching pusitices ip eonentery and chew, seheois whieh shall Sorta to be convened by Feathers Preparation Say Siheduhe of the Departmget of Extuoatiog, (ah #2 Sports 38 Revised Poiag Allvecationns RW 1 and presented ay ies “baiicon of CHED and Per attacked snting Griktelines and Pigesma) i BD) “Tadoag tulony sa Prigaselosag? AS a es é"
    },
    {
        "image": "nbc4612_aug8.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND MANAOEMINT MALACANANG, MANILA To 3 The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHED Supervised Higher Education Institutions (HEIs) and TESDA Supervised Technical Education Institutions (TEIs), and All Others Concerned SUBJECT Revising and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 1 0 Purpose This Circular is issued to establish and prescribe rules and regulations governing the implementation of the Revised Compensation and Position Classification Plan for faculty positions in SUCs, HEIs and TEls in accordance with the modified Common Criteria for Evaluation (CCE) of faculty positions. 2 0 Coverage and Exemption This Circular shall apply to all faculty positions in SUCs, HEIs and TEls, related teaching positions in secondary and elementary schools which shall continue to be covered by the Teachers Preparation Pay Schedule of the Department of Education, Culture and Sports. 3 0 Revised Point Allocation 3 1 Consistent with the modified CCE and Qualitative Contribution Evaluation (QC8) jointly formulated and prescribed by the Chairman of CHED and the President of PASUC, per attached Implementing Guidelines and Annexes and 2, the following point allocation for faculty positions is hereby adopted: \"Tulong tulong sa pagsulong!” fw"
    },
    {
        "image": "nbc4612_aug9.png",
        "label": "nbc461",
        "ocr_text": "REPUBLIC OF THE PHILIPPINES DEPARTMENT OF BUDGET AND sag on MALACANANG, MANILA 7 -> ORs ay TIONAL BUDGET CIRCULAR No. 461 June 1, 1998 TO ‘The Chairman, Commission on Higher Education (CHED), the Director General, Technical Education and Skills Development Authority (TESDA), Heads of State Universities and Colleges (SUCs), and Heads of CHED Supervised Higher Education Institutions (HEIs) and TESDA Supervised Technical Education Institutions (TEIs), and All Others Concerned SUBJECT Revising and Updating the Compensation and Position Classification Plan for Faculty Positions Embodied in National Compensation Circular (NCC) No. 69 1 0 Purpose This Circular is issued to establish and prescribe rules and regulations governing the implementation of the Revised Compensation and Position Classification Plan for faculty positions in SUCs, HEIs and TEIs in accordance with the modified Common Criteria for Evaluation (CCE) of faculty positions. 2 0 Coverage and Exemption This Circular shall apply to all faculty positions in SUCs, HEIs and TEls, including ‘caching positions assigned to laboratory classes except teaching and related teaching positions in secondary and elementary schools which shall continue to be covered by the Teachers Preparation Pay Schedule of the Department of Education, Culture and Sports. 3 0 Revised Point Allocation 3 1 Consistent with the modified CCE and Qualitative Contribution Evaluation (QCE) jointly formulated and prescribed by the Chairman of CHED and the President of PASUC, per attached Implementing Guidelines and Annexes and 2, the following point allocation for faculty positions is hereby adopted: \"Tulong tulong sa pagsulong!\" iw"
    }
]