[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "nbc461",
        "ocr_text": "NATIONAL BUDGET CIRCULAR 461 (CYCLE 9 March 05 2020 ULTY Gkain and External Campuses} YO ALL PERMANENT F. cycle evaluation, please take note of “2é0\" The President s Office announces the opening of ihe NBC 48! evaluation Eu oae submission deadlines. i! 12 1998 Fae ulty members begin collect ng all relevant documents fo sup. port thelr rankin: g claims. April sree anrata me departmental Sqmliliees Hew dossi ers and fc forw verit fea entries fo t 6) id May 21 2018 The HR consoli idates the Ras Ae coordinates with the 21 evaluators for computation. August 19 2021 The insti tuti ion finali iZes Ke ranking list and submits it to PASUC for validation and approval."
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "nbc461",
        "ocr_text": "GT, RA9299 Republic of the Philippin July 16 2018 Gct fz Moore and Sons Acade my BS I) NOPS (1907) NOTS (1927) EVSAT (1968) cvpc (1983) sine py PSC 6169, Box 9654, APO AE 52372 1 8 a 1 Te 9981809002 Favze7484512°\"\"\" feliciaS2 exampierpetl www torres jon info! Phone: NATIONAL BUDGET CIRCULAR 461 (CYCLE12 ANNOUNCEMENT March 05 2020 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the coming Institutional NBC 4614\" cycle evaluation, please take note of the following schedule: Mast\"? The President s Office announces the opening of the NBC 461 evaluation ets submission and fers in collecting all relevant April 12 1998 Faculty members begi rt their ranking claims. documents to suppo January 19 20°\", The department committees ossiers an veritie eninies to fhe 1 OAC. May 21 201 ay 8 The HR co, onsolidates the reauilts Be eva dina for Fe utation. august 192021\" The insti ution, finalizes the ranking list and submits it to ASUC for validation and approval. ———"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "nbc461",
        "ocr_text": "Republic of the Philippines July 16 2018 2 _ Moore and Sons Academ Fs) NOPS (1907) NOTS (1927) EVSAT (1968) CVPC (1983) BOR mee PSC 6169, Box 9654, APO AE 52372 _ 18Q19869 09981809002 Fa 9g74845426mail Felicia52 @examptipet www torres jones info/ NATIONAL BUDGET CIRCULAR 461 (CYCLE19 ANNOUNCEMENT March 05 2020 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the coming Institutional NBC 4614\" the following schedule: Marghy 9 cycle evaluation, please take note of The President s Office announces the opening of the NBC 461 evaluation ging fets submission dead ines. April 12 1998 Faculty members begin collecting all relevant documents to support their ranking claims. J 13 2002 . ameny The departmental committees review dossiers and f d veritied entnes te fhe HR Ofice. May 21 2018 The HR consolidates the results and coordinates with te NB 461 evaluators for computation. August 19 2021 Th tit ti fi li the ranting 1eealiges submits it to PASUC for validation and approval."
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "nbc461",
        "ocr_text": "July 16 2048 ae Boe NATIONAL BUDGET CIRCULAR 461 (CYCLE19 ARNOURCEMENT March 05 2020 TO ALL PERMANENT FACULTY (Main and External Campus \"8b\" The President s Office announces the opening of the NBC 461 evaluation and sets submission deadlines. o4 April 12 1996 canis ity members begin collecting all relevant documents fo support their ranking claims. January 13 2002 : The departmental committees reyiew dossiers and forward “Gis sd eniries to the HR office. May 21 2018 The HR consolidates the results and rdinates with the NEC 464 eva uators for computation, moe’ The institution finalizes the ranking list and submits it to PASUC for validation and approval."
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "nbc461",
        "ocr_text": "Can RA9299 Republic of the Philippines July 16 2018 cc! | was a _ Moore and Sons (Agee) ==} NOPS (1907) NOTS (1927) EVSAT (196 CvPC (1983) |ECron ss] PSC 6169, Box 9654, APO AE 52372 ~., 18Q19869 Phone: 09981809002 F j2g7484512=™@!!: feliciaS52 examptetpe www torres jones info/ NATIONAL BUDGET CIRCULAR 461 (CYCLE, ANNOUNCEMENT March 05 2020 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the coming Institutional NBC 4614\" cycle evaluation, please take note of the following schedule: \"2600\"° The President s Office announces the opening of the NBC 461 evaluation ee Fels submission deadiines. April 12 1998 Faculty members begin collecting all relevant documents to support their ranking claims. J 13 2002 9 : The departmental committees review dossiers and fi d veritie entries to fhe He office. May 21 2018 The HR consolidates the results and co rdinates with Ne. RB 461 evaluators for computation. meget\" The institution finalizes the ranking list and submits it to PASUC for validation and approval."
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "nbc461",
        "ocr_text": "Republic of the Philippines July 14 2016 RA9299 King Miller Academy NOPS (1907) NOTS (1927) EVSAT (1968) cvpc (1983) Moron os ricside, CA 33500 48Q19869 iams com! NATIONAL BUDG a 845 Stewart Drive, E phone: 09524771089 Fay962543230\"™ Tavigs6 examipi veeww gaines Will ET CIRCULAR 461 (CYCLE1 0 ANNOUNCEMENT January 25 2013 TO ALL PERMANENT FACULTY In view of the coming Institutional the following schedule: (Main and External Campuses) NBC 464 t cycle evaluation, please take note of ember begins by May 11 2015° The faculty m all necessary compilin sredontals. service records, aca transcripts, training rele including U dated emic and certificates of vant to NBC 461 criteria. r secures certification from. the Febraae 04 The faculty membe current rank, years of service, g HR office verifyin and employment status. August 14 2003-- Ap eer evaluation is college or departm performance and conducted by the ent committee to assess teachin ones? The NBG vali January 05 2013 related outputs. 46 mmitt iew 6 SE ittee revie Ss ocuments an ates supporting ev! ence for each criterion claimed. Final computations and are conducted oard deliberations juation by the eva before end rsement for ranking."
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "nbc461",
        "ocr_text": "NATIONAL BUDG ANNOUNCEMENT January 25 2013 TO ALL PERMANENT FACULTY (Main and External Campuses) in of the Stiutiona! NBC 4649\" cycle evaluation, please take note of May 112015- The faculty member begins by compiling all necessa credentials, including updated Service records, academic transcripts, and certificates of training relevant to NBC 461 criteria. PEEL Of. the facully member secures certification from the —- HR office veri ying current rank, years of Service, and employment Siatus, | August 14 2003- a peer evaluation is conducted by the ' college or department committes to assess teaching performance and related outputs, October 23 -The NEC 464 gommittes reviews gu mitied document and Validatas SUPpOrting evidence for each criterion claimed. Final computations and deliberations are conducted by the evaluation board before endorsement for ranking. January 05 2013 -"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "nbc461",
        "ocr_text": "NATIONAL BUDGET CIRCULAR 464 (CYCLEIG AENOURCEMERT January 25 2013 TO ALL PERMANENT FACULTY (Main and External Camouses)} in view of the coming institutiona! NBC 404 cycle evaluation, please take nate of the ying S May 112015\" The faculty member begins by compiling all necessary credentials, including updated service records, academic transcripts, and certificates of training relevant to NBC 461 criteria. rom 04 _ The faculty member secures certification from the miei HR office verifying current rank, years Of service, and employment status August 14 2003- A peer evaluation is conducted by ihe ‘college or department committee ic assess teaching performance and related outputs. October 23 The NBC. a6] Sommittes reviews a su mitted documents an validates supporting evidence for each criterion claimed. January 052013- Final computations and deliberations are conducted by the evaluation board before endorsement for ranking."
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "nbc461",
        "ocr_text": "duly 14 2618 NATIONAL BUDGET CIRCULAR 464 (CYCLE1G AENGUNCEMERT January 25 2013 TO ALL PERMANENT FACULTY (Main and External Campuses} please take note of institutional NBC 464 9\" cycle Or, wit May 112015° The faculty member begins by compiling all necessary credentials, including updated service records, academic transcripts, and certificates of training relevant to NBC 461 criteria. February 04. The faculty member secures certification from the 201s HR office verifying current rank, years of service, ant status. and employn August 14 2003- A peer evaluation is conducted by ihe college or departrnent committee to assess teaching performance and related outputs. October 23 The NBC. 467 committee reviews 1885 “submitted documents and validates supporting eviaence for each criterion claimed. yenvay052013- Finai computations and deliberations are conducted by the evaluation oard before endorsement for ranking."
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "nbc461",
        "ocr_text": "RA 9299 Republic of the Philippines July 14 2016 G6cr eA) 3 King Miller Academy je ey a 845 Stewart Drive, Encside CA 33500 i \"ene 09524771089 = 9286254323 a \"AVis56 @examtptes ety gaines williams com/ NATIONAL BUDGET CIRCULAR 461 (CYCLEyg ANNOUNCEMENT January 25 2013 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the Coming Institutional NBC 4649\" the following schedule May 11 2015- cycle Evaluation, please take note of The faculty member begins by compiling all necessar credentials, including updated Service records, aca emic transcripts, and certificates of training relevant to NBC 461 Criteria, Februar 4 the faculty member scutes Certification from the Office verifying current k rank, years of Service, and employment status. A peer evaluation \"CO €ge or department co, August 14 2003 October 23 ~The N C 461 com ittee reviews aS “gupmitied docurnttss and validates Supporting evi ence for each Criterion c| aimed. Final Computations and deliberations are wo pducted by the evaluation Oard €fore end rsement for ranking January 05 2013 -"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "nbc461",
        "ocr_text": "Republic of the Philippines February Jackson Torres NOTS (1927) College 380 Malone Gioan, Gomezbery NI930) \"\"*\" 09232093520 \"Y2e200 Ema kristiniane exa PID ET Cameron hor ward biz! NATIONAL BUDGET CIRCULAR 464 (CYCLE 7) ANNOUNCEMENT January 29 2013 TO ALL PERMANENT FACULTY (Main ang Ex in view of the coming institutional NBC 461g\" the following Schedule ternal Campuses) cycle evaluation, please take note of A faculty applicant requests inclusion in the Current NBC 464 cycle rough a forma} letter of intent to the HR office. May 12 2017. The HR office issues an Official Phec list of documentary requirements an timelines OF Submission. The applicant co outputs, instructio September 05. 2016 November 19 2019- Mpiles research nal materials, and <1SION activities for verification, September 11. P9013 Th evaluation te Encodes scores Dased on NBC 4a] Ont a ocation Per category and vg idates interviews, The results are Orwarded to the deiwar ittee or inal approval an ranking recommendation, through February 13 2024 ee"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "nbc461",
        "ocr_text": "acne epublic of the Philippin February 19 (i a Jackson- Torres College Sct . 360 Malor Gomezberg, NJ 93076 09232093520 ang28 a kristinlane @examphetpetcameron-| howard. bir NATIONAL BUDGET CIRCULAR 461 (CYCLE 7) ANNOUNCEMENT January 29 2013 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the coming Institutional NBC 461g\" cycle evaluation, please take note of the following schedule emo A faculty applicant requests inclusion in the current NBC 461 cycle through a formal letter of intent to the HR office. May 12 2017 The HR office issues an official Fhecklist of documentary requirements an dtlm elines for submission. November 102019- The applicant compiles research outputs, Instructional materials, and community extension activities for verification. September 11 d s scores \"2013 Ths valet f gar point 2 location per category and validates through interviews. The results are forwarded to th accre it {on committ or approval an ran al recommendation. February 13 2021 -"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "nbc461",
        "ocr_text": "NATIONAL BUDGET CIRCULAR 484 (CYCLE 7} January 29 2042 TO ALL PERMANENT FACULTY (Main and External Campuses) ag 2016 A faculty applicant requests inclusion in the current NBC 461 cycle through a formal letter of intent to the HR office. May 12 2017- The HR office issues an official checkiist of documentary requirements and timelines “for submission. November 102018 The applicant compiles research outputs, instructional materials, and community extension activities for verification. September 11 r scaclac a 213 NS SOM NBC ABT Sort allocahon: per category anc validates through interviews. mopman eee “The resulis are (9 rwarded to the accreditation committee for final approval and ranking recommendation."
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "nbc461",
        "ocr_text": "Republic of the Philippines Jackson Torres College E f (19 8) RA 9299 CvPC (1883 y, NJ 93076 ne axamplaipgtcameron howard biz! NATIONAL BUDGET CIRCULAR 461 {CYCLE 7} ANNOUNCEMENT January 29 2013 TO ALL PERMANENT FACULTY (Main and External Campuses} In view of the coming Institutional NBC 461g\" cycle evaiuation, please take note of the following schedule septs A faculty applicant requests inclusion in the current NBC 461 cycle through a formal letter of intent to the HR office. May 12 2017 The HR office issues an official Fhecktist of documentary requirements and timetines for submission. November 102019- The applicant compiles research outputs, Instructional materials, and community extension activities for verification. September 11 i e spy’ 1\" The evaluatien team srt aliocation. per category and validates through interviews. February 192021 “The results are forwarded to the accreditation committee for final approval and ranking recommendation."
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "nbc461",
        "ocr_text": "MAL BUDGET CURCULAR 484 {CYCLE 7} NATION ANNOUNCEMENT January 29 2013 70 ALL PE RMANERT FACUL TY (Main and External Campuses) ai NBO 461g.” cycle eval tuation, please take note oF seviger A faculty applicant requests inciv ision in the current NBC 461 cycle through a formal letter of intent to the HR office. May 12 2017- The HR office issues an official checklist of documentary requirements an nd timelines “for subrnission. November 102018\" The appli licant compil es researcn outputs, instructional materials, anc community extension activities for verification. September 1 -The evaluat team encodes sc 2013 ‘based on NBC 4et point atocation: per category and validates through interviews. to the accredit commi tee for f Hon approval and rank ing recommendation."
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "nbc461",
        "ocr_text": "Apri 70 ALL PER! August 20 a) Novi NATIONAL BU 03 1999 MANEN amber 24 20217 998 Participants P d according to th at OGET ANNOUNCEMENT 7 FACULTY (Main and Extere The HR co conducls an for aculty mem CIRCULAR 4 4 (cveLe 43 ah Campuses) sjyation, please repare their NBC a require organized ae i and sections. _ The peer reviews docum and accuracy November 01 The NBC 461 november oA #88\" “The final to the regional committee fo nal ap roup cross sheets again and fi inst subm valuation com anis for comps, before forwarding to HR. dossiets, d formats mities jeteness technical working verifies scoring ‘tted proofs. ranking is endorsed yaluation r consolidation proval."
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "nbc461",
        "ocr_text": "NATIONAL BUDGET CIRCULAR 484 {CYCLE +} April 03 1999 TG ALL PERMANENT FAGULTY (Main and External Campuses} wal NBC 464 eycle evaluation, please take note af Ones The HR coordinator conducts an Sue on for faculty members about the NBC 461 guidelines and evaluation process. August 201998- Participants prepare their NBC dossiers, organized according to the required formats and sections. Noverber212021- ‘The peer evaluation committee reviews documents for completeness and accuracy before forwarding to November 01- The NBC 461 technical working group cross verifies scoring sheets against submitted proofs. 18 The final ranking is endorsed to the regional evaiuation committee for consolidation and final approval."
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "nbc461",
        "ocr_text": "Gi RA9299 ublic of the Philippin November i Ce) Alvarez, Gonzalez and Hubbard School... ile 3 =) Nops a 7 238 Austin Rapids, Madisonshire, MS 5 18Q198 09196787265 *%284441019°\" doloraheabrera examptatp hernandez org/ Phone NATIONAL BUDGET CIRCULAR 461 (CYCLE 1) ANNOUNCEMENT April 03 1999 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the coming Institutional NBC 4649\" cycle evaluation, please take note of the following schedule on8S7 °° The HR coordinator conducts an orlentat| on for faculty members a the NBC 461 sidelines. and evaluation process. August 20 1998- _ Participants prepare their NBC dossiers, organized according to the required formats and sections. November 212021- The peer evaluation committee ‘reviews documents for completeness and accuracy before forwarding to HR. November 01- The NBC 461 technical working group cross verifies scoring sheets against submitted proofs. November 21 . . The final ranking is endorsed to the regional evaluation committee for consolidation and final approval."
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "nbc461",
        "ocr_text": "> RA9299 Republic of the Philippines No aper _ Alvarez, Gonzalez and Hubbard School NOPS (1907) NOTS (1927) EVSAT (1968) CVPC (1983) L 238 Austin, Rapids, Madisonshire, MS 51063 Prone 09196787265 Fa peaaa 10196 18Q19869 “déborahcabrera examptatphernandez org/ NATIONAL BUDGET CIRCULAR 464 (CYCLE 1) ANNOUNCEMENT April 03 1999 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the coming the following schedule Octpber 06 Institutional NBC 4649\" cycle evaluation, please take note of The HR Coordinator conducts an ofientat on for faculf members about the NBC 461 guidelines and evaluation process. Participants prepare their NBC dossiers organized according to the required formats and sections. The peer evaluation committee reviews documents for Completeness and accuracy before forwarding to November 01- The NBC 461 technical workin Qroup cross verifies scorin sheets against submitted proofs. August 20 1998 November 21 2021- November 21 . ; The final ang IS endorsed to the regiona evaluation committee for consoli ation and final approval."
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "nbc461",
        "ocr_text": "d Scho NATIONAL BUDGET CIRCULAR 44 (CYCLE 4) ANNCUNCEMZENT April 03 1999 TO ALL PERMANENT FACULTY (Main and External Campues@)} stitutional NBC 484 Ge cycle evaluation, please take nc! of The HR coordinator conducts an orleniation for faculty members about the NBC 461 guidelines and evaluation process. August 201998- Participants prepare their NBC dossiers, organized according to the required formats and sections. November 21202i- The peer evaluation committee ‘reviews documents for completeness and accuracy perore forwarding to November 01- The NBC 461 technical working group cross verifies scoring sheets against submitted proofs. The final ranking is endorsed to the regionai evaluation committee for consolidation and final approvai."
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "nbc461",
        "ocr_text": "One aBEe DN RA9299 Republic of the Philippines Parsons Bishop Universit NOTS (1927) EVSAT (1968) cvpc (1983) MAtbroo ss 269 48Q19869 So NOPS (1907) Cae a Jo? Thompson Flat Suite 266, Martinezview, MN 95: Phone: 09297366156 zogsn Et St ereinodT exareepio moyer Sm NATIONAL BUDGET CIRCULAR 461 (CYCLE 6) ANNOUNCEMENT October 11 2015 TO ALL PERMANEN the coming Institutional NBC 461g) T FACULTY (Main and External Campuses) cycle evaluation, please take note of In view of the following schedule: April 29 2012\" Faculty members receive a memorandun) announcing the start O the NBC 461 evaluation period. Novenggr 20 Each applicant submits soft and hard copies of their NBC folders followin institutional format standards. January 122018 The HR department logs and tracks submissions for completeness before proceeding to evaluation. J 31 . asott The qvalu tion board reviews _ cre entials, computes point. equivalents, and documents findings. M 22 2015 . arch 222015°{\\ gummary report Is Ss d e created a t to fhe res en MES for final endorsement."
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "nbc461",
        "ocr_text": "-Bishop Univers NATIONAL BUDGET CIRCULAR 461 (CYCLE 6} ANNOUNCEMENT clober 17 2018 TO ALL PERMANENT FACULTY (Main and External Campuses} v of ihe gs ine April 29 2012 Faculty members receive a memorandu announcing the start o the NBC 461 evaluation 2 period. A, ony November 20 Each applicant submits soft and hard copies of _ their NBC folders following institutional format standards. venvary 122018\" The HR department logs and tracks submissions for completeness before proceeding to evaluation. D014 The evaluation board reviews _creaentials, cornputes point equivalents, and documents findings. created and submitted to the Drea! Supmilied for final endorsement."
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "nbc461",
        "ocr_text": "Republic of the Philippines iyiie Be a3 Pars so $-Bishop University cvPc (1983) ~ Tortinezwew, MN 95268 18019962 olne47 Qexarnpreperiwww mayer -kim corn! one 99297386156 Fagpgs4anase™” ear NATIONAL BUDGET CIRCULAR 484 (CYCLE 6) ANNOUNCEMENT October 14 2015 RMANENT FACU LTY (Main and External Campuses) TO ALL PEI take note of In view of the coming Institutional NBC the fotlowing sch edule: April 29 2012 Faculty members receive a. memorandu announcing the start 0 the NBC 461 evaluation period. soft and hard co} ies of Nov 120 Each applicant submits $888 their NBC folders espe institutional ormat ndar 461 cycie evaluate please 8\" January 122018 The HR department logs and tracks submissions for completeness before proceeding to evaluation. January 37 30nt The evaluation board reviews credentials, compu utes point equivalents, and documents findings. March 22 2015 a summa epott s fe dan submitted tot the resi ents ge or final sitjorsement."
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "nbc461",
        "ocr_text": "NATIOMAL BUDGET CIRCULAR 461 (CYCLE 6} October 14 2015 ANNOUNCEMENT TO Ai. PERMANENT FACULTY (Main and External C Novel ber 2 January 12 2018~- January 3 2071 March 22 2015 Faculty members receive a mer morandum announcing the start o the NBC 461 evaluation period Each applicant submits soft and nard co ‘ies of their NBC folders following institutional format standards. The HR department logs and tracks submissions for completeness before proceeding to evaluation. The evaluation board reviews ‘cle leniials, computes point equivaients, and documents findi ings. A sammar report is icrgated an at Oe residents tothe al endorsement."
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "nbc461",
        "ocr_text": "NATIONAL BUDGET CIRCULA ANHOUNCEMEST sober 11 2018 Oct 7O ALL PERMANET ULTY (Main and sternal NT FAG 2464 (CYCLES) TAT USe S) ake note of juaton, ple ase tat April 29 2012\" Faculty members Nove bgt 20 Each applicant gupmits soft their N stander jary 3 O18-- january 122018 The HR department suomissions for before proceeding January 31 201% The Ra lust tion B Ty e dentials equivalents, Cc folders foll Hlowing institutional Ss. and} nar copies of ormat logs and tracks ompieteness to evaluation. oard reviews computes point, and Socuments findings. March 22 9015 AS ant report s ated and SU io ihe omitted ee resi ents for final i endorsemen"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "nbc461",
        "ocr_text": ": NATIONAL BUDGET CIRCULAR 464 ANNOUNCEMENT October 31 2007 To ALL PERMANENT FACULTY (Main and External Camouses} natitutional NEC 4giq® ovole evalu ation. please lake note of in view of the com the following May 10 1999° The process starts with the distripution of NBC 461 forms an computation sheets to qualified facu ity. December 17 thes Applicants iL out forms and attach authenticate: fe] supporting documents for each category. August 03 2001 The HR office performs preliminary validation to ensure authenticity and completeness of submissions. Margy” The NBC 461 committee evaluates and computes scores using the presch ribed point system. sens - Recom endatio ions for rank Baus ments are cons I) dated SqHep or de forwarder? D the ittee"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "nbc461",
        "ocr_text": "NATIONAL BUDGET CIRCULAR 467 (CYCLE14 October 31 2007 TO ALL PERMANENT FACULTY (Main and External Campuses) in of th ing Inetiutional NBC 4614 oyale eval 1, please take note of The ne May 10 1999° “The process starts with the distribution of NBC 461 forms and computation sheets to qualified faculty. December 17 . ; 1888 Applicants fill out forms and atiach authenticated supporting documents for each category. August 09 2091 The HR office performs preliminary validation to ensure authenticity and completeness of submissions. Margie The NBC 461 committee evaluates and computes scores using the prescribed point system. September 24 M7008 Recommendations for rank adjustments are consolidated and forwar Sd to the AED Ngee. committee. or"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "nbc461",
        "ocr_text": "NATIONAL BUDGET CIRCULAR 484 (CYCLE 9 ANNOUNCEMERT October 31 2007 TO ALL PERMANENT FACULTY (Main and External Campuses} please take note of y adional NE C 4644\" ovale eval the May 101999° The process starts with the distribution of NBC 461 forms and computation sheets to qualified faculty. Dece! . . Bog\" Applicants fill out forms and attach authenticated supporting documents for each category. August 03 2001 rhe HR office performs preliminary validation to ensure authenticity and completeness of submissions. v agga'° The NBC 461 committee evaluates and computes scores using the prescribed point system. P5008 Recom! mendations for rank ad) ustments are cons yagied n forwardec_to the AED or PASUC committee."
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "nbc461",
        "ocr_text": "Republic of the Philippines November 2) _ Conner, York and Morris Academy Bese) Uk NOPS (1907) NOTS (1927) EVSAT (1968) cvpc (1983) noes: 504 Brooks Ford Suite 058, Lake Janicemouth, NY 48841 ~~ 18Q19869 Phone: 09198260388 F i287600788°\"\" mcastro example orghttpwebb com/ TM. RAG299 NATIONAL BUDGET CIRCULAR 461 (CYCLE14) ANNOUNCEMENT October 31 2007 TO ALL PERMANENT FACULTY (Main and Ext cycle evaluation, please take note of ernal Campuses) In view of the coming Institutional NBC 4614 the following schedule: May 10 1999° The process Starts with the distribution of NBC 461 forms and computation sheets to qualified faculty. Dec rue $088 Applicants fill out forms and attach authenticated supporting documents for each category. August 03 2001\" The HR office performs preliminary validation to ensure authenticity and completeness of submissions. Margbe 0 The NBC 461 committee evaluates and computes scores using the prescribed point system. ember 24 0 serie Recommendations for rank adjustments are lidated Past soto the ANE or PASUC committee."
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "nbc461",
        "ocr_text": "NATIONAL BUDGET ASROUNCEMENT October 34 2007 TO ALL PERMANENT pa CULTY (Main ang External Campy usps) 2 Vg Chih May 10 1999- Stitutional NBC 4644)\" The Process starts with the Gistribution of NBC 467 forms and computation sheets to qualified faculty, December 17 “Applicants fl out forms and Supporting documents attach authenticated August 03 2001 The HR office performs preliminar validation to ensure authenticity anc completeness of submissions. Ma Co. on Maieg0 The NBC 461 committee evaluates and computes scores using the prescribed point system, Recommendations for rank adjustments are consolidated arded to ine CUED or forwarded. committes. Seplember 24"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "nbc461",
        "ocr_text": "&. NATIONAL BUDGET CIRCULAR 61 (CYCLE 5} April 23 2014 TO ALL PERMANENT FACULTY (Main an ad External Ce October 30 BGR June 02 2000 February 24 200 August 23 2079 ANNOUNCEMENT arnpuses} fonal NBC 481g\" cycl The} R division issues or submission jor Acaty members “eligible for NBC A461 ranking. Applicants compile and categorize docu under educational qualifications, expener outputs. “The departmental evaiuaiors assess perforr mance ratings and verify teaching- related accomplishments. The NBC 461 evaluators compute the points earned for each component based on guidelines. Results are summan ized, verified, and submitted for administrative approval and official ranking."
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "nbc461",
        "ocr_text": "NATIONAL BUDGET CIRCULAR 464 (CYCLE 5 ANNOUNCEMENT April 23 2074 TO ALL PERMANENT FACULTY (Main and External Campuses) itutional NEC 414\" cycle evaluation, please take note of October 30 J ne HR divisio DSS i call for submission 3 aculty members eli igible for NBC 461 ranking. ens June 02 2000 Applicants compile and categorize docum 4 under educational qualifications, experie outputs. February 24 2001-., oa\": The departmental evaluators assess performance ratings and verify teaching related accomplishments. Ociopes 21 “The NBC 461 evaluators compute the points earned for each component based on guidelines. August 292019\" Results are summarized, verified, and submitted for administrative approval and official ranking."
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "nbc461",
        "ocr_text": "August 13 Republic of the Philippines S054 Stewart Ramirez University NOTS (1927) EVSAT (1968) cvpc (1983) 76047 Katherine Unions Apt. 854, Joshuamouth, PR 82946 _ pone: 09859009589. Fi283807137°\"\"\" lwhite example comhttpshome com/ OPS (1907) NATIONAL BUDGET CIRCULAR 461 (CYCLE 5) ANNOUNCEMENT April 23 2014 PERMANENT FACULTY (Main and External Campuses) TO ALL aluation, please take note of In view of the coming Institutional NBC 4614\" cycle ev the following schedule: Octebey 30° es The AR division Issues A call for su mission. or aculty members e igible for NBC 461 ranking. le and categorize documents June 02 2000 Applicants compile and cal under educational qualifications, experience, and outputs. February 24 2001- seme The departmental evaluators assess performance ratings and verify teaching related accomplishments. October 21 The NBC 461 evaluators compute the points earned for each component based on guidelines. august 232019” Results are summarized, verified, and submitted for administrative approval and official ranking."
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "nbc461",
        "ocr_text": "August 13 Republic of the Philippines 9094 ATi, RA9299 . 7 Stewart Ramirez University i) NoPS (1907) NOTS (1927) EVSAT (1968 cvpc (1983) io 1001 3 26947 Katherine Unions Apt. 854, Joshuamouth, PR 82946 48Q19 869 mail: 4, es example comntips mome com. F29j263807137\" phone: 09859009589 ET CIRCULAR 461 (CYCLE 5) NATIONAL BUDG ANNOUNCEMENT April 23 2014 TO ALL PERMANENT FACULTY (Main and External Campuses) please take note of In view of the coming Institutional NBC 4614\" cycle evaluation, the following schedule: octghgs 30” (en F The HR division isSugS a cal or SU mission, oi acuity members eligible for NBC 461 ranking. June 02 2000- A plicants compile and categorize documents under educational qualifications, experience, an output! ental evaluators assess ce ratings and ver! ted accomplishments. octgbes 21 “The NBC 461 evaluators compute the points earned for eac t based on guidelines. august 232019\" Results are summarized, verified, a d submitted for administrative approva February 24 2001\" The departm erforman teaching rela componen and official ran ing. —"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "nbc461",
        "ocr_text": "AL BUDGET CIRCULAR 464 (CYCLE 5} ANNOUNCEMENT April 23 2014 Main and External Campuses} ke note of October 30 2008 The HR division issues a Call tor submission for faculty members eligible for NBC 461 ranking. June 02 2000 _ Appli February 24 2001- eeesy The departmental evaluators assess performance ratings and verify teaching related accomplishments. Octgher21 The NBC 467 evaluators compute the points earned for each component based on guidelines. August 23 2019 Results are summarized, verified, and submitted for administrative approval and official ranking."
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "nbc461",
        "ocr_text": "NATIONAL BUDGET CIRCULAR 461 (CYCLE 3) ANNOUNCEMENT June 06 2018 TO ALL PERMANENT FACULTY (Main and External Campuses) Faculty members attend a briefing session detailing the atest NBC 461. updates and computation adjustments. August 37 2003 Des siers are arranged chronologically labeled according to ihe NBC 467 chec! ADM i The evaluation team inspects each dossier anc flags incomplete or inconsistent entries. May 222015\" Scoring is performed using the NBC 467 point matrix, and results are encoded for tabulation. duly s0 2025\" The validated list is endorsed to the regional evaluator for consolidation and release of results."
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "nbc461",
        "ocr_text": "SE RAG209 Republic of the Philippines January 28 0 Ee Thompson, Mckinney and Flores Academy rs) NOPS (1907) NOTS (1927) EVSAT (1968) CvPC (1983) 29079 Nancy Forks Apt. 420, East Matthew, LA 51495 Phone: 09868630702 F 18Q19869 62802301 .34Email Gherrera example nety:/ www yoder bis, 150 9001 NATIONAL BUDGET CIRCULAR 461 (CYCLE 3) ANNOUNCEMENT June 06 2018 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the Coming Institutional NBC 4615\" cycle evaluation, please take note of the following schedule: ae Faculty members attend a prieting Session detailing the latest NBC 461. updates and Computation adjustments. Dossiers are arranged chronologically and labeled according to the NBC 461 checklist. August 31 2003 April 26 2017- The €valuation team inspects €ach dossier and flags incomplete Or inconsistent entries. May 22 2015- Beng is performed using the BC 46 Point matrix, and results are encoded for tabulation. The valida ed list is endorsed to the regional ©valuator for Consolidation nd, release of results. July 30 2025 ace"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "nbc461",
        "ocr_text": "ABNOUNCEMENT June 06 2018 TO ALL PERMANENT FACULTY (Main and External Campuse: In futional NBC 4575\" cye Fi September 07 v2 Faculty members attend a briefing session detailing the latest NBC 461. updates and computation adjustments. August 31 2003- nossiers are arranged chronologically and labeled according to the NBC 467 checklist, ri OF 947. . April26 2017-) The evaluation team inspects each dossier and flags incompiete OF inconsistent entries. May 22 2015° Scoring is performed using the NBC 467 point matrix, and results are encoded for tabulation. July 30 2025° The valida ed listis endorsed to the regional evaluator for consolidation and release of results."
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "nbc461",
        "ocr_text": "January 28 ve RA 9299 Republic of the Philippine Pretd cct| v Thompson, a and. Flores Academ tas 2) NOPS (1907) NOT (1968) CVPC (1983) a S S me SiS hea rp ‘orks sa 420, East Matthew, LA 51495 418010869 Phone: 09868630702 F 2g0230134™*!\" dherrera example nttpwww yoder biz! NATIONAL BUDGET CIRCULAR 461 (CYCLE 3) ANNOUNCEMENT June 06 2018 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the coming Institutional NBC 4615\" cycle evaluation, please take note of the following schedule: Sede Ea 07 ‘Faculty members attend a briefing session detailing the latest NBC 461 updates and computation adjustments. August 31 2003- Dossiers are arranged chronologically and labeled according to the NBC 461 checklist. Apt ZS 20173 The evaluation team inspects each dossier and flags incomplete or inconsistent entries. May 22 2015 eee is performed using the NBC 467 point matrix, and results are encoded for tabulation. July 30 2025\" The valida ed list is endorsed to the regional evaluator for consolidation and release of result"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "nbc461",
        "ocr_text": "January 28 2o1F 7% RAQ299 Republic of the Philippines E) Thompson, Mckinney and Flores Academy =} NOPS (1907) NOTS (1927) EVSAT (1968) CVPC (1983) 29079 Nancy Forks Apt. 420, East Matthew, LA 51495 18Q19869 09868630702 2802301345\" dherrera example nattpwww yoder. biz/ Phone NATIONAL BUDGET CIRCULAR 461 (CYCLE 3) ANNOUNCEMENT June 06 2018 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the coming Institutional NBC 4615)\" cycle evaluation, please take note of the following schedule September 07 20 22 Faculty members attend a briefing session detailing the latest NBC 461. updates and computation adjustments. August 31 2003- Dossiers are arranged chronologically and labeled according to the NBC 461 checklist. April 26 2017\" The evaluation team inspects each dossier and flags incomplete or inconsistent entries. May 22 2015\" Scoring is performed using the NBC 467 point matrix, and results are encoded for tabulation. July 302025\" The valida ed list is endorsed to the regional evaluator for consolidation and release of results."
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "nbc461",
        "ocr_text": "SEN RA 9299 Republic of the Philippines 2 lack, Dun May 25 2017 (uae a _ B can and Kelly Institute 3) NOPS (1907) NOTS (1927) EVSAT (1968) Cvpc (1983) ‘Ofer oa 6 2783 Tumer Mount, One jamouth, MA 41247 7 Phere: 09666106963 Fey, q t, Orteg 18Q19869 1286241494 “Mewardkimbery examplmtps: johnson .com/ NATIONAL BUDGET CIRCULAR 4614 (CYCLE 3) ANNOUNCEMENT May 22 2004 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the coming Institutional NBC 4644\" cycle evaluation, please take Note of the following schedule: Moust06 1988 TH HR office initiates the NBOofic cycle issuing Memoranda to all eligible faculty members. April 16 2022 Faculty members submit verified Credentials and performance evidence within the set eadline. May 04 2013- The College leve evaluates submissi to NBC Standards I committee ONS accordin and criteria, he technical evaluators perform Uality assurance and Scoring validation for all entries. March 26 2009 The institution Compiles an f forwards the final NBC ranking documents to the regional Secretariat. June 22 2015- eS"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "nbc461",
        "ocr_text": "Republic of the Philippixes May 25 2017 Black, Duncan and K. y Institute Gals erie (7887) Sema (1968) _CVPC (1983) 2 unt, Ortogy 27 18019869 \"\"\" 09666 106963 8624 1491\" ewardkimberly examnp S Johnson com/ NATIONAL BUDGET CIRCULAR 461 (CYCLE 3) ANNOUNCEMENT May 22 2004 TO ALL PERMANENT FACULTY (Main and Externat Campuses) in view of the coming institutional NBC 4684 4\" cycle evaivation please ake note of the following schedule MGUSE08 1999 The Office initiates the Ne 464 cycle by issuing memoranda to all eligible faculty members. April 16 2020 Facuity members Submit verified credentials and performance evidence within the set deadline. May 04 201 3 The college level committee evaluates submissions accordin to NBC standards and criteria. June 22 2015° Abe technical evaluators periorm quality assurance and Scoring validation for all entries. Moreh 262009 institution compiles and forwards the final NBC 461 ranking documents to the regional secretariat."
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "nbc461",
        "ocr_text": "May 25 2017 cvPC (1883) sQissées Oregamouth, MA 41247 wowardkimberly exampiety: s jobnsen con prone 09696106963 \"28624149\" NATIONAL BUDGET CIRCULAR 464 {CYCLE 3) ANNOUNCEMENT May 22 2004 TO ALL PERMANENT FACULTY (Main and Exte tional NBC 464 4\" cycle evaiuation piease take no rnai Campuses) in view of the coming institu te of the following schedule: August 06 1998\" The office initiates the Nite 464 cyc ay issuing memoranda to all eligible faculty members. April 16 2022 Faculty members submit verified credentials lie within the set and performance evi deadiine. May 042013-, The college level committee evaluates submissions according to NBC standards and criteria. June 22 2015\" he technical evaluators perform quality assurance and scoring validation for all entries. Merch 262009 The institution compiles and forwards the final NBC 461 ranking documents to the regional secretariat."
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "nbc461",
        "ocr_text": "RA9299 Republic of the Philippines May 25 2017 _ Black, Duncan and Kelly Institute NOPS (1907) NOTS (1927) EVSAT (1968) CVPC (1983) oo 7 2783 Tumer Mount, Ortegamouth, MA 41247 18Q19869 Phone: 09666106963 %2a62414915 Owardkimberly exampliettpsjohnson com/ NATIONAL BUDGET CIRCULAR 461 (CYCLE 3) ANNOUNCEMENT May 22 2004 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the coming Institutional NBC 464 si cycle evaluation, please take note of the following schedule: August06 1996\" “The Office initiates the NBC 461 cycle by issuing memoranda to all eligible faculty members. April 16 2022- Faculty members submit verified credentials and performance evidence within the set deadline. May 042013\" The college level committee evaluates submissions according to NBC standards and criteria. June 22 2015\" he technical evaluators perform quality assurance and scoring validation for all entries. Maren 29200\" The institution compiles and forwards the final NBC 461 ranking documents to the regional secretariat."
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "nbc461",
        "ocr_text": "May 25 2017 3 NATIONAL May 22 2004 FO ALL PERMANENT FAG BUDGE? ET CIRCULAR agi (CYCLE 3) ANNOUNCEMENT SLTY (aint and Exter nna NBC 4944 nal Campuses) ton, please jake note of August 06 1998\" Hs H offi ce in nitiaies e NBC 461 gycle by ssuing m April 16 2022- Faculty May 04 2013-, june 22 201 5 March 26 2009 emoranda to eligible faculty se ambers. The colleg evaluates Su to NBC stand verified credentials members subRt and performance evidence within the set dea dine. e level committee bmissions accordi ng ards and critena y assurance a performn tech nical evaluators, nd rm quality Scori ing validation The institution compre NBC for all entries. forwards. the fi ents i it) an A64 rankl the reg! ng dgcume ional secretana"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "nbc461",
        "ocr_text": "By RA9299 Republic of the Philippines July 09 2008 : Vance PLC Academy NOPS (1907) NOTS (1927) EVSAT (1968) 24164 Miller Courts Apt. 309, West Jameston, AS 02651 Phone: 09699269595 F ig4g27293 2llbradmiller example cattpcampos com/ cvpc (1983) NATIONAL BUDGET CIRCULAR 461 (CYCLE g) ANNOUNCEMENT July 17 2024 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the coming Institutional NBC 464 oO\" cycle evaluation, please take note of the following schedule: November 12 i. Eligible faculty members file their intent to participate in the NBC 461 ranking process. June 19 2005 The HR personnel distribute forms and guidebooks to help faculty prepare their documents correctly. July 20 1998\" Committees eonduet evaluations across teaching effectiveness, research, and extension services. August 02 2017° ~The scores are tallied, reviewed for discrepancies, and adjusted as necessary. The final NBC 291 results are released ane communicated throu an official memorandum. August 01 2014 -"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "nbc461",
        "ocr_text": "By RA9299 Republic of the Philippines July 09 2008 Vance PLC Academy Is) NOPS (1907) NOTS (1927) EVSAT (1968) 24164 Miller Courts Apt. 309, West Jameston, AS 02651 Phone: 09699269595 F8ig4g27293 2llbradmiller example cattpcampos com/ cvpc (1983) NATIONAL BUDGET CIRCULAR 461 (CYCLE g) ANNOUNCEMENT July 17 2024 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the coming Institutional NBC 464 oO\" cycle evaluation, please take note of the following schedule: Novembsr 12 _. Eligible faculty members file. their intent to participate in the NBC 461 ranking process. June 19 2005 The HR personnel distribute forms and guidebooks to help faculty prepare their documents correctly. July 20 1998\" Committees eonduet evaluations across teaching effectiveness, research, and extension services. August 02 2017° The scores are tallied, reviewed for discrepancies, and adjusted as necessary. The final NBC el results are released as communicated throu an official a eAnOTETeLIT. August 01 2014 -"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "nbc461",
        "ocr_text": "July 09 2008 NATIONAL BUDGET CIRCULAR 461 (CYCLE g} ANNOUNCEMENT July 17 2024 TO ALL PERMANENT FACUL (Main and External Campuses) tional NBC 484 ft) cycle evaluation, plea Eligible faculty members file their intent to partic ipate in the NBC 461 ranking process. June 12 2005 The HR personnel distribute forms and guidebooks to nelp faculty prepare their documents correctly. July 20 1998- COUN ere conduct ey evaluations across teach ng effectiveness, research, and extension services. August 02 2017- The scores are tallied, reviewed for discrepancies, and adjusted as necessary. The final NBC Ae results are released a communicated throug an official memorandum, August 01 2074 -"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "nbc461",
        "ocr_text": "My RA9299 Republic of the Philippines July 09 2008 Gc y \"2 Vance PLC Academy oe NOTS (1927) EVSAT (1968) CVPC (1983) _ Is) NOPS (1907) 24164 Miller Courts Apt. 309, West Jameston, AS 02651 18 3Q 19869 Phone 09699269595 *%J284827293bradmiller example catttpcampos com/ NATIONAL BUDGET CIRCULAR 461 (CYCLE 9) ANNOUNCEMENT July 17 2024 TO ALL PERMANENT FACULTY (Main and External Campuses) In view of the coming Institutional NBC 464 Q\" cycle evaluation, please take note of the following schedule: Novembsr 12 — Eligible faculty members file. their intent io participate in the NBC 461 ranking process. June 19 2005 The HR personnel distribute forms and guidebooks to help faculty prepare their documents correctly. July 20 1998° Committees ponduet evaluations across teaching effectiveness, research, and extension services. August 02 2017° The scores are tallied, reviewed for discrepancies, and adjusted as necessary. The final NBC 461 results are release and communicated throug an official memorandum. August 01 2014 -"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "nbc461",
        "ocr_text": "duly 69 2008 NATIONAL BUDGET CIRCULAR 461 (CYCLE g) ANNOUNCEMENT July 17 2024 q 70 ALL PERMANENT FACULTY (Main and External Cam November 12 : Vien “Eligible faculty members file. their intent to participate in the NBC 461 ranking process. June 19 2005 The HR personne! distribute forms and guidebooks to heip ity prepare their documents correctly. July 20 1998- , yew ee”, Committees ponduct evaluations across teacning effectiveness, research, and extension services. August022017° The scores are tallied, reviewed for discrepancies, and adjusted as necessary. August012014° Fhe final NBC 461 results are release and communicated through an official memorandum."
    }
]