[
    {
        "image": "Notice1_synth_10_aug1.png",
        "label": "Notice",
        "ocr_text": "Scheel Notice cert 1 1 Alls taf mempers musi observe “punett ality in adending meetings nd Guties. 53 Cooperati jon between departments 1S vital for the success oF school programs. 3 3 Thank you for your conunu uOUs affort and support in school operations,"
    },
    {
        "image": "Notice1_synth_10_aug2.png",
        "label": "Notice",
        "ocr_text": "School Notice Le -04-: ae 24 a Dear Guardians, this notice is issued to inform you about upcoming school maintenance work that mai affect regular Schedules. We request your patience and understanding as we work to improve our facilities. Thank you for your support and cooperation. Details: What; Community Outreach and Whats convice ram Planning When: May 14, 2026 01 35 AM Where: Science Laboratory Important Points to Note: .1 All st, ers must observe Uae ff As aeStgim meetings and duties. 2 2 Cooperation between departments is vital for the SUCCess of school programs. 3 3 hank you for your continuous effort and support in school Operations."
    },
    {
        "image": "Notice1_synth_10_aug3.png",
        "label": "Notice",
        "ocr_text": "TIAN Ss punctualny and dufl betwee success of sci Than and Schoo! Notice AY ID atlendin Support in sc Mbers must observe 2 Cocberation ments is vital for the 1001 programs. 3 3 K You for your conting iOUS effort hool operations,"
    },
    {
        "image": "Notice1_synth_10_aug4.png",
        "label": "Notice",
        "ocr_text": "Schaal Notice ed to ink oR wi your suppor and co O1 35 AM fen ed 1 4 Allstalf mem ars must observe punciuanyy i arenaing meetings and dufies. 2 2 Cooperation between departments ig vital for the success cf schoo! programs. 3 3 Thank you for your continuous effort and support in achool operations."
    },
    {
        "image": "Notice1_synth_10_aug5.png",
        "label": "Notice",
        "ocr_text": "Schoo! Netice Dear Guarai. tice is issueg fo inform you PCOMING Schoo! mainte ule: ’aNS, this no! u affect regular schedul understandin, Thank you for your s Cetaia: When: May 14 20 Wiere, important Points to Nove: 1 4 All st GF AS We Wo} nance work that ray 'S request your Patience ang HK tO ir PYOVE Our facilities. uPport and coope: Tation, 26 ~~ 01 35 Ant Science Laboratory embers must op: e puhctuahey ns alesse setingy® and duties, 2 9 Cc Ng Meetings"
    },
    {
        "image": "Notice1_synth_1_aug1.png",
        "label": "Notice",
        "ocr_text": "School Notice 8005 07 16 Subject: Mathematics Dear Parents, we would like fe inform you about an important update regarding upcoming school aciivities. Please take time to review the details carefully to ensure yeur child s smooth participation, We appreciate your cooperation and continued support for our school programs. swinew: January 19, 2025 09 49 AM Whore: Conference Hall 1h eargris must ensure that their chiidren arts Al schee! on ime every day. 2 2 Attendance will pe closely monitored to maintain academic performance. 3 3 Please ipform the Glas Bo absent for val reasons."
    },
    {
        "image": "Notice1_synth_1_aug2.png",
        "label": "Notice",
        "ocr_text": "School Notice 22005 07- 16 Mathematics Dear Parents, we would like to inform you about an important updeie eb upcoming schooi activities. Piease take time to review the details carefully to ensure your child s smooth participation. We appreciate your cooperation and continued support for our schoo} Programs. Muary 10, 2025 09 49 AM When: Conterence Heit oportant nines to Note: 1. ents must ensure that their chilies ‘At School on ne every day. 2 2 Atten ance will be closely monitored to maintain academic perormance. 3 3 Please r ass adviser in advance i your child wil GS absent forvs id reasons."
    },
    {
        "image": "Notice1_synth_1_aug3.png",
        "label": "Notice",
        "ocr_text": "School Notice 9005 07 16 subject: Mathematics we would like to inform important update 2 regarding fhe details car you about an upcot coming schoo! activities. efully to ensure appreciate your Please take time to i oth participation. We rt for our school ‘our child s smoo! cooperation and continued suppol programs. Details: nat: PDT “wen: January 10, 5 2025 —09 49 AM where: Conference Hall Important Points to Note: rents must en ure, tha’ their \"dhidren ary} ive ue RASE choo! on e, every d endance WI 2 2 Aver to nee ain emi inform the. lass advi or ur C id w it Be ab se reason e. 3 3 aa In Bsr valid"
    },
    {
        "image": "Notice1_synth_1_aug4.png",
        "label": "Notice",
        "ocr_text": "School Notice °2005 07 16 ‘Subject: Mathematics Dear Parents, we would like to inform you about an important update regarding upcoming school activities. Please take time to review the details carefully to ensure your child s smooth participation. We appreciate your cooperation and continued support for our school programs. Details: When: January 10, 2025 09 49 AM where: Conference Hall Important Points to Note: 1 4 Parents must ensure that their children aryve A School on ime every day. 2 2 Attendance will be closely monitored to maintain academic performance. 3 3 Please 'RVour child wi be absent for vale reasons."
    },
    {
        "image": "Notice1_synth_1_aug5.png",
        "label": "Notice",
        "ocr_text": "School Notice you about an important Points i Mote: arents must ens gure, that, their thi dren argive e Alec ool on hme. every day. 2 2 Attendance will closely aes fo maintain academic FE ger in eS es pace a thes ase adyi 4 are the clas Wil Be absent for valid reasons."
    },
    {
        "image": "Notice1_synth_2_aug1.png",
        "label": "Notice",
        "ocr_text": "School Notice imporiant Points ay Students are reminded to wear ther complete school uniorm during all school d 2. 21D cards musi be worn visibly at all 1 Ww ie i inside the school premise 3 3 Violation oF cress cade polic will resull in disciplinary action,"
    },
    {
        "image": "Notice1_synth_2_aug2.png",
        "label": "Notice",
        "ocr_text": "Schoo! Novice a O98 G4 15 Subject Science 4 1 Students are reminded fo wear their compiete school uniform during all school days. 9 2 1D cards must be worn visibly ai all times while ingide the school premises. 3 3 Violation of dress code policies will resull in disciplinary action."
    },
    {
        "image": "Notice1_synth_2_aug3.png",
        "label": "Notice",
        "ocr_text": "School Notice 4998 04 15 Subject: Science Dear Guardians, this notice serves as a reminder about an upcoming school event that requires your attention. Kindly review the schedule and instructions provided to avoid any inconvenience. We value your time and assistance in ensuring that your child is well prepared. Details: When: April 26, 2026 01 09 AM Where: Gymnasium Important Points to Note: 1 1 Students are reminded to wear their complete school uniform during all school days. 2 2 ID cards must be worn visibly at all times while inside the school premises. 3 3 Violation of dress code policies will result in disciplinary action."
    },
    {
        "image": "Notice1_synth_2_aug4.png",
        "label": "Notice",
        "ocr_text": "School Notice 221998 04 15 Science Dear Guardians, this Notice serves as a reminder about an yj i school event that fequires your attention. Kindly review the Schedule and instructions provided to avoid any inconvenience. We value your time and assistance in ensuring that your child is well prepared. Detaiis. What, Sa ates a *wnen: April 26 2026 01 09 AM * Gymnasium Important Points to Note: 1 1 Students faye feminded to wear their comp ete school uniform during all school days. 2 2 ID cards Violation of dress code policies will result in disciplinary action."
    },
    {
        "image": "Notice1_synth_2_aug5.png",
        "label": "Notice",
        "ocr_text": "School Notice 1998 04 15 Subject Science 'S well prepared, Details: in Fecal Whats... Facu When: April 26, Where: Gymnasium 01 09 AM Important Points to Note: 1 1 Students re reminded O Wear their complete schoo uniform during all school days, 2."
    },
    {
        "image": "Notice1_synth_3_aug1.png",
        "label": "Notice",
        "ocr_text": "School Notice re0i2- 02- 08 T247 AM tnopactané Pains to Rate: A Parents ere €ncouraged to check their child s nop jebook ‘Rang assignments req ular! ontnuous Monitoring will hel M4 improve Study habits an academic progress. 3 3 Kindly coordinate with teach rs for any learning concerns ar clarifications,"
    },
    {
        "image": "Notice1_synth_3_aug2.png",
        "label": "Notice",
        "ocr_text": "Schoo! Notice dove! Dear atigents, we fis pieased 2 announce new ts velooments that will enhance your learn: experience this Semester. Please read this notice thore mnky and take note Sugh of the important dates mentioned. Your active ricipation and discipline are highly encouraged Benak: Whom January 23. 2526 12 47 AM “Covered Court important Paints t0 Note: 1 1 Parents are encouraged to check ._ their child s polebsgks, and assignments requiarly, 2. ontinuous monitoring will help improve stud habits and academic progress. 3. Kindly coordinate with teachers for any learning concerns or clarifications."
    },
    {
        "image": "Notice1_synth_3_aug3.png",
        "label": "Notice",
        "ocr_text": "School Notice °2012 02 08 Subject: English Dear Students, we are pleased to announce new developments that will enhance your earning experience this semester. Please read this notice thoroughly and take note of the important dates mentioned. Your active participation and discipline are highly encourages Details: What: Saeco When: January 23, 2026 12 47 AM where: Covered Court Important Points to Note: 1 1 Parents are encouraged to check ._ their child s pofersoks and assignments regularly. 2 2 Continuous monitoring will help improve study habits and academic progress. 3 3 Kindly coordinate with teachers for any learning concerns or clarifications."
    },
    {
        "image": "Notice1_synth_3_aug4.png",
        "label": "Notice",
        "ocr_text": "Schoat Notice euie- 02 08 Engish ‘ant Pointe to Hsia: 11 Parents teen en nore ge fo check F fa amenee vg gla larly 993K eSifnuou is Monitoring wil help UAprove st, uidy habits and academic Progress, 3 3 Kindly Coordinate with 4 achers for any} learning concems oy clarifications,"
    },
    {
        "image": "Notice1_synth_3_aug5.png",
        "label": "Notice",
        "ocr_text": "School Notice °2012 02 08 Subject: English Dear Students, we are pleased to announce new developments that will enhance your learnin: experience this semester. Please read this notice thoroughly and take note of the important dates mentioned. Your active Participation and discipline are highly encouraged. Details: School Safety and Emergen: What: Senge ochre Semmrgeney When: January 23, 2026 12 47 AM *wrere: Covered Court Important Points to Note: 1 1 Parents are encouraged to check __ their child s pofebsoks and assignments regularly. 2 2 Continuous monitoring will help improve study habits and academic progress. 3 3 Kindly coordinate with teachers for any learning concerns or clarifications."
    },
    {
        "image": "Notice1_synth_4_aug1.png",
        "label": "Notice",
        "ocr_text": "Schoo! Notice °4993 08 24 suttyee e Filipino Dear Teachers, this notice is to inform you about updates in our academic calendar and school activities. indly coordinate with your respective departments to ensure proper implementation of the changes. Your cooperation and dedication are greatly appreciated. Detain: What 59 febn Santayana Whee: November 01, 2025 —- 01 00 PM Where: Guidance Ottice fanportant Points to Note: 1 1 All students must participate actively in school activities and events. 2 2 Proper behavior and ae are expected at ail times. 3 3 Let us continue to promote teamwork and respect within the school community."
    },
    {
        "image": "Notice1_synth_4_aug2.png",
        "label": "Notice",
        "ocr_text": "Schooi Notice 4993 08 24 io inform you about eration coop 04 00 Pha bspiontant Paints to Mate: 1 1 All students must particioate actively in schoo! activities and events. 2 2 Proper behavior and discipline are expecied at all times. 3 3 Let us continue fo promote teamwork and respect within the school community."
    },
    {
        "image": "Notice1_synth_4_aug3.png",
        "label": "Notice",
        "ocr_text": "School Notice 4993 08 24 Supjact Filipe Dear Teachers, this notice is to inform you a! jemi and schoot ities. dinate with your respeciive departrnents to oper implementation of the changes. Your cooperation and dedication are greatly appreciated. 125 -- 01 00 PM lungertant Points 19 Note: 1 1 All students must participate actively in school activities and events. 2 2 Proper behavior and discipline are expected at all times. 3 3 Let us continue to promote teamwork and respect within the schoo} community."
    },
    {
        "image": "Notice1_synth_4_aug4.png",
        "label": "Notice",
        "ocr_text": "School Notice °4993 08 24 Subject: Filipino Dear Teachers, this notice is to inform you about dates in our academic calendar and school activities. indly coordinate with your respective departments to ensure proper implementation of the changes. Your cooperation and dedication are greatly appreciated. Details: Stagent Leadership Training What: sr Team Buking Workshop When: November 01, 2025 01 00 PM where: Guidance Office Important Points to Note: 1 1 All students must participate actively in school activities and events. 2 2 Proper behavior and discipline are expected at all times. 33 Let us continue to promote teamwork and respect within the school community."
    },
    {
        "image": "Notice1_synth_4_aug5.png",
        "label": "Notice",
        "ocr_text": "School Notice °1993 08 24 Subject: Filipino Dear Teachers, this Notice is to inform you about Updates in our academic calendar and school activities. indly coordinate with your respective departments to ensure proper implementat h Student Leadership Train What eu aan Ting jonah “When: November 01, 2025 01 00 PM where: Guidance Office 'mportant Points to Note: ust participate actively in school activities and Events. 2 2 Proper behavio"
    },
    {
        "image": "Notice1_synth_5_aug1.png",
        "label": "Notice",
        "ocr_text": "School Notice °2018 12 15 Subject: Araling Panlipunan Dear Parents, we would like to remind you of the upcoming school assessments scheduled for next week. Please make sure your child is well prepared and arrives on time. Your guidance and encouragement play a vital role in their success. Ac SBE BRS CSN ion When: September 25, 2026 08 43 PM Where Registrar s Office Important Points to Note: 1 1 Parents are requested to attend the scheduled parent teacher meeting on time. 2 2 Discussions will include academic progress and future learning goals. 3 3 Your attendance and cooperation are highly appreciated."
    },
    {
        "image": "Notice1_synth_5_aug2.png",
        "label": "Notice",
        "ocr_text": "Schoal Notice andl you of ihe duled for ne: Ienportand Points te reste Parenis are requested to attend “the scheduled parent -teacher meeting on time. 2 2 Discussions will include academic progress and atts jearning goals. 3 3 Your attendance and cooperation are highly appreciated."
    },
    {
        "image": "Notice1_synth_5_aug3.png",
        "label": "Notice",
        "ocr_text": "School Notice nen Wwe WoL! important Points to Nate: 1 1 Parents are requested to attend the scheduled parent teacher meeting on time. 2 2 Discussions wil include academic progress and future learning goals. 3 3 Your atlendance and cooperation are highly appreciated,"
    },
    {
        "image": "Notice1_synth_5_aug4.png",
        "label": "Notice",
        "ocr_text": "Schoo! Notice 9018 12 15 Subject: Arating Paniipunan Dear Parents, we would like to remind you of the upcoming school assessments scheduied for next week. Please make sure your child is well prepared and arrives on time. Your guidarice and encouragement piay a vital role in their success. -— 08 43 PM Inportant Points to Hoe: 1 1 Parents are requested to attend the scheduled parent teacher meeting on time. 2 2 Discussions will include academic progress and future learning goals. 3 3 Your attendance and cooperation are highly appreciated."
    },
    {
        "image": "Notice1_synth_5_aug5.png",
        "label": "Notice",
        "ocr_text": "School Notice 18. 12- Your gi ital role 8 8fe requested ig attend ine scheduled parent teacher Meeting on time. 2 2 iSCussions WH include academic ogress and future arming goals 3 You allendance and COODSration are highhy appreciated."
    },
    {
        "image": "Notice1_synth_6_aug1.png",
        "label": "Notice",
        "ocr_text": "Scheel Notice 2906 09 12 Bubjpet: kaxcayen 02 Prppeiene Dear Guardians. p jease be informed thal or parents and students t there will be a scheduled orientation f is highty encouras ed as next week. Attendance Is important information will be d forward to your active particip: Detate vit: Ha when December 15 2024 -- 05 36 PM wnere: Covered Court important Points 20 Note: iscussed. We ation in this event. d 3 Pash should school grouncs. be disposed of properly in designated bins. 3. together to keep ou 3 Let us work r environment safe and clean."
    },
    {
        "image": "Notice1_synth_6_aug2.png",
        "label": "Notice",
        "ocr_text": "Schoo! Notice de inform: Srspertent Falnts te ste 4 4 Students must maintain gleaniiness in classrooms and scnool grounds. 2 2 Trash should be disposed of properly in designated bins. 3 2 Let us work together to keep our environment safe and clean."
    },
    {
        "image": "Notice1_synth_6_aug3.png",
        "label": "Notice",
        "ocr_text": "School Notice important Points to Note. 4 Students must maintain cleanliness jn £5 tach sh an school grounds, 43 Frasn shouic be dis posed of properl yin designated bins. 3. 3 Let us work together to keep our r environment sale and clean."
    },
    {
        "image": "Notice1_synth_6_aug4.png",
        "label": "Notice",
        "ocr_text": "School Notice leportant Points to Hote: J 1 Students must maintain Gleaniness in Glassrooms and. school grounds. 2 2 Trash snouid be disposed of properly in designated bins. 3 3 Let us work together to k ep our environment safe and clean."
    },
    {
        "image": "Notice1_synth_6_aug5.png",
        "label": "Notice",
        "ocr_text": "School Notice Details: What: General Assembly for at Foackers so By f ecember 15, 2024 “mere: Covered Court When: py, 05 36 PM Important Points to Note: 1 1 tudents must maintain clean oosde des ooms and Seheo! groun S. 2 2 Trash should be disposed of Properly in designated bins. 3 3 Let us work together to keep our environment Safe and clean."
    },
    {
        "image": "Notice1_synth_7_aug1.png",
        "label": "Notice",
        "ocr_text": "School Notice °2012 06 02 Subject: Teony ar veonsEaxatan =} Dear Faculty Members, this notice aims to provide updates on the latest administrative policies and upcoming faculty meetings. Please review the schedule carefully and take note of the new guidelines. Your cooperation ensures a smooth and organized workflow. Details: What: iastoom Management ans see Euurceten Propan When: October 20, 2024 08 42 PM Where: Open Field Important Points to Note: a Teachers are reminded to submit esson plans and activity reports promptly. 2 2 Coordination with department heads is encouraged for smooth implementation. 3 3 Your dedication ensures quality education for our students."
    },
    {
        "image": "Notice1_synth_7_aug2.png",
        "label": "Notice",
        "ocr_text": "School Notice °20 12 06 02 Subject: tense) Uveromes. Dear Faculty Members, this notice aims to provide updates on the latest administrative policies and upcoming faculty meetings. Please review the schedule carefully and take note of the new guidelines. Your cooperation ensures a smooth and organized workflow. Details: What: 5! When: October 20, 2024 08 42 PM *Where: Open Field Important Points to Note: 1] Teachers are reminded to submit esson plans and activity reports promptly. 2 2 Coordination with department heads is encouraged for smooth implementation. 3 3 Your dedication ensures quality education for our students."
    },
    {
        "image": "Notice1_synth_7_aug3.png",
        "label": "Notice",
        "ocr_text": "School Notice °90 12 06 02 Subject: Ternvon) ne urencndeaceon T= Dear Faculty Members, this notice aims to provide updates on the latest ‘administrative policies ani upcomin: faculty meetings. Please review the schedule carefully and take note of the n cooperation ens! Details: What: S22 EyStehent Pavan «when: Qotober 20, 2024 08 42 PM where: Open Field Important Points to Note: 1 4 Teachers are reminded to submit lesson plans an activity reports promptly. 2 2 Coordination with department heads is encourage for smooth implementation. 3 3 Your dedication ensures quality education for our students."
    },
    {
        "image": "Notice1_synth_7_aug4.png",
        "label": "Notice",
        "ocr_text": "School Notice 94) 42 06 02 Subject tem ms ements Dear Faculty Members, this notice aims to provide updates on the latest administrative policies and uy ing faculty meetings. Please review the schedule carefully and take note of the new guidelines. Your cooperation ensures smooth and organized worktiow. Dersits: Cnepnaem Macmgemer: ant Winat: See cs When: October 20, 2024 06 42 PM swine: Open Fiekd important Points to tate: 14 Teachers are reminded to submit esson plans and activity reports promptly. 2 2 Coordination with department heads is encouraged for smooth implementation. 3 2 Your dedication ensures quality education for our students."
    },
    {
        "image": "Notice1_synth_7_aug5.png",
        "label": "Notice",
        "ocr_text": "School Notice °2012 06 02 ‘Subject: reco murconeacaen re) Dear Faculty Members, this Notice aims to provide Updates on the latest administrative Policies and upcoming facult Meetings. Please review the schedule carefully and take note of the new guidelines. Your Cooperation ensures a smooth and orgai nized workflow, Details: When: October 20, 2024 08 42 PM *wnere: Open Field Important Points to Note: 1] geachers are reminded to submit €sson plans an activity reports Promptly. 2 2 Coordination with department heads i"
    },
    {
        "image": "Notice1_synth_8_aug1.png",
        "label": "Notice",
        "ocr_text": "School Notice °2003 03 09 ‘Subject: Physical Education and Heath Dear Parents, we would like to notify you of the upcoming school Sot ty that involves your child s participation. Kindly see the attached details for more information and preparation requirements. We truly appreciate your continued involvement in school matters. Details: What: rds Cenmony Preparation When: November 06, 2025 08 27 PM Where: Canteen Area Important Points to Note: 1 1 Parents should encourage their children to brin Boo necessary items to, school. 2 2 Valuab dears gad ets are alesoteaded unless permitted. 3 3 The school will not be liable for any lost or damaged personal belongings."
    },
    {
        "image": "Notice1_synth_8_aug2.png",
        "label": "Notice",
        "ocr_text": "Schooi Notice G8 27 Pit 44 Parenis should encourage their children to bring only necess y items ta school. 2 2 Valuables and eleciror nic gadgets are discouraged unless permitted. 3 3 The school will net be liable for any lost or damaged personal belongings."
    },
    {
        "image": "Notice1_synth_8_aug3.png",
        "label": "Notice",
        "ocr_text": "gehoa! Notice OB 27 PM important Boies to Wore 44 Parents children to 48 fo school. 22 ages ate discourage should ef noo ee thelr bring, ont J necessaly iter Valuables and, elect ronic Gad unless perm tad, 3 3 The school will not be lable for any lost or garaged persone al bel longings."
    },
    {
        "image": "Notice1_synth_8_aug4.png",
        "label": "Notice",
        "ocr_text": "School Notice °2003 03 09 ‘Subject: Prysical Eaucaton and Heath Dear Parents, we would like to notify you of the upcoming school activity that involves your child s participation. Kindly see the attached defails for more information and preparation requirements. We truly appreciate your series involvement in school matters. Details: What: Student Recogntion and What: otis Ceremony Preperation When: November 06, 2025 08 27 PM Where: Canteen Area Important Points to Note: 1 1 Parents should encourage their children to ool 3 ue necessary S ite s to school. 2 2 alyables and electronic gadgets are discouraged unless permitted. 3 3 The school will not be liable for any lost or damaged personal belongings."
    },
    {
        "image": "Notice1_synth_8_aug5.png",
        "label": "Notice",
        "ocr_text": "School Notice °2003 03 09 ‘Subject: Physical Education and Heath Dear Parents, we would like to notify you of the paricoming school activity that involves your child s ticipation. Kind dly see the attached details for more \"informatie: and preparation requirements. We truly appreciate your continued involvement in school matters. Details: What: Suse Paco When November \"re Canteen Area 08 27 PM 1 1 Parents should pncourage their ton dren to brin oy necessary dems to. school. LB al Uables an nd Ctronic gadgefs ared giscouraged “unl €Ss permitted. 3 3 The school will not be liable ior any lost or amaged personal belongings."
    },
    {
        "image": "Notice1_synth_9_aug1.png",
        "label": "Notice",
        "ocr_text": "School Notice °90 18 05 31 Subject Music, Arts, and Design Dear Students, please be reminded that proper conduct and punctuality are expected during all gchoal act lities, This notice serves as a reminder ‘0 uphold discipline and respect at all times. Your cooperation reflects the values of our institution. Details: What: ica QUA Meng When: January 20, 2026 09 47 AM Where Registrar s Office Important Points to Note: 1 1 Students are advised to prepare early for upcoming examinations. 2 2 Review sessions and group studies are recommen ed for better performance. 3 3 Maintain honesty and integrity during all assessments."
    },
    {
        "image": "Notice1_synth_9_aug2.png",
        "label": "Notice",
        "ocr_text": "School Notice minder YOUr ion. 1 1S Students are advised to prepare early. for upcoming examinations. 2 2 Review sessions and group adies are recommended i for better performance airiain honesty and integrity during ali assessments."
    },
    {
        "image": "Notice1_synth_9_aug3.png",
        "label": "Notice",
        "ocr_text": "School Notice °2018 05 31 Subject: Music, Arts, and Design Dear Students, Please be reminded that proper conctct and Peat are expected during et ivities, This notice serves Sa reminder i Upnala wessiine and respect at al times. Your Cooperation reflects the values of our institution. Details: What ath uae zr When: January 20, 2026 09 47 AM Where Registrar s Office Important Points to Note: 1 1 Students are advised to prepare early for upcoming examinations. R .2 Review sessions and grou Studies are rec ended fi performance. Sa Manise, Ronee iv and integrity during all assessments."
    },
    {
        "image": "Notice1_synth_9_aug4.png",
        "label": "Notice",
        "ocr_text": "School Notice °$0 18 05 31 Subject Music, Arts, and Design Dear Students, please be reminded that proper conduct and punctuality are expected during all school acti ‘ities, This notice serves is a reminder ‘0 uphold discipline and respect at all times. Your cooperation reflects the values of our institution. Details: What: diied QSRSTEVESing When: January 20, 2026 09 47 AM Where Registrar s Office Important Points to Note: 1 1 Students are advised to prepare early for upcoming examinations. 2 2 Review sessions and group studies are recommended for better performance. 3 eo Naintain honesty and integrity during all assessments."
    },
    {
        "image": "Notice1_synth_9_aug5.png",
        "label": "Notice",
        "ocr_text": "School Notice important Points to Note: 1 1 Students are advised to prepare cally for upcoming examinations. 2 Review sessions and group studies are rec om jenged for belt ‘performance. 3 3 Maintain honesty, andi inteonity during all assessmenis."
    }
]