[
    {
        "image": "Notice2_synth_10_aug1.png",
        "label": "Notice",
        "ocr_text": "school transfer Notice Letter peat Alexis FOX We are ple ased to announce thai your child, Angela Flore ey wi ii be perform ing in the upcomin Cul itural J Ars Presentation at Sunt ise College. The event will take P lace on March 30, 2051, in n the school audi itoriu mn starting at 9: 00 a m. Students Fe are, adv sed io attend all nearsais ad ih is week. V OOK (svar 16 ‘ul presence and support during nis celebration Mr. Dennis student talent. gee erely, Cabrera Cultural Coordinate tor Sunrise Co lege"
    },
    {
        "image": "Notice2_synth_10_aug2.png",
        "label": "Notice",
        "ocr_text": "Free Schoo] Transfer Notice Letter School Transfer Notice Letter 1976 08 24 Jennifer Wall 6688 Perry sanyon, Jenkinston, TX 83420 Pear Alexis Fox We are pleased to announce that your child, Angela Flores, will be performing in the upcoming Cultural Arts Presentation at Sunrise College. The event will take place on March 30, 2051, in the school auditorium Starting at 9 00 a m. Students pre advised to altend all re earsals oF eduled this week. We ook forward to your presence and support euring this celebration of student talent. incerely, Mr. Dennis Cabrera Cultural Coordinator Sunrise Letter Templates Template net"
    },
    {
        "image": "Notice2_synth_10_aug3.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 1976 08 24 Jennifer Wall 6688 Perry canyon Jenkinston, TX 83420 Dear Alexis Fox We are pleased to announce that your child, Angela Flores, will be performing in the upcoming Cultural Arts Presentation at Sunrise College. The event will take place on March 30, 2051, in the school auditorium starting at 9 00 Students are advised to attend all a. re earsals scheduled this week. We ook forward to your presence and support during this celebration of student talent. Sincerely, Mr. Dennis Cabrera Cultural Coordinator Sunrise College"
    },
    {
        "image": "Notice2_synth_10_aug4.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 1976 08 24 Jennifer Wall 6688 Perry Canyon, Jenkinston TX 83420 Dear Alexis Fox We are pleased to announce that your child, Angela Flores, will be performing in the upcoming Cultural Arts Presentation at Sunrise College. The event will take place on March 30, 2051, in the school auditorium starting at 9 00 a m. Students are advised to attend all r hearsals scheduled this week. We ook forward to your presence and support during this celebration of student talent. Sincerely, Mr. Dennis Cabrera Cultural Coordinator Sunrise College Letter Templates Template net"
    },
    {
        "image": "Notice2_synth_10_aug5.png",
        "label": "Notice",
        "ocr_text": "Schoo! Transfer Notice Letter 1976 08 24 Jennifer Wail G68S Per Kinston, Dear Alexis Fox We are pleased to announce that your chi id, Angela Flores, will be performing n the upcomin 1g Cultural Arts Presentat ion at Sunrise Coll ege. The evel nt will take place on March 30, 2051, n the school auditori ium starting at 9: mt 5. m. Students are advised to attend all r heatsal s scheduled this week. We look forward to your presence and support du ring. this eeiebyation of student talent. Sincerely, Mr. Dennis Cabrera Cultur al Coordin ator Sunrise College"
    },
    {
        "image": "Notice2_synth_1_aug1.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 2021 03 06 Randy Miller 27461 Richardson Place, Romerofort, KS 92472 Pear Paula Davis We would like to inform you that your child Adrian Lopez, has been selected to represent Bluefield Academy in the upcoming Regional Science Fair. The competition will take place on March 10, 2051, at the City Convention Center. This recognition is a testament to Adrian s hard work and dedication in the field of science. encourage your full support and cooperation to ensure his participation. For questions or additional details, please reach out to the Science Department. Sincerely, Ms. Karen De Gu Sci C inat a"
    },
    {
        "image": "Notice2_synth_1_aug2.png",
        "label": "Notice",
        "ocr_text": "School Transfer Notice Letter 2021 03- 06 Dear Paula Davis We would like to inform you that your child, Adrian Lopez, has been selected to represent Biuefiela Academy in the upcoming Regional Science Fair. [he competi ition will take place on March 10, 2057, at the City Convention Center. This recogniti ion is a testament to Adrian s hard wor Ky and dedication in the fie ield of scl ence. Ve encourage your Tull support and cooperation to ensure his partici ipation. For questions or additional detail ils, please reach out to the Science Depa tment. Si incerely, Ms. Karen De G stele Science Coordinator Blue Academy"
    },
    {
        "image": "Notice2_synth_1_aug3.png",
        "label": "Notice",
        "ocr_text": "School Transfer Notice Letter 2021 ste 06 dear Paula Davis We would like to in form you that your child, Adrian Lopez, aoe been sel lected ‘0 represent Bluefield Academy int upcoming Regional Science Fair The competition will if take place on March 1 2051, at the City en Center. T recognition is $a paige ent to Adrian s hard work and dedicatio in the field of science We encourage Pyour ull support and cooperation fo ensure his partici pation. ror uestions or addi itional details, pi lease iaeal out to the Science Department. Sincerely, Science Coordinator Ms. Karen D Guzma ‘Biuefels Radler"
    },
    {
        "image": "Notice2_synth_1_aug4.png",
        "label": "Notice",
        "ocr_text": "Schooi Transfer Notice Letter ear Paula Davis We would like to inform you that your child Adrian Lopez, has been Selected to represent Bluefield Academy in the upcoming Regional Science Fair The Competition will take place on March 10, 2051, at the City Convention Center. This recognition is a testament to Adrian s hard Work and dedication int field of science, We “neourage your full SUPDDort and Cooperation to ensure his Participation. For questions or additional details, please reach Out to the Scie nce Department. Sincerely, 'S. Karen De Guzme Science Coordinator miuetield Acad my e"
    },
    {
        "image": "Notice2_synth_1_aug5.png",
        "label": "Notice",
        "ocr_text": "Free Sch 90! School Transfer Notice Letter 2021 03 06 Randy Miller 27461 Richardson Piace, Romerofort, KS 92472 Dear Pgula Davis We would like to inform you that your child, Adrian Lopez, has been selected to represent Bluefield Academy in the upcoming Regional Science Fair. The competition will take place on March 10, 2051, at the City Convention Center. This recognition is a testament to Adrian s hard work and dedication in the field of science. encourage your full support and cooperation to ensure his participation. For questions or additional details, please reach out to the Science Department. Sincerely, Ms. Karen De Guzman Science Coordinator luetield Academy"
    },
    {
        "image": "Notice2_synth_2_aug1.png",
        "label": "Notice",
        "ocr_text": "Free Schoo] Transfer Notice School Transfer Notice Letter 201 9 03 30 Daniel Cole 3751 Lawrence Trail Walkerfort, Pw 66495 Pear Mike Schultz This letter Serves As a r mainder that the Upcoming arent Teacher eeting at Starlight Institute is Scheduled for arch 5, 2051. .M. in Schoo] ‘auditorium. e meeting aims to discuss Students Progress and uncom;"
    },
    {
        "image": "Notice2_synth_2_aug2.png",
        "label": "Notice",
        "ocr_text": "School Transfer Notice Letter 2019- 03 30 P88\" Mike Schul [va This letter s ives asa: Shor Werth that the upcoming Parenf- eacher Starlight Institute is scheduled for i arch 15, 2051. The even it will i begin at 8 30 a m. in the school a auditorium, The meet! ing aims to discy ISS students progress and Upcoming school programs. OUF presence is hi ighly encouraged to stren igthen collaboration between home and school. Please confirm your attendance th wough your child s class adviser. Sincere! /, Mr. Paulo Santos Academic Affai irS mead Starlight institute"
    },
    {
        "image": "Notice2_synth_2_aug3.png",
        "label": "Notice",
        "ocr_text": "Schoo! Transfer Notice Letter 2019 03. 30 Daniel Cole BPS A COduS Dea Mike Schultz This letter a reminder that the upcomi ng: Parent éacher hi ieeting at Ses ight instit tute j is scheduled for farch 2051. The event will begin at 8 39 a. ™m. in ne School a audi itorium, meetin iscuss students’ Progress and upcoming Schoo! programs. ighly encouraged to Strengthen collabored ion between nome and sc chool. Pleas attendance t throuc adviser, Sj incerely, Mr. Paulo Series Cademic Affairs Head St"
    },
    {
        "image": "Notice2_synth_2_aug4.png",
        "label": "Notice",
        "ocr_text": "School Transfer Notice Letter 2019 03 30 88\" Mike Schultz This letter serves as a reminder that the upcom| ng Parent Teacher Viet! ing at Starlight Institute is scheduled for March 15, 2051. The event will begin at 8 30 am in the scnool auditorium. The meeting aims to discuss students progress and upcoming school programs Your presence is highly encouraged to strengthen collaboration between home and school. Please confirm your attendance through your child s class adviser. Sincerely, Mr. Paulo Santos Academic Affairs Head Stari lignt Institute"
    },
    {
        "image": "Notice2_synth_2_aug5.png",
        "label": "Notice",
        "ocr_text": "ree School Schoo! Transfer Notice Letter 2019 03 30 Daniel Cole 3751 Lawrence Trait, Walkerfort, PW 66495 Pear Mike Schultz This letter serves as a reminder that the upcoming Parent Teacher Meeting ai Starlight Institute is scheduled for March 15, 2051. The event will begin at 8 30 a m in the school auditorium. The meeting aims to discuss students progress and upcoming school programs. Your presence is highly encouraged to strengthen collaboration between home and school. Please confirm your attendance through your child s class adviser. Sincerely, Mr. Paulo Santos Academic Affairs Head Starlight Institute"
    },
    {
        "image": "Notice2_synth_3_aug1.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 2000 07 04 Nancy Miller 981 Taylor Ford Apt. 523 Martinchester, HI 33605 Dear Jonathan Taylor We are writing to notify you that your child, Miguel Reyes, will be transferring from Greenhills Learning Center to another school effective April 1, 2051. All necessary transfer credentials will be released by the Registrar s Office upon request. We appreciate your cooperation and understanding as we finalize the process. Please feel free to contact us for any further clarification. Sincerely, Ms. Eloisa Ramos Registrar Greenhills Learning Center @"
    },
    {
        "image": "Notice2_synth_3_aug2.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 2000 07 04 Nancy Miller 981 Taylor Ford Apt. 523, Martinchester, HI 33605 Dear Jonathan Taylor We are writing to notify you that your child, Miguel Reyes, will be transferring from Greenhills Learning Center to another school effective April 1, 2051. All necessary transfer credentials will be released by the Registrar s Office upon request. We appreciate your cooperation and understanding as we finalize the process. Please feel free to contact us for any further clarification. Sincerely, Ms. Eloisa Ramos Registrar Greenhills Learning Center"
    },
    {
        "image": "Notice2_synth_3_aug3.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 2000 07 04 Nancy Miller 981 Taylor Ford Apt. 523, Martinchester, HI 33605 Dear Jonathan Taylor We are writing to notify you that your child, Miguel Reyes, will be transferring from Greenhills Learning Center to another school effective April 1, 2051. All necessary transfer credentials will be released by the Registrar s Office upon request. We appreciate your cooperation and understanding as we finalize the process. Please feel free to contact us for any further clarification. Sincerely, Ms. Eloisa Ramos Registrar Greenhills Learning Center Letter Templates Template net"
    },
    {
        "image": "Notice2_synth_3_aug4.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 2000 07 04 Nancy Miller 981 Taylor Ford Apt. 523, Martinchester, Hl 33605 Dear Jonathan Taylor We are writing to notif you that your child, Miguel Re es, will be transferrin from Greenhil S Learni another schoo] effective"
    },
    {
        "image": "Notice2_synth_3_aug5.png",
        "label": "Notice",
        "ocr_text": "ol Transfer Notice Letter Scho 2000 07 04 Nancy Miller 981 ie aylor Fo rd Apt. 523, Marti r, Hl 33605 Dear Jonathan Taylor rout you that your 8, will be transferring another eal ils Lear April 1, 2051. transfer credentials will be released by the Registrar s Office upon request. We appreciate your cooperation and understanding as We finalize the proc contact us tor any. further clarification. Sincerely, oisa Ramos Registrar SE enhills Learning Center"
    },
    {
        "image": "Notice2_synth_4_aug1.png",
        "label": "Notice",
        "ocr_text": "School T ransfer Notice Letter 4991 05 04 bear Kaitlyn Dunn se be advised that classes at Plegse On iow Ediége wil be suspended on March 20, 2051, due to the scheduled campus maintenance. Regular classes will resume the following day, March 21, 2051. We encourage students to use this time to review lessons and prepare for upcoming examinations. Thank you for our understanding and cooperation. Sincerely, Mr. oel Lim School Administrator Horizon View College"
    },
    {
        "image": "Notice2_synth_4_aug2.png",
        "label": "Notice",
        "ocr_text": "School Transfer Notice Letter 1991. 08- 04 min. Dunn ease be adv S86 that cla Ses at orizon View Colle ege will be therended on March, 20, 2051, due t to scheduled campus maintenance egular c Classes will resume the following cay, March 24 2051. We encourage st dents to us 6 this ti review lose UPCOoming exam linations THanke you for your understanding and OOperation, Sincerely, Mr. Noel Lj Im Schoo} “eministrator ‘Honzon View Coll lege"
    },
    {
        "image": "Notice2_synth_4_aug3.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 1991 05 04 Clayton Rose 3380 Burns Crest, Port Christianstad, MI 54525 Dear Kaitlyn Dunn Please be advised that classes at Horizon lew ol ege will be suspended on March 20, 2051, due to the scheduled campus maintenance. Regular classes will resume the following day, March 21, 2051. We encourage students to use this time to review lessons and prepare for upcoming examinations. Thank you for your understanding and cooperation. Sincerely, Mr. Noel Lim School Administrator Horizon View College Letter Templates Template net"
    },
    {
        "image": "Notice2_synth_4_aug4.png",
        "label": "Notice",
        "ocr_text": "School Transfer Notice Letter 1991 05 04 Rose Dear Kaitlyn Dunn Please be Uivises {nat classes at Horizon View College will be suspended on March 20, 2051, due to the scheduled campus maintenance. Regular classes will resume the following day, March 21, 2051. We encourage siudenis to use this time to review lessons and prepare for upcoming examinations. Thank you for your understanding and cooperation. Sincerely, Mr. Noel Lim School Administrator Horizon View College"
    },
    {
        "image": "Notice2_synth_4_aug5.png",
        "label": "Notice",
        "ocr_text": "Free Schoo] Transfer Notice School Transfer Notice Letter 1991 05 04 Clayton Rose 3380 Burns Crest Port Christianstad, MI 54525 Pear Kaitlyn Dunn Please be advise t classes ‘Horizen es Colftat will be at Suspended on March 20, 2051, due to the scheduled Campus maintenance. Regular classes will resume the following day, March 21, 2051. We encourage students to use this time to review lessons and prepare for upcoming examinations. Thank you for your understanding and cooperation. Sincerely, Mr. Noal Lim School Administrator Horizon View College"
    },
    {
        "image": "Notice2_synth_5_aug1.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 1995 04 05 Jason Rivera 012 Peterson Gatewa’ ie 302, Judithburgh, PW 21177 Dear Erik Nixon We would like to inform you that your child, Joshua Garcia, has been identified for academic monitoring due to frequent absences. Attendance plays an essential role in maintaining strong academic performance and engagement. A meeting with the class adviser is scheduled on March 17, 2051, at 2 00 Ee to discuss possible interventions. Please ensure Joshua s presence at the meeting. Sincerely, Ms. Beatrice Flores Guidance Counselor Riverstone Academy Letter Templates Template net"
    },
    {
        "image": "Notice2_synth_5_aug2.png",
        "label": "Notice",
        "ocr_text": "Schooi Transfer Notice Letter 1995 04 05 Dear Erik Nixon We would like to inform you that your child, Joshua Garcia, has been identified for academic monitoring due to frequent absences. Attendance plays an essential role in maintaining strong academic performance and engagement. A meeting with the class adviser is scheduled on March 17, 2051, at 2 00 p m. to discuss possible interventions. Please ensure Joshua s presence ai the meeting. Sincerely, Ms. Beatrice Flores Guidance Counselor Riverstone Academy isles Temolate net"
    },
    {
        "image": "Notice2_synth_5_aug3.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 1995 04 05 Jason Rivera 012 Peterson Gatewa Apt. 302, Judithburgh, PW 21177 Pear Erik Nixon We would like to inform you that your child, Joshua Garcia, has been identified for academic monitoring due to frequent absences. Attendance plays an essential role in maintaining strong academic performance and engagement. A meeting with the class adviser is scheduled on March 17, 2051, at 2 00 Bm. to discuss possible interventions. lease ensure Joshua s presence at the meeting. Sincerely, Ms. Beatrice Flores Guidance Counselor iverstone Academy"
    },
    {
        "image": "Notice2_synth_5_aug4.png",
        "label": "Notice",
        "ocr_text": "Free Schoo] Transfer Notice School Transfer Notice Letter 1 995 04 05 Jason Rivera 012 Peterson ay Apt. 302, Judithburgh, PW 21177 Dear Erik Nixon We would like to inform you t child, Joshua Garcia, has been ifi Cademic Monitoring due O frequent absences, Attendance Plays hat your : -m. to iscuss OSsible interventions. lease ensure Soot ’S Presence at the meeting. Sincerely, Ms. €atrice Flores Guidance Counselor iverstone Academy Letter Templates Template net"
    },
    {
        "image": "Notice2_synth_5_aug5.png",
        "label": "Notice",
        "ocr_text": "School Transfer Notice Letter 1995 04 05 Jason Rivera 012 Peterson Gateway Apt 302, Judithburgh, PW 21177 Dear Erik Nixon We would like to inform you that your child, Joshua Garcia, has been identified for academic monitoring due to frequent absences. Attendance plays an essential role in maintaining strong academic performance and engagement. A meeting with the ciass adviser is scheduled on March 17, 2051, at 2 00 Ee to eee interventions. Please ensure osnua s presence at the meeting. Sincerely, Ms. Beatrice Flores Guidance Counselor Riverstone Academy"
    },
    {
        "image": "Notice2_synth_6_aug1.png",
        "label": "Notice",
        "ocr_text": "School Transfer Notice Letier 2023 12 27 Bryan Heath 8593 We are delighted to inform you that your child, isabella Cruz, has been recognized as one of the Top Performing Students for the second grading period at Northfield High School. The Recognition Day Ceremony will be held on March 28, 2051, at 9 00 a m. in the main auditorium. We are proud of Isabella s achievements and look forward to celebrating this milestone with you. For any inquiries, please contact the Registrars Office. Sincerely, Mr. Rafael Bautista Academic Coordinator Northfield High School"
    },
    {
        "image": "Notice2_synth_6_aug2.png",
        "label": "Notice",
        "ocr_text": "Schoo! Transfer Notice Letter 2023 12 27 Dear Brian Kim We are delighted to inform you that your child, Isabelia Cruz, has been recognized as one of the Top Performing Students for the second grading period al Northfield High School. The Recognition Day Ceremony will be held on March 28, 2051, at 9 00 a m. in the main auditorium. We are proud of Isabella s achievements and look forward to celebrating this milestone with you. For any inquiries, please contact the Registrar s Office. Sincerely, Mr. Rafael Bautista Academic Coordinator Northfield High School"
    },
    {
        "image": "Notice2_synth_6_aug3.png",
        "label": "Notice",
        "ocr_text": "ree School ransfer Notice Letter School Transfer Notice Letter 2023 12 27 Bryan Heath 3858 Hill Center Apt. 764, Cookeburgh, GA 48593 Dear Brian Kim We are delighted to child, Isabella Cruz, has been recognize Performing Students for 2051, at 9 00 a m. in the main auditorium. We are proud of |sabella s achievements and look forward to celebrating this milestone with you. For any inquiries, lease contact the Registrars Office. Sincerely, Mr. Rafael Bautista Academic Coordinator Northfield High School Letter Templates Template net"
    },
    {
        "image": "Notice2_synth_6_aug4.png",
        "label": "Notice",
        "ocr_text": "ree School ransfer Notice etter School Transfer Notice Letter 2023 12 27 Bryan Heath 3858 Hill Center Apt. 764, Cookeburgh, GA 48593 bear Brian Kim We are delighted to inform you that your child, Isabella Cruz, has been recognize Top P rforming Students for the second grading P High School. Ceremony will be held on arc 2051, at 9 00 a m. in he main auditorium We are proud of Isabella s chievements to celebrating this For any inquires, please C Sincerely, Mr. Rafael Bau Coordinator N orthfield"
    },
    {
        "image": "Notice2_synth_6_aug5.png",
        "label": "Notice",
        "ocr_text": "School Transfer Notice Letter 2023 1 2- 27 We are del ighted to inform you that your child, lsabella Cruz, has been recognized as one of the Top Performing Students for the second grading period at Northfield High School. The Recogn ition Day Ceremony will be held on March 28, 2051, at 9 00 a m. in the main audi torium. We are proud of Isabella s achievements and look forward to celebrating this milestone with you. For any inguit ies, please contact the Registrar s Office. Sincerely, Mr. Rafael Bautista Rea Coordinator (Nene id High School"
    },
    {
        "image": "Notice2_synth_7_aug1.png",
        "label": "Notice",
        "ocr_text": "School Transfer Notice Letter Jason Charies We are pleased to inform you that accepted into Nathaniel Ramos has been the Schoo! Leadersh ip Traini ing Program at Evergreen institute. The program will 54, and aims to bed si OF Aarch 25, seamwork, and develop leadersnit ip, ommunication skills. We encourage your full support. to ensure Nathaniel s s active partici ination thro ughout the train ing sessions. For more details, ple jease s Office. contact the 2 Student Al ffairs Liza Montemayor Program Sincerely, Mead Evergt reen Institute @"
    },
    {
        "image": "Notice2_synth_7_aug2.png",
        "label": "Notice",
        "ocr_text": "Schoo} Transfer Notice Letter 201 4 07 29 Andrea Wright 7140 Roberson Passage Apt. 309, Nicolechester. 1A 33562 Pear Jason Charles We are bleased to infor Nathaniel Ramos has been acce ted into the Schoo} Leadership Training at Evergreen institute. The €gin on March 25, 2051, and aims to develop leadership, teamwork, and communication Skills. We encourage your full sup Sessions. For r ils, please Contact the Student Affairs Gfien Sincerely, Dr. Liza Montemayor Program ead Evergreen Institute “mplates J ie"
    },
    {
        "image": "Notice2_synth_7_aug3.png",
        "label": "Notice",
        "ocr_text": "ree School ransfer Notice Letter School Transfer Notice Letter 2014 07 29 Andrea Wright 7140 Roberson Passage Apt. 309, Nicolechester, LA 33502 Dear Jason Charles We are pleased to inform you that Nathaniel Ramos has been acce ted into the School Leadership Training Program at Evergreen Institute. The program will begin on March 25, 2051, and aims to develop leadership, teamwork, and communication skills. We encourage your full support to ensure Nathaniel s active participation throughout the training sessions. For more details, please _ contact the Student Affairs ffice. Sincerely, Dr. Liza Montemayor Program Head Evergreen Institute"
    },
    {
        "image": "Notice2_synth_7_aug4.png",
        "label": "Notice",
        "ocr_text": "School transfer Notice Letter beat Jagon Charles we are pleased to! inform you that Rat mos has been gecepted into ool Leadershi o Training Program en inst The prog ill zims to re out als, a Somiac he, Student Affairs Offic Sincere) ontemayol rogram Head E Ever\" reen Ine jtute"
    },
    {
        "image": "Notice2_synth_7_aug5.png",
        "label": "Notice",
        "ocr_text": "school Transfer Notice Letter We are pleased to inform you that Nathaniel Ramos has been acce sted into the School Leadership Training Program at Evergreen institute. The program will begin on March 25, 2051, and aims to develop leadership, teamwork, and communication skills. We encourage your full support to ensure Nathaniel s active participation throughout the training sessions. For more details, please contact the Student Affairs Office. sincerely, Dr. Liza Montemayor Program institute Head Evergreen"
    },
    {
        "image": "Notice2_synth_8_aug1.png",
        "label": "Notice",
        "ocr_text": "ree School ransfer Notice etter School Transfer Notice Letter 4987 07 01 Drew Price 427 Tanya village North Tony, MT 68904 Dear Joshua Jackson This notice is to inform you that your child, Hannan astillo, has been join the Community approves to utreach Activit organized by nt will take Lakeshore College. The eve place on April 5, 5051, at Barangay San Miquel. Students are reminded to bring light snacks, extr ing, and personal essentials. We appreciate your support in promoting social awareness among our learners. Sincerely, Mr. Jerson Alonzo Outreach Coordinator Lakeshore College"
    },
    {
        "image": "Notice2_synth_8_aug2.png",
        "label": "Notice",
        "ocr_text": "Free Schoo] Transfer Notice Letter School Transfer Notice Letter 1987 07 01 Drew Price 427 Tanya village, North Tony, MT 68904 Dear Joshua Jackson This notice is to inform you that your child, Hannah Castillo, has been approved to join the Communit utreach tloavity organized by Lakeshore College. The event will take Place on April 5, 2051, at Barangay San iguel. Students are reminded to bring lig t snacks, extra clothing, and personal essentials. We appreciate your Support in Promoting social awareness among our learners. Sincerely, Mr. Jerson Alonzo Outreach Coordinator Lakeshore College"
    },
    {
        "image": "Notice2_synth_8_aug3.png",
        "label": "Notice",
        "ocr_text": "Schoo! Transfer Notice Letter 1987 07 01 Dear Joshua Jackson This notice is to inform you that your child, Hannah Castillo, has been approved to join the Cormmunity utreach Activity organized by Lakeshore College. The event will take place on April 5, 2051, at Barangay San Miguel. Students are reminded to bring light snacks, extra clothing, and personal essentials. We appreciate your support in promoting social awareness among our learners. Sincerely, Mr. Jerson Alonzo Outreach Coordinator Lakeshore College"
    },
    {
        "image": "Notice2_synth_8_aug4.png",
        "label": "Notice",
        "ocr_text": "ree School ransfer Notice etter School Transfer Notice Letter 4987 07 01 Drew Price 427 Tanya Village North Tony, MT 68904 Dear Joshua Jackson This notice is to inform you that your child, Hannah Castillo, ha é approver to join the Community utreach Activity organized by Lakeshore College. The event will take place on April 5, 2 51, at Barangay San Miguel. Students are reminded to bring and personal light snacks, extra clothing, i reciate your support In essentials. We app awareness among Our on Alonzo learners. Sincerely, Mr. Jers Lakeshore College Outreach Coordinator Letter Templates Template net"
    },
    {
        "image": "Notice2_synth_8_aug5.png",
        "label": "Notice",
        "ocr_text": "_ Fenster Notice PAREEBR OS Schoo! Transfer Notice Letter 1987 07 01 Drew Price 42? Tanya Village, North Tony, MT 68904 Pear Joshua Jackson This notice is to inform child, Hannah Castillo, has been 4 pproved to join the Communit utreach Activit organized b Lakeshore College. The €vent will take place on April 5, 2051, at B you that your"
    },
    {
        "image": "Notice2_synth_9_aug1.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 1983 05 17 Zachary Thomas 7411 Kristopher Uae Derekport, PR 19003 Dear Charles Macdonald We would like to remind you that the annual anon! Orientation for new students at Valley Crest Academy will be held on March 22, 2051. The session wu\" Peat at 8 00 a m. in the gymnasium will inclide an overview of school Do icles and programs. Attendance is required for all new students and their guardians. Should you have questions, please contact the Administration Office. Sincerely, Ms. Clarisse Santiago Admin Officer Valley Crest Academy"
    },
    {
        "image": "Notice2_synth_9_aug2.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 1983 05 17 Zachary Thomas 7411 Kristopher Tumpike, Derekport, PR 19003 Dear Charles Macdonald We would like to remind you that the annual School Orientation for new. students at Valley Crest Academy will be held on March 22, 2051. The session will begin at 8 00 a m. in the gymnasium and will include an overview of school policies and programs. Attendance is required for all new students and their guardians. Should you have questions, please contact the Administration Office. Sincerely, Ms. Clarisse Santiago Admin Officer Valley Crest Academy"
    },
    {
        "image": "Notice2_synth_9_aug3.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 1983 05 17 Zachary Thomas 7411 Kristopher Tur mpike Derekport, PR 19003 Dear Charles Macdonald We would like to remind you that the annual school Orientation for new students at Valley Crest Academy will be held on March 22, 2051. The session wil begin at 8 00 a m. in the gymnasium will include an overview of school Do Icies and programs. Attendance is required for all new students and their guardians. Should you have questions, please contact the Administration Office. Sincerely, Ms. Clarisse Santiago Admin Officer Valley Crest Academy"
    },
    {
        "image": "Notice2_synth_9_aug4.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 1983 05 17 Zachary Thomas eat Kristo} rokoon PR PR 13003 Dear Charles Macdonald We would like to remind you that the annual Senor Orientation for new students at Valley Crest Academy will be held on March 22, 2051. The session wal peat at 8 00 a m. in the gymnasium will inclide an overview of school Do icles and programs. Attendance is required for all new students and their uardians. Should you have questions, please contact the Administration Office. Sincerely, Ms. Clarisse Santiago Admin Officer Valley Crest Academy Letter Templates Template net"
    },
    {
        "image": "Notice2_synth_9_aug5.png",
        "label": "Notice",
        "ocr_text": "Free School Transfer Notice Letter School Transfer Notice Letter 1983 05 17 Zachary Thomas 7411 Kristopher Tumpike, Derekport, PR 19003 Dear Charles Macdonald We would like to remind you that the annual School Orientation for new. students at Valley Crest Academy will be held on March 22, 2051. The session will begin at 8 00 a m. in the gymnasium and will include an overview of school policies and programs. Attendance is required for all new students and their guardians. Should you have questions, please contact the Administration Office. Sincerely, Ms. Clarisse Santiago Admin Officer Valley Crest Academy"
    }
]