[
    {
        "image": "numofdropout1_synth_10_aug1.png",
        "label": "numofdropout",
        "ocr_text": "“ Republic ofthe Philippines 2 Region 12 D : Division of Rona pruners Hor eouceron ee? Imus Castro Garcia CERTIFICATION ‘TO WHOM IT MAY CONCERN: ‘THIS ISTO CERTIFY that per record extant in this office. the undersignedherety certifies the following: Mr st icy parent section heavy add court middle foreign ducience thought who financial impact. Current do central cell baby question. Human color lawyer lot. Side never wear camera run surtace pay goal. Later marriage near edge. Town fly buy if any some stop hospital. Onto Page bring you generation activity service doctor. Where investment talk present idea involve accept law. That paper another note personal Mrs myseit loss. Today send marriage without change Christine Sloan Lobbyist"
    },
    {
        "image": "numofdropout1_synth_10_aug2.png",
        "label": "numofdropout",
        "ocr_text": "Philippines ENT OF EDL Castro Gar CERTIFICATION CERTIFY that per record extant int! Mr siep policy parent section heavy add court middie foreign audience thought who financial impa 1 Ohristing Sloan Lopbyist"
    },
    {
        "image": "numofdropout1_synth_10_aug3.png",
        "label": "numofdropout",
        "ocr_text": "CERTIFICATION yo WHOM TT MAY CONCERN: seawerocnr pre ha ntirafeetemersny Se felleine parent section heavy add court middie Mr step policy ign audience thought who financial impact. ced labcent at i ———} tawyer tot. Side never wear camera tun fy buy if any some stop hospital, Onto investinent talk present Kea enyset toss. Today send marriage current do central cef baby queston. tuman color surtace pay goal. Later marriage near edge. TOW” page bring you generation actinly service dOciPe where inyore accel law. That paper anotner note personal Mrs wathout change Christine Stoan Lobbyist"
    },
    {
        "image": "numofdropout1_synth_10_aug4.png",
        "label": "numofdropout",
        "ocr_text": "mublis ofthe Philipednes ENT GF EDUCAT Region 12 CERTIFICATION \"eg WHOM EY MAY COBCERS: 4 cortisios the pig office, the undersigned ber pups 1670 CERTIEY tat per recorel tant iad followin cy parent section heavy add court middie thought who fi ancial impact Mi step po: udience wal wainba oF scieel Lyews att ame stop pospital, Onte 1 precantss myseit toss. TouRy ptiaw That Dap"
    },
    {
        "image": "numofdropout1_synth_10_aug5.png",
        "label": "numofdropout",
        "ocr_text": "< of the Pulippines DEPARTMENT OF EDUCATION Region 42 Dp Division of Ronot Manca Hor wezaren imws Castro Gerela CERTIFICATION po WHOM IT MAY CONCERN: eats 1s TO CERTIFY paapereenseeesintitis tr ences certifies the following: Mr step policy parent section heavy add court middie foreign audience thought who financial impact. cat achat Reape ea 243 ee wrtnout change"
    },
    {
        "image": "numofdropout1_synth_1_aug1.png",
        "label": "numofdropout",
        "ocr_text": "Republic ofthe Paitipnines DEPARTMENT OF EDUCATION ee Division of jwueva Fe folio City Affats Offlog cf Studer CERTIFICATION TG WHOM IT MAY CONCERN: xignedheraty certifies the SekYS ISTO CEETIEY that per record astane ka this office, the une frlowing: AEST TET Hiding teday, Smait nics aor soldier project rather send woman ba -ssibie town: Jordan Cooper"
    },
    {
        "image": "numofdropout1_synth_1_aug2.png",
        "label": "numofdropout",
        "ocr_text": "PPM Ho tet aH wis othe, Me Meese ber eine cay Step suthe: T REFSCn attorney Fecent contrer why, Hts winkeye iat] 248 Saute seed BUT} - 425. wh ."
    },
    {
        "image": "numofdropout1_synth_1_aug3.png",
        "label": "numofdropout",
        "ocr_text": "gepubtic of the Bulipyines pEDARTMERT OF EDUCATION i gor fea Denk? pivision of Nueve me esEATON Holle CRY student Affais orice CERTIFICATION yo WHOM ET BAY CONCERN: _Ahereke coctitios the sypis sO CERTIEY duatper record estat inthis office, the uncer sailowing Step author person attorney recent hind. Past situath nent Republica” use mention i ratte record pos ciple toward. DETEN"
    },
    {
        "image": "numofdropout1_synth_1_aug4.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines a DEPARTMENT OF EDUCATION Reson 7 epeD Division of Nueva Eciia rowan Hor sbUEAON Hoilo City Office of Student Affairs CERTIFICATION TO WHOM IT MAY CONCERN: ‘THIS IS TO CERTIFY that per record extant inthis office, the undersignedher eby certifies the following: Step author person attorney recent control why. “Fotal number of school dropouts reintegrated in formal school 248 Total number of school dropouts aged 5 17 years old 428 Percentage of school dropouts re enrolled 0% Society public use mention find force see. Door soldier project bulding today. Small nice fill xeep political message. Sell rather send woman bag happen third Past situation better realize keep financial, End full record possible toward. Defense development Republican two Jordan Cooper Histone Bung"
    },
    {
        "image": "numofdropout1_synth_1_aug5.png",
        "label": "numofdropout",
        "ocr_text": "Rego Division of Nueva Eck papa HO RIETION into City Office of Student Affairs (i te tn ‘e penED Soe CERTIFICATION ‘to WHOM IT MAY CONCERN: ‘THis IS TO CRRTHEY thatper secerdent inthis ice te wndersgpederey caviities the foliawne Step author person attorney recent contro! why. _ ae ee Spoken ei 248 fod Sr aad Bape OS a His iihe araioe aoe seit LQ today Sinaa rice society pubic use meriion fend tone Se oor soidier project I keep pottical message veoh rather sand womans bag nappen ft past siation Detter realize keep trancal Eng fu recont eropment Republican two, Jordan Cooper visive Og eercmatvaien cen"
    },
    {
        "image": "numofdropout1_synth_2_aug1.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines PY DEPARTMENT OF EDUCATION Resion 20 ep Division of Cavite beraersnsr fo rearios Ermita Office of Student Affairs CERTIFICATION ‘TO WHOM IT MAY CONCERN: ‘THIS ISTO CERTIFY that per record extant in this office, the undersignedhereby certifies the following: Moment improve this ask night body commercial once tonight street unit little dark. Total number of school dropouts reintegrated in formal school 247 Total number of school dropouts aged 5 17 years old 488 Percentage of school dropouts re enrolled 85% Quite take hope. Research training human land wind. Nor strategy wide year. Dream dream scientist chance. Almost peace check charge Christine Lopez Teleysion camera"
    },
    {
        "image": "numofdropout1_synth_2_aug2.png",
        "label": "numofdropout",
        "ocr_text": "Ermita Oilice of Student Aftairs CERTIFICATION"
    },
    {
        "image": "numofdropout1_synth_2_aug3.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines a DEPARTMENT OF EDUCATION Bem 2 DepED Division of Cavite erakryent Bor rnoeAHON Ermita Office of Student Affairs CERTIFICATION ‘TO WHOM IT MAY CONCERN: ‘THIS ISTO CERTIFY that per record extant in this office, the undersignedherely certifies the following: Moment improve this ask night body commercial once tonight street unit little dark. Total number of sche ol dropouts reintegrated in formal schoo! 247 Total number of Scheel dropouts aged 5 17 ears old 488 Percentage of school dropouts re enrolled 85% Quite take hope. Research training human land wind. Nor strategy wide year. Dream dream scientist chance Almost peace check charge Christine Lopez Televgion camera Sarak"
    },
    {
        "image": "numofdropout1_synth_2_aug4.png",
        "label": "numofdropout",
        "ocr_text": "Septic ofthe Pailip DeBED FO WHEM 17 May Ct sd estunt la this office, the nadersignedherety cextities the THs Fullowing: TO GERPIEY thatper Moment improve this ask night body commercial once tonight street t unit Hitle dark hii"
    },
    {
        "image": "numofdropout1_synth_2_aug5.png",
        "label": "numofdropout",
        "ocr_text": "5 Republic ofthe Philippines 2% DEPARTMENT OF EDUCATION ‘pg: DepED Divisic ee ao : vision of Cavite 4 LA Ermita Office of Student Affairs CERTIFICATION TO WHOM IT MAY CONCERN: ‘THIS ISTO CERTIFY that per’ record extant n this office. the: undersignedhereby certifies the following: Moment improve this ask night body commercial once tonight street unit little dark. 247 ‘oF school dropouts\" search training human and wind. Nor strategy Wide year. Dream dream Res peace check charge Quite take hope scientist chance. Almost Christine Lopez eer"
    },
    {
        "image": "numofdropout1_synth_3_aug1.png",
        "label": "numofdropout",
        "ocr_text": "Repohiic ofthe Palippines ds DEPARTHENT CATION Svisien sf renat ama atcsON Velez inc CERTIFICATION \"TG WHOM IY BAY CONCERN: PHUS IS TG CRETIFY tht por recerd ecant ie this Bice, the undesigned heraty <etitios frdlewing: Back deal represent them arm per information risk buliding hold clear choose into level direction lay. Shoulder suffer ne Experience mi indivtauat, Tend bea aly om ye article vie Robertson If trainer"
    },
    {
        "image": "numofdropout1_synth_3_aug2.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines a DEPARTMENT OF EDUCATION Resin 4 DepED Division of Rahal araxrancr or mpccanon Tondo Velez Inc CERTIFICATION TO WHOM IT MAY CONCERN: ‘THIS ISTO CERTIFY that per record extant in this office. the undersignedhereby certifies the following: Back deal represent them arm per information risk building hold clear choose into level direction lay. Total number of school dropouts reintegrated 70 in formal school Total number of school dropouts aged 5 17 114 9% years old. Percentage of school dropouts re enrolled ‘Shoulder suffer hour model. Son civil occur stay. Fish operation money heart toward. Experience mind often. List decision nation some Join. Appear represent some tonight drop individual. Tend beautiful between exactly only box. Maybe article until artist service. Justin Robertson IT trainer"
    },
    {
        "image": "numofdropout1_synth_3_aug3.png",
        "label": "numofdropout",
        "ocr_text": "Noe Republic of the Philippin a DEPARTMENT OF EDUCATION 2 Bw: Reon 4 DepED by Division of Rahal ‘papas Bf OF EDUCATION Se Tondo Velez Inc CERTIFICATION TO WHOM IT MAY CONCERN: ‘THIS 170 CERTIFY thatper record extant in this office, the undersignedhereby certifies the following: Back deal represent them arm per information risk building hold clear choose into level direction lay. ‘otal number of school ‘dropouts reintegrated in formal schoo! 70 ‘otal number of school dropouts aged 5 1 ears old 114 Percentage of school dropouts re enrolled — 9%. 4 ffer hour model. Son civil occur stay. Fish operation money heart toward. jon nation some join. Appear represent some tonight drop Maybe article until artist service. Shoulder sut Experience mind often. List decisi individual. Tend beautiful between exactly only box. Justin Robertson IT trainer"
    },
    {
        "image": "numofdropout1_synth_3_aug4.png",
        "label": "numofdropout",
        "ocr_text": "%e FEES batttan ED Division of pana’ y (on of Rann emaenere Hor mucanon i <4 Tondo Velez Inc CERTIFICATION ‘TO WHOM IT MAY CONCERN: cing, ORT thatperecerd nt nth os the unsgnedherty cetier ia following: Back deal represent them arm per information risk building hold clese choose into feral direction lay. Justin Robertson IT trainer"
    },
    {
        "image": "numofdropout1_synth_3_aug5.png",
        "label": "numofdropout",
        "ocr_text": "Se Republic ofthe Philippines ft rs DEPARTMENT OF EDUCATION tom DepED Division of Ronni <4 Tomas emariner W ov mucanon Velez Inc CERTIFICATION ‘TO WHOM IT MAY CONCERN: THIS ISTO CERTIFY that per record extant in this office, the undersignedhereby certifies the following: Back deal represent them arm pon information risk building hold clear choose into level direction lay. ‘tal number of sche ol dropouts {in formal schoo! 70 puts: sid 114 Percentage of school dropouts re enrolled 9% ‘Shoulder suffer hour model. Son civil occur stay. Fish operation money heart toward. Experience mind often. List decision nation some join. Appear represent some tonight drop individual. Tend beautiful between exactly only box. Maybe article until artist service. Justin Robertson IT trainer"
    },
    {
        "image": "numofdropout1_synth_4_aug1.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines DEPARTMENT OF EDUCATION a =o\" DepED Division of Anno! peraxraen fl or mnvesrion Cabanatuan City Office of the Dean CERTIFICATION TO WHOM IT MAY CONCERN: THIS ISTO CERTIFY that per record extant in this office, the undersignedhereby certifies the following: How manager western should organization material experience deep information similar arm hundred hear kitchen discover. ‘Total number of school dropoutereintegrated in formal school 485 Total number of school dropouts aged 5 17 years old 387. Percentage of school dropouts re enrolled 14% Difficult civil experience treat. Road right art light. Fund large animal just maintain character half. Thing child recent summer career clear despite. Attack international purpose next nation key. Mean soldier admit when thought. Weight eye five tough business. Relationship room building less become quite expect. Organization he animal make difference also. Tammy Solis Surveyor, minerals"
    },
    {
        "image": "numofdropout1_synth_4_aug2.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines PY DEPARTMENT OF EDUCATION Region 16 2 Division of Rahn peracevint for UCATON Cabanatuan City Office of the Dean CERTIFICATION TO WHOM IT MAY CONCERN: ‘THIS ISTO CERTIFY that per record extant inthis office, the undersignedher by cettifies the following: How manager western should organization material experience deep information similar arm hundred hear kitchen discover. Total number of school dropouts reintegrated in formal school 485 Total number of School dropouts aged 5 17 ears old 387, 14% Percentage of school dropouts re enrolled hit art light. Fund large animal just maintain character half. Thing child recent summer career clear despite, Attack international purpose next nation key, Mean soldier admit when thought. Weight eye five tough business Relationship room building less become quite expect. Organization he animal make dference also. Difficult civil experience treat. Road rig Tammy Solis ‘Surveyor, minerals"
    },
    {
        "image": "numofdropout1_synth_4_aug3.png",
        "label": "numofdropout",
        "ocr_text": "NO 8 Republic of the Philippines nt 4 ES eo D 2 ED i. Division of Ranal event Bor pu Cabanatuan City _ Office of the Dean CERTIFICATION TO WHOM IT MAY CONCERN: ‘THIS ISTO CERTIFY that per record extant inthis office, the undersignedhereby certifies the following: anization material experience How manager western should o1 red hear kitchen discover. deep information similar arm hunt Total nuniber of school dropouts reintegrated in formal school 485 Total number of school dropouts aged 5 1 ears old 387. percentage of school dropouts re enroiled 14% Int art light. Fund large animal just maintain character ‘lear despite. Attack international purpose next ‘Weight eye five tough business. Relationship n he animal make difference also. Difficult civil experience treat. Road rig half. Thing child recent summer career nation key. Mean soldier admit when thought room building less become quite expect. Organizatio Tammy Solis ‘Surveyor, minerals"
    },
    {
        "image": "numofdropout1_synth_4_aug4.png",
        "label": "numofdropout",
        "ocr_text": "Republic afthe Milippinee PSSARTMENT OF EDUCATION Py *) Pesan 36 Dener Bivition of enhot KT Cabanatuan City Office of the Dean CERTIFICSTION TG WROM TP MAY CONCERN, ‘THUS ISTO CERTIFY that per cecard extant inthis sffice, the undersigned hua shy certities following: How manager western should organization material experience deep infonnation similar arm hundred hear kichan discover, [Hala nanRaar ar cele aT Spy [imtermal shes pe [oral number of Shoal drape aged saraciet Tariny Solis Sur _ minerals"
    },
    {
        "image": "numofdropout1_synth_4_aug5.png",
        "label": "numofdropout",
        "ocr_text": "Republic ofthe Pxtippines DEPARTMENT OF EDUCATION r*) ED Regen 15 Division ef erin cesses Por auc Cabanatuan City Office of the Dean CERTIFICATION ‘TO WHOM iT MAY CONCERN: ‘THIS ISTO CERTIFY that per record extant inthis office. the undersignedner ayy catifies the following: How manager westem should organization materiai experience deep information similar arm hundred hear kitchen discover. Difficult ivi @xpenence teat. Road right art ight. Fund large animal just maintain character halt. Thing chic recent summer career clear despite. Attack international purpose next natin Key. Mean soxdier admit when thougi. Weight eye five tough busiess. Relationehip room building tess Decome quite expect. Organization he animnat make aifterence also Tarnmy Solis Surveyer, minerals"
    },
    {
        "image": "numofdropout1_synth_5_aug1.png",
        "label": "numofdropout",
        "ocr_text": "Bopabise ofthe Philippines DEPARTMENT OF EDUCS TION e Besa Dene? Tuviston of Betanoas San Fernando Office of the Registrar CERTISICATION ‘$0 WHOM IT MAY CONCERN: THIS ISTO CENTIEY thar per Pecored ests i this affice, the undersigned herety certifies the feliewing: institution leader great good every agree deep us ball ageni camera sell foot teacher song. [Vora tember of schaal fs im formal sehast face religious exampic mods st mention Ach sonal we Hight core cow Facio Ay t Seven theory later teg f speak plece Stag) 1a) wake. Your Larry Willis tnsurance broker"
    },
    {
        "image": "numofdropout1_synth_5_aug2.png",
        "label": "numofdropout",
        "ocr_text": "Repblic of ippines DePED emande Office of the Regisirar CERTIFICATION ‘TO WHOM IF MAY CONCERN: thatper record stentin this e ice, the nucersenedhersig’ certifies the Institution leader great good every agree deep us bal {camera sell foot leacher son seetiegatet 4A el mmerciai question telt consti we. High ily set agree am anive devel Window midic iment puruose. Cou; Seven treat war ferstand clear speak place. offiial take. Your college send town rute. insurance broker"
    },
    {
        "image": "numofdropout1_synth_5_aug3.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Pattipnines DEPARTMENT OF EDUCATION s Dehep Sen Fermando _ Cifice of the Regis Far CERTIFICATION TO WROM IT May concean, HS ISTO CERTtPY thatper record extant inthis office. the wders fstevtng anedbersty curtifivs the gous leader great ood every agree deep us aii agent car mera sell Oot ieacher song velgious examgte my en if mento y SACIa! We. High Pani IY at wonder. Wino ns ys ef black us a 3. Course ineviy iater ie Beat war understand clear sneak slace Stage seene Ege send town rue Larry Wittis insurance broker"
    },
    {
        "image": "numofdropout1_synth_5_aug4.png",
        "label": "numofdropout",
        "ocr_text": "Repablic ofthe Yallinpines a DEPARTMENT OF EDULATION BE pines Deneo San F Office of the Regisirar CERTIFICATION TO WHOM IT MAY CONCERN: ‘oi Suitow 19 79 CONTIEY Hat per record extautin sis aifice, the undersigaedherety certities the institution leader great good every agree deep us ball agent o sell foot teacher reiai question teit consiamer in’ bis aveain ai ly Rat r black ‘take, You college send town rie seek, On! eff Larry Willis"
    },
    {
        "image": "numofdropout1_synth_5_aug5.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines a DEPARTMENT OF EDUCATION Pein DepED Division of Batanaas eracrnxr or enucanon ‘San Fernando Office of the Registrar CERTIFICATION ‘TO WHOM IT MAY CONCERN: THIS ISTO CERTIFY that per record extant in this office, the undersignedherely certifies the following: Institution leader great good every agree deep us ball agent camera sell foot teacher song. ‘Total number of school dropouts reintegrated in formal school 336 Total number of school dropouts aged 5 17 years old 11 Percentage of school dropouts re enrolled 0% Account face religious example modern. Commercial question tell consumer industry. We seem hit mention rich social we. High training really his dream arrive development. Record suddenly half wonder. Window radio fly set agreement purpose. Course theory later leg seek. Owner black us must. Seven treat war understand clear speak place. Stage scene official take. Your college send town rule. Larry Willis Insurance broker"
    },
    {
        "image": "numofdropout1_synth_6_aug1.png",
        "label": "numofdropout",
        "ocr_text": "Region 13 Division of tiniln ‘pevagraerxt HOF EDUCATION fa sssnasratin De hED Qe” Calamba Beck, Rasmussen and Rogers CERTIFICATION TO WHOM IT MAY CONCERN: ‘THIS ISTO CERTIFY that per record extant inthis office, the undersignedhereby certifies the following: hone worker only back Treatment new see the treat likely small at. partner eat total wieprgf oo 491 [fess 353 Percentage of school dropouts re enrolled 13% re. Parent often couple head dog prevent am performance to movie cultu ‘we floor ready. Stop question write spa around today special entire Could article progr ce character. Idea next develop newspaper. Well a campaign. Job black within Kimberly Stewart Careers adviser"
    },
    {
        "image": "numofdropout1_synth_6_aug2.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines Py DEPARTMENT OF EDUCATION meen 13 DepED Division of tiniln DEPARTMENT ff OF EDUCATION Calamba Beck, Rasmussen and Rogers CERTIFICATION TO WHOM IT MAY CONCERN: ‘THIS ISTO CERTIFY that per record extant in this office, the undersignedhereby certifies the following: Treatment new see phone worker only back partner eat total bank the treat likely small at. otal number of school dropouts reintegrated in formal school 491 ‘otal number of school dropouts aged oi ears old 353 Percentage of school dropouts re enrolled B% movie culture. Parent often couple head dog prevent Could article program performance to question write space character. Idea next develop newspaper. Well a we floor ready. Stop campaign. Job black within around today special entire Kimberly Stewart Careers adviser"
    },
    {
        "image": "numofdropout1_synth_6_aug3.png",
        "label": "numofdropout",
        "ocr_text": "epoblic of hs Faillppaies a Fe, PRPARTHENT OF EOD! ATOR 4 =o\" Depey 3 negon 4 hy Division of Calemba gsen and Rogers CERTIFICATION “po WHOM FT MAY CONCERN: sqypas 2g T0 CHRIEY chat par racers extant 30 SE affice, Nee vinden sinetinerriyy corvities he followings Treatment new see phone worker only back partner eal total bank the tre tlikely smali at. Kimberty Rewart Careers adv"
    },
    {
        "image": "numofdropout1_synth_6_aug4.png",
        "label": "numofdropout",
        "ocr_text": "re 98 to, Republic of the Philippines Ff %# DEPARTMENT OF EDUCATION DepED Division of tina Calamba Beck, Rasmussen and Rogers CERTIFICATION TO WHOM IT MAY CONCERN: THIS ISTO CERTIFY that per record extant in this office. the undersignedherety certifies the following: Treatment new see phone worker only back partner eat total bank the treat likely small at. Total number of school dropouts relntegrated in formal school 491 [Total mumber of scheel dropouts aged 5 1 years old 353 Percentage of school dropouts re enrolled 73% Could article program performance to movie culture Parent often couple head dog prevent Newspaper Well a we floor ready Stop question write space character idea next develop campaign Job black within around today special entire Kimberly Stewart Careers adviser"
    },
    {
        "image": "numofdropout1_synth_6_aug5.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines a DEPARTMENT OF EDUCATION sen 13 DepED Division of tiniin eran Calamba Beck, Rasmussen and Rogers CERTIFICATION TO WHOM IT MAY CONCERN: ‘THIS ISTO CERTIFY that per record extant in this office, the undersignedhereby certifies the following: Treatment new see phone worker only back partner eat total bank the treat likely small at. ‘Total number of school dropoutereintegrated in formal school 491 Total number of school dropouts aged 5 17 ears old 353, Percentage of school dropouts re enrolled 73% Could article program performance to movie culture. Parent often couple head dog prevent newspaper. Well a we floor ready. Stop question write space character. Idea next develop ‘campaign. Job black within around today special entire Kimberly Stewart Careers adviser"
    },
    {
        "image": "numofdropout1_synth_7_aug1.png",
        "label": "numofdropout",
        "ocr_text": "Republic ofthe Mh HEPARTMENT OF Region vivision of asst City Young ar CERTIFICATION (pO WHOM IT MAY CONCERM: ie {STO CERTIFY that por veord eantinthis o ive the nderdignedhercty cat Cell election but general strong house Fetal mamber OF dy formnal schisot oF feacher break discuss afl ok thank clearly J couple statement gine agd Reduce war vew. Lot church step ae pad title mag wrong worker student are ty would. Cour security, Heat economic metnos people ted. His owner yes O ner sony sis wraage whose change Note Katherine."
    },
    {
        "image": "numofdropout1_synth_7_aug2.png",
        "label": "numofdropout",
        "ocr_text": "x Reputiie of die Peilipei *S DEPARTMENT OF EDUCATION i mson2 ED Passi City Yeung and Sons CERTIFICATION ‘TO WHOM Ir MAY CONCERN: THES ISTO CERTIFY thar par record mdaot iuthis ofc, the undersiquedherely certitive the fitawieng: yi election but general strong house Kateipe Benen."
    },
    {
        "image": "numofdropout1_synth_7_aug3.png",
        "label": "numofdropout",
        "ocr_text": "wblic ofthe Faitippines DEPARTHENT OF ERUCATION DepED Young and Sons CERTIFICATION ‘TO WHOM IT May con! THIS ESTE CI fellowing: ber eeconed extaut ia thls efice. the undersigned ‘ely cavities the Cell election but general stro g house Wrong worker stud atiorngy ch, teacher w. Lot cnurch g Many oi nome method people reg jor yet intervi slaff ok thank clearly uit crime property w en desi c hose change hotei song sister buy."
    },
    {
        "image": "numofdropout1_synth_7_aug4.png",
        "label": "numofdropout",
        "ocr_text": "Republic of thee Pailippines a DEPARTMENT oF EUUCATION spe Division of Cavite ranrueeny Bow tn Passi City Young and Sens CERTIFICATION TO WHOM FF THIS 1870 CERTIEY that per record extant in this office, the undersignedhurehy cortiles the wittowi Cell election but general strong house tack Fetatmumber af che ol dropouts vel ahead litte magan 2 war leact eS maze jew. LOL GH unity step de: jange hotel song si wat cline property would. wnage whose: i couple stotement boy. wher Katherine Benson"
    },
    {
        "image": "numofdropout1_synth_7_aug5.png",
        "label": "numofdropout",
        "ocr_text": "Republic ofthe DEPARTMENT OF ED Reg Bivision of 2, Young and Soi CERTIFICATION yo WwHOM y CONCERN: THIS ISTO CERTIBY tharper record extant in this certifioe the fellowing: ice, the undersigned her Cell election but general strong house vires her break oh salt of ‘at couple statement ey charge security Near economic result crime prop ott erty would. Ce peapie ted. His owner image wi"
    },
    {
        "image": "numofdropout1_synth_8_aug1.png",
        "label": "numofdropout",
        "ocr_text": "Repubite af the Pullip DEPARTHENT OF EDUCATION Office of the Fiegistrar CERTIFICATION PO WHOM ET MAY CONCERN: PIS (STD CERTIFY that per record extant in thls aifive, the wndensigaeed eeetge ew tities the Tonewing: Nice raise without PM organization from Democrat some defense hour hit eye behavior current act best"
    },
    {
        "image": "numofdropout1_synth_8_aug2.png",
        "label": "numofdropout",
        "ocr_text": "Regiow 16 Division of Laguna Batangas Clly olfice of the Registrar ae Repabiic ofthe Palipoines ae DEPARTMENT OF EDUCATION oO e ‘| £0 CERTIFICATION po WHOM iT MAY CONCERN: {11405 STO CERTIFY that ver recor esas tuthi office Be ancerdygnedioerety carson the ievowing: emocrat Nice raise without PM organization from Di efense hour hit eye behavior current act best. ~ —- some di antzation matier 300d peak usa S1O D personal reaitze toot last, Paton not org ome Antanio Watson Physiotharepst"
    },
    {
        "image": "numofdropout1_synth_8_aug3.png",
        "label": "numofdropout",
        "ocr_text": "See Republic of the Philippines a =i DEPARTMENT OF EDUCATION Region 16 Dep Division of Laguna onpnerar H or rpucamoN Batangas City Office of the Registrar CERTIFICATION TO WHOM IT MAY CONCERN: ‘THIS ISTO CERTIFY that per record extant in this office, the undersignedhereby certifies the following: Nice raise without PM organization from Democrat some defense hour hit eye behavior current act best. Total number of school dropouts reintegrated in formal school 202 ‘otal number of school dropouts aged 5 17 years old 261 Percentage of school dropouts re enrolled 23% ‘Speak usually strong. Personal realize foot last. Position hot organization matter among public. Antonio Watson Physiotherapist"
    },
    {
        "image": "numofdropout1_synth_8_aug4.png",
        "label": "numofdropout",
        "ocr_text": "fe ac: «epeD e Gy, Division of Lacuna pepamTant Bor PHUCATION Nae? Batangas City Office of the Registrar CERTIFICATION ‘TO WHOM IT MAY CONCERN: stwis 15 TO CERTIFY thatper recerd stant inthis offic, the undersignedherstycorses te following: Nice raise without PM organization from Democrat some defense hour hit eye behavior current act best. Antonio Watson Physiotherapist"
    },
    {
        "image": "numofdropout1_synth_8_aug5.png",
        "label": "numofdropout",
        "ocr_text": "Republic ef the Pailtppines DEPARTMENT OF EDUCATION Reson 16 DepEd Division of Laguna Batanges Cily Office of the Registrar CERTIFICATION TO WHOM IT MAY CONCERN: ‘THIS 1S TO CERTIFY that per record extant in tois office, the unchrsignectherely certisies the following: Nice raise without PM organization from Democrat some defense hour hit eye behavior current act best. [Teta ouanber Sa af eka al drepannidsteg med] Antonio Watsen Physiotherapist"
    },
    {
        "image": "numofdropout1_synth_9_aug1.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines DERAETMENT or EDUEATION D en ED Division of Manila wert Zamboanga City Office of the Registrar CERTIFICATION TO WHOM IT MAY CONCERN: ‘THIS ISTO CERTIFY that per record extant in this office, the undersignedhereby certifies the following: Growth list network hit age artist just already more know word both nothing responsibility much the. Total number of school dropouts reintegrated inet 427 Total number of school dropouts aged 5 17 ears old 68 Percentage of school dropouts re enrolled 65% Good gun social investment. Raise including despite image individual. Happy until common painting treat article. Still deep goal say. Similar group good happen since language. Early score whole notice off. Coach century leg suddenly conference instead last speech. Push lay pass decade change. Inside couple set point. Agency everybody but agreement although structure mouth land. Standard project life local. Jackie Irwin fenagemene ss"
    },
    {
        "image": "numofdropout1_synth_9_aug2.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines a DEPARTMENT OF EDUCATION trong DepED Division of ntaniia ener Hor rpceanion Zamboanga City Office of the Registrar CERTIFICATION TO WHOM IT MAY CONCERN: THIS ISTO CERTIFY that, errecord extant in this office, the undersignedhereby certifies the following: Growth list network hit age artist just already more know word both nothing respons: ility much the. ‘Total number of school dropouts reintegrated in formal school 427 Total number of school dropouts aged 5 17 years old 68 Percentage of school dropouts re enrolled 65% Good gun social investment. Raise including despite image individual Happy until common Painting treat article. Stil deep goal say. Similar group good happen since language. Early Score whole notice off. Coach century leg suddenly conference instead last speech. Push lay ass decade change. Inside couple set point. Agency everybody but agreement although Structure mouth land. Standard project life local Jackie Irwin “Accountant. chartered menagenent"
    },
    {
        "image": "numofdropout1_synth_9_aug3.png",
        "label": "numofdropout",
        "ocr_text": "Beputic ofthe tiatippines DEPARTMENT OF EDUCATION Region Division of wearin Office of i CERTIE ICATION Tow ‘SOM IP MAY comers, FO CERTIFY tha? por rer Neen ka this Office. the under senerth eralay vertitiey the Growth fist network k word both Mit age artist just already more responsibil Much the a aledial i 427) ‘sehiveF Wopiais watt Cpe e ener: 2 ‘Good gun soc: at in painting treat ve Whole Pass deca NS Respite image inalviauat. Naps Y Sitnist soup good mappen since tay 9 Suaclen y conference instead taut spo every vbcey but agreement a ust camenon, PEE Goat sa ge. Early Ech, Push tay though Jackie trgin"
    },
    {
        "image": "numofdropout1_synth_9_aug4.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines DEPARTMENT OF EDUCATION Py mem 8 DepED Division of Manila peraaranr H or sDvcenON Zamboanga City Office of the Registrar CERTIFICATION TO WHOM IT MAY CONCERN: ‘THIS ISTO CERTIFY that per record extant in this office, the undersignedhereby certifies the following: Growth list network hit age artist just already more know word both nothing responsibility much the. Total number of school dropouts reintegrated in formal school 427 Total number of school dropouts aged 5 17 years old 68 ‘Percentage of school dropouts re enrolled 65% Good gun social investment. Raise including despite image individual. Happy until common painting treat article. Still deep goal say. Similar group good happen since language. Early score whole notice off. Coach century leg suddenly conference instead last speech. Push lay pass decade change. Inside couple set point. Agency everybody but agreement although structure mouth land. Standard project life local. Jackie Irwin"
    },
    {
        "image": "numofdropout1_synth_9_aug5.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines MI ICA’ r) 'TMENT OF EDUCATION pean Region 8 De pED Division of Manila HEPES, Zamboanga City Office of the Registrar CERTIFICATION TO WHOM IT MAY CONCERN: THIS ISTO CERTIFY that per record extant in this office, the undersignedhereby certifies the following: Growth list network hit age artist just already more know word both nothing responsibility much the. Total number of school dropouts reintegrated in formal school 427 Total number of school dropouts aged 5 17 years old 68 Percentage of school dropouts re enrolled 65% Good gun social investment. Raise including despite image individual Happy until common painting treat article Still deep goal say Similar group good happen since language. Early score whole notice off Coach century leg suddenly conference instead last speech. Push lay pass decade change Inside couple set point. Agency everybody but agreement although structure mouth land. Standard project life local Jackie Irwin"
    },
    {
        "image": "numofdropout2_synth_11_aug1.png",
        "label": "numofdropout",
        "ocr_text": "COMPARATIVE REPORT ON DROPOUT RATE 1978 2016 —— ap a _ j ; SUMBER OF oRGFoUT | i (scan ENROLMENT paceo BATE i year 7 atal Mule Femaie Total — PHLS 2019 54 is +59 ae See i | twas 299) 147 369 5 21 (26 7 0% da fotigh seek"
    },
    {
        "image": "numofdropout2_synth_11_aug2.png",
        "label": "numofdropout",
        "ocr_text": "® SCHOOLS DIVISION OF Zamboanga ‘Zamboanga City ‘Scott, Velazquez and White Campus COMPARATIVE REPORT ON DROPOUT RATE 1978 2010 DROPOUT RATE ENROLMENT NUMBER SCHOOL DROPOUTS YEAR oF Male Female Total Male Female Total aos29 54 5 |59 26| 2 28| 47 59 20192020 999| 147 369, 5 21 26| 7 0% ‘Atack out litte degree provide. Front anyone show college lawyer himself debate. Mr buh worry yes movie tough seek ‘Yourself alone my action debate. Cultural lay natonal husband bring outside newspaper,"
    },
    {
        "image": "numofdropout2_synth_11_aug3.png",
        "label": "numofdropout",
        "ocr_text": "COMPARATIAL REPORT ON DROPOUT RATE 1978 2070 SCHOOL 7 0% uth worry yes movie"
    },
    {
        "image": "numofdropout2_synth_11_aug4.png",
        "label": "numofdropout",
        "ocr_text": "Sy Republic of thie Philippines Department of Education REGION 10 SCHOOLS DIVISION OF Zamboanga Zamboanga City Scott, Velazquez and White Campus COMPARATIVE REPORT ON DROPOUT RATE 1978 2010 NUMBER OF DROPOUT SCHOOL ROUEN DROPOUTS RATE YEAR Male Female Total Male Female Total aore2019 54 |5 |59 26| 2 28| 47 5% 2019 2020 992) 147 369} 5 21 26 7 0% Attack out tle degree provide. Front anyone show college lawyer himself debate. Mr truth worry yes movie tough seek. Yourself alone my action debate. Cultural lay national husband bring outside newspaper."
    },
    {
        "image": "numofdropout2_synth_11_aug5.png",
        "label": "numofdropout",
        "ocr_text": ". B Republic of the Philippines Department of Education REGION 10 SCHOOLS DIVISION OF Zamboanga Zamboanga City Scott, Velazquez and White Campus COMPARATIVE REPORT ON DROPOUT RATE 1978 2010 NUMBER OF DROPOUT SCHOOL ENROLMENT DROPOUTS RATE YEAR Male Female Total Male Female Total nszo 54 i 59 26| 2 28| 47 5% 2019 2020 992) 147 3691 5 21 26! 7 0% ‘Attack out litte degree provide. Front anyone show college lawyer himself debate. Mr truth worry yes movie tough seek ‘Yourself alone my action debate. Cultural lay natonal husband bring outside newspaper"
    },
    {
        "image": "numofdropout2_synth_12_aug1.png",
        "label": "numofdropout",
        "ocr_text": "Lee Ny Republic of thie Pulppines Department of Education REGION 15 SCHOOLS DIVISION OF Cebu Cebu City ‘Smith, Moore and Webb Branch COMPARATIVE REPORT ON DROPOUT RATE 1972 1998 ENROLMENT NUMBER OF DROPOUT SCHOOL DROPOUTS RATE YEAR _| Mate Female Total Male Female Total vowraois 282/ 294 576 125 87 212 36 8% 70192020 176/ 295 471/ 8 110| 118 25 1% Traditional race direction production test drive home article. Wear part foot value skill hope part. Quickly keep land including value. Local security suggest name. Now consider bill speech free leader particularly. Left home house success during, Specific situation international leg, Final speech heavy camera particularly stand often,"
    },
    {
        "image": "numofdropout2_synth_12_aug2.png",
        "label": "numofdropout",
        "ocr_text": "fend Branch scemee SiN EMAAR AS SEES ITEIAA COMPARATIVE REPORT ON DROPOUT RATE 1972 1998 wie 2018 2929 mwa 47 76| 295 471| 8 el i '"
    },
    {
        "image": "numofdropout2_synth_12_aug3.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Plippines Department of Education REGION 15 SCHOOLS DIVISION OF Cebu Cebu Ci lore and Webb Branch Smith, Mi COMPARATIVE REPORT ON DROPOUT RATE 4972 1998 NUMBER oF DROPOUT SCHOOL ENROLMENT DROPOUTS RATE YEAR Male Female Total wate | Female Total 2018 2019 982\\ 294 |576| 128 87 214 96 854 36 8% roiwa0x0 176 295 471] 8 110 119, 25 1 25 1% era particularly stand often. se attic. Wear pal sider bill spe sch heavy cam ction test drive ho! Luggest name. Now con ‘Traditional race direction produ wn intemational leg. Final Spee! including value. Local security s success during. Specific situation"
    },
    {
        "image": "numofdropout2_synth_12_aug4.png",
        "label": "numofdropout",
        "ocr_text": "> of iBe Phalipyines Departuent of Education OF Caby ‘Cebu City ‘Smith, Moore ane Webb Branch COMPARATIVE REPORT ON DROPOUT RATE 1972 1998 TO VNeoutcnr. NUM EROF DROPOUT | DROPOUT SCHOOL es MENT SROPOUTE Rare YEAR H | Atate Femaie Total Mete Femot Totat poe pp | mutans 282) 204 578) 125 87 214 36 8% } weet de rane 476; ae |110/ 418 25 1% te a ne Traaitenal race direction praciuction ws! drive home artcie, Waar part foot inciuding value. Loca? secunty suugest name, Now consice? Fi speech thes leader paricuiany. Leftnome house ssucoass during, Specific sitzalion internatona fey Final speech heavy camera partcuialy tana cen, —___L Le"
    },
    {
        "image": "numofdropout2_synth_12_aug5.png",
        "label": "numofdropout",
        "ocr_text": "ob Branch COMPARATIVE REPORT CN DROPOUT RATE 4972 1995 “WUNBER OF PROPOUTS SCHOOL YEAR Total 1 | votat Miate Female | - np i j i S76 424 87 212"
    },
    {
        "image": "numofdropout2_synth_13_aug1.png",
        "label": "numofdropout",
        "ocr_text": "Republic of the Philippines Department of Education REGION 9 ‘SCHOOLS DIVISION OF Cabu Lapu Lapu City Johnson, Wiliams and Myers Institute eee eo”! COMPARATIVE REPORT ON DROPOUT RATE 1975 2005 NUMBER OF DROPOUT SCHOOL ENROLMENT DROPOUTS RATE Male Female Total Male Female Total porezors 159 52 |211) 135 10 145 68 7% zors 2020 94 214 238) 21 123 144| 60 5% Risk expert well, Stock positive house best sponsibility. Plant hair public list morning. ‘Opportunity toward Woman then song admit. Key section civil see ingicate simple husband. religious. Statement world crime might milion nothing re bank plant research pretty role."
    },
    {
        "image": "numofdropout2_synth_13_aug2.png",
        "label": "numofdropout",
        "ocr_text": "(pm we “a Republic of thie Philippines Department of Education REGION 9 SCHOOLS DIVISION OF Cabu Lapu Lapu City Johnson, Willams and Myers Insttute COMPARATIVE REPORT ON DROPOUT RATE 1975 2005 ENROLMENT NUMBER OF DRorour YEAR Male Female Total Male Female Total 2ors 2019 159| 52 211) 135 10 145 68 7% —T 2019 2020 24 214 238 21 129| 4 60 5% ‘Woman then song admit. Key section civil see indicate simple husband. Risk expert well. Stock positive house best religious. Statement world crime might milion nothing responsibilty. Plant hair public lst moming. Opportunity toward bank plant research pretty role."
    },
    {
        "image": "numofdropout2_synth_13_aug3.png",
        "label": "numofdropout",
        "ocr_text": "B: Neer Republic of the Philippines Department of Education REGION 9 SCHOOLS DIVISION OF Cebu Lapu Lapu City Johnson, Williams and Myers Insitute COMPARATIVE REPORT ON DROPOUT RATE 1975 2005 ENROLMENT NUMBER OF DROPOUT SCHOOL DROPOUTS RATE YEAR Male Female Total Male Female Total 2o1s2019 159 52 |211| 135 10 145 68 7% 2019 2020 D4 214 238) 21 123] 144] 60 5% Woman then song admit. Key section civil see indicate simple husband. Risk expert well. Stock positive house best ‘religious. Statement world crime might million nothing responsibilty. Plant hair public list morning. Opportunity toward bank plant research pretty role."
    },
    {
        "image": "numofdropout2_synth_13_aug4.png",
        "label": "numofdropout",
        "ocr_text": "COMPARATIVE REPo, 1975 2005 ENROLMENY Shoo, I RY OM DROPOUT Rare"
    },
    {
        "image": "numofdropout2_synth_13_aug5.png",
        "label": "numofdropout",
        "ocr_text": "ww peptic SBE Palipinet Department of ‘Education REGION 9 SCHOOLS DIVISION OF Cabu Lapu-"
    },
    {
        "image": "numofdropout2_synth_14_aug1.png",
        "label": "numofdropout",
        "ocr_text": "<a Republic of tie Philippines Department of Education REGION 8 SCHOOLS DIVISION OF Cabu Lapu Lapu City Ramirez and Sons Campus OUT RATE COMPARATIVE REPORT ON DROP: 1983 1984 ‘NUMBER OF ENROLMENT DROPOUTS DROPOUT RATE SCHOOL YE ‘AR Male Female Total Male Female Total 471 51 9% ane20r 102\\ 239 341, 86| 91 aors 2020 431| 34 165) 92 7 \\99 60 0% ‘yee performance vote six card name court red. Set! ‘major support minute pill local figure can south ‘enter floor low true another. Exactly view. Continue Dark large ent crime result cup check and young inte clear. Stud"
    },
    {
        "image": "numofdropout2_synth_14_aug2.png",
        "label": "numofdropout",
        "ocr_text": "COMPARATIVE REPORT On DROPOUT RATE 983 1984 NUNIEER OF BROFOUTS"
    },
    {
        "image": "numofdropout2_synth_14_aug3.png",
        "label": "numofdropout",
        "ocr_text": "COMPARATIVE REPORT ON DROPOUT RATE 1983 1984 [NUMBER OF NROLMENT DROPOUTS —_ ae an a in i i i [7 (99) 60 0% ]"
    },
    {
        "image": "numofdropout2_synth_14_aug4.png",
        "label": "numofdropout",
        "ocr_text": "ROPOUT RATE COMPARATIVE REPORT ON D 4983 1984 Large onta: foot tow tue aroties EXACT intecwiewe cnech and YOUNG tear Studer come result UP"
    },
    {
        "image": "numofdropout2_synth_14_aug5.png",
        "label": "numofdropout",
        "ocr_text": "COMPARATIVE REPORT GN DROPOUT RATS 1983 1984 ENAGLMENT i seook 1 YEAR 1 2 i saig Femate Total Here | aeieans 102, 230 341, 96, 91 177 54"
    },
    {
        "image": "numofdropout2_synth_15_aug1.png",
        "label": "numofdropout",
        "ocr_text": "Tv RATE COMPARATIVE REPORT ON DROFOU 1984 2076 ENROLMENT SEHOOL year a 2018 2038"
    },
    {
        "image": "numofdropout2_synth_15_aug2.png",
        "label": "numofdropout",
        "ocr_text": "NUMBER OF OT BRoP OUT ScHoay, B RAYE venr i 2018 2019 i f28 Yo H i 2038 2020 293] 56 4%)"
    },
    {
        "image": "numofdropout2_synth_15_aug3.png",
        "label": "numofdropout",
        "ocr_text": "See Republic of the Philippines Department of Education REGION 6 SCHOOLS DIVISION OF Zamboanga ‘Zamboanga City Wood, Torres and Coleman Branch COMPARATIVE REPORT ON DROPOUT RATE 1984 2018 NUMBER OF DROPOUT SCHOOL ERROEMEN DROPOUTS RATE YEAR Male Female Total Male Female Total nrs2e 6 120 126) 5 88 93| 73 8% o12020 993) 187 410] 211] 19 230, 56 1% Happy here nation camera guess table air. Ofer wonder address investment everything Hundred tree boy sign. Degree behavior soldier plant pattern whether collection."
    },
    {
        "image": "numofdropout2_synth_15_aug4.png",
        "label": "numofdropout",
        "ocr_text": "Wood, To nee ee COMPARATIVE REPORT og 1884 2048 N OROPOUT RATE oRGPGUT H MROLMERET i Seta oe L ba fa | PRSre i YEAR : 420) 126, 9088 tale lant pateen wi bahavier sotgie:"
    },
    {
        "image": "numofdropout2_synth_15_aug5.png",
        "label": "numofdropout",
        "ocr_text": "Ch Nw? Republic of tfie Philippines Department of Education REGION 6 SCHOOLS DIVISION OF Zamboanga Zamboanga City Wood, Torres and Coleman Branch COMPARATIVE REPORT ON DROPOUT RATE 1984 2018 ENROLMENT NUMBERIOE DROPOUT SCHOOL DROPOUTS RATE YEAR Male Female Total Male Female Total 2ois 2019 6 =| 120 126) 5 88 93) 73 8% 2019 2020 993) 187 410] 211 19 230| 56 1% Happy there nation camera guess table air. Offer wonder address investment everything. Hundred tree boy sign. Degree behavior soldier plant pattern whether collection,"
    },
    {
        "image": "numofdropout2_synth_16_aug1.png",
        "label": "numofdropout",
        "ocr_text": "‘arker institiae Somerset itnrenssnney, COMPARAT YE REPORT oy 1972 1997 DROPOUT Rare tors2na 422 (53 178) 109) a7 456 89 1% i"
    },
    {
        "image": "numofdropout2_synth_16_aug2.png",
        "label": "numofdropout",
        "ocr_text": "1972 4 994 GE ITS. Mate Famaia ai: ROE i i 22) al 34 394 “f H 2019 2029 4 }"
    },
    {
        "image": "numofdropout2_synth_16_aug3.png",
        "label": "numofdropout",
        "ocr_text": "ducation Department of CHOOLS DIVISION OF Laguna Sta. Rosa Horton, Wright and Parker Institute COMPARATIVE REPORT ON DROPOUT RATE 1972 1991 ENROLMENT NUMBER OF DROPOUT SCHOOL DROPOUTS RATE YEAR f Male Female Total Male Female Total yis2019 85 250 335, 71) 44 119 34 3% 2019 2020 422| 53 175, 109) 47 156 89 1% _ a 1 _ outside which others shoulder color character. Owner practce Nome performance plant un Entre it paper stock television yet Rule worker of step."
    },
    {
        "image": "numofdropout2_synth_16_aug4.png",
        "label": "numofdropout",
        "ocr_text": "7 Ad Republic of tfie Philippines Department of Education REGION 6 ‘SCHOOLS DIVISION OF Lacuna Rosa Horton, Wright and Parker Institue COMPARATIVE REPORT ON DROPOUT RATE 4972 1991 NUMBER OF DROPOUT ENROLMENT DROPOUTS RATE male Total 44 119 34 3% SCHOOL Yel at Male Female Total Male Fe g5 250 335) 71 2018 2019 475| 109| 47 456, 89 1% !) mance plant run. Entire itpaper stock 422| 53 aracter. Owner practice nome Perfor 2019 2020 outside which others shoulder color ch television yet. Rule worker of teP"
    },
    {
        "image": "numofdropout2_synth_16_aug5.png",
        "label": "numofdropout",
        "ocr_text": "COMPARATIVE REPORT GH pROPOUE RATE 4972 19) SCHOOL i"
    },
    {
        "image": "numofdropout2_synth_17_aug1.png",
        "label": "numofdropout",
        "ocr_text": "® Repob: oP Ps eraser Departmes SCHOOLS DV; Zandomzs Zamboanga City Tomas, Eilis and Hamerdez Branch COMPARATIVE REPORT 2015 2016 sage: swoon [waar pao) —_—— Rae re [Faas Troma yen Toa te [Female Tout } pam hamminent ee j 2018 2019 238] 33 271) 19) 1 aad. 84. 5% [mee oo 12 Tapele ‘|10) 12 8% ‘ON DROPOUT RATE"
    },
    {
        "image": "numofdropout2_synth_17_aug2.png",
        "label": "numofdropout",
        "ocr_text": "fifie Philippines f Education 1ON 3 SCHOOLS DIVISION OF Zamboanga Zamboanga City Tomes, Ellis and Hernandez Branch COMPARATIVE REPORT ON DROPOUT RATE 2015 2016 NUMBER OF ENROLMENT DROPOUTS Total RATE Female Total ale Female Male 2018 2019 238| 33 271| 198 “co | xelet drive. Sing under firm left characte atch story Score magazine national au Impact system up o} bar. Easy enough hunared decade somelning there model ‘school, Check deep fund w monty"
    },
    {
        "image": "numofdropout2_synth_17_aug3.png",
        "label": "numofdropout",
        "ocr_text": "2015 2016 SCHEOL vEAR DROPOUT | 2028 2019 258 33 lar ‘el 31 229 84: 5% L 229 2219 2020 66112 78) 10 0 110) 12 8% L i i :"
    },
    {
        "image": "numofdropout2_synth_17_aug4.png",
        "label": "numofdropout",
        "ocr_text": "i Bw eee’, Republic of thie Phulippines Department of Education REGION 3 SCHOOLS DIVISION OF Zamboanga ‘Zamboanga City Torres, Ellis and Hemandez Branch COMPARATIVE REPORT ON DROPOUT RATE 2015 2016 ENROLMENT NUMBER OF DROPOUT SCHOOL DROPOUTS RATE YEAR Male Female Total Male Female Total rosans 238 33 |271) 199 31 229 84 5% 2019 2020 6G 12 78 10 0 10 12 8% Impact system up ok let drive. Sing under firm left character bar. Easy enough hundred decade something there mode! ‘school. Check deep fund watch story. Score magazine national authority,"
    },
    {
        "image": "numofdropout2_synth_17_aug5.png",
        "label": "numofdropout",
        "ocr_text": "‘ew eB Republic STiRE Phippines Department of Education REGION 3 SCHOOLS DIVISION OF Zamboanga Zi City Torres, Ellis and Hemandez Branch oc COMPARATIVE REPORT ON DROPOUT RATE 2015 2016 impact system up ok let rive. Sing under frm lef character bar ‘School. Check deep fund wat Easy enough hundred decade something there model ich story. Score magazine national authority."
    },
    {
        "image": "numofdropout2_synth_18_aug1.png",
        "label": "numofdropout",
        "ocr_text": "Department of Education REGION 6 SCHOOLS DIVISION OF Batangas Lipa City Gonzalez, Sanchez and Gonzales Branch COMPARATIVE REPORT ON DROPOUT RATE 1978 1994 ENROLMENT NUMBER (OF DROPOUT SCHOOL DROPOUTS RATE YEAR Male Female Total Male Female Total zors 2019 281/ 291 572) 233 231] 464 81 1% pois 20200 7 12 19} 4 |7 11 57 9% Strategy social professional thus. None subject drug hard address. Address rather nothing control laugh and. According line customer avoid. Break down win institution important spring"
    },
    {
        "image": "numofdropout2_synth_18_aug2.png",
        "label": "numofdropout",
        "ocr_text": "eS, Republic of fe Philippines Department of Education 6 REGION SCHOOLS DIVISION OF Lipa City ‘onzalez, Sanchez and Gonzales Branch COMPARATIVE REPO! 1978 1994 NUMBER OF SCHOOL Ee Gag _ __bropouts YEAR Male Female Total wi 281) 291 572) 233 234 464 81 1% 2019 2020 7 12 Batangas IRT ON DROPOUT RATE DROPOUT RATE Male Female| Total 2018 2019 19 4 |7 11 57 9% ‘Strategy social Professional thus. No lone subject drug hard address. Address rather ‘nothing control laugh and. ‘According line customer avoid. Break down win institution important spring, ="
    },
    {
        "image": "numofdropout2_synth_18_aug3.png",
        "label": "numofdropout",
        "ocr_text": "COMPAR ATIYE REPORT an py ROP GUT RATE 1978. 496 SCHOOL J YEAR i"
    },
    {
        "image": "numofdropout2_synth_18_aug4.png",
        "label": "numofdropout",
        "ocr_text": "a Republic of thie Philippines Department of Education REGION 6 SCHOOLS DIVISION OF Batangas Lipa City Gonzalez, Sanchez and Gonzales Branch COMPARATIVE REPORT ON DROPOUT RATE 1978 1994 NUMBER OF DROPOUT SCHOOL EREOUMENT, DROPOUTS RATE YEAR Male Female Total Male Female Total zors 2019 281/ 291 572) 233 231] 464 81 1% pois 20200 7 12 19} 4 |7 11 57 9% Strategy social professional thus. None subject drug hard address. Address rather nothing control laugh and. According line customer avoid. Break down win institution important spring"
    },
    {
        "image": "numofdropout2_synth_18_aug5.png",
        "label": "numofdropout",
        "ocr_text": "COMPARATIVE REPORT ON DROPOUT RATE 1978 1994 co NUMBER OF SCHOGE BROPOUTS “F i YEAR i Mate Femste Tota! (464 814 281 204 572, 233 234) fen 2028 20 9 | zole2029 |"
    },
    {
        "image": "numofdropout2_synth_19_aug1.png",
        "label": "numofdropout",
        "ocr_text": "SOMPARATIVE REPORT an SROPOUT RATE “NUMBER OF DROPOUTS SeNGOL i YEaR pp | tare 434) 145 |2 79) sf 133) 227 81 AN re ae 4 4. [| 2019 2029 48 73 5%"
    },
    {
        "image": "numofdropout2_synth_19_aug2.png",
        "label": "numofdropout",
        "ocr_text": "Jenkins Estrada Campus: nent NN A COMPARATIVE REPORT ON DROPOUT RATE 2015 2017 PT ewmouaent Twain OF ST pRaRGUT — |__RATE rr _ s ota —Tratwar tree To 20re zor9 otal 145 279) 94 133) 227 81 4% [ome 57208) 30 96 192) ‘20, 73 5% image discuss indusiry dsvelop. Reiakonatas fre ropion bebeve Rr WouaG nom ine color catch aremat. Crow impact shin watch seem."
    },
    {
        "image": "numofdropout2_synth_19_aug3.png",
        "label": "numofdropout",
        "ocr_text": ">< Republic of te Philippines partment of Education REGION 16 SCHOOLS Division oF Batangas Lipa City Jenkins Estrada Campus REPORT ON DROPouT RATE 2015 2 Scoo ENROLMENT Peet ae Mee. Male Female Total Male Female Total rers2019 434! 445 279! 94| 133 22 51 4% T 2019 2020 497, 205 392 96 192| 28, 73 5% Image discuss ‘ind shinwatc seen lusty develop. Relationship fre “eg on believe frst. Would him use color catch animal. Grow impact"
    },
    {
        "image": "numofdropout2_synth_19_aug4.png",
        "label": "numofdropout",
        "ocr_text": "COMPARATIVE REPORT ON DROPOUT RATE 2015 2017 ia ENROLMENT 1 NUMBER OF scear, YEAR a 494 (205 392 E 192| 288 1 735% |"
    },
    {
        "image": "numofdropout2_synth_19_aug5.png",
        "label": "numofdropout",
        "ocr_text": "COMPARATIVE ero 2015 261 RT ON DROPOUT RaTE a StHOOE DRORGUy 7 “NURBER OF"
    },
    {
        "image": "numofdropout2_synth_20_aug1.png",
        "label": "numofdropout",
        "ocr_text": "COMPARATIVE REPORT ON DROFOUT RATE 1999 2008 EUROLMENT paopour ware poe i To serect YEAR 2018 2025 4 4A% i 4 —_— i 2928 2020 165) rt 1118 49 4% femiy notartice. Mother ait weluding"
    },
    {
        "image": "numofdropout2_synth_20_aug2.png",
        "label": "numofdropout",
        "ocr_text": "Republic Department of Education 2 SCHOOLS D te Cortez LLC Branch COMPARATIVE REPORT ON DROPOUT RATE 4999 2008 NUMBER OF DROPOUT SCHOOL ENROLMENT DROPOUTS RATE ‘| Total yi FAR Male Female Total Male Fema 279 5 \\284 37\\ 4 a1\\ 14 4% 2018 2019 2019 2020 465| 74 239 412| 6 118, 49 4% siscuss sufer process. Western back forel0h oor Potties new family notartcie, Mother al incuding tty Ever source suggest smile Republican ‘maintain Something building pret"
    },
    {
        "image": "numofdropout2_synth_20_aug3.png",
        "label": "numofdropout",
        "ocr_text": "COMPARATIVE REPORT ON DROPOUT RATE 1999 200 i i Male Pemaia Total Male |Femaie Total ' sree 165) 74 239 11216 118 49 4% i | \\"
    },
    {
        "image": "numofdropout2_synth_20_aug4.png",
        "label": "numofdropout",
        "ocr_text": "fife Philippines Department of Education REGION 13 LS D F Batangas Batangas City Cortez LLC Branch NUMBER OF DROPOUT DRoPouTS RATE"
    },
    {
        "image": "numofdropout2_synth_20_aug5.png",
        "label": "numofdropout",
        "ocr_text": "Zi Republic of thie Philippines Department of Education Cortez LLC Branch JARATIVE REPORT ON DROPOUT RATE COMP: 4999 2008 NUMBER OF DROPOUT SCHOOL ENROLMENT | ___ DROPOUTS RATE YEAR Male Female Total Male Female Total ~—T +— 2018 2019 279| 5 284 37| 4 41 14 4% t yois 2000 165] 74 239| 112| 6 118 49 4% someting asscuss suffer process. Western ack foreign toor Poltcs new tamily not article Mother all including puting prety Ever source suggest smile Repubican maintain"
    }
]