[
    {
        "image": "observation1_synth_10_aug1.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBS! RV ATION ECR! Instructors Aonsmien teanines ronkiDokege: Cosege af Edsenteie ‘Course number and gestion: gue a1 Obaeraar: inde s DepartmentiProgram Comput Seence Desaitment Course Format: Jerse, ZEMIN, @LC) Faoe se tone ieee DateTime Siosursation: October +7 2028 ai Location: Compute: Lab 2 17 Bukting Apmosinate number of students in cass: 92 Fre leaner touted on oti torented progemmning connects, gpectioaly Wher tance: 1nd polvinorstiom in das, The metructor used core evampias and ive ‘derronetrotions to iastrais key romemles, Shuey partcinaied hands on coseg ext orci using hee inc, | pmotnateppionton szaee weponaad etectoyte aden estore sstam toraeon deter Lesson wos wetarzcnaed wat ingen! Bow and eopropriate pacing [nme omemened arate wet | Sroughast i session i pxoncessin seassna apaoer i i asuestinent outtadsatgned 18 nit stot tenia |obincives ar satonns"
    },
    {
        "image": "observation1_synth_10_aug2.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Schou Carege se Daparivant 88 number zpuc43 yal, (Lecture, seminar, ie} teeta GaterTine of observation Genser 17, 202% ar 68 12 488 Aparoem fof students i cies sits specie inhertavce an os used rove examples ang ive ssangtranns t dents parteated hands on cody exec f Eaton ewe Seaton os i Organization and Preparation i Coune obfestives st lesson gowis were sary sated and aigned ith vet cr nctuess theontes somcents snd tnetsisir Gamansinvas fsponisel abet nyt taser arugh browladge of beet matte and Poveied snus axomples Bifctive vse of wonmoegy ana seam pnesifor ass rns opprmech we, coment, al rines sod outennes =e emcee paces mn ecpece en se panpa penne emma map a spam eppaypptpenegueene aeppaeyemmnapne eaee pa ponuaeee"
    },
    {
        "image": "observation1_synth_10_aug3.png",
        "label": "observation",
        "ocr_text": "CLASSROOM O SESERVATION FORM Landa Unger bauer fepteseton: senatnan kota SohcattCasiage: cobge ot Basutor SiepartmenwrPecayasn: Computer Beene Caren Gonna suns ad watleor: EOUCIOY Course Format: (Leckure, sin Pacetn ace a8 1 Buta atofTimme of ckmrvation: Ounba 17, 2038 ot 8 12 AH, Location: Computer Le Z stor of nari we ane: 3 _Appereniersate 4 eszrnginn are ve pte, epncicalty Rnsbece oe pssymareasn@ Jara THe ination used 0a: cai tak aston. ig vartepaters cs paness on coking exeTcieeS sxe ca eiec ottartet Ba vp va Bantrobe hay prioeples, Seater Fhe taxon semeanairnine sar earasann treevaton! cote 6 Venus sa 1 i ceapondest attoctnnly tm mudent suHetors eo ences dotaseey. =a eraser 8 Sinine coco eons gots ence wary mnie an seed ooh soning wenger [irswcane te “gan was orgeniced na ingens tow nd apanentne BACT t vat fe SVS [amare i gayasemmet emicees agrad ak ean seated 8 secon i 1 caused t imatuctonat (Seiya i 4 ceaiarns rd unser wes TOES, LL"
    },
    {
        "image": "observation1_synth_10_aug4.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Observer: Linda Livngston Department Program: Computer Science Department Course Format: (Lecture, seminar, etc.) Face to tace lecture Location: ComputerLab 2, IT Buiding Instructor: Jonathan Martinez ‘SchoolCollege: Cotege of Edveaton Course number and section: EDUC 401 Date Time of observation: October 17, 2025 at 05 12 AM ‘Approximate number of students in class: 32 concepts, specticaly inhertance and polymorphism in Java. The instructor pated in hands on coding exercises using their laptops, sed code examples and ive “The lesson focused on object oriented programming demonstrations to lustrate key principles. Students part Veraty explained wel ‘Good balance between theoretical concepts and practeal appication exercses ‘Erecive use of technology and teaming management Instructor demonstiated thorough knowledge of subject matter and Provided lear examples responded effectively to student questions system forlesson delvery. Lesson was wetorganized wth logical flow and appropriate pacing ‘Good te management instructor demonstrated cutural senstivty and ‘throughout the session awareness teaching approach, tnstuctonal materials and resources were appropiate, cuent, and ‘Visual aids effective ‘Assessment methods algned wel wih stated leaming stfectvely utized ‘objectives and outcomes. Page 1 of S"
    },
    {
        "image": "observation1_synth_10_aug5.png",
        "label": "observation",
        "ocr_text": "CLASSROOM CBSERVATION FORM Instructor, Jonsinen ite Samostielleys: Corege of Sowae musnber and section: Duc 407 DatolFiowe of observastion; Cctsber 17, 2028 at 06 72 ANE Approvimate number cf students in clans: 92 ‘Yee teeacn cusai on abfect ortented poogramzring cancers, Urronetrations to esirale key pricipies, Siunts sertcinate m tands cn coe i Organization isin onatated Grarssgh enontesye uusponded aflestve y to sident questions Levon was was aryerized 82h fogicn! fe 2nd appecana pacing Observer: Lids Lvingaten DeparimentProgram: Senmuter sewave nurse For Lowation; Sern: sxercinen wang thei subi maine ont Provided ctw energies HLactura, seminar, we.) receinect Atelicity maartace ant pojmarphaam in Java. The watauctor wae co anians 2, Being sexanciss wet we Geod hatanee between sracreticet ooncapts and erecta erpsomtion axerisur 1 i | Stteaive wee of echnoiogy and teeming management systne feriescon deiner"
    },
    {
        "image": "observation1_synth_1_aug1.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Instructor: Amy Hunt Observer: Jessica Potard MO ‘SchoollCollege: Cotege of Science Departmen Program: Business Management Course number and section: psy 201 Course Format: (Lecture, seminar, etc.) Wortshop tomat Date Time of observation: October 14, 2025 at 08 08 AM. Location: Room 301, Engineering Bukding Approximate number of students in class: 20 Toran, Covered statistical hypothesis testhg using SPSS sofware, Students analyzed PPiippine census data and conducted tests and ANOVA procedures. The instructor provided step by step guidance through statistical analysis workfion Evaluation Item Organization and Preparation ‘Observation ‘Comments: Course objectives and lesson goals were cleary stated an. ‘curieulum standards Etective use of technology and leaming management system forlesson deivery Posted on side presentation Instuctor demonstrated thorough knowledge of subject matter and Erpertinowedge evident Effective use of technology and leaming management responded effectively to student questions, ‘system forlesson deliver. Lesson was welorganized with logical flow an ‘throughout the session Excellent stucture Assessment methods algned wel wth stad leaming ‘objectives and outcomes. Instructional materials and resources were af Relevant materals used effectively utized Student parteation was high: instuctor created Inclusive learning envionment, Page 1 of S"
    },
    {
        "image": "observation1_synth_1_aug2.png",
        "label": "observation",
        "ocr_text": "CLASSROOM aI toatrucar Ane Hot Observer: 2ansen Potent MO gxncixcotnge: coinan of See Departnend Pregran povnveen tage covuse runt ene waar. P= 2) course Format (Lacks, Seri ic.) Wemsven form ‘Davoren of evnvetion: oxen eat tose A Lacan: Rasen 01 txgecenra Ont students iy ase: F spun xn ans coriod 0 a ANOVA SEATS - t {amen pasegnony 200, tracer ust {puatice Wore"
    },
    {
        "image": "observation1_synth_1_aug3.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM instruct: ie Pot 1 wont Observer SchooliCo? cosege of Sense DepartineniProgran, Business Meuagerert Course number are suction Es fLeclure, ssirinar, els.) Wossner ‘mat Gio: Oetoter 14, 2028 at 98 0 AN Approminate number of ie clase: PSS sulimare, Students ana wortow ‘The vlans covered slaiete: 704 Phituping census tats anct concicied esis and ANOVA macedures The salructer provided 3 pothesis teeting wom Si ‘nsough slatictcal aa Oiganization and Preparatisn couse inetaietor dnovanehied! mareugh Snsaiedge of responded etizeloniy 10 lyst meaner ans fant questions anpessineni anatheds algines a8 9 cunrnver nna autoemms iaseon wos webcanieen wih wien Row and aparwanate eae i so team weougnaut ie seen sosent pacispatcn nas nig inset eaten | otusive asining envkoaenant |"
    },
    {
        "image": "observation1_synth_1_aug4.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM RIROT: Ary Hunt Obyerven tessies Potent SehawifColiage: Cogs of Sense Boparmers Program: Susiess Managemaat rourve Feamat: (Leciute, seminar 2G.) wexesnap fe Course number and section: PSY 20% om 20%, Enghaweng auiing ena AX Location: iors: Cctobas 48 2 Daie Tiene of obser Approximate number cf students in casi: 29 ‘Tre clase cavered statata hypoinosts teeing us syware. Suidenta sragezest Preis pene das 20 sopractor provides stent a has static arya VA PEM, \"eile eoiensn stand iagy ena lemming wanagenent eve. Experts 1 peinccias desmorstated thorough inowedge oF sxineat masters | fasponced ettectioly fe student quastins | system tories i i 4 t - oe [Lesson was wet orgavinid wih gua! inw end anproadste pacing eecasent suche eomagnout ti seston | i nasessment menos aignae wok wn stated ivomtit [opeuthaes ane culewroes sotto cunest an F insects: mites ond rssounes were 9pm gecivay tans i | 1 ~ La"
    },
    {
        "image": "observation1_synth_1_aug5.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM NOH ICLON. omy bent Opsarver serves Potent YO Schoai Conege: Cotege of Remes DepartimanyProgiamn: Saws teegeneet ‘Course number and section: Psy 201 ‘Course Format. (Lacks, seeninar, @t2.) Wanesroy emt OntasTine of observation: Over 14. 2020 at 38 08 Aa Location: een 207. Cognemne Susteg Approximate number of students in dass 20 ‘The class covered siatetca! mypomneris tealing vag SPSS cofware, Siutents maiyzed Phitouns Census dats ari conducted iene and ANOVA provertees. Tha naaructor peocioed aieo by timp guidance trrogh stabates anaes woktow, Ev altion tier TC ican ation, i Coune sbitetnns and lenton Boum wore aunt Stated arnt signed win Potted en wine pretentaton Sxrcte un of mensigy ard eamig macagerane H conectum siden, {eyeviews « atruceerg ane kone euragenent | costo anmensened mew twinge ot chit ar an Rover inoaeeten eo iSroent, ro rripandind eDaily bo sade swestons | veh e nee | - H Aenea miret nated aligned cal wth inten Orang Levon wan woborganizes wt lngesi Pow ana wopeonans peng Ercan peers | enemmiodanen a Pew a ee yh cumoter mated H renvcloal monte and weteunes wre sper. com and arent ate ved tote presen eine waning eveeonnet nec tins |"
    },
    {
        "image": "observation1_synth_2_aug1.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Instructor ene Observer Manas! Steonens SchoolCollege Department Program Utareing Manegeme~ Course number an Course Format (Lecture semunar, etc Laverton veton 2028 et) 00 AM Locaton 201 Ener! Date Time of obser Apprommate number of students in class 42 The esson nitroduced crcul anatysa technques ncudng KECHRCATS Ines and mesh anaiysa Students worked on cut probiems and used semaation softaare to vert) ter cacuatons deveoong practical Youbiesnocting sa Evaluation Rem Organization and Preparation"
    },
    {
        "image": "observation1_synth_2_aug2.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM ‘nStUSICE: Ene Wat Cdserver Minas! Suniens SshackiCokege: Cateye of Computer Stuoias BeparimentProgran: Marketog Manegenent Couisa number end sation: Bus se Course Fovmat: Sire, Seminar, ete) Lavsetery soezion DioiavTie of ckservation: Seotercser 22 2028 at Tan AM rations Rouse 30%, Engen ing Apprommate number of ctudents in class. 42 “Ye lexsin trowel ces varly tow cake uf analysis tecresgues inchading Krcliolfa laws anei mesh anysis, Staturts worked on cout probes snd whee simeteion ecttware 23 devenping proctess roubveshouing ota ' i i { ft ogical few 404 epemenate sang Enesont cinsuaom seenagement and mptod at [suai cused roustos jeurtons eaters and ezourean wae appropiate, GuTeAE ane stecn y eed Send enenc never ena eneps ar"
    },
    {
        "image": "observation1_synth_2_aug3.png",
        "label": "observation",
        "ocr_text": "SLASSROG OBSERVATION FORM eAUP green’ Merete Menage se Sorat: (Lecture, ser wurnbar and section: But 99. 2 of obsevation: Seatember 22, 2028 44 11 00 Ass bor of students in class: 42 ition, devers techninues neiuding Kechhot ska, t Eyaiaatlon kes eaten Seganication and Preparation t t i nouewe maming ee sey to Hastert quassane 1 Gonets enienons Bonsante udents coeerong sowagnsul i i 1 | insisetonai mutecot and en aoca be Leeson as wetoigaaizen arta logial Pow and appmorins oa! oa menagecent wad app we nrougneut the 285"
    },
    {
        "image": "observation1_synth_2_aug4.png",
        "label": "observation",
        "ocr_text": "Schwantes surse Mumba: and section Date Time af observation: Septuorta: 22, 2028 at 1 00 Axi Location: Ror Appro: Phe iessan ntreduc rout arise rerty ther calcidgines, dovetoging ytavtioal te se objectives sore standart Sotege of Goreputer CLASSROOM OBSER) te number of studonis in visse 1 Suton question tmughout the session mel wgteraa sed resousoes ed ATION FORM Beerver chee Stephan, Department Program: siihag Managarans Course Format: (Leclure, seeuar, ete.) Lahortory session 904, Engneesing Busing srocting 3 (utzon gosts ware Yeay stated aod ebgeina ah uo), kresnlaige of subiet verter and suns webemeniaus wh egial Raw and azeropnate pecs ng Kechroffs lve art mesh anaiye s, Students worked on o it probleme and wuer einwtstinn sottvare ty Comments | uderst staswar tha"
    },
    {
        "image": "observation1_synth_2_aug5.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION Coaserver, Mahoe S87 Bepart go Fornal (Lecture course 0 BUSS cou ea of absarvsnion, Senne B20 s Lecation Hear 307 F spies and esas semaines cowaee yosuced o8tN4, ye seescn veriy tne osteuist pearvaion ‘guguaea ven ion aigaion and Prepat (Sea a ve oycines ang 2509 9988 MT Exot no vod regget em ma vobergenzed WO OE suai nas attactee synnat? a"
    },
    {
        "image": "observation1_synth_3_aug1.png",
        "label": "observation",
        "ocr_text": "SSROOM OBSERVATION FORM Kayie Santen menYProgiam:: Computer sew at: (Lecture, cosine, f observation Septentey tay 2, iT Beng nber of studamns in cles: x crow ay 8, devsionry oven -eigues inohuing Kuenbols laws and enn anaiysis, Shatants worked on cicut problems end used eimustion sofware to al iraubseaheting 33, insinjotar demonsirted ‘horough snewedye of 58 resaonddes etfectin y 9 sucht quae cerson wee west sangha tie senior cd wih pica ow und appropriate pacing PNetpaced deveer Etec suna item ead) aes ose nysteni for gen deters"
    },
    {
        "image": "observation1_synth_3_aug2.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Westructor: sontan Lembo SchontCotege: Compe of Cometer Studion ‘Course number and section. aus 205 DatasTime of aosarvation: Sepienter 28. 2026 at 007 AM Approximate mamber of atucenis in aes: 26 a a SSIS eer meester pewter” [cor sereedone neers y besarte i ee a Herd aesteerentoon tr Premeriensernineary | teon mee metered wih opin! few an8 euemepraie paar Wes peers seiner Etectre woo of wetaciog? ans maming ewregeest | weougtout te sesnan i [mentor issen eam j to i inna tt nd ossont oe apm sows end Spe eam Porenorpelne Sg se stmaneis wamvee oan dan ; jst oreo —___ _} hots"
    },
    {
        "image": "observation1_synth_3_aug3.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Sehseikoatogh: Calnge ot Comewize Staley Cusene randver and sation’ BUS pate Tine wf obseamenbion: September a3, 2028 st us oa? at Anowosimetn mame af abucets i Cian: 2% “ha tegen emneuoes oi very mer cabot, Sv [ecuae eaucea anciesson ganit aase saesien stnducts | inecior same reapenid ast | betsen as raenrghowt he session treaatenas nt eteconsty sites Pangani iogeal a end sexeurces were mperEDNATe, So aoatois weenriques mousieny Neches eons rotens Rone ong BE mnarmogh anomiadga of sabioct mar eo senent questans prmupcate pacing ees, 908 eeny sine sev) alge wat Ousetver: Kays Sances DepartmentProgian: Compete: Seen coset: (Lechure, Seon, 8K} Oneanven ean Cesare Location: Computer txt 2 ‘aves ara snesh aries. pesied ga sate erwstabtis omageces worked en giimot promioms aon weed 2 1p Dupont irareeg jerlticn stare sanity anc H \"nomad domonrsted sur at [retntas im tnnciog everest T eecnnet censsone rramegenent and mppant ih osenrs opened tacuptout ‘cine wo cincicmay en maces eases sn ar Deven SEY. Song ee of autrnain cusouzors anianead vat ammersasiing of eres exces"
    },
    {
        "image": "observation1_synth_3_aug4.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Observer: vaya Ganges Course oumiber und sector, BUS 309 Course Format Lecture, g erin, et ‘eiTime Of observation Seuemee a0 07 ase oMON ConmuterLat 2 Fr Bukeng Anpromnate mumber of students in class 28 The esyon eroduced ‘SiGe arate toctmmues neading Ki venty tore cava Sevetesitg mr actwa! roubleanont POMS was ard mech anatisis Shatent 109 wes Word on Carat robles aNd us30 arcuate sof: I Evaisaiiaa iam 7 ebseaiatieR I Gryprization and Peepscation Goaraa cnc ans nssan gon wate courystawe ane aga wan Bescon ante peentune astute cemonsveiad cuter seca ane | evmsvem mana righ eon questions Levnn was wetcrpanes wth legen! Sse amd apo threughaut me sexton Hotes use of ecancingy end waning ra \"anal matevah and weseviors wie apomBeate, cunent, ane ie manatees sranced student untertanaing of cammier comseztt"
    },
    {
        "image": "observation1_synth_3_aug5.png",
        "label": "observation",
        "ocr_text": "CLASSROOM Instructor: Jordan Lambert OBSERVATION FORM Observer: Kayla Sanders DepartmeniProgram: Computer Sense Department seminar, etc.) Dacussion based ‘SchoolCollege: Cotege of Commuter studies Course number and section: BUS 305 ‘Course Format: (Lecture, Date Time of observation: September 23, 2025 at 08 07 AM Location: Computer ab 2, IT Building ‘Approximate number of students in cass: 2° re essen noducescrcut ans Weeiaues PSPs -echnft laws and mesh analysis sents worked on cout probis and used SIMUSteN software to very their calculations developing ‘practical troubleshooting skills. “Organization and Preparation —— ration fin —_ conan onecnasandinson goats wer ona sales a sgnea wen Ponndon sie prseraton iqstustor demonstrated cual sensi and Comm standards inatmeness n teaching aPProse subject matter and Provided ces examples Zyowtenidaswoom management and reppo8 4h SEients observed throughout Instructor demer responded effective strated thorough knowedge of my to stent questions Werpaced delvery pated content Entectve use of tecnnology System for lesson deWver ‘strong use of mutimedia 50% d waming management wyrces enhanced student hgesstanding of complex concepts"
    },
    {
        "image": "observation1_synth_4_aug1.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM ORSErvET Jesse Rises SchoovGotege: comes of Seance Bepartmenvere Course number and section, EDI Peveroe ty epatine nt Course Format Of ebservacen: Aboroninnates rs November 98 2028 ot 820 ey. ‘aber of stusaats in case We Seminar, ates Franson Lees FA =D OTed teaching mathe He Womenstrzted miso Fete cessia og MBA coteemes tases estoy hemewt Pre serive inaciers oracteed tesson CIES Li Coes With zee faery Utgenivation and Pesparaion Sere atjeotns andl secon eomcckm saa i Tsroheaton everines be. Date: Ger oneoalad Neu gh knees 9f subject mente wnat Arseeite 42 quastiony \"ePended sftctvy ty stidnnt gcovarre i a cUni e8vestes woaesea ane ricated peste eaming etrasonan marine | thestony aie Het pure Wes high Betusivelsomieg wrmoneggee 2 Lohs"
    },
    {
        "image": "observation1_synth_4_aug2.png",
        "label": "observation",
        "ocr_text": "CLASSROOM GRSERVATION FORM Hrmtructor: Iesaica Cater SchmaviCutiege: comge of sence Cures quniber and section: eck Obsswver: dosse Ronse apartment Progecar: Peyssicgy Degas \"as Cours Foimat: (Lectute, sorninar. a2.) onovseon neses Chate Fene of observation: sevemper sh, 2008 ot 15 49 Pas \"ANICO: Casennnon Baers Cofene Oise Agpioniiats cumber of shaders tr ciaes 33 ‘This sesso eepiorad teaching metimdoinyate tor Zebweroens, emphasiang macomes tised ehcaton hac 3 Hronewars, Pra narvice teaciuery prectced ieveon soratates miere tearhiag epeint vot sem edn Sovuise obyetver ane Manan gaslenere Sony stated and ged win Pusan sade pmunennion | eereaacn statasdy ‘Sood oaieren Saleen tacratca coneeits ah t Pevesce spp exerayes i H ro nd owinatns pote | Insevetor dematnonind kommugh hod cr ersen gnats do oad 240 responses ettenvely so stu ou | serine espn aoa i i oF ses ter et Seaweed wt nee Luneson wos weaigenignd wt cg Hou and aooniaw pacns 1 Sova smstions [Scam parisien weangn metoseecanted | soougneue the eesaen moka teaming nec j 4 -"
    },
    {
        "image": "observation1_synth_4_aug3.png",
        "label": "observation",
        "ocr_text": "CLASSE LASSROOM OBSERVATION FORM eporimenvPrngrars ber and secton. ace Course Format (neture. s Piste Tins of chservaten Nevemver os, 2028 at v4 29 Apprexinate umber oF si sack NERY Sucemes: basen education Wamewors Ore cervine tox sear feemback Teese Organization and Preparation Pvt nd sgn we fedon ity owiedga ot sunt mater a rresgnoui ma sesson S88 nih, ae 9 envioninens"
    },
    {
        "image": "observation1_synth_4_aug4.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM ostractor: Jessica Gaver Observer: sesse Russet Schou Cutaye: Cotoge of Scenee DapurimenuProgram: Parnongy Deano Course number and section: eee 202 Corse Format: (Leckie, semis, ab} piovssan nased DatesTimne of observation: November i, 2028 at 11 20 8%, Location: Consesenee Room toiege Orca Bapeoxieate number of shitents in siase, 33 Tria 8 per ‘sow: explored tneching methoxtcgits for: rg AO Heonetzated mato. teanhing apsories aasrocre, enuhusang vin pee foeaacs uicontae based education tawomncr’, Pre sery achere gvncioed estan Good catanes penweon thecretea! vr Sortie Sanders | pmeten npcication svarancs i i i ‘quasvons i [sarong attosptor nantucus, Lesson wes aeflemanaed nah lgice! few and engraputia paang seoaunt sansinution was high: astustor ested | Srognovt ie seseon trouve teaming arecmert aetoetnen mae nigh: mot! ‘otuvive ipasing saves Insiactinal ataris etl eesuurees wwe MBGNUPNBIE, coment, ans Relecant mavens use Jones atiectvaty once"
    },
    {
        "image": "observation1_synth_4_aug5.png",
        "label": "observation",
        "ocr_text": "CLASSROO! Instructor: Jessics Carter ‘SchoolCollege: coleae ‘Course number and section: ECE 205 Date Time of ‘Approximate of Seience vember 05, 2025 at 11 20 PM number of students in class: 39 M OBSERVATION FORM ‘Course abe ‘Lesson wa! throughout t Instruction wn smonsteated thorough know read eiectvel 0 student ueson® werorganized wit 109iel fe session wi matenas and resources Someuhum standards ige of subject mater and were appropriate, cumer ‘students appea! tearing atmospner ‘student pa cation exercseS. ‘Student partons! incuswe learning inousive bearing sovean theoretical concepts an ved engeged and motiated: poste re maintained, fenveonment vaipaton was hgh msiucor eat 1g envvronment Page tof 5"
    },
    {
        "image": "observation1_synth_5_aug1.png",
        "label": "observation",
        "ocr_text": "CLASS! BEORM"
    },
    {
        "image": "observation1_synth_5_aug2.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM instructor: Benjeo Manag Obssrsar Teihs Goran School College: Catege of Rt Course numoat and section abore ay s DaterTirne of observation: Usioeer ce proximate nernber of stutents in"
    },
    {
        "image": "observation1_synth_5_aug3.png",
        "label": "observation",
        "ocr_text": "instructor: Beqjemn wanang SchomSriege: Catege ct Eéuaton ‘Course number ard eaution: gus 303 Course Format: (Lactere, se? 880.) Lebentan seesen DatelTime of cbsentvation: Goisbe 08, 2 at 1220 Pa Lovatiog: inoture Hora. xh Apeeouriate number students m siess: 37 ‘The lesaan focused on obfectovientat pregnaerening consents, specticaly inherkance and polymorptiae f Java, Thee ks Hemanctratinvs to austen Sey princinies, Shitents portixpalen in nanc en coding exercises uakag thee irabies user code examples eral Sve Asvessroane mainots aby Cours obisclives and lesson gous seh fy sentes eBPNe any mats and atgned win enema standards i sajereres ane suenoes i i 1 i | rasticor drwaneeaied torough towedge of sect ater esd Exver teswiacge eedemt Sneiuciortanmuctates suse! aeneitdy and j ssspoatied etlastonly io sudant questions womnemnens in tenching appruach [Lemon was aatespeitied with ogesi fos and anpmcnnate ea jeabant scien surene wie of muterests resouces eriensee wandant | thesuitann ihe seen | understanding of compiex concave. instesctonal mater aod oreourees nese appronvele, cunEnt ard Feicvara worats we Gord talonow Between uoralion aenapto and pacts! agoteason evar. i i"
    },
    {
        "image": "observation1_synth_5_aug4.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM tnetructor: Senjame tanning Observer atthe Sema SchontCotlege: compe of Laventon DepertimentiProgran: Busnes Meragement Course number and section: nus yoe Course Format, (Lecture, seminar, Gtc.) Laveen aesion Dawe Tune of onservation: Cather 08, 2025 ot 12 20 OM Location: actie Hat A. Man Buhing Approximats camber of students in clase. 27 ‘The ieason tocuasd on abject orented progrenening cocenty, spscitcaly innestance and pty norphiem in Java, The instructor used code exargiee and ive emcoetraten to fustraie key orinciples. Students partcipaied i hiands on coding exerciser using ther lasts tongs desaada tones oda firm laenirtpen"
    },
    {
        "image": "observation1_synth_5_aug5.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Instructor: Benjamin Manning Observer: Tabitha Garza ‘SchooUCollege: Cotege of veaton DepartmentProgram: Business Management Course number and ‘Section: sus 305 Course Format: (Lecture, seminar, AC.) Laboratory session Date Time of observation: October 08 2028 at 12 20 PM Location: Lectuw Hal A, Main Butting ‘Approximate number of students in class: 37 The lesson focused on. Object oriented Bo regency CONeeBS, specifcaly inhertance and polymorphism in Java ‘demonstrations to dustrate key principles, ‘Students participated in hands on coding ex: laptops. ‘Comments: Assessment methods algy Ned wel wth stated teaming ‘objectives and outcomes instructor demenstated thorough knowedge of subject matierand Srpet hnowadge evdent intuctor demonstrated euturlsenstvty and ‘responded effectively student questions, swareness in teaching approach {ton was wetorganced wih ogcalfow and approprate pacng Excelent structure Strong use of mutimedia resources enhanced student throughout the session ‘understanding of complex concepts Instuctonal materals and resources were appropriate, cuent and Relevant materas used fective utized ‘Good balance between theoretical concepts and Practeal appicaton exercises, Page of $"
    },
    {
        "image": "observation1_synth_6_aug1.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Inaction: Nan Compnet 40 CbisVEr: denen tite MO SchanlICotege: Cotege of Semcee Depanmnent Pragiam: Teese Fdverion Conve vumbes une eection. 94TH 305 Course Format: (hackse. seminar, $0.) Seecmscneesed Dates Tine of shervationr: evtnter 18, 2028 4104 36 ANE Location: Sonne Leben 4 Aapecasonate rwamion of ghee in Saws. 23 The Mazon covered catanase rormualeaton 47 SOL query cttinacaton techniques, Shisevts surked en wectee exerowes Mengmig and querying relatene owtatven 1 Duntnean opt: Sone, rovbshaolig CcaNenOn parton 89 38 T a 1 Extotent oweanoes menagement end PROM man retecn cours mnupron i ‘catrotar desmowraied temucn tnoweege Af ebhee! wir wad Enea tenses evanrs i adewe wormed engaged at mctates potion Neneorend eterna) tS dant qrattont Rare Mowe antares i Sayer man sesrgenen ain gtaitec ond sopspmte poem [Gaus we mnagonari” saan punpeuan ave hn opus sens ongnet ne soca core erg encore SEE TEs art scious wo ansonsae, sont ont Tetwatar nengeeind wat Car exmenations wth pinion! Miping contest ovioty tees [PH weE remne comprerennen"
    },
    {
        "image": "observation1_synth_6_aug2.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Instructor: tera Campbet Mo Observer: sender Maer Mo SchoolCollege: cotege of Science DepartmentiProgram: teacher Zaveaton Course number and section: sar 301 Course Format: (Lecture, seminar, et.) Discussion based Date Time of ‘Observation: November 16, 2025 at 04 38 AM Location: Science Laboratory 4 Approximate number Of students in class: 25 daacee ornare alabase nrmalzaton and SOL query coteizaton techniques Observation Comments Watten on board Excellent classroom management and rappor win students observed throughout weapon Gemonstated thorough knowledge of subject mater and Expert hnowedge evident ‘responded effectively o student questions Students appeared engaged and motivated: postive eaming aimosphere maintained Lesion was wetoranized wih ogi tow ana ‘appropriate pacing ‘Student patiopaton was thoughout the session high: instructor crated ‘neusive leaming environ ‘ment Tractonal materials and msources were appropeate, coment, and ettectvely uted ‘Clear expianasons wih practical Fipine context ‘*xamples improved comprehension"
    },
    {
        "image": "observation1_synth_6_aug3.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Instructor: tara Campbet MO ‘SchoollCollege: Cotege of Science Course number and section: Mavi 301 Date Time of observation: November 18, 2025 at 04 38 AM Approximate number of students in class: 25 Observer: Jenner itter MO DepartmentProgram: Teacher Education Course Format: (Lecture, seminar, etc.) Dacussion based Location: Science Laboratoy 4 ‘The lesson covered database normalzation and SQL query optimization techniques. Students worked on Practical exercises designing and querying relational databases for business appicatons, troubleshooting common performance issues. Evaluation item ‘Observation ‘Comments: ‘Organization and Preparation —_ Course objectives and lesson goals were clearly state Written on board Excelent classroom management and rapport wih cumculum standards students observed throughout. Instructor demonstated thorough hnowledge of subject matter and Exper inowledge event PPeared engaged and motvated: postive responded effectively to student questions Lesson was wetorganized wah logical fow and approprate pacng Good tme management ‘throughout the session Instrictional materials and resources were appropriate, current. a Technology integrated well Clear explanations wih practical Fipino context sflectvely utized examples moroved comprehension. Page of $"
    },
    {
        "image": "observation1_synth_6_aug4.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION fons BRO Nate Comey sey Sessese0: Lancs, ies BO Bono otige: coxece a! tesence Suparimanaregani: texciar aseasen Course eure ANE SECTION: Mery 905 Oorsrse Bovis OaterTinee Of oeseeustiony: evento th fherture, seminse, ete 5 Appeonionss nanber of J Ouenasion vere BB at 89 a Reenter Soares tate students im close: x6 cae ee Straes, Sion wectes an past Sseremes desing art ener ‘sshones for muses upcecsbune, “Sovtleshcting camencspertormanes wmnce sd Seaeten ‘RiO6 Goal km Seas sisted a apna was se menage Pens observed theuchecr i i stand appar wy Sr 1 at vey ty seasend toe 8 of ser iset ans ant Saserts wonease ang isuoeg sumeyonece nee j i Lenton es weteraniond 6h moe Rew ane sapienaste paacg Yssupbeut the snasion 1S and marae: postiog Susser saseneen was j Peiesse amng enum i <9 ane management SiS: Houeine wnsree i etches ae wc a pee anus Prormneeaioe lec mpuicun pctatineeg | storey moe [Seer Pee Fase cent i fF £xem ples iromes compete rune"
    },
    {
        "image": "observation1_synth_6_aug5.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Hoptractor: tase Camper ObBerVEr: Jenner rater MO SchooliCollege: Cateye of Bowner DepartmersPrograny Teerher Covet ‘Course number anc section: ati 30% Course Format: (Lecture, seminar, #0} Dressontased Date Time of observation: Nowwaber 16. 2025 at 04 38 ANE Location: Sctnce Letonton Axproximate number of students in ciges: 26 The Season coveren! database normafzaton ant SOL query onteneadon techn ques. Stagents worked on practic ascekes dsigning ant querying raion atebases for butiuse apgicatone, Youtiesnadtng commen performance #80e3. Seaement casazm mansgenaet ang eopao sm jtrmsnermirmrn Course obiwetves and wescn Goss mere CnBey Mared ane Ohanee wth Sunes sas 1 Stovent appear: engaged and newatd Lovee Leamieg atnesaren naiviared, i ‘Sade? petogaton was Pgh, comucioe Seated 1 ative eaming emercament, H }Gmar expionaiens ats paste! Fine conte, J insnveter danonabated thar neah warweage 3 sajact mates one I rerpandied eMecanrto pagent avensont Puzo t of 5"
    },
    {
        "image": "observation1_synth_7_aug1.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM ipstrocton, Aavey tony Spseror, Brooke Ove BepatmentiPragram: Cx eosneerre se, eueninnas, 92.) Lakonstony Ae ua Foner (Lect sohontiCatage: Coleg of Location: Room 138, Engiening BANG Gourse cumniber and norton: PSY 204 oes Tine of absorvations: Cunner 27 228 apposrnats trina OF SanTES mF OBES esiogenents ines ATTRA 2 ein focunant co ion arity gyre, To estat IODA sgl S098 Tria govehology perecan tnervaier T28IPS suet antes seg ans aesrng HCTIRTO |e cns ann er su aaa 4 t \\ cmsaructns carcarvraiad omough e ewnye of suber matter und camera te mmieeons aewwnsunant soattods afgned we wa stated Weare |e aca se { it 1 pautent aacieization wk MP inesrractior crete 7 t {cou erouenvns wt vat 75 seempins eprovas comeranenson Upon and autoomet, aon ws wang d gin oe a wrest BES rego Oe $43"
    },
    {
        "image": "observation1_synth_7_aug2.png",
        "label": "observation",
        "ocr_text": "CLASSRGOM OBSERVATION ORM Instnectes: Aste 8 Ssener Soe ou SchoaiGainge: cotege of sence SeperterFromrans: Ces Eogimetng Course mentor ana santcn: wey 209 Course Forntat: (Lecture. semingr. ete) Lxnatony sbusion Lecation: Reon 201, engineering Gui Date Time cl eteservation: Qeasoes 17 2026 4 42 99 ans ApRSOARSS number of sturlemts in chase EY EEL cheiogs seein fonseer on drisioomerts thao ane mee sppitaton to Fibs tuay Oynanies. Tey watrunkee Shido Sane Dera arate cain tas fe wpe coe practices SiuaRion aad Properaiere Sourse ahiewes and tease exuoutom ceentsnas mie wan cay saree wid west vary Stine steeceoker ans ecming meragerant | Sten fr fasten detvery. Jneuslor ements arough knowlege ubiee rele ong tsonded efterenniy ta stucient questene Aesescantwethods eigned woth nated ening [ean wae wangonond ah soien Sai! flow amt appropaeie pacing [nts Rocupseut te secs AOS WE MDM, caren, was Sreinoaions wah seusinal PSone conten, | asseraira eeoves cecvemrentian"
    },
    {
        "image": "observation1_synth_7_aug3.png",
        "label": "observation",
        "ocr_text": "CLASSROGM OBSERVATION FORM ingteuets Asay Lee Okseiwer: Beare cox ScheokCotiege: Cateye ot son DopartmentPragear: ov Courgn mumbar and section, poy 20¢ emg ‘Course Format: (Lecture, seminar, ete.) Labe tiny sessen Deeiwatinn: sete: 27 2005 ws 92 40 AME Louation: Ream 201, Easineestip Baking Apsrexinatn nariber students in clase: 2 ‘This anyctaiogy se0sion tocused on develoorountal theasies asl er apreeaties io Fano tanaty dynaenies, studaots shared nessa dwervsiions rating Dry te Ppins cuturai practices ‘he iestctor incerporsten Inst reaearch futings end sum obisetves ard ian goats ce Med sisted anc algned wh covet stargate mspinde nosey satort gh | Shecves ant extares i i i i H a _ 4 | I | | eteectua y wired [Sear expiana tues win aanstcat Fptia conte J ecemaies wound comprmenson i i i a ae ee Page L063"
    },
    {
        "image": "observation1_synth_7_aug4.png",
        "label": "observation",
        "ocr_text": "SLASSROOM OBSERVATION FORM Conervsir: Sroete ue SehonirUnkege: Cotegs of Somer DepanneniPregeam:. Sut Engrentes sheon and panei. PY 20% Course Format: (Lecture, gomnina, ic.) tabecwry sence mnseacho neh Conse 8 Date Tiene of ebsaervadon: Seabee 27. 2a wt +8 Appronknates number of stacker in chess: 7 ran: Boom Vt. Enginesting Bang veaM nsibucine heceporoten ial research Foss ievetoprennas inn noe tan epicenter aan, ghetorpy soaker focuses ve ree Weak 8 FRE CxS RSH Ths pay cents ebacad prrsunal observa Grracxnatogy aed mamieg menagerie finns ane ser Tyaetan on cers [eng uso toa ters | srs eros es B i H vabeore tates anne quate wore snety ated ond Siytord L. ; 1 com ducanainina arog tose of steer et Sekencnt to eaiwotd Aasesemant mata grad i a 1 Siow commen eve; mentees “Teed toe manayersent ¥en eon omkangnnd win og! ew ns esamese ARG Tecate mana [Rupa ne orner i i i oar exoanmtans ve perso Fn 1 Genres onprseas SouReROnAaN: Uousea iexming enseamnent svt, ect wd sak ae SOUS TE SPT aun"
    },
    {
        "image": "observation1_synth_7_aug5.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Obeeruer: Boeke Cnr DenarnmenyPmgran: Course Format (Laciurs, seminar, #6.) Laesoty eranon Lotatiens From 07, Engineaing Bossing festractons astiey Ley ‘SchnokCakege: Cotmpe at Science Casutne raatiber and saction. PSY 20¢ ates se ef abeeewasion: Getater 21, 2528 at 12 28 ABE Eopconimate nantan of abate in ase: 28 zn foeuaed on dovetipmente acre and the apseuien fo Papin foray Gyourics, The tution mayor toca research Swings od Tris nayohatagy seas niusanes shaced nacsonsi chaacestiona relates ots we Pern cuted practi Cautee chywatives and essaa goals ware cane stwted and wikgned wt eines une of trehcomay ant teaming management | cornvum stances omnes ff | paserement seta atgnad wath snes eam responded efinatvely shstenl quastant | sceazent otconm [veut aeons mug mown of mee mete i | rodent sachapation wine hia, sonar ceasine i [rosacea frescoes wt eget ow ena assmeone pesos Vocd ee wanagersnt overt se i | i H [oromeies oproaca computer, 1 if 1 i"
    },
    {
        "image": "observation1_synth_8_aug1.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM frstouctor: Kyi Wasmegues Bchacittatiege: Cotage uf Computer Studies ‘Course number ani section aus acs DatovTime of ohsuevuthors: Geisher 26, 2025 ot 00 76 Ate Agpronimate norte of siudanis in class: 29 Ceerwr thine Aguiar DeparmnaniProgran’ Pesenciogy Csoarant Course Format: (Lacians. semnieur, aie.) Sensnar ate Lontlon: Ciarseam 402. Leen ane “The fracon focated an abjeuicriented preqranning concente, speciicaly inbartance aed polyrerohiets Hs Jake, The watuctor vard ence exsrapies ag ie decraneirations t: Rusirate key arnciples Soden perboearsd i ee oo Grganicalian aa Praoacatian covie etsetres and [emis tnstuator demmocetoites caspondad aheeivaly to ssudent auesiors L - hesson wes wodergauens vo hain! ow ans appetite paca fmwgrer me seven t 1 erocsvaty ates i nardis cn ending axencioas uae et laptops. Ges mupienatone wth praviz! Fane content | qnexgies migaved comprenension. Esvelent snaysom management cra rapped wn 4 eosoniee Syausnet i | inctuetsrdavienstnted exitaal sonst i eoaurenass teaching sopra\" [Femmoiegy iteoriag wet instarans eemonstasad bist senetety aod H"
    },
    {
        "image": "observation1_synth_8_aug2.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM. Inainuctor Kye Viasnegton Observer, Uae Aguiar School Cakege: Comge of Commuter Susies DepanmantiProgram: Prychsiosy Gepanmeet ‘Course number end section: 6Us 305 Course Format: (Lecture, semminas, et.) Semiar sme Date Time of obeurvation: Cetber 25, 2025 a600 14 FM Location: Ceraoin 422, Liner As Appronimate umber of siudents in Gass: 36 “The lesson focured on object erantod programmeny cowcents, specsicaly Irhaitarce and poyinerphiam in Java. The remucior uved ode exumnpiec and ve demonstrations ws meatate hey semis Sluders cortcpaid w hancs on cod execoaes «sing the batons Fraiaation Cove cbyctves ane iettor goe wrm craty Haind and signecie, YwEtar on Rant ‘ins peptonacens win prateal Fees canieet [eerste i enone es merind comperenter } treruttr donnnninre i Barwugh Snealedg® of auiact ater wx! srvenees etectony matador gcestons udents ohtenes eumegtanat i [Extent anemone rarayenert unt appet cay i SaaS Sees opens waianas 28 CUIEAS ate apambele ewmert and enazse ubaes"
    },
    {
        "image": "observation1_synth_8_aug3.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSE RVATION FORM Obreneer Dee Are tratructor. Aye masnewton Deparment Progen senenkiCotinge comes 2 Carne Seatet Course navbar ar sectors 64 Conese Format (Lect CoatesTome of oosenvatean Locanon: Gesweam 36 yoi8, ree moe A PHT ideas or tas 3 Paycharngy Onsen fe. ena, ee.) Some oe pporcasnanwy renter of 3 tne eye teu on Aer ieeried HOF AnD PA pec tcmiy ezrtar ce 2 Bahr Gore ananena ic Gistrate Hey SOP prise 2. COSC OPES! ssenne paricgates 2a —~ | omer amenetny en mere Here corset 1 Shamwinn cemoves co 3p amare: curensvana mereugn envtpase oma “20 ees ean tee) 19 ida ANGE eit tages aru one wponemie FS Encaders Rene cence seat eaetpanstet \\roegnoat he weston nets: comnts ot arora raany meee"
    },
    {
        "image": "observation1_synth_8_aug4.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Cbvorver: Sane Aaiaer Ingtaurior: xy wostaster sehosifCellege: Sesege of Commie Steies Dopastmantftragram: Pavey Bovarent Conia nembes 200 sections: OUS 965 Course Feast: G gckure, seina®, Ce) Serine eve Location: cmsscet02, Lee 5, ash stots OHA atorTinns of eoservation. Ortoer 2% to meanbor of sbicewtls ia Cans: 3° Aggeoxiena ved coun exemmpies aN Ne se god goivemorphissn Sava, The med ‘using te ons eject ented progranuning conceats, precio 640 jem nands on Codng exeTC EE ‘ye lessen foouses on. Tony pecan, Students nario! Gamonsteations to aust Gaganination Sad Prepston sopaives an eran goo were Haat T oieas expianetins ti procteat Fane content arargis proved sarpsonns |} course ot sevens taney orn of seek mater ane Eten mnewiedae eveent gecenant cieseroem manageman en | Sudeotecanewed ea reovay 9 sida euestEns aaaor Gemamsiers cata sera wed isch t Conan ams wedegar iu gies at end eprronine pend Baonent stoeetane f H wanes 7 bean 1 rough ine ampeer i Lew etictney ote coud subuta! santeity 2S | nemetes des Soorenees o iozhe ruoingy mapraved we sasnnat wales ana cesDUISes HOES BE"
    },
    {
        "image": "observation1_synth_8_aug5.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Observer Bare Aguiar Colage of Commuter Sivas BepaamonvPragian: Psyenoay Conse unwer and suction ‘Course Format: 2025 46 99 44 One te eclure, serninar, ete.) s. -aber of studenis lass ae The trsaan focused a: ented prow anieing cence demorsiratens ‘9 susvate Pincwee. Students featy sinaetance sea py anon ibm in dow. The Sislectee used cose e Evaluation ém Orgamzation and Preperation, Sune anjectuee ant ston gents 109 and signed wih Motes om goad erarsies moved congenanscn few of cues oer and tapes srowedge reson stecmey utced"
    },
    {
        "image": "observation1_synth_9_aug1.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM Instructor: agoneet ten Dbsaever, Roicen ewe SchootiColieye: compe of ahtest DopartmentyProgear: wacceung Managemen Course sumiwes and section: ps aes ‘Course Foemat: (hentwe, semunar, wi) recuse sone necTime ef ebsseewation: teaswnm 2 2028 at 15 2s Lovating: Rose: 804, Enyinweting Belding Appioarnate sumber of students in dlass: <2 The elses checueed sxganizational behavior can aincunsed cxdirattactors af ts inziading motivation thenrive ani ace 8m Phigsire satires, co styles, Shatants avsiyved Pano workstien scenariog ans ing organizations dy _, eseabn fe aia Pras ecna ealance neisinn trecratica eaneunie and proctca! aptenton exercises [suconsanauares engaged and mate povtg enming atocipnare iemtanes, sprout toe vassen losevstinsa msi and su avtecsveny utizee restores cttural essen a i mecarenens i seuching zoprwsh,"
    },
    {
        "image": "observation1_synth_9_aug2.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM tnatnactor: teeveet tan SsenaalCotege: Cotege of Aentecns Deparment Progress: sanaring tanwztent Course mumber and section. 737 20\" course Foon: (Lecture, Seminar, @%) Onercerseend ‘Date Time of obssavaticn: November 12 5238 a «148 78 Locate: oom 821, Rraneesea BME Aggeesienain nuribor ot sunsorea in cass:"
    },
    {
        "image": "observation1_synth_9_aug3.png",
        "label": "observation",
        "ocr_text": "CLASSROGA OBSERVATION FORM {REICH sactne! Ran GbserV6F: Rabe nougs Shot College: catege ot Antenne DeparimanuPragrar: Htaeiog tarayenen Ceuree number and season: m6 2 Course Format: Loctins, seminar DetesTime of ocean: toxenees 1, seh a sta ee Loaition: Room 904 gn ABoronimate miner of students in case. 43 The claws anusse Saousied coturs tacteng 2 ai Dts S8 C00U iostvog mat ation thane aftecteng crganzars al yams Ph SRO ae! tye, Shader ante Fog Worepice seein ane pra ats Obaawvation Sone aba and tee SHI Sate ane eines wey Bato a eaty if 99 8048 were ite atectny engagys sy rewoncton quossae i Bes acne MOGI Steen of so0 8et mane Ara Connects ts seniened “sponded atlectinly 10 ausen eosin S09 th ie tw aa erate sacng Suge epuonies ensegee one cata, soseny sng ammospree na UTesosiegy ciacates ons Btewcon da neraomied aot i B tessnng appcnrn"
    },
    {
        "image": "observation1_synth_9_aug4.png",
        "label": "observation",
        "ocr_text": "A OBSERVAT 10N FORM Spsereor: Honantsioess partenonuPrograr, ame Aeclive, SEO, GD Om Dep Mameserees sure Pee aocen 305, Bogie Leeson cust gente espe atesTiene of otmersasian’ Hoenn soma pine of acter wn clas etyona Pippo wecksaace ween sing weination eocen on seaceranip styles, SRE mations betavior sone anal Gyre STATS HOS Agpanenate OY orgie! re aefactl “yh cine once garcunce tava fae ata 2 stecoe ser ——eamcation bGiigaaizaiion ed epuraton gant wep 1 eoaunne oreo? soos wean suaats AE Lecanto sara wes and gree? { pnanetoraenonerind seneugy sarong 8 rans ater 9 pcs 19 sesso oan aren oe img eteszrny i meen ESO |e es smopnate oe {Seva wena sutra zee etoe ni sgegnas inmerenind eaters eee Teinacng SARE"
    },
    {
        "image": "observation1_synth_9_aug5.png",
        "label": "observation",
        "ocr_text": "CLASSROOM OBSERVATION FORM tnetructor: atetne! om Obasevar. Robes Noam ScrccaiCoheg. Catege ot Metinenie Departmen Progam Vaaaory Management Course pumber and section: °3¥ 201 Course Format: (Lecture, seminar, wtc,) Suovrien oeres Dato Time of obmerwation Nevenber 2, 2038 at 11 48 Pit Location oom 305. Engneaseg Suatog Anprodmain number of students in class: 43 he class dscvused cipanwarional oehaves concepis Noweng motivation Uecrinn ars leadership ttyies. Shadorts anatyzed Fang worksince Scararca ant amcumeed cubed actors atlveing organzaions! cynanace n Pratapse ete 7 |nanuabnati at wunmen co pain cent ond ‘|e pat"
    },
    {
        "image": "observation2_synth_11_aug1.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC. UNIVERSITY OF THE PHILIPPINES ‘Avonas Steet, Santa Mesa, Mania Classroom Observation Form {BUS 305 Marketing Management Instructor: 18 FOS\" Course peer /Observer: Antony Bves pate and Time November 03 2025 0223 AM Use criteria that apply to format of course observed. f Review Section s 5 ~__ Description Comments he esson opened wth a competing hook connecting aerental eavatens 8 1 a pie ee of population dynamics in Metro Manila. The instructor s enthusiasm for mathematics (Gove grace sien Pepe a er Set itesn wha cou be paIeaNe 38 abstract content a. ORGANIZATION Mathematical concepts were explained systematically with multiple Crsenzes subject mater, evidences preparation; thorough; representations including algebraic, graphical ‘and verbal forms. The instructor oe emmaries main points, demonstrated strong pedagogical content knowledge by anticipating ‘common student misconceptions and addressing them proactively states dear 5; em meets class at scheduled time, regularly monitors ‘on line course) ar Technology integration enhanced the leaming experience. The instructor used 3 pet a se respectl ar, and impartial provides graphing calculators and mathematical ‘software to visualize solutions and (ro tack, encourages participation; interacts with students, shows verify student calculations. Students had opportunities for hands on practice with digital tools. enthusiasm) Collaborative leaming was emphasized through structured rO P -s. Students worked in teams of three to four, 4, TEACHING METHODS TenCHbvant teaching methods, ads, mater techniques, and problem solving activities technology; includes variety, balance, imagination, group demonstrating effective peer instruction and mathematical discourse. The and nstructor circulated to monitor progress and provide targeted support 'ises examples that are simple, clear, precise, i rd on and meets stated objectives) appropriate; stays focuse a synthesis activity connecting the day s learing fo assigned meaningful homework that required ring scenarios. Overall, the instructional sation principles. The lesson concluded with 5, PRESENTATION {establishes onfine course or classroom environment conducive to Upcoming topics: Students were learning; maintains eye contact; uses 2 clear voice, strong application of concepts to engineer Gojection, proper enunciation, and standard English) approach aligned with outcomes based edu"
    },
    {
        "image": "observation2_synth_11_aug2.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES ‘Anonas Steet, Santa Mesa, Mania Classroom Observation Form Lee Fost Marketing Managemen Instructor: 18° FOSEE Course BUS 205- Marketing Management Peer Observer: Anthony Stevi Date and Time November 03, 2025, 02 23 AM Use criteria that apply to format of course observed. Review Section Description Comments The lesson opened with a compelling hook connecting differential equations to Shae Cae eset population dynamics in Metro Manila. The instructor s enthusiasm for mathematics cm seal cans er eater was evident and helped generate student interestin what could be perceived as abstract content. 2 SIRE Mathematical concepts were explained systematically with multiple (orosrizes subject matter, evidences preparation Is thorough; Tepresentations including algebraic, graphical, and verbal forms. The instructor States clear objectives; emphasizes and summarizes main points, demonstrated strong pedagogical content knowledge by anticipating common meets class at Scheduled time, regularly monitors on line course) student misconceptions and addressing them proactively. Technology integration enhanced the leaming experience. The instructor used 2 ae arest of students; respectful, fa and impartial provides, S Phing calculators and mathematical software to visualize solutions and feedback, encourages participation; interacts with students, shows Verify student calculations. Students had opportunities for hands on practice enthusiasm) with digital tools. A ERED Collaborative leaming was emphasized through structured group (uses relevant teaching methods, aids, materials, techniques, and problem solving activities. Students worked in teams of three to four, technology; includes variety, balance, imagination, group demonstrating effective peer instruction and mathematical discourse. The involvement; uses examples that are simple, clear, precise, and BE eae ee ee instructor circulated to monitor progress and provide targeted support The lesson concluded with a synthesis activity connecting the day s learning to 5. PRESENTATION (establishes online course or classroom environment conducive to UPcoming topics. Students were assigned meaningful homework that required learning; maintains eye contact; uses a clear voice, strong application of concepts to engineering scenarios. Overall, the instructional projection, proper enunciation, and standard English) approach aligned with outcomes based education principles."
    },
    {
        "image": "observation2_synth_11_aug3.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES: soars Siro, aa ha ene Classroom Observation Form Peer Observer: ise eritatia that apply to format ot course observed. Rivhew Beaton 1. SUOIECT MarTER CONTENT Semovatrates 2, ORGANIZATION cerganizes su sistes clear 3. RAPPORT Shovels imerest of feedback, envout entiuiasen) (Sivvses Qoies nominee ane! kn spectives meets cass at scheduled thine, regulary monizoes on aya of mibjact matter: mastery) saith an depth eudanoas prensa rug emphasizes and sumnirizes main points, ee courte} 4. TeAcMIne Mereoos: aces relevant. hing methods, als, materiel, techniques, and Teshnalogy: induces variety, balance, imagination, group invclvement; ses example tout are simple, clear, peecice, ad opriate; stays Zacuséd cn and meats states ebjectives} S PRESENTATION (esiatitones online cox learning: maintains ey or desarcom envsnnavent condurtae ennlact; usan a deer voloe, stong 4 prolection, praper enimeistion, ad standart Engtish} 12 30 ag Management Course Sate and Tir was evident antl helped generis stutont intarestin what could be j abstiict contant Mothemailcal concants wai explained systematically with multe representations including algebraic, graphical, urd verbal forms. The instructor ng pariagogical content knewierige by art sed though structured group ities. Students worked in teams of thzas to four ive poor instiuction and mathematical discourse. The 8 and provide targeted supp ricjuded with a eynthesis activity cunnacting the day s jaumirg to ‘Students wore assigned meanirasiat homewark thet required"
    },
    {
        "image": "observation2_synth_11_aug4.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Avoras Set, Santa Mesa, Manta Classroom Observation Form Instructor: bee Foster Course BUS 305- Marketng Management Peer Observer: Antony Bievas it Date and Time November 03, 2025, 02 23 AM Use criteria that apply to format of course observed. Review Section Description Comments_ ‘The lesson opened with a compelling hook connecting diferential equations to 1. SUBJECT MATTER CONTENT Population dynamics in Metro Manila, The instructor s enthusiasm for mathematics (ows 90d command! and rowldge of sje mater was evdentand helped generate sticentintrestin whal could be pereived as Seoth of mastery abstract content 2. ORGANIZATION Mathematical concepts were explained systematically with multiple (organizes subject matter, evidences preparation; is thorough; representations including algebraic, graphical, and verbal forms. The instructor ‘tates clear objectives; emphasizes and summarizes main points, demonstrated strong pedagogical content knowledge by anticipating common meets class at scheduled time, regularly monitors on line course) student misconceptions and addressing them proactively. 5 er Technology integration enhanced the learning experience. The instructor used 7 hat oe est of students; respect, far, and impart provides 2PHNG Calculators and mathematical software to visualize solitons and Feedback, encourages participation; interacts with students, shows verify student calculations. Students had opportunities for hands on practice enthusiasm) with digital tools, 4. TEACHING METHODS Collaborative learning was emphasized through structured group (ses relevant teaching methods, aids, materials, techniques, and problem solving activities. Students worked in teams of three to four, technology; indudes variety, balance, imagination, group demonstrating effective peer instruction and mathematical discourse. The involvement; uses examples that are simple, dear, precise, and 20propriate; stays focused on and meets sisted cbpetees) instructor circulated to monitor progress and provide targeted support The lesson concluded with a synthesis activity connecting the day s leaming to 5. PRESENTATION ° (establishes one couse or cssroom envionment conducive to UPCOming topics. Students were assigned meaningful homework that required learning; maintains eye contact; uses clear vole, strong application of concepts to engineering scenarios. Overal, the instructional Projection, proper enunclaton, and standard English) ‘approach aligned with outcomes based education principles."
    },
    {
        "image": "observation2_synth_11_aug5.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES, we farts Meee tune Classroom Observation Form Lee Foster ctor; £8 Peer Gbservey Rertios Sostiog, Ssun opened with a comentlina nos 2, SUSSRCY warren CONTEST popula fekows good coemmacat wecocige of sbjert mal spss wonsane deamernetrates wreath and depth of mastery) a a abstract content koommacting winental squators io fo Mania, The instrsctor s enthusiasts for matnamatice 0 Generate shader interes! in what could be geroaiend as 2 ORgaNtaariaN wet {organi subject mates; evidences sreparatios i thr sect, emphasis ated Meets cass at schedule oon re atical concepts were explained systematically vw tations inchuding algsteaic. graphical, ard v alr pols, demenstiaied strong pedisjegiea! cont Ribs ENE OR CES) Salen miaronee iy he inetructer ipating commsn st knowles aiktressing thom groae! | Teetet {forks terest of students: vespecty, fs, anc senate; provigen, F289 Frotiock, encourages mictiunwtion, igracte wth “Puclente, enthvstasen? ‘Integration enhanced the ieaming ay. patience, The Instructor used caloutators art mativenset heave to visualize solutions and ations. Statente tad opportusities fer havxds ca ex wih digital eois 4 TEACHING METHOUS Colabevitive aming wos emphesizet thcugh stained grap se ene ett hts, rates. chaiques, asd problem aciving actvton Stine aeneen teains of these ay: iichides vais, balance, imagination, group cemonstrating affective pear instruction and malhom: ohare; Wes temples thet are Smnele, slew, passe, avid instescton cheviat SP OERO; stays tocvesd on art a Stated objectives) Se eae fo fous, at dacourse, The 9 aid provide targeted support The lesson conchated with synthesis uctivit S eResewTaTiOn ee co Wh synthesis ect (establishes online coure er Gausrosm anviranmnort conducwe ip UiGOming topte eanng; iaietains eye contact, uses 3 clear voice song Sppkcation of cencepts to angincering scenarios, Overall, the istnictne Rrajection, oper enurstion, and stiandars Engkst) approach aligned with outconses banad edbwcation princiates 'Y Connecting thet day s fesming to Students wore aseigned meaningtul homeswbek thal cequinad"
    },
    {
        "image": "observation2_synth_12_aug1.png",
        "label": "observation",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY h Alexis Jackson Instructor: ee Peer Obsi erver: Antonio Ibarra Use criteria that apply to format of course observed, i eee ‘SUBJECT MATTER CONTENT {Grows 900d command and knowledge of subject matter; emonstrates breadth and depth of mastery) 2. ORGANIZATION {Groanzes subject matter; evidences preparation; Is thorough; fates clear objectives; emphasizes and summaries nore Points, ‘meets class at Scheduled time, regularly monitors on line course) (holds interest of students; i respectul, fai, and impartial; feedback, encourages participation; int enthusiasm) (uses relevant teaching methods, aids, ‘materials, techniques, and mean ogy; includes variety, balance, imagination, ‘group spomement uses examples that are simple, clear precise, and Ppropriate; stays focused on and meets stated objectives) 5. PRESENTATION {establishes online course or classroom environment conducive to learning; maintains eye contact; uses a clear woice, strong Drojection, proper enunciation, and standard English) Katipunan Avenue, Quezon City teracts with students, shows Classroom Observation Form Course _8US 305 Marketing Management Date and Time November 06, 2025, 07 12 AM Laboratory safety protocols were reviewed at the ‘tartof the session, demonstrating the instructors commitment to student welfare Personal protective equipment was properly utlized by all students, and laboratory procedures ‘followed standard Scientific practices. clentfic method and were able to formulate testable hypotheses about water quality indicators This contextualization helped ‘scientific work to national c ‘oncemns. espiniom ="
    },
    {
        "image": "observation2_synth_12_aug2.png",
        "label": "observation",
        "ocr_text": "ATENEO DE MANILA UMIVERSITY Classreom Ohservation Form US 1S (sting Management 3 Jackson Peer Ohserver: use crituria that ipply to format ef course observed. Peview 1, uipmentixas by at! suigeais_ and iaboratory procedures ‘ollewed standard ofthe Session, temonstrating 1 SUSJECT MATTER CONTENT 328 good om nd Knowledge of subject matter, nd depth of maste fy attined ‘entiie practices 2 v sutvarides ma 9 ientific method Feguarly menitxs anvine hypotheses akout water quaity indicators Dats 3. RAPPORT appropriate hotalory nut st in setantiiec wore shoias 5 parte paler, inferacts with ai; provi dts, shows pooks. The inst fot einphesized proolsion and attention te i ts. Students ported 2 8 stk ical shunking ape 4. TEACHING METHODS 4 elovart waching methods, ants, meterais, wechesgues, and UF gy; Indus variety, balance, imagination, group davistions, and compared trvolvement, ues examples that are simple, lew, pose, ane sppropigte, stays focused on ard meets stated! oby aduate sci ated nieans, vallty standonts tof Bovine ‘aturai Resoures DRESENTATION establishes eniine course or classtowm exwironenent cond ins eve contact, uses eat vous, strong ‘lization beiped students appreciate the rele enuniction, ofc standard Engl scientific work to ational e"
    },
    {
        "image": "observation2_synth_12_aug3.png",
        "label": "observation",
        "ocr_text": "Niens saenso9 Jaserector: es S3 r90 SU ECT marreR CoMVENT the 94 comin aot stes cee 2 OREAMIZATION aC RES “40 sare Meets Cabs at compre, si see Mee, eericeS pe Ce RRCOVES: tempi sed ner Seed ume, registry mo WN SI Cattiop tN, mine TEACHING METHOOS, (hs teaeant teasing tat tect eho clades varety nes exampie PRESENTATION (estates oe cree ND montanes eve Proieoon, pager oF dass on ate CMU, foe, ated warty per ATENEO DE MANILA UNIVERSITY Classroom Observation Form DAMON: 1s thong SES 196) Downs, 80 CLAS UEDRS, stone Cease LEO vanctre sar agme Date and Time Hoveebar ee 2025 Dererlotea Somements, LA0C 3 OFy Saat Prat OE eM MeO at ine an of ty Ueto: commiment io ay SEH WeITe Pors e a! DHE BREE YS Bh SUSEOR AND abana Nvdures GO WAS cleaty xpi Uagerstanding OF the ementiic yp N66 Weil Sta broviced bath vai writter: format PPSet ae water caslity nai hee 93 pm Matic and securala Seenate measureciect tacts ane mec cuca obser Inbetatoey musscaks The instructor evn Sta Ir nctentiic wack SUH Te ecperaied Uroklag sppopei NOC Cute uke maar IOS 82 water gale ston MAE nA! Me SCHEELE atudanis Aev alons, ane compan Paitpone Qeyenay 16 trait te of Faye: 0 babes aiony FiesSingge rrcleding pouuton ia fe CP head sudants Weak te nitions! concoms, nia Bay and AMEE: he vay inne her ANd weve able ty fon HSI) precisisy ard attenti ba wuld environment yt major ver syct P8280\" vomonst by. Students sad 19 ctynnizert vite for 8. Stone we norte sot by th fired Resownes sues ANC 8 oF these"
    },
    {
        "image": "observation2_synth_12_aug4.png",
        "label": "observation",
        "ocr_text": ""
    },
    {
        "image": "observation2_synth_12_aug5.png",
        "label": "observation",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Ketewan Avenue, Quezon Cay Classroom Observation Form Instructor; Alex s Jackson USS ceria that apply to format of course observed, a oa _ 1, SUBJECT MATTER ConTENT {Gow dood command and knowledge of subject matter; ‘demonstrates breadth and depth of mastery) (organizes subject matter; evidences Preparation; is thorough; meets soar Oblectives; emphasizes and summaries Main points, ‘meets class at scheduled time, requiory montore on line course) Hojeemaintans eve contact uses a dear vote, story Projection, proper enur INdatlon, and standard English) Course 8US 05. Marketing Management Date and Time November 06, 2025, 07 12am Scientific practices. The experimental design was Clearly ex, Provided both verbally and in written f Understanding of the scientific method hypotheses about water quality i ‘Plained with step by step instructions format. Students demonstrated and were able to formulate testable indicators."
    },
    {
        "image": "observation2_synth_13_aug1.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES onan Sov. Sata Mens Manta Classroom Observation Form i 2 ‘Alexandna Fletcher ‘Course ENG 102- Technica! Wrang Peer O Daniel Bums Date and Time October 25, 2025, 08 16 PM Use criteria that apply to format of course observed. The instructor established strong rapport with students through culturally responsive 1, SUBJECT MATTER CONTENT teaching practces Filipino values of respect and community were integrated into. (shows good command and knowledge of subject matter; ‘end dapth of Clason norms, cueing support lamin emdrnment contacto caine Content was made accessible through effective use of code switching between (organizes subject matter; evidences preparation; is thorough English and Filipino, particularly when explaining complex technical terms, ‘states dear objectives; emphasizes and summarizes main points, This bilingual approach helped ensure comprehension across diverse student ‘meets dass at Scheduled time, regularly monttors on line course) linguistic backgrounds. . instruction. Students engaged in authentic tasks mirroring professional (reat cnccrages pavicpter wteracts wath sider, stows” Practice inthe fed, preparing them for future careers in the Philippine job enthusiasm) market \"Collaborative leaming strategies promoted development of 21st century skills [Ses revert teaching methods, aids, materials, techniques, and including communication, collaboration, and critical thinking. Group dynamics tachanlogy, lachades variety, bekence ages Toe ane ‘were monitored and the instructor intervened when necessary to ensure tnvolvement; uses examples that are simple, Ger, precse, mr rece 4 ecuitable participation “The lesson conclusion included metacognitive reflection where students ir (tabtehes cre course or dassroom errnment conduc to assessed their own leaming progress. This self assessment component aligned learning; maintains eye contact; uses dear voice, strong with outcomes based education requirements and helped students take projection, proper enunciation, and standard English) ‘ownership of their educational joumey."
    },
    {
        "image": "observation2_synth_13_aug2.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVE! RSITY OF THE PHILIPPINES Aromas Sct, Sart esa, Manca Classroom Observation Form Instructor: _ exandria Fletcher 6 12 Tein ng Peer Observer: Daniel Burns bia Date and Time October 25 2025, 08 16 pay OSs citer that apply to format of course observed healt SUBJECT MaTTER (shows good command and knowledge of sut tes breadth and depth teachin ractices. Fili bject matter; a of masten) ming environment conducive to ‘academic risk taking 2. ORGANTzaTION Content was made accessible through effective use of code switching between (organizes subject matter; evidences aration is thorough; English and Flpine Pariculary when explaining complex technical terms. mates Clear objectives; emphasizes ay momtezes Man points, Ths bilingual pproach helped i ‘Meets class at Scheduled time, regularly monitors on line course) 5 er Practical applications of theoretical pancepts were emphasized throughout Phe instruction. Students engaged in ‘authentic tasks miroring professions) (holds interest of ‘students; is respectful, fair, and ‘impartial; provides, feedback, encourages Participation; interacts with ‘students, shows Practice in their field, Preparing them for fi enthusiasm) market Collaborative leaming strategies Promoted development of 21st century skills ios, alds, materials, techniques, and including communication, Collaboration, and critical thinking. Group dynamics imoen22QY; Includes variety, balsnos, imagination, group were monitored and the instructor intervened when necessary to ensure Involvement; uses examples that oe simple, clear, precise, and titable participation te; stays (on and meets stated objectives) Sauitable participat presenrarn The lesson conclusion incl (establishes ontine course or."
    },
    {
        "image": "observation2_synth_13_aug3.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVE! RSITY OF THE PHILIPPINES ‘Atonas Stet Sana Mesa tanta Classroom Observation Form Tre Alexandria Fletcher Course ENG 102. Technical Writing Peer Observer: Daniel Bums ‘ment component aligned equirements and helped students take ownership of their. ‘educational joumey."
    },
    {
        "image": "observation2_synth_13_aug4.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES ‘Anonas Steet, Santa Mesa, Mania Classroom Observation Form Instructor: Neandra etcher Course ENG 102- Technical Weng Peer Observer: Daniel Burns Date and Time October 25, 2025, 08 16 PM Use criteria that apply to format of course observed. Review Section Description Comments ‘The instructor established strong rapport with students through culturally responsive 1, SUBJECT MATTER CONTENT teaching practces Filipino values of respect and community were integrated into fsted sow enim raya aalaae ‘classroom norms, creating a supportive learning environment conducive to rene renee ang ee, Eee academic nsk taking pee Content was made accessible through effective use of code switching between \"(organizes subject matter; evidences preparation; is thorough; English and Filipino, particularly when explaining complex technical terms states 5; ‘and summarizes main ports, This bilingual approach helped ensure comprehension across diverse student meets dass at scheduled ime, regularly monitors on line course) —_jinguistic backgrounds Practical applications of theoretical concepts were emphasized throughout wat wanest : instruction. Students engaged in authentic tasks mirroring professional (holds ‘students; is respectful, fair, and impartial; provides coureges poricputiny meses wah Sere, ome Practice in their field, preparing them for future careers in the Philippine job market, 4. TEACHING METHODS Callaborative leaming strategies promoted development of 2tst century skills (uses relevant teaching methods, aids, materials, techniques, and including communication, collaboration, and critical thinking. Group dynamics technology; includes variety, balance, imagination, group were monitored and the instructor intervened when necessary to ensure Involvement; uses examples that are simple, dear, precise, and appropriate; stays focused on and meets stated objectives) ‘equitable participation. \"The lesson conclusion included metacognitive reflection where students (etches cone course or dassroom environment conducive to @88esSed their own learning progress. This self assessment component aligned learning; maintains eye contact; uses a clear voice, strong with outcomes based education requirements and helped students take ‘Projection, proper enunciation, and standard English) ownership of their educational joumey."
    },
    {
        "image": "observation2_synth_13_aug5.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Classroom Observation Form Use criteria that appiy to tormat of course ehserved, Review Sectises Description Comments shed stong cap cort with ef ‘hing practices. Fi O BURECT MATTER coNTeNY demonstrate 4 and tnowiede of sus means anes Gegth ef maston 2 ORGANIZATICN Switching berweets Gorganizes y wher explaining ined an plications is intoreet of 3 read aack, 3 enthusjas udonis: is res MeDUIIgES pamticipatc Phesized throughout Studer aks miro professional Practice iv their Heid, preparing OF FUCUIE Careers int market oilaborative weary clusing Communication, cotshor Ne aniivted stacgniiive vetiey Hains e Proper wr tel outcome io, and ment compen 8 and hatred stud nt alignes er ed ownership nf thei"
    },
    {
        "image": "observation2_synth_14_aug1.png",
        "label": "observation",
        "ocr_text": "Pe THE STECHNIC UNIVERSITY Cy PHILIPPINES bus 205. Aningay Rice Course Instructor Peer Obser Use criteria that apply ta format of course observe Review Section G sscrigtion/ Comments (Gealty ana estaniishe Viswat aids including Power aligned wath the eourve Sytia 1. SuBIRCT Maree CONT! ne ss were attentive duving shows jared and displayed professional formating Ski t matter experiise sith current Leckwe content 2 ORGANIZATION ouati, lower waratcns fs th tates erga! sminarizes main 20\" meets foc tine, re ats one Sourse) nto iustrate oi through steeiegic 3 a Ravens _ techniques lonenorder an higheron Louskds Inverast of students is respectful, sek, encourages aarticipatior ‘thinking merely F ENG BETROOS Student perici Jaant teaching snethods, aid stance. 5 TEAL uctor created an incl Fhiging cute teomnosony; shad on 1g exit ckets and quick polls to yout the in throug 5. PRESENTATION hes online course cr classroom enviranment conduciw 2, sony rash) Stucients identify areas fes tps ck was imediat navtive, helping ovement"
    },
    {
        "image": "observation2_synth_14_aug2.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF PHILIPPINES Classreom Observation Fore th ise eritaris that opply to format of eaurse abserved, Review Suction SRIECT MATTER CONTENT {shows good cominand and knowledge of sul Senorsiates breadth and eepth of mastery} cet matter, med avofessional formatting. Si aents were atta 2 ORGANIZATION wees forganzes subject matter; evigene i econ, Stites dear cjecives; einpte: main points ants dass at ated mOnOrS OEE Ene content demonstrated strong subject moter expertise with current fom Philippine business fondscape The instrictor effecth iaworld from S28 suramay ne, regulsrly 1 stint fo iustrate markating pirat Classracm engagement was f 3. RARGORT ategic questioning The far ain higher order i respectiul, aie, and impartias “ one ane High -o7 Feedback, exanurages pa ticiation: hy inking questions, encouraging studevts to analyze svenarias rather than rnerely recall facts. Walt time eter g tions was appropeiate <. TEACHING METHODS Student pavticipation was consistently high throughoul the wes: chlo eke 2 Tete, sis, materas, techniques, ard instructor created fn inclusive alrauaphers where students tot lechncr ates variety, holante, imagnnatisn, grou sharing ides. Faipina 2 sed effectively eaivenient; uses examples that are wanes soprensiate slatable and mean &. PRESENTATION (establishes anine course or classroorn env ning; Maintoins eye contact: uses a Clear vol Weta, Br nciate inetious ware integrated througheut the lesson The instru at conducive tg USUd formative assessment h streng 1 aret standard English) ies including ext tickets arid quick pu s immediate and consinestive, he rt 32 undersianding. Feedba Students ‘éonlify areas for imps"
    },
    {
        "image": "observation2_synth_14_aug3.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC, UNIVERSITY OF THE PHILIPPINES pocns Soe, Sata Mess Mas Classroom Observation Form ‘Anthony Rice Course Bus 305- Marketing Management Date and Time November 06, 2025, 02 27 AM “The instructor began class Pur atgned wit the course slabs Visui professional formating. Student Sete good common And a Coe rnaiet, welt prepared and displayed emanates bea the introduction phase. a. ORGANIZATION [ecture content demonstrated song subio matter expertise with current ceadences preparation 5 norouo sceamples from Philippine business landseapu ‘The instructor effectively tegrated ral worid case sts fom FPN companies like Jolivee and SM marketing principles. | (organizes subject matters (oroae dear objectives; emphasizes 28 ‘summarizes main points, at equialy monitors on line Course) Corporation to illustrate - Classroom engagement was feclitated through strategic questioning wuctor employed 2 mix of JW --order and higher order > Golds merest of stents; respec a impart; proves] Nee pre (ols tres fe patos vac wh se pros inking questions, encouedg rymcents to analyze scenarios rather than etusasm) Tory recall facts. Wait ime ater gestions wae ate _ Student participation was consistently high throughout the session The Where students felt comfortable instructor created an inclusive atmosphere ‘used effectively to make content |g, TEACHING METHODS Teaver enc meds, is, Mele, techniques, and ecnaoay, ites iy, ce imag OE ay arin wees. Filipino cultural examples Were rervent a are’ siple, dear, reCSe, : smeoropite; stays focused O° wr meets stated objectives) relatable and meaningful to eames PRESENTATION 7 \"assessment methods were integrated throughout the |esson. The instructor PRESENTA Tre couse of dase ene conduche to wsed formative ce smert techniques including ext ckels ond quick polls to ‘Goes 2 dear voice, 81099 ororetanding, Feedback was immediate nd constructive, helping ene students identify areas for improvement. (ein maintains eye contact USes 2 Gey Eo sen, proper enuncation, and standord ish)"
    },
    {
        "image": "observation2_synth_14_aug4.png",
        "label": "observation",
        "ocr_text": "TECHNIC UNIVERSITY OF Th PHILIPPINES Classroam Gbservation Forme course BUSI. Mee pate and T Peer Onserver Use criteria that appty te format of course observed. Review Section Begerigtion/ Commursts se insituetor began clase penchially and establstiog clear \\eaming ajectves cuspiayes professional 1 SUBJECT MAYTER CONTENT at Genowe Sood comanand and Knowledge of subject ialter sRimoncteaies piezdsh and depth of euastery) strong subject matter ape. The ingtructer effective Y 2 GRGANIZATION bee and SM dorganues subpect matter; evidences fos, eonphasizes and SuINSHTeS MAG DOS, Gane, reguinriy gti OF HNe SOUS gh strategic a3 1x of lowerorder and higher order 3. RAPTORS iirokds interest 9 nits) sion The Stusunt pamticipation was core comforiat ENCHNG METHORS teaching metbiots, nology, duties vestety, HRIIA, hag involsement, uses esampiag tut are spi capropnate: stays focused on and meets Ss ictot crested an inclusiy cm polls te S$. PRESENTATION (establishes orkoe course or dass 1; uses 4 clear vores, strong formers understanding"
    },
    {
        "image": "observation2_synth_14_aug5.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIG UNIVERSITY OF THE PHILIPPINES Classroom Ghservation Form Anthony Row Instructor: Course won pate and Time Peor/ Observe ise critena that apply fo Mnemat of course ebeceved, Review Sacer i Peserivtion Comments cally and astaeitsnes cleat waning om ‘visual alas aetuding Power gare nas The fey anal iormarting 8! 1b noveede of cispiaye: ng death of mastery) matter expertise ofth our nipine companies tke Jolie anxi BM wetter, cagentes preparation; 1s Theron\" mare gos os from erganies Sy Sotes dear objectives; emphaniees and summa fnews dass at scteduled time, regularly monitors of 1g paincigies Casporation to 8 ough strategic questioning oom engagement was factitated The instructor eniploved a mix of tower is 10 ansiyr 3. RAPSORT Ehoids interest oF students respactful ses particjation; interac nd enpartiat, provides een sents, SPOS ons, encouraging oh e session The ahh thicughou! ticipation was consistentiy b created an inciasive atmo: itoral examples Were Stren 4) TEACHING METHODS uses relevant aching mnethedls, ach, materials, tet oo Teatnnetogh insiuies vent, eon, MegnaLon, GrOUP sharing Mess. Pips iaivemnent, uses o amples imgie, seer, areuse, and 4 meeninoful to learners oes vee lie: and meaningful to learnes effectively fo make content vent methods were integrated thyoughout ext ich riage inclading =, PRESENTATION used formative assessment te end constiuctive Delping Jestabishes arlne course 0: Gasescom enraroritant cordate (0 ing: maiitieg eye COMLACT, USER A ear VOI, 3 ieding, Feedback was immed econ, Foe\" SAUNERLEN, ard anaes Enghes) ager oj {or tnpeaverent ily a"
    },
    {
        "image": "observation2_synth_15_aug1.png",
        "label": "observation",
        "ocr_text": "UNM -RSITY OF SANTO TOMAS xpaia Goer, Mais Classroom Observation Forma ECE 208. instructor: aK Matto Peer Ou Course Date and Time Beaciiption/ Gee coming ROOK The ieston opens with apulaton dynamics fm Metro Manta, The ine abstract content evident ped generate student inte id be peroaived vith mult The instructor 2, GRGANIZETION (organizes subject matter, evidences preparation; fs therough ates clear objectives: eniphasizes and meets cass of scheduled tine, regularly r form: warizes rats ritors on hanced the je crbeck, enonvages particpatn: interacts wh students, shows ors and mathematical s Collaborative leaming w: ivities, soblem solving ing alfective p instructor circulated to monitor progress and provide targeted support SENTATION establishes oniine course or classsoom env ducive fo rearolng cles voice, strong ection, proper enunciation, and standard Eegish nased education principles."
    },
    {
        "image": "observation2_synth_15_aug2.png",
        "label": "observation",
        "ocr_text": "UNIVERSITY OF santo TOMAS Eieah Bases tens Ciassroom Observation Form Course SCE 203 Crcut ays ee 12, 2026, 0: Pi Date and Tune Ocobor oe (lon erecta Yat wpety to format of cour obverved. exlained syslemeticaty with musique marr evidences prevoreten; is tnerough: fepresentations inckaing states Gear objectives: emp aNaeS And 24 vigetve. graphical and verbal fonns The instructor Ssetent knowiecge by anticipeting common Stadont misconceptions nd ectressing Proactively them | Tocmclay ikea, ee anced ine leaning oxpeienen The instructor used Ve sents Artal schawr to vnwtan seta ian, ence agape 24 a free ea late ‘eitasaein) waxkod in teams c! theee to four, imagnation, group demonstrating eHective poet Instructs toys Foes Inet ane single, ear. precee, anct SPDrOpriate, stays Rocusee ‘ion arei mathematical dscourse The (On an meets sexed cjecives) NERY fa mer Pees ae poi med none dang ne a sont int onan ej aig PRESENTATION. \" (establanes ork course or dassexom awe wy ecoming lopks. Studer were assigneg homers that requis Penne, ata eve contact; uses» thea vor seehication f concepas to onginsirg seeratos Oven, the instructional vs Proper enunciation, and standacd Engh) Spmoech algned wit catccras based csc yincsles"
    },
    {
        "image": "observation2_synth_15_aug3.png",
        "label": "observation",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Easede Becereet, Yon watractor: MAM Poer Observer: Avge T88 nnrmmnm tase crtarta that apply to format of course oaserves 2. ORGAKIZATION Peerars eck ois, tras oepmnon: Chaos states Cer copectices: emgeascs ame oe Ms atacand Nn, vaRAOry THORS CN COM respectht, fay, 20 inpestal; proves RAPPORT (rolds interest of etuderts ons invert wth Sade, Tencback, enccuragrs partespasiors, erthursianem) Thectagy, snckades warty, balance, imagination, 7 as rat are serge, Cer, preci, a8 rere’ ays toad on ond ments sated aAKSSS) demonstrated str student misconceptions and adress isangrtion eviancud the eaming axpaionce ‘The iretructes used geohing verify student calculations ‘Stadents hod salt digital tots, Cobeberative lorring was emphasized hy rublen salving wcthtion, Students worked inatructoe circulated to manor “Fp lenoon conchae wit 9 syrthesis topics. Students wers assigned upcoming ‘pplication of concagts 10 eneprearing Seenstios hosed edhscation pinciples. ing them prosctivety a pars anv trahwavatical sotwnne to vieusie scalars st ‘appenurities for herds <n practice sgh structured (FOUR in teagns of threw to four, szinity conecting ina day’ fearing 12 roeaninglut homowenk tint recawd ‘Overelt, the instructional"
    },
    {
        "image": "observation2_synth_15_aug4.png",
        "label": "observation",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espaha Bosevard, Manta m Observation Form Course £0 202 creutananse 125, 03 28 PM instructor: Mamas Peer Observer: “pega Todd Date and Time ‘October 12, 20: Classroo! Description Comments mpeling hook connecting diferential ‘equations to ‘Manila, The instructors enthusiasm for mathematics student interestin what could be perceived 25 “The lesson opened with 2 COF population dynamics in Metro ‘was evident and helped generale abstract content. Mathematical concepts were explained systematically with multiple representations including algebraic, ‘graphical, and verbal forms. The ins Yemonstrated strong pedagogical content knowledge by anticipating common Student misconceptions and addressing tne proactively. enhanced the leaming experience. The instructor used ‘nathematical software to visualize solutions and tructor {organizes subject matter, evidences Prot ‘and summarizes main points; states clear objectives; Mneets class at scheduled time, regu! Technology integration 3. RAPPORT (holds interest of students; ul, fair, and impartial; provides araphing calculators and i Cr encourages participation; interacts wih Tate crows Very student calculations. Students had opportunities for hands on practice enthusiasm) with digital tools, |g. TEACHING METHODS Collaborative learning was emphasized through structured group {Uses relevant teaching methods, ids, materials, techniques, and problem solving activities. Students ‘worked in teams of three to four, technology; indudes variety, balance, imagination, group ‘demonstrating effective peer instruction and mathematical discourse The wae es on and sl, aes) and netctor circulated to monitor progress an provide targeted support The i thesis acti ect /s learnt 5. PRESENTATION jesson concluded with a synthesis activity con ing the day s learning to PRSanesonine course of dass 00\" semironment conducive to upcoming topics. Students were assigned meaningful homework that required (eae maitains eye contact uses 2 eat OR, strong application of concepts to engineering eenarios. Overall, the instructional ndation, and standard English) approach aligned with ‘outcomes based education principles."
    },
    {
        "image": "observation2_synth_15_aug5.png",
        "label": "observation",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Espaia Boulevard, Mania Classroom Observation Form Instructor: Mark Martin Course £CE203- Creut Anais Date and Time October 12 2025, 0328 pr (holds interest of student sen OUra9eS participation Intersn enthusiasm) Technology integration enhanced the leaming experience. The instructor used icpaeece tar, and impart; provides sraPhing calculators ith students, shows verify student caleu 4. TEACHING METHODS Collaborative leaming was emphasized through structured stoup {US relevant teaching methods, aids, materials, techniques, and Problem solving activities. Students technology; includes variety, palance, imagination, group spavement; uses examples that ore simple, appropriate; stays demonstrating eff Clear, precise, and focused on and meets son and mathematical discourse. The objectives} instructor circulated to monitor Progress and provide targeted Support 5. PRESENTA: The lesson concluded with a Synthesis activity connecting the day s leaming to {estabistesonine course or classroom Seronment conducive to upcoming topics Students were assigned ‘meaningful homework that required eating: maintains eye contact sae. a clear voice, strong @Pplication of concepts to engineering scenarios. Overall the instruct Proleon, proper enunciation, and stander English) @pproach aligned with i"
    },
    {
        "image": "observation2_synth_16_aug1.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES poonas Set, Santa Masa, Mania Observation Form @rq SE Diflerential Equations 2, 2025, 02 56 PM ene Patricia Thompson Peer Observer: “Tamara wison____——~ Date and Time Geet Description/ | Classroom ec etera tat apy to format ofcourse HSE —— [ (Comments ‘Te lesson opened with a compelling nook connecting aflrential equalons 10 4, SUBJECT MATTER coral a population dynamics in ‘Metro Manila. The instructor s ‘enthusiasm for mathematics (so oes aprkach iain ve Laie Wvas evident and helped generale ‘sudentinterestin what could De perceived aS abstract content. 3. ORGANIZATION ‘Mathematical concepts were explained systematically with multiple > (erganizes subject matter; evidences preparation; 'S thorough; representations including algebraic, graphical, and verbal forms. The instructor cor objectives; emphasizes and Simmarizes main points, ‘demonstrated strong ical content knowledge BY ‘anticipating common meats cass at scheduled time, regularly monitors ‘on line course) student misconceptions and addressing them proactively. 4 er “Technology integration enhanced the leaming experience. The instructor used 7 aie of stents to, and pati ve ing calculators and mathematical sotware to ViSUAlZe solutions and (nels x, encourages participation; th wth students, SHOWS verify student calculations. ‘Students had opportunities for hands on practice enthusiasm) with digital tools. A {ING METHODS Collaborative leaming was emphasized through structured gov? {uses relevant teaching methods, ‘aids, materials, techniques, and lem solving activities. Students ‘worked in teams of three to FOU\", (eennology; indudes variety, balance ‘imagination, grOUP ‘demonstrating effective peer Instruction and mathematical scours® The es SSemmin ya tsissce) instructor ciculated to monitor progress and provide targeted support m ae “The lesson concluded with a synthes s ‘ativity connecting the day s Jearing to replshes TION arse or dassroom envionment enets Ge topics. Students were assigned meaningful homework that required act: uses 2 clear voice, StIOND ication of concepts to enginesti G scenarios. Overall, the instructional approach aligned with ssuteomes based education principles Jeaming; maintains eve Cor oper enunciation, ad standard English)"
    },
    {
        "image": "observation2_synth_16_aug2.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Avoss Sites Serta Hess tanta Classrooms Ohservation Form Use eriterta that apply to Yormnat of course observed, sae Review Secon & SUBIECY MATTER CoMTENY {ahkws goad caiman’ afd knoxwieige demansetes Breau and devin of re F subject matter; mates Acepts were explo eniphs ited systematically viin maitiple aphleal, ana vert gogical Content kawiadg it eckessing them prow aration; is thorougi wslees ond summerives al 1 ey mENkEES onine tons. The points, Semonstated by a: shadent miscone: Testnotogy ion enhanced the teaming RareoRy graphing calculators and m (eis insorest oF sty SFephing coicuiators as feeihar: verify student with digital toot vatharn Software to visualize sclutions and Students hal apportion for ieviatinns handson practice 4. TRACKING METHOD: Collaborative variety, ba men; Uses examnlas thar are simple ning was emp: ies. Students worked in tea tive peer instruction ane smathe: oF claated te mentor progres ted through oructured y the te Fear al d scourse. The 3 and provide targeted support femonstiating precise, ang SO ‘ed objectives) iis #88 sctivity connecting Siane¢ rr cepts 16 engineering g Engish) S Grit Course tr classicom erunanimane contin ms nye canta uses 3 clear voice, sang ition, Bre) stand day s leaming to wote Ups ingful homework that requ enasios Cyverall, tho inst res based edur ction ation principles"
    },
    {
        "image": "observation2_synth_16_aug3.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVE! PHUIPR EN Clresrog: Bory OF THE Sets M N i} Observation Forny Cenarse Ma SURREY ata: He testo openeet with 3 corr iting fos TES OocrENY BopuiRton {Siete good command ang Mrcnkecve oF sutfert mote, Sernonstrates tesa 9 @eiarniea ig; WRB evident ase his ababact content st dsoth of ynasteny euseatans i eine Benin Soncente were acts “ncwghy ——_HRresantations The insinetee Ps on cate ‘schrsiogy integration, erheces the leering eoesianen The insiructer used Cite erect of Stuttorits; eapacthd, fale sng impaitai; sovithg SABHIng Mae at mathaniatic are PS Boy ree ralents, shows eustasi} 8 software to vi: Lely Stoo calculations, Students na sporteaties toe ‘Sutation with digitat tonis, Collaborative: fearing was empbasiond iy: tus tiaredg BCD Sites, and pablo stiving tities Stree woiked ia tear of thes fen eed Setionetrating eftsetive pecs NStruclion and mathemaiings discourse The fives? incinctne Circulated te mani MF PregFESS ane! previ PRESEHT ATION oming: maiesaing ave Selection, proper a Seeget60) supcort “sth 8 aymiesie sssviy {arti Ucn topics. Stents mane a82Ighed meanings A Gea woe, sexes lion OF concEnts te Segineeting sconaring. fEncl) APEROSI alerts coms based education prin"
    },
    {
        "image": "observation2_synth_16_aug4.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIG UNIVERSITY OF THE PHILIPPINES Date ond Thre “Demon 12 2025, 0258 Ft compating hook connecting diMerentiat equatons Hands. The inetuctor s enidnusiawen for matornencs stacient tntarest iv aihat couid be DEFOR RS “Toa lesson opened with popusabon dynanics to 20 ans evedent and heipes generate sbstract conan, Nawhamaticel conceyss were expasinad systematically with munpre represurtations including aigebraic, graphical, ard verbo! fori. The instucins idemenstraiad strong peclagodical content knawiadgs by anticipating AnInoe student reisconcegtions and addressing thers prowctively - Fechnatogy integration enhances the earring experience, The inwinsctor used b eeoat cniexdatons anv mathematica: software to vigutéize scktions ent Trak raeveat cf snacks; is rp, fai, and imo, owes hes ere cs emp, tea A SSS, SS erty student calculations, Students had onpeetiaidies vt git! ts ere ease) Covlaborstive looming was esnphasizes through atracturwd gFouP probla sobving activities. Students worked in teams of tres to fou, tecroomngy, ickades varity, Dolan, NaGrAIG, GrOUD vemonstratin, efoctive pet Ietaiion and mathematics! dscouse, The Tovoherant, ue eX ah 6 Sam, nt, Brees, a tnatructor circulated to moniter progress ond provide tergate support"
    },
    {
        "image": "observation2_synth_16_aug5.png",
        "label": "observation",
        "ocr_text": "Paincia Thompson struction: & SURDRCT Mar: Shows vist FER Cow! th an i st of students: is RODUTAGES Aarti whasiees ard 5 ar ate and iced oF oy 8th ot mastery PLES rap 1, regularly mon Les28CU, fie, sad in POLYTE! CHNIC Uj PHILIPPINES 0 Masa. ants MIVERSITY of THE Classroom Chservatiog Porm HbjECt mation, C00 Is thera aTMeriCes main oles, Hon dynan was owdents aberect cx 0M; fpreSeotHtions inejy Semonstrated stars Stixient miscor MOREE with» nd Helped sonra neepstions sorapetina tons Meto Mania. The ins student fare aid verbal forms pt Kknoswlerige by a 9g tam prosetivaly A connecting ittsrenial eu COs enthusiggm tors FSStIN Ft om ations io 1d 08 nercelved oy muitiple The Ineuuctar usec Part previcies, PPRING calewtatons snd '@ 10 Visualize sohuticns ang PONG IMerSCs wth sucents, Shove Vorthy Student cateusati Hie For hep oy usiasm) PRACKINIS secmens Collaborative te Trough structured group mE tosching mete, ata ant problemesiving ae udenis worked in teams of threes to fou, tah tes woven roginsbon, group Gui: poet insina cays a tu Spieler eves} PSISI0 Gicuitor 12 mentor yrogrees an 4 provi The lesson conehated wiih SRESCHTATION {arnnlstes ote course 0° aston ean nine {earings saintsins oye con: ection, penn ition, arg sms a chess i condicive bs Oe, Sta Enigh) wocoming topiee Stic Spplication of concept SPEIOACH stigned wih 8 to es cotcorn 4 Synthesie actiy wave g omen that 'Ng ecenaiios. Cvareit pes sthucation eine CUNY the day s ea ening requis"
    },
    {
        "image": "observation2_synth_17_aug1.png",
        "label": "observation",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Kamo herve OnterCty Classroom Observation Form Ronnie Patel Course °5Y 201 Devetcomerta Paycratay November 04 2025 07 32M Instructor: Peer Observer: 227 White Date and Time Use criteria that apply to format of course observed. Review Section Description/ Comments The instructor began class punctually and established clear learrung objectives, 1 enegabopiaete nity o ‘aligned with the course syllabus Visual aids including PowerPomnt sides were shows ood ome ee hover prior oe well prepared and displayed professional formating Students were attente dunng Gemonstrates breed end depth of maser the introducton phase 2. ORGANIZATION Lecture content demonstrated strong subject matter expertise with current ‘examples from Philippine business landscape The instructor effectively integrated real world case studies trom Filipino companies like Jollibee and SM Panes dass at scheduled tne, regularly monstors on line Course) Corporation to illustrate marketing principles Classroom engagement was facilitated through strategic questioning 3. RAPOORT ux order wo ue we techniques. The instructor employed mix of lower order and higher feedback, encourages partopation; interacts with students, shows thinking questions, encouraging students to analyze scenarios rather than merely recall facts Wait time after questions was appropriate reac serwoos Student participation was consistently high throughout the session The me and instructor created an inclusive atmosphere where students: felt comfortable sharing ideas Filipino cultural examples were used effectively to make content soy ies examples that are Simple, dear, eos. 2° relatable and meaningful to leamers [Assessment methods were integrated throughout the lesson The instructor fhniques including exit tickets and quick polls to 5. PRESENTATION to used formative assessment tec concanee tive, helping gauge understanding Feedback was immediate and construc students identity areas for improvement"
    },
    {
        "image": "observation2_synth_17_aug2.png",
        "label": "observation",
        "ocr_text": "Use criterts thae apaty ty SURIECT Maren, show detorstrates bre, 2. ORGARIRE GH forganizes sty Ses 3 RaRPORY ints interest of stu, thack, enca 4 TEACHING Mereong fests relewies technology, inches vary ve eprops PRESENTATION festibisiies online course ce chase ‘corning: maintains eve contacts ueee V8 GOCKT command anes outages praper enunciatice, format ot Review Seeting conte AMtH ANS GapHh OF F, that are sie a fi tcencas preparation, 25; emp Y Bon cmmimariaes mann 6 fat, an importas; Meracts weit strats, Seairse observer, therevens DIS on ine JEN, Shey Hrijues, arn lagination, gro, I eteterr M0 endard Ergich ‘I Mees stated obras 82, and Wen\" eontuclve toy 2, siong the Invsoucta) Lecture center exampies fed roa thinking Merely rect fs, relatable and mo: mnt ones Used formatin gauge under! students went DE MANILA UNIVE with tne fin Phi nom engages The ins a questions, enc, iy A e68 for trap Baserbitlenj Coneshcag 8 SCtuaty ang extabiis, 290 $y decan es tudents were 1 phase domanstretad '@ sublect usitiess landscape wOFld case stuck Hiastrate marlor he instrsctoy effectively ino companies ikated through sirstegic questig ne rR 8 te Cf owsecnter ans tig 9 Students 2 Scenarios rathor th 5. Walt tne aft avestions was apropniate rough th clusive atraasphusra wine ‘omnfortabie tipine lively to make en arangtat roughout the lessen, S jncloding exit Modiate and ex provement Stent techitique 9 Feedback was i tuctive, helping ent"
    },
    {
        "image": "observation2_synth_17_aug3.png",
        "label": "observation",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Classroom Observation Form an criteria that empty to ioemat of course observed. nner Sees ee eared repmaa i Ths instuictor began clas punctuaily and estattisned cigar earning abiecdvox SURECT MATTER CONTENT ‘align: act ike Courze aviisbisn, Vinuat ains inchating PowerPoint ate: ‘shows gees cortmared and tnowtarge of subject marten; 5 well prepared and eae engostrates transit ant degch of mectary) feuieaoertecss jecluie content demonstrated strong sutiect zo s exarnpies from Phiigpine business far fcrgeaes wiStact matier; evdenes season, is trays, RASHES f i on TS cans NES) Gnbhasies ait sunanartes men prints, integrated real ed case sttien fom ORES Cast ut Schade te, reg Conoration to Siesteve muceeting 2 orvlesstonal formating, Students ware stisrlive during waiter expartisa with current cope. The instructs eflactivety ND Curpanies like Jollibes onct Std nay macrttors on line came ies, Cassioom anpagemant was facilitated thesegh strategic questioning 2 ae Rchiques. The instructor employed 3 mix of lower cater und Watser oday feedback, enanarages seri thicking questiers, enccsaging students to analyze sceneries rachor thas eethusiaso} Merely recall facis. Walt Hine efter questions wns appropiate, 4. SEARCHING MersiONS Shatent particinatin wes consistently nigh thaxghiout session. The fuses rekevaet tue metus, 206, x evn, techiigues, and nsirunter «1 ‘echnokigy iscaies variety, patna, iagintion, tavern; uses examples that are sitpte e porOpmite; stays ocused on anit ide! a inclusive a nusphare where wiudente felt comfsctable reap ple caltura excrsplen wars used effectively to make content Dreitom, wet ae sated ebierthaes) relatable end masninghé to leamers Assestitant matheds wars integrated thoughout the leeson The Srrronmact conducive t ed formative axsexsmort txchniegaes inching o 7 ates ere contact uses 2 dear velcs, rong huge understancing. Feedback wan immediate and Brokat, ecper eruciatin, and standin’ Engin Students iderdily areas for improvement 8 Instructor chats ard quick polis te teuctive, help"
    },
    {
        "image": "observation2_synth_17_aug4.png",
        "label": "observation",
        "ocr_text": "ATENEO DE MANIL: UNIV! SITy Kater Rew, Cut Classroom Observation Form PSY S01 Deveiipmental Payckoage Rirnnie barat instructor: 2OM? Pear Obsarvar, ame Mee Date anc Time Usa criterio that anply to teva’ of comme observed, 3 SURDECT MATTRI COnTENT Aligned with the course sytapus, vious! alas including PowerPoint sides were he intrasuction phase, Lectan conten demonstrated strong subject matier expe eee Lachap content demanateatad strony subj RA forgardans sublect matter; evidences srenaratic slates clenr ooectives eit Class 2 Sch He with erent Uneasy ‘ezainples from Phiizpine businesd landscape, The initrictor stfectively ree ak Bnd sunriariaes main soins, _ Integreted veal verid case studies from Flivine companies lice ed ie, cegubory e Mins eeut38] Comanmion to ltvstraty marketing principles datibes and a ae ‘Glasamcen engagement was facitiated through stratugic questioning RAPBORE bechvs (eae egy sere holds interest of stuctnts; 's repeat, fac, and impartial; provides, teigues. The instructor umedayed a min of sown tee and higher ender eestiach, anccasinges pavtiivalon: tracts vith edents, snes thinking questions, socouraging students fo analyze scenasios rather than emthusiasea) Merely rece tacts. Wait time after questions was appreatlate 4. TeacHiNG MerHOES Student pa (ese vstevant teaching aiethads, ait, ‘pation was consistertiy high thoughout the seasion, Tha reat hae, asi insictor crasic! an inciusive etmosphete whom students felt comtorabhe enka: midoves seit ba, Sraatin erp Shoviog Hees. Flizina cultural examples waco used atfeetively ta take conte pWONSESETR; uses maaingtes that are sbuple, lear peadee, ard etcble andr eamers, aopreptinie; says oowed on eral mente sated Copecries Teltable ae messingful ta ine i be Gey Assezamunt methuse wen ve integrated rawghout the lesson. The instructor remtconcicive te wos foralve assessment techniques incliing at tekols and suck pall te Sats hear vane, strong Seigs understanding. Faadhack was immediate and consinac thee, hai om, ee Stowers Enesiah Students Keniify aeess for improvement eilishes online onsree oF Classroom envitee °G, mainains eve creat: DRREEREON, prep EF emis"
    },
    {
        "image": "observation2_synth_17_aug5.png",
        "label": "observation",
        "ocr_text": "Figtion Convencets Review Section The Inetructer began class nunchiatiy ond establicn us. Visual als ine wail repay fanal f coduction phas Lecture content d vith current ively the ineinictor employed a iniv of tower igher ordat ruilents; fs seve vides scourngess participation: bn ts to analyze scenarios sather thai facts. Wait time alter questions was approprlat ation was consistently high thioughou the session. The an inclusive hiques, aad mogphers leas. Filipine cultural examny fal to learners, stated oh We ted throughuut th ESENTATION blishes online course or ciassecern en learning; maintains eye contact, uses 8 projection, peopel nysias including ¢"
    },
    {
        "image": "observation2_synth_18_aug1.png",
        "label": "observation",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS spate Sodevard Manta Classroom Observation Form lk David Torres Course ECE 203- Circut Anaiys Peer Observer: Robert Huang Date and Time October 14 2025, 10 24 AM Set Use criteria that apply to format of Course observed. f == =a Description Comments | 1. SUBJECT MATTER CONTENT ‘The instructor began class Punctually and established clear learning objectives. aligned wit te course sylabus. Visual aids including PowerPoint sides were well prepared and displayed professional formatting. Students were attentive during the introduction phase. 2. ORGANIZATION Lecture content demonstrated ‘strong subject matter expertise with current (oranies subject matter; evidences preparation; is thorough; €xamples from Philippine business landscape. The instructor effectively states clear objectives; emphasizes and summarizes main Points, _ integrated real world case studies from Filipino companies like Jollibee and SM meets class at scheduled time, regularly monitors on line course) Corporation to illustrate. marketing principles. str Classroom engagement was facilitated through strategic questioning techniques. The instructor. ‘employed a mix of lower order and higher order ids interest of students; is respectful, fair, and impartial; provides, . n mn fdiady ecco pepeae aoe ae thinking questions, encouraging students to analyze scenarios rather than | merely recall facts. Wait time after questions was appropriate meso Student participation was consistently high thoughout the session. The (jane teaching methods, aids, materials, techniques, and instructor created an inclusive atmosphere where students felt comfortable technology; includes variety, balance, imagination, group sharing ideas. Filipino cultural examples were used effectively to make content involvement; uses examples that are simple, dear, precse, and appropriate; stays focused on and meets stated objectives} relatable and meaningful to leemers. 7 — \"Assessment methods were integrated throughout the lesson. The instuctor * (eneaneone ‘course or classroom environment conducive to Used formative assessment techniques including exit tickets and quick polls to learning; maintains eye contact; uses a clear voice, strong ‘gauge understanding. Feedback was immediate and constructive, helping Projection, proper enunciation, and standard English) students identify areas for improvement."
    },
    {
        "image": "observation2_synth_18_aug2.png",
        "label": "observation",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Expaha Bosevars Manse Classroom Observation Form David Torres Course OE 203- Creut Anaiye Date and Time October 14 2025, 10 7 4 AM Peer Observer: Mevetiwre 2 Use criteria that apply to format of course observed. ‘The instructor began class punctually and established clear learning objectives 1. SURIECT MATTER COTE ow aligned wit the course syllabus. Visual aids including PowerPoint sides were (stows command knowledge of subject matter; ah and depth of well prepared and displayed professional formatting. Students were atientive during he introducton phase 2 cnesezaTz0n Lecture content demonstrated strong subject matter expertise with current (organizes subject matter; evidences preparation; ts thorough; ‘examples from Philippine business landscape. The instructor effectively ‘tates dear objectives; emphasizes and summarizes main points, Integrated real world case studies from Filipino companies like Jollibee and SM Tats oss at scheduled time, regularly manors on line COUNSe) Corporation to illustrate marketing principles. Classroom engagement was facilitated through strategic questioning (hate rest of students; respect, fe, and import; proves, CNnNeS The instructor employed mix of lower order and higher order feecack, encourages partiopaton; interact roves inking questions, encouraging students to analyze scenarios rather than wth students, ererusiasm) merely recall facts. Wait time after questions was appropriate 4. Tuce ETHODS Student participation was consistently high throughout the session. The Teer rarere techeg methods, ads, materials, techniques, and Instructor created an inclusive atmosphere where students felt comfortable technology; incudes variety, balance, ‘sharing ideas. Filipino cultural examples were used effectively to make content involvement; uses examgles that are simple, Gear, precise, and oechves) relatable and meaningful to learners Assessment methods were integrated throughout the lesson. The instructor 5S. PRESENTATION (ocubteres one course or dassroom environment conducive to used formative assessment techniques inchuding exit tickets and quick polls to learning, mantains eye contact, uses a Gear voce, strong: gauge understanding Feedback was immediate and constructive, helping ‘projection, proper enunciation, and standard English) students identify arves for"
    },
    {
        "image": "observation2_synth_18_aug3.png",
        "label": "observation",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Classroom Observation Form Davia Tones FORE instrsctor: _ Peer Observer: Reber rtussg Course Date and Time tsa ceteris that opaly te format of comran otcerved, ‘The iszhuctor been cass punctual ane solunlithed chiar teeming aujactves SURIECY MATTER coarsHT atigned with the coucas aytanus, Vi ton were {shows gose command are tnawlexige of subject yaatir; t prepered and dispieyed nesiesstonal fomating sues cee —— Gevmonsttenes brain an Cope ene wel prepared ant displayed omiosstenal formating, Students wees attendee during ine fouraduction shaze 2 ORGANECATEOR eee nt demonstrated strong sulact matter expertise with cunort {organises exert rome; evidraes prpaation; thane, ¢Xemples froma Philipping busines landscape. Tho inatructr ofectivaly states clese cblectivas; eciphanins end sum: nests cides at schedules tine, regusacy sor 8 main pots, tors ones course) ated maiwerd case studies (rom Fiipinw companies tke jolltbes ard SM ate Hustate mechating princizies, s. eayeoar Classroom erigag saspectitl, Fa inieracts with orudents, shows. thinking ques! strategic questioning impartiat: provides, ‘CboIGune. Thw instructor arnploynd a mix lf tove o der and tigher ewtor 3, encouraging students to analyze scenarios rather than maraly cecal facts, Winit tine ater gueations was enprcptiate 4. TACHING reTHODS ‘Stadent participation was consistently high twougeount the sorsion, Tha GBR ison teaching mathe, aids, matersis acheinies, ane lnsructor created a inclusive atmosphere where shuidents fat cemfestable engmlogy, ince warty, boerce, imagiration, grou | Sharing iduss. Faipine culiural examples were uned affactively to make content kav iss exumples thal one simple, clase, precise, and Shae ae alseons epprapiate; mays focused on end remets stated objected) Se 92 es hingt a lnserers Assesscment method: fe integrated Hout the lesson. The frst BS Ey Ser oats we inogrse oughont te fen hei Dishes ove cause or classroom envoraseit conduave to Sed feematien asaessment techni including ext ticket avid atic Ssurcong, wasains eye contact; ases 3 zee wine, trong gouge uniderstanding. Feedback wis immediate and constoat PmIRCON, prODe enkinistion, ane starcard English) HHudents Wentity aceas for Improvement tor palis we 4, hoping"
    },
    {
        "image": "observation2_synth_18_aug4.png",
        "label": "observation",
        "ocr_text": "Davis Torres server: Rove Muang es criteria that uppty to fommt of eatrse observes. Beaeriwiion/ Sacaments structor began class punctuntly avi ned with the course syiates, Wisusi aids incinding PowerPoint a well prepared and displayed profesional’ foampiting, Gascents wer ihe Intiatucdon phase febishes Clear earning oyeatas were e duting 1, SURDECT MATTER CONTENT oak coer arab keiowlectge of Sut demonstrates breadth and depin of mastery) matter ‘on onstrated strong subject matter expartina with currant ses iendecape. The instructor effectively itke Joithor and SM cure content de examples from Phitiggine bs sd case studies from 2. ORGANIZATION torganizes sublect matter, evides: reparation; is thorough 5 and suiruavizes iain gine, ily montars online comes) fiping compania! questioning ayed a mix of lawsrordar and higher exter aging siudents to analyze sesnarics rather than ime after questions was appropriate, styclents; le respe ‘encourages partiagation: bn\" questions, encou merely recall Escts, Walt sien, The fal comiediable ely to make content pout the on was consistantly high thea jusive atmesplere whe ituval examples ware used effecth 4. TRACHING METHODS Sturteré par (user relevant tauching methods, aids, ester insinsctor created en in technciogy: includes variety, bafance, imagination, group sharing ideas. Fiigine avoiveinent: uses wxamples that are simple, dex, pecse, 80 estolle and meanirighul 10 hearer aporopriate; stays focused en and meets stated objectives} Tetatable anal mesningtul to eamers. vegrated thenughaut the lessen. The mstnuc saitae oF chassioom: aewiretmnt conducive to chniques incluting exit takes and quick gat te a dear veirg, strong gauge understanding. Fendback was immadiate and constartive, helping tanetardl Egil) students identify areas for ieproverent 8. PRESEWTANRON -ctabishes onli fearing; maitans eye contact; ase projection, groper er"
    },
    {
        "image": "observation2_synth_18_aug5.png",
        "label": "observation",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS agate Gesu na Classroom Observation Form Davia Toes “The insicuce began class punciualry and estabitshes Chas toamig ebpaceves aligned wits the coutse atste, Visual ait inchiding Paar aint Sikes wore weet: prepare ani dwsplzyed professional formatting, Stadents were alleriive sseiNG te bimetckon phase. trated etong sublet matior expertise with cument ine business iandecans, The instructor affectivaly Jno companies Hike Jollibe0 suse content Germs ORGANTENTION sor idnces ranean; storage Sample Kom PPI 2. ORBAREEATION 1d SM case ties from Pit ng pain Classroom engagement was factitated vhvough stiatogis questioning 3. RAPRORT T : techniques. Tha instrastor einployed a tnix of tower ceder and Fr ter Sate nrvrest af siden; i respect, fas, aad impart aosides, ha instructor employed ower orden ond Higher fiaike siete Slages partonstion, ciara vith stents, eraaws Winking questions, oncos8gNg students to analyze scenatine rather thant i focls, Walt time after questions was aporoprint. crete inesaly 0 4 TEACHING METHSOS ‘Shutent pasticipation wae consistently ight Uougheut the session, The instructor created an inclusive atmosphere where elothents fek comfortable fuses reevart teaching eadtants, kts, materials, RecrCEgEES, aN inchackigy, incudes vaeesy, balance, sraqinaton, gt oles that are septe, door, erect cats stan sbjeetives las ware used effectively ta moka contont sharing ideas Filipina cukurel ena we efataie one meeningiul to learners Assessment inetods wee integrated throug 5. PRESENTATION ee PRESENTATION ae cnsrcem emitccmnentconduree to NEe¥ Temiativa sasesorert techie including 18 Heke laying; mavtains eye contacts oes kar voice. song gauge undersinnding. Feedback wae immeciate ant corti promlicn, proper eownesation, and slandard English) Stogents tently areas for improvement"
    },
    {
        "image": "observation2_synth_19_aug1.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THe PHILIPPINES Aras Sues, Sant Mean tacos Classroom Observation Form Instructor; Remand Bates Course EHS 192 Tecra Wing Date ang Laboratory va Sen of the session dorcnssating 1 SuncBer sate conreut fc instructors commment yp ‘ShiddOnt wettore, Pecgun, {fhe Gocd enaed and koaedoe of ‘abinct matin rn demonstrates teeacah aed dentine Prater) reAOCHIOS ernst Sy Ulbized! by ait sites ae taaneataey stored tne scientific practices ‘he expevimarta’ design was cols jctlaned wit pa stop instruetune irene SR Okie; emhasiom ash ee sine Gants Undeeating ofthe selentiy (risthod and were able to for NGS Case Sade tne, ruey mee Gino cours} eccthenee Hot ter quailty inticntnge Dla collection procedures wens Systemat Shoseres omg 3 RepeoRT epoveaeiate mvasneon on Tecaitfed nivseivations in ccannired Feeney mspectt, ta, 284 Sober, geomicies, PREECE “ Reshack, erecsrages coniapaties ‘erect wih ehatonts, Sew Horst fetaboaks. The ir nd attention to srtsias5) etal In scientific work, 4 TEACHING METHODS (esisis ioeemonsted statstion thinks 'G Ani WoRNats For rice, erent tees, and nderathaaee Sclonce students. Students achat: ines Bakerce, mesnation, eras Slater, seed compare their Findings te worse wolvemert: uses {bt oe ihe, cae, orate, ant Philippine Depastinert of Enns eeropia; atays foctied oo net meats tates bert) PPPS Depstiness of Em S$. PRESENTATION (ota The lostrsctiy 0 se ote coms Merle laboratory f SS 6 real wert arelrcrmentet fesues is Sreon exibcamant cantvene ty inthe bs Upfited, inciucing petit in Marita 33y ae sour svar systume, Sesening: matctains 9: contacts uses cee Yikes. strong This Cortextuatizetion halocd st APECiate the POI, Roper enuesiation, ang Strand Enis scloriifie ‘telawance of their"
    },
    {
        "image": "observation2_synth_19_aug2.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES fooras Steet, Sata Mesa, Mansa Classroom Observation Form Instructor; Raymond Miles Peer Observer: Sarah Mason Course ENG 102- Technical Wing Date and Time October 15, 2025, 03 59 PM Use criteria that apply to format of course observed, sa Soci 1. SUBJECT MATTER CONTENT (shows good command and demonstrates breadt norledge of subject matter; th and depth of mastery) nected laboratory findings cesronment conducive tg in the Philippines, eve contact; uses a clear voice, This Contextualization Proper enunciation, and ‘standard English) r"
    },
    {
        "image": "observation2_synth_19_aug3.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Aoonas Set, Santa Mesa, Manta Classroom Observation Form Raymond Miles ENG 102- Technical Writing Instructor: Course peaitssyen SEEMED Date and Time Otter 15 2025, 0359 PM Use criteria that apply to format of course observed. j Review Section Description Comments Laboratory safety protocols were reviewed at the start of the session, demonstrating 1. SUBJECT MATTER CONTENT the instructor s commitment to student welfare. Personal protective equipment was (shows good command and knowledge of subject matter; rier rerete esti ed cect properly utilized by all students, and laboratory procedures followed standard scientific practices. 2 GRee The experimental design was clearly explained with step by step instructions \"(organizes subject matter; evidences preparation; Is thorough; provided both verbally and in written format. Students demonstrated states clear objectives; emphasizes and summarizes main points, understanding of the scientific method and were able to formulate testable meets class at scheduled time, regularly monitors on line course) hypotheses about water quality indicators. Data collection procedures were systematic and accurate. Students used RAPPORT (holds nterest of students; is respectful, fair and impartial provides, 2PProPrate measurement tools and recorded observations in organized feedback, encourages participation; interacts with students, shows laboratory notebooks. The instructor emphasized precision and attention to enthusiasm) detail in scientific work 4. EGIL Analysis of results incorporated statistical thinking appropriate for (uses relevant teaching methods, aids, materials, techniques, and undergraduate science students. Students calculated means, standard technology; includes variety, balance, imagination, group deviations, and compared their findings to water quality standards set by the involvement; uses examples that are simple, clear, precise, and ea a ee eae eal eae One Philippine Department of Environment and Natural Resources. The instructor connected laboratory findings to real world environmental issues 5. PRESENTATION (establishes online course or classroom environment conducive to\" the Philippines, including pollution in Manila Bay and major river systems. learning; maintains eye contact; uses a clear voice, strong This contextualization helped students appreciate the relevance of their projection, proper enunciation, and standard English) carrer ancien"
    },
    {
        "image": "observation2_synth_19_aug4.png",
        "label": "observation",
        "ocr_text": "POLYTECH IC UNIVERSITY OF THE PHILIPPINES proaee Deeet rea rt Classroom Observation Farm z z ee S Renwigtion Commcats L (aborstory safety protocols were reviewed af fhe siart of the season, damonsiating 1 SuBRECY ReTreR CONTENT the instustors oomeimant lo stent weltane, Personal potective aquin er oe eens Sroparty uted bya sunens, ad aboratey procedures flowed smears scieatiic practi ‘The exporinental dewign vas cheaaly expiainad y inst CE) he exposeontal desion nas cleety exaivad wit action (organizes subject matter; evidences preparatien; ix Puenuat: provided both verbally are ip vaitten feast. Stusesis denianstrated totes dear objectives; emphusines anxt wornmariase main points, acientific methcd and were able te formulate testable Eypothenes ebovt water quality indicators monte clans at srheriulad time, capulaty ssontors aeidne enurae) Jeta collection procedizes ware systemsthe: art accurate, Studuols ined Ssppreptiate meesurenvint tools arsi mcenscat chazeyatians in organized sboratory notebooks. The inatructor emphusized pewcision and attention i 2 RARPORE (hos interest of studons: is rewpae: feedback, encourages participation, i, fai, 20 lempaetal, pe0 teracis win stovents, chase smthuisiasn) dotat in scientific work 4, TENCNING HeTNODS Analysis of reaxite Sncopacated statiztical shinking appropriate for (uses reievans tearing methods, aide, mateciils, tocnraqua, and aatgraduate science students, Stsderis caleweted mears, starviand wechasiogy, inches variety, balance, imagination, group devia acl compere thy indings to waster quailty standuds se? by the Phiigaine Department af Env tual Remaarces, inoctiewser une exiinpion that are Sete, cee Sx erpmopriate; stay focused on and mente aater o PaRsewrarion The (EES connected inSontury Rrelngs to real world envitormental inves [astabiiches ovline course or ckusmncmn wironment coaducive tot the Phitippt ing polidion ir Manila Bay snd major river systems, leaning; maintain, eye coningt: ween 8 dear vale. 2 cestientustizalinn irlped students appreniate rejection, propa: enunesstion, and steculand Eouist} ernie eGo"
    },
    {
        "image": "observation2_synth_19_aug5.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC. UNIVERSITY OF THE PHILIPPINES ‘peonas Steet, Santa Mesa, Mania Classroom Observation Form course 24 12 Tecmo ins per 15, 2025, 03: 59 PM rnetructor: Remon wes peer Observer, Satan Mason pate and Time 2 Description Comments Laboratory safety protocols were reviewed at he start ofthe Session. demonstrating 1. SUBJECT MATTER CONTENT the instructors commitment 10 student welfare. Personal protective equipmentwas rd and kre of SubJct MANET: properly uiized by all students, nana laboratory procedures flowed standard scientific practices. instructions {shows good comma 24 <Preatt and depth of mastery) explained with step by steP it demonstra The experimental design was cleatly 2 ORGANIZATIC ORGter subject mater, evens ration; is thorough provided both verbally and in writen format. Students demonstrated states dear objectives; ‘emphasizes and summarizes main points, understanding of the scientific method and were able to formulate testable tes joss at scheduled te, regulary suitors on ine course) hypotheses pout water quality indicators 5 ar Data collection procedures were systematic and accurate, Students used 7 ber DRT sto students ua and imprint rede appropriate measurement tools and recorded observations in organized feedback, encourages ‘participation; interacts sith students, shows laboratory notebooks. The instructor emphasized precision and attention to enthusiasm) detail in scientific work. 4. TEACHING METHODS Analysis of results incorporated statistical thinking appropriate for (uses relevant ‘teaching methods, aids, materials, techniques, and ur juate science students. ‘Students calculated means, standard tela cs baonc, imagratin, FOP and vfevations, and compared their findings to water quality standards set By the involvement; ariel that are simple, eat, Precise an inom ye toased on ane me le, ea eaves) Philippine Department of Environment and Natural Resources. 5. PRESENTATION “The instructor connected laboratory findings {o real world environmental isSUeS Restabishes online course oF cjassroom environment conduc tO in the Philippines, including pollution in Manila Bay ‘and major river systems. {Gemning; maintains eye contact voce ‘a dear voice, Strong This contextualization helped students appreciate the relevance of their nd standard Engish) scientific work to national concems wunciation, at"
    },
    {
        "image": "observation2_synth_20_aug1.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES ‘Anonas Steet, Santa Mesa, Mania Classroom Observation Form Instructor; _Themas Smith Course CHEM 205 Environmental Chemistry Lab Peer Observer: Christine Alexander a Use criteria that apply to format of course observed. Date and Time November 07, 2025, [Review Section 1. SUBJECT MATTER CONTENT (shows good command and knowledge of subject matter; demonstrates breadth and depth of mastery) 2. ORGANIZATION (organizes subject matter; evidences preparation; is thorough; states clear objectives; emphasizes and summarizes main points, ‘meets class at scheduled time, regularly monitors on line course) 3. RAPPORT —______Deseription Comments Laboratory safety protocols were reviewed at the start of the session, demonstrating the instructor s commitment to student welfare. Personal protective equipment was property utilized by all students, and laboratory procedures followed standard scientific practices. The experimental design was clearly explained with step by step instructions Provided both verbally and in written format. Students demonstrated understanding of the scientific method and were able to formulate testable hypotheses about water quality indicators. Data collection procedures were systematic and accurate. Students used Gekss niet orcanene en I, fair, and impartial; provides, @PPrOPriate measurement tools and recorded observations in organized feedback, encourages participation; interacts with students, shows enthusiasm) 4. TEACHING METHODS (uses relevant teaching methods, aids, materials, techniques, and. technology; includes variety, balance, imagination, group involvement; uses examples that are simple, clear, precise, and appropriate; stays focused on and meets stated objectives) 5. PRESENTATION (€stablishes online course or classroom environment conducive to learning; maintains eye contact; uses a clear voice, strong projection, proper enunciation, and standard English) laboratory notebooks. The instructor emphasized precision and attention to detail in scientific work. Analysis of results incorporated statistical thinking appropriate for undergraduate science students. Students calculated means, standard deviations, and compared their findings to water quality standards set by the Philippine Department of Environment and Natural Resources The instructor connected laboratory findings to real world environmental issues in the Philippines, including pollution in Manila Bay and major river systems. This contextualization helped students appreciate the relevance of their Scientific work to national concems."
    },
    {
        "image": "observation2_synth_20_aug2.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE. PHILIPPINES ‘Anonas Steet, Santa Mesa, Mania Classroom Observation Form (CHEM 205 Environmental Chemistry Lab Instructor: Tomas smith a Peer Observer: _Chvstne Alexander Date and Time November 07, 2025, 01 46 AM Use criteria that apply to format of course observed. E ~__ Review Section - ___ Description Comments | | Laboratory safety protocols were reviewed at he start of the session, demonstrating A somes MATTER spelled of the instructor s commitment to student welfare. Personal protective equipment was (shows good command and knowledge of subject matter; (grows good cmc ond Gogh of teasery) property utilized by all students, and laboratory procedures followed standard a scientific practices, “The experimental design was clearly explained with step by step instructions 2. ORGANIZATION basse provided both verbally and in written format. Students demonstrated {organizes subject matter; evidences preparation; is thorough; orarear objectives; emphasizes and summarizes main points, understanding of the scientific method and were able to formulate testable meets class at scheduled time, regularly monitors on line course) hypotheses about water quality indicators. Data collection procedures were systematic and accurate, Students used 3. RAPPORT appropriate measurement tools and recorded observations in organized [holds interest of students; is respectful, far, and impartial; provides (nol interest of sts ntracs with Students, shows, 'aboratory notebooks. The instructor emphasized precision and attention to detail in scientific work enthusiasm) 4, TEACHING METHODS ‘Analysis of results incorporated statistical thinking appropriate for © GoStelevant teaching methods, aids, materials, techniques, and undergraduate science students, Students calculated means, standard technology; includes variety, balance, imagination, group deviations, and compared thelr findings to water quality standards set by the involvement; uses examples that are simple, clear, precise, and i aoe ratey stay focused on and meets stated objectives) Philippine Department of Environment and Natural Resources. | =a The instrctr comected laboratory findings to real world environmental issues (eeblehes onine course or dassroom environment conducive to in the Philippines, including pollution in Manila Bay and major river systems. learning; maintains eye contact; uses a clear voice, strong This contextualization helped students appreciate the relevance of their projection, proper enunciation, and standard English) scientific work to national concems."
    },
    {
        "image": "observation2_synth_20_aug3.png",
        "label": "observation",
        "ocr_text": "instructor: Peer Obsever: Use eeiterta that apply t0 format of couse observed. ES POLYTECHNIC UNIVERSITY S sacra Steet Soot Masa, te Classroom Observation Form Thomas Smvtn Chneting Alexander Rewieds Section SURIECT MATTER CONTENT ‘shane goat Unerinand an Knowledge of sul Slamoneoaees beady ai depth of musstery’ 2 matter; ORBANTZATION (eaganiaes sutjent matter, evidences prepacatinn, ie Uneough, afaey main points, fine course) aappoay Cnids inerest of a inquatton: provides ‘endhiack, encourages. part wih stadents, shows fuses ree eles, materia, rechniques, aoc fecwmotogy; incuelas variety, Palace, smagination, oF ievalvernent ames examyses that are singe, daar, evecise, and appropriate; slays tecused on arel anole stated chjactives} PRUGENYAT ICN sstablishes onlioe course or clessroam enwicanment ponéucive to ingy maintains eve eontact; Goat yore, sirong Hon, oroper enunciation, and Manded English) Course 5 fate and Tine Latoiatory sete rn i properly ullizer by al sce The pinvider! both verbally and in wditen format, Students demonstrat CHEN 208 Brvronsneniy Chenery Lae Howeimber 27, 2028, 07 48 AA Dekriation Commants dott oe ana protective equipment was sect iandard iigtructar s cove ntiae practoe og insteuctions experimental dasign was cleaty explain est ing of ihe scientific method ant were able to formutats testable understand nypad indicators Dela calisotion procedures were systematic and accurate, Students used apesopriate Analysis of ves asirerrent tucis end recorded observations in organized zed precision and attention te The notaries enephes atory notebook sclentific work, incorporated statistlest teinking apy uanjenraduate science students, Students calculeted means, standard de Phitepine Depanmee The ‘ations, and carspared their findings to water quatlty standards set by the of Envirament and Notund Resources instructor ippines, ireluding poll 1 helped students appreciate the relevance of their scientific werk to nations conceme"
    },
    {
        "image": "observation2_synth_20_aug4.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY CF THE PHIUIPRINES Setatne garyation Farnt 205. Rayon hema U2 25 0146 AM pours Dees Classream Ob: [= Thontas Sein instructors. Qoserver: ining hexane tive citeria that apply to ferenat OF course sbsarvad. wre raviewad al mig sat ote obssion, demons pice Lanorater ihe inst 2, Parsonal protentve Reb reo foowed siandard SURUECT MATTER CONTERT {uns goed comma and essed of SSS ‘et, on cits ancl lags mt raneteCY) ek selenite derenstrales acy explained wih step by st60 Ins aten format Stuckents: demonstrated: ‘and were able to formulate estshe 2 experiential resided both verbally and in ay OF re clentific methott spout waator quay indicate 2. ORGANTEATENE mater, evi eqeptnsaes nen preancation 1 8 E pred sumone 10 pe undorstansi meobors oveling course? hypothese an accurate. Students wed ng in organized a) aysteml recorded observati -psized precision a8 thon procedures dag, MHPIMPS RBS ent tools 2 jaboratory natabooks. The tastauctar oF fie work Gate cotta tention to paper venerest of fecdhaek, eeoUrege exttnasias) 5 incorporated statistical tin Analysis of ros! eamques, ard undargadusta selene ‘tudants, Students calcuiated Means, finenge to water cualty standards acs compared thelr te OM doviations, 2 enpie, cleat, Pres ment af Environenets and Natural Flesources. ed cvs) mental IsB88 ecto laboratcey lndings 0 real werd one 2 Piitippines, including gotition in Maas Bay ant me vo vontexuisizetion nelpes tacos appeneiste the relevean sig work te national concerns. iver systems. 5, PRESENTATION fine our Teoraing, mageaaing ave contac: SC projection, proper counsel, an So seler a Gast 8 a sleze vos, Sig"
    },
    {
        "image": "observation2_synth_20_aug5.png",
        "label": "observation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Ancran See. Sart ene. Santa Classroom Observation Form Instructor; Tomas Seu Course CHEM 205 Envircnmental Chematry Lab Peer Observer: Chratne Alexancer Date and Time November 07, 2025, 01 46 AM ee Use criteria that apply to format of course observed. Laboratory safety protocols were reviewed at the start of the session, demonstrating 1. SUBJECT MATTER CONTENT a he instructors commitment io student weltare Personal protectve equipment was, ttf nd ved pmove yirpmany eee Property utlized by all students, and laboratory procedures followed standard scientific practices: 2. oneammzarion The experimental design was clearly explained with step by step instructions (organizes subject matter; evidences preparation; és thorough; Provided both verbally and in written format. Students demonstrated ‘states dear ‘objectives; emphasizes and summarizes main points, _ understanding of the scientific method and were able to formulate testable meets dase at scheduled time, reguery monitors on ine course) hypotheses about water quality indicators 3. Data collection procedures were systematic and accurate ‘Students used \"(holds interest of students; is respect, fa, and impartist; provides, °PP PHiate measurement tools and recorded observations in organized encourages participation, interacts with students, shows 7S Analysis of results incorporated statistical thinking appropriate for technology; indudes variety, balance, imagination, group eviations, and compared their findings to water quality standards set by the involvement; uses ‘that are simple, dear, precise, and topping sure eenad ented oat aanioe| Philippine Department of Environment and Natural Resources = “The instructor connected laboratory findings to real world environmental issues in the Philippines, including pollution in Manila Bay and major river systems. (establishes online course or dassroom environment conducive to teaming; maintains eye contact; uses Gear vow, sv0 g This contextualization helped students appreciate the relevance oftheir ‘Projection, proper enunciation, and standard English) Scientific work to national concems."
    }
]