[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE OB (OT) TRAINING RVALUGTION FORM of the couracy and efficiency rat materials (She maintained ae sneod sprovement in handling He showed i entry fasks. stance and d: aponsibitity managed har time well and pedule. ainee displayed good skills when assisting ary visifors. sted weit ‘ot libiary s The tr t interpersor: + fibre Re adapted vamned tt the fs a for graduation fo: on of the company thet related to g (SMA NE I {"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUST OR TNE G08 ONT VOURAMIRS GS EVALUATION FORM Be. QUESTION i a TUTOwAL EVAIUATION a 1 Red accuracy and efficiency 1 be 7 te encoding hbrary materials i boy! Showed inprovoment in handling Dye 1 Hl t fesearcn assistance and enty tasks 7 7 i She showed 7 s@ of esponsibility i tp aoe Hl ighed Gaines, i 7% i jad = =. 44- i 4 | She managed her ime well and ; 4 completed her duties on $c! ai i Hl The hainee displayed gooc i ot, | ) tnlerpersonal skills when ass: HiNG i i i oe fibrary visitors - ! haines adjusted welt to the fidrar H | - work eryviroAment and rontiaes 1 -t4 + (He adapted quickly tor f H H —.. edined the library system _—! iol oe Oe ee Commmenty/ the OUT trun ed for gra PAUL tS yand reyulation of the caimaany that t. histber cowrne is, Shielded Metal Aco Weld, rg (SMAWWNS IL i"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OJT) TRAINING EVALUATION FORM Dear Trainees: The following questionnaire is designed to evaluate the effectiveness of the Supervised Industry Training (SIT) or On the Job Training (OJT) you had with your Industry Partners. Please check the appropriate box corresponding to your rating for each question asked. The results of this evaluation shall serve as a basis for improving the design and management of the SIT in SICAT to maximize the benefits of the said Program. Thank you for your cooperation. LEGEND: 5 Outstanding 4- Very Good/ Very Satisfactory 3 Good Adequate 2 Fair/ Satisfactory 1 Poor Unsatisfactory NA Not Applicable ITEM No, QUESTION RATINGS INSTITUTIONAL EVALUATION 1 2 3 4 5s [na 1 |She maintained accuracy and efficiency v in encoding library materials. 2 He showed improvement in handling research assistance and data entry tasks. (0 She showed a strong sense of responsibil 2 in performing assigned duties. J a 4 She managed her time well and 2 completed her duties on schedule. 3 He maintained a courteous attitude when assisting library v Patrons. The trainee displayed good ce interpersonal skills when assisting as library visitors. a 7 The trainee adjusted well to the library s v +} __ work environment and routines. s |He adapted quickly to new tasks and v |_____| learned the library system efficiently. Comments Suggestions: The OUT trainee is recommended for graduation for he she Pulfill the requirement of safety and regulation of the company that related to his her course in Shielded Metal Arc Welding (SMAW) NC II."
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING RLTME JOR (ONT) TRAINING EVALUATION FORM questionnaire is desi Lars, se chi the benefits RATINGS in encoding dg assisting Me adapted quickly to new tasks and \\_ _ jiearned the tibi am effici (Comaionts/ Suggestions: [Phe GUT trainee is recommended for graduation for he uhe i Fulfill the requirement of vafety and cegulation of the company that celaied te [his her course In Shiclded Metal Are Welding (GMAW) SS U. 1"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OJT) TRAINING EVALUATION FORM Dear Trainees _____The following questionnaire ss designed to evaluate the effects Supervised Industry Training [SIT] or On the Job Training [OJT| you Industry Partners Please check the appropriate box corresponding to y The results of this evaluation shall serve as a basis for improving each question asked the design and management of the SIT in SICAT to maximize the bene! Program Thank you for your cooperation weness of the had with your your rating for fits of the said LEGEND 5 Outstanding 4 Very Good/ Very Satisfactory 3 Good /Adequate 2 — Fair/ Satisfactory 1 — Poor Unsatisfactory NA Not Applicable ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION 1 3 4 She maintained accuracy and efficiency in encoding library materials. + v He showed improvement in handlin research assistance and data entry tasks. |} She showed a strong sense of responsibility in performing assigned duties. 4 | She managed her time well and v completed her duties on. schedule _| | 41 ermantaned a coe aUude when asss8G ay v al oars | | The trainee displayed good v interpersonal skills when assisting library visitors | | ~— |The trainee adjusted well to the library s work environment and routines new tasks and s He adapted quickly to learned the library system efficiently. 1 Comments/ Suggestions: The OUT trainee is recommended for graduation for he she Fulfill the requirement of safety and regulation of the compan: his her course in Shielded Metal Are ‘Welding (SMAW NC IT. y that related to"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OJT) TRAINING EVALUATION FORM Dear Trainees: ed to evaluate the effectiveness of the Supervised Industry Training (SIT) or On the Job Training (OUT) you had with your Industry Partners. Please check the appropriate box corresponding to yer rating for Reh question asked. The results of this evaluation shall serve as a basis for improving the design and management of the SIT in SICAT to maximize the benefits of the said Program. Thank you for your cooperation. The following questionnaire is design LEGEND: 5 o- Outstanding 4 Very Good/ Very Satisfactory 3 Good Adequate 2- Fair/ Satisfactory 1 Poor Unsatisfactory NA Not Applicable ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION 1 2 3 4 5 NA The student performed duties res| nsibly v and showed dedication to her role. | She showed a positive attitude and eagerness to leam throughout the training period. 5 She showed a strong sense of responsibility v in performing assigned duties. The student performed all assigned tasks v éfficiently and with a positive attitude. 5 He showed intiative in suggesting ways to improve book Vv ‘organization. The student performed all assigned v duties with dedication and efficiency. The student showed consistency in performing daily library tasks. The trainee completed assigned v tasks accurately and on time. Comments Suggestions: The OJT trainee is recommended for graduation for he she Fulfill the requirement of safety and regulation of the compan: his her course in Shielded Metal Arc Welding (SMAW) NC 1. y that related to"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "ojt",
        "ocr_text": "gure RyiseD repusTR TAAUIRG PRATT ALUATION FORM ou THETOB (OUT) 8 heck, the approprial this eval tude and eagerness gq perk nt performed all assigned efficiency. The studer dedication anc iduties with “Ty Loa The student show od ons li perforin’ dally 168 completed assigned \\ tasks accurately and on dime. ake} Sagyoeons eaded for gswination fr faty acid rergisiation, at are bela , recomen rutsilt the requirement af 8 panftrox couene Shielded Met"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAIN ON TRE JO® (QUT! TRAINING EVALUA! Daar Trainess. fonasin gz {SIT} check. the appropriate b The student performed duties respor i showers cation to her role. rowed 2 song sense of re: po in perfarming a signed duties, fave BOK beet T 5 The student performed ail assigned i duties with dedication and efficiency | The student showed consistency in J performing daily brary tasks. 9 |The trainee completed assigned —| tasks accurately and on tit amtacuts/ taggestions [The OUT traince in seeommmended for graduation for he she Fulfill the requirement of safety and regulation of the company that related to [Ris hor course in Shielded Metal Ave Velding (SMATA NC 1. i i"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OJT) TRAINING EVALUATION FORM Dear Trainees: The following questionnaire is designed to evaluate the effectivencss fa (5 Supervised Industry Training (SIT) or On the Job Training (OJT] you ha a y xe Industry Partners. Please check the appropriate box corresponding to your rating each question asked. The results of this evaluation shall serve as a basis for ee the design and management of the SIT in SICAT to maximize the benefits of the sai Program. Thank you for your cooperation LEGEND: 5 Outstanding 4 Very Good/ Very Satisfactory 3 Good /Adequate 2 Fair/ Satisfactory 1 Poor Unsatisfactory NA Not Applicable ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION 1 2 3 4 5 |Na 1 The student performed duties responsibly v and showed dedication to her role. 2 _ She showed a positive attitude and eagerness v to leam throughout the training period 3 She showed a strong sense of responsibility in performing assigned duties. A 4 The student performed all assigned tasks v efficiently and with a positive attitude. He showed intiatve in suggesting ways to improve book ‘organvzation, 4 6 The student performed all assigned duties with dedication and efficiency. i“ 7 The student showed consistency in performing daily library teske, s |The trainee completed assigned v tasks accurately and on time. Comments Suggestions: The Teneraince is recommended for graduation for he she Fulfill the requirement of safety and regulation of th his her course in Shielded Metal Arc Welding (sMavy ee eas"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "ojt",
        "ocr_text": "wpUSTRY TRARING AVIATION FORM ‘SUPE! ON THEVOR {ONT TRAINING BY! Dear Trainees: e the effectivences of the ONT} you had with your nding te your rating for faz basis for impreving the benefits of the sud The following question igned to wraluat Supervised industry Training he Job Training Industry Partners. Please oF cic the appropriate bex correspe aach question sxked. The aiuation shall serve the design and manage SICAT te maximise Program. Thanks you for your cooperation. naire is desi {iT} or On t LEGEND: 4 Cutetanding Yary Geod/ Very Satisfactory 3 Good /Adequete Foir/ Satisfactory 3 — Peor Unsatisinctory RA Not Applicable 2- 2 She showed positive alitude ant eagerness She Seam tnroughout the taining per at 3 I the student performed all assigned 7 5 ines with dedication and Siewncy. | Oe eee OT {The student performed all assigned tasks T 4. efficient positive attitude. ——}———r-~ 1 ‘duties consistency in z + The student showed [= performing daily library tasks. | he trainee completed assigned | le sks accurately and on time. —— Livi \\ tive ONT teaines is reenoumanded for graduation fox he she regulation of the compan7 that related to Welding (SMAW) HE A i} _ oo"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OUT) TRAINING EVALUATION FORM Dear Trainees: The following question effectiveness of the Supervised Industry Training uu had with your Industry Partners. Please check the appropriate box corresponding to your rating for each question asked. The results of this evaluation ‘shall serve as a basis for improving the design and management of the SIT in SICAT to maximize the benefits of the said Program. Thank you for your cooperation. LEGEND: Outstanding 4 Very Good/ Very Satisfactory 3 Good Adequate 2 Fair/ Satisfactory 1 Poor Unsatisfactory NA Not Applicable ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION +]2 3 4 5 8A 1 _ The student showed great interest in learning v new library systems and procedures. The student showed excellent performance 2 and dedication during the OUT. She completed v tasks efficiently and on time. The student worked well independently v ‘and finished tasks efficiently. She managed her time well and ic completed her duties on schedule. 5s “The trainee quickly leamed how to us the library s cataloging v L ‘system IE | He followed instructions carefully v |and required minimal supervision. it 7 The student showed consistency in v T performing daily library tasks. _ s |He showed initiative in assisting v library, users with their needs. Comments Suggestions: commended for graduation for he she of safety and regulation of the company that related to ded Metal Arc Welding (SMAW) NC II. The OUT trainee is re! Fulfill the requirement! his her course in Shie"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED IGDUSTAY TRAINIEG ON TRE JOR (OUT} TRAMMING EVSLUATION FORM QUesTiON INSTITUTIONAL EVALUATION {excelent perormance the OJT. She oan time. at worked weil ind ang finished tasks eff He followed instructions carefuily nd required minimal supervision. The student showed con: icy in i as erforming daily library tasks. _ He showed initiative in assisting leet uk ry users with their needs. 1 Comsaente/ Suggest a9 [The GUT trainee is recommended for graduation for he she Fait the requirement of safety wa regulation of the eumpany that selated to i Biever sourse inn Shivkded Metal Are Wilding (9MAT) NC iL."
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OJT) TRAINING EVALUATION FORM Dear Trainees: LEGEND: 5 Outstanding 4 Very Good/ Very Satisfactory 3 Good Adequate 2 Pair/ Satisfactory 1 Poor Unsatisfactory NA Not Applicable ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION 1 2 3 4 [sna 1 _| The student showed great interest in learning v new library systems and procedures The student showed excellent performance and dedication during the OJT. She completed v tasks efficiently and on time. 3 The student worked well independently and finished tasks efficiently. ‘4 4 She managed her time well and v completed her duties on schedule. 5 _ Tettainee quickly leaned how to use the isray s cataloging a system. 6 He followed instructions carefully v and required minimal supervision. 7 The student showed consistency in v Performing daily library tasks. s He showed initiative in assisting v library users with their needs. Comments Suggestions: is recommended for graduation for he she Fulfill the requirement of safety and regulation of the company that related to his her course in Shielded Metal Arc Welding (SMAW NC II."
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "ojt",
        "ocr_text": "CY TRATES VALUATION FORM SUPERVISED MICUSTE OW THE JON (O8T} TRADING B Dear Traineer ry Pertn 2 appropriate question sated. The rem iuatio: cnet eae LEGEND: j great intorest in learning rooster well independent! dent worked E ciendy. 3 finished b She man: completed Per cuties use t Ping panane qutenty texted He followed, instructions carefully nd required rrinimal supervision. at showed consistency 1 performing dal dbrary tasks: He showed initiative in assisting L. L fibrary users with heir needs. 'Samments: Sug gentions: The siucer iow tor hesahe tion nf the eoeoP am! fre VEIN ered we i. H 2 recommended fas grade: snent of safety snd eum gp thet related to Gaishded Metal lates Quy traisce 4 Peiall the swacize [binfher course iis La"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OUT! TRAGHING EVALUATION FORM sfactory wo. QUESTION } terest im learning rocedi The student worked well independently and finished tasks efficiently She managed her time well and completed her auties an schedule | He followed instructions carefully land required minimal supervision. |» The student showed con i performing daily! é He showed initiative in assisting library users with their needs Goramenta Suggestions: OUT traines is yeeormend (Pa Ul the requiremes! of safer [his her couree in Shielded Metal Arc Welding iSMAW) 5 di for graduation nnd regulation of the company that related te |"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "ojt",
        "ocr_text": "ON THE SUPERVISED INDUSTRY TRAINING OR IGST TR ING EY RLUATI ION FORM She displaye we toward ‘Tre tainee showed enthus gness lo iearn new oO yall and ‘ibraty dispi: hays. DET RLWS Discs ant ec pr vos 28 re in serving users t8/ Suggestions lhe OvT trae Pelli the requreme, hissher course on Shu te reeomensrded gradust of wafeiy end regul ati ed Metal Ace Welding, compte fed assigne 3ks accurately andontime. d patience and: n of the MATH 2 RATINGS holy aa Dolg wo for ae fobs can pany that rel nred to"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OUT) TRAINING EVALUATION FORM LEGEND: Outstanding Very Good/ Very Satisfactory Good /Adequate Fair/ Satisfactory Poor Unsatisfactory NA Not Applicable ITEM No. QUESTION i RATINGS INSTITUTIONAL EVALUATION 1 5s NA 2 3 4 1 |She maintained accuracy and efficiency v in encoding library materials, 2 She contributed effectively to library “| Operations and handled tasks with minimal v Supervision. She displayed Creativity in arran ling books and library displays. 9 4 The student was Cooperative and respectful v toward supervisors and co trainees, ‘She actwely supported the library statin daly operations The traine d enthus, id 6 wllitgres Brea, enthusiasm an }_| procedures. 7 Professionalism in serving users. The trainee demonstrated Patience and v — s |The trainee com leted assigned v tasks accurately and on time. Comments, ‘Suggestions: The OJT trainee is recommended for Fulfill the requirement of safety and 10 his her course in Shielded Metal Arc"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OJT) TRAINING EVALUATION FORM Dear Trainees: The following questionnaire is designed to evaluate the effectiveness of the Supervised Industry Training (SIT) or On the Job Training (OJT) you had with your Industry Partners. Please check the appropriate box corresponding to your rating for each question asked. The results of this evaluation shall serve as a basis for improving the design and management of the SIT in SICAT to maximize the benefits of the said Program. Thank you for your cooperation. LEGEND. 5S Outstanding 4 Very Good/ Very Satisfactory 3 Good Adequate 2 — Fair/ Satisfactory 1 Poor Unsatisfactory NA Not Applicable ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION 1 23 4 S NA She maintained accuracy and efficier in encoding library mnaterials, ney ir She contributed effectively to library 2 operations and handled tasks with minimal v supervision She displayed creativity in arranging books and library displays. 4 The student was cooperative and respectful v toward supervisors and co trainees. 5 ‘She actively supported the trary staff in daty operators v The trainee showed enthusiasm and 6 eiieinae st fo library v learn new procedures. 7 The trainee demonstrated patience and professionalism in serving users. s |The trainee rately and assigned v tasks, accurately and on time. The OJT trainee is recommended for graduation for he she Fulfill the requirement of safety and regulation of the company that related to his her course in Shielded Metal Are Welding (SMAW) NC II."
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING RAINING EVALUATION FORM ON THE JOB (OST) T! Dear Trainees is designed to evaluate the effectiveness of the On the Job Training [OJT) You had with your eriate box corresponding to Ye rating for ication shall serve as 2 basis for improving rte maximize the benefits of the said The following questionnaire Supervised Industry Training (sIT) Industry Partners. Please chee inch question asked The results of this eval the design an the SIT in SIC. 4 management of Program, Thank you for your cooperation LEGEND Outstanding Very Good/ Very Good /Adequate Fair/ Satisfactory Poor Unsatisiactory Not Applicable Satisfactory NA ITEM QUESTION RATINGS No. 3) 4 58 NA 1 [2 INSTITUTIONAL EVALUATION She maintained accuracy and efficiency in encoding library materials. She contributed effectively to library y 2 operations and handled tasks with minimal supervision. She displayed creativity in arranging v books and library displays. 3 |The student was cooperative and respectful toward supervisors and co trainees |— se acively supported the Hoary stain day opea O7S v 5 The trainee showed enthus| sm and willingness fo learn new library v 6 procedures. ind v 7 The trainee demonstrated patience al L professionalism In serving users. The trainee com leted assigned v j 1 4+ ——_ 8 | tasks accurate ly and on time. Gomments/ Suggestions: The OUT trainee is recommended for gr Tuifill the requirement of safety and regulati his her course in Shielded Metal Arc Welding aduation for he she ‘on of the company that related to (SMAW) NC IT."
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (CIT) TRADING EVALUATION FORM Bear Tranees e atfectiveness of the maining (OUT) you had with y the appropnate box corresponding te your rati jon asked The results of this evaluation s! and management of the S T in SICAT Thank you for your cooperation LEGEND: Ss 4 Very Goods Very 3 Good /Adequare 2 — Fair/ Saustactory 1 Poor Unsatisiactory NA Not Applicable vely to oo led tasks with mintmai FVISION 1 She displayed creativity in artanging i i books and library displays. 4 The student was cooperative and respectiul I}. toward Supervises ano co trainees. 4 cctiaty supconied ine ibrary stan daty cpacwiom L {|The ijainee showed enthusiasm and i 6 willingness fo learn new library procedures. The trainee demonstrated patience and _ professionalism in serving users. 8 “Tthe trainee completed assigned tasks accurate ly andontime. scam tu7 Suggestlo {the OuT troines is reconumended fox graduation for be abe Fulfill the requirement of vafety and regulation of the company that 20! his nez course in Uhicided Metal Ase Vhiding (SMAW} NC II. L-—"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED GIDUSTRY TRANG ON THE JOn (OUT) TRAINING EVALUATION Porat Dear Trainees: The following questionnairs is designed to eveluare Supervised Industry Training tT {OUT} you had with your industry Partners. Pleas corresponding to your rating for GCh Wuestion asked. The results of thie evaluation a the design and management hal! verve az a basis for improving of the SIT in SICAT to mi mrnice the benefits Program. Thani: vou for the effectiveness of the tthe said Your cooperation LEGEND: 5 Outstanding 4 Vary God Very Satinfcetory 2 Good Adequate 2 Fair/ Satisinct He showed improvemen * _ rsearch asses and dat, He was always punctual and was always punctual a * dependabie during Hie Oat schedule, a 3 She managed her time well and Completed her duties on Schedule. Se ACNE sumported ne themy satin Gad) Operations. a. ee 5 6 She active} Participated in dai library a vities and projects, ie Vational He showed initiative in assisting library users with their needs. __"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OUT) TRAINING EVALUATION FORW designed to On the Jew 7 2 appropriate box correrpond ng shal a basi vacy and efficiency iShe maintained accui !s in encoding library mate: | He showed improvement in handling i lresearch assistance and data entry tasks. . He was aiways punctual anc H dependable during hts OJT sched: sappories Be Horay statin 29H, ig “She actively participated in daily | library activities and projects. She followed safety and opera’ -+ quidelines responsibly. .. |. He showed initiative in assisting a library ysers with their needs. otioas: Somments Sugi [Thu QUT trainee ix ceoommended for graduation for he she Fulfill the requirement of safety and regulation of ths compary that reloted to nes ecures in Shielded Metal Arc Welding (2MAW NC 11. i"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OJT) TRAINING EVALUATION FORM Dear Trainees: The following questionnaire is designed to evaluate the effectiveness of the Supervised Industry Training (SIT) or On the Job Training (OJT) you had with your Industry Partners. Please check the appropriate box corresponding to your rating for each question asked. The results of this evaluation shall serve as a basis for improving the design and management of the SIT in SICAT to maximize the benefits of the said Program. Thank you for your cooperation, LEGEND: 5 Outstanding 4 Very Good/ Very Satisfactory 3 Good Adequate 2 Fair/ Satisfactory 1 Poor Unsatisfactory NA -_ Not Applicable ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION 1 2 3 4 5 NA 1 |She maintained accuracy and efficiency v in encoding library materials. 2 He showed improvement in handling v research assistance and data entry tasks. 7 He was always punctual and v dependable during his OJT schedule. 4 She managed her time well and v completed her duties on schedule. 5 She actively supported the library staff in dally operations. v 6 |She actively participated in daily v library activities and projects. 7 She followed safety and operational v quidelines responsibly. s |He showed initiative in assisting v library users with their needs. Comments Suggestions: The OUT traince is recommended for graduation for he she Fulfill the requirement of safety and regulation of the company that related to his her course in Shielded Metal Are Welding (SMAW NC II."
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAIKING ON -THE JOR (OUT) TRAINING EVALUATION Yorm Dear Trainees, he following quests i ne job T the appropriate bo: ding to your ts of this eval ail serve as s basic Poors Unsatisfactory Rot dppheadie {She Maintained pecuracy and efficion: boo i 5 He showed imorovement in andiing fo) fyi Go| || fresearch assistance ana data entry tasks. joi i ios He was always punctual and { | dependable Suring his OUT schedule. K a Sho managed her time well sng Completed her duties on schedute. 4. re er cuts on 3 —_. She actively Participated in daily library activities and projects. She followed Safety and opgrational {_ _ duidelines responsi Vv. ca He showed Initiative in assisting _t library USers with their needs.” __| menta/ Sug gentizae: re Out ines is recommanded for tradvation for he /ahe Mirement of safety aad regulation of te company thet rolated ty Se fea Thicieed Bed at is r"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAMUNG ON THE GOE (OUT) TRAINING EVALUATION FORM ng questio “y Peainin RATINGS coura awed improvement in ha’ i i bog i hassisiance anddaiserirytasks. i i ft i He was always pu al and aged her ver Cuties on schedule. taf in cath «6 (She actively participated indaily) iy | |_| fibrary activities and projects.” i 7 She erational Lo i guidelines responsibly. UHe showed initiative in assisting lorary users with their need Trments/ Suggestesas: fl O07 traines is recommended fe fil the requirement of safety and [his her course in Shielded ion for hes guiation of the sos Ea"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "ojt",
        "ocr_text": "RVISED wmpusTa? TRAINING EVALUATION FORMS ON THE SOB {out TRAINING Dear Traunees: The foliewins questionnaire i danigned te evoluate the sifectivences of the Supervised Industry Frasrang {SIT} of OF the Job Training tour) you had with yout Industry Partners Plosse check the approp fe box corresponding (° your retung for cach question asked. TRS results of valuation shall serve ao basis for improving tha design and mansgement of the ie SICAT to MAZENse the benefits of (he said Program. Thank vou for your cooperation LEGEND 5 Ourstanding 2 Very Goods Vary Satisfactory a- Fair/ Satisti te Poor Unsaustctory RA Net Appheable ae ere nara TE Crema | Mo. Question RATINGS pak Sn Rs a picasa i MsTITyT) JOH AL EVALUATION boot eT TT? a 7 - yout The student displays L assisting library users with fessionaiism and 1 The student masntaned Pru} Provided goos customer SoFViC® tp wary 1 The trainee Gemonsirated patience when assisting students wit) research. t 4 Vie consistently Toiowed library policies and maintained proper work conduct raya erating 3 OREM ‘The axrare 300% “oxeghens Ne +, |, {She actively part L—| library activities ‘and projects. jt She followed safety and operational | \\vi 4 guidelines resnonsity. {4 _— \\She consistantly showed professionalism \\e Ty Md respect woward Others. {tiie 4 {os iF —— Ecrameots/ Suggretions | The OST tevines in recommended for raduation for Be ee Pubniis tine requixemont of safety, snd regulation of the SOmnPOnT that related t 1 Shafter course in Shielded Mekal Are Woiding (SHA) wo th"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "ojt",
        "ocr_text": "SUPERVisED O8 THE GOB fogT; INDUSTRY TRAMIEG RAISINS BALI ATion FORM ing Very Good Vey ed patience dents wit tently foltower ane maintained ry polich proper wark conduct enthurrasin 8 She actively Participated in daily _| library activtties 3nd projects, She followed safety and opera guidelines responsibly, io 8 She consistently showed professionalism and respect toward others TEMente/ Suugentionn: {The OST trataes Pull the requis [his her eoures 4 i is receamamonded fo ernat of eater it Shielded Hy @radustion tor he fake sad remubstinn of the eorapany that celated te T Ave WRldiog (SiAKy Me IP"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING THE JOB (OJT) TRAINING EVALUATION FORM Dear Trainees re is designed to evaluate the effectiveness of the b Training (OUT) you had with your your rating for The following questionnai Supervised Industry Training (SIT) or On the Jo Industry Partners Please check the appropriate box corresponding to each question asked The results of this evaluation shall serve as a basis for improving the design and management of the SIT in SICAT to maximize the benefits of the said Program Thank you for your cooperation LEGEND 5 Outstanding 4 Very Good/ Very Satisfactory 3 Good /Adequate 2 Fair/ Satisfactory 1 — Poor Unsatisfactory NA Not Applicable ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION 1 2 3 4 5 1) Na 1 The student displayed initiative in v assisting library users with their needs. The student maintained professionalism and 2 provided good customer service to library users The trainee demonstrated patience v when assisting students with research. 4 He consistently followed library policies and maintained proper work Conduct. s The trainee displayed enthusiasm and commtment Throughout the OJT progam: v | She actively participated in daily v library activities and projects. 7 She followed safety and operational v quidelines responsibly. 5 |She consistently showed professionalism v and respect toward others. Comments Suggestions: The OJT trainee is recommended for graduation for he she Fulfill the requirement of safety and regulation of the company that related to his her course in Shielded Metal Are Welding (SMAW) NC II."
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OJT) TRAINING EVALUATION FORM Dear Trainees The following questionnaire is designed to evaluate the effectiveness of the Supervised Industry Training (SIT) or On the Job Training (OJT) you had with your Industry Partners, Please check the appropriate box corresponding to your rating for each question asked. The results of this evaluation shall serve as a basis for improving the design and management of the SIT in SICAT to maximize the benefits of the said Program. Thank you for your cooperation. LEGEND: 5 Outstanding 4 Very Good/ Very Satisfactory 3 Good Adequate 2 Fair/ Satisfactory 1 Poor Unsatisfactory NA Not Applicable ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION 1 2 3 4 5 NA 1 The student displayed initiative in v assisting library users with their needs. The student maintained professionalism and 2 provided good customer service to library v users. 3 The trainee demonstrated patience v when assisting students with research. 4 He consistently followed library policies v and maintained proper work conduct. 5 The trainee displayed enthusiasm and commitment v ‘throughout the OJT program. 6 |She actively participated in daily v library activities and projects. 7 She followed safety and operational v quidelines responsibly. s |She consistently showed professionalism v and respect toward others. Comments/ Suggestions: The OUT trainee is recommended for graduation for he she Fulfill the requirement of safety and regulation of the company that related to his her course in Shielded Metal Are Welding (SMAW NC II."
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OUT) TRAINING EVALUATION FORM Dear Trainees: The following questionnaire is designed to evaluate the effectiveness of the Supervised Industry Training (SIT) or On the Job Training (OJT) you had with your Industry Partners, Please check the appropriate box corresponding to your rating for each question asked. The results of this evaluation shall serve as a basis for improving the design and management of the SIT in SICAT to maximize the benefits of the said Program. Thank you for your cooperation. LEGEND: 5 Outstanding 4 Very Good/ Very Satisfactory 3 Good Adequate 2 Fair/ Satisfactory 1 Poor Unsatisfactory NA Not Applicable ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION 1 2 3 4 5 NA 1 The student displayed initiative in v assisting library users with their needs. The student maintained professionalism and 2 provided good customer service to library v users. 7 The trainee demonstrated patience v when assisting students with research. 4 He consistently followed library policies and maintained proper work conduct. if The trainee displayed enthusiasm and commiment v throughout the OJT program |She actively participated in daily v library activities and projects. 7 She followed safety and operational v quidelines responsibly, s__ |She consistently showed professionalism v and respect toward others. Comments Suggestion: The OJT trainee is recommended for graduation for he she Euufill the requirement of safety and regulation of the company that related te his her course in Shielded Metal Are Welding (SMAW) NC IL"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OJT) TRAINING EVALUATION FORM Dear Trainees The following questionnaire is designed to evaluate the effectiveness of the Supervised Industry Training (SIT) or On the Job Training (OJT) you had with your Industry Partners. Please check the appropriate box corresponding to your rating for each question asked. The results of this evaluation shall serve as a basis for improving the design and management of the SIT in SICAT to maximize the benefits of the said Program. Thank you for your cooperation, LEGEND: 5 Outstanding 4 Very Good/ Very Satisfactory 3 Good Adequate 2 Fair/ Satisfactory 1 Poor Unsatisfactory NA -_ Not Applicable ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION 1 2 3 4 5 Na 1 The student displayed initiative in v assisting library users with their needs. She contributed effectively to library 2 operations and handled tasks with minimal v supervision She showed a strong sense of responsibility 3 in performing assigned duties. 4 4 She managed her time well and v completed her duties on schedule. 5 The trainee displayed enthusiasm and commitment v ‘throughout the OJT program. 6 |She actively participated in daily v library activities and projects. 7 |The trainee adjusted well to the library s v work environment and routines. She maintained proper organization v and cleanliness in the library area. Comments/ Suggestions: The OUT trainee is recommended for graduation for he she Fulfill the requirement of safety and regulation of the company that related to his her course in Shielded Metal Are Welding (SMAW) NC II."
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED mney ON THE OR fogs ‘RY TRARORG 7) TRAIN SvaLaTioN FORM tudent dsplayed inj brary users yy She aci ively Participated in daily | fibrar 8ctivities and Projects. The trainee adh i work ervironiy ant anc! routine: aired proper organization Sn the lbvary area. fo the library s aad Wee te: Shleided Metal dre ¥"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB {OUT} TRAINING EVALUATION FORM Deos Treineas: ‘The following questionnaire is designed to evaluate the effectivenoes of the Supervised indusiry Training (SIT) or On the Job Training {OUT} you had with your Industry Partners. Please check the appropriate box corresponding to your rating for cach question asked. The results of this evaluation zhali serve ax a basis for mproving the design and ranagenent of the SIT in SICAT to maximize the bancfits of the said Program. Tharik you for your coop eration LEGEND. 5 Outstanding 4 Very Good/ Very Satisfactory 3 Good /Adequate 2 Fair/ Satistactory 1 Poor Unsatisfactory KA Not Applicable QUESTION “INSTITUTIONAL RVALUATIO He H The student displayed initiative in r assisting library users with theirneeds. |_| She contributed effectively to Koray [| operations and handied tasks with minimal She showed a strong sense of responsibil s TDSC sealane cee ane a eee ee oe ore 4 She managed her time well and eee imor creams. | | 1 | atari ‘The Waites cspiayad attrwsiasm ane commament ‘twougitaut he OUT program. aha ee =a |She actively participated in daily iv | ___ _ _ library activities and projects. ie _ 7 {The trainee adjusted weil to the tibrary s {2 work environment and routines, a ene aniened Roped (caer } v L _———| a leaniiness in i b Het Ear end cieantine rary area, i Ab ad ne OUT trainee is recommended for graduation fer he she Pulfili the cequirement of aafety and reyutation of the company that related to his her course in Shielded Metal Are Weiding (SMAW) NC 11."
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED Inpu ON THE JOB (ONT) TRAIN STAY TRAINING INS EVALUATION FORM box Crressonding to y TUTIONAL Suaty, bo); The student played initiative in users with the: HY fo kre 1 bandied tasks, wih mune De fo3 She showed 2 ‘ong i} [os [She actively Participated in Daily ot hbrary activities and projects, 7 ed welll to the MGPATY S ent and routines, +. tained proper Canization t nd cleaniiness in the ubtary area Coeamenta Suggestrans i work 6nvironn Shem [The OUT tcaines j FB eduation fy he sane Peli the 'Y and cegwatio 'hiv bies courme i of the company that reloted to i"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OUT) TRAINING EVALUATION FORM uectionnaire is designed le ate the effectiveness of Ii or On th he your {QUT you had w corresponding Good /Adeauate rj Saristac 0. QUESTION i RATINGS TIONAL EVALUA merry played initiative in ers with their needs. niributed stfiectively 19 fb t 2 of esponsibility She managed her time well ang her cutes on schedule. sm and conunim gem She actively participated Hbrary activities and projects trainee acijusted well io the library s + work environment and routines, 3 She maintained groper organization beo l and cleantiness in the brary area. [Somments/ Suggestions: : ig recommended for graduation for he s mont af safety and regulation of the company that related ta isieided Met |The O0F train Fattill the veux his her course in"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE GOB (OUT) TRAINING EVALUATION FORM ear Traine ny question is gned to evaluate Praising ak you for your cooperation NA Not Applice tudent cisplayed initiative in their needs. assisting 4 [She showed a attitude and eagerness to Jeam thigughout the taming period {oa He was always punciual and depend able during his OUT schedule. d responsi ibHity i in handing brary materials and student ords. a ccurects AUie W sy managing tims sony comple fing task 4 effectively. |. The trainee demonstrated pat Lo orofessionalis in serving users, 3 She maintained proper organization and cleanliness in the library area. 1. ente/ Suggestion The OUT trainee in recemenended for graduation for he obe i SuIM the requirement of eafety aad reuuiation of the company that eelated to |"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OJT) TRAINING EVALUATION FORM Dear Trainees: ‘The following questionnaire is designed to evaluate the effectivencst of the Supervised Industry Training (SIT) or On the Job Training {ouT| you had with your Please check the appropriate box Sorresponding to your rating for for improving Industry Partners. Vestion asked. The results of this Praiuation shall serve as basis CAT to maximize the benefits of the said each qu See sdeign and management of the SIT in St Program. Thank you for your cooperation: LEGEND: 5 Outstanding tL Very Good/ Very Satisfactory 3 Good Adequate 2 Fair/ Satisfactory 1 Poor Unsatisfactory Not Applicable ITEM No. QUESTION INSTITUTIONAL EVALUATION 1 y The student displayed initiative in v assisting library users with their needs. 2 |She showed a positive attitude and eagerness he ‘to leam throughout the training period. if ai ‘ He was always punctual and v dependable during his OJT schedule. She showed responsibility in handling library materials and stu jent records. tude when assisting Worary v s a _| 5 He maintained a courteous atti patron: She showed improvement in v _ S managing time and completing tasks effectively. L _ _ v 7 The trainee demonstrated patience and jonalism in serving users. professi s She maintained proper organization and cleanliness In he library area. —1 Comments Suggestions: \\duation for he she ommended for gra {safety and regulation of the comp: Yi Arc Welding (SMAW) NC II. v The OJT trainee is rec’ Fulfill the requirement o any that related to his her course in Shielded Met"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OJT) TRAINING EVALUATION FORM Dear Trainees: The following questionnaire is designed to evaluate the effectiveness of the Supervised Industry Training (SIT) or ‘On the Job Training (QUT) you had with your Industry Partners. Please check the appropriate box corresponding to your rating for each question asked. The results of this evaluation ‘shall serve as a basis for improving the design and management of the SIT in SICAT to maximize the benefits of the said Program. Thank you for your cooperation. LEGEND: Outstanding 4 Very Good/ Very Satisfactory 3 Good Adequate 2 Fair/ Satisfactory 1 Poor Unsatisfactory NA Not Applicable ITEM No. QUESTION RATINGS 1 2 s 4 5 =a INSTITUTIONAL EVALUATION The student displayed initiative in v assisting library users with their needs. _ She showed a positive attitude and eagerness v ‘to leam throughout the training period. | 5 He was always punctual and v dependable during his OJT schedule. al She showed responsibility in handling library materials and student records. He mantained a coureous tude when assisting rary v fz She showed improvement in vw. io managing time and completing tasks effectively. 7 The trainee demonstrated patience and iF |__| _ professionalism in serving users. She maintained proper organization Vv and cleanliness in the library area. Comments/ Suggestions: ecommended for graduation for he she eC of safety and regulation of the company that related to Shielded Metal Arc ‘Welding (SMAW) NC IL. ‘The OUT trainee i Fulfill the require: his her course in"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY 7. RAINING ON THE JOB (OJT) T UATION FORM ‘RAINING EVAL e effectiveness of the a had with your r rating for ‘basis for improving benefits of the said Dear Trainees: The following question ed Industry Training Supervis: ers. Pleast Industry Partn each question the design an Program. Thank g management of the SIT in SICAT to maximize the ‘you for your cooperation. LEGEND: Outstanding Very Good/ Very Satisfactory Good /Adequate Fair/ Satisfactory Poor Unsatisfactory NA Not Applicable ITEM QUESTION RATINGS No. INSTITUTIONAL EVALUATION if 314 [5 [NA 1 The student displayed initiative in assisting library users with their needs. itive attitude and eagerness _ |She showed Pos {Stleam throughout the training Pert He was always punctual and dependable during his OJT schedule. She showed responsibility in handling library materials ‘and student records. ro eymtaned courteous alttude when assisting Hbrary v patrons. She showed improvement in v s managing time and completing tasks effectively. The trainee demonstrated patience and professionalism in serving users. v 8 She maintained proper organization |__| and cleanliness in he library area. Comments/ Suggestions: The OUT trainee is recommended for gradu: iment of safety and regulati Fulfill the require his her course in Shielded Metal Arc Welding (S! jon for he she jon of the company th: MAW) NC II. at related to"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING “SOB (OUT) TRAINING EVALUATION FORM the SIT in SIC cooperation ine training period ays punctual and if i j ng his OUT schedufe. | i to leam throughout dependable du She showed responsibility in handii lbrary materials and student lanes couitzous ated wh patrons She showed Improvement in managing tims and completing tasks effectively. e trainee di sirated ce and professionalism in serving users. She maintained proper organization L_and cleaniiness in ihe library area. {Comvzaente/ Suggestions: [YSe GUT tralnes is ion for hefabe PUL the requirement of safety and reguiation of the enmpany that related to [his her eouror in Shielded Metal Are Ukiding (SMAWI NC IL. commended for grad"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "ojt",
        "ocr_text": "SUPERVISRE: INDUSTRY CASING OW TRE IGR (OST) TRAINING BCALUATION FOAR Danr Traine LEGEND: showed a positive atttude and 029 a the BRAG PH She quickly adapted to ine library s “workfiow and system operations. it organizing fibrary ng contributed helpful ideas. apecations supported ihe Korary staffin |She actively participate library activities and projects. tained accuracy in recording ang sorting library data, 1 1 He mair 5 (She consistantly shawed professionalism i nocd and respect toward others. tL. 7 Gaesmenta/ Suggestions: i Tae OUT trainee ia seemmmended fur graduation for he ahe Pull! the requisement of safety and regulation of the eat i 1A Bintut Aco Wielding (MA WET [niefhor course in Sinise"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED usp ON TRE JOB (OWT) USTRY TRAINING TRAINING EVALUATION Form Outstanding EY, 9004/ Very Satisfactory Good /Adaquate Fasr/ Satisfactory Poor Unsatisfactory Not Applicabie —— EE ae ee 4 RaTNos ONAL EVALUATION 2 i 2 ‘She showed a positive altitude and eagetness to leam throughout the training ves | She quic adapted to the linaryep {3 worktow ray opted ration, | 4 He assisted in al. events and contri icine s She active artici ated in daily it library ath is y| ia 'S and projects, oe rl | 7 He maintained accuracy in recording and rT “| Sorting library data, { 4} oe rd ot stemed polarons ian L ot! i Caaitatate sug Fespect towai 8 Se ee pie OUT trainer is recommended for Gaduation Mor he ehe ler ree ne retutement of nafety and een cf the company that related to |tis ner course ae Shisided Metal Are Woiding {oMAW, term TE"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OJT) TRAINING EVALUATION FORM. Dear Trainees: The following questionnaire is designed to evaluate the effectiveness of the Supervised Industry Training (SIT) or On the Job Training [OJT) you had with your Industry Partners. Please check the appropriate box corresponding to your rating for each question asked. The results of this evaluation shall serve as a basis for improving the design and management of the SIT in SICAT to maximize the benefits of the said Program. Thank you for your cooperation. LEGEND: 5 Outstanding 4 Very Good/ Very Satisfactory 3 Good Adequate 2- Fair/ Satisfactory 1 Poor Unsatisfactory NA Not Applicable ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION 1 2 3 4 5 na 1 The student displayed initiative in v assisting library users with their needs. 2 _ She showed a positive attitude and eagerness Vv to leam throughout the training period She quickly adapted to the library s | workflow and system operations. o 4 He assisted in organizing library v events and contributed helpful ideas. 5 She actively supported the tbrary staffin day operations. v | She actively participated in daily v library activities and projects. 7 He maintained accuracy in recording and v sorting library data. s |She consistently showed professionalism v and respect toward others. Comments Suggestions: The OUT trainee is recommended for graduation for he she Fulfill the requirement of safety and regulation of the company that related to his her course in Shielded Metal Arc Welding (SMAW) NC II."
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "ojt",
        "ocr_text": "INDUSTRY TRAINING SUPERVISED RAINING EVALUATION ON THE JOB (JT) T! FORM the effectiveness of the JT) you had wit ding to your rating for ‘a basis for improving e benefits of the said Dear Trainees: uestionnaire is designed to evaluate ing (SIT) or On the Job Training ‘eck the appropriate box correspon valuation shall serve as of this ev: T in SICAT to maximize th The following 4! ed Industry Train each question the design an Program. Thank you 4 management of the ST for your cooperation. LEGEND: Outstanding Very Good Very Satis! Good /Adequate Fair/ Satisfactory Poor Unsatisiactory Not Applicable os factory NA ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION 213 4 5 5A displayed initiative in rs with their needs. 1 The student assisting library use! he showed a positive attitude and eagerness t hout the training period 10 lear throug! 5 She quickly adapted to the library s a workflow and system operations. He assisted in organizing library events and contributed helpful ideas. ‘She actively: supported the library staff in daily operations, Ne |\\She actively articipated in daily library activities and projects. 5 7 He maintained accuracy in recording and sorting library data. v She consistently showed professionalism 8 and respect toward others. Gomments/ Suggestions: tion for he she The OUT trainee is recommended for graduat coer eafety and regulation of the compan} Fulfill the requireme his her course in Shielded Metal Are Welding (SMAW) NC m. y that related to"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED RDUSTRY TRAINING ON THE JOR [OFT] TRAINING RVALUATION FORM Dear Trainees PERRET 1 Me qunavion Bariias: Se ee Ap 2s A 18 TRA { he student displayed in ing library users with ther needs te] She quickly adapted ts the library! i workflow and system operations. ‘She actively participated in daily Horary activities and projects. i acy in recording and sorting Hbrary data. i jonalian: t the O27 tesinne in recommended fur graduation for ks jule i PsIRU the requirement ef safety and reguéation af the corupany that ralated to i pRielne: course im Bhicided Metel Gre Vbbiiag (SMATE RC 1"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRaWwING ON THE IOR (QUT) TRAINING EVALUATION FORM the design Program 3 Adequate 2 racto atisfact NA Not Appicebdle QUESTION IWSTTTG ONAL EVALUA ated effectively wilh |e $ and siaffmemoers. ted good cammur dwarked well with i visitors. Kiils avi She showed a str i in performing ee dispiayad good nai skills when as ——=-l library visitors. 7 |The trainee adiusied weil to the library s Ht work environment and routines L_ The student der xcellent {| carmnunication ski! 2 LEIMING ngirgted during ¢"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAE ON THE JOm (OfT) TRAIWING OYVALUATION FORM is designed t© eval: ing {SIT} er Om the Jeb Training JT} check. the approp correspon f this evaiy the with your your rating for waprow benefits of the the desig: Program, toed Very Satisfactory a= daguate 2 v/ Satisinctory i Poor Unsatisfactery NA Not Applicable QUESTION “RISTITUTION EVALUATION _ She communicated effectively with |__| both students and staff members. H He demonstrated good communication | iis and worked well with library staif howed a strong sense of responsibility { H in performing assigned cuties. B0) The trainee displayed good | interpersonal skilis when assisting library visitors. 4 The trainge adjusted well to the library s be work environment and routines The student cep onstrated excellent i iis Sunng the training. | _| communication L Comiments Sugzestions: |The OUT trainee to recommended for graduation fer he she 1 PeiRill the requirement of nafaty and regulation of the eempany that related to Rie her course in Shicided Motal Are Btiding ISMATH &e th |"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OUT) TRAINING EVALUATION FORM Cea isTiTUT ONAL BY AVIATION He demonstrated geod communication | skils and worked weil with library staff ARE MISHOES. showed a5 played good Is when assisting --+ library visitors. nee adjusted weit Lo the fiat t work eavirgament and ruil | The suident demonstrated excettent unica skilis duang the training \"Gomrnentu/ Suggestions |The O anes in recommended for griduatre Fadi the roqauement of eafety and regulation of the company that related te bisshes course in Shisided Metal Are Welding IShAW NC TT i"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAIBING OS THE JOH (ONT) TRALTING RVALUATION FORM Dene Trainene, Bragram. Thanks you fer END 4 effectively wih r iafi members. strated good communication with forary stafé NSE Of Hs yeawed strong gned dtl in performing She The tranes fer: played good H L interpersonal skis wien assisting oni fibrary vistors. > The traines adjusted well to Lk work environment ane ratte The student derpngirated ax comIMUnicakGn Ae Gene is mended for graduation for hofete caiety and regulation af the compony that rotated to Betal Are Weiding {SRRATA BG TE. (The Od teainew is reeems FAGHE the reguireraent of [hinfher course ia Shielded"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "ojt",
        "ocr_text": "SUPERVISED INDUSTRY TRAINING ON THE JOB (OUT) TRAINING EVALUATION FORM Dear Trainees: onnaire is designed to evaluate the effectiveness of the On the Job Training (OJT) you had with your ‘e box corresponding to your rating for e as a basis for improving fits of the said The following questi Supervised Industry Training (SIT) o Industry Partners. Please check the appropriat ‘ch question asked. The results of this evaluation shell serv the design and management of the SIT in SICAT to maximize the bene! Program. Thank you for your cooperation. LEGEND: 5 Outstanding 4 Very Good/ Very Satisfactory 3s o- Good /Adequate 2 Fair/ Satisfactory 1 Poor Unsatisfactory NA Not Applicable ITEM No. QUESTION RATINGS INSTITUTIONAL EVALUATION 1 2 3 4 5 NA She communicated effectively with v both students and staff members. He demonstrated good communication 2 skills and worked well with library staff v and visitors. She showed a strong sense of responsibility v in performing assigned duties. 7] _ |The student was cooperative and respectful y, ‘toward supervisors and co trainees. 5 “The student helped promote order and cleanness in the v reading area __. The trainee displayed good o c interpersonal skills when assisting library visitors. v The trainee adjusted well to the library s work environment and routines. The student de) trated excellent e GNcat Mieket iit the faming. f communication s' juring Comments Suggestions: The OUT trainee is recommended for graduation for he she Fulfill the requirement of safety and regulation of the company his her course in Shielded Metal Arc Welding (SMAW) NC Tl that related to"
    }
]