[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "ojt",
        "ocr_text": "EVALUATION FORM TRAINING SESSION INSTRUCTIONS? ow satisfactorily .g. Please give ponse. Your ation instrument is intended to measure hi ssle duration of your trainin’ raining evalu: ponding call of Your res this post your trainer pa your hones! answers wil me a treated with most oe angentalty: g rating scale: 5 Outstanding 4 very Good Very satisfactory 3 Good Adequate ae Fair Sausfactory poor unsatsfactorY use the followin GRRINERS /INSTRUCTORS ame of Trainer: e contributed helpful ideas e library ‘onerations. The talond gesrensanation patience ant erving U She showed im| rovernent in managing tina ae effectively. how to The trainee quickly le ned hi use the library s xy oan system. followed library He consistent policies and mi ytain’ re proper v wots conduct She 2 pe sense of"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FoR INSTRUCTIONS: this post f trannies our honeet ating by oy wens wi be ented with me NRE The trainee contributed helpiu! ideas to imnrove dreary soezation The tainee demonstr: patience ang protessi i serving users ting and completing | The trainee quickly warned how to use the library s catalogs L ary cd maintained proper w conduct. showed strong sense of ponsibildy 11 pat [oats aaa” sonomemeseviing i nes Hs saya acer 2a"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: ‘on instrument is intended to measure how satisfactorily ‘¢ whole duration of your training. Please give ‘e corresponding cell of your response. Your ‘This post training evaluati your trainer has done his job during thy your honest rating by checking on th ynewers will be treated with most confidentiality Use the following rating scale: 5 Outstanding 4 Very Good Very Satisfactory 3 Good Adequate 2 Falr Satisfactory 1 Poor Unsatisfactory TRAINERS /INSTRUCTORS Name of Trainer: DANIEL M. PIEL 1 IThe trainee contributed helpful ideas to imorove librarv operations 7 The trainee det onstrated patience and professional ism in serving users. She showed improvement in managing 2 3 4 time and completing tasks effectively. The trainee quickly learned how to use the library s cataloging system. 7 He consistently followed library policies and maintained proper work conduct______—+ “She showed a strong sense of responsibility in performing assigne duties. ‘She showed a postive attitude and eagerness to Se gam rousnout te rang Dare Doone Document Na NITATMEOE Ceeneme Sue automotiveservicing emer s18 Page of 250 NTA wen Daniel. Pie! Tevson WOT"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: fo improve fibrary oF The traineg demonstrate: patience an protessionali in serving users. She showed improvement in ma! Gees apieling asks effective’ jickly featned how 3 cataloging iy followed Horary tained proper work. ‘segue a"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post training evaluation instrument is intended to measure how satisfactorily your trainer has done his job during the whole duration of your training. Please give your honest rating by checking on the corresponding cell of your response. Your answers will be treated with most confidentiality. Use the following rating scale: 5 Outstanding 4 Very Good Very Satsfactory 3 Good Adequate 2 Fair Satisfactory 1 Poor Unsatisfactory TRAINERS INSTRUCTORS: Name of Trainer: DANIEL M. PIE trainee contributed helpful ideas to improve librarv onerations. paeSntiaines SrokSeeionalism in serving users. She showed improvement in managing time and co! tina tasks effectively. The trainee quickly learned how to use the library s cataloging system. He consistently followed library policies and maintained proper work conduct. Sho showed 9 strong seneeon t ropa gare nares a"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "ojt",
        "ocr_text": "TRALBING SESSION EVALUATION FORM ANETRUCETONSS use the following rating scalet siudent felowed and orecaGures diligently, She dispiayed confidence when assisting students and faculty members student pertormes all assigned 5 with dedication and efficiency, —~ ithe student he promote order land sleantiness iy af She mana icompiated per ways O The duile: ged her time wail and duties oF gcneduls. f {He was al sonal and dependable Gu9NS nis G2 a edule. senconcamsseneiin® nee"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: this post training evaluation instrument is intended to measure how satisfactorily your trainer has done his job during the whole duration of your training. Please give your honest rating by checking on the ‘corresponding cell of your response, Your yeewers will be treated with most confidentiality Use the following rating scale: 5 Outstanding 4 Very Good Very Satisfactory 3 Good Adequate 2 Fair Satisfactory 1 Poor Unsatisfactory TRAINERS /INSTRUCTORS Name of Trainer: DANIEL M. PIEL a The student followed library policies ‘and procedures diliaentlv. She displayed confidence when assisting students and faculty members. The student performed all assigned duties with dedication and efficiency. The student helped promote order and cleanliness in the reading area. 7 2 3 4 5 She managed her time well and completed her duties on schedule. He was always punctual and dependable during his OJT schedule. He showed improvement in handling, _ research assistance and data rity tasks. Dane Developed Document No WITATMI OE sapamber 2019 amar Date Revise: auromotiveservicing etn eer aoa Page 1 of 250 neu Developed by NTA Daniel M. Pie! Rewion wT"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "ojt",
        "ocr_text": "YRATHING SESSION EVALUATION FORM EWSYRUCTIONS: ended to maasurs how Satish 9. Pigase Sh displayed confidence when ass isting students and smambers. formed ai ass sic ged her time well and as on scnedule, He was always puncval and dependabic ‘during fis OLT edule."
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post training evaluation instrument is intended to measure how satisfactorily your trainer has done his job during the whole duration of your training. Please give your honest rating by checking on the corresponding cell of your response. Your answers will be treated with most confidentiality. Use the following rating sc 5 Outstanding 4 Very Good Very Satisfactory 3 Good Adequate 2 Fair Satsfactory 1 Poor Unsatisfactory TRAINERS /INSTRUCTORS Name of Trainer: DANIEL M. PIE. The student followed libra icies and procedures dhiochhe She displayed confidence when assisting students and faculty members. The student performed all assigned order duties with dedication and The student helped promote and cleanliness rine reading area. She managed her time well and completed her duties on schedule. He was alwa nctual and le during his OJT schedule."
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "ojt",
        "ocr_text": "TRAINING SEssIon EVALUATION FORM INSTRUCTIONS: This post training evaluation ring ument is intended to measure how satisfactorily your trainer has training. Please give 5 Outstanding 4- Very Good very Satisfactory 3 Good adequate 2 Fair Sausfa 1 Poor Unsatisfactory TRAINERS /INSTRUCTORS Name of Trainer: DANIEL M4, pre, 1 The student followed library Policies 17 and procedures diliaentiy. She displayed Confidence its and faculty members. The student Performed all assi Ined duties with dedication and effi lency. SS The student helped Promote order ‘and cleanliness in the readi ing area. She managed her time well and completed her duties on schedule. 2 somaibrapen [ff lependal jul is a Schedule? —L ceiarhasaieee are ana Ly 7] = Automotive Servicing wen"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: ‘This post training evaluation instrument is intended to measure how satisfactorily your trainer has done his job during the whole duration of your training. Please give your honest rating by checking on the corresponding cell of your response. Your answers will be treated with most confidentiality. Use the following rating scal 5 Outstanding 4 Very Good Very Satisfactory 3 Good Adequate 2 Fair Satisfactory 1 Poor Unsatisfactory TRAINERS /INSTRUCTORS Name of Trainer: DANIEL M. PIEL x 2 3 4 5 The student followed library policies v and vrocedures diliaentlv. She followed safety and v operational guidelines responsibly. The student maintained a respectful and cooperative attitude at all times. She actively supported the a library staff in daily operations. The student performed all assigned tasks efficiently and with a positive ide. The trainee demonstrated patience when assisting students with research. “The student displayed stong orpanzatonal sls in __Stanamg and resrtansng brary mareras. cane [aay Revsion wor"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post training evaluation instrument is intended to measure how satisfactorily your trainer has done his job during the whole duration of your training. Please give your honest rating by checking on the corresponding cell of your response. Your answers will be treated with most confidentiality. Use the following rating scale: 5 Outstanding 4- Very Good Very Sabsfactory 3 Good Adequate 2 Fair Satisfactory 1 Poor Unsatisfactory TRAINERS INSTRUCTORS Name of Trainer: DANIEL M. PIEL 1 2 3 4 5 The student followed library policies v and procedures diligently. She followed safety and operational guidelines responsibly. The student maintained a respectful and cooperative attitude at all times. She actively Supported the library staff in daily operations. The student performed all assigned tasks efficiently and with a positive attitude. The trainee demonstrated LY patience when assisting students with research. The stasent displayed sang orpenzatonal sala drargng and maternity brary maeras Dane Developed Document No NITATMT OT Tss0ed by Automotive Servicing Paget of 250 New nrta"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post training evaluation instrument is intended to measure how satisfactorily your trainer has done his job during the whole duration of your training. Please give your honest rating by checking on the corresponding cell of your response. Your answers will be treated with most confidentiality. Use the following rating scale: 5 Outstanding 4 Very Good Very Satisfactory 3 Good Adequate 2 Fair Satisfactory 1 Poor Unsatisfactory TRAINERS /INSTRUCTORS Name of Trainer: DANIEL M, PIEL il 2 3 4 s The student followed library policies v and procedures diliaentlv. She followed safety and operational guidelines responsibly. The student maintained a respectful and cooperative attitude at all times. She actively supported the library staff in daily operations. The student performed all assigned tasks efficiently and with a positive attitude. The trainee demonstrated patience when assisting students with research. _Dsrangngsnd manent reyes.” Dae Devaaped Document No WITATATOT September 2019 ontop uromotveservicing ORS Rew Page of 250 NCH rts Developed by Daniel MF!"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "ojt",
        "ocr_text": "TRAIRING SERSIGN EVALUATION FORM INSTRU TONS: 1 of your 9 cali af you fucent followed i ibrary shel procedures diicentiv. She followed safety and operational gi guidstines responsibly. ive atiilude at She actively supported the in dail YY operal ions"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS? atisfactorily ase give 2. Your measure how f your training Ple vf your respons intended to juration o g cell 0 valuation instrument Is i is job during the whole d axing on the correspondin ‘ost confidentiality. this post training r has done trating by treated with m: your traine! your hones answers will be use the following rating s- outstanding 4 very Good Very satisfactory 3 Good Adequate 2 Fair Satisfactory — Poor unsatisfactory scale: TRAINERS /INSTRUCTORS 3 4 Ss Name of Trainer: DANIEL M. PIEL v The student followed library licies: Ad procedures diligently. She followed safe and operational guidelines responsibly. The student maintained a respectful and cooperative attitude at all times. _ She actively SU ported the library staff in daily operations. The student performed all assigned tasks efficiently an with a positive attitude. ~The trainee demonstrated vatience when assisting students with researcn. mane “The student ple sue Soe aint eee mae Document Wo NTTATME OL Tae Developed Tesued By NTA Fenn OF"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "ojt",
        "ocr_text": "TAATHING SESSION EVALUATION FORM brary staif The. student showed consisiency in perforin dally i yed entteusiase and ONY program wad eagemass Hand adapt to diferent library tas"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post training evaluation instrument is intended to measure how satisfactorily your trainer has done his job during the whole duration of your training. Please give your honest rating by checking on the corresponding cell of your response. Your answers will be treated with most confidentiality. Use the following rating scale: 5 Outstanding 4 Very Good Very Satisfactory 3 Good Adequate 2 Fair Satisfactory 1 Poor Unsatisfactory TRAINERS INSTRUCTORS Name of Trainer: DANIEL M, PIEL 1 2 3 4 5 She displayed a positive attitude and v worked well with the librarv staff. The student shawed consistency in performing daily library tasks. She showed strong attention to detail when oraanizing books and files. The trainee displayed enthusiasm and commitment throughout the OJT program. The student showed eagerness to a learn and ada BO different library The trainee demonstrated a patience when assisting students with research. She showed a postive atitude and eagerness v ‘Gam troughout the Wainng period. Daeds Document No. NITATMTOE Cece Ser ‘AutomotiveServicing ° Oe oie BOE) nen NITA"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORE INSTRUCTIONS: PH Bat Santantsy HNING. Haase gi SF Your casponse. Your sh wed 1 Det cuining i 2 altention to detei Books and fies. csp srthusiass, en? tours oul the OFT progr Mt showed aq erness Sto ct Soa fo different fibra ary The i Eales demon trated Patience whe nm aye ne Sludenis with b Bary ond. esearch"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "ojt",
        "ocr_text": "THATHING SESSION EVAL BAT EON FORM INSTRUCTIONA: Use the following rating scate: AMIEL Ma eyes hive at Ki rel wath thy The student sh, consistency in pe daily re Shae Strong atiention when organizing DGoks ani [The tame ai caren: te detait d files, nt showed eagerness ty reel adapt ig different Horary ~fBSKS_ (oT aines demonstey fed ‘pshaads wh Sight Stidents with focreororeames serene ae Renomstivesenviing 1 ace"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: satist 2356 Gi nga, Your your trainer has honest 73 tse the fellawing rating scat fe dispiayed a posilive Mi worked weil with the fibr The student shgwed consistency in performing daily library tasks. 6 showed strong atiention t boo! id The stud aim and adapt to asks... demongttaiad assist"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This pest training evaluation instrument is mtanded to measure how satisfactorily your trainer has cone his job curing the whole duration of your training. Please give your honest rating by checking on the corresponding call of your response. Your answers will be treated with most confidentiality, Use the following rating scate: SS Gutstanding 4 Very Good very Satisfactory 3 Good Adequate 2 Faie Sanstactory 1 Poor unsatsfactory TRAINERS INSTRUCTORS Name of Yraver: DAWIEL M. BIEL ‘The trainee completed assigned tasks accurately and on tine. He maintained accuracy in recording and sorting library J oo _. wa SETTERS Re, i= i\" She seronston ebay by wn i | mes 4 i” Lf [the vanee snowed rest a improvement in tin handing Vorary i ao He consistently followed library SSS jpobcies a paren’ Proper work <r"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATICN FORM IMAYRUGTIONS: He maintained accuracy in ~~ I —_ i 7 recording and Sorting hoary, i i i dat L anes. lanes 3 with ge SEIS wocedutes. es. a conduct. The trainee showed great improvement int hi ie fibrary Artomotien Servicing Liconeinees"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "ojt",
        "ocr_text": "SION EVALUATION FORM TRALTRING BE: IReTRUCTIONS: rainer: DABIEL M. He maintained accuracy in recording and sorting library 4 data t shove Bane rated ratiat and meetin fentiy foliowed library s and rnaiitained proper work"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: n instrument is inter te measure ty job during the whole duration of your trainin tasks and on time. He maintained accuracy in recording and sorting Bbrary ' i date i L The trainee wiltighess (oie She demonstrat on tune and wabilty by artving nating deadlines f jes and maint: po conduc a s trainee show: improvement inn i transactions."
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post training evaluation instrument is intended to measure how satisfactorily your trainer has done his job during the whole duration of your training. Please give your honest rating by checking on the corresponding cell of your response. Your answers will be treated with most confidentiality. Use the following rating scale: 5 Outstanding 4 Very Good Very Satisfactory 3 Good Adequate 2 Falr Satisfactory 1 Poor Unsatisfactory TRAINERS /INSTRUCTORS Name of Trainer: DANIEL M, PIEL 1 2 3 4 He showed great responsibility in handlina librarv materials and records. The, student showed consistency in performing daily library tasks. The student maintained a respectful and cooperative attitude at all times. _ She actively supported the ig library staff in daily operations. The student performed all assigned tasks efficiently and with a positive itude. indep oS AM hee Lacks efficiently. “Tre student showed exelent pecomance and descaton GOES Re OL Ses completed acs ebcenty and ontine Dake Developed Document No NTTATMTOT Cucneane Seer Awomotveservicing seers, Pages of250 wei ial wta Daniel. Pie! Raven wor"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONG: TWis poet training evaiuation instrumant is intended te maasure how satisiactority your wainer has done his job during the whois duration of your training. Please give your honest rating by checking on the corresponding celi of vour response. Your answers wil bs treated with most confidentiality. Use the tultowing rating scaie: S Outstanding 4 Very Goou Very Satistactory 3 Geod Adequate 2 Fatr Savsfactory 1 Poor unsatsfectory TRAINERS /INDTRINCT ORS Pan ae Name of Traner: CAMEL. pist a 2 L. Hi r ponsibiltyin y He s ge: ihangina ibrary materials and records. tu TO contingent sored daily library task a The student maintained respectful ng sooverative attitude at aif times. She actively supported the era Sain daly opera, i The studeni performed all os"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post trsining evaluation instrument is intended to measure how satisfactorily your wainer has done his job during the whote duration of your training. Please yve Your honest rating by checking on the corresponding ceil of your response. Your answers will be (reated with most confidentiality. Use the following rating scaie: S Outstanding 4- Very Good Very Satisfactory 3 Good Adequate 2 Fair Satisfactory 1 Poor unsatisfectory f He showed great responsi iy (handling library pene and records Lt +—}— ———| ie i “4 cone engert in ae 7 TI Ty daily library tasks. _| The student maintained a respectful and cooperative attitude at ali times. a She activaly Saget the | library s staff in daily operations. ! a if ont performed ail as 7 \"aie enc and with a 1 | _ PENT TT noob ae SKS i. LL i 3 SEE —_——— ae ee cNeer Pema a _ i it J"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORK ares ONS Sutstand Mery Gaodi eusfartory ry Jent showed consistency in pe: orm: dally 1b The student maintained a resp and cooderative attitude She actively Joported the Hibrary staff in dally operations. ry dently and with a positive abiituds welt atFlaoxs __ The stutent wor lindepender (aaah"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALDATION FORE INS THUCTIONS: Satisfactorty Pease giva ng bY checti tbe weated with mog Use the fetiows ing rating scale: 5 Outermeing 4- Very 3 ctory LHe shows. ibanddiing tbe The student ey in De daily library ta: he student maintained a ang foaee aitiude at aus dent ERE pends ee ee ‘sks eff hcienty Acomnsiesercng metemee"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSTON EVALUATION FoRM INSTRUCTIONS: This post rraining avatustion your trainer has done his joo du r ween ovast rating by checking on the correrpending cal) of your response. Your swore will be Yeates with most confidentiality Use the folowing rating scate: ingtrumarc is intended te measure how satistactoniy 5 Outstanding 4 Very Goou Very Satisfactory 3- Good/ Adequate 2 Fair Savs is Poor funsattstactory TRAINERS TineTROTORS Name Of Trainer: RAW Melee He showed rea! responsibilty i fhandting fibrary matonoke and retorts He maintained accuracy in ~ fecording and sorting library She managed her ne wall apd (completed her dutios an sereacn, She displayed creativity in “ displays *erary ee Nemec pales _ Sena me Page or 230 isk mma eee ba sj |"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS® e how satisfactorily ing. Please Sve onse. Your ‘ent is intended to measur vole duration of your ain! ‘This post ponding cell of your resP your trainer has your honest rating B vnswers will be treated 1 use the following ratin 5 outstanding 4 very Good Very 3 Good Adequate 2 Fair Sausfactory — Poor unsausfactorY yy checking th most confidentalitY 1g scale: sapsfactory TRAINERS INSTRUCTORS ainer: DANIEL M. PIEL He showed great responstiry in handling library matenal and records. He maintained accuracy In recording and sorting data. He demonstrated reliability and punctuality throughout the training period. 7 He showed initiative in suggesting ways to improve book organization. She managed her time well and completed her duties on schedule. She displayed creat in arranging S an rary displays |_| J 1 2 3 4 Name of Tr ceanon sls and Fie demonstrated good com demon ea st rary sta and VSS —pocument No NTTATMEST Tae borane automotive seine ew"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post training evaluation 1 Your trainer has done his job dur your honest ratin, answers will instrument 1s intended to measure how Sabsfactorily a the “hole duraton of your training. Please ove 9 BY ched ing on the weaesPonding cell of your response. voce fated with most confidentiality Use the following rating sc S Outstanaing $= Very Good very savstactory 3 Good Adequate 2 Fair Sabsfactory 1 Poor Unsansfactory TRAINERS INSTRUCTORS Name of Trainer: QANIEL M. prey He showed great ty in ‘ar itary atone try He maintained accuracy in recording and Sorting library data. He demonstrated retabiity and Punctuality throughout the training penod He showed initiative in suggesting ways to improve book Organization. + |_She managed her time well and |completed her duties on schedule. (se She displayed creativity in arranging Dooks and brary ‘displays 1 oon cormcaton suk 1 TR Saran sem 8 Page of 250"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCT TONY He maintained aocuracy in H en Fecording and sorling jibrary { 1 H i i j She manages : i completed i i | DOORS end H displays -"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "ojt",
        "ocr_text": "ATION FORM TRAINING SESSION SWALLE ENSTRUCTIONS: TRAINERS /INETRUCT vaerar: OAUIGLM, He showed great! naling ibrary matenals aad ox me 3 maintained accuracy in acording and brary) He gernonstated rel punctuality te Secu the waining He showed initia ative ba pera Sj ways fo Improve Gk, aii ne managed her time Ww ve completes nat duties 00 sonedule. ed create way in and Hae"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "ojt",
        "ocr_text": "PRAINING SESSION EVALUATION FORM FYSUREGIONS Hye the faifowsitny rats TRATNERS/ IND ERUCEORS 7 H Tt i He ! materats eit muibimal eno a ene! i \\"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post training evaluation instrument is intended to measure how satisfactorily your trainer has done his job during the whole duration of your training. Please give your honest rating by checking on the corresponding cell of your response. Your answers will be treated with most confidentiality. Use the following rating scale: 5 Outstanding 4 Very Good Very Satisfactory 3 Good Adequate 2 Fair Satsfactory 1 Poor Unsatisfactory TRAINERS /INSTRUCTORS Name of Trainer: DANIEL M. PIEL 2 3 4 5 He showed initiative in assisting iT “lv librarv users with their needs. He organized books and materials efficiently with She actively participated in dail library act tie phd reacts y $74 4 The trainee displayed enthusiasm and commitment throughout the OJT program. ‘The student displayed professionalism land dedication throughout her training. independent and nshed asks el ciently. Tegigenres pnaet sine we 7 reseed Sree ESN and eShaes L [7] Date Developed Document No NTTATMEST ‘Sepeamber 2009 iimeabr ate Revise: seperter 2019 at) IITA Revion wo"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "ojt",
        "ocr_text": "TRALWING SESSION EVALUATION FORM INSTRUCTIONS: ment He organized books and matenais efficiently with minimal errors, She actively participated Thrary activities and ornie"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post training evaluation instrument is intundad to measure now salisfactorty your trainar hus done his joo during the whole uration of your training. Plowse give your Ronast rating by checking on the corresponding call of your response. Your answers will be treated with most confidentiality Use the fotiowing rating scale: 5 Outstancing 4 Very Good Very Satisfactory FRAINERE INSTRUCTORS Mame of Trainer: OANIELM, PIEL, a “4 ES Re 8 SSA Ung tes Besta Cal Wed zie He showed Initiative in assisting v4 library users with their needs. ——+—+—4 — He organized books and ~ materials efficiently with miinimaterrors, 0} She actively participated in daily ppt library activities and oroiects 1_ _4 The trainee displayed enthusiasm and commitment throughout the OJT program. i H ‘The student displayed professionalim land dedication throughout her training. inde BSR NAA ehed tasks ! el antl. -i.— ~The studen wae pancho lable, and CREE Sea Ben ent a ees 1 i [a |"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "ojt",
        "ocr_text": "FRAMING SESSION EVALUATION FORM PRB TRUCTIONS: This postersining evsivati: your trainer hae done his £98 inte nig the whale de carrespardi ye answers Rams of Tawar: GANIGL MOPIEL 1 He showed ini! sisting i fbrary users with thelr needs He organized books and materials efficiently with _ _iinimal errors, _ She actively participated in fhrany activities and pro: splayed exthusigsrn pgnout the OOF displayed profe: nm ihnrouyghout her traning: The student worked weil lindependently ana Teh eP asks i efficiently."
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post trainin Bure UMeNt is intended to measure how satista Your trainer has done his jab suring the whole duration of vane training. Pleas answer eest ating by checking on fer orresPonding cell of your response. answers will be treated with more Confidentiality, cale: 9 evaluati \\ctorily give Your Use the following rating s 5 Outstanding $- Very Good very Satisfactory 3 Good adequate 2 Fair Satistactor 1- Poor Unsatisfactory TRAINERS INSTRI ‘UCTORS Name of Trainer: DANIEL M. pret le adapted luickly to new tasks and learned the Ii rarv svstem efficiently. She SAibited Sapelent teamwork ani Cooperation with staff members. She showed Improvems time and co, lent in managing mpleting tasks effectively, The student help in ed promote order and cleanliness th 1 reading area. iS tal cate lentn to etail in catal Ing and s| elving le trai nstrate Pationea Wier anata. students with research. ‘She showed a postive 1nd ai Leam thoughout ne tara eagerness Date Developed: al Document No NTAT LOT Tesued by Automotive Servicing Ni cn NTA Revion WOT"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post training evaluation instrument is intended to measure how satisfactorily Yoak frainer Nas done his job during the whole duration of your training, Please give your honest rating by checking on the corresponding answers will be treated with most cell of your response. Your confidentiality, Use the following rating scale: 5 Outstanding 4 Very Good Very Satisfactory 3 Good Adequate 2 Fair Satisfactory 1 Poor Unsausfactory TRAINERS INSTRUCTORS Name of Trainer: DANIEL M, PIEL a 2 3 4 5 IHe adapted quickly to new tasks and v ‘learned the librarv svstem efficiently, She exhibited Sxcellent teamwork an cooperation with staff members. She showed improvement in managing time and completing tasks effectively. The student helped promote order and cleanliness in the reading area. |He demonstrated strong attention to detail in cataloging and shelving books. The trainee demonstrated Patience when assisting students with research. Dare Owvsloned Document No NTT TME OT Tesved by Automonve Servicing Pagel of 250, New Develoned by NTA"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "ojt",
        "ocr_text": "FRAIKING SSLGH EVALUATION FORM INSTRUCTIONS: RAINE: Nama of “and cooperati aff rembe ped promo in the readi ‘The trainee demo patience wh stidents with 1"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: answe ated with She exhibited excellent \\ i 1 teamwork and cooperation ' po h stalf members. i i amon Bhe showed improve: me and compieand fs) The student helped promote order jane cleanin: attention 1G He cemonsiratc: é shelving tail in cataiog! The trainee cemon: ‘patience when essi: students with res [ineaer automonva Servicing 4 ooowm | eee ee"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "ojt",
        "ocr_text": "TRAININ: INSTRUCTIONS? your honest rating PY Snswers will be treated use thi 5 Outstanding 1G SESSION EVALUATION FORM re how satisfactorily ‘ining. Please give ir response. Your tended to measut duration of your tr Jonding cell of you\" trument is in! g the whole checking on the corresP with most confidentiality: following rating scale: 4 very Good very SausfactorY 3 Good Adequate 2 Fair Satsfactory — Poor Unsatisfactory TRAINERS /INSTRUCTORS llearnet teamwol ie adapted quickly To new tasks and the librarv svstem efficiently. 7 4 She e: ibited excellent and cooperation with staff members. ‘She showed impro\\ ‘time and completin The student hel and cleanliness In wement in managing jectivelv. | £7 .a tasks eff promote order the reading area. 7 He demonstrated detail in catalog “The trainee de ‘when assisting strong attention to jing and shelving onstrated patience wh ‘students with research. oreacmmatei 174 Tae bwaenee Ted BF pager of 250 NTA L_cmar—] aor"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "ojt",
        "ocr_text": "on FORM SESSION EVALUATE RAINING IMBTAUCTIONS: mmaasure how sotstacterly 2 ue nd clean The bier consistency dail show \"] enthas eae nay ore egurteaus 2th it vary Patrons. She managed d her time well and \\comoleted ner duties OF schedule. splayed! creat Pooks ahd dispiays wt Seen maa"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post training evaluation instrument is intended to measure how satisfactorily your trainer has done his job during the whole duration of your training. Please give your honest rating by checking on the corresponding cell of your response. Your answers will be treated with most confidentiality. Use the following rating scale: 5 Outstanding 4 Very Good Very Satisfactory 3 Good Adequate 2 Fair Satisfactory 1 Poor Unsatisfactory TRAINERS INSTRUCTORS Name of Trainer: DANIEL M, PIEL 1 2 Fy 4 5 She maintained proper organization v and cleanliness in the librarv area The, student showed consistency in performing daily library tasks. trainee showed enth wil GoeSS 1 FSSN New EY BTM He aintained a Gaufteous attitude when assisting library patrons. She managed her time well and completed her duties on schedule. She displayed creativity in arranging books and library a displays. Fre demonsrated good communication sls and 7 ‘worked well wih Irary staff and vistors Document No NTTATHEOT Tesued by AutomotiveServicing New Paget of 250, NTA Reviion OT"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "ojt",
        "ocr_text": "Lae EVALUATION FRM ig ntendad to measure BOF role Guraner the correspond ayfigertiohity: ning leataed wat? BSE pagwers wit be use the foltowing rane seate! raters apsfactory ned propet oF Land 23 in the the ‘student shqwe cons! sistency ifs PEMOTMANG __ sally fibrary tasks. al oe ate. oe managed her 2 Wi completes her duties on 30 ESplaye creativity in ing Books and WOray ausplays. chedule. eo fae bewowre (\"Siem meses ut"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "ojt",
        "ocr_text": "TRAINING SESSION EVALUATION FORM INSTRUCTIONS: This post training evaluation instrument is intended to your trainer has done his job during the whole duration o Your honest rating by checking on the corresponding answers will be treated with most confidentiality. measure how satisfactorily f your training. Please give cell of your response. Your Use the following rating scale: 5 Outstanding 4- Very Good Very Satisfactory 3 Good Adequate 2 Falr Satisfactory 1 Poor Unsatisfactory TRAINERS INSTRUCTORS Name of Trainer: DANIEL M, PIE! 1 2 3 4 Fa She maintained proper organization and cleanliness in the librarv area The student showed consistency in performing daily library tasks. 1! wile Tete NS BI a a He maintained a courteous attitude when ‘aned a library patrons. She managed her time well and id completed her duties on schedule. She displayed creativity in arranging books and library h displays. He demonstrated good communication skils and 2 Worked well win library staff and vistors, Dae Coogee Document No WTATNT OT sepenterans AutomotiveServicing REVI Page of 250 ITA Developed by Danie! M. Pie!"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "ojt",
        "ocr_text": "TRAINING see SLON EVALUATION FORM INSTRUCTIONS: maintained prop. organization and cleanliness in thy Nbr; ae ares, _ AOS, student showed CONSISE ency i pei ferraing daily library tasks, Nee showed setts feamn new} She managed (Completed i well and her cuties on sch dule,"
    }
]