[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "orgchart10",
        "ocr_text": "White Ltd Academy Marketing Director Rose Wilson Mark Ramirez Lorraine Davis Manager Manager Manager David Miller Russell Henry Todd Brandt Brian Hendrix Manager Manager Manager Manager Empioyee Empioyee Employee Employee Employee Employee Employee Employee Empioyee Employee Employee Employee Employee CREATEO RY TemplateLAB"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "orgchart10",
        "ocr_text": "White Ltd Academy Kathy Navarro Marketing Director Lorraine Davis Manager Mark Ramirez Rose Wilson Manager Manager Brian Hendrix David Miller Russell Henty Maser Todd Brandt SManager Manager Based Manager Manager | Employes Employes eEmoloyee Employes Employee i | i Employee Employee Employee Employee Employes Employes Employee emplateLAB Employee"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "orgchart10",
        "ocr_text": "White Ltd Academy A Kathy Navarro Marketing Director Lorraine D Manage! Rose Wilson Mark Ramirez Manager Manager ala» ala Brian Hendrix avis is David Miller Russell Henry arco Todd Brandt Manager Manager ARQET Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee | Employee Employee emplateLAB Employee"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "orgchart10",
        "ocr_text": "Kathy Navarro Marketing Director Rose Wilson Mark Ramirez Lorraine Davis Manager fdanager Manager a David Miller Russell Henry Me Todd Brandt Brian Hendrix Manager Manager ange Manager Manager Employee Empioyee Employee Employee Employes i I | Employee Employee Employee Eniployee Employee Employee Employee Empleyee cagnven ae TemplateL AB"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "orgchart10",
        "ocr_text": "Kathy Navarro Marketing Director Lorraine Davis Manager 4 Rose Wilson Mark Ramirez Manager Manager —— LOL le David Miller Russell Henry ‘ace, Todd Branct Brian Hendrix Manager Manager HOE Manager Manager | Employee Employee Employee Employee Employes | Employee Employee Employee Employee Employee Employee Employee Employee TemplateLAB"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "orgchart10",
        "ocr_text": "Crystal Weber OVvM Marketing Director t eA John Williams Madison Ramsey Lor Foley Manager Menager Manager t i 7 _— nN cial nee! peer ercssnunmnncnnece es ee i H H t t i j ie BBB. Jactwn Mckenzie eB. Valerie Miller Manager Kristin hes Sarah Adams eduards Ellen Davis Manager fanaget Manager Manager { { ' 4 4 \\ 4 Empioyes Employee Employee Empioyee Employee Emplayee Employee Empioye® Employee Employee Employce Empioyee Erapioyes ees"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "orgchart10",
        "ocr_text": "l 7 Stewart, Morgan a” \\) ‘ae and Stein Institute Crystal Weber DVM Marketing Director Lori Foley John Williams anager Madison Ramsey Manager Manager Ala y Ny N Ala y NY N Ala Sarah Adams Egat 5 Ellen Davis Valerie Miller Jaclyn Mckenzie Manager anager Manager Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee | Employee Employee Employee CREATED BY TemplateLAB ——— =e"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "orgchart10",
        "ocr_text": "Stewart, Morgan oa and Stein Institute Crystal Weber DVM Marketing Director as John Williams Madison Ramsey Lori Foley Manager Manager Manager f a Sarah Adams ue 5 Ellen Davis Valerie Miller Jaclyn Mckenzie Manager anager Manager Manager Manager 1 j | Employee Ernpioyee Employes Employee Employee H | j | Employee Employee Employee Empioyee Employee | | Employee Employee Employee empiateL AS"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "orgchart10",
        "ocr_text": "Stewart, Morgan and Stein Institute fC: Crystal Weber DVM Marketing Director Madison Ramsey Lori Foley John Williams vianager anager Manager Jaclyn Mckenzie Valerie Miler Sarah Adams Ewa 5 Ellen Davis Manager anager Manager Manager Manager | Employes Employee Employee Employes Employee Employee Employes Employee Employee Employee Employee Employee CHEATED SY Employee ‘Template AS"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "orgchart10",
        "ocr_text": "Lori Foley i i ee pears ie ATE Se ENTE i i t rN ACKOAZIE AB, AB. Valerie Miller Manage Ellen Davis Manage! hactye i | enninyvee . Employee ; | | Employee i Empioyes"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "orgchart10",
        "ocr_text": "~~ Williams and Ala Sons University Carlos Martin Marketing Director Joseph Miller David Webb Harold Gray Manager Manager a) ~ ~ yy N alae Ala rN N Ala Laura Houston Paiez3r8ps sae Doris Phillips Samantha Manager Manager MAGE? Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee | Employee Employee Employee CREATED BY TemplateLAB"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "orgchart10",
        "ocr_text": "Carlos Martin Marketing Director Joseph Miller David Webb Harald Gray Manager Manage; Manager UZ. j ilirjes Samantha Laura Houston aiezann yasmine Doris P hillips Brome Manager Patigrson Dos EGO. Manager Manager a | l Empisvee Employee Employes Employes Employee i 1 i Emplovee Employee Employes Employes Enivployes Employee Employee Employee ceearee ay Tempisiel ag"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "orgchart10",
        "ocr_text": "Willi s Martin Marketing Girector Joseph Miller David Webb Harold Gray Manager Manager Manager a a __ Laura Houston pattyson BOS gsm? Samantha Manager Slanager Nhe Manager shaneger | Employee Empicyse Employes Emoloyes Employee Employee Ernpioyee Employee Employee Erployee | Employes Empinyee cabaren oY Po TempiateL AE employee"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "orgchart10",
        "ocr_text": "> Williams and ala sons University Carlos Martin Marketing Director Joseph Miller David Webb Harold Gray Manager Manager Manager _—— ——_ ___ a a rN’ N yr NY N y NY N rN’ N Ala Laura Houston paliZ2t Bos Yasmine Doris Phillips Samra Manager Manager Mgt Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee CREATED BY TemplateLAB |"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "orgchart10",
        "ocr_text": "Carlos Martin Marketing Director Joseph Miller Manager Harold Gray Manager i Laura Houston Suzanne smina fo Db Samanth- Patigrsen Sps eye Doris hillips Brown 4 Manager anager rs MED: Manager Manager erployee Employee Employee Employes Employee Employee Employee Employee Employee Emplovee i 1 Employee Employee Spares ay Templatel_ ag"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "orgchart10",
        "ocr_text": "i” \\’ a Hamilton Institute Lindsay Lutz Marketing Director Kylie Moreno Peter Lee James Carson Manager Manager a Ala Ala Ala Ala Ala Ronald Potter Jason Kelly onda i Manager Manager Fe Hagan Dennis Cruz cers Employee Employee Employee Employee Employee | es Employee Employee Employee Employee | Employee Employee Employee TemplateL AB"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "orgchart10",
        "ocr_text": "Lindsay Lulz Marketing Director James Carson Kylie Moreno Peter Lee Manager Manager Manager | eee \\ jy saovw rarnereense en Boia yoy ie. Mie ile, SM. ae Late Ronald Potter Jason Kell honda Dennis Cruz Jared Myers Manager Manager y Rguisan Manage Manager | | : i Empioyee Empioyee Employee Eroployee Ermpicyee | | Employee Empicyee Employee Employee Empioyee Hl Employs2 Empicyee i Empioyee TempiateLA®"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "orgchart10",
        "ocr_text": "f Taylor, Moreno and 7. Hamilton Institute Lindsay Lutz Marketing Director Kylie Moreno Peter Lee James Carson Manager Manager Manager ~— Y Mn Late, a, rN MOABs Ronald Potter Jason Kelly fonensan Dennis Cruz Jared Myers Manager Manager oi BEG Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee | Employee Employee Employee GHEOTEO RY TempigielL AE"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "orgchart10",
        "ocr_text": "ae. Ronald Potter Manager : Employee Employee Employee Kylie Moreno Manager Lindsay Luiz Marketing Director cereeenenncstrnenansnnnt tt tenn Peter Lee Manager Jason Kelly see Manager Re sgh employes Emplayee i Employee Employes Employes Taylor, Moreno and Hamilton Institute James Carson Manager Xx Dennis Cruz Jared Myers Managet Manager Empioyee Employee Empicyee Employee Erapioyee YemplateLAB"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "orgchart10",
        "ocr_text": "Taylor, Moreno and ala Hamilton Institute Lindsay Lutz Marketing Director James Carson Kylie Moreno Peter Lee Manager Manager 9 2 vo Q fe Ala Ala Ala Ala Ronald Potter Jason Kelly Freese, Dennis Cruz Jared Myers Manager Manager Hage Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee | | Employee Employee Employee TemplateLAB E DC“ (tides"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "orgchart10",
        "ocr_text": "Norton inc University Francis Moore Marketing Director Baanna Richard Terrell Kelly Herrera Manager Manager Manage! Kristi Oliver Karl Hanson Tracy Choi Mark Harrington Debbie Harrell Manager Manager Manager Manager Manager | Employes Employee Employes Employee Employee i i Empiovee Employee Employee Employee Employee Employes Employee Employee CREATED BY TemplateL AB"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "orgchart10",
        "ocr_text": "Norton Inc University Francis Moore Marketing Director Pienna Richard Terrell Kelly Herrera Manager Manager Manager | Kristi Oliver Karl Hanson Tracy Choi Mark Harrington Debbie Harrell Manager Manager Manager Manager Manager | Employee Employee Employes Employee Employee Employee Employee Employee Employee Employee | | Employee Employes Employee CREATED BY TempiaieLA"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "orgchart10",
        "ocr_text": "Francis Moore Marketing Director Richard Terrell Kelly Herrera Manager Brianna Johnson Manager Manager {oe a oo 4 c Kristi Oliver Karl Hanson Tracy Choi Mark Harrington Debbie Harrel! Manager Manager Manager Manager Manager | i | Employee Employes Employee Employee Employes Employee Ernpioyae Employee Employee Employee Employee CREATED BY Employee Employee TempiateLAb"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "orgchart10",
        "ocr_text": "a Norton Inc ala University Francis Moore Marketing Director Panna Richard Terrell Kelly Herrera Manager Manager Manager -—_ _ ___ ——_ __ (& PX ga Fa ala Ala rN’ N ala Ala Kristi Oliver Karl Hanson Tracy Choi Mark Harrington Debbie Harrell Manager Manager Manager Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee | | Employee Employee Employee CREATED BY TemplateLAB"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "orgchart10",
        "ocr_text": "a Norton Inc aia University Francis Moore Marketing Director Brianna Richard Terrell Kelly Herrera Manager Manager Manager | id pa (a ma ma Ala ala Ala Ala y NY N Kristi Oliver Karl Hanson Tracy Choi Mark Harrington Debbie Harrell Manager Manager Manager Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee CREATED BY TemplateLAB rr"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "orgchart10",
        "ocr_text": "Morris- Youn School Chelsea Fox Marketing Director Stephen Clayton Courtney Mendez Sara Brown Manager Manager Manager oak Randall Lewis Robert Davis Pa ane da Andrew Johnsen Michael Manager Manage! Vag) use Manager Manager i | Employee Employee Employee Employee Employee | Employee Employee Employee Employes Employee Employee Employee Employee CREATED BY YemplateLAB"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "orgchart10",
        "ocr_text": "ae Morris Young 7 School Chelsea Fox Marketing Director Stephen Clayton Courtney Mendez Sara Brown Manager Manager ma a a yw N Ala Ala y NY ala Randall Lewis Robert Davis David Andrew Johnson Michael Manager Manager Caglaneda Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee | Employee Employee Employee CREATED BY TemplateLAB ee"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "orgchart10",
        "ocr_text": "Morris Young School Chelsea Fox Marketing Director Courtney Mendez Sara Brown Manager Stephen Clayton Manager Manager Randall Lewis Robert Davis ane Andrew Johnson Michgel Manager Manager Cag ke jada Manager Manager Employee Employee Employee Employee Employee Employee Employes Employee Erapioyes Employee employes Employee Employee CkEATED BY ‘TempiateL AB"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "orgchart10",
        "ocr_text": "“ Morris Young kde School Chelsea Fox Marketing Director Courtney Mendez Sara Brown Manager Manager Stephen Clayton ~ a a y Ny N Ala Ala Ala Ala Randall Lewis Robert Davis cee aa Andrew Johnson aie Manager Manager agkaned Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee | | Employee Employee Employee TemplateLAB a"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "orgchart10",
        "ocr_text": "Morris Young School Abe Chelsea Fox Marketing Director Stephen Clayton Courtney Mendez Sara Brown Manager Manager Manager —— _ _ me a a Ala y NY N ala y NY N y NY N Randall Lewis Robert Davis C eens 7 Andrew Johnson aatilo Manager Manager ay ned Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee CREATED BY TemplateLAB"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "orgchart10",
        "ocr_text": "a Kennedy PLC PNT Academy Aaron Garza Marketing Director Anthony Jordan Michael Ruiz Stacey Hart Manager Manager Manager —— (&% = ey Ala Ala Ala Ala Ala Christina Howell Meisnaslin Justin Kerr Richard Miller ani Manager Manager Manager Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee CREATEO BY TemplateLAB"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "orgchart10",
        "ocr_text": "Academy Aaron Garza Marketing Director Anthony Jordan Michael Ruiz Stacey Hart Manager Manager Manager — ae I J Mee, FN? des, Al, ial Loe fichae! 2 ; nifer Christina Howell Melaughiin Justin Kerr Richard Miler jennie Manager Manager Manager Manager Manager i Employee Employee Employee Employee Employee Empioyee Employee Employee Employee Employee | Employee Employee Employee CREATEO BY TempiateL AB"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "orgchart10",
        "ocr_text": "Kennedy PLC Academy Aaron Garza Marketing Director Anthony Jordan Michael Ruiz Stacey Hart Manager Manager Manager Christina Howell Me snaFilin Justin Kerr Richard Miller ennifer Manager Manager Manager Manager Manager Employee Employee Empioyee Employee Employee Empioyee Employee Employee Employee Empioyee | Employee Employee Employee CAEATED BY TemplateL AB"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "orgchart10",
        "ocr_text": "Kennedy PLC Academy Aaron Garza Marketing Director Anthony Jordan Michael Ruiz Stacey Hart Manager Manager Manager __l Christina Howell MeBUg ln Justin Kerr Richard Miller ee Manager Manager Manager Manager Manager i i Employee Employee Employee Employee Employee Employee Employee Employee Erployee Employee Employee Employee Employee cagaren ey TempiateL AB"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "orgchart10",
        "ocr_text": "Kennedy PLC ala Academy Aaron Garza Marketing Director Anthony Jordan Michael Ruiz Stacey Hart Manager Manager Manager __ _i _ _ a a a y NY N y NY N Ala Ala Ala Christina Howell Mishary Justin Kerr Richard Miller ennifer Manager Manager Manager Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee CREATED BY TemplateLAB"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "orgchart10",
        "ocr_text": "Smith Group institute Mr. Timothy Lewis V Marketing Director Ross Rogers Scott Macdonald Eric Russell Manager Manager Manager —— ie ln 3h. Py Daniel Mccail Willian Wagner CeSFty Carolyn Hemandez Tracy Williams Manager Manager Manager Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee | Employee Employee Employee cREAr EDS SY TemplateL Ag"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "orgchart10",
        "ocr_text": "Smith Group Institute Mr. Timothy Lewis V Marketing Director Ross Rogers Manager L ree Scott Macdonaid Eric Russell Manager Manager Al pM? 3 Be, as, Maniel Mccall Willlarn Wagner conabell Carolyn Hernandez Tracy Willams Manager Manager Manager Manager Manager i Employee Employee Employee Employee Employee | Employee Employee Employes Employee Employes Employee Employee Employee CREATED BY YemplateLAB"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "orgchart10",
        "ocr_text": "ae Smith Group Abe Institute Mr. Timothy Lewis V Marketing Director Ross Rogers Scott Macdonald Eric Russell Manager Manager Manager —— 9 QQ 9 Ala Ala Ala y NY N Ala Daniel Mccall William Wagner cPss aT Carolyn Hernandez Tracy Williams Manager Manager aiBeer Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee CREATED BY TemplateLAB"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "orgchart10",
        "ocr_text": "| Smith Group Babe Mr. Timothy Lewis V n S ti tu te Marketing Director Ross Rogers Scott Macdonald Manager Manager Eric fxussell fm ~~ fe fe ~~ Ala yy N ala Mala Ala Daniel Mccall William Wagner campbe ll Carolyn Hernandez Tracy Williams Manager Manager Manager Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee CREATED By TemplateLAB"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "orgchart10",
        "ocr_text": "li Institute Mr. Timothy Lewis Vv Marketing Director Ross Rogers Scott Macdonaia Eric Russel] Manager Manager Manager ‘aa oo Danie! Mccai! William Wagner C Oscar Carolyn Hemandes Tracy Williams Manager Manager Manager Manager Manager | Employee Employee Employee Empioyee Employee Employes Employee Employee Employee Employee Employse Employee Employee Stare ay Tempisiae: an"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "orgchart10",
        "ocr_text": "Martinez Kelly school Marissa Thomas Marketing Director ee Hector Rodriguez Mr, Jesse Logan MOD Srandy Pittman Manager Manager Manager ——l Jennifer Brown Robert Owen Ge as Drew Castillo Joseph Brown Manager Manager MG aun Manager Manager Employee Employee Employee Employes Employee Employee Employee Employee Employee Employee Employee Employee Employee cageren ay TempisieL AB"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "orgchart10",
        "ocr_text": "Martinez Kelly School Marissa Thomas Marketing Director Hector Rodriguez Mr. Jesse Logan MD Brandy Pittman Manager Manager Manager Jennifer Brown Robert Owen Tina Drew Castillo Joseph Brown Manager Manager isa) Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee CREATED BY TemplateLAB"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "orgchart10",
        "ocr_text": "Martinez Kelly el School Marissa Thomas Marketing Director Hecter Rodriguez Mr. Jesse Logan MD Brandy Pittman Manager Manager Manager -———_l___ —— Jennifer Brown Robert Qwen _ lina Drew Castillo Joseph Brown Manager Manager Graham Manager Manager Employes Employes Employee Employee Empioyee Employee Employee Employee Employes Employes Employee Employee Employee sngeren ay TemplateL AB"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "orgchart10",
        "ocr_text": "Martinez Kelly School Marissa Thomas Marketing Director Brandy Pittman Mr. Jesse Logan MD Hector Rodriguez Manager Manager Manager Le Jennifer Brown Robert Owen Drew Castillo Joseph Brown Manager Manager Manager Manager Employee Employee Employee Employee Employes Employes Employee Employee Employee Employee Employes Employee Employee CHEATED ay YémplateLAB"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "orgchart10",
        "ocr_text": "Marissa Thomas Marketing Director Brandy Pittman Manager Mr. Jesse Logan MD Hector Rodriguez Manager Manager ____ _— _ oO (3 Al» a Drew Castillo Joseph Brown Manager ayaa Manager y NY Jennifer Brown Robert Owen Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee | Employee Employee CREATED BY TemplateLAB Employee"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "orgchart10",
        "ocr_text": "Parker LLC stitute eld Amy Chambers Marketing Director April Torres Michael Osborne Manager Michael Boyd Manager Manager 9 a 2 Amanda Davenport Abigail Gibson iJliam Karen Jenkins David Prince Manager Manager r Manager Manager Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee TemplateLAB ees"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "orgchart10",
        "ocr_text": "Parker LLC nstitute Amy Chambers Marketing Director Michae! Boyd Michael Osborne April Torres Manager Manager Manager —~ Te a PNY yoNyY rN? hy le, Amanda Davenport Abigail Gibson Wale Karen Jenkins David Prince Manager Manager F ay r Manager Manager | i Employee Employee Employee Employee Empioyee mpioyee Employee Employee Employee Employee Employee Employee Employee caearen ay TempiateL AS"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "orgchart10",
        "ocr_text": "Parker LLC institute Amy Chambers Marketing Director Michael Boyd Michael Osborne Ap ri Torres Manager Manager Manager Amanda Davenport Abigail Gibson will m Karen Jenkins David Prince Manager Manager fi fe yar Manager Manager | Empiovee Employee Employee Employee Employee Employee Employee Employee Employee Employee Employee Empioyee Employes cRBATEO BY Temp iaieLAS"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "orgchart10",
        "ocr_text": "> Parker LLC Amy ren! NS U tu le Michael Boyd Michael Osbome Manager Manager Amanda Davenport Abigail Gibson Mi m Karen Jenkins David Prince Manager Manager r Manager Manager | | Employee Employes Employee Employee Employee ] I | Employee Empioyee Employee Employee Employee i I Employee Employee Employee Spearen py Template, ar"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "orgchart10",
        "ocr_text": "Amy Chambers Marketing Director April Torres Manager Michael Boye Michael Osbome Manager Manager i lL Wijiiamn Karen Jenkins David Prince Manager Amanda Davenport Abigail Gibson Manager “Manager YAR, Manager | | | Employee Employes Employee Employes Employee | Employee Employee Employee Empioyee Employee Employes Employes Employee TempiateL Ar"
    }
]