[
    {
        "image": "policy1_synth_10_aug1.png",
        "label": "policy",
        "ocr_text": "NAGA POLYTECHNIC UNIVERSITY Document Tite POLICY DOCUMENT Tesue dale [sage Date: Maoh 73 2008 Aathor shee Oe Kosten Kal Aopioved by Assroved by. VE Justa War iow dale Review Data: Ontober aly on aati hn an eica conan aC We NAGA POLYTECHNIC UNIVERSITY ACADEMIC INTEGRITY POLICY Context andlor Aims This policy estabishes standards for academic integrity within Naga Polytechnic University. It defines acceptable academic practices and ‘addresses Violations including plagiarism, cheating, and fasication of records, ‘The policy aims to foster a cuture of honesty and ethical behavior in al academic actives. It provides clear guidelines for students, acuity, and staf regarding proper citation, colaboration, and original work. ‘Allmembers of the academic communty are responsible for upholding these standards. The policy outines procedures for reporting violations, investigation processes, and sanctions for academic misconduct, Policy Statoment Al students are expected to maintain the highest standards of academic integriy. Violations including plagiarism, cheating, fabrication, and unauthorized colaborstion wil result in dicipinary action ranging from ‘grade pensities to expulsion. Faculy members are responsible for clearly ‘communicating expectations and reporting suspected violations to the ‘Academic Integrty Commitee ‘ACADEMIC INTEGRITY POLICY Pave tof 8"
    },
    {
        "image": "policy1_synth_10_aug2.png",
        "label": "policy",
        "ocr_text": "NAGA POLYTECHNIC UNIVERSITY ACADEMIC INTE: ITY POLICY Tih pevicy esto Potechinss sors tor acacenn wy athe, LUnwersay. deiines secentabie neaicinks ptines 2 s8e8 vi fabiteston of “canting papain, che a coty see etviea! benavics ws Bi ncasgemer actiigs. IL ovis clear quizeings fos students, aout, ana ole vegarding prope: cxaton, cube aban, and orig Aimnmonters ofthe acsedeme comms she niy are resonate tor sito tandards. The poy outloes ten maccnaust 9 tha Mighert andes of w snuegety Vingtons omanding sagan tere uthoee oateoraton wt asut mn dscebeaiy atin range fom"
    },
    {
        "image": "policy1_synth_10_aug3.png",
        "label": "policy",
        "ocr_text": "NAGA POLYTECHIIG UNIVERSITY ACADEMIC INTEGRITY POLICY teat enon No “The pois eoabinhes siardavas for academe wiegrty wAhin Hage Praytachnic Unieraby. i Cethwes seceptatis academe peaches ad 2errexans vikwions netdng clagignam, cheating, aed Wwnticaton recess, “The pole aims te foster suture of honesty’ era ethient behavice I ab ncademis ontviies provides clear qucbeines for swuderts tecsely, wd stat roging proser chain, colaperalion, and ongeal work AS ments of he acadmine commanty are responsi tr useing ene santero. The pofzy cules procedures tr renEeing icttions, meesiigaton processes and wan tone fer aceaweic mesconetact ey Statement ‘A2 wuderts ame expacted to manta ne highs! standards of academe megey vormeens ncucrg pagararn chasing foemanns, ah nestateed codaborvien wi nent m Benpinery BetLn angi Hr Diade pensties te expuiecn, Faovty marten si w pensbie for omerty cormunkainy exceciatans and yong tune ected wombs 19 Te, cadence Wvagrty Commie (ACADEWIE INTEGRITY POUCY PRET"
    },
    {
        "image": "policy1_synth_10_aug4.png",
        "label": "policy",
        "ocr_text": "HAGA POLYTECHNIC UNIVERSITY Ta rm [POLICY DOCUMENT NAGA POLYTECHNIC UNIVERSITY ACADEMIC INTEGRITY POLICY ‘The pokey ara to foster vereeme sctvtes I proves citar guoeines 1: SSS facoty and staff regarding proper ctaton, com work Poy Statement ‘as sudents are expected to mantan the Namen ag pageram chewing tenreaton 6nd cae ee rounvorton wt et n sacoinany ton 9908 rece penaten to exovnn Fact aoe orcaing expectations and reporing nsoected eademe Integrey Commies Teabee wTEGRITY POUCY PARE"
    },
    {
        "image": "policy1_synth_10_aug5.png",
        "label": "policy",
        "ocr_text": "NAGA POLYTECHNIC UNIVERSITY Bososenetie POLICY DOCUMENT Tasve date ligage Date: March 73, 2005 Autor Aer De Kosi Kalen [Boor oy | Assoced by. VP Josie Wake view ote Reece Date Oxtabet 2028 Pc anaes ney sec ona aS HO NAGA POLYTECHNIC UNIVERSITY ACADEMIC INTEGRITY POLICY Context andior Aims ‘This policy estabishes standards for academic integrity wahin Naga Polytechnic University. Itdefines acceptable academic practices and addresses violations including plagiarism, cheating, and falsification of records. “The pokey aims to foster a culture of honesty and ethical behavior in all academic activities. It provides clear guidelines for students, acuity, and staff regarding proper ctation, colaboraion, and orginal work. ‘Allmembers of the academic communty are responsible for uphokiing these standards. The poly outines procedures for reporting ‘lations, investigation processes, and sanctions for academic misconduct. Policy Statement [Alstudents are expected to maintain the highest standards of academic integrty. Vilatons incuding plagiarism, cheating, fabreation. and Unauthorized colaboration wil result in discipinaryacton ranging from ‘grade penati to expulsion. Facuty members are responszie for ceaty Communicating expectations and reporing suspected volatons to the ‘Academic Integrty Committe, \"ACADEMIC INTEGRITY POLICY P 9e tot &"
    },
    {
        "image": "policy1_synth_1_aug1.png",
        "label": "policy",
        "ocr_text": "DAVAO GITY POLYTECHNIC UNIVERSITY AVA Gry POL YTECHERC LEAVERSITY STUDENT CONDUCT CODE Conse wer Aime ‘The code eatabiianes nehovieral arpecistiony ‘al students at ‘Davao City Potytechas Univeraty. 2 prometon sabe, rexpecttt, and conducive erring envronmant Ice Al maat ne of De weaiene communty, ‘The code addenses varus forms of ma conict mckuting haramsmact, cacreneuonn, vinence, aubetance abuse. 2nd pover y Gemage \"loutree the rgtts ant respanebitae of sudants i the Gacieinny process Dinciptnary actors range from warnings fo expcition Seating on ie seventy of vilatont The cose enwures due prucens and fae vate tox a tasers Pome ert Ao ateneins rut Sond NEE a aera sect AEG Gree ad suggit Se wivatonal asin the Daecen PyDied cera erhon omy seal vamos, haranemnit anion ther Pace Ae Peabe. ON A Nra QoLe Ve Eure WO Do Madre enue ts Steet Oueary Comentise WO: abwlens Peng poeHeN Dapemion. 9 engninn ob arpeate “Frome conver cone PF"
    },
    {
        "image": "policy1_synth_1_aug2.png",
        "label": "policy",
        "ocr_text": "DAVAO CITY POLYTECHNIC UNIVERSITY Bocumen tite POLICY DOCUMENT tee aa Yas De ator [Rat ca ae Standards of behavior and ciscpinary procedures for students DAVAO CITY POLYTECHNIC UNIVERSITY STUDENT CONDUCT CODE Context andlor Aims ‘This code estabishes behavioral expectations for ai students at Davao City Polytechnic University I promotes a safe, respectful and conducive learning environment forall members of the academic community ‘The code addresses various forms of misconduct including harassment, discrimination, vilence, substance abuse, and property damage. It outines the rights and responsibiltes of students inthe diacipinary process. Discipinary actions range from warnings to expulsion depending on the severty of violations. The code ensures due process and fair ‘treatment for al students Policy Statement [A students must conduct themseWes ina manner that respects the rights of thers and suppers the educational mission ofthe institution. Prohibited conduct ‘ncludes physical violence, harassment, academic dishonesty, substance abuse ‘on campus, and volation of university poicies. Violations wil be addressed through the Student Discipinary Committee wth sanctions incuding probation, suspension, or expulsion 2s appropeate, STUDENT CONDUCT CODE Pave Tof 12"
    },
    {
        "image": "policy1_synth_1_aug3.png",
        "label": "policy",
        "ocr_text": "DAVAO CITY POLYTECHNIC UNIVERSITY PeetSearruw POLICY DOCUMENT Tpsus aie sage Date January 25, 2028 Pat [Booed —| 2 Ri gale Review Date: August 2028 ‘Standards of behavior and Gaciplnary procedures fr students DAVAO CITY POLYTECHNIC UNIVERSITY STUDENT CONDUCT CODE Context andlor Aims ‘This code establishes behavioral expectations for all students at Davao Cty Polytechnic University. It promotes a safe, respectful, and ‘conducive learning environment for all members of the academic ‘community “The code addresses various forms of misconduct including harassment, discrimination, violence, substance abuse, and property ‘damage. It outines the rights and responsibites of students in the iscipinary process. Disciplinary actions range from warnings to expulsion depending on the severty of violations. The code ensures due process and fair treatment forall students. Policy Statement ‘A students must conduct themselves n a manner that respects the rights of ‘thers and supports the educational mision ofthe insttution. Protibted conduct Inches physical violence, harassment, academic Gshonesty, substance abuse ‘cn campus, and vilaton of university policies. Vielatons wilbe addressed ‘trough the Student Discipinay Commitee with sanctions inching probation, suspension, or expuslon as appropiate. ‘STUDENT CONDUCT CoE Page tof 12"
    },
    {
        "image": "policy1_synth_1_aug4.png",
        "label": "policy",
        "ocr_text": "DAVAO CITY POLYTECHNIC UNIVERSITY Sram ris [POLICY DOCUMENT sei Sle Toe Date Taam aN [Asset —t ‘Standarés of behavior and dcp wae DAVAO CITY POLY TEcHauc University STUDENT CONDUCT CODE niveciy pokes. Visations wil be asaresses Seewoh the Stent Commitee wih sanctions inceing robeton ‘seapension. or expulsion as appropeane ‘STUDENT CONDUCT CoE Page Tart"
    },
    {
        "image": "policy1_synth_1_aug5.png",
        "label": "policy",
        "ocr_text": "Ree ‘Gee bee SS. cp hn at go UIVERSTY pavan cry POLYTEGH eT CODE gTupenT COND! fog ab ata pita, ord content anor Ane ‘Thin code setinbanes pensar eee ony Payson univer, COSI aii eng ere ok TTS ere pre cone strona yt HTM isgonsket 0h Tee Serene, ducranstcnAIeTES, BE se, ar peavey erm afar? te FS 3 veaipanaaeatoe at rucents surety POETS. isciotnacy ecios abae Ota WETTIATS toexpatsnn depending of fee arvay orate ne eae enaures aus ponents an fF freatmen for abstedenls psbay amas sets net ane THESES 8 EI ena se ts of 1 a pars om eens en oS ek cont oe pe cme, DIATE, srvomaciy. stance ae we ee tn cee Ssh VOUT Spine wits ur. sar Coat WAR LENS aceasta? cpcceate open, 49709"
    },
    {
        "image": "policy1_synth_2_aug1.png",
        "label": "policy",
        "ocr_text": "CEBU STATE UNIVERSITY Document Tite POLICY DOCUMENT Tesue dale [Issue Dates June 28, 2025 Aut Audnoe Prof Susan Bur Aoproved oy: Prot Chrstogher Wana Rivow gale —[ Review Date Janay 2027 ‘Goines ea onan mang MATIN EO CEBU STATE UNIVERSITY RESEARCH ETHICS POLICY ‘Context andi Aims This policy estabishes ethical standards for research conducted by faculty and students at Cebu State Universi. It ensures protection of ‘human subjects and compliance with national and international, research ethics guideines. ‘The policy requires all research involving human participants to, ‘undergo review by the Institutional Review Board (IRB). It addresses informed consent, privacy protection, and risk minimization. Researchers must complete ethics traning and maintain the highest ‘standards of integrty in data colecton, analysis, and reporting. Poli Statement ‘Allresearch involving human subjects must receive IRB approval before ‘commencing. Researchers mist obtain informed consent from participants, protect confidential information, and minimize potential risks, Violations of research ethis wil result in suspension of research pivieges, disciplinary ‘ction, and potential legal consequences. Annual ethics taining is, mandatory forall researchers. RESEARCH ETHICS PoLcY Pase To 10"
    },
    {
        "image": "policy1_synth_2_aug2.png",
        "label": "policy",
        "ocr_text": "(CEBU STATE UNIVERSITY RESEARCH ETHICS POLICY Contes nao Ame ‘Tha poly establishes etncal standards for research conducted by tacuty and students at Cebu State Unwversty ensures protecton of ‘naman subjects and comptance wih national and ternational research ethics gudeines ‘The potcy requres al research mvoiving human partcpants to undergo review by the Insttutonal Review Board (IRB). l adsresses \\nformed consent, prvacy protection, and rak mnmaton Researchers must complete etncs tanng and mantan the highest standards of miegrty m data colecton, anatyss, and reporting Pokey Statement Ad tenn mvotong human subects must cee IRB approve! Delors ‘commencng Researchers mist obtan ntomed consent tom partepents, protect contdente! ntomaton and mnmae polenta! mks Velatons of retenrn omen wi wut n wuipenton of msearcn prvteges Sscpinery ‘scton and polenta! ga! consequences Annual ees tanng mandatory for al wearer RESEARCH ETHICS POUcY Fae"
    },
    {
        "image": "policy1_synth_2_aug3.png",
        "label": "policy",
        "ocr_text": "CEBU STATE UNIVERSITY Document thie POLICY DOCUMENT Tissue dale [issue Date June 28 2075 Author Lath: Prof Susan Bur Agproved by Ancroved by. Prot. Chstooher WEES Reson date Review Date: January 2027 Gace ec conan eer NG CEBU STATE UNIVERSITY RESEARCH ETHICS POLICY Context andior Aims This policy estabishes ethical standards for research conducted by facuity and students at Cebu State University. It ensures protection of ‘human subjects and compliance with national and international research ethics guideines. ‘The policy requires all research involving human participants to ‘undergo review by the Institutional Review Board (IRB). It addresses informed consent, privacy protection, and risk minimization, Researchers must complete ethics traning and maintain the highest ‘standards of integrity in data colecton, analysis, and reporting. Policy Statement Aresearch involving human subjects mist receive IRS approval before commencing. Researchers must obtain informed consent from parispants, Protect confidential infomation, and minimize potential rsks, Violations of ‘esearch ethics wil result in suspension of esearch privieges, dscipinary ‘ction, and potential legal consequences, Annual ethics training is: ‘mandatory for al researchers, RESEARCH ETHICS POLICY Pave To 10"
    },
    {
        "image": "policy1_synth_2_aug4.png",
        "label": "policy",
        "ocr_text": "OER STATE UaveNgary CEBU STATE UnivERsiTy RESEARCH ETHWIS FOLOY. Satan sue ain ‘This willy onisbiuhes etic stanaarte for remmarch nenductad acuity sist atuenta at Ces State Univarcity. erases pr: human subiots are compaenea wth natna’ ane internatiaan: ianaatich tics ausolies ‘The palicy comes al vexaarch mating human sarinipants to undergo review by the isethullonal Review Boerd (IRD) i adtnagnes ‘atoccnacl corsa, ingcy preiecton, sik minerdtion, Resesrctara must complete sthics taining and aan te high Standates of ntegey dats cofecion, anstyeis, and repens, Paticy Ramee Ab mmsesreh mvohang human sah ars ince IR epevat bebuse emremenong. Roveachars mnt bait Monnet mintat hee pa AAKE, ferent confidential Wiaenstion, and minke nateatal vate Vwiekone of ‘SPberwh ies wet wut 2 erapansion af musarch goveiges. @surnaey ey 8 0, ie atest apes comet OeS, Anca! atin sandstory tae st euserbece, “Reseaton Eres Pecey"
    },
    {
        "image": "policy1_synth_2_aug5.png",
        "label": "policy",
        "ocr_text": "CEBU STATE UNIVERSITY CEBU STATE UNIVERSITY RESEARCH ETHICS POLICY Conta stor Anne This poiey eutablahns eines! standards ker etaaich conduct oy tecuity and students st Cebu Stale Untrerety. I enaures protection of ronan sunjects and compionce mil rarceel aid iteenwionae research when guseines, The policy requires a rascurch irvebing human participants 9 unenge reviow by the inetistonat Rinvaen Bound (iB), M addresses ‘rteames consent, vary protector, and viak misanézation. Resource muat complete ethcs lraineg and maciain the highest stanrcurcts of waearty data comecton, mewtyne, and reporting. Paty Bateman AB cerearch ewording Maman witmec musi Meee IPB ex poral bore cremscrg Ratencners mt ten mloimed wangeis tm ga mapants, pitas aantelente! eleursabra. and mevente paves mas Velatens ot teveerch eth ve ei a mapension of maeaich pewager. azcpten can. nest pater egal conana enon, Annual ener Meneg ante, 10° 06 maar on8 RESEARCH ETHICS Oty Pe T ATT"
    },
    {
        "image": "policy1_synth_3_aug1.png",
        "label": "policy",
        "ocr_text": "OF MANILA, AVTRNOANCE BOLIC"
    },
    {
        "image": "policy1_synth_3_aug2.png",
        "label": "policy",
        "ocr_text": "UNIVERSITY OF MANILA document tase POLICY DOCUMENT issue sate [noe Date p10 ZOE Bam tee De Anataa Sm oat eg Or Tan, Wee even in| Raven De May 208 Resurements ans proceaures to stusert class aneTaaTee| UNIVERSITY OF MANILA STUDENT ATTENDANCE POLICY Context andlor Aims This policy estabishes attendance requirements forall undergraduate land graduate programs at University of Mania, Regular attendance is ‘essential for academic success and ss considered a student responsibity ‘The poiey recognizes that consistent class participation contributes signticantly to learning outcomes, It provides guidelines for acceptable absences, notficaton procedures, and consequences of excessive absences, Faculty members are requred to maintain accurate attendance records and enforce this poicy consistently across al! courses and programs Students are required to attend at least 80% of scheduled class meetings, Absences exceeding 20% may resut o automatic faiure unless excused by the Dean of Students, Valid excuses incude documented ness, famiy emergencies, and offoal universty actuiles. Students must notify instructors wihn 48 nours of any absence and provide supporing documentation wanin one week STUDENT ATTENDANCE POLIGPOR® *f8"
    },
    {
        "image": "policy1_synth_3_aug3.png",
        "label": "policy",
        "ocr_text": "UNIVERSITY OF MANILA Fr rue POLICY DOCUMENT Soe TS ce Date 1, ee ee oe ana Sa Lot Renn Beton eves owen dale Revew Date: May 2020 Se sand peers fr det cans andar UNIVERSITY OF MANILA. STUDENT ATTENDANCE POLICY Context andlor Aims “This policy estabishes attendance ‘and graduate programs at Univers tessential for academic success and. responsibilty “The policy recognizes that consistent signficanty to learning outcomes. It provides srrences notficatin procedures, and consequences of exces absences. Faculty members are records and enforce this pokey programs. requirements forall undergraduate ity of Mania. Regular attendance is is considered a student class participation contributes ‘guidelines for acceptable sve required to maintain accurate attendance consistently across all courses and policy Statement 10% of scheduled class meeting®. Students are required to attend atleast ‘tomate fature unless excused ‘Absences exceeding 20% may resut in a tiine Dean of Students, Val excuses incude dorumenied mers tary ar ems and offs university actives, Students must MY Serer wtnin 48 hours of any absence and provide SUPPORN ‘documentation wahin one week. “STupent ATTENDANCE PoLCP g* 1°"
    },
    {
        "image": "policy1_synth_3_aug4.png",
        "label": "policy",
        "ocr_text": "VERSITY OF MANILA NT ATTENDANCE Pc poly esta nd gracuate p ta signifcanty fe fearing euinomes, th speates, notfication prored peences ed lo maintain accurate attendance: Poy totarent ure nies mouse ewssvanies ves, fly ‘Stusents eu"
    },
    {
        "image": "policy1_synth_3_aug5.png",
        "label": "policy",
        "ocr_text": "UNIVERSITY OF MAN A LEAVERSITY OF MAMA STUDER? ATTENDANCE POUCY Soomect ater As Ths 2Oby eeieinen ahernicce ees tor 2 unter aceaty BE O abate TE at teres ty o! Maik Rega: ienaterce Stoewia f26 Beanie, BUS 868 IRS w CaMEAESA 3 KLE Fenpwnocty ine okey “Scent c# PAM coraatere cbc pwrceRiNe cont incen Review ‘omamnzg dcemes Rorevees oietres Se aecepratin RECOM MALE bec HON, ate omveUATLIN Ke once nee abrences Somes Seabees RITE at es 008 ete anes estas Artascen enewedng 2% 8 Toker woseen oot oe Server’ sess Dy Me Dean a! Beeaerts. Vakt muavees noe, eregenas oi crow Mebacton mtn 4 my sererwotaten oton ane wane"
    },
    {
        "image": "policy1_synth_4_aug1.png",
        "label": "policy",
        "ocr_text": "NEGROS ORIENTAL STATE UNIVERSITY Bonar POLICY DOCUMENT Document Tie Teaue dale [ase Dates ogat fashor tor Dr Jesse Leona [Aooowediby | Aooroves by Ox Shannon Wares Rew auto Review Date: November 2027 ‘ines enc onan veg naan eee NEGROS ORIENTAL STATE UNIVERSITY RESEARCH ETHICS POLICY Context andlor Aims ‘This policy establishes ethical standards for research conducted by facuity and students at Negros Oriental State University. It ensures protection of human subjects and compliance with national and international research ethics guidelines “The pokcy requires allresearch involving human participants to ‘undergo review by the Institutional Review Board (IRB). I addresses informed consent, privacy protection, and risk minimization. Researchers must complete ethics traning and maintain the highest standards of integrity in data collection, analysis, and reporting. Policy Statement [Auresearch involving human subjects must receive IRB approval before ‘commencing. Researchers must obtain informed consent fom participants, protect confidential information, and minimize potential rsks. Violations of research ethics wilresut n suspension of research privieges. dscpinary {Tton, and potential legal consequences. Annual ethies taining is mandatory forall researchers, RESEARCH ETHICS POLICY Page tof 10"
    },
    {
        "image": "policy1_synth_4_aug2.png",
        "label": "policy",
        "ocr_text": "NEGROS ORIENTAL STATE UNIVERSITY POLICY DOCUMENT 5 Tisnoe Ota Aig ‘Guo eck SBE eT RONG TIN NEGROS ORIENTAL STATE UNIVERSITY RESEARCH ETHICS POLICY Contest adie Ams ‘This poicy estabishes ethical standards for research conducted by facuty and students at Negros Oriental State Universty. It ensures protection of human subjects and complance wth natonal and international research ethics guieines, ‘The policy requres all research involving human participants to undergo review by the Institutional Review Board (IRB). It addresses informed consent, privacy protection, and risk minimization Researchers must complete ethics traning and mantan the highest standards of ntegrty in data colection, analysis, and reporting Policy Statement -Alresearch involving human subjects must receive IRB approval before commencng. Researchers must obtain nformed consent fom paropants, protect confdental nfomaton, and mnemce potental sks. Volatons of research ethics wil resutn suspension of research prvieges, dscpinary tcton, and potential egal consequences. Annual etics tailing mandatory for al researchers RESEARCH ETHICS POLICY Pave 110"
    },
    {
        "image": "policy1_synth_4_aug3.png",
        "label": "policy",
        "ocr_text": "NEGROS ORIENTAL STATE UNIVERSITY Becuneoe tie POLICY DOCUMENT Tatas [asee Date: gat 3, 2S ar ier Ores Lea Rooroed by —[Assared Bt Di Shon Waren Rev dol [Ren Dale: Naver ‘Gliese onainesan venga SO NEGROS ORIENTAL STATE UNIVERSITY RESEARCH ETHICS POLICY Context andlor Aims This policy establishes ethical standards for research conducted by facuity and students at Negros Oriental State University It ensures Protection of human subjects and compliance with national and international research ethics guidelines. ‘The policy requires all research involving human participants to undergo review by the Institutional Review Board (IRB). It addresses informed consent, privacy protection, and risk minimization Researchers must complete ethics training and maintain the highest standards of itegrty in data colection, analysis, and reporting Policy Statoment [Allresearch involving human subjects must receive IRB approval before ‘commencing. Researchers must obtain informed consent fram participants, protect confidential information, and minimize potential sks. Violations of research ethics wil resutin suspension of research privieges, disciplinary ‘ction, and potentil legal consequences. Annusl ethics trsining is, mandatory for all researchers. RESEARCH ETHICS POLICY Pave To 10"
    },
    {
        "image": "policy1_synth_4_aug4.png",
        "label": "policy",
        "ocr_text": "NEGROS ORIENTAL STATE UNIVERSITY Beconene tie POLICY DOCUMENT ogg dase Date Raga 3 205 ahr [er De st eae Rooted 7 —[Aspaved Be Di Shon Waren Rev do —T even Dai: November dois ea onaineea venga eC NEGROS ORIENTAL STATE UNIVERSITY RESEARCH ETHICS POLICY Context andlor Aims This policy estabishes ethical standards for research conducted by facuity and students at Negros Oriental State University. It ensures protection of human subjects and compliance with national and international research ethics guidelines, ‘The policy requires all research involving human participants to undergo review by the Institutional Review Board (IRB). It addresses informed consent, privacy protection, and risk minimization. Researchers must complete ethics traning and maintain the highest standards of itegrty in data colection, analysis, and reporting. Policy tatoment ‘Allresearch involving human subjects must receive IRB approval before ‘commencing. Researchers must obtain informed consent from participants, protect confdental information, and minimize potential risks. Violations of research ethics wilresultin suspension of research privieges, disciplinary ‘ction, and potential legal consequences. Annual ethics training is. ‘mandatory forall researchers. RESEARCH ETHICS POLICY Pave TF"
    },
    {
        "image": "policy1_synth_4_aug5.png",
        "label": "policy",
        "ocr_text": "NEGROS ORIENTAL STATE UNIVERSITY Boonen Tite POLICY DOCUMENT dele [ssue Date: Aaguat 1 205 Taso E Rapa 3 Acorns ny [ised br ot Sees Wa de Date: November 2027 Revew dale —T Gace nia Sra ean RE NEGROS ORIENTAL STATE UNIVERSITY RESEARCH ETHICS POLICY Context andior Aims This policy establishes ethical standards for research conducted by faculty and students at Negros Oriental State University. It ensures Protection of human subjects and compliance with national and international research ethics guidelines ‘The poly requires all research involving human participants to ‘undergo review by the Institutional Review Board (IRB). It addresses ‘informed consent, privacy protection, and risk minimization, Researchers must complete ethics training and maintain the highest standards of integrty in data colection, analysis, and reporting, Policy Statement ‘Allresearch involving human subjects must receive IRB approval before commencing. Researchers must obtain informed consent from partcpants, rotect confidential information, and minimize potential sks. Velations of ‘research ethics wilesul in suspension of research privieges, dcipinary ‘ction, and potential legal consequences. Annual ethics training mandatory for al researchers. RESEARCH ETHICS PoUcY Page Tof10"
    },
    {
        "image": "policy1_synth_5_aug1.png",
        "label": "policy",
        "ocr_text": "AmAvant DE ORO POLY vines quaseines fore enorapete Poytecine Uh oh engage with PERM The poi oe of aoc mess by maemeers of re Cogi ar Ot bannces eetot ses NY OMe A quran 2 ‘paw pokey cenognee worl meta a3 a vavabie commruneston tne paxreaning potential ats wcatng cvMerbUREAG, ONAEY patna. ane recndatona hain Aagpaes to nev personal oF sconmunty members are nave trae sai mea ACI MES pogmert a ge narasament, sharng C2 ay sgn ard dnivcate Pronecad acinnes ronan aperaaatAg Tos nec eons one neteuional orang quiere"
    },
    {
        "image": "policy1_synth_5_aug2.png",
        "label": "policy",
        "ocr_text": "[ewow dase Se Oe ronan we tion meta ace ee CAGAYAN DE ORO POLYTECHNIC UNIVERSITY SOCIAL MEDIA POLICY ‘context andor Ais ee orton snes or the appropriate use of social media ‘othe Cagayan de Oro Polytechnic UnWerskY ‘community. Itbalances freedom of x Teputaton and individual Py. recognizes social media as a valuable communication 191 we sing potential risks including cyberbuvying, privacy ea and reputational a. Tt apples to both personal and official university accounts 7” are expected to exercise responsible vce ane eapect for oers nthe sora media AWS Policy Statement students and staff are expected to use $0 Sineaty, Prohbted actives ndude hers information, iprvacy. Official univers Communications Office and fotow ins Zam wearoucy nie"
    },
    {
        "image": "policy1_synth_5_aug3.png",
        "label": "policy",
        "ocr_text": "‘This pokey provides guidelines for the appropriate use of social media ‘by members of the Cagayan de Oro Polytechnic University ‘communty balances freedom of expression win mattvtonal ‘reputation and ncwiual privacy. ‘The policy recognizes social meda as a valuable communication too! hie adsressng potental rake nckding cyberbulyng. pracy. ‘volatons, and repuiatonai harm It apples to both personal and offeia rwernty accounts ‘Al communty members are expected to exercise responstie Judgment and respect for others in ther social media activities Pency Statement “Shudents and stat wn espected t ute soce! mesa sponse, and emcaly Promoted actvtes made Reresement shemng contents ntometon meenionetng oten end posing content hat vowtes rent poles User must eapect mtelctue propeny \"ghts and prvecy Otte! vwernty soc! mesa accounts must be approved By he Communcatont Once and tolow nettvtore! Danang gudeines SOCIAL MEDIA POUCY"
    },
    {
        "image": "policy1_synth_5_aug4.png",
        "label": "policy",
        "ocr_text": "fey proves guileinen ty the supceprate use of social mas bey emmbars of the Cagavan de Ore Polytechnic Unive ovations, art essing potential aks noiutnes cyberbesiyiny, calionathains it apples te hath personal ane off inact iespect intelectual pouery oghis and"
    },
    {
        "image": "policy1_synth_5_aug5.png",
        "label": "policy",
        "ocr_text": ""
    },
    {
        "image": "policy1_synth_6_aug1.png",
        "label": "policy",
        "ocr_text": "CAGAYAN DE ORO POLYTECHNIC UNIVERSITY Become tie POLICY DOCUMENT issue date —[Tsage Date: Outeber 10 2005 aathor Buiter Pot Katy Cate rove bp Aooeoved 8 VP Rober Cates ivsow dale Raven Dat: Guta 202 equations governing the administration of examinations CAGAYAN DE ORO POLYTECHNIC UNIVERSITY EXAMINATION POLICY This policy establishes procedures for the administration of ‘examinations at Cagayan de Oro Polytechnic University. Itensures {air testing conditions and maintains academic integrity during assessment periods. ‘The policy covers scheduling, conduct during examinations, accommodation for students with disabiltes, and handling of ‘examination regularties. It apples to all forms of assessment including written exams, practical tests, and online assessments, Faculty and students share responsibilty for maintaining the integrity cof the examination process, [Al examinations must be conductes in accordance with unversty regulations ‘Students are prohibited from possessing unauthoized materials, communicating with cers, o engaging in any form of academi Eshonesty during exams. ‘Studantsrequing spe0 alaecommedations must register wih the Dsabity ‘Suppor Servis at aa vo weaks before the examination, Vilatons wal be ‘rested ag acacena misconduct and subject 1 sscininary acton EXAMINATION POLICY Fae 178"
    },
    {
        "image": "policy1_synth_6_aug2.png",
        "label": "policy",
        "ocr_text": "CAGAYAN DE ORO POLYTECHNIC UNIVERSITY Sievert ex POLICY DOCUMENT 27 CAGAYAN DE ORO POLYTECHNIC UNIVERSITY EXAMINATION POLICY Contest andor Ame The poicy estabishes procedures for the admnstraton of ‘examnatons at Cagayan de Oro Potytechne Unversty Itensures tae testng constons and mantans acageme ntegety du ng assessment periods The pokey covers scheduing, conduct durng examnatons accommodation for students weh dsabstees, ang handing of ‘examnaton rreguartes It agpbes to al forms of assessment including witten exams, practcal tests, and onine assessments, Facuty and students share respons bat for mantaning the ntegrty of me examnaton process Pokey Statement As eramnators mast te conauctes 0 Becorsance wth covernty repuatons Stuserts are promotes tom sousesing warerzed materas communcatng en ares or engagng ay fom of aeaseme Sarerenty aug exams Stawrts regueng spect aicommosators mat epate #2\" the Daabity Suseer Servces a aan! too newts bere the gsamnaton Voters wi be EXAMINATION POLICY PARTE"
    },
    {
        "image": "policy1_synth_6_aug3.png",
        "label": "policy",
        "ocr_text": "univers .YAN DE ORO POLYTESHI cAGavA EXPMIREATION POLICY earnest 6 “yes patoy establsnen pronesiore® evammnanans a Cagayan d Si fir isting consons SoS ea xssecamert petines. for the eamivisustion of vo Potytnctnss University. Henares goaesne negra SS Tre pofcy overs someing, comiuct Surg earn eocenasation for shedents wn abating, ane hareing ccaminadion erequarticn, apates to ai forme of SSScSInen fpesatieg rteen exes, practonlT2ete, and onan AesasSMEPH acuity ant sents shace cesponabiy for nacaing te esrAY cf oes ex aranation proses sroiey States? ve evedotnd i ancordance wth ubcsAy esa cessing witiaee MAES, SOMES IED tora of acoianss Habart cir AE athe Dist eenaenatons 0 Eeccurts are oA seth soe, OF eG BY ‘saris requtng seit Sezermadtins moat ri Sorpa Sarea wast KO AS nee fe BNE penton soars sescendasl ad wena w erat jer 8 28 {NATION POLICY"
    },
    {
        "image": "policy1_synth_6_aug4.png",
        "label": "policy",
        "ocr_text": "CAGAYAN DE ORO POLYTECHNIC UNIVERSITY Teens rua POLICY DOCUMENT. a [ssooras ox | even date Reguatens governing the arisen of examinations “CAGAYAN DE ORO POLYTECHNIC UNIVERSITY EXAMINATION POLICY"
    },
    {
        "image": "policy1_synth_6_aug5.png",
        "label": "policy",
        "ocr_text": "putons governing the sialon of ace SAGAYAN DE oFW 8: TECHS MeEesy EXAMINATION BOLADY ‘his sole eslabiinnes grocestines foe susainations st Cassayan de oy ‘at Wb ing Conathonss and msintarw a P8eusment serinds, enc Fame then, The nkcy covers scheding Sea Ir fr steaks vs inching ange Seaneretion ereaularton. i aspen to a tes ok Sekai varten exarse, sesctice wats, ae, Foci and sanlents share responciity or Srataiung the itary of the exaummatinn process SR! deg cxmmatiee, one anzesaninats lin socantance ws niver Pot vesshg enautnoian’ atm, fa of rede seing spac sues gst, asasetre dsnaresty ching aasmos, nM mt ego wih he Dy ERE Stree na be sees selon im tare Yeiaseos 8 se ‘need seamen mixsensirs pea Stbieot to deciney sete"
    },
    {
        "image": "policy1_synth_7_aug1.png",
        "label": "policy",
        "ocr_text": "ss they taehove we igte Unweorsty. 1 ensure oleae 0 ‘sro, arbi grading, of ascrimsnation, Pes 2 or dsayicontent sah gracing stan isrost be sulomited in srsed a 8 Ste Anpeats Cortera nkse suidenie of yroeeavea! eno: demons:"
    },
    {
        "image": "policy1_synth_7_aug2.png",
        "label": "policy",
        "ocr_text": "LOILG city stay Ponaaes rs oscar sousuig rim oa natin LOO CITY STATE UNVERSITy GRADE APPEA), POLIOY rao aan sioss This Felcy orewides 3 foreat acess for sudats to cheng aces bey veleve were assigned unisky ar correct a a Sy State Univeraty, treasures due process vtde maintaining academe standsras aera faculty auihorty, ‘The pofcy recngnizes the mpwrtanco of fr een! ancorate evading aintaning academic etesaiy. i estabiaries ciese arocadines Sabres, and grounde fos grade waceais Algraie snyeals mutt bo naaed on demonste ating, oF swcrimnaton, Peewona! wth grading at ible enter, arbitat ortstences or doids ae not vad geese fix appeal. Pees! met Sivconis mae spoat nat andes wae 5 Avpneis evs ve subiales in rang 19 the Hapadnens Gowen ecurseviation sumsoding the oko wi grating ans. Tha upped ll ea sewed by Grads Azpeate Cortmtiee cans space fom ota Heaing eat gre posting, 19 of Yeo stside the sustenty depanaen. Gesisone are ‘ates eviderica of picvediat ans is demonstrated GRADE APPEL 20"
    },
    {
        "image": "policy1_synth_7_aug3.png",
        "label": "policy",
        "ocr_text": "OKO S77 STATE UNIVERSITY mn [POUIY, nee Slane Ts LOROUMY STATE UNIVERSITY GRADE APPEAL FOREN ontario racy ents Yee ccs fr aA NNT pore ete ee UE ETS, a todo ay ee aera, esata tae aCSas ie SSN od enadacas apc ixcuty attatty of iow and coca BASE repestarce ‘procedures, ‘ye suey recanyizes He rercpacnng scnsnc Hegety, SeauaNshes OOH erwin, 2nd gente yea tarot agoaets oat be eats on STS a act, RIOTS aang oF dnsermeatn, Parson OOM aiaagreseeet Ser geasng stein we not 7S OS NS agpee ecu stant vos ry zeta gas 3 ME grade 22 stn ve Spain OE rang te even of gages mere meagan conse i899 owe mre fat a) 980 wai pause inact 0 2 anak acne fh Ginte faceais SH nag sardants gonacont OES oars ene dar pans 2S corean wasenen oS"
    },
    {
        "image": "policy1_synth_7_aug4.png",
        "label": "policy",
        "ocr_text": "ILOILO CITY STATE UNIVERSITY eoeeart Ti POLICY DOCUMENT ius [ese Dae Fy 2 a a a Prone ugg care yas a SETS ILOILO CITY STATE UNIVERSITY GRADE APPEAL POLICY Context andor Aims This policy provides a formal process for students to chalenge grades they beleve were assigned unfatty or incorrectly at oso City State University. It ensures due process while maintaining academic standards and faculty authority ‘The poicy recognizes the importance of fair and accurate grading in ‘maintaining academic integrity. It establishes clear procedures, timelines, and grounds for grade appeals. ‘Allgrade appeals must be based on demonstrable error, arbitrary ‘grading, or discrimination. Personal circumstances or disagreement with grading standards are not val grounds for appeal Policy tatoment ‘Students may appeal final grades wahin 30 days of grade posting ‘Appeals must be submitted in witing to the Department Chair with documentation supporting the claim of grading enor. The appeal wil be reviewed by a Grade Appeals Commitiee consisting of facity members ‘rom outside the students department. Decisions are final and binding unless evidence of procedural enor is demonstrated GRADE APPEALPOLICY Page Tot"
    },
    {
        "image": "policy1_synth_7_aug5.png",
        "label": "policy",
        "ocr_text": "ILOILO CITY STATE UNIVERSITY Finance Document Tite POLICY DOCUMENT Tas dole [Teepe Date: February 28 2025 aut Aithor Dr Kesey One [Aooroned by Assroved br rol. Peso Mase Roviow Gale Review Date: Boni 2027 Prosarest Sategrg care yas a TS RS ILOILO CITY STATE UNIVERSITY GRADE APPEAL POLICY Context andlor Aims ‘This policy provides a formal process for students to challenge ‘grades they beleve were assigned unfairy or incorrectly at loo City State University. It ensures due process while maintaining academic standards and facuity authority ‘The policy recognizes the importance of far and accurate grading in ‘maintaining academic integrity. It establishes clear procedures, timelines, and grounds for grade appeals. ‘Allgrade appeals must be based on demonstrable error, arbitrary ‘grading, or discrimination. Personal circumstances or disagreement with grading standards are not valid grounds for appeal Policy Statement Students may appeal fnal grades within 30 days of grade posting ‘Appeals must be submitted in witing to the Department Chair with documentation supporting the claim of grading enor. The appeal wil be reviewed by a Grade Appeals Commtize consisting of faculty members trom outske the students department. Decsions are final and binding unless evidence of procedural enoris demonstrated GRADE APPEAL POLICY Page ToFT"
    },
    {
        "image": "policy1_synth_8_aug1.png",
        "label": "policy",
        "ocr_text": "£GROS OCOIDENT&. STATE UNIVER Tate, Di Taoist {Ren an Meath Ea a VRogorenens 18 sereetine tr stoned data ate Beate Se) NEGRO COCIODNTAL STATE UNIVERSITY STUDENT ATTENDANCE POLICY Content ano is “This pooy ostadioinen wtendacce ecgurarvens ir ob urderyraaiae ane guia programs x Neg Gokiomas Ste Usoeeesaty Regia stencance is caverta or acadarTes CHEE aS “Fhe gnfey recognizes that sonal siasa parboipston contest sissy Wo tering auicote, K panties pido for seceta osenices, sotseaen sravekurwe, aed onsmeasenes Ct exceRtee aeesences city rembers wre repo te oitaon ancurate atenseree enawcs ons avioece ts potey conaintenly eeroas wh opareEs OMS esagenine Posing eet suidenin now equine to attri at ont 0 oF voter laws eee seeees arousing 20% ny meat m automate tare weines txcovn py ow Dean of Sisters, alah exsuves Fasvse donna heat ey Ctocrpensinn ena ofc’ unireaty eating Stvamntn uat NOM ramesane vajin 48 baste ob ang nbsnace ond brevity SURES pecan 4a te Hey"
    },
    {
        "image": "policy1_synth_8_aug2.png",
        "label": "policy",
        "ocr_text": "NEQROS SconENTAL er WE UreveRuery STUDENT ATTENDANCE Roy oy iserizncn saepacmmnents fer Page ual woRrerR a Haren Qceseron ome Urbvecaiy RABY tirana 8 sesentate aeserne secre enn ie ‘sitoreet a aturont eessonekity Ete Die racogcitss Des consistant cay Partiiation cocormetay AAMERY Bo lceonog citoonen genes Sitstnes *or ascot SONS, NR RoR echoes, ay Sonsrquerces cf axccse etome. Feathers i ected ts sin sec renee and ortare fig 128 Hieron BoRcy coraienay ge programs P88 A conse ane PM FAM 0 acest Hass mms 208 way eat 3 swt faene smtess encore vega ato Sticens vais exouses nous ag 8 fess Seip Pee htt Stl unienyaciveas Staten ney Prose maparting"
    },
    {
        "image": "policy1_synth_8_aug3.png",
        "label": "policy",
        "ocr_text": "Ur vent Gas wiser EAH OLEDENTAS STATE ADAVERSTIT STUDENT ATTENDANCE POLICY Senin os ver andiny estaba aires aguiments So ak uniereestuie ae geacuate progres m Nagios oceiSenta State Gnnee sR epean amen psa aces woes ‘eapaatare a chabert 2008 ent inne pardcipation coirintaa peoviees asoins Wr aoceTiNe evnnieennces 0 eat es apeences paca meiner we regs inantan sonra aence report anes encene Bis pec eonesendly areas a astra Sh peau. Peleg tater srogarta nig vous to eed at tune 8% of uahearad cats wana: phumneas quceading 73% may ste somatic fade nhs aveznet ns. Veo! teneres noha Somuramed recs, Fy ing the Deon £8 S00 eerpencns, anc Poe) esheony acibisen, Shute at natky senate eosth Ai noua of ang Sanne ahd wells SP BOAD Saouisamtscon satin crs ame"
    },
    {
        "image": "policy1_synth_8_aug4.png",
        "label": "policy",
        "ocr_text": ""
    },
    {
        "image": "policy1_synth_8_aug5.png",
        "label": "policy",
        "ocr_text": "“This patey eatansisnes al yin Dean baits sertee anes, Fthy"
    },
    {
        "image": "policy1_synth_9_aug1.png",
        "label": "policy",
        "ocr_text": "RESEARCH ETHICS PoLigY Sen asic Aes [28 Pedey astehisins stica\\ esate top {Betity ant atatents ot Ueivaccky cé Bae aes Meoscrse srometon ct ‘isan sutecle ars corsetarce vith naiana se iterations venesech etios gurdearee Pessearchers mast Siam oF aeaney ERNE Stes arstang are main te Right Pesiter soteetine, rates, 209 vapors cries 186 oa bejone, Mf eanseit fo prepara sist Potential ices, Vicktor ot dete eng nt ME hc setzendon of meezan proceed a nena Peters tastcoraeareions Zonatenie ey a Nandatars tor $8 ecearenacg, Satin erase po"
    },
    {
        "image": "policy1_synth_9_aug2.png",
        "label": "policy",
        "ocr_text": "UNIVERSITY RESEARCH ETHICS POLICY"
    },
    {
        "image": "policy1_synth_9_aug3.png",
        "label": "policy",
        "ocr_text": "ny OF BADOL:"
    },
    {
        "image": "policy1_synth_9_aug4.png",
        "label": "policy",
        "ocr_text": "UNIVERSITY OF BACOLOD oatsseeciee POLICY DOCUMENT ‘sue cals [sue Date Fess aah Aator isl Bar fear Bop oT ued BY WP Desens per Rewew date Te UNIVERSITY OF BACOLOD. RESEARCH ETHICS PoLicy ete ethics training and mantan the nghest (ata collection, analysis, and reporting Standards of integrity in Policy Statement Allresearch involung human subects mus commencing, Researchers must obtan nia protect confidential information, and mace ‘esearch ethies wil esut m suspension of anda iaheel #94! consequences. Annual eee reigns mandatory for al researcners cere IRS approval before med sonsent Hom pancoants, ie potenti! risks. Voistons of RESEARCH ETHICS PoLicy Page TATE"
    },
    {
        "image": "policy1_synth_9_aug5.png",
        "label": "policy",
        "ocr_text": "UNIVERSITY OF BACOLOD UNIVERSITY OF BACOL RESEAROH ETHIUS POLICY This pode: eotaoiates sench 20 acally and siudenis ot University of Bacotid, ensures protec’ mand compiance wih rational and nterrate s qucenies, exearch invoting horror: partawpants oy te ina asia eset Baar IRB), th aeinanes fect pracy aroincton, 200 risk marmizat Rosoaschers must comgiete oshis tamnieg and maittam the Naiwst Stansiards of inlegriy fe data cate Pov Seternort proval natant ort pecans. os et ei proves peony human S05 seomnnong, Researches amet attain tons 208 Poanet mvs ntorneten, art moumace eaters i. Viana oF rosea ethics wi teu!” susganison ot ascntony meses orn js res ERAS"
    },
    {
        "image": "policy2_synth_11_aug1.png",
        "label": "policy",
        "ocr_text": "LIBRARY USE Al SONDLCT POLICY STATEMENT OF PHILOSOPHY sammunity, providing resources: sears, and schstatly calleboration This palloy ous study and academic inauiry. sity Hbrary serves as the intel ensures aqui The univers and space conducive to leaming, ing an emviror ie tial litrary values. The P of forary tails eames and consideratite for others 376 2854 Jom with cotlentive needs, promating responsi atenospisere of rut balances individual freed snatoriats wisie fostering al rape ie sewvices, and roy SuppOS actions, prefanskan appropriate study orveironee rant aust future generations of scholars, ensuring susie se rescues For sioy and continued excellence ceitical in the dighat age, the lary serves 2s fat wwarsa ioxiningy styles and pesearcit uai property azofestlon masingly This polley ndaniie of acaderai: intogity and intellect As lnformation repairs are instnodoiogies wit vasintaining St POLICY ne sisierts, face, 2 varrening patvbages: Cameranity sy 10 eared fo exary ant vest sapiatatin, oe tarary aosese during pesiad noone, vale univers entre may acoss Stray 1 sergus 15 Boks Mt Gow Bemestee Reser un ees ave 4 vay heron 8 Bouin Ke Mee ashe; FBORY TC ‘ring ete, Suerte igh pees, Panera are STN cuatate Wor 2 Towe 0F Mer hela axiet Gv per day pes to notes sotaporation sr0e8 nesstinn 5 permited only in esi Lepteg se 8 pormiton reas. Mts pveigs must be siereet sagnatert gat udy 0s. GLOUP See is renee Food arc beerenen ire orctites except designated 2” sin bepomnones, here, ween conversaine, raporogrist uae ot conpuiert, x harapement a ay tend to Sue isrupite behavier, ceing os tate nemaval Renate venation ty. The, mitt, ar not rer ie subject to deny ss a1 mnsratory ss unersty 238 vernon fons, Sante pasar eto 182"
    },
    {
        "image": "policy2_synth_11_aug2.png",
        "label": "policy",
        "ocr_text": "j UBRARY USE AND CONDUC TPOUCY STATEMENT OF PHILOSOPHY brary senvn 38 the SPACE conducive te Wearing, access whike me The university 4 Intetlectiia heavt esearch end ech taining ans environs Sommunity, baration, iey ens serious sty okay suitable fo LS equitable Ay and acsxiomie inal Re: pect for shared resources and copicerst ‘alunoes individual fraucom with collective ‘noistials while foster \"for cihers ave essential itary values. The Poticy 2 attoosphere of The libeary surports acaster 298 though This peti nablity ant cont ontate study environments of acholars, ensuring suntai AS information ieracy becomes increasingly feposilory snd fear inathantote tal 998, the library serves as “ppats diverse ieg fe inter and both ning styles and research itelloeiual property protection ing laboratory. This policy les wae a sining standards of acariey POLICY AY sksdonta, Secu, and abet rave ior deoreming aevteges. Boreowiny Vile uneveseky 9 6 resuired fe ecty ance HY FeBourdes tnrmuigh subst regia materate chentets Per day par tem. Seis nay Dorris 5 tanks far to weeks; f fo Dhow oF ower. 57 feb Sereds, Renewals are par mited S books for one aammeoter, Reserve Hekta exit Ocenia tnoa ace 10 ‘Stence i conten in dose Fond ana beer ‘wit ben rites Suet Stay artes, reap detest a pect ety \"20 excep fe Gesionstad a Sesiaueted comboration spaces Mobis otonee oust ie sence Lan Peemiteg Dierontie believes, casting mediate removes ed comreraations, in wanroncat p08! violation ty may Read fo sep ie of computers, oF hansen al ie; peNvieges of others, 48 Roary materia ara anivoraty Oroperty. Theh, nalts, ton aod tepiacerent fe, Sa, ty checks a onan Nero reno of maar is aumjee £9 We maisiticy."
    },
    {
        "image": "policy2_synth_11_aug3.png",
        "label": "policy",
        "ocr_text": "OFFICE OF THE REGISTRAR POLICY NO 1 Policy No. LS 2021 257 LIBRARY USE AND NO OF PAGES: Page tots CONDUCT POLICY EFFECTIVE DATE Effective Date: June 15, 2024 STATEMENT OF PHILOSOPHY The university library serves as the intellectual heart of the academic community, providing resources and space conducive to leaming, research, and scholarly collaboration. This policy ensures equitable access while maintaining an environment suitable for serious study and academic inquiry Respect for shared resources and consideration for others are essential library values. The policy balances individual freedom with collective needs, promoting responsible use of library facilities and materials while fostering an atmosphere of mutual respect. The library supports academic success through accessible collections, professional services, and appropriate study environments. This policy protects these resources for current and future generations of scholars, ensuring sustainability and continued excellence. AAs information literacy becomes increasingly critical in the digital age, the library serves as both repository and learning laboratory. This policy framework supports diverse leaming styles and research methodologies while maintaining standards of academic integrity and intellectual property protection POLICY All students, faculty, and staff have library access during posted hours. Vaid university ID is required for entry and borrowing privieges. Community members may access library resources through guest registration. Borrowing mits: Students may borrow 5 books for two weeks; faculy may borrow 1 books for one semester. Reserve materials circulate for 2 hour or overnight periods. Renewals are permitted f no holds exist. Overdue fines are 10 pesos per day per tem. Slice is required in designated quiet study areas. Group discussion is permitted only in designated colaboration spaces, Food and beverages are prohibited except in designated areas. Mobile phones must be silenced. Laptop use is permitted with headphones, Disruptive behavior including loud conversations, inappropriate use of computers, or harassment of others, will result in immediate removal, Repeated violations may lead to suspension of ibrary privileges. Allibrary materials are university property. Theft, mutiation, or unauthorized removal of materials is subject to disciplinary action and replacement fees. Security checks at exits are mandatory,"
    },
    {
        "image": "policy2_synth_11_aug4.png",
        "label": "policy",
        "ocr_text": "OFFICE OF THE REGISTRAR 2¥ USE AND HOT POLICY i STATEMENT OF PHILOSOPHY eilecta huatt of the seademnie coinmnurlly nd echolarty zotiaboration. This policy ensues equitetio lable for serious shady éret acedarnic WORRY peawiing resource? “The university brary serves 2s the i78 vd space conceive te inamning, FesOnech, eccess vie maintaining sn envisonenect sist la Harary vatuas The woRCY ties and hers axe asc mrating meopenaiine use of Morary Hat ‘or shernd masarces end considenalion haa} fresdare with esective news, pro simospare of mutual respect Rospect segherials white fostering a Sons, gotessionsl sevicws, 208 fox current ated future genarations: she fivery suppeste academic svccess threagh anceastihe ender apprupiene staty envirarmonts, Ths paley pres hese epsom vrocheiars, annus sintainabllty ard cuxeased excellence ‘eificel in the digital age. the Hoary sonves 25 beth tramewaork supports diverse searning Styles a0 cepeerch 1 ane irtellecte! property prokertiot ‘hs tntornation iharacy bacomes increasiogty iS repository and Being laboratory mmethadalogies whtie metnisening stains ‘of scadennie Iara POLICY ‘Asean, sou, av tet ave Hoary a0aae SHG (RES NOS perening prance, Cememsony rere sy aces Hara Cee cate anoworaty Die eagned fos ay 2a 1s ough quel egal. 5 os Sor oe vorenstar Remar Coosa nes 8 18 DEST org rk: Seton nny Dero Sok Fr TaD UE; HRY Sy spumaraty cleculce tt 2 baus s« Overrght pert, Renee a8 vane fa Die ents pe ay pre tee. once i rc dosipated qu way pides. Grain Sean 9 2\" sated ols a cetepaatad colaboratien space fond and nmeenegen an praihsod excep i Gonignales areas, Mie STS rant be wovnered Lage ava perma not baasares ator, magpreorae uve ot comgskact, 4 sane of OE, ESA iarugtve neha, ecto kasd sorter ee em, Serta tors cay oa tO SNe 4 7rEes PRESS pararary ator se unter propnty. Th main, eaRINH ES semen ct mario supe wo disonteary sere are soa daery poten ars repicuarnd Stes, Sy Shas"
    },
    {
        "image": "policy2_synth_11_aug5.png",
        "label": "policy",
        "ocr_text": "OFFICE OF THE REGISTRAR POLICY NO i Policy No. LS 2021 257 LIBRARY USE AND NO OFPAGES: _ Pageiora CONDUCT POLICY EFFECTIVE DATE: Eftecive Date June 15, 2024 STATEMENT OF PHILOSOPHY"
    },
    {
        "image": "policy2_synth_12_aug1.png",
        "label": "policy",
        "ocr_text": "OFFICE OF ACADEMIC AFFAIRS, POLICY NO 3 Policy No. SA 2024 318 STUDENT NO. OF PAGES: Page 1 of5 ORGANIZATION REGISTRATION PoLicy EFFECTIVE DATE: Efwcive Date STATEMENT OF PHILOSOPHY Student orgarizations enhance campus ie through leadership development, community building, and co curricular activities that complement ac ‘ademic leaming. This policy establishes fair procedures for organization recognition while ensuring alignment with institutional values and mission. Student engagement outside the classroom is integral to holistic education and personal development. This policy supports diverse student interests while maintaining standards of responsibilty and OF stat advisor. Advisors ‘qui writen nottiction Recnutment actives must be conducted ‘Slow coeron. Hazing is stetyprohibted. Vlatons reat niremadate ‘suspension and referal to Student Disopine raantzatons hosting events must submit actviy proposals 14 ‘offsemous actites mqute addtional approvals. Orgencatons"
    },
    {
        "image": "policy2_synth_12_aug2.png",
        "label": "policy",
        "ocr_text": "OFFICE OF ACADEMIC AFFAIRS: STUDENT Ni ive tala, raver 15, 2024 VION POLIC’ STATEMENT OF PHILOSOPHY hance camnpins He through ieadership d opraer boullcing, ond ss that comple rocedures fo a ecuderic teeming. Ths prliey establishe itutio ion while ensuring alignment with in men! oulside the claseroom is integral te holistic ede jude int «dent and personal is while meintain iis policy supports diverse of responsi that prepare jos civic pautisipat cogrized orgatizations receive institutional support and iesou belan s to campus comeunity wh nis pol ional autonan egani involvement in stu mari, financial iene POLICY imations roost register sant ot 1s ovgarinations may ts caruus antics, onoess nding, and use wionty 1s fon sincions inelasin, so deiegiateton senate 9 ca. visor changes requie eo ses Renaitmsat acti must he tondurted no nimoetions 19 aul relana’ to Swsdens Desinine svenis involing exteinal speahers oF"
    },
    {
        "image": "policy2_synth_12_aug3.png",
        "label": "policy",
        "ocr_text": "OFFICE OF ACADEMIC AFFAIRS jC PGRICY NO srupenr [NO OF PAGES ORGANIZAT! SEAN ATION POLICY i EFFECTIVE DATE — -- _____ __! Boley No SADE STATEMENT OF PHILOSOPHY ‘Student organizations enhance campus lite through leadership development, community ixiiding, and co curricular activities that complemen! academic eaming. This policy establishes (air procedurns for organization recognition while ensuring alignmen with institutiona’ values and mission. ‘Student engagement outside the cisssroom I inlogral 19 holistk: education and personas development This policy supports divarse student interests while maintaining standenis of responsiblity arid accountability that prepare otudonts for civic participation. Recognizest organizations receive institutional support and msckrces to pursue their mission and activities. Thi potiny balances organizational autsnomy with university oversight, promoting positive contibutions to campus community while ensuring comptiance with sopticable reguiations. Through involvement in student ceganizations, students develop critical skills including tmamwork, project management, Cinancial iterucy, and athicai leadership. This policy framiewsak supports these Geeeeopments oppor nities ehuie meirivining appropriate institutional eversight art! risk management POLICY ‘Studem sigenzanoos push yates eieesy ath the OMe of Stolen t Aare Regamacon weguins atest 10 actvs menbart, fr teouts ancesr, 9 consihuien, and atfeas lat O ger eaters must Seer sale ongnemrt WE Ney MMOL Regetned emarcatons may vee tomous faebins. orveas huncing. 3nd ute uncerty noms. AK Acting met cOmpiy ES Laney naicas, Omenaatens maining poles fac sanctions including womng. vrbatan, or Camgatreion, Fath crgonuston rust hove a hSna teuity out! arteser Adwmcn Stns mening, mven tnencel tanatctors. ond cerrsor pale: complance Advan onenges requse wetter nottestn Fundmaing actvtes ese advance azpmoem in Shitent Mian Unaneal words must by nantanes ane womted Gieateny. Organicationel tues must be denewied m= unwary mantged wetourdt, Precrsdeans pesietas trust be rorduted mmeay MELO ecarmON, Hi 2E 6 Sem PHONE, Pulnten rN BEN ate euspernon are malar to Stusent Dace hoe Orpaneetons neat g events must guar actif popetelt 14 ane atvawe, Evens mmching ene sitoraiers °F oftemeut ostsbat mauen eddnensl apprvco. Ongenaetint are MAbs ty domages WuAeg Fie evans"
    },
    {
        "image": "policy2_synth_12_aug4.png",
        "label": "policy",
        "ocr_text": "OFFICE OF ACADEMIC AFFAIRS i STUDENT. eee EFFECTIVE DATE: GREROE STATEMENT OF PHILOSOPHY munity buiding. and precedes for hip development, prllcy estabitshas tal dons enhance comps life thraugh load ement ‘Siupdent organ c cunicular activities Inat comps fe ensuring alg ot mgpanization eocagpition ti onal development. and n and per iva classroam is integral to hoi porisit: sili maintaining stander of r Student engagernent outside This palley supports diverse student interes dents for civic paricipation: accountability that er 19 pursue their mmission ard va instiisional support und vesources rerncting positive anizational eutonomny with university oversight, n applicable regulations rganizstions 120 Recognizes activities, This gulicy ce 0 while ensuring compliance Jjudents develop siitical skits including rearmanrk, project policy hamesnek supports these sstiusionat oversight and risk management ment ja stuclent aruanizations, financial iteracy, and ethical leadership. maintaining anpropriets POLICY ‘student enparzatons mast eagutes ann sting, ane oie am win the Often 9 Student Alfons, Ragishaiion roquites at st 1S artce wanders J: Grpeneatians wesst demonsieie a foray ase, forcing, ned a yan sanctions ieding warns. srs6sbOn. Registered engantetions may use canoes two cnveersity osies, Oxgaciaations akg patie mutt nawe a uber facuky a iat vier. Adsitors attend reneings, maw inane transacions 2 are poley onrplanca, Abana aang ise od scoot sent Mars. Cranial sends nual 26 ers tovning actetien aceite ivan oppreval to is mus be opassed #7 quate Srpantzationnl te gr stacy protiies: Violins retin eras ncrsteant actesies muni oe sonductad ettiniy wibiost wmatenn, Hat sent Ds suspension sect sera yenizasons hosing avert emis subi ny sapusa 14 Says in evan, Eves nrg Nem S76 izations ace tcaie for diansges during thet events offcampya astxtes resuire itt! erouni. Suga"
    },
    {
        "image": "policy2_synth_12_aug5.png",
        "label": "policy",
        "ocr_text": "| sTupeny UNG. OF PAGES | ORGANIZATION RESSTRATON poucy BPFECTIVE ATE: Learn STATEMENT OF PHILOSOPHY socogitian wile ensuring lorment wil onan Student erqayeinent quiside the classmmam ie intagral te holistic education arel nersotal davalopayank This policy suppests diverse student interests abdle mainiining standards of cesronsitility ad arccwimtatiity that prepare students for elvis participation receive ins nett and razournes fo purcise thal mission and snoey with university oversight, prumeting positive sppticable regaistions, Receyaleed organization iutional sug “da policy baleaces organiz stone aut nitions to compass community while ensuring compliance contd op eitical okilis molating teamwork, praisct policy frarmoworis supports these croprinia institutional owersighn ane! risk managanvont Through invatverment in student organizations, managemnen, inancia Guvelepmental apponuTities aie maintaining POLICY Stodieet espana ust rato Se tecuty nese Onno and anes Het. Crqrenains ast comen se Gian of Sadan Ailabe. Reghtrstios equine 6 aa 16 antise mene, [Ragsieme oranuaisrs nay ink noite Cousies, gosees fuling, and une nosey aamne. R& actiee urd Sony cinvestite pdb. Grpastations siathg plows fase sunsions naeing ~maing, prubation, oc AeeNEmtIN uh ergnoaton musk nave Ril Sacy tat aden” Advitow sito! reeeting, seiew Prana enactinns, ant erate ohn samlarce, Anwaae mongas tegen rt nation on secetin waits macrtines one Keene Fundraiing orton gure navionea snsioat toos Stent Ain eoeisiny, Gogamzatienal tines imate depane i una ec ‘Suonesmant obvi neseh be aonducias atteiy ation! coerce, Mai is Sikaty arched, Winatins eau m Serna osoanan sit cates ty Studer: ZapSne SopNeeations Neslng ears mint SUE acts pragsnate 18 days AaNANED eM oerpur actties main SSSR! approves, Sojarieatinns ase Meta He vents bung ertanns! spate or sagas ding to evans,"
    },
    {
        "image": "policy2_synth_13_aug1.png",
        "label": "policy",
        "ocr_text": "OFF WENT SERVICES: TpOuLCY NO NO OF PAGES FACULTY WORKI GAD wy Focuce Bate cemben /T 202) i STATEMENT OF PHILOSOPHY SARIN red eat able ocUlty aon ‘cw Segeryi on tea: won ents Sainbuuer Ty pa facanty mendes can (UTE thelr rmapens ailtes whe rein posh the halen and esnnnel de suopment oppeciurtes etube eabaes Qualty (estate ond \"SCORE AS tne excesyn® deeklone con peormves ehcuead aricomes TNs colicy ealabiehes clear stonuards tee teactanyg lobes oftca hou, ant tiges the! prom tesnacte ac aderne owes Faculty oreo ‘ahias allowing tine for schedarly actrelines mmentoring aed communty angagerent Fair aorvinad cbs selitiactany and academic exceilzece acmss all peorpacis 8) reti2ct Insttuiaon! tetar on promoter: Cacetty nmantane make hayond chasse nstivetian Inciading This oli y ackrowtodgirs the dtverse coninibetons fay acacia, sdvising. mseaith supnevision, coe acenindatentive inadieciep umount developers Pecayrzing these vavine! res gansies! rermnsive Suppo for fac ully professional growth POLICY 9 Pe utr ComyenhSn RY Beas aEn ne must be oaatek amt rena wins note Me Bestar mie may IM ECE RACE TESA kt MHD Lara! BDC nth tne Bewe Teen uon Tomy sector cAvctaty an ean 2 Nevtony RORPAN AINE Megane WE GUMS 1 mac: Seed ae ru a gee Daa Bone ahrenoc atts Skerones Meaty A ALMATY Sa cimgmrnatae neO IAM Fae cae lace ant ent ERS WA ey ened AAA ome oi rats Conenate® Prgeaen CASS MER Patent aS TN ane"
    },
    {
        "image": "policy2_synth_13_aug2.png",
        "label": "policy",
        "ocr_text": "OFFIGE OF STUDENT SERVICES Rau NS STATEMENT OF PHILOSOPHY 1, and service a le ard equitable faculty workload This policy ensures chat faculty members can fulfil their msponsibiit werllife Selance and professional develupment oppo ependd oF resso! ity instiuction and recounizes that excensive workload cormmrucnises comes. This policy asiabli i standards for teauiing loads, office hours, and Service expectations chet piomota sustainable academic caree s bes lea ty workload rouse! euflect ie senting ang commnmty engage satisfaction, oritias while allowing time workioed di and scatemic excetienne sores al for sciulaiy activities, student ntes facuity retention, ribution pre programs, ‘This polloy acknovtedges the aiverse contributions faciily make beyond cisescoom ir ademic advising, research spor ensction, including Sendership. hensive suppor for faculty wrofesstonal growth Recognizing these varied r ities ensures cox POLICY Fudbiine fecuty teaching oad ie 18 24 uns per acasom courses oount as 7S unite ner et, Sitters ser0as Wwe raputar velmestere. laboratory courses nckde anita teat bomigenation fr presavation tina Frculy members snus! mui ‘at izaat sie office hours per week for stadant canstitaton, Ackil tn avin, Ofte ous ena be posted and corsistenty eoverves hv faculty may eecone reduced teanning toads 8 units boxed om essen yeosusiity Geel ont ction savugh fora apelicaton toe Oe val unig, Aditi i, Rustotion typicty assignments skye qui ine elses teuthing neyond mans toed requtos Dean aporovat end is compensate ‘sstaioned sates, Summer ig B vokinigry aad compenssted sepals. Facuty culusing cvertay) assigmenta fooe ro penaty Service expectations Hoke commitiee meintorsiip, sbatent sibs, an uma oenter seiven on at ‘east one vitor ity engagement, Fach fetime faulty iy commitize, Progeem acontinatars recews aémwistrabre lid ure,"
    },
    {
        "image": "policy2_synth_13_aug3.png",
        "label": "policy",
        "ocr_text": "OFFICE OF STUDENT SERVICES FACULTY WORKLOAD POLICY. STATEMENT OF PHILOSOPHY Effective leaching research, and service depend on ruosonable and equitable tacutty workload Getiibution. This policy ensures that focuity members can ful6 thels mesponsiitien whvie maintaining workclite balance and professional development opportunities. The university values quality instruction and recognizes that excessive workload compromises educational oucames. This policy establishes clear standards for teaching toads, olfice hours, and service expectations ihat promote sustainable scanomic careers Faculty workload must reflect institutional priorities while allowing time for scholarly activities, student mentoring. and community angagemers. Fair workioad distribution promctes faculty retention, satisfaction, und scadumic exceltonce across ail programs ‘This policy acknowledges iho Guerre contritutions faculty make beyond class nom instuction, Inchaling cumicuum development, academic advising. research suparvision, end administrative fextership. Recognizing these varied responeitiities ensures con prenansive supoutt or faculty professional growth. POLICY Fubtire taruty leaching toad 8 18 21 Unhs per academic year, cntrtued acres bro regu semesters. Grodune ‘cownen CouTW as Sunde per crest hour Laboratory courses incuude ackitanal comcensulion for apastnn fe. F ocuty merioers rast mina: at ast six ome noice per week tor mucort cons tasion. Ackdnnna! Mowe may De eaitd tr Dens arc Caseriuio ati sing. O Mee hours mwst be posted and convient conerved. Reesearch aciwe incuty ray tecerve rodured leaching lnxts Becugh foxmat apsication to De Down, Reduction typi aty sangee fram 3 6 urs oared on research ctoductuiy and enteral Rating, herent ane Savigemerne off Baby for workived react. Overiad ieecning beyons maxciom lard reqeres Dean approval and Compensated estebfaed rate. Summer tecching vobsntary od compensated veparaieny Fancy relurng overinu axsignents fang nc Decay Serie expectations wichite comintiee swanborsie, shssere advan, a3 communty engagement Bach tut tire Icy memoet serves on a ROB On8 aReverety Cxermine® Progcam cocninators /ecotve adinuntstraive bad crest."
    },
    {
        "image": "policy2_synth_13_aug4.png",
        "label": "policy",
        "ocr_text": "OFFICE OF STUDENT SERVICES STATEMENT OF PHILOSOPHY Effective teaching, research, end service depara on reasonable ancl equitable faculty workioad strbution. This palicy enaures that facuily members con fT thelr mesponsibilties white maintaining work life balance and professional davalopenant opportunities, ‘The university vaiues quathy instruction and recogrizes that excessive worklows compromives ‘educational cutsomes. This poticy establishes chew stexdard: for teaching toads, oftiow hours, sad service axpectations that promote sustainable acacermic carvers. Facutty workload must mflect insiltuiional priorities wide allowing time for scholerly activities, student mentoring, arct community engagement Fair worded distribution promotes facutty retention, satisfaction, and academic excellence across wll programs “This policy acknowledges the diverse contributions facuity make Loyond classroom instruction, including cuoiculum develogment, academic advising. reswarch supervision, and ecrrinisteative leadership. Recognizing thase varied responsibiitine ensures comprehensive support for faculty professional growth POLICY Fubsie tacety tnacling oad ie 12 21 units per acadaivic year, dnrbvied across two requiat semnesiors, Graduate ccarses count as 1 5 ulits per crn how. Labaruiery courves incude midronsi conganemton fo preparaton tne Facuty werters must arian at oot sx off hours per week fr ahadent censiutaion. AGRIC NETS may O8 recpared for theoie and Casartatan ach ving. Office hore must be pasted ana censintenty sbeerved. Researcn act e faculy ary recive reduced teaching cade through fora appicatin io te Daan. Recuctcn ay regen Wom 3 6 unte based 0 research product ans extemal ding. Aomewektre assazacants 260 walt r worwoan rosueren. COvecnas teaching beyond maximan tor reeunes Dean aprsea! and commvensited entantaes cnt. Suen teaching volutary and coronrasted separaini. Faruly refs creroes avninenes face 00 ose advising, and cornmeanty engagement. Exch Nite facisty Survea expeciainne neue connutee membersno, sizer coonsnaiare \\ecoire Sarina haee® bosd creek member vervat on atiaust one weversty comedies. Progra"
    },
    {
        "image": "policy2_synth_13_aug5.png",
        "label": "policy",
        "ocr_text": "OEFICE OF STUDENT SERVICES i oT ROLICY NO epcu neon [NO OF PAGES fpancy ~~ FERFECTIVE DAT STATEMENT OF PHILOSOPHY h, and service depend on reasonable and aquitsble f nslifes that faculty merbers can full nal development oppurlinit ity workioad eit resporaitilties while msi sining cognizes that excessive workinad compromines quality ie Jiey establishes ctear slandards for teaching toads, offiee hows, and demic careers syarsity val educational outcomes. This service expectadians that promote sustainable student Faculty workload must reflect ine priorities while aitowing time for scboterly acitv ties mentoring, end community engegemont. Fair workload distribution promotes factity cetention satisfaction, and academic evcatience across ai! progiarns. lacsroom Insinuction, including ninistrative iaaviership. 2 contieutions faculty meke bayord This palicy acknowledges the dive Ln development, academic advising, resench sti these varied responsibilities ensures comprehensive support for faculty profess’ lon, ar 8 gt POLICY Fubame teculy teaching ton 16 21 sola per acute: yeer, cintrbnted anross tu guts anmenters, Greduste ponastion ier weparstice te, aowrses court as 1 Sods oer crac next, Labaaiay acscass oksde adit! co Agsieonal oes Faculty membste naust maintain tiene! sic offre hours yer weve. tor stadent sonsutal Jequred for taste and deertalin awning, Cifice hours must be pected and conintertiy awerves. Rescarchacitve facwly may receive reduces! teaching bade drawn formal appcaton tothe Dean, Reguotion tyake angi? from 3 6 uns tact an négenieh ceo worked reduction. puss an eatabintd rates, Gurr wseigneants face no pensiy nig beers ma anum load regueres Des maeroval and anu 19feG ‘Overioas ies toweling #¢ voluntary ane cotmnensated separs student advising, und community engage, Esc fulsime tacky e aiiinstratve faa weed vice expectations inchade cormmitice manera! inemiber cenene on at ieas! cree unsennty 62 won, Program nooidenaines reo"
    },
    {
        "image": "policy2_synth_14_aug1.png",
        "label": "policy",
        "ocr_text": "OFFICE OF THE REGISTRAR Policy No. LS 2021 331 LIBRARY USE AND a CONDUCT POLICY EFFECTIVE DATE: ftecieDaw STATEMENT OF PHILOSOPHY ‘The university library serves as the intellectual heart of the academic community, providing resources ‘and space conducive to leaming, research, and scholarly collaboration. This policy ensures equitable ‘access while maintaining an environment suitable for serious study and academic inquiry. Respect for shared resources and consideration for others are essential library values. The policy balances individual freedom with collective needs, promoting responsible use of library facilities and materials while fostering an atmosphere of mutual respect. ‘The library supports academic success through accessible collections, professional services, and appropriate study environments. This policy protects these resources for current and future generations of scholars, ensuring sustainability and continued excellence. ‘As information literacy becomes increasingly critical in the digital age, the library serves as both repository and leaming laboratory. This policy framework supports diverse leaming styles and research ‘methodologies while maintaining standards of academic integrity and intellectual property protection. POLICY ‘Al students, facuty, and staff have lbrary access during posted hours. Vaid university ID is requred for entry and borrowing privileges. Community members may access Ibrary resources through guest registration. Borrowing ims: Students may borrow S books for two weeks; faculty may borrow 15 books for one semester. Reserve ‘materials circulate for 2 nour or overnight periods. Renewals are permitted f no holds exist. Overdue fines are 10 pesos er day per tem. ‘Stence is requred in designated quiet study areas. Group discussion is permed only in designated colaboration spaces, Food and beverages are prohibted except in designated areas. Moble phones must be slenced. Laptop use is permitted wih headphones Disruptve behavior, ncixding loud conversations, inappropriate use of computers, or harassment of others, wil result in immediate removal. Repeated violatons may lead to suspension of brary privieges, ‘Allerary materiais are university property. Thef, mutiaton, or unauthorized removal of materiais is subject to dscipinary ‘action and replacement fees. Securty checks at exts are mandatory"
    },
    {
        "image": "policy2_synth_14_aug2.png",
        "label": "policy",
        "ocr_text": "OFFICE OF THE REGISTRAR i LIBRARY UF CONDUCT POLICY STATEMENT OF PHILOSOPHY tptalinctuai heart of the academic community. providing resources collaboration. This policy ensures equitable us study and academic inquiry ey sees as the gaining, research, and sohel pment sultabie for ses The university ites pace conducive te while maintaining at ervire ace! sentlat Herary values. The policy Respect for shared meources and consis eeriom wilt collective needs, promoting respons nospnere of snutual resneet balances individ materials while fostering an at jens, prot those resources for current end futtre ppors academic success t appropriate study anvironments. This policy protec of echolats, ensuring sustainability amd continued excellenc Th age. the Tbraty saves ae both increxeinaly critical in the digits erring styles and research is policy framework supports diverse rds of academic intagyily and intailectsal property gcotection. mation literacy ber repository atxd loaming iaborstory. Tt methodologies widie maintalning sti POLICY AB etaente feouy, and atsi navi Nor orrowing pmReges, Comawray eee MY sy 1D a recived Yor etry amet access dyrng posted nos, Vas untve 9 vegattation cure eoUsh oi seen ey p2aanke for one semester. RABE fox bo weeks; tary may boro 1 aii, Ovardue tas are 19 beso” “este Renswnis are pormtiad €oa hos Borvavenn tte: Students rity borrows 5 BS moaterots cocusta tor Zar 1s oerTagM Ee por cay per Aa. nated COTA ston Pe298, Laptop nee te pormdied iad ony Sience ie romunes in doserrated quiet study 26 p diseuneinn i 26 Fee tp pmerages aro praising sranplir designator anes, Mekée panes isi Be Snes ‘th nesamtones sea snoppespriee use ot ceiputra, Ravaasment of ors, West 2 susparsicn of Unrary pabieges. pichutng Sard conver: Banaue behavia ‘Repeated viniatons may eas pmasiate vem snettation, or uneeshorized vemmneas of eaters i subjort to Eacemraey ‘patiwary mately are university propesty. To acim ent sepiacerrent fey, Securty chooks aes are mancarney"
    },
    {
        "image": "policy2_synth_14_aug3.png",
        "label": "policy",
        "ocr_text": "OFFICE OF THE REGISTRAR T SGV NG \\ aa LIBRARY USE AND {HG. OF PAGES TEFPRCTIVE DATE: GONDUCT POLICY STATEMENT OF PHILOSOPHY the academic community, providing reconeces auras oe ey ‘Tha university Sbrary cerves as the intellactut haart of ad space concur to learning, smauerch, an scholarly collaboration, This polls access wile mictaiaing an eciitorenent suitable for seoun study and acadar consideration for athens sre assent Horary values, The policy peads, promoting reaponsicte use of Ubrary fauitties and peck, shared resauces and raaiiom with soliectioe irigierals walle fostering an atresia Of “Thee vary sipgems academic success threagh aveassibte colections, profession sivic08. end appropriate study envinanconts. This policy protects thene resources for current end Rature generations: ad schotsre, enauring sustainability wel continued aanationce. splermation fteney becomes increasingly aikival ta the digital age, the Gbraty saves baths repository are iascing laboratory. Thi poficy remmowark suxpants Cvatse iaaming styles und researc ‘ruthodologes shite misteising standards of acaderic itegrly ses illactuns BmOPHY PICS POLICY “Ad stusects, facuay, ens alatt nave Rieary geet SURG Be ‘porraning peiibages. Comenusy rneeniars may aceane tray rebarces Wt cued hears, Vad univasnay 3% rome for entry aE sang ue ogi y borne 15 boca Tor ane memewine Reserve int verve Yen abe 1D 5808 savow ecke tex war was: footy Roronng hts: Seasons my by aries, eweqaie are peretied fa ae povbiat cirlta tor Zor oF overnight pee cy Bar ae sence a txree n deareted nut chat ares Grp saci pete only m Gest cotss a8 SFE aan vena eyes ne prtehinn excel desneabne areat, Mohie pone nthe sfenced, Lav Ane PRAMS ‘tn bearomiees 4 covemaonrs, oc Saregama of ters, SSO ‘tierugee Rotavio, ectating lox conweroatin, ngperanrit ‘Resmeiad vetsions ray fond 10 guopworian of rary prince seemed rent cosaforned veinenes of materials swank 19 soPtnary asitemry rmatevode are savvaraty propery The ratiaten, ctom and reviagesmant tons, Security checks al ava ie mannan."
    },
    {
        "image": "policy2_synth_14_aug4.png",
        "label": "policy",
        "ocr_text": "OFFICE OF THE REGISTRAR a =e LIBRARY USE AND (NC. GF PAGES GONDUST POLICY UEEFECTIVE DATE: a _ STATEMENT OF PHILOSOPHY ‘The University liorary saver as the intellectual heart of the academic community, ceaviding resources nd space coniucive 1 leaming, resaarch, and schotarly cofiatoration This policy ensures equitable accuss white maintaining an environment suitabie for sortous study and academic inquiry Respect for shared resources and consideration for others are essential ivrary valves, The policy helances individual fresco with collective needs, promoting respunsibte ute ef Sbeary tactites and enaieriais while fosteiing an atmosphere of mutual respect. ‘The leary supports academic success through uccessible collections, professional services, anit appropriate study environmacts, This policy protects thess resources for cument ena future goneratians of scholars, ensuring sustainably end continued axcellence. As information itaracy becomes increasingly critical in the digitat age, the Etxary serves ws both reponliory and learning teboratcay. This policy framemorr: supports diverse eaining styies and research mathodelogies while maintaning standards of academic integrity and intetectual property protection. POLICY ‘6 stasents, focuty, and stall have Rorery acces Gureg posted howe, Vek woiversty 1D regan he anby ae ortomen sewieges Cammunty mertans may aceon RrEry reeauress tech (cues top aN Gorrowng bs Students may borrow tanks fue tho weeks; tacuty may Berrene 15 toons Fox one semester, Reverva mantra cicutale fox Zhou o ever penods. Repent arm permed Kno neki exat. Overaue thes are 10 potce er day 2or teen ‘Saree m coqured 0 Gasignated quit stay artes. Group thscuscion permeted onty i denigrotec cotaneration space? Food and beverages ie pontted except in cealgnaied arose. Mooie ptanes muti be thence. Laphop w8e i peraneted wi hearers, Dinnuptve behav, studing kaa comverzatons, mancropriate use of computers. os harassment of oners, ai vesut mmaiato recov peated violins may was tuavennien of Reary srulegee, Aaterary rnetarias ore uaeversty peoperty Theft, multation, or urguiber te removat of mates sutyect to ceciinssy acton ard replacement foee. Secutty Checks at arts are marnseicry"
    },
    {
        "image": "policy2_synth_14_aug5.png",
        "label": "policy",
        "ocr_text": "STATEMENT of PHILOSOPHY Y Senves as Hh e scademic com foleaming, seach, 2 hag pect for shared re THUTIIY, providing nes, ton. This Study and ar ure: Policy ensures agi eine Inge Mabie Gnd Consideration tov cthars aye erlom vais Sscertal brary values, The potey {Ye Reds, promoting reeponathie respect us The fbrary supports approstias stucty of seh eSsible colle envieas Hons, 2! services, ang CF brOtects these resources 4 an ARS Continued excatience fate generations AS iniormat Pepsi \"asingiy cttteal in the MY Bid loaning, ia ls ped ‘ighal age, the Hodotagiog rework suppans Gly Biaty semves 5 isan silee wile: mains ‘es and research ‘al StODerlY protection POLICY borrowing pisragges facuty, a6 ea have HY anzens gucing EMDEIS nay sores iy. Posted h 2. VBlO invest 1D is rau Serenity Fsteres courte tor 3 Per 88 per \"ON DOSS Fo ta meter Reserve Oveedve tows are 1 proce BNC8 rembired m cesionates gut SEY aay. a 0 8 orahinwend a Foon cag bever, with nes up Gcus sian cennited cniy x den TH Sesiinated ens. Mowe arenes mune ranote Soinberation spe ai Rewesiec y"
    },
    {
        "image": "policy2_synth_15_aug1.png",
        "label": "policy",
        "ocr_text": "OFFICE OF THE REGISTRAR POLICY NO Policy No. SA 2021 861 STUDENT eas OFPAGES Page 1 of5 ORGANIZATION 7 REGISTRATION Poticy EFFECTIVE DATE: Novenberth 2024 1 STATEMENT OF PHILOSOPHY Student organizations enhance c: Student engagement outside the classroom is and personal development. This policy supports diverse student interests while maintaining standards of responsibilty and ‘ccountabilty that prepare students for civic participation, integral to holistic education Recognized organizations receive institutional Support and resources to pursue their mission and activities. This policy balances organizational autonomy with university oversight, promoting positive Contributions to campus community while ensuring ‘compliance with applicable regulations, Through involvement in student organizations, students evelop critical skils including teamwork, project ‘management, financial literacy, and ethical leadership. This policy framework supports these evelopmental opportunites while maintaining appropriate institutional oversight and risk management. POLICY Student organizations must. ‘register annualy with the Office of Student Attais facuty advisor, a cons Registation requires at east 10 active members, ‘sttuion, and offeer ist. Organizations must demon state alignment with university msion, ImoUS facies, access funding, and use unive wolating potcies face sanctons nckding waming, Registered organizations may use ca rity name, Al activities must comply wih University poteies. Orpanzatons Probation, or deregitraton Each organization must have a fultme facut or staff advisor. ‘Advisor attend meetings, review nancial transactions, and ‘ensure poley compliance. Advisor changes require wetion notteaton Organizations hosting events must submit a ctvty proposals 14 days in advance. Events involving extemal speaters or of approvals. Organizations are labie for damages durng thet events Jcampus activites requie addtional"
    },
    {
        "image": "policy2_synth_15_aug2.png",
        "label": "policy",
        "ocr_text": "OFFICE OF THE REGISTRAR POLICY NO 1 Policy No. SA 2021 861 STUDENT NO. OF PAGES Page tof5 REGISTRATION Poticy EFFECTIVE DATE: oer oo24 STATEMENT OF PHILOSOPHY ‘Student organizations enhance campus life through leadership development, community building, and co curricular activities that complement academic leaming. This policy establishes fair procedures for ‘organization recognition while ensuring alignment with institutional values and mission. ‘Student engagement outside the classroom is integral to holistic education and personal development This policy supports diverse student interests while maintaining standards of responsibility and accountability that prepare students for civic participation. Recognized organizations receive institutional support and resources to pursue their mission and activities. This policy balances organizational autonomy with university oversight, promoting positive contributions to campus community while ensuring compliance with applicable regulations. Through involvement in student organizations, students develop critical skills including teamwork, project management, financial literacy, and ethical leadership. This policy framework supports these developmental opportunities while maintaining appropriate institutional oversight and risk management. POLICY ‘Student organizations must register annualy wih the Offee of Student fairs, Registration requires at least 10 active members, «2 faculy advisor, a consttuton, and offer Ist. Organations must demonstrate alignment wih universty mssion, Registered orgencations may use campus facities, access funding, and use university name. Allactvtes must comply wih Unwersty poles. Organizations violating policies face sanctions nctuding waming, probation, or deregistration. Each organization must have a fultime faculty or staff advisor. Advisors attend meetings, review financial tansactions, and ‘ensure polcy compliance. Advisor changes require wrtten notification. Fundraising activities requie advance approval fom Student Aflais. Francial records must be maintained and submitted uartery, Organizational funds must be deposted in universty managed accounts. Recrutment activities mist be conducted ethicaly wthout coercion. Hazing is sticty prohibited. Violations resut in immediate suspension and referal to Student Dscpine Organizations hosting events must submt activity proposals 14 days in advance. Events involving extemal speakers of off campus actvtes require addtional approvals. Organizations are lable for damages during their events."
    },
    {
        "image": "policy2_synth_15_aug3.png",
        "label": "policy",
        "ocr_text": "FICE OF (BOLEYN SIDE OHO. OF PAGES REGISTRATION Poucy [EFFECTIVE DATE: axivedite: (lee HE REGISTRAR STATEMENT OF PHILOSOPHY Shuster! organtzstions enhance campus fite thxagh leadership development, community building, and cneumicular activities thet comeiament ecademic iesming. Ths policy establishes teit pe sigenization ceccgnition while ensuring aligamerst sith institutional vaiies and iniasicn ‘Student engagement outside the classroom is fetegral to hollatic education and perennial Sevolnpment THis palloy supports divera student intereats ofile maintaining standards of raspensibiity and accountability that prepare stuients for eivie participat Recognized orpnizations meeive institutional support ard resources (o pursue thelr miasion ond activities. This policy balances organizational euionomy with university ovessight, praennting positive contiautions to campus community while ensuring compliance with applicable maviations “Thinugh involvement in etutent orgerizations, statente devalep ciftica: skills including teamwak, pin} management, financial Ieracy, and ethical leadership, This policy tramewok supports these developments opportunities while maintaining appropriate institutional oversight and tak management POLICY susant ampan sations mete rly wits the OHies af Dhaant Aste Repiniesion roquioes aieast 10 sey mae, a famdhy sins, sanattuton, aad offow 91 Organon mitt setnonatr might 8s nwa et ree Pegetoree eopunuasons my use eniiguc Wastiies, zee fu panty pesca. Grgenienbans ieiting pokes face eanciow nd URE oniveeity meme. AB activins st? come wes cuiding waming, prapwtig, ce daregatuben, ach ompaniceson aie Nave 8 fine Gastey nia acters Autviness attend masings, slew Iman! teneactons, and asene soley somplenee, Aitier ehangas requis ween 5 iaton Prsudcening wotlns meuica atewice appt tO Shutent Ati, Fyre mses Meal DF mkintamied end eouies seated. Cegnoantenal anes mest be cacoKsd hi usivernecsunaged ZanoUt asrhrant eseies une 1 ceed eine wit amc Hhering ety waited. Visaions M komedise snexsamsion and vetaeat Teadot Oeesping ‘Sepanenviens asting nuns ust wien setiy seperate U4 depen acvance, Ente evoiing eaten egawhece Or stlearous acts reguse asiftana! appeals. Organtawtiuns we tate for seniages doing Mes evens"
    },
    {
        "image": "policy2_synth_15_aug4.png",
        "label": "policy",
        "ocr_text": "OFFICE OF THE REGISTRAR POLICY NO 1 Policy No. SA 2021 861 STUDENT NO OF PAGES: Page tots ORGANIZATION REGISTRATION PoLicy EFFECTIVE DATE: [irre oat oo STATEMENT OF PHILOSOPHY Student organizations enhance campus life through leadership development, community building, and co curricular activities that complement academic learning. This policy establishes fair procedures for ‘organization recognition while ensuring alignment with institutional values and mission Student engagement outside the classroom is integral to holistic education and personal development This policy supports diverse student interests while maintaining standards of responsibility and accountability that prepare students for civic participation. Recognized organizations receive institutional support and resources to pursue their mission and activities. This policy balances organizational autonomy with university oversight, promoting positive contributions to campus community while ensuring compliance with applicable regulations. Through involvement in student organizations, students develop critical skills including teamwork, project management, financial literacy, and ethical leadership. This policy framework supports these developmental opportunities while maintaining appropriate institutional oversight and risk management POLICY Student organizations must egister annusly wth the Offioe of Student Affairs, Registration requires at least 10 active members, «2 fecutly advisor, a constuion, and officer Ist. Organizations must demonstrate alignment with university mission. Registered organizations may use campus feces, access funding, and use university name. All activities must comply with university policies. Organizations vilating polices face sanctions including warning, probation, or deregistration Each organization must have 2 fultime faculty or staff advisor. Advisors attend meetings, review financial transactions, and ‘ensure poly compliance. Advisor changes require wirten nattication Fundraising actwties require advance approval fom Student Affais, Financial records must be maintained and submitted quartery. Organizational funds must be deposited in university managed accounts. Recuitment activities must be conducted ethicaly without coercion, Hazing is strety prohibited. Violations result in immediate suspension and referal to Student Discipine ‘Organizations hosting events must submit actvty proposals 14 days in advance. Events involving extemal speakers or offeampus sctvtes require additional approvals. Organizations are liable for damages during ther events."
    },
    {
        "image": "policy2_synth_15_aug5.png",
        "label": "policy",
        "ocr_text": "OFFICE OF THE STATEMENT OF pig tions enhance camps fife through leaders Secular acts thal compleron seatemic n while ans LOSGPHY BP deviants, community saning. 7 Student organs 9 th atiCD reccgny fing ane Prsceduras fog S policy establishes foie 8 aligetment with institutional vations 2nd mission Stusent ongagement oulsice th This oaticy su Been 6 clase stent stacens, O77 IS integral interests abhite main fer eile psrticination Hollsie education and personae ‘hing Stanctants 6 sespongie Reccanized evoanizations 1 activi ve Institutional support aad re is volicy balances onan “One 10 caimpus community ume to p up 99 compliance 9 Abe lg contri ‘nal aicnory with university oversight while eres 100 Be Promoting pesitivs with oppilcbie rsguiay rant in musniagemant, Hinge Shade orgs thuns, shidents deveto cativat sli NOS! Meracy, ard ethic sdersilp Opgoritank a feanracek, project Ie S8lcy amour supports thee Se ile mainlanive appropriats insttorones SvOIEIOM snd dick management POLICY Student aga fesury esi96 sos aatn Resrsinsors regent at son, sion slaynon: wy te roars Reatetores arganiatins nay a ENE Sates, sores nding. WARY ees Onsncatene vennry Pam face sacs BAG weasty ai, 8 setit mue 0%, or dementrstan comely wth Pest have schisae SY cemmesence. Aa N28. eis esr gn “Ot ahan aes esse won rottncnes OH Nwety er sa. Fueswising scanty, 8, Oace sas ens eect aera om Btn nus! dyaosiey Sheet a «8. Forest ceeds miss Se mentees an submstng Sestoren actrtes ov 99 conducm SthicaBY eho “Spansion soc atnnalin Student rcp PORTO. MERE is Set prohinted, \"Winton resut in acuciese Srsnietions inate events svat vb sey Neowe mn wes move atone any R Cusoniatinns ave susie toe hg ther conan,"
    },
    {
        "image": "policy2_synth_16_aug1.png",
        "label": "policy",
        "ocr_text": "Seviorimert is tundisinectal ta the educational missin ablishes compre bers. This policy es: Prehiansive security Y Sil inst 7 ANS the well being of he university comme MeASUTES fe protect af ering a culture of shared Safety is 5 shared respons Students. Phi ‘Sty expating cosperstion aetwee Policy srometes sstences Coordinated atfors apes Security personnel, dg mpi resi BeVEntion, and 819 secudty conzems lees Ehecugh ilted 9 maintain ‘opment witrong AI8 SecUte environ, nein Thal supports foaming esearch, and “SOUNG ah eimcsphare of tee or excos, Bresticlion. This peticy In campus securiy white raspacting ights onl orivecy Combines with comm comprehansi ahagemers through i tunity igi farce and roseh adds 5 physio MONEY prepared: Secutity, behavicral con: intexgeaiey Rove mst pest 88 iteration a Gnertrcrinse breed Ck, Visor sma 20 ates io esa TegiRiet atte Secu S89 charges Vebites enter Sermates ery i HPS Must OR ny yas Sesianays #5. Sis bea ie 20 apt pencment nah cam 8 roads, Barking nei condet reper pat SamOUS. The Seeurty o oh bese, ee operates 26; ie wears, desu drupe, NAY Sindee ersnecty oa Prat ted tem i ‘Sscurty pecmunrae (ol anaahene OY Dont, ere ter “A Roktents oking teh, ape AOI vein arate tage A RAICSSIEN, cr sup aetvin ne Suto gates gry 8 608 sate osu B88 ang ae"
    },
    {
        "image": "policy2_synth_16_aug2.png",
        "label": "policy",
        "ocr_text": "OFFICE OF HUMAN RESOURCES peotley caMeussareryann (NO OF PAGES\": SEGURITY POLICY (EPFECTIVE DATE: ‘Eitealtive Bele: August 12, 2026 STATEMENT OF PHILOSOPHY A sate and seture caropue snvirnsinent is fundamental Io the extscalionat mission and the wel belng of alt comumunity members. This policy esiaiiishes comprehensive zecunty measures to pmtact ait members of ine university community and institutional toperty white fostering culture of shared resperattitty Safety ix a sherad cespanaibilly requsing cooperation batween sectatty personnel, fucully, stall, and students. This paliny nmmoies awerwites, prevention, and raid respunee to aecutty concerts Hereugh ourdingied efterts anal cloar communication channel The university ts committed to ruintaining 4 secure enviconment thal supports learning, sesearch, avd persanal Govelopmen! without creating as atnouphere of fear or axcessive reatviction. This poticy veflocts best practices in campus sacuity whie respecting Individual rights and privacy Proactive security measures, combined wit suf crenpus. Tis o citsis managers: community viglonce and amengeney preparedness, cata omprehentive azpeneck addweses physical security, Sehuelom’ concer, avi heough intergrated! systerns and tained garsavina POLICY At petsons entaring cnnenie must pexzend vais Kentiicotin ai eecuniy siseckpains, Vaskors must vexistes atthe Sacurty Office ane oisain tempura pastes. Unaathorined sey w profited ape sued bo eeapnaing char \\ebicien mening carmeiee mans dectey vale parking permite, Sposd ete Bown af owntpus omen. Packing ee omeieet only in designates area. ‘Vciahons rere Sas ax yetie Rogoundinent ‘Sacunty parirmnet nenduct rmguae paris of Hating, parking ares, ae groNinds, Exereney ead ‘mrowghol wompus Yhe Securty Otto gperatca 26 7 unl respond tp ak awraryencien, 9 sre orsted Proniviad tums inciade weapons, Heyot us. alcohol in unaincrized wees, erpoelies, ant amandouse mata, Setwity personel may conduct Leg inupections 21 mnky jonis, Fete to couperate renue meni entry Saiinient oichating Mi, nea, haroEEMSR, OF suNpiCkaLE Achy ust he reported immastately ks Samngies Semurty Aevoyesacs veneer ts aeasabis tenagh the romaus satay bting, These warings ae waned Sor aackuin Haat Suey sara mcisior pute areaa for eataty purpoues. Fontage te retainen for $0 aya ana acceneed coy Ke 6 venigasiins ba vogue by fae"
    },
    {
        "image": "policy2_synth_16_aug3.png",
        "label": "policy",
        "ocr_text": "OFFICE OF HUMAN RESOURCES: PORNO \"Ta ae CAMPUS SAFETY AND wee ACES Securniy Pour\" [EFFECTIVE DATE: FEES a a STATEMENT OF PHILOSOPHY A sale and secure campus environment is fusidamenial to the educational mission and tive wel boing of ail community membars. This palicy establishes comprehensive security measures to protect att mernbers of the university community und institution property while fostering u cutiure of shoredt responsibility, Safety is a shored responsibilty requiring cooperation between securty personnal faculy, staft, ang students, This policy promntas awarsnwss, prevention, and moid response to security concems through oodinsted efforts andi clear cemmuricalion channels. ‘The university fs committed to maintaining a secure envicormnt that supports leaning, research, ard Personal development without cresting en atmosphew of fear or excessive restiction, This policy soflects best practices in campus secusity while respecting individual righis and privacy. Prosctive securty measures. combined with community vigkance and emengency ereparedness, create a safer cempus. This comprehensive approach aadrasses physical secutity, behavioral concems, and crisis management through integiated systems and trainad perscanel POLICY Aa perecns externa campus must present val iientiicaton at wecurty checkpoints. Vietore mest regieter at the Seeuty Often ane obtaie teroormy cranes. Unzutor2ed ont in pectbesd and ripe to Sean noN g cha ges Vichictes entering campus mzt Gey vob perky cecmits, Speed bué ia 20 kph on 38 carpus roads. Parking peeratted nity 9 designated areas, Viotetions reste tbiee oF vehicle mooundren!. Securty personnel conduct regular patrot of bustiige. raring areas, an grotans. Cmergeny eat bmn are kates ‘tcoughowt campus The Sacurty Cilice uperaine 22 7 arc responnts 2 38 emergencies ProNbted tere incase wesnene, Regal drugs, alcohol n unavironted areas, expineNes, ari hezardone materi, Sewity personne mey conduct eg espectons al enty pointe, Relea ro eooperaie rasute dene ent y At reidents rckxding the, avait, narazameni, oF susplecus ectiy rat be r2poriee rmeshatety to Camus Sacurhy Aerenous reporting avelabin rough Bie CIM Katey hutine, Tenaly wanmngs Ie tued for soneut Bursa ‘Secorty cavrares montor pute arwas tor safety purpoues, Footage i retained tor 30 days ari accessed only fo securty vestigations of ae required ty iow."
    },
    {
        "image": "policy2_synth_16_aug4.png",
        "label": "policy",
        "ocr_text": "DE OF HU AN RESOUR: TPOLICY NG” “campus sareTyanp |NO. OF PAGES SECURITY POLICY and secure campus environment is fon he only ners. This ooliey estziiishe embers oi bility sity comniunily a respey yarsness, prevent “orimunication ‘The university is committed to maintaining a sscure envirenment here of fen pers vaftects best pe development without creating oF excessive pecting individual ney preparednes: cvcuity, beh a safer camp avigral conc crisis inanagener POLES vity chenkpoints, Vetors must cegister a th roped ane aubjpat te treesassing charges 18 bs 20 kph on a cane roa, Pane SF yohisls epouncmer Secuity pe agheut earraie beaguiar 18, walbing araa, and grounds, Emergunzy cad tues are looated iy Cifve enaraies 2417 ana repnonas ts Mi escergene Prohivied gains oakade weawons, Regal aruge, sia tara: the camous satey"
    },
    {
        "image": "policy2_synth_16_aug5.png",
        "label": "policy",
        "ocr_text": "OFFICE OF HUMAN RESOURCES, POLICY NO 1 Policy No. CS 2020 650 CAMPUS SAFETYAND [NO OFPAGES _ Pagetore SECURITY POLICY EFFECTIVE DATE Effective Date August 12 2024 STATEMENT OF PHILOSOPHY A safe and secure campus environment is fundamental to the educational mission and the well being of all community members. This policy establishes comprehensive security measures to protect all members of the university community and institutional property while fostering a culture of shared responsibilty. Safety is a shared responsibility requiring cooperation between security personnel, faculty, staff, and students. This policy promotes awareness, prevention, and rapid response to security concems through coordinated efforts and clear communication channels. ‘The university is committed to maintaining a secure environment that supports leaming, research, and Personal development without creating an atmosphere of fear or excessive restriction. This policy reflects best practices in campus security while respecting individual rights and privacy. Proactive security measures, combined with community vigilance and emergency preparedness, create a safer campus. This comprehensive approach addresses physical security, behavioral concems, and crisis management through integrated systems and trained personnel. POLICY ‘Allpersons entering campus must present valid identfication at security checkpoints. Visitors must register at the Securty Office and obtain temporary passes. Unauthorized entry is prohibited and subject to trespassing charges. Vehicles entering campus must display valid parking perms. Speed limit is 20 kph on all campus roads. Parking is Permitted only in designated areas. Violations result in fines or vehicle impoundment. ‘Securty personnel conduct reqular patrols of buidings, parking areas, and grounds. Emergency call boxes are located throughout campus. The Security Office operates 24 7 and responds to all emergencies, Prohibited tems include weapons, ilegal drugs, alcohol in unauthorized areas, explosives, and hazardous materials, ‘Security personnel may conduct bag inspections at entry points. Refusal to cooperate results in denied entry, ‘Allincidents including thef, assaut, harassment, o suspicious activly must be reported immediately to Campus Security. Anonymous reporting is avaiable through the campus safety hotine. Timely warnings are issued for serious threats ‘Securty cameras monitor pubic areas for safety purposes. Footage is retained for 30 days and accessed only for security investigations or as required by law."
    },
    {
        "image": "policy2_synth_17_aug1.png",
        "label": "policy",
        "ocr_text": "OFFICE OF ACADEMIC AFFAIRS. POLICY NO i Policy No. CS 2021 272 CAMPUS SAFETY AND [NO OF PAGES: Pave tofé SECURITY POLICY EFFECTIVE DATE Effective Date: February 24, 2024 STATEMENT OF PHILOSOPHY ‘A safe and secure campus environment is fundamental to the educational mission and the well being of all community members. This policy establishes comprehensive security measures to protect all members of the university community and institutional property while fostering a culture of shared responsibility, Safety is a shared responsibility requiring cooperation between security personnel, faculty, staff, and students. This policy promotes awareness, prevention, and rapid response to security concems through coordinated efforts and clear communication channels. The university is committed to maintaining a secure environment that supports learning, research, and personal development without creating an atmosphere of fear or excessive restriction. This policy reflects best practices in campus security while respecting individual rights and privacy. Proactive security measures, combined with community vigilance and emergency preparedness, create a safer campus. This comprehensive approach addresses physical security, behavioral concerns, and crisis management through integrated systems and trained personnel POLICY ‘Allpersons entering campus must present valid identfication at security checkpoints. Visitors must register at the Security Office and obtain temporary passes. Unauthorized entry is prohibited and subject to trespassing charges. Vehicles entering campus must display valid parking permits. Speed limit is 20 kph on all campus roads. Parking is permitted only in designated areas. Violations resut in fines or vehicle impoundment. Securty personnel conduct regular patrols of buildings, parking areas, and grounds. Emergency call boxes are located throughout campus. The Security Office operates 24 7 and responds to all emergencies. Prohibited tems include weapons, ilegal drugs, alcohol in unauthorized areas, explosives, and hazardous materials, Securty personne! may conduct bag inspections at entry points. Refusal to cooperate results in denied entry ‘Allincidents including theft, assaut, harassment, or suspicious activity must be reported immediately to Campus Security ‘Anonymous reporting is avaiable through the campus safety hotline, Timely warnings are issued for serious threats, Securty cameras monitor public areas for safety purposes. Footage is retained for 30 days and accessed only for securty investigations or as required by law."
    },
    {
        "image": "policy2_synth_17_aug2.png",
        "label": "policy",
        "ocr_text": "| CAMPUS SAFE SECURITY POLICY A safe and secune caus 3. This polley est “bers of the university commreuity ard ab commuanity mth “The university #8 persons dawelopsiie reflects beet practices It Proactive scully ae saier campus. 7 crate management (his pOLICY peperaen enters temporary DBE xt play vate Ba ‘tice ane sta yenas eran 0 parr ony conan ‘Secsnay oars inant sacuriy reser ASinimants bakes Tesaronan sense areas OF sevuty comerse ect it ns WF MHF porpeast. Fi canigatens OFFICE OF ACADEMIC ASEAIRS: TY AND STATEMENT OF PHILOSOPHY mmission are the welbbsing of rod respameibatty (oenetNg policy pramates sweseness Jace communication channel camisetas malréaining mines is compranen| ergs esc prea anges ssc soit Dab seecupuene cairns, 18 CY verte sxcrpons, Ho san pnt ae ereeiegomnens is finetaments wince across sacuaty while Tea crise vith commen ive approach addresses pay integaind Sy ‘Uastrined try pgs, oat ation opera ey GopeRS DG SR se, ans, ar ougis she cars AE ai to the educational Itntllches comprehensive Security MESES sratindional propatty bile fot evoperation bowen becaslly parson, §, aravertion, and rapid resperise te 280% secure eaviranment test q et eumaaphens fear or exct ny vighar feat security, BARE teens end iralned personel cs rents a8 cus chREDOAY seins a9 0 seats. FO upR ON HE pores. Seca exponent cena wn es ott coe of ating, poviena wrens, at ‘ar? ek reson aves, expen at amergencies jy master “Taney eter st, of ROS vost. supports iasming, sosear wwe rasta sedovidual tights aed pIVBCS. a aed meagan praparcein \\yistacw mat ro Lip tenpasaing CHE sexs, Heer Oores operate resale Wi ai 2 eerie wnerisety e amen ‘pavarsia to pratoct a ga cxfture of shared facoity, stett and rity concer ewcngh fy, ane 2. This sty 85, Cree ans, ane viens COR er ah tee SeCeAY arvpiss roace. Pane cab eis ara ae ig nazardoan meat 9 ey"
    },
    {
        "image": "policy2_synth_17_aug3.png",
        "label": "policy",
        "ocr_text": "OFFICE OF ACADEMIC AFFAIRS: TROLICY NOS Paiiy He CS raz GANPUS SAFETY AND NO OF PAGES Few SECURITY POLICY EFFECTIVE DATE: am Li — J STATEMENT OF PHILOSOPHY A safe and secure comeus exrvvonmons is fundernents! to the educaticaa mission and tha well being of ali community memoers. This pdlicy establistas comprehensive secuity mansures to protect sit mecubars of the university community and insiitutional property while fostering a cutue of shared responsivity. Safety is 2 shaved responsibility requiring cooperation betwoan socuity personnal. faciity, stati, arid students. This policy promotes aamoness. prevention, and ravid maponse to security concems through coordinated efforts and clear communication channets ‘The university is committed to maintaining a secure anvicomnent that supports lewring, research, ord pertora’ devalopment without creating an aunosphare Cf feat or excessive restitction. This policy affects best practions in campus cecirity while respecting individual rigtis and privacy. Prosctive security measures, combined with communty vigilance and emnenency propareunesss, croate ‘8 safer campus. This comprehensive approach addresses physical eecuity, behaviors! concerns, and crisis management thrcugh integrated systems and trained personne POLICY A persone entering can gus mast prevent vid Went ston at socurty checkponts. Visors must vege atthe Securty (Office ant cba temporary passes, Unavxices entry ie prohnted and eutieet to resounsing charges. Voniies catering canpua must Supay vad parting permits, Scosd Im 20 kph on aflcamngue roads Parkg peridiea “ely 6 dengnatey areas. Vinatont reat in fee oF vehicle enpoundrient ‘Secuity porsernel cont ragsar matrss of wubtings, pmbing areas, and grounce, Emergency cat boxes are ocatod trowpent compas The Securhy Oftce aoerates 247 and responds to 3 emergencies Fronted tee ict ae weapons, Raga Onugs, care! n unauthorized areas, waynes, an hearst mutesiths Securty yeresanei may corect ban eepecaane at entry punts Refunat to cuaueraie eats daried try Ai renders neixdeg the estat, hav zeymest, oF su rouy actuty must be reported eemviately te Cxmnpu Sect Aronpsaes repering x avatatie eos’ te campus Satety hodne Tir weninge we sued fa serous Wena. ‘Saeurty cameras monks pubic sinee for satety purposes, Footage ts retained for 3 days and accessed cniy tor #2cuty ‘nveatigitony oF ws requted by ew"
    },
    {
        "image": "policy2_synth_17_aug4.png",
        "label": "policy",
        "ocr_text": "ICE OF ACADEMIC AFFAIRS camps FETY AND SECURITY POLICY Fenruary 2 A ule and sacure campus envirann ali community members. This policy members ot the u sasponsibilty i missin and the wellbeing of ensive secunty mensurse te protect al afety is a shered responsibilty siudents. This polley promates anon coontinated efforts and nfior, and rapid mspense lo sect clear communication chanaeis ity concwins through virormont that supports lessning, research, and of teat or excessive eestiiction. This po! og individual Aghis and pel Proactive unity measures, combined with comumunity vigilance and ea safer campus. This comprehensive agomach addresses physical secumy, behevioral concesns, crisis management through integrated systems and tia POLICY lentenng camense mist pease vais Went an tompracy 936868 en at Sacurty checkpotts, Viens mast copisier athe Seu ineutraried eniry 8 prokinio and eubiecs 1 baepassing charges vehicles entering cacrgian must Gsplay vals parking perass. Spek! dite kph an a8 eer roa 8 only t decigrates ateas. Vieations result i tne oF vehisie emgoadman Secunty geenen touted cam joonduct regular uatoia of bulging, park wus, The Geurly Cfiow enetaten 24 7 antes vergeroy cai poams ues imated ports fo sh cemergecies Protec teens inckade wmanore, begat dcugn, alnohes mn unauorced areas, explonves, sad hucardous momen ‘urty atsentel may contin bag inspechans at entry points. Refusal to ccaperate resus fx tented ety A extents ineiecing thal, nova harasemant. ce suypiekeas actiety Anonymess \"apnrieg i avslatle rouge the carps watety hot oe cpr wna o Tenely wamiega a sens Secu ‘Saued fo eerinus taeits, Security sameras mori putt: areas ter eately purpose, Forigee is roained for SU days and access rvestigeatine oF us cuquices ty law."
    },
    {
        "image": "policy2_synth_17_aug5.png",
        "label": "policy",
        "ocr_text": "OF MOE OF ACADEMIC AFFAIRS. CAMPUS uty Boi lor STATEMENT OF PHILOSOPHY se atignal rip sion and the oie Ase at goenmers! iy smlasksres compunatisive sacicty measunes 19 ie! poem bers oft pity are mnetittional yropatty arse festanng 6 ire 3 shsree respomsibe ly lon betwees tecurty puroneny, trully stat and yxcnty cance cain Cope puemens pee naenels Sulety is a shacau 16890\" and rags Tespuran stugects. Tals policy promotes 4 efioes ard ieee Cormimussca tray sungaans leawrinng reseaich asi ae eererorment xe This srovtie 40 maintaaning 8% gna almesphece of {eer of aces 6 ieibat te md perv acy Geveapenant sate Oat OI 6 PUTIN Boe pure ae ORR ICY Semmens mipaeg ath ceteaunty 0 Pahari nem ait hr ndkensee shysical o0cu aut ax paesrenet sive orn inteap ates Sy ters a anate Ores every eanmperient thE POLICY tn se RAN ge pe spegue Bee ceety ect in cangnneg Crace® peetert vom sierare ston atime an Sgced nee w TURN a Cam eUt TY Fe pecs eotet LARTER DAL IBEE AE ORR ates kan cidatnns ec S88 OF AN eve acest eet gpaind brnargann scam sence 1m rated scenes 19 an errngeee as oer eoapn cameue Te ones ces no rasareoes materia ane tang oxvae ame Mee Te BREET mote en cay sorescet 0 napectione finery gowns ogee Bat Re PTINIET TET parce reuse ten, aonara Soansipart 7 Bunn oe eines ne wee SENN Soran ~ecvets Nome Tom, war songh me en Rt ean ENR Deny a Mm AE ALDH TERED DO ATO eS coe un tie son Ke water Durmonen Furage a reennis hr Ki oeve am NEENNET LS"
    },
    {
        "image": "policy2_synth_18_aug1.png",
        "label": "policy",
        "ocr_text": "OFFICE OF RESEARCH AND DEVELOPMENT ACADEMIC LEAVE OF are ABSENCE POLICY EFFECTIVE DATE: fas iK STATEMENT OF PHILOSOPHY The university recogrizes thet siudhents nay encounter circumstances requiring tempesary withdrawal from academic programs. This policy provides a stuctund process for stuciants to take leave whive maintaining thair acadenvic standing and faciitating their eventual return to complete their studies, Academic coctiruity end student wellare ore fundamental *o the institutions mission. This policy balances institutional requirements with individual student needs, eneuring fair treatment ar! cigar pmcedures for alt stakeholders The university Is committed to supporting student s during challenging times while maintnining acadeenic lntegilty and program quality. This pulizy rettacts ox dedication to student success and institutiona! excollence in providing fexibls yet structured pathways. By establishing clear guidelines fur leave of absence, the ingtitution airos to reduce uncertwinty and provide transparency in administeative processes. Students facing temporecy challenges can access this SuDo0N rmechanism witie preserving their connection to the academic community, POLICY ‘Studeras may request academe uve for modical, personal cr teanciat essen for a swrieum of 140 convene ‘emeniere, Leave requesis trust be cuterites uf eas? hwo weeks Delors Ihe stat of hie aeenester or wes ora wah ot act lemargency, Skitans cn spertved erve manta Oe earcieaet eiatun widest acederna: panty ‘Torequnst love, ehadonts musi rubra tornal applicative theough the Offs of te Repatrsr, neheing swaping greunertutnn Medea eves requre piyacan COTE aon Pereonal lewres MeQize arnen pastte Mion. Francik harasing mover raquve suxporing thencial éncumeriaticn ‘Stadents on leave are nct requred io pay tution ta eee pay a inrenal maiesnance fee, Upoe rear, stucerts mest 108094 for aamiaetor 3! least one main belore the mierded tementer, Honky reget aton fe granted to isivep students Leave perc do 70% count toward maniresn cessiency recutements Faker 0 retsrn ater apprvecd eave cr 10 request sxismaion reeuse automates weharewa! Suetena must ratan 20s acaveme standing io be sine ‘ne emve. Thou under Sucnary probe are 97h cgble aries teclemuaing crcumstonces ere dumerawates"
    },
    {
        "image": "policy2_synth_18_aug2.png",
        "label": "policy",
        "ocr_text": "HOLE OF LNG. OF PAGES CE POLICY “EEFECTIVE DATE ACA ABS STATEMENT OF PHILOSOPHY cheumstunces saguinng femputary vatioarenaa oes ty sient while wiamontal to the neurons mission Th extmient and “eat poring starlets daring chatioreang Sims vile siaintaneny acartarn agtitionat policy ceflects Gut Gadication ty stocent couse ahah let smowturedt Catinnae uiolines for owe of shserca, the insttulion aime paraig transpareery Ir aderin fw processes Shaler ts faeing \"eng oar (poet jonchanism weve ure xarving their carmeetit to the Bcosuenss Coumenia POLICY co eonberete sete fet repatane 4 gored trata g st aserss pxgeee (ninsn ertzrmatog ae eine vamarn be expe ke ane"
    },
    {
        "image": "policy2_synth_18_aug3.png",
        "label": "policy",
        "ocr_text": "OFFICE OF RESEARCH AND DEVELOPMENT ACADEMK ABSENCE POLICY POLICY NO i Policy No. AA 2021 783, IC LEAVE OF NO. OF PAGES: Page 1 of 4 EFFECTIVE DATE Fons 224 STATEMENT OF PHILOSOPHY"
    },
    {
        "image": "policy2_synth_18_aug4.png",
        "label": "policy",
        "ocr_text": "OSFICE OF RESEARCH AND DEVELOPMENT (BOLIEY NO og [NO GFBAGES Rio i (EFFECTIVE DATE: Geaeetan, 1 rary 72, 204 DADE MIC Ui ABSENCE PC ireumetar quling compurary withdrawal recess for students to take leave wh rote thale studies téversity recognizes that students may encounter from acatiemic progams. This policy wovides a structinc retinizining thelr acacomic staring ane facil pais eventual return to 02 ission. Yds polis yetment and claw Academie, continity and student welfare balances institutional requirements with ind procedures for ail stakehoiders, oritted to supporting students duging challenging times eile maintaln alicy reflecis cur dedication to skadont success 3 ing acadene sional The univessity is integrity and progam maatty. T extelience in providing flexible yat strc insti fo redure uncertainty see an accose ines for leavi the ina pride vanspamncy in administrative pronesnes. Stuarts facing tempornty chalien realy suppect mechanism while presaeving thee connection to the academic 62 POLICY Shaders may reuast aceater 2), parece, or Fewneial reanons O° a mannan of we consents sve coasts mut Ba sub at semrbaeks tefore the start ef the semaster or wines one west of th eenatgensy: Students on apgioved eave mais thes erveirvent stews withoul eoadeenic penalty “Fo request leave, siatautn nue cubrel a furmal appiosion tough the Otice ofthe Registrar, sicksing wuprerting Souumeniation. Maca eae 72ers pivician cortiaton, Preceimves rexaate writen paiheation, Faxanctat nanahe teaves raqure susnosting financial deeumencattn ‘Shades oF ave are not required to ony toSisn but mst gay a mers! naintananca rereply fee serra at faze: cre month before the intense semacter. Party ce Leave perio da rot court tnaand mantra restiensy reyiranien _tenwion segue i awomatic wiht aval, Stes msi main gear Faiee te ratucn aos aporovad eave or te venues Seam standing tobe ebglie for leave, Thess undax cisuiinary ocebadon aie not agile unless exteewating otsumstarces wre demonstrated"
    },
    {
        "image": "policy2_synth_18_aug5.png",
        "label": "policy",
        "ocr_text": "OFFICE OF RESEARCH AND DEVELOPMENT POLICY NO t Policy No. AA 2021 783 ACADEMIC LEAVEOr [NO OF PAGES: Page tore ABSENCE POLICY EFFECTIVE DATE Effective Date: February 13, 2024 STATEMENT OF PHILOSOPHY The university recognizes that students may encounter circumstances requiring temporary withdrawal from academic programs. This policy provides a structured process for students to take leave while ‘maintaining their academic standing and facilitating their eventual retum to complete their studies. Academic c and student welfare are fundamental to the institution s mission. This policy balances institutional requirements with individual student needs, ensuring fair treatment and clear procedures for all stakeholders. ‘The university is committed to supporting students during challenging times while maintaining academic integrity and program quality. This policy reflects our dedication to student success and institutional excellence in providing flexible yet structured pathways By establishing clear guidelines for leave of absence, the institution aims to reduce uncertainty and provide transparency in administrative processes. Students facing temporary challenges can access this support mechanism while preserving their connection to the academic community POLICY ‘Students may request academic leave for medical, personal, or financial reasons for a maximum of two consecutive ‘semesters. Leave requests must be submitted at least two weeks before the start of the semester or within one week of an ‘emergency. Students on approved leave maintain their enrolment status without academic penalty ‘To request leave, students must submit a formal application through the Office of the Registrar, including supporting documentation. Medical leaves require physician certification. Personal eaves require writen justfication Financial hardship leaves require supporting financial documentation, ‘Students on leave are not required to pay tution but must pay a minimal maintenance fee. Upon retur, students must reapply for admission atleast one month before the intended semester. Priory registration is granted to returning students Leave periods do not count toward maximum residency requirements, Faure to retum after approved leave or to request extension results in automatic withdrawal. Students must maintain good ‘academic standing to be elgible for leave. Those under discipinary probation are not ebgble unless extenuating circumstances are demonstrated."
    },
    {
        "image": "policy2_synth_19_aug1.png",
        "label": "policy",
        "ocr_text": "Policy No. 6S 200 CAMPUS SAFETY AND SECURITY PoLcy TE: Eiecive Dae February 24, 2028 STATEMENT OF PHILOSOPHY A sole arc soci canipuss eaviorane is furdarsen al ta the educational sion aed the wali bel at cortmunity merivers. This policy galabishes campeehersive Security messines to protect all emibers of the univarelty community ant insltutional proporty vie foutaring a cultura of shaved n beiwean security personnel, facuAty, stall, sd ‘On, aa reek eesponte to seccelty conceens through Fromoles awarenoes, prevent ‘Seercinated efforts and clear communical The Univesity Is committed to maintaining securs envirenment shot Suppers teaming eeerch, and BE Sevag without creating an atoospheta of fear or axcassive resrition This potiey rofl bust practices in campus scecvity while respacting indivi Fights and raivscy Prosctive 9 combines with commusity siglance are amergecky preparedness, create 8 eafor campus. This comprehensive gppmach adsnesses py S20uty, Rolawivel carmen, and Sis tianagernent through integrated systems and trained perscrne! POLICY Jb pcs evianta came must peasant veka tent ation at secur OF cas larperarypoanes, Usahcrnedesy a pasnohed ea mater eapessing cosegee Wehisiee antag carcon met Soi Y WA tbr ENS, Sheet Bk 2 Sh on Frankie ont n tanita ean. Votre mut fits vahice nipesaneinone ackooite. Vilors mst vost a the Security SF campes coats, Parking Seeimty peesenen! serait regutic sete of singe Beoicghout easryue. Tam Saciety OF Ruthing srese. ard srounee, Emaryisey 8 opal 3A? oon ta ere, Frohne ams ankle weapons, deg UG), Bot i umauthoviced amas, exobetven, and iar Secichy corsair! may sang! ‘009 ionptctons at ante celts, Rena to cou Ationidonin tetany toh, ast, hereon Avent soporte 9 sents sng 5 eros materia Senseo rHSuA me Oamied enh, DEN St agicove aitkry meat be repated Korn, to Cangas Sesseew Seen safety Note, Tenely wornen ave tau fr eacious wear, Scum caeae marr sebic sen or satety cyan, Postage 4 elated te 30. Five Be aeoseed iy kw wae vsigueane 29 esc yl"
    },
    {
        "image": "policy2_synth_19_aug2.png",
        "label": "policy",
        "ocr_text": "OFFICE OF STUDENT SERVICES POLICY NO Policy No. CS 2023 371 CAMPUS SAFETY AND [NO. OF PAGES Page 1 of6 SECURITY POLICY EFFECTIVE DATE: Efecive bate February 24, 2025"
    },
    {
        "image": "policy2_synth_19_aug3.png",
        "label": "policy",
        "ocr_text": "IDENT SERVICES: CY NS (BOLICY Ne OF PAGES “Paliey CAMPUS SAFETY AND OLICY SECURITY to the comprehensive sesuily measures to protect all cational mission ard the vs -being of Hey establishe ¥y and institutional property wrdie fostering culture of shared ny betwe curity pers y, staf, and ‘vention, and repid response te secutty cot rough hannels ing an aimesphere ret in campus security white tx ar ined with community vigi emneng: sive appreach audresses pty management though integrated systems end trained person al security, bel POLICY and sunt y eal woven se cate i diuge, aicolol in unauihorzed areas, expiosives, and Hae sonatist bay inepectians at entry ooints Ret Seturly cameras monitor pub rwveetyatons or aa vequired by law."
    },
    {
        "image": "policy2_synth_19_aug4.png",
        "label": "policy",
        "ocr_text": "CAMPLIC. SAFETY AND SEcuriry POLK STATEMENT oF PHILOSOBHYy 4 sale end SACD CammES ep; pltonnent at community membas, being of HY Meesums te pectoet aif festering 2 culture of stared The university is o Been deste: et WithONs creating an fefincty bese Pract eas in camps sensu Proactive secusity messioes Senne with 4 S880 compa This Somirehensive suresh addres es orate mansgeniont ty SyStEINS and trained gh integrated \"S8809 chery, menatt See Co mast ey ate thing Berets. Spe tanta PDR Syn Earateyarage vlog S904 Ss oF vaticte inp WRT bat ct ehtnge, sarking econ ad weuete ey eurty Otice avaratea 347 EDEN a8 Lowen are beating 7 80 Seance 938 cesta Qos tems vets8 weeps, ty 20 tH 8 a cess reac, Perk mene, obey \"Pro camaue The 5 88005, tara, Ne Pepa acatets ean Srurty cameras exon waster oF 28 recairen SITET, sup 2 Carne, Secu RECS a0 ste fee anc \"Ou thea"
    },
    {
        "image": "policy2_synth_19_aug5.png",
        "label": "policy",
        "ocr_text": "OFFICE OF STUDENT SERVICES ent is fundamente! to the educational mission ore the wall vensive seciity measuess (0 protect al ing a culture of shared and secure comps environs y eviablishos cory vatinational property while Asst tion between secutty perseanel, faculty, staf, and fy concerns through susdones rated efforts eon Tho unlverstt personal development tefiects best practices oul creat amnpuy secutlty whi nity mooaures, combined with community vigi preparedness, create appiaach addresses physical secuty, behavioral concerns, 37¢ veers and tecined personne Prosctive a safer campus. This comprohens fs managameed through intege POLICY Alpsraons ‘and bath Sorirasy passes Una sion at sacinty checkponts, Viekorn coset reginter at eS ste vescasning 0h sag caxrgiis trosl oresont vale Hen shopizes ectty 6 peaiibtes md vt reps roads. Pars os i io UH oD a campus must sapioy vate marking pores. Soe sondmert varios antes ‘lations veut fens: veils oD peracid enty it Seaignated 08s Emertcrcy ek bones are kocated J regula potroks of hates. parking seas, 8m FOUN senaue! ty Ofin operates 2477 rd renpands to a emergencies sasy parece taroughoad caninus, Toe $3 catcraes sens, axgizunies, and peravices materia ms, Refuse te coopera resin th denied ony. 1g tenis tiase weacens, Rega! aruge, aiecheé Ba eect tines at ety 228 Sucuriy personel may coeive 4, ov auoginioue apinity mont be reporter event hevine, Viewely warning are ste te scinue oreate rwensiog teh, usswul, harasa anincite ‘areyrigan coportcegin we etakae throng Wha carga SAY fog ewtsind to WO dave aod accessed only for recushy saity egmwvas mondce pubbe 7005 fo safely poses. cof a remit by oe"
    },
    {
        "image": "policy2_synth_20_aug1.png",
        "label": "policy",
        "ocr_text": "OFFICE OF ACADEMIC AFFAIRS UBRARY USE Ant OF PAGES EFFECTIVE DATE CONDUCT POLICY STATEMENT OF PHILOSOPHY She university tbvary saves sa the mtehectyal baat of the ane space conducive to teaning seit, prowling resuusces search and scholarly cust y asites equitable is pov across white taining ar envircrmrent cts sudy end ucadamic Inquiry bal at for shered mscurces swat considera for others aie assorted lt. values The pet 25 lndivisual Fremacm with collective Heads, promoting rasporssitie use of ih ory teciittes Taterinis smile tostaring un atmesphare of mutual respect The library supports academic surcese though accessible clle tions. professions! sai ces, are womierts 7 Curent and faure ererations appropiate study er oaliny prctects these resources of scholars. ensuring sustainably ard continued silane As information Momry Ineconies incveasingly criica’ in the repesitory ai ator 7! motnedologes while maintaining standards of academic integt gta ope the library serves as bot coy policy traivawork sup arse Ieurning styes nro tasoarch nd inletiactual cropeny yrotaciton POLICY Atencents, heudy, ane sto tse Matas aLreNe Gere pegIES buen, URAL uiwerey ID Hegute Beeraung ents Shs S bute te ty svernent parade Renoau 37e cernihies te halen ex boas tor ene anneste: Reserve wersuete pent tec Py Tay PL Dosw fay per foun Sheree o reawod 9 2eey areas Group a 08 aerated Net! Cac veoKg sted arene, Mabie one pes ecwnaatens wappromwie use of coreaters ef otme we rent n Tena Regaates veistere may ind Wo uUNrORET CT LNANY orm iege ASR IaY reno are Uomeraty eragerty \"TA ator, Eubeecl ts delay"
    },
    {
        "image": "policy2_synth_20_aug2.png",
        "label": "policy",
        "ocr_text": "OF FICE OF ACADEMIC: AFEA i OT ROLIEY NO UBRARY USE AND (NO. OF PAGES CGRDUCT POLICY individual freed mmateria s while fostering an aimosphere af autual espect ve needs, prow ess theugh accessible aporopiais study cavitunments This policy protects these wssurces far cuitent and future get holars, ensuring sustainsbi digh As information terae 196, the d leaning ‘aboratisy This fog stand ach nethodciogies while maint telloctual property profectia araciemic integrity ant POLICY Ab otuents fanuty ord stat have Roary access Garey costed how s Vaae tora resources inscugh gues! fepia seoeay Das es norrawing prvkeges. Commnunty tempers tray ace Jy may bores 15 Books for oe seinesier ‘ve petcniled 4 no ankts waist Qverdtve foes ate fae permitiud ony 9 Ges: oben ancnes rust Dm 6 conversatans, panpreprate use of comeisers. or natararnent of others sroveauste ven"
    },
    {
        "image": "policy2_synth_20_aug3.png",
        "label": "policy",
        "ocr_text": "LIBRARY USE 4 cOnouer The university 23 the Intellectust heari of th space conaciy. aming, #96: calfaboration. This i study and aca equitable waintalving as onwi Resper for shared resources and cor nie! Hbrasy yal balances indivies responsible us 3! freestom swith terials white foste lective needs, promoting tual respect through acce: tad crviconments. This acticy p ant fs these resou cellence gly cttical in the dig ley framework sunpons POLICY iaents, acuity, an ota nave ibrary acces daring posted inure Say aor iy 1B tequitoe fee entry ane am io peat eg tos bore 1S Books ter ove semester fed no olds exist, Sveray (2 19 paso, Food and beverages ignated ares, Mobi #8 mearionanes, orsign hanes rust be sence, Prehisted wee ext Cisruptie penser ircedate 0 19 et canvessatens, ies Violates may tae to oval Re A oeery raters are wn alot materiais subg"
    },
    {
        "image": "policy2_synth_20_aug4.png",
        "label": "policy",
        "ocr_text": "OFFICE OF ACADEMIC AFFAIRS POLICY NO 1 Policy No. LS 2022 667 LIBRARY USE AND NO OFPAGES =: Pave of3 CONDUCT POLICY EFFECTIVE DATE fective Date December 14, 2024 STATEMENT OF PHILOSOPHY The university library serves as the intellectual heart of the academic community providing resources and space conducive to leaming, research, and scholarly collaboration This policy ensures equitable sevens while maintaining an environment suitable for serious study and academic inquiry ideration for others are essential library values. The policy Respect for shared resources and cons| ible use of library facilities and balances individual freedom with collective needs, promoting respons! materials while fostering an atmosphere of mutual respect. through accessible collections, professional services, and Jicy protects these resources for current and future generations “The library supports academic success appropriate study environments. This po! of scholars, ensuring sustainability and continued excellence. the digital age, the library serves as both supports diverse leaming styles and research llectual property protection. ‘As information literacy becomes increasingly critical in repository and leaming laboratory. This policy framework ‘methodologies while maintaining standards of academic integty and intel POLICY ‘Al students, faculty, and staff have ibrary access during posted porowing prvieges. Communay members may access lorary resources through acuity may borrow 15 books for one semester. Reserve permitted ino holds exist, Overdue fnes are 10 pesos hours, Valid university ID is require for entry and quest registration. Borrowing mits: Students may borrow 5 books for two weeks; materials circulate for 2 hour or overnight periods, Renewals are per day per tem. lence is required in designated quiet study areas, Group discuss Food and beverages are prohibited except in designated areas, Mobile phones must wth headphones. Jon is permitted only in designated cotaboration spaces. ‘be silenced. Laptop use is permitted Disruptive behavior, including loud conversations, inappropriate use of computers, of harassment of others, wilresuttin immediate removal. Repeated violations may lead to suspension of lbrary privieges ‘aviocary materia are uversty property. The, mutiaon, or unauthorized removal of materials subject to discipinary ‘action and replacement fees. Securly checks at exits are mandatory"
    },
    {
        "image": "policy2_synth_20_aug5.png",
        "label": "policy",
        "ocr_text": "OFFICE OF ACADEMIC AFFAIRS LIBRARY USE AND CONDUCT POLICY STATEMENT OF PHILOSOPHY The university library serves as the intellectual heart of the academic community, providing resources ‘and space conducive to leaming, research, and scholarly collaboration. This policy ensures equitable ‘access while maintaining an environment suitable for serious study and academic inquiry Respect for shared resources and consideration for others are essential library values. The policy balances individual freedom with collective needs, promoting responsible use of library facilities and materials while fostering an atmosphere of mutual respect. The library supports academic success through accessible collections, professional services, and appropriate study environments. This policy protects these resources for current and future generations of scholars, ensuring sustainability and continued excellence. AAs information literacy becomes increasingly critical in the digital age, the library serves as both ‘repository and leaming laboratory. This policy framework supports diverse learning styles and research ‘methodologies while maintaining standards of academic integrity and intellectual property protection. POLICY ‘AS students, faculty, and staf have Ibrary access durng posted hours. Vat universty ID i requred for entry and Dorrowng prvieges Communty members may access Ibrary resources rough guest registration, Borrowng ims: Students may borrow books for two weeks; facuty may borrow 15 books for one semester. Reserve ‘materiais crculate for 2 hour or overnight periods. Renewals are permfied no hokis exist. Overdue fines are 10 pesos er day per tem. ‘Stence is requred mn designated quet study areas, Group dacussion 8 permitted only in designated colaboraton spaces Food and beverages are prohibted except i designated areas. Moble phones must be slenced. Laptop use is permitted wen headphones (Dsruptve behavior, ncixdng loud conversations, nappropriate use of computers, or harassment of others, wil result in |mmedate removal Repeated veiatons may lead to suspension of lbrary privieges ‘Ad exary materials are university property. Theft, mutlaton, or unauthorized removal of materisis is subject to discipinary ‘acton and replacement fees. Securty checks at exts are mandatory"
    }
]