[
    {
        "image": "proginvitation1_synth_10_aug1.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES MANILA Taft Avenue, Manila Tel: +63 2 8167 8330 Email: info uofthephil edu ph INVITATION TO ENROLL IN BACHELOR OF SCIENCE IN PSYCHOLOGY Alicia Evans 20th Floor Gloriosa Suites Tower 7, 9891 Jasper Street, Buguias, 3094 Mountain Province Dear Alicia, Congratulations on your acceptance to the BACHELOR OF SCIENCE IN PSYCHOLOGY program! We are delighted to welcome you to our institution for the Academic Year 2025 2026. Your outstanding academic performance and dedication have earned you a place in one of our most prestigious programs. The BACHELOR OF SCIENCE IN PSYCHOLOGY curriculum combines theoretical knowledge with practical applications, preparing graduates for leadership roles in their chosen profession. New student orientation is scheduled for December 31, 2025. During this session, you will meet faculty members, tour campus facilities, and learn about student services and organizations available to you. Required documents for enrollment: Valid ID, PSA Birth Certificate, High School Diploma or Form 138, Certificate of Good Moral Character, Medical Clearance, and two recent 2x2 photographs. Enrollment dates: December 25, 2025 to January 13, 2026. Early registration is encouraged to secure your preferred class schedule. Financial assistance programs are available for eligible students. We are excited to support your academic journey and look forward to your contributions to our vibrant campus community. Amy Williams Director, Office of Admissions"
    },
    {
        "image": "proginvitation1_synth_10_aug2.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES MANILA cms it: Info@ 1u pn Taft Avenue, ‘ ENROLL IN BACHELOR OF SCIENCE IN PS YCHOLOGY Congratulations on your acceptance to the BACHELOR OF SCIENCE IN PSYCHOLOGY program! We are delighted to welcome you to our institution for demic Year 208 82026. Four outstanding academic performance and on have e2 most prestigious programs LOR OFS 3c} ENCE =HOLOGY curticuin combines owiedge with pra spote tions, preparing graduates for leadership roles in their ct sen profession. New studer to orientation is scheduled for December 31, 2025. During this session, you will meet faculty our campus f vand ean about student services and Hable to you. Required d documents for enrol in ent Valid ID, ficate, High Schoo! Diploma or Moral Character, Medical Clearance, and two Enrollment dates: December 25, 2025 to January 13, 2026 encou ites ch re your preferred class schedule. Finar programs ble students. Vi academic joumey and look forward tc your contribut community. graphs, rly registration is 3 to OUF Vi VW Campus rn"
    },
    {
        "image": "proginvitation1_synth_10_aug3.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES MANILA INVITATION TO ENROLL IN BACHELOR OF SCIENCE I PSYCHOLOGY Alicia Evang 801 Jnever Seat Dear Alicia, Congratulations On your acceptance to the BACHELOR OF SCIENCE IN PSYCHOLOGY program! We are de ghied to we -OM@ YOU fo our institution for the Academic y, Gar 2025 2026. Your outsianding academic Performance and dedication have Garned you a place in one of our most Prestigious Programs. The BACHEL R OF SCIENCE IN PSYCHOLOGY curriculum combines theoretical kn wiedge with Practical applications, Preparing graduates for leadership roles in their chosen profession. New Student orientation is scheduled for December 31, 2025. During this SSsion, you will meet faculty Members, tour campus facilities, and learn about student Services and organizations available to you, Required documents for enrolment: Valid ID, PSA Birth Certificate, High School Diploma or Form 138, Certificate of Sood Moral Character, Medical two recent 2x2 photographs. Enrollment dates: December 25, 2025 te January 13, 2026, Ear encouraged to Secure your Preferred class sche Programs are available for eligible Studenis. We academic journey an look forward fo your community. Clearance, and ly registration is &. Financial assistance are excited to Support your ontributions to our vibrant Campus"
    },
    {
        "image": "proginvitation1_synth_10_aug4.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES MANILA Taft Pel: +63 2 8187 9: INVITATION TO ENROLL IN BACHELOR OF SCIENCE IN PSYCHOLOGY Dear Alicia, Congratulations on your acceptance to the BACHELOR OF SCIENCE IN PSYCHOLOGY program! We are delighted to welcome you to our institution for the Academic Year 2 25 2026. Your oulslanding academic performance and Gedication have e med you a place in one of our Most prestigious programs. The BACHELOR OF SCIENCE IN PSYCHOLOGY curriculum combines 1SOretical knowledge with Practical applications, preparing graduates for leadership roles in their chosen profession. New student orientation is scheduled for Decembar 1, 2025. During this session, you meet faculty members, tour carnpus facilities, and learn about student services and organiz ble to you. Required cocuments for enrollment: Valid (D PSA Birth Carttificate, High School Diploma or Form 138, Certificate of Good Moral Character, Medica! Clearance, and two recent 2x2 photographs. Enrollment dates: December 25, 2025 to Janu 2026. Early registration is lary 13, encouraged to secure your preferred class schedule. Financial assistance programs are available for eligible students. We are excited to support your academic journey and look forward to your contributions to our vibrant campus community. Amy Williams"
    },
    {
        "image": "proginvitation1_synth_10_aug5.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES MANILA Taft Avenue, t INVITATION TO ENROLL IN BACHELOR OF SCIENCE IN PSYCHOLOGY Alicia Dear Alicia, Congratulations on Your acceptance to the BACHELOR OF SCIENCE jy PSYCHOLOGY program! We are delighted to welcome you to our institution for the Academic Year 2025 2026. Your outsta ng academic performance ang dedication have earned you a place in one of ourm restigious programs, The BACHELOR OF SCIENCE JN PSYCHOLOGY oc #riculum combines theoretical knowledge with practical applications. preparing gracdugies for igadership roles in their chosen crofession. New Student orientation is scheduled for December 3 1, 2025. During this session. you will meet faculty members, tour campus facilities, and laarn about student services and organizations available te you. Required documents for PSA Birth Certifica of enrollment Valid 1D, Moral Character, Viedicai Cl te, High School Cipioma or Form 138, Certificate of Good earance, and two recent 2x2 photographs. Enroliment dates: December 25, 2025 to January 13, 2026. Early registration is encouraged to secure your preferred class schedule. Financial assistance programs are available fo We are excited to suppert academic iourn f eligible students. t your commurnily. Sy and look forward to you contributions to our vibrant campus"
    },
    {
        "image": "proginvitation1_synth_1_aug1.png",
        "label": "proginvitation",
        "ocr_text": "ADAMSON UNIVERSITY sity, Metro Manila NTHE BACHELOR OF ARTS INVITATION TO Jor 1 iON PROGRAM IN EDUCAT Cheyenne Romero Dear Cheyenne, ce fo ihe BACHELOR OF ARTS IS welcome you to OUF lations on your gcceptan Congratu EDUCATION PROGRAM program We are delighted to Academic Year 2025 2028. Your outstanding academic none of OUT most arned you a place i OR OF ARTS IN ith practical applic 4 education. New this session, you t student UCATION PROGRAM ans, instituiton for the performance and dedication have prestigious programs. The BACHEL curriculum combines ineorelical “nowledges W preparing graduates for leadership roles in teaching an student orientation 1S scheduled for January 08, 2028. Dunng wilh meet faculty mnambers, four campus facilities. and lean about services and organizations available to you. Required documents for enrolment: Valid 1D, PSA Birth Certificate, High choo! Diploma of Form 136. Cariificate of Good Mora! Character, Medical Clearance. and avo recent 2x2 photographs. Enrolment dates: December 18, 2025 to January 59, 2026. Early jon is ancouraged te secure Your preferred class schedule. Financial u 1a students. We are axcited to d to your contributions te Our registrale agsistance orograms are available for aligiht upporl your academic journey and look forwar vibrant campus cormmunny. oy"
    },
    {
        "image": "proginvitation1_synth_1_aug2.png",
        "label": "proginvitation",
        "ocr_text": "ADAMSON UNIVERSITY Email registrarg adamsonu edu ph Phone: +63 29442 9689 Makati City, Metto Manta INVITATION TO JOIN THE BACHELOR OF ARTS IN EDUCATION PROGRAM Cheyerine Romero 8748 Tabayoc Drive, Quezon City, 1297 Metro Mara Dear Cheyenne, Congratulations on your acceptance to the BACHELOR OF ARTS IN EDUCATION PROGRAM program! We are delighted to welcome you te our institution for the Academic Year 2025 2026. Your outstanding academic performance and dedication have earned you a place in one of our most prestigious programs. The BACHELOR OF ARTS IN EDUCATION PROGRAM curriculum combines theoretical knowledge with practical applications, preparing graduates for leadership rojes in teaching and education. New student orientation is scheduled for January 09, 2026. During this session, you will meet faculty members, tour campus facilities, and learn about student services and organizations available to you. Required documents for enrollment: Valid ID, PSA Birth Certificate, High Schoo! Diploma or Form 138, Certificate of Good Moral Character, Medica! Clearance, and two recent 2x2 photographs. Enrollment dates: December 18, 2025 to January 09, 2026. Early registration is encouraged to secure your preferred class schedule. Financial assistance programs are available for eligible students. We are excited to support your academic journey and fook forward to your contributions to our vibrant campus community. Audrey Brown Dean, College of Arts and Sciences"
    },
    {
        "image": "proginvitation1_synth_1_aug3.png",
        "label": "proginvitation",
        "ocr_text": "ADAMSON UNIVERSITY tu ph Phone. +63 2 §442 0080 Makaii Cir LOR OF ARTS Dear eyenne, Congratulations on your acceptance to the BACHELOR OF ARTS IN EDUCATION PROGRAM program! We are delighted to welcome you to our institution for the Acacemic Year 2025 2026. Your outstanding academic periormarnice and dedication have earned you a place in one of our most prestigious programs. The BACHELOR OF ARTS IN JCATION PROGRAM curriculum combines theoretical knowledge with practical applications, aring graduates jor leadership roles In teaching anc education. New dent orientation is scheduled fo 19, 2026, During this session, you Hi meet faculty mernbers, tour campus facilllies, anc learn about student vices and orgar ons avaiable to you. Required docurnents for enrolment: Vali PSA Birth Certificate, High Schoo! Diploma or Form 138, Certificate of Good Mora! Character, Medical Clearance, and two recent 2x2 -nrollment dates: Decamber 18, 2025 to January 09, 2026. Early fa) pr ser ri reg encouraged to secure your pr d class schedule. Financial assisiance programs are avellable for eligible students. We are excited to support your acade vibrant campus cor journey and look forward te your contributions to our unity. Audrey Brown"
    },
    {
        "image": "proginvitation1_synth_1_aug4.png",
        "label": "proginvitation",
        "ocr_text": "ADAMSON UNIVERSITY Email: registrar adamsonu edu ph Phone: +63 2 9442 9089 Makati City, Metro Manila INVITATION TO JOIN THE BACHELOR OF ARTS IN EDUCATION PROGRAM Cheyenne Romero 8748 Tabayoc Drive, Quezon City, 1297 Metro Manila Dear Cheyenne, Congratulations on your acceptance to the BACHELOR OF ARTS IN EDUCATION PROGRAM program! We are delighted to welcome you to our institution for the Academic Year 2025 2026. Your outstanding academic performance and dedication have earned you a place in one of our most prestigious programs. The BACHELOR OF ARTS IN EDUCATION PROGRAM curriculum combines theoretical knowledge with practical applications, preparing graduates for leadership roles in teaching and education. New student orientation is scheduled for January 09, 2026. During this session, you will meet faculty members, tour campus facilities, and learn about student services and organizations available to you. Required documents for enrollment: Valid ID, PSA Birth Certificate, High School Diploma or Form 138, Certificate of Good Moral Character, Medical Clearance, and two recent 2x2 photographs. Enrollment dates: December 18, 2025 to January 09, 2026. Early registration is encouraged to secure your preferred class schedule. Financial assistance programs are available for eligible students. We are excited to support your academic journey and look forward to your contributions to our vibrant campus community. Audrey Brown Dean, College of Arts and Sciences"
    },
    {
        "image": "proginvitation1_synth_1_aug5.png",
        "label": "proginvitation",
        "ocr_text": "INVITATION TO JOi Cheyenne Romero 8748 Tabayon Dave Sanita Quezon City Ma Dear Cheyenne, Congratulations on EDUCATION P. institution for Performa prestig curriculum combines Preparing Graduat Student orientay ROG Photographs. Enrollme fegistration js encoura assistance Programs a Suppor your academic vibrant campus commy Audrey Brown Yur acce ious pregrams. ADAMSON UNIVERSITy Eat registrar @acuns, INED 1297 Metro theoreti Ptance to th RAM Program! Wa a \"ms edu ph} Prone: +63 2 o4go 3089 Makati City N THE BA CHELOR OF ART. UCATION PROGRAM nt dates: Decam; '@ availabie fo Journey and nity. F eligible sty 90k forward to your contributio BACHELOR OF ARTS fe delighted to welcome y 02 ule. dents. We are exci Ss) IN Ou fo our demic iired cocuments for chool Dipioma or Fo arance, and two re MbEer 18, 2025 to January 09. \"ed Class sched rm 138, 2026. Early Financial ted to NS fo our"
    },
    {
        "image": "proginvitation1_synth_2_aug1.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN oth u ph i Commorweaith fons on your acceptance to the BACHELOR OF ARTS IN N PROGRAM program! We are delighted to welcome you to our institution for the Academic Year 2025 2026. Your outstanding academic formance and dedication have 2d you place in one ur most ous programs, The BACHELOR OF ARTS IN EDUCATION PROGRAM um combines theoretical knowledge with practical applications. iuates for leadership roles in teaching and education. New Hon is ded for January 11, 2026. During this session, you will meet faculty members, tour campus facilities, and learn about studen eer nd org ations avai o you. Required documents for snroliment Valid 1D, PSA Birth Certificate, High School Diploma or Form Certificate of Goad Meral Ch photographs. Enrollment c e racter, Mecical Clearance, and two recent 2x2 s: December 23, 2025 to January 71, 2026. Early tion is encouraged to secure your preferred class schedule. Financial istance programs are available for eligible students. We are excited to support your academic journey and look forward to your contributions to our vibrant campus community. cr."
    },
    {
        "image": "proginvitation1_synth_2_aug2.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN TO JOIN THE BA OR OF ARTS UCATION PRO AM slant Your outs ‘andin e an one EDL ie SATION PROGRAM stu y mn for the Aca of our most ION PROGRAM vi n practic cal applications, aching and education. New 14, 2026. During this session, you and learn about student equited documents for i iplor aor Form 138, t 2x2 Er hroliment dates: Des ember 23, 3025 tod lanuary 44, 2026 Early ation is encouraged to your preferred class schedule. Financial stance programs are avail for eligible students. We are excited to support your academic journey and look forward to your contributions to cur ni campus comm 5 for “ea edt"
    },
    {
        "image": "proginvitation1_synth_2_aug3.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN INVITATION TO JOIN THE BACHELOR OF ARTS IN EDUCATION PROGRAM Jessica Moses Bs? Dear Jessica Congratulations on your acceptance to the BACHELOR OF ARTS IN EDUCATION PROGRAM program! We are delighted to welcome you {to our institution for the Academic Year 2025 2026. Your outstanding academic lace in one of our most performance and dedication have eared you Pp e BACHELOR OF ARTS IN EDUCATION PROGRAM prestigious programs. Th curriculum combines theoretical knowledge with practical applications, preparing graduates for jeadership roles in teaching and education. New student orientation is scheduled for January 41. 2026. During this session, you will meet facully members, tour campus facilities, and fearn about student services and organizations available to you. Required documents for anroliment: Valid ID, PSA Birth Certificate, High School Dipioma or Form 438, Certificate of Good Moral Character, Medica! Clearance, and two recent 2x2 photographs. Enrollment dates: December 23, 2025 to january 14, 2026. Early registration is encouraged to secure your preferred class schedule. Financial assistance programs are available for eligibie students. We are excited to support your academic journey and jook forward to your contributions to our vibrant campus community. Cathy Kim"
    },
    {
        "image": "proginvitation1_synth_2_aug4.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Phone: +63 2 8481 5268 Email: enrollment uofthephil. edu ph Commonwealth Avenue, Quezon City INVITATION TO JOIN THE BACHELOR OF ARTS IN EDUCATION PROGRAM Jessica Moses Block 21 Lot 50 Acacia Cove, pil Road, Javier, 8827 Davao del Norte Dear Jessica, Congratulations on your acceptance to the BACHELOR OF ARTS IN EDUCATION PROGRAM program! We are delighted to welcome you to our institution for the Academic Year 2025 2026. Your outstanding academic performance and dedication have earned you a place in one of our most prestigious programs. The BACHELOR OF ARTS IN EDUCATION PROGRAM curriculum combines theoretical knowledge with practical applications, preparing graduates for leadership roles in teaching and education. New student orientation is scheduled for January 11, 2026. During this session, you will meet faculty members, tour campus facilities, and learn about student services and organizations available to you. Required documents for enrollment: Valid ID, PSA Birth Certificate, High School Diploma or Form 138, Certificate of Good Moral Character, Medical Clearance, and two recent 2x2 photographs. Enrollment dates: December 23, 2025 to January 11, 2026. Early registration is encouraged to secure your preferred class schedule. Financial assistance programs are available for eligible students. We are excited to support your academic journey and look forward to your contributions to our vibrant campus community. Cathy Kim Dean, College of Arts and Sciences"
    },
    {
        "image": "proginvitation1_synth_2_aug5.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Phone. 46) 2 8481 5268 Emait: enroiment uotthecht eduph Comenorwealth Avenue, Quon City INVITATION TO JOIN THE BACHELOR OF ARTS IN EDUCATION PROGRAM Jessica Moses Biock 21 Lot SG Acacia Cove, tnt Road, Javter, 8827 Davao det Norte Dear Jessica, Congratulations on your acceptance fo the BACHELOR OF ARTS IN EDUCATION PROGRAM program! We are delighted to welcome you to our institution for the Academic Year 2025 2026. Your outstanding academic performance and dedication have earned you a place in one of our most prestigious programs. The BACHELOR OF ARTS IN EDUCATION PROGRAM curriculum combines theoretical knowledge with practical applications, preparing graduates for leadership roles in teaching and education. New student orientation is scheduled for January 11, 2026. During this session, you will meet faculty members, tour campus facilities, and learn about student services and organizations available to you. Required documents for enrollment: Valid ID, PSA Birth Certificate, High School Diploma or Form 138, Certificate of Good Moral Character, Medical Ciearance, and two recent 2x2 photographs. Enrollment dates: December 23, 2025 to January 11, 2026. Early registration is encouraged to secure your preferred class schedule. Financial assistance programs are available for eligible students. We are excited to support your academic journey and look forward to your contributions to our vibrant campus community. Cathy Kim Dean, College of Arts and Sciences"
    },
    {
        "image": "proginvitation1_synth_3_aug1.png",
        "label": "proginvitation",
        "ocr_text": "ADAMSON UNIVERSITY Phone: +63 2 8961 6998 Email: info adamsonu. edu ph Taft Avenue, Manila INVITATION TO ENROLL IN BACHELOR OF SCIENCE IN PSYCHOLOGY Albert Glenn Block 13 Lot 06 higa Street, Carpenter Estates Phase 4, Bocaue, 5756 Biliran Dear Albert, Congratulations On your acce Program! We Ptance to the BACHELOR OF SCIENCE IN the Academic Year 2025 202 are delighted to welcome you to our institution for 6. Your Outstanding academic Performance and arned you a place in one of our most prestigious Programs. The BACHELOR OF SCIENCE IN PSYCHOLOGY Curriculum combines theoretical knowledge with practical applications, Preparing graduates for n their chosen Profession. New student orientation is Scheduled for January 06, 2026. Duri Ing this Session, you will meet faculty facilities, and learn about student services and le to you. Required documents for enrollment: Valid ID, PSA Birth Certificate, High School Diploma or Form 138, Certificate of Good dical Clearance, Moral Character, Me and two recent 2x2 photographs. Enrollment dates: December 26, 2025 to January 16, 2 026. Early registration is encouraged to secure y i i i Programs are available academic journe community. Amanda Scott Dean, College of Arts and Sciences"
    },
    {
        "image": "proginvitation1_synth_3_aug2.png",
        "label": "proginvitation",
        "ocr_text": "ADAMSON UNIVERSITY INVITATION TO ENROLL IN BACHELOR OF SCIENCE IN PSYCHOLOG Albert Glenn Sime!, Campentar Estates Phase Congratulations on your acceplance to the BACHELOR OF SCIENCE IN PSYCHOLOGY program! We are delighted to welcome you to our institution for the Academic Year 2025 2026. Your ouistanding academic performance and dedication have earned you place In one of our most restigious programs. The BACHELOR OF SCIENCE iN PSYCHOLOGY curriculum combines theoretical knowledge with practical applications, preparing graduates for leadership roles in their chosen profession. New student orientation is scheduled for January 06, 2026 During this session, you will meat facuity members, touy campus facilities, and learn about student services and organizations available to you. Required documents for enroliment Valid ID, PSA Birth Certificate, High Schoo! Diploma or Form 138, Certificate of Good Moral Character, Medical Clearance, and two recent 2x2 photographs. Enroliment dates: December 26, 2025 to January 16, 2028. Early registration is encouraged fo secure your preferred class schedule. Financial assistance Programs are available for eligible students. We are excited fo support your academic journey an c lock forward to your contributions to our vibrant campus community."
    },
    {
        "image": "proginvitation1_synth_3_aug3.png",
        "label": "proginvitation",
        "ocr_text": "ADAMSON UNIVERSITY Phone: +63 2 nue, Maniia {TO ENROLL iN BACHELOR OF =NCE IN PSYCHOLOGY INVITATION ou Albert Gienn Congratulations on your acceptance to the BACHELOR OF SCIENCE IN PSYCHOLOGY crogram! We ghied to weicome you to our in i the Academic Year 2025 2026. Your outstanding academic dedication have earned you a place in one of our most prestigious programs. The BACHELOR OF SCIENCE IN PSYCHOLOGY curriculum combines theoretical knowledge with practical applications, preparing graduates for leadership roles in their chosen profession. New student orienta scheduled for January 06, 2026. During this session, you wili meet faculty members, tour campus facilities, and learn about student services and organizations available to you. Required documents for enrollment: Valid [D, PSA Birth Certificate, High School Diploma or Form 138, Certificate of Good Moral Character, Medical Clearance, and two recent 2x2 shotographs. Enrollment dates: December 26, 2025 to January 16, 2026. Early registration is encouraged to secure your preferred class schedule. Financial assistance programs are available for eligible students. We are excited to support your academic journey and lock forward to your contributions to our vibrant campus community. Amanda Scott"
    },
    {
        "image": "proginvitation1_synth_3_aug4.png",
        "label": "proginvitation",
        "ocr_text": "ADAMSON UNIVERSITY Phone: +83 2 8961 6098 Emel: info axtamsennes edu ph Taft Avenue, Manita INVITATION TO ENROLL IN BACHELOR OF SCIENCE IN PSYCHOLOGY Albert Glenn Block 13 Lot O6 tiga Street, Carpenter Estates Phase 4, Bocave, 5756 Biliran Dear Albert Congratulations on your acceptance to the BACHELOR OF SCIENCE IN PSYCHOLOGY Program! We are delighted the Academic Year 2025 2 scheduled for January 06, 2026. During this session, you will meet facuity members, tour campus facilities, and learn about student services and organizations available to you. Required documents for enroliment: Valid ID, PSA Birth Certificate, High School Dipioma or Form 138, Certificate of Good Moral Character, Medical Clearance, Enroltment dates: December 26, 202 Amanda Scott Dean, College of Arts ang Sciences"
    },
    {
        "image": "proginvitation1_synth_3_aug5.png",
        "label": "proginvitation",
        "ocr_text": "Phone: +63 2 9961 693 duh Tat Avenus, i; INVITATION TO ENROLL IN BA ADAMSON UNIVERSITY ; CHELOR OF SCIENCE IN PSYCHOLOGY Dear Albert, Congratulations PSYCHOL the Academic Year 2005 dedication haye eamed you a The BACHELOR OF SCIENCE iheore leadership roles in scheduled for January 66, 2026 bers, tour Campus facilitie memt organizations availiable to you. PSA Birth Certificate, High S$ Moral Character. Medica Enrollment dates: Decen encouraged to secure Programs are availabi academic Journey and look forwar community. £5 2026. Your au place in one of cal knowledge with practical On your acceptance to the BAC} OGY program! We are delight N PSYCHOLOGY applic During this sessio 8, and learn about studen Required documents for School Diploma or Form cal Clearane €, and two recent 2 nber 26, 2025 tc January 16, your preferred class sched; © for eligible students. We are d to your contribut DACHELOR OF SCIENCE IN d to welcome you to our instit anding academic Our most pr: itution for performance and estigious programs. curriculum combines cations, Preparing graduatas for their chosen profession. New stuc ént orientation js n. you will meet faculty t services and enrollment: Valid iD, 138, Certificate of Good x2 photographs. 2026. Early registration is ©. Financial assistance exciled to Support your ‘ons to our vibrant campus"
    },
    {
        "image": "proginvitation1_synth_4_aug1.png",
        "label": "proginvitation",
        "ocr_text": "and fo Jur to: Riana Re Oat Richareg with creat pte AE NCE IN Cryu 202 2098 i 28. COad in high “OEY Pog ENeNcEd fr stude “tS WIth vay 360d MV ur a te) a achelarsi: D pr dur Ing onen ING vou be CUTTY meny Ores are NO Dart ot POLYT MIC UNE 24 IPP} Sure th ission refterss Th 26 Pls OF iB QSe Bren ar SA Sirth o i an org eats Oral Cenite ate} Th Lultic NY ipes 5 Nay b Buons OM iTeac emis} tation, Ollowin Te for WWeettY aE NES PATHE e oe and pe logy i, CCOMe ta Me Univ onto Mente ©"
    },
    {
        "image": "proginvitation1_synth_4_aug2.png",
        "label": "proginvitation",
        "ocr_text": "OF THE POL TECHNIC, UNIVERSITY PHILIPPINES 3 9005 488 a BACHELOR OF SCIENCE iN GRAM ON ENGINEERING PROC itis with great pleasure that we BACHELOR OF SCIENCE IN CIVIL ENG! ERING PROGRAM program for Academic Year 9025 2026. Your admission reflects yOUT academic excellence and potential io succeed in higher education. The program features state of the art facilities. experienced facuity members. and strong industry partnerships thai provide students with valuable intemsniy and areer opportunities. Our graduates consistently achieve high employment rates in engineeting and infrastructure. important dates: Orientation: December 24, 2025 Registration: oecermber 26. 2025 to January 24, 2026 Please prepare the following for enraliment. Original and photocopies of PSA Birth Certificate. Form 438, Diploma of Cerificate oF Gompietion, Good Moral Certificate, Medical Certificate 6 iuding chest M ray, and four 2x2 iD photos. jultion fees May be paid in installments. Various scholarship progr yg and Seiails will be provided during orientation. ak forward to seeing you b come part of our @ fo ihe university! extend this invitation to join ih financial aid options are avaiiab We are committed to your Suc) dernic family. Weicom"
    },
    {
        "image": "proginvitation1_synth_4_aug3.png",
        "label": "proginvitation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Phone. +83 2 9005 48834 j Email onrolimsni potytechni edi oh Taft Avenue, Manila INVITATION TO THE BACHELOR OF SCIENCE IN CIVIL ENGINEERING PROGRAM Richard Redriguez 2823 4 Makiling Dave, Mina, 7149 Camiguin Dear Richard, {tis with great pleasure that we extend thi SCIENCE IN CIVIL ENGINEERING PRO! 2025 2026. Your admission reflects your succeed in higher education. The progra experienced faculty members, and strong industry partnerships that provide students with valuable internship and ca reer opportunities. Our graduates consistentiy achieve high employment rates in engineering and infrastructure. !mportant dates: Orientation: Decemb i 2025 to January 21, 2026 Please prepare the followin and photocopies of PSA Birth Certifi Completion, Good Moral Certificate, and four 2x2 ID photos. Tuition fees schoiarship programs and financia! provided during orientation. We are to seeing you become part of our ac s invitation to join the BACHELOR OF GRAM program for Academic Year academic excellence and potential to m features state of the art facilities, ig for enrollment: Original cate, Form 138, Dipioma or Certificate of Medicai Certificate including chest X ray, may be paid in installments. Various aid options are available. Details will be committed to your success and look forward ademic family. Welcome to the university! Melinda Turner Girector, Office of Admissions"
    },
    {
        "image": "proginvitation1_synth_4_aug4.png",
        "label": "proginvitation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES ERING PROGRAIY Richard Rodriguez d this invitation to join the BACHELOR OF OGRAM brogram for Acade nic Year f acadami ence and pote tial to fe oF the art f 8, try Partnerships th provide Portunities. Our : f education, 7 experiencad faculty members, and Strong inc Students wit} Valuable intemship and career op igh employment fales in Consisiently a engineerin Atation: December 24, 2025 Re Prepare the irth Cartit riflcate &Ed photocopies of PSA R Completion. o or enrol Sood Moral and fi oM@ or Cert ID phot Hicate including chest ATay, 'uilion fees May be paid in installments Various Scholarship Progre and financial aid options &'@ available Provided during orie Alatlon. We @le@ corm art of our a fo 2. Details witi be to your SUCCESS and cademic family. Welcome to th 20k forward UNversity!"
    },
    {
        "image": "proginvitation1_synth_4_aug5.png",
        "label": "proginvitation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Phone: +63 2 9005 4881 Email: enrollment polytechni edu ph Taft Avenue, Manila INVITATION TO THE BACHELOR OF SCIENCE IN CIVIL ENGINEERING PROGRAM Richard Rodriguez 2823 1 Makiling Drive, Mina, 7119 Camiguin Dear Richard, Itis with great pleasure that we extend this invitation to join the BACHELOR OF SCIENCE IN CIVIL ENGINEERING PROGRAM program for Academic Year 2025 2026. Your admission reflects your academic excellence and potential to succeed in higher education. The program features state of the art facilities, experienced faculty members, and strong industry partnerships that provide students with valuable internship and career opportunities. Our graduates consistently achieve high employment rates in engineering and infrastructure. Important dates: Orientation: December 24, 2025 Registration: December 26, 2025 to January 21, 2026 Please prepare the following for enrollment: Original and photocopies of PSA Birth Certificate, Form 138, Diploma or Certificate of Completion, Good Moral Certificate, Medical Certificate including chest X ray, and four 2x2 ID photos. Tuition fees may be paid in installments. Various scholarship programs and financial aid options are available. Details will be provided during orientation. We are committed to your success and look forward to seeing you become part of our academic family. Welcome to the university! Melinda Turner Director, Office of Admissions"
    },
    {
        "image": "proginvitation1_synth_5_aug1.png",
        "label": "proginvitation",
        "ocr_text": "ADAMSON UNIVERSITY Quezon City, Metro Manila Tel: +63 2 8074 4389 Email: info adamsonu. edu ph INVITATION TO THE BACHELOR OF ARTS IN COMMUNICATION PROGRAM John Reynolds Block 07 Lot 64 Pepper Extension. ‘Atok Cove Phase 6, Los Bafios, 3954 Masbate Dear John, Congratulations on your acceptance to the BACHELOR OF ARTS IN COMMUNICATION PROGRAM program! We are delighted to welcome you to our institution for the Academic Year 2025 2026. Your outstanding academic d dedication have earned you a place in one of our most prestigious programs. The BACHELOR OF ARTS IN COMMUNICATION PROGRAM curriculum combi ledge with practical applications, prepa media and communications. New student orien mber 23, 2025. During this session, yOu wi facilities, and learn about student services and organizations available to you. Required documents for enrollment: Valid ID, PSA Birth Certificate, High School Diploma or Form 138, Certificate of Good Moral ical Clearance, and two recent 2x2 photographs. tes: December 23, 2025 to January 24, 2026. Early registration is encouraged to secure your preferred class schedule. Financial assistance progr: ‘lable for eligible students. We are excited to support your academic journey and look forward to your contributions to our vibrant campus community. Victor Bryant Vice President for Academic Affairs"
    },
    {
        "image": "proginvitation1_synth_5_aug2.png",
        "label": "proginvitation",
        "ocr_text": "ADAMSON UNIVERSITY City, Metro Me 2 8074 4388 Email it amsonu edu pir INVITATION TO THE BACHELOR OF ARTS IN COMMUNICATION PROGRAM Dear John, Congratulations on your acceptance to the BACHELOR OF ARTS IN COMMUNICATION PROGRAM program! We are delighted to welcome you to our institution for the Academic Year 2025 2026. Your outstanding academic performance and dedication have earned you a place in one of our most prestigious programs. The BACHELOR OF ARTS IN COMMUNICATION PROGRAM curriculum combines theoretical knowledge with practical applications, preparing graduates for leadership roles in media and communications. New student orientation is scheduled for December 23, 2025. During this session, you will meet faculty members, tour campus facilities, and learn about student services and organizations available to you. Required documents for enroliment Valid ID, PSA Birth Certificate, High School Diploma or Form 138, Certificate of Good Moral Character, Medical Clearance, and two recent 2x2 photographs. Enrollment dates: December 23, 2025 to January 24, 2026. Early registration is encouraged to secure your preferred class schedule. Financial assistance programs are availabe for eligible students. We are excited to support your academic journey and look forward te your contributions fo our vibrant campus community. Vietor Bryant"
    },
    {
        "image": "proginvitation1_synth_5_aug3.png",
        "label": "proginvitation",
        "ocr_text": "ADAMSON UNIVERSITY Quezon City, Metro Manila Tel: +63 2 8074 4389 Email info adamsonu edu. ph INVITATION TO THE BACHELOR OF ARTS IN COMMUNICATION PROGRAM John Reynolds Block 07 Lot 64 Pepper Extension, Atok Cove Phase 6, Los Baios, 3954 Masbate Dear John, Congratulations on your acceptance to the BACHELOR OF ARTS IN COMMUNICATION PROGRA M program! We ar our institution for the Academi e delighted to welcome you to c Year 2025 2026. Your outstanding academic performance and dedication h i Victor Bryant Vice President for Academic Affairs"
    },
    {
        "image": "proginvitation1_synth_5_aug4.png",
        "label": "proginvitation",
        "ocr_text": "ADAMSON UNIVERSITY INVITATION TO THE BACHELOR OF ARTS IN COMMUNICATION PROGRAM nn Reynolds Dear John, ACHELOR OF ARTS IN Congratulations on your acceptance to the B e delighted to welcome you to COMMUNICATION PROGRAM program! We ar our insfitution for the Academic Year 2025 2026. Your outstanding academic performance and dedication have earned you place in one of our most prestigious programs. The BACHELOR OF ARTS IN COMMUNICATION PROGRAM curriculum combines theoretical knowledge with practi a applications, preparing graduates for leadership roles in media and communications. New student orientation is scheduled for December 23, 2025. During this session, you will meet faculty members, tour campus facilities, and learn about student services and organizalions av ble to you. Required docursents for enroliment cate, High School Diploma Valid 1D, PSA Birth Certit or Form 138, Certificate of Good Moral Character, Medical Clearance, and two recent 2x2 photographs. Enrollment dates: December 23, 2025 to January 24, 2026. Early registration is encouraged fo secure your preferred ciass schedule. Financial assistance programs are available for eligible students. We are excited to support your academic journey and look forward fo your contributions to our vibrant campus coramunity. rt"
    },
    {
        "image": "proginvitation1_synth_5_aug5.png",
        "label": "proginvitation",
        "ocr_text": "ADAMSON UNIVERSITY Quezon City, Metro Manila Tel +62 2 8074 4329 Email. info adamsonu edu ph INVITATION TO THE BACHELOR OF AR COMMUNICATION PROGRAM Tein John Reynolds ‘Block 07 Lot 64 Popper Extension, Atok Cove Phase 6, Lox Bavios, 3954 Masbate Dear John, Congratulations on your acceptance to the BACHELOR OF ARTS IN COMMUNICATION PROGRAM program! We are delighted to welcome you to our institution for the Academic Year 2025 2026. Your outstanding academic performance and dedication have earned you a place in one of our most prestigious programs. The BACHELOR OF ARTS IN COMMUNICATION PROGRAM curriculum combines theoretical knowledge with practical applications, preparing graduates for leadership roles in media and communications. New student orientation is scheduled for December 23, 2025. During this session, you will meet faculty members, tour campus facilities, and learn about student services and organizations available to you. Required documents for enrollment: Valid ID, PSA Birth Certificate, High Schoo! Diploma or Form 138, Certificate of Good Moral Character, Mecical Clearance, and two recent 2x2 photographs. Enrollment dates: December 23, 2025 to January 24, 2026. Early registration is encouraged to secure your preferred class schedule. Financial assistance programs are available for eligible students. We are excited to support your academic journey and look forward to your contributions to our vibrant campus community. Victor Bryant Vice President for Academic Affairs"
    },
    {
        "image": "proginvitation1_synth_6_aug1.png",
        "label": "proginvitation",
        "ocr_text": "DE LA SALLE UNIVERSITY Phone: +83 feu edu ph Taft Avenue, Maria INVITATION TO JOIN THE COLLEGE OF NURSING PROGRAM We are pleased to inform you that you have been selected to join our COLLEGE OF NURSING PROGRAM program for the Academic Year 2025 2028. Your acacernic achievements and exceptional entrance examination resulis have demonstrated your readiness for higher education. The program offers comprehensive courses designed to orepare students for professional careers in healthcare and medical services. Our faculty members are industry experts committed to providing quality education through innovative teaching methods and hands on learning experiences. Orientation will be held on January 10, 2626 at tne University Auditorium. Please bring the following documents: Original PSA Birtn Certificate, Form 138 (High Schoal Report Card), Certificate of Good Moral Character, Medical Certificate, and two 2x2 ID pictures. The registration period is from December 17, 2025 to January 24. 26, Tuition fees and payment schedules will be discussed during the orientation. Scholarship opportunities are available for qualified students. We look forward to welcoming you fo our academic community. Should you have any questions, please cantact ihe Office of Admissions al the nurnber provided above. Congratulations once again on your acceptance."
    },
    {
        "image": "proginvitation1_synth_6_aug2.png",
        "label": "proginvitation",
        "ocr_text": "DE LA SALLE UNIVERSITY TAT TON 1 TO JOIN THE NURSING PRe LLEGE OF A GRAM Ss Smith Dear James We are plea ave been Selected 3 PROX GRAM program for the Aca ademic moore and excepti iis have cer anstr. 2 2026. Your The pean r 88 for highe ents for ty me vices, 8. Our fact re indu committed io, c teaching methods and h ie of Good Me “ures. The registrat atic Tuition fees and nuary 24, i during i f ayment seh Sc holarship opp portun rd to welco abo ve. at the n 1 umber prov 280"
    },
    {
        "image": "proginvitation1_synth_6_aug3.png",
        "label": "proginvitation",
        "ocr_text": "DE LA SALLE UNIVERSITY ue, Manila INVITATION TO JOIN THE COLLEGE OF NURSING PROGRAM Jame: 449 Trickle, Dear James, We are pleased to inform you that you have been selected to join our COLLEGE OF NURSING PROGRAM program fer the Academic Year 2025 2026, Your academic achievements and exceptional entrance examination results have demonstrated your readiness for higher education. The program offers comprehensive courses designed to prepare students for professicnal careers in healthcare and medical services. Our faculty members are industry experts committed to providing quality education through innovative teaching methods and hands on learning experiences. Orientation will be hald on January 10, 2026 at the University Auditorium. Please bring the follawing documents: Original PSA Birth Certificate, Form 138 (High School Report Card}. Certificate of Good Moral Character, Medical Certificate, and two 2x2 1D pictures. The registration periad is frorm December 17, 2025 to January 24, 2026. Tuition fees and payrnent schedules will be discussed during the orientation. Scholarship opportunities are available for qualified students. We look forward to welcoming you to our academic community. Should you have any questions, please contact the Office of Admissions at the number provided above. Congratulations once again on your acceptance. Joshua Horfon f"
    },
    {
        "image": "proginvitation1_synth_6_aug4.png",
        "label": "proginvitation",
        "ocr_text": "DE LA SALLE UNIVERSITY Phone: +63 2 9264 5247 Email: registrar delasalleu edu_ph Taft Avenue, Manila INVITATION TO JOIN THE Sy Se OF NURSING PROGRA James Smith 1490 43rd Road Extension, Olsen Cove, Trinidad, 6147 Eastern Samar Dear James, We are pleased to inform you that you have been selected to join our COLLEGE OF NURSING PROGRAM program for the Academic Year 2025 2026. Your academic achievements and exceptional entrance examination results have demonstrated your readiness for higher education. The program offers comprehensive courses designed to prepare students for professional careers in healthcare and medical services. Our faculty members are industry experts committed to providing quality education through innovative teaching methods and hands on learning experiences. Orientation will be held on January 10, 2026 at the University Auditorium. Please bring the following documents: Original PSA Birth Certificate, Form 138 (High School Report Card), Certificate of Good Moral Character, Medical Certificate, and two 2x2 ID pictures. The registration period is from December 17, 2025 to January 24, 2026. Tuition fees and payment schedules will be discussed during the orientation. Scholarship opportunities are available for qualified students. We look forward to welcoming you to our academic community. Should you have any questions, please contact the Office of Admissions at the number provided above. Congratulations once again on your acceptance. Joshua Horton Dean, College of Engineering"
    },
    {
        "image": "proginvitation1_synth_6_aug5.png",
        "label": "proginvitation",
        "ocr_text": "DE LA SALLE UNIVERSITY Phone: +83 2 9264 5247 Email. registrar dolasatleu edu ph Taft Avenue Mania INVITATION TO JOIN THE COLLEGE OF NURSING PROGRAM James Smith 1490 4510 Road Extension, Oisen Cove, Trinkiad Dear James, We are pleased to inform you that you have been selected to join our COLLEGE OF NURSING PROGRAM program for the Academic Year 2025 2026. Your academic achievements and exceptional entrance examination results have demonstrated your readiness for higher education. The program offers comprehensive courses designed to prepare students for professional careers in healthcare and medica! services. Our faculty members are industry experts committed to providing quality education through innovative teaching methods and hands on learning experiences. Orientation wiil be held on January 10, 2026 at the University Auditorium. Please bring the following documents: Original PSA Birth Certificate, Form 138 (High Schoc! Report Card), Certificate of Good Moral Character, Medicai Certificate, and two 2x2 ID pictures. The registration period is from December 17, 2025 te January 24, 2026. Tuition fees and payment schedules will be discussed during the orientation. Scholarship opportunities are available for qualified students. We look forward to welcoming you to our academic community. Should you have any questions, please contact the Office of Admissions at the number provided above. Congratulations once again on your acceptance. Joshua Horton Dean, Cokiege of Engineering"
    },
    {
        "image": "proginvitation1_synth_7_aug1.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY ATENEO DE MANILA pA INVITATION TO ENROLL IN BACHELOR OF FENCE IN BUSINESS ADMINISTRAG iON ou have been selected to join Our STRATION progr” for the ents and exceptional Dear Bryan. to inform you val F SCIENCE IN BUSINESS ADMINI 95 2026. You rademic achievers n results have demonstrated your readiness for higher offers com hensive courses designed te prepare gers in business and finance. Our faculty members uality education through innovalive ances. Orientation will be held the following We are please BACHELOR Oo Academic Year 20 entrance examinalio education. The program dents for profession’ car siry experts comrnitied t providing gq ds and hands on learming expel 6, 2025 ai the University Auditorium. Pleas® bring ih inal PSA Birth Certificate, Form 438 (High School Report Gard), 4f Good Moral Characie!, Medical Cerlificate. and two 2x2 1D 19 registration period is from Decemoer 96, 2025 to danue ry 19, 2096, Tuition fees and payment schedules will be discussed during the orientation. Scholarship opportunities afe available for qualified studants. We look forward fo welcoming you fo OCF academic communty. Should you ha any questions, please co aci the Office of Admissions at the number provic ed above. Congr nee again on your acceptance. Siu are indu teaching metho on Decembet pictures. FF tulations Once"
    },
    {
        "image": "proginvitation1_synth_7_aug2.png",
        "label": "proginvitation",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Email registrar @ateneodema edu ph Phone +463 2. 9967 1655 Quezon City, Metro Manila INVITATION TO ENROLL IN BACHELOR OF SCIENCE IN BUSINESS ADMINISTRATION Bryan Garcia 5 Frank Suites 9, 6172 Makiling Road, Libacao, 9805 Lanao del Sur Dear Bryan, ou that you have been selected to join our N BUSINESS ADMINISTRATION program for the hievements and exceptional your readiness for higher es designed to prepare We are pleased to inform y BACHELOR OF SCIENCE Academic Year 2025 2026. Your academic ac! entrance examination results have demonstrated education. The program 0 students for professional careers in business and finance. Our faculty members are industry experts committed to providing quality education through innovative teaching methods and hands on learning experiences. Orientation will be held on December 26, 2025 at the University Auditorium. Please bring the following documents: Original PSA Birth Certificate, Form 138 (High School Report Card), Certificate of Good Moral Character, Medical Certificate, and two 2x2 ID pictures. The registration period is from December 26, 2025 to January 19, 2026. Tuition fees and payment schedules will be discussed during the orientation. Scholarship opportunities are available for qualified students. We look forward to welcoming you to our academic community. Should you have any questions, please contact the Office of Admissions at the number provided above. Congratulations once again on your acceptance. Brandon Russell Registrar"
    },
    {
        "image": "proginvitation1_synth_7_aug3.png",
        "label": "proginvitation",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Quezon Gity, Metro Manta INVITATION TO ENROLL iN BACHELOR OF SCIENCE IN BUSINESS ADMINISTRATION Bryan Garcia 4 Road, Libacwe, Dear Bryan, y BACHEL Academic Year 202 entrance examination resul educa students for professiona are industry experts committed teaching methods a OR OF SCIENCE IN BUSIN ti documents: Origina Certificate of Good Moral Character, pictures. The registration pe 20268. Tuition fees and payme orientation. Scholarship opportuniti jook forward to welc any questions, please contact the O above. Congratulations once again Brandon Russ Regisiter We are pleased to inform you that you have 25 2026, Your academic ts have demonstrated your rea tion. The program offers cornprehens i careers in business an to providing quality educa i nd hands on learning experi on December 26, 2025 at the University Ai i PSA Birth Certificate, Form 438 (High School Report Card), riod is from December 26, 202 nt schedules will be discussed during the es are availab coming you fo our academic communit been selected to join our ESS ADMINISTRATION program for the achievernenis and exceptional sdiness for higher ive courses designed to prepare d finance. Our faculty members on through Innovative riences. Orientation will be held im, Please bring the following and two 2x2 1D Medical Certificate 25 to January 19. ic for qualified students. We Should you have ffice of Admissions at the number provided on your acceptance."
    },
    {
        "image": "proginvitation1_synth_7_aug4.png",
        "label": "proginvitation",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY INVITATION TO ENROLL IN BACHELOR OF NEIENCE IN BUSINESS ADMINIST RATION Dear Bryan, dio inform you that you have been selected to join our We are please BACHELOR OF SCIENCE IN BUSINESS ADMINISTRATION program for the amie achievements and exceptional Year 2025 2026. Your aca resulis have demonsirated your readiness for higher offers comprehensive courses designed 10 prepare careers in business and finance. Our faculty members tad to providing quality aducation through innovative ming experiences. Orientation will be heid sity Auditorium. Please bring the following SA Birth Certificaie, Form 138 (High Schoo! Report Card), Character, Medical Certificate, and ive 2x2 WD cod ig from December 36, 2075 to January 48, (be discussed during the le for quallfi students. We munity. Should you have the number provided Acadet entrance examinatiat aducation, The program students for profession are industry experts commit teaching methods ad hands on lea on December 26, 9925 at the Univer documents: Original P Certificate of Good Moral ictures. The registration pel 2026. Tuition fees and payment schedules orientation. Scholarship opportunities are ava icok forward to welcoming you te our academic cam any questions, please contact the Office of Admissions at above. Congratula ain on your acceptance. flons One ag Grandon Russell"
    },
    {
        "image": "proginvitation1_synth_7_aug5.png",
        "label": "proginvitation",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Emait: reyistar utencodema edu ph Phone: +83 2 9957 1855 Quezon City, Metro Mania INVITATION TO ENROLL IN BACHELOR OF SCIENCE IN BUSINESS ADMINISTRATION Bryan Garcia 5F Frark Suites 9, 6172 Making Ruad, Libacao, 9805 Lanzo det Sur Dear Bryan, We are pleased to inform you that you have been selected to join our BACHELOR OF SCIENCE IN BUSINESS ADMINISTRATION program for the Academic Year 2025 2026. Your academic achievements and exceptional entrance examination results have demonstrated your readiness for higher education. The program offers comprehensive courses designed to prepare students for professional careers in business and finance. Our faculty members are industry experts committed to providing quality education through innovative teaching methods and hands on learning experiences. Orientation will be held on December 26, 2025 at the University Auditorium. Please bring the following documents: Original PSA Birth Certificate, Form 138 (High School Report Card), Certificate of Good Moral Character, Medical Certificate, and two 2x2 ID pictures. The registration period is from December 26, 2025 to January 19, 2026. Tuition fees and payment schedules will be discussed during the orientation. Scholarship opportunities are available for qualified students. We look forward to welcoming you to our academic community. Should you have any questions, please contact the Office of Admissions at the number provided above. Congratulations once again on your acceptance. Brandon Russeli Registrar"
    },
    {
        "image": "proginvitation1_synth_8_aug1.png",
        "label": "proginvitation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Email: registrar polytechni edu_ph Phone: +63 2 8672 7307 Taft Avenue, Manila INVITATION TO ENROLL IN BACHELOR OF SCIENCE IN COMPUTER SCIENCE Jose Savage 8767 Cresta Drive Extension, Camia Estates Phase 1 Dumarao, 2046 Batangas Dear Jose, We are pleased to inform you that you have been selected to join our BACHELOR OF SCIENCE IN COMPUTER SCIENCE program for the Academic Year 2025 2026. Your academic achievements and exceptional entrance examination results have demonstrated your readiness for higher education. The program offers comprehensive courses designed to prepare students for professional careers in technology and software development. Our faculty members are industry experts committed to providing quality education through innovative teaching methods and hands on learning experiences. Orientation will be held on January 03, 2026 at the University Auditorium. Please bring the following documents: Original PSA Birth Certificate, Form 138 (High School Report Card), Certificate of Good Moral Character, Medical Certificate, and two 2x2 ID pictures. The registration period is from December 12, 2025 to January 09, 2026. Tuition fees and payment schedules will be discussed during the orientation. Scholarship opportunities are available for qualified students. We look forward to welcoming you to our academic community. Should you have any questions, please contact the Office of Admissions at the number provided above. Congratulations once again on your acceptance. Francis Miller Dean, College of Engineering"
    },
    {
        "image": "proginvitation1_synth_8_aug2.png",
        "label": "proginvitation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Jods ob Phe 7307 Taft Avenue, Manila INV TION TO ENROLL IN BACHEL IENCE IN COMPUTER SCIENC OF Jose Savage Dear Jose, We are pleased toi n you that you have been selected to join our BACHELOR OF SCIENCE IN COMPUTER SCIENCE program for the Academic Year 2025 2026. Your academic achievements and exceptional entrance examination results nave de strated your readiness for higher education. The program offers cornprehensive courses designed io prepare students for professional careers in tachnology and software devsiopment. Our members are industry experts committed fo providing quality cation through innovative teaching methods and hands on learning experiences. Orientatian will be held on January 03, 2026 al the University Auditorium. Please bring the following documents: Original PSA Birth Certific Form 138 (High School Report Card), Certificate of Good Moral Character, Medical Certificate, and two 2x2 ID pictures. The registration period is from December 12, 2025 to January 09, 2026. Tuition fees and payment schedules will be iscussed during the orientation. Schelarship opporiunities are available for 1 students. We look forward to welcoming you te our academic community. Shouid you have any questions, please contact the Office of Admissions at the number provided above. Cangratulalions once again on your Francis Miller"
    },
    {
        "image": "proginvitation1_synth_8_aug3.png",
        "label": "proginvitation",
        "ocr_text": "POLYTECHNIG UNIVERSITY OF THE PHILIPPINES Emait: registrar @polytechnt edu. ph Phone: +63 2 8672 7307 Taft Avenue, Manila INVITATION TO ENROLL IN BACHELOR OF SCIENCE IN COMPUTER SCIENCE Jose Savage 767 Crests Deve Exiension, Camia Estates Phase 1, Dumarao, 2045 Gatanges Dear Jose, We are pleased to inform you that you have been selected to join our BACHELOR OF SCIENCE IN COMPUTER SCIENCE program for the Academic Year 2025 2026. Your academic achievements and exceptional entrance examination results have demonstrated your readiness for higher education. The program offers comprehensive courses designed to prepare students for professional careers in technology and software development. Our faculty members are industry experts commitied to providing quality education through innovative teaching methods and hands on learning experiences. Orientation will be held on January 03, 2026 at the University Auditorium. Please bring the following documents: Original PSA Birth Certificate, Form 138 (High School Report Card), Certificate of Good Moral Character, Medica! Certificate, and two 2x2 ID pictures. The registration period is from December 42, 2025 to January 09, 2026. Tuition fees and payment schedules will be discussed during the orientation. Scholarship opportunities are available for qualified students. We look forward to welcoming you to our academic community. Should you have any questions, piease contact the Office of Admissions at the number provided above. Congratulations once again on your acceptance. Francis Mitler Dean, Cottage of Engineering"
    },
    {
        "image": "proginvitation1_synth_8_aug4.png",
        "label": "proginvitation",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Email: registrar polytechni edu ph Phone: +63 2 8672 7307 Taft Avenue, Manila INVITATION TO ENROLL IN BACHELOR OF SCIENCE IN COMPUTER SCIENCE Jose Savage 8767 Cresta Drive Extension, Camia Estates Phase 1, Dumarao, 2046 Batangas Dear Jose, We are pleased to inform you that you have been selected to join our BACHELOR OF SCIENCE IN COMPUTER SCIENCE program for the Academic Year 2025 2026. Your academic achievements and exceptional entrance examination results have demonstrated your readiness for higher education. The program offers comprehensive courses designed to prepare students for professional careers in technology and software development. Our faculty members are industry experts committed to providing quality education through innovative teaching methods and hands on learning experiences. Orientation will be held on January 03, 2026 at the University Auditorium. Please bring the following documents: Original PSA Birth Certificate, Form 138 (High School Report Card), Certificate of Good Moral Character, Medical Certificate, and two 2x2 ID pictures. The registration period is from December 12, 2025 to January 09, 2026. Tuition fees and payment schedules will be discussed during the orientation. Scholarship opportunities are available for qualified students. We look forward to welcoming you to our academic community. Should you have any questions, please contact the Office of Admissions at the number provided above. Congratulations once again on your acceptance. Francis Miller Dean, College of Engineering"
    },
    {
        "image": "proginvitation1_synth_8_aug5.png",
        "label": "proginvitation",
        "ocr_text": "POLYTECHNIC UNIVERSIT PHILIPPINES YOF THE Email: registrar polytechniedu ph Phone: +63 2 8672 7307 Taft Avenue, Manila INVITATION TO ENROLL IN BACHE SCIENCE IN COMPUTER SCIENCE OF Jose Savage 8767 Cresta Drive Extension, Camia Estates Phase 1 Oumarao, 2046 Batangas Dear Jose, We are pleased to inform you that you have be BACHELOR OF SCIENCE IN COMPUTER SC Academic Year 2025 2026. Your academic ac entrance examination results have demonstra education. The program offers comprehensiv students for professional careers in technolo faculty members are industry experts commi through innovative teaching methods and h Orientation will be held on January 03, 202 Please bring the following documents: Orig (High School Report Card), Certificate of G Certificate, and two 2x2 ID pictures. The re 12, 2025 to January 09, 2026. Tuition fees discussed during the orientation. Scholars| qualified students. We look forward to wel community. Should Admissions at the n acceptance. en selected to join our IENCE program for the hievements and exceptional ted your readiness for higher courses designed to prepare gy and software development. Our tted to providing quality education ands on learning experiences, 6 at the University Auditorium. inal PSA Birth Certificate, Form 138 ood Moral Character, Medical gistration period is from December and payment schedules will be hip opportunities are available for coming you to our academic you have any questions, please contact the Office of umber provided above. Congratulations once again on your Francis Miller Dean, College of Engineering"
    },
    {
        "image": "proginvitation1_synth_9_aug1.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES MANILA Phone: +63 2 9241 8529) Emait infoQuothephit edu Ph Quezon City, Mewo Manila INVITATION To THE BACHELOR OF ARTS IN COMMUNICATION PROGRAM Hector Vega 128 Hunter Road, Caras;, 5278 Cagayan Dear Hector, Ofientation, Schoia look forward to we any questions, ple above. Congratuia rship Opportunitie icoming you to our academj 4S€ Contact the tions once 4 community. Should Office of Admissions st the number Provided gin On your acceptance, David Silva Vice President for Academic Affairs"
    },
    {
        "image": "proginvitation1_synth_9_aug2.png",
        "label": "proginvitation",
        "ocr_text": "SITY OF THE PHILIPPINES MANILA 241 8529 Email: info uofthephil edu ph Quezot UNIVER City, Metro Manila Phone: +63 2 9: ACHELOR OF ARTS IN INVITATION TO THE B. COMMUNICATION PROGRAI Hector Vega 428 Hunter Road, Carast, 5276 Cagayan Dear Hector, that you have been selected to join our ased to inform you MMUNICATION PROGRAM program for the R OF ARTS IN co Academic our academic achievements and exceptional i demonstrated your readiness for higher designed to prepare entrance examina’ education. The program offers comprehensive courses students for professional careers in media and communications. Our faculty ality education through members are industry experts committed to providing qu innovative teachi nds on learning experiences. Orientation i ‘torium. Please bring the will be held on January 01, following docume i te, Form 438 (High School Report Card), Certificate of Go' al Certificate, and two 2x2 ID pictures. The registration period is from December 23, 2025 to January 40, 2026. Tuition fees and payment schedules will be discussed during the orientation. Scholarship opportunities are available for qualified students. We hould you have look forward to welcoming you to our academic community. S any questions, please contact the Office of Admissions at the number provided above. Congratulations once again on your acceptance. We are ple PSA Birth Certifica od Moral Character, Medic David Silva Vice President for Academic Affairs"
    },
    {
        "image": "proginvitation1_synth_9_aug3.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES MANILA Phone. +83 2 9244 4 INVITATION TO THE BACHELOR OF ARTS IN COMMUNICATION PROGRAM Hector Vega Dear Hector, We are pleased fo inform you that you nave been selected to join our BACHELOR OF ARTS iN COMMUNICATION PROGRAM program for ihe Academic Year 9025 2026. Your 4 cademic achievements and exceptional entrance examination reguits have demonstrated your readiness for higher education. The program offers comprehensive courses designed to prepare students for professional care nications. Our faculty ars in media and commun! members are industry experts comrmitied to providing quality education through innovative teaching methods and hands on learning experiences. Onentation will be heid on January 04, 2026 at tne University Auditorium. Please bring the following docurnents: Original PSA Binh Certificate, Form 448 (High Schoo! Report Card), Cartificate of Good Moral Character, Medical Certificate, and two 2x2 1D pictures. The registration period is from December 23, 2025 fo January 46, 2026. Tuition fees and payment schedules will be discussed during the orientation. Scholarship opportunities are available for qualified students. We look forward to welcoming you fo our academic community. Should you have any questions, picase contact the Office of Admissions at ie F mer provided above. Congratulations once again on your acceplance. We David"
    },
    {
        "image": "proginvitation1_synth_9_aug4.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES MANILA Phone: +63 2 9241 8529 Email: info uofthephil edu ph Quezon City, Metro Manila INVITATION TO THE BACHELOR OF ARTS IN COMMUNICATION PROGRAM Hector Vega 428 Hunter Road, Carast, 5276 Cagayan Dear Hector, have been selected to join our We are pleased to inform you that you BACHELOR OF ARTS IN COMMUNICATION PROGRAM program for the Academic Year 2025 2026. Your academic achievements and exceptional entrance examination results have demonstrated your readiness for higher education. The program offers comprehensive courses designed to prepare students for professional careers in media and communications. Our faculty members are industry experts committed to providing quality education through innovative teaching methods and hands on learning experiences. Orientation will be held on Auditorium. Please bring the January 01, 2026 at the University following documents: Original PSA Birth Certificate, Form 438 (High School Report Card), Certificate of Good Moral Character, Medical Certificate, and two 2x2 ID pictures. The registration period is from December 23, 2025 to January 40, 2026. Tuition fees and payment schedules will be discussed during the orientation. Scholarship opportunities are available for qualified students. We look forward to welcoming you to our academic community. Should you have any questions, please contact the Office of Admissions at the number provided above. Congratulations once again on your acceptance. David Silva Vice President for Academic Affairs"
    },
    {
        "image": "proginvitation1_synth_9_aug5.png",
        "label": "proginvitation",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES MANILA Phone: +63 2 9241 8529 Email: info uofthephil edu ph Quezon City, Metro Manila INVITATION TO THE BACHELOR OF ARTS IN COMMUNICATION PROGRAM Hector Vega 128 Hunter Road, Carasi, 5276 Cagayan Dear Hector, We are pleased to inform you that you have been selected to join our BACHELOR OF ARTS IN COMMUNICATION PROGRAM program for the Academic Year 2025 2026. Your academic achievements and exceptional entrance examination results have demonstrated your readiness for higher education. The program offers comprehensive courses designed to prepare students for professional careers in media and communications. Our faculty members are industry experts committed to providing quality education through innovative teaching methods and hands on learning experiences. Orientation will be held on January 01, 2026 at the University Auditorium. Please bring the following documents: Original PSA Birth Certificate, Form 138 (High School Report Card), Certificate of Good Moral Character, Medical Certificate, and two 2x2 ID pictures. The registration period is from December 23, 2025 to January 10, 2026. Tuition fees and payment schedules will be discussed during the orientation. Scholarship opportunities are available for qualified students. We look forward to welcoming you to our academic community. Should you have any questions, please contact the Office of Admissions at the number provided above. Congratulations once again on your acceptance. David Silva Vice President for Academic Affairs"
    },
    {
        "image": "proginvitation2_synth_11_aug1.png",
        "label": "proginvitation",
        "ocr_text": "ovambe: OF THe PHILIPPINE ur nsttticn Ham pleased to recommends Jason Witson fo vission fo vour giaduate pragiaie ie past ny ional develorment J er ptafessor and academic adv “demic performance ai prote =, {have has dercraduale thesis an Cominunity Base: aur dep. aster Risk Reduction Ero, and act to your academic community, Please iiibate segnitic ei tae conta ae choud x whit Troy Witla"
    },
    {
        "image": "proginvitation2_synth_11_aug2.png",
        "label": "proginvitation",
        "ocr_text": "of the Phatippanes REGION 17 2028 inti Roy TECHNOLOGIGAL UNIVERSITY OF THE PHAIPPINES Dee Jaen, arm greetings fon our station! of Saence i 1 ate pleased to resuminend Jason Wison tor admrigsisn fo your graduate progiam information Techinolagy. As her sioteesor a b peluisee for tie nast to years, Ligue had he upaortunity to observe her acadenuc perigrnance ana professional devatopment Jason Wilson hi emunstiated Jolfs, dedication to reeearch, and ssong leadership quaities. Hur ptlonal analyte canis recaived high cormmandation irom .Suiate thasis on Community Based Disaster Risk Reduction Pro aouily, She has mainigined a GPA of 3 £2 and sctivoly participated in academic cont a] sion programs. fan conigent tat Jasin Wiison wit! be an excatient addition to yout pF P nig conurud 2 ioe! hee Wo Contact me should you require puts signifcany w your scar sectional information regarding this recommenca ing Approval >: bitney Ress Rega Carey Snyder db ‘ie Pron tet Azatoa Progras. November 17, 2525"
    },
    {
        "image": "proginvitation2_synth_11_aug3.png",
        "label": "proginvitation",
        "ocr_text": "HE PHILIPPINES: pioased te recaremend Ja information Teclinalogy, hs her profeseur and acacemie to abseivs ner academic neta mance and professinval deve nal onaiytical Sk undergraduate Hiasis en Commu our depestmnent fealty, She fas in ‘eonemunity extension and eit ‘adsillonal infermation regarding this ree jent hat Jason Wil iy P well be 1 fie to cunlact me programs. jon fo your oy noutie yo 2 significantly to your acadern samencaiion ‘Golage Dean Reysiae ated by Approve Troy Williams Prseiget fer aden"
    },
    {
        "image": "proginvitation2_synth_11_aug4.png",
        "label": "proginvitation",
        "ocr_text": "spi of the Fastin seas ARERR OF PS ee woverber 17, 2025 ten Roy Program Head catage of TY OF THE PHAPPRES snformation Techni? Oar dees, care postnge wernt abo 1 am pleased fe ocr 58897 ct yor rate arose ERE soence xo yore, rae NAG HS 7 seisprnent iannn wan nab COP og strong tenes att comrenenctabicn BO ag abeerve nar ecade™ gomncrarated excentons padergraciate inode of SO Somvon Progais oucbved MG ‘our angarimst taew 5 2 a active pers HP erat COREE ‘am conden evat sonar AIS tos pean cont aoation YO program ree bre nee wo HMDA NE SUIS FM recisink egevonusity BxRPSION OMT aed wt congue SIGNIRCANEE paceional fost regard ecosmenting AD \\wiltney Poss neg oe Prensa fo antes ea reevember 17 2"
    },
    {
        "image": "proginvitation2_synth_11_aug5.png",
        "label": "proginvitation",
        "ocr_text": "November 17, 2025 Lon Roy Program Head Cotege of Technology TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES Dear Jason, Warm greetings trom ow mettiton! Respectfully Yours, Robert Hubbard Cohage Ona Noted by: Troy Williams View Pronto Aeaseme ao November 17, 2025 vison tor admission to your graduate program in Master of Science in ‘academic adviser forthe past two years, Ihave had the opportunity Approved by: Corey Snyder Progran Head"
    },
    {
        "image": "proginvitation2_synth_12_aug1.png",
        "label": "proginvitation",
        "ocr_text": "Repubine of the Phulgpanes BICOL UNIVERSITY ‘Supreme Saatent Cowucit REGION Xi Nowember 15, 2025 ‘Catyn Conner Progras Head Colege of Engneorng: BICOL UNIVERSITY Dear Gora, Greatings and best wishes! ‘This lelty: sacves as my strong recommendation for Gicna Roberts wne ts applying for te Master of Arts Eoucation program at your esteemed instiution. !hieve known te: for taro years as har inatuctor and vasaarc superviver. Throughout het seacemic journey, Glons Roberss has exhibited remarkabie deacon, intabactua! curiosity, and acadenvc exortionce. Her research work on indigenous Knowledge Sysients in Exucstion demonstiates etong analytical anc critical thinking abides. Gioia Roverte has achieved a GPA of 3 04 ang has bean recognized with multiple academic awants. She posseases exretien! communication skits atid works “etrectivwly both indenendendy and in team: settings. I whoisheartadiy endorse her application and believe ahe wit ‘netve in your graduate program. Should you need furtnar mformaton, pease Co not hesiate t Comtact me, Resyectfully Yours, Reeqpaendjng Apsrovel by! Artin Costerada Rocky Gibert Grerter, Genuate Someet (Cataga Ome Noted by: Approved br: Travis Mcbride Douglas Jimenez Departsen cha Prograp Head November 16 2025"
    },
    {
        "image": "proginvitation2_synth_12_aug2.png",
        "label": "proginvitation",
        "ocr_text": "Reptiblic of the Biehimpines BICOL UNIVERSITY Supreme Stetent (1 Caitlyn Connar Program Head Golne of Engewoaringg BICOL UNIVERSITY strong recommendation tor Glon: Education program at your estaemedd inettution. ti Throughout ner academic jcumiey, Ginria Rcberts has exhibited rearkenle dedication, inteto ic eucallence Her research wark ac haigenous Knowtedige Systems in Eaucation Tstraies sifony anaivtical ano crtcai dinking abilities. Glasie Rabei s has achloved a GPA cf 3 64 and has Stet tecognized witt mulipte academic awards, She posseeses excellent communication shits ang warke ‘lively both indeperidonily and in isam settings, whoicheartediy eridorsa her apsilieation and vaseve she wit ‘hrive in your graduala program, Should you need futher infosmation, plaase 82 nal nesnata to sontect ine Zoben s whe es applying fer the Masies of Ars in “svotor and research Yours, Asthur Castanedia Noted by: Satege Dean Appreved by: Travis Mebriie Jimener Doug Drprdimey Cnar Prograp He Noveabor 14, 2025"
    },
    {
        "image": "proginvitation2_synth_12_aug3.png",
        "label": "proginvitation",
        "ocr_text": "Republic of tue Pisbsppanes pcg UNIVERSITY Sugrente Sastent Counc ab REGICN XS siovaniner 15, 26: oaitiyn Conner wograss Ye of Engen BICOL UNIVER: Sry dear Biers, Mostar of Arte beat wishes! a roseare eine er instucto avant deication. 10 ig Educata of a8 and Hat Greetings end Rober her tor sites rem omedge syste 23a GP) recoinmendtation for Giors have Bows 2H gorves as my 38090 ram atyour aakeamed 1astston viper academic urney, ors RA sahectai ee. Her searet wOTE sabi eseases 2x0et ngs. isnotehsartadty eneterse apace ‘oration, piease do not nasi ‘ins iets sytaton pros aupersigar. THOU coriesity, ane BRECON gemansualns st00g ABN pose recognized wan mature scarst™ afoctvely D0 sy aoe in wan sett sion to vO gram, Sheu yar aed rm pert ch ES believe sho wil sick and critical tun airatd. SE se vp coranct ne. oth indenanc? graduate Pro Ricky Giles site, eta ok ate Dee Travis Mabie Heed epartvent Oh"
    },
    {
        "image": "proginvitation2_synth_12_aug4.png",
        "label": "proginvitation",
        "ocr_text": "Republic of the Philippines BICOL UNIVERSITY ‘Supreme Student Council REGION XI November 15, 2025 Caittyn Conner Program Head College of Engineering BICOL UNIVERSITY Dear Gloria, Greetings and best wishes! ‘This letter serves as my strong recommendation for Gloria Roberts who is applying for the Master of Arts in Education program at your esteemed institution. have known her for two years as her instructor and research supervisor. Throughout her academic journey, Gloria Roberts has exhibited remarkable dedication, intellectual curiosity, and academic excellence. Her research work on Indigenous Knowledge Systems in Education demonstrates strong analytical and critical thinking abilities. Gloria Roberts has achieved a GPA of 3 94 and has been recognized with multiple academic awards. She possesses excellent communication skills and works effectively both independently and in team settings. wholeheartedly endorse her application and believe she will thrive in your graduate program. Should you need further information, please do not hesitate to contact me. Respectfully Yours, Recqnendjng Approval by: ‘Arthur Castaneda Ricky Gilbert Director, Graduate Schoo! Cobege Dean Noted by: Approved by: Travis Mcbride Douglas Jimenez Department Cha Program Head November 15 2025"
    },
    {
        "image": "proginvitation2_synth_12_aug5.png",
        "label": "proginvitation",
        "ocr_text": "BICOL UNIVERSITY Supreme Sradeot Councit REGION xI a November 15 2025 Caityn Connor Progrea Head Cotare ot Egseting BICOL UNIVERSITY ‘Dear Glove, \"sabe. Sora Rsbers nes achleved a GPA of 3 ane has Deen recogntznd with multe aceaemic awards Sha Rossasces exoebeni comauicaton sce end woe ‘mveinyou aeons Shoda yuna iter omen eee Soren eee Respectfully Youre, e 2 by: rectally Toure, Resquacoding Approval by Arthas Costanese Ricky Giaber Dracter Geatiaie Scheu Cateye Dee Noted br: Approved by: Travis Mcbride. Dougias Jimanez Creamers one Progras lead Novemver 15, 2025"
    },
    {
        "image": "proginvitation2_synth_13_aug1.png",
        "label": "proginvitation",
        "ocr_text": "Republic of the Philippines MINDANAO STATE UNIVERSITY ‘Supreme Student Council REGION Ill October 20, 2025 Beverly Simpson Progran Head College of Nursing MINDANAO STATE UNIVERSITY Dear Amanda Greetings and best wishes! ‘This letter serves as my strong recommendation f ‘Agriculture program at your esteemed insttuton supervisor Throughout her academic journey, Aman ‘curiosity, and academic excellence. Her research wor ing abilities Amanda Huang has achieved a GPA of 3 83 and has Js She possesses excellent communication skills and works demonstrates strong analytcal and critcal thinki been recognized with multiple academic award effectively both independently and in team settin thrive in your graduate program Should you need furt ectfully Yours, ‘Sharon Vaughn Vice Present for Aeaseme Altars Huang who 1s applying for the Master of Science in for Amanda tor and research Ihave known her for four years as her instruct ‘da Huang has exhibited remarkable dedication, intellectual rk on Healthcare Accessibility in Remote Areas .98. wholeheartedly endorse her application and believe she will ther information, please do not hesitate to contact me 1b Recgamending Appros Philip Johnson Vice President for Academe Aftars. Noted by Approved by Me. Erie Martin Joseph Williams (Cotege Dean Program Head October 20, 2025"
    },
    {
        "image": "proginvitation2_synth_13_aug2.png",
        "label": "proginvitation",
        "ocr_text": "Republic of the MINDANAO STATE UNIVERSITY ‘Supreme Student Council REGION i (October 20, 2025 Beverly Simpson Program Head Colege of Nursing MINDANAO STATE UNIVERSITY Dear Amanda, Greetings and best wishes! Recgmmending Approval by: Sharon Vaughn Phillip Johnson Vee Preset er Adami tary Vice President for Academic Afars Noted by: Approved by: Mr. Eric Martin Joseph Williams Cotege Dean Program Head"
    },
    {
        "image": "proginvitation2_synth_13_aug3.png",
        "label": "proginvitation",
        "ocr_text": "Republic of the Phitingines MINDANAO STATE UNIVERSITY Supreme Statent Counc REGION ti pdr 20, 2028 Beverly Simpson Program fiead Cetage of Nursing MINDANAO STATE UNIVERSITY Daas Amanda, ter of Sowence i snaiuctor and reseatels 2 haile dedication, intaitectint n work on Healthcare Accessiblity ia Remote Ar king alvities, Aranda Huang nas achieved a CPA of 2 £3 and has alls and works supsnissr ney, Amanda Huang hi curiosity, aed academic exostiense, Har reser ates shang analytes} ani crit bean recognized wth tulip clively both inceporeti epecttubiy Yo Priiip Jobraon ‘Sharon Vaughn 0 frescen fr Batam te Wie Presivent for acai Noted ty: proved b Me. Erie Martin: sosepls Wiams College Daan am Head tober 20 2025"
    },
    {
        "image": "proginvitation2_synth_13_aug4.png",
        "label": "proginvitation",
        "ocr_text": "Republic of the Philippines MINDANAO STATE UNIVERSITY Supreme Student Council REGION it ‘October 20, 2025 Beverly Simpson Program Head Cotege of Nursing MINDANAO STATE UNIVERSITY Dear Amanda, Greetings and best wishes! ‘This letter serves as my strong recommendation for Amanda Huang who is applying for the Master of Science in ‘Agriculture program at your esteemed institution. have known her for four years as her instructor and research ‘supervisor. Throughout her academic journey, Amanda Huang has exhibited remarkable dedication, intellectual curiosity, and academic excellence. Her research work on Healthcare Accessibility in Remote Areas ‘demonstrates strong analytical and critical thinking abilities. Amanda Huang has achieved a GPA of 3 83 and has ‘been recognized with multiple academic awards. She possesses excellent communication skills and works ‘eflectively both independently and in team settings. wholeheartedly endorse her application and believe she will thrive in your graduate program. Should you need further information, please do not hesitate to contact me. Respectfully Yours, Recqamending Approval by: ‘Sharon Vaughn Phillip Johnson ee Pesan fr Aestent Aas \"Vice President for Academic Aftars Noted by: Approved by: Mr. Eric Martin Joseph Wiliams Colege Dean Program Head ‘October 20, 2025"
    },
    {
        "image": "proginvitation2_synth_13_aug5.png",
        "label": "proginvitation",
        "ocr_text": "Reprilic of the Puibippe HINGANAO STATE UNIVERSITY sapreme Stadeat Counc REGIE HE ‘foctoner 20, 25: every Surpson aay of ICSD MINDANAG STATE uN Dear Amanda, ings and best wishes! {ne Master of Scie semana Huang who Is appnyin f actor ang resSaTen seendation jeptution, {nave Keown her for for Ve sRaveade Huang hs exited emarsaute dese Jaron work on fHealttieate RaneseIDHIY 8 fanands Muang 2s nemeed 8 GPA GT 3 82 and FSS sent communication sills aod WOM plication and believe st aadorne era yy please do nit hestizie wo contact latter sonvas ae my st Agwicuiture progiantat your ssvenined rpervignr, Yhroughout her acadienis ce euriosity, and academic excattenes. HEF Tose vrermangtrates tong enaiyhost ans ciel ORIN ABUL eur recognized in witapis acer aware. She BOSS ty and in tenn settings teste! ‘aatars, Should you nend further efor ii hive In your gradu Apprevel ecggmend. Phill Johnson casemss AES ‘Vico Prosisont wees vies Pagizre for Aces approved by Noted by Mi. Eric Mastin coitece Dear cxtaper 26 2028"
    },
    {
        "image": "proginvitation2_synth_14_aug1.png",
        "label": "proginvitation",
        "ocr_text": "Repadiic of the Bic Supreme Smadent Cou Phiiopines UNIVERSITY Novemberes, 2025 Elzabetn Swanson Program Bead Bear Wichaes, Steetngs in ine 9 ereatance! iam pisased to racamy; Nursing. A errention Sustainable a: ha bas maintain rogvams. tam co Staoiticantiy ‘egarding ts co Respectfutty ier Professor and a academic pereeniance i Bravia sie RICCL UnaVERsiry Prot acene Raymond Orne Rovember 94, 2025 oe, Grauate Setoet \"oi Richest Vaughn ter ace adviser Re the 93 rotessiona deve! ‘OM in Raster of Goi i have nan tne oppure iy 0 obsemwe tae has consistenty demonstrated Sevication fo reeewrcn, ard ef, Underradate hes on Liters Practices in Rural Comumintios Fecsived hign cominensiation trom one department iaeuity SEPA SIO T? ana acivey pactciouted ine ea Santerenoxe and community sxension licen thal tichae! Vaughn wi ne an Collen aacition ty your aropram au va contibuts Pea Seadoo contounly, Presse foe tee io wan \"act ime shouts you rauvice asditional information View Povsizeed David Romerw for caer: Ai Tracy Fredinen Program i"
    },
    {
        "image": "proginvitation2_synth_14_aug2.png",
        "label": "proginvitation",
        "ocr_text": "BICOL UNIVERSITY Supreme Student Counct! REGION November 01, 2025 Elizabet Swanson Progran Head Cotege of Education BICOL UNIVERSITY ‘Dear Michael, Greetings nthe spet of academe excetence! |1am pleased to recommend Michael Vaughn for admission to your graduate program in Master of Science in Nursing. As her professor and academic adviser for the past four years, have had the opportunity to observe her academic performance and professional development Michael Vaughn has consistently demonstrated exceptonal analytcal stills, dedicaton tb research, and strong leadership qualites. Her undergraduate thesis on ‘Sustainable Agriculture Practces in Rural Communites received high commendation trom our department faculty. ‘She has maintained a GPA of 3 77 and actvely partcipated in academic conferences and community extension rograms. am confident that Michae! Vaughn will be an excellent additon to your program and will contribute ‘significantly to your academic community, Please fee! ree to contact me should you require additional information regarding this recommendaton Respectfully Yours, Recgamendjng Approval by: Patricia Watson Dovid Romero Chesias Gude tee \"Vice President for Academic Aftars Noted by: Approved by: Raymond Crane Tracy Friedman Pre, Grate Shot Progran Head November 01, 2025"
    },
    {
        "image": "proginvitation2_synth_14_aug3.png",
        "label": "proginvitation",
        "ocr_text": "Republic of the Philippines BICOL UNIVERSITY ‘Supreme Student Council REGION II November 01, 2025 Elizabeth Swanson Program Head College of Education BICOL UNIVERSITY Dear Michael, Greetings in the spr of academic excellence! {fam pleased to recommend Michael Vaughn for admission o your graduate Prosi t in Master of Science in Nursing. AS her professor and academic adviser for the past four years, Ihave had the opportunity to observe her ‘peademic performance and professional development. Michael Vaughn has consistently demonstrated exceptional analytical skis, dedication to research, and strong leadership ‘qualities. Her undergraduate thesis on custuinable Agriculture Practices in Rural Communities recelved high commendation from our department faculty. ‘She hae maintained a GPA of 3 77 and actly participated in academic conferences ‘and community extension programs. 1am confident that Michael Vaughn willbe an excellent addition to your program and will contribute significantly to your academic community. Please fee! free to contact me ‘should you require additional information regarding this recommendation. Respectfully Yours, Recqmmendjng Approval by: Patricia Watson David Romero Dieter, radiate Schoo! Vice President for Academic Affairs Noted by: Approved by: Raymond Crane Tracy Friedman Director, Graduate School Program Head November 01 2025"
    },
    {
        "image": "proginvitation2_synth_14_aug4.png",
        "label": "proginvitation",
        "ocr_text": "Republic BICOL UNIVERSITY supreme Student ‘Council REGION I November 01, 2025 Elizabeth Swanson Program Head colege of Education BICOL UNIVERSITY Dear Michael, Greetings in the sit of 36a8= cexcelencel ‘am pleased to recommend Micnaet Vaughn for admission your graduate program in Master of Science in ic adviser for the eave Be oP her s Vaughn has consistently demor yguate thesis on lector, rauate Sehosk Noted by: Raymond Crane Director, Graduate School November 01, 2025 and strong veadershiP qualities. ties received high mndation from our ‘department faculty ‘community Rural actively participated in conferences af ‘tit pe an excelent agaibon 19 YO\" ‘and will contribute se an ence me sou yurenure asters STS Vice President for Academic AMS Approved by: Tracy Friedman Program Head"
    },
    {
        "image": "proginvitation2_synth_14_aug5.png",
        "label": "proginvitation",
        "ocr_text": "BICOL UNIVERSITY Supreane Student Coal Soke of Eoratn BICOL UN! vERSITY Bieta gt nthe spat of acedsmc in ha 6 Michael Vaughn for admission to your graduate progrs arivisel for ihe nasttour years, Ihave had the oppotunity to observe her nat dovalopinet Nectiae! Vaugnn N y dernonstiated search, wid strong leadership qualities. Her undergraduate thesis on nadie Agente Practices in Rural unites received high commengaton som our separmnent facut Gre hay mvantained a GPA of 3 77 and actively pamtompated in academie conferences and community extension ptagrams, Ls conhaent that Michaet Vaugist wil bo ae excellent addition fp your program aad wil contabute Shurifi anty te your seazaemve community Pease feel Mee tp contact me should you requite agcitions! information reqaiging this recommencaton, am pleased to recor otesso? and ani Nursing As Pawicie Watson Seaseme Atars Noted by Raymons Crane Tracy fhedman Deecter Graduate Schoct Prograt Head ember 4 2025"
    },
    {
        "image": "proginvitation2_synth_15_aug1.png",
        "label": "proginvitation",
        "ocr_text": "Kane Conelt Program Head cotege ot HES CENTRAL LUZOR STATE UP Dear Keyl, pte apat of seater in an Phases oF SCIEN sixetiig® ee operant excaaarce sam oinased to recornerasd SNS ans or acnsion to yor GaGa peogract teapeenation Tecnciogy A2 hes RISES! ne acrataric acer 2 ARENT years, ineee nae ge onserua nis acaderls PAO caret protossionil ceseTOn ee dant Santen Red SanwiSIENEY peeves excosiareal BNATEHES ee, asicaton we yeaa, and SEY agersnay qustaes. 7 srnergrasae men a7 RETA Crargy Sonus Re wiand Cane vecalved nigh caramaanwaion 12\" ‘pur gepartment faraaty, He BOS eioarsd a GPO BBS a BATE ran vn eae conforecas Ot ocamunaty censor peagTaND FA mrongant tna Kayin Sarars Wt D2 5 penasient geo 12 YUE OEE. sev wh corr goa 9 78 ies coe Pmeaso FRE vp enna ne SHORE you LEIS ation intormnten regarseo recosnmensaion. Respectfully Yours, pecapending aonzo7e F _ Aifigon Petereor tyler Landy sect 3% ed bY wees yc Hein fs Ae"
    },
    {
        "image": "proginvitation2_synth_15_aug2.png",
        "label": "proginvitation",
        "ocr_text": "wae of the Pape CENTRAL LUZON STATE UNE 2 Srvdeot Cee RESON nanemnmsi Hwennbat 08, 20ES Sania Progras Ered CENTRAL LUZON we STATE UNIVERSITY Dear Kay s. spots ape al acer pin in taster 22 9808 ceeeteas. exsonce! ‘ae pag to rxoomunend Hayle S79 veer aamession is your graduate £100\" ipaonengons Terai AE Be DORSAT peg neaciemic avast forthe DGT GSE years, Le tad she empress te ase fis acaueR aaNTEREMENSS wana profassiora! gaveroirnent Kas sanders has consent Gomonetatad excepienal anaes sts, sgccatan wa researc, ae SSSA ipadersnin qualities. HS peterpan Beasts on MRCS ng Sos Yor tend COmsneTIERS sgceivedt nigh comenerstston NO sor department faclly, Ho han MAINE wy a GRA af 3 88 ond actely Basic tea in acoxteneie COMTETERERS BT ceanynrity axsensian sveGean@. LET renagant bar keayta Bangor we OF anne gsHOO He EAE POTTED soe wt eomercate signals 1 OME SS omic coset Puss far sree TE ‘eonigel ne seated yOu TORE seratianat intormanon raged BF racine neato”, gecgpaendgns Approve OF: Allison Paterson Program Heed"
    },
    {
        "image": "proginvitation2_synth_15_aug3.png",
        "label": "proginvitation",
        "ocr_text": "Repabite of the Poa ine Suprense Saatent Coun REGION Y vemibar 96, 2025 12 Can Progren ad ‘ologe of Harsing CENTRAL LUZON STATE UNIVERSITY sar Kayla, Grewtings i299 epienaf arceiers see ate pleased to recommend Kayla Senders for admission fs your graduate progtam in Master of Soance in intonmabon Technology, As fis prafesssr and seademe aguser tor the past to observe his academic gertormance a demonstrated exceptional analytical 3 undergraduate thesis. on Renewas ou deparbmanttsceity. He comnts sing we e083, iTav 3 professionai devslopiment Kayla Sanders Nae consistently Ls, dadicatian 19 rezearcn, ano strong ieadership quale oufons ‘or tang Communities reosived high co ss mainigined a GPA of3 86 and actively nartcipalid in ace ces ang y extonsion programs. ant conficent gat Kayla Sanda val a af nfo your prograra a contabute signifcartiy your azagen nity Please toe) free to conlect ene shoutel you sowie sddiional information segarding thie recommendation had we opne Reegmending Appr Allizon Petersen Beestos Gree ain Senoat Aopreved b Carmen Olivia Mesce Cebege Bean Program Hea: 6 08, 2025"
    },
    {
        "image": "proginvitation2_synth_15_aug4.png",
        "label": "proginvitation",
        "ocr_text": "Republic of the Philippines CENTRAL LUZON STATE UNIVERSITY Supreme Student Council REGION V November 06, 2025 Kellie Cantrell Program Head College of Nursing CENTRAL LUZON STATE UNIVERSITY Dear Kayla, Greetings in the spirit of academic excellence! Lam pleased to recommend Kayla Sanders for admission to your graduate program in Master of Science in Information Technology. As his professor and academic adviser for the past four years, have had the opportunity to observe his academic performance and professional development. Kayla Sanders has consistently demonstrated exceptional analytical skills, dedication to research, and strong leadership qualities. His undergraduate thesis on Renewable Energy Solutions for Island Communities received high commendation from our department faculty. He has maintained a GPA of 3 86 and actively participated in academic conferences and ‘community extension programs. am confident that Kayla Sanders will be an excellent addition to your program and will contribute significantly to your academic community. Please feel free to contact me should you require additional information regarding this recommendation. Respectfully Yours, Recgnmendjng Approval by: Tyler Landry Allison Peterson ioe President fo Academic Atfars Director, Graduate School Noted by: Approved by: Carmen Scott Olivia Pierce College Dean Program Head November 06, 2025"
    },
    {
        "image": "proginvitation2_synth_15_aug5.png",
        "label": "proginvitation",
        "ocr_text": "Repobiic of rhe Pippines CENTRAL LU, STATE UNIVERSITY, Novemoor as, 2025, Kettie Gantrett Program Head Cateye of ENTRAL LUZON ST E UNIVERSITY esr Kayle, Sreotings the spit of acads excotenn aim pleased te recommane Kayla Sundars fo ‘etormation Technorogy. As his pra to observe his aced demonstra oergraduule thesis or Renew Energy Soitlions tor liana Communitise receives high o> ‘our dapartment fscully, He has maintained 3 GPA o! 3 86 and actively cartcipated in aad nteuinity extension yoograms. 1am contig ier wil be ae ond wit conitiouie significartiy to yaur aca tease Yea ee to additional information regarding thi re ote Should you raqisire lespectfully Yoore, Tyler Lanny oval ag App Atison Peterson Vice Prstint for Acadnvie Aas Bisctor, Graduate Sahoo Olivia Place Colieye Dear Progras Head Novemier 96 2025"
    },
    {
        "image": "proginvitation2_synth_16_aug1.png",
        "label": "proginvitation",
        "ocr_text": "‘Republic af the Pralippee™ CENTRAL LUZON STATE comnctl oxtaber 76, 2026 iosenh Maaney Progran Head cofege of Tasty (Want, LUZON STATE UNIVERSITY Geer Rabenca, nin genetagp tn aur entation! jaon to Rebsora Holme ato ss apptyng OP Master of Science evran nor Yor four ears ay ter sNeICION a research vpovmes nae emus rama GoSoRan ae wat nip Sioned Diagater Risk Regutkon PY0GTSS nos achieved GPA gt 89 009 ‘This fetter serene a8 miy stag PEON. Sraremg peugiam st your estaerned ieUAO NS cupanasee Prowghoul ner academic jouriey, RAM a sepniy, ara ara eoelance, 4B\" reaeatch eth on BOT Genonesrnes along aiaryticel ace ical HME abnlives, Rebecca Holmes raz peer recagrizbs ith mstinle academic 343° ‘one goesesses axpesient comeTeencATED siilia and OS creceenly both indapenctandy arc in tam Sane srenmaneay anaorse nat appiication an =stoce AE wit sesive in your gra srarn, Shout you nges futher inborabOn, pau os net esis #2 SORES Respectfully Yours, Lewer Taylor Noted by: Shaneen Collins Thomas Buckley Regiatrat Program Haed Setoper 26, 2026"
    },
    {
        "image": "proginvitation2_synth_16_aug2.png",
        "label": "proginvitation",
        "ocr_text": "Republic Paiippiney SENTRAL LUZON STATE UNIVERSITY Srpreme Sradeat Comet On vt October 26 2025 Joseph Mosney Progyvar Head ‘Sobage of Tectostay CENTRAL LUZON STATE Uni Gear Rebecca, \"Piss greetings team our mgthvtnnt tat Sones 98 my atong vecomnendtation for Rubeoca Nursing prog your esionined insti iohaut her acardes oumosty, ane academic excel Hotes wis ts applying for the Muster of Science in Fhave snow tse for four years as her inotructer and research jouney, Rebeora Holmes has exhibited remariabie 4edication, intel 8. Her research work an Community Based OM Hales akong anatytical ang cteal ininiing abilities, Rencoce Gur has Deon recognized with mutipie academic awines, and in Your Giadeate prograt mes has achieved a GPA 91 89 and She pocsesens excel im settings. whoisheadtost ould vou need! futiner infor communication ckits an works endorse Nerapntication and bet a ibn, please de poi Respectfully Yours, cypsending a Lauren Taylor by: Butler eved by: Shannon Coline Thomes Buckiay Program fend"
    },
    {
        "image": "proginvitation2_synth_16_aug3.png",
        "label": "proginvitation",
        "ocr_text": "Ren CENTRAL Lt Supe Cetoner 26 20 Josepn hiconey Sotege af Veatmotoay {STATE UNIVER Dear Rebecc: warm greating: wha is applying er instru ss0r. Thiowghout her a ouriey, Rebecca He ited remarcable decicaton inte! ig plogrars adlertie eX i Progeary A S3 89 and 9 8. wholeheartedly encorse ber application and beiteve she will ed fuithar Go not hesitate te contact me. has been 10 effectively both in seation sits a sentty anit your graduate piograr ler Christopher age Deen Approved by: Thomas Buckley Program Head"
    },
    {
        "image": "proginvitation2_synth_16_aug4.png",
        "label": "proginvitation",
        "ocr_text": "site of the Phiktepian CENIRAL LUZON STATE UNIVERSITY aprerae Student Comueit cet ewer 26, 2025 dosaph Meaney Dear Rebecca from our nathatan! visem gre commendation for Rabecca Holmes whe is applying for ihe Master of Science ia omad institution, [nave xrewn Net far four yeuss 2s her insbuctoy and research Imes nite exhibited remarkatie decication, inteiecvant This lols serves as my stro Norging pragrent al your supervisor. Throughout her academic journey, sty, end acade swans, She possesses sxcsitsnt communication sx fedly endorse he 7 epotisalion ara! Peliave ste Reeqauending Approval by topher Butler Lauren Taylor Papas Gia Longe Bese Noted by Shannon Cot Regisitar Setober 26, 2078"
    },
    {
        "image": "proginvitation2_synth_16_aug5.png",
        "label": "proginvitation",
        "ocr_text": "Republic of tie Philipines CENTRAL LUZON STATE UNIVERSITY Suprraie Student Cores REGION vi October 26, 2025 soseph Mecney Program Hee Soboge of Tacrnniagy TRAL LUZON STATE UNIVERSITY Doar Rebecse, ‘warm greetings from ur watson! This Inter serve 23 my strong recommendation Sor Raper sing DlOgTam a! you eviaecnad insituion, Hhave known her for Kiur years 4s het ioxtnac supervisor Taraughou' her academic journey, Rabecce Holmes has edubites remarkable dedicason, intellective! cunosity, alid academic excstience Her research wark on Community Based Disaster Risk Reducton Programs: demonuitates shong snaiytca! and citical thihing abitties, Rebecca Holmes has acoved GPA of 3 69 ana has hoan froagniand eth mailipie acadendr awards: She passassus excahen communication skits and eOrks bilecively noth intepencenty and in team stings. (wholeheartedly endome her anplonton and tetova she wit iheive in your graduate peagesm, Shoult vou need further formation, please de not hesiinls t contact me Recgmmenging Approval by Laurer Taylor Christepher Butler Oesscmast ohne Sein Caan Noted by: Shaner Col Reger Odiohes 28, 2025"
    },
    {
        "image": "proginvitation2_synth_17_aug1.png",
        "label": "proginvitation",
        "ocr_text": "Republic of the Philippines WESTERN MINDANAO STATE UNIVERSITY ‘Supreme Student Council REGION Ill October 31, 2025 Benjamin White Program Head College of Technology WESTERN MINDANAO STATE UNIVERSITY Dear Pamela, Greetings and best wishes! This letter serves as my strong recommendation for Pamela Adams who is applying for the Master of Science in Agriculture program at your esteemed institution. have known him for two years as his instructor and research supervisor. Throughout his academic journey, Pamela Adams has exhibited remarkable dedication, intellectual curiosity, and academic excellence. His research work on Environmental Conservation and Biodiversity Protection demonstrates strong analytical and critical thinking abilities. Pamela Adams has achieved a GPA of 3 87 and has been recognized with multiple academic awards. He possesses excellent communication skills and works effectively both independently and in team settings. wholeheartedly endorse his application and believe he will thrive in your graduate program. Should you need further information, please do not hesitate to contact me. Respectfully Yours, Recqumending Approval by: Christopher Hunter Jacob Rosales Diectr, Geaduate Schoo! Director, Graduate Schoo! Noted by: Approved by: lan Shaw Jennifer Taylor Finien iemeed Program Head October 31, 2025"
    },
    {
        "image": "proginvitation2_synth_17_aug2.png",
        "label": "proginvitation",
        "ocr_text": "Republic of the Philippines WESTERN MINDANAO STATE UNIVERSITY Supreme Student Council REGION til October 31, 2025 Benjamin White Program Head College of Technology WESTERN MINDANAO STATE UNIVERSITY Dear Pamela, Greetings and best wishes! This letter serves as my strong recommendation for Pamela Adams who is applying for the Master of Science in Agriculture program at your esteemed institution. have known him for two years as his instructor and research ‘supervisor. Throughout his academic journey, Pamela Adams has exhibited remarkable dedication, intellectual curiosity, and academic excellence. His research work on Environmental Conservation and Biodiversity Protection demonstrates strong analytical and critical thinking abilities. Pamela Adams has achieved a GPA of 3 87 and has been recognized with multiple academic awards. He possesses excellent communication skills and works effectively both independently and in team settings. wholeheartedly endorse his application and believe he will thrive in your graduate program. Should you need further information, please do not hesitate to contact me. Respectfully Yours, Recgnmendjng Approval by: Christopher Hunter Jacob Rosales Director, Graduate Schoo! Director, Graduate Schoo! Noted by: Approved by: lan Shaw Jennifer Taylor No Pres tr este Program Head October 31, 2025"
    },
    {
        "image": "proginvitation2_synth_17_aug3.png",
        "label": "proginvitation",
        "ocr_text": "Republic of the Philippines WESTERN MINDANAO STATE UNIVERSITY Supreme Student Council REGION Il October 31, 2025 Benjamin White Program Head College of Technology WESTERN MINDANAO STATE UNIVERSITY Dear Pamela, Greetings and best wishes! ‘This letter serves as my strong recommendation for Pamela Adams who is applying for the Master of Science in Agriculture program at your esteemed institution. have known him for two years as his instructor and research supervisor. Throughout his academic journey, Pamela Adams has exhibited remarkable dedication, intellectual curiosity, and academic excellence. His research work on Environmental Conservation and Biodiversity Protection demonstrates strong analytical and critical thinking abilities. Pamela Adams has achieved a GPA of 3 87 and has been recognized with multiple academic awards. He possesses excellent communication skills and works effectively both independently and in team settings. wholeheartedly endorse his application and believe he will thrive in your graduate program. Should you need further information, please do not hesitate to contact me. Respectfully Yours, Recgnmendjng Approval by: Christopher Hunter Jacob Rosales Diestr, Graduate Schoo! Director, Graduate Schoo! Noted by: Approved b: lan Shaw Jennifer Taylor Nee Paseggy le essence Program Head October 31, 2025"
    },
    {
        "image": "proginvitation2_synth_17_aug4.png",
        "label": "proginvitation",
        "ocr_text": "Respectfully Yours, ‘Clsistepher Hunter Dee Gente Schad Noted by: tan Shes oe Pts hes, Cdtobor 31, 2025 Sheer, Crotaate Senoee Appreved by; Serniter Yoyo, Progra Heed"
    },
    {
        "image": "proginvitation2_synth_17_aug5.png",
        "label": "proginvitation",
        "ocr_text": "Eapabite of the Paitigpines ESTERN MNGRAO STATE UniveRany Suprems Stadees Comacil REGION eaten nen A eer cern ter ate Senber si, 2025 Bensamin write Program Heed Sotrue oi rernatayy WESTERN MINDANAO STATE UNIVERSITY ‘Gratings and bact wishes! ‘This teter serves ae m Agricitture program at Supatvissr. Thesedsoss Satiosty, ane anscien Protection deme 387 and hae tee: works aftectivel Pew tue in yo Svan Tetoramensation fo: Pamela Adams who ig appiying Fak Eeleemed ination, neve grown bun for bon ¥e instuctor sn research UPS acaitenic joumey, Pamata Asam nas cation wattle dedication, intatiscivat ee arbi. His rasarch work on Envoniectag Conservation ane Biodiversity Hes ong anatytial aint cnc Ming abies Pamela Actems nas achioved a GPA cf eu zed wih mathe scadursic wararde. He poessesee excettent communica! ‘oi iedependentiy snd inseam stings 1 Stelcnuarindty ancerse his azotcation and be MT OTadLtS Drom, Shout you nose further information Please sie» eres eve t hesitate contact me Respectfaliy Yous Recqesendiny Approval by: Chvistoptier Hunter Jaca Rosales ted by: fan Stay Wee Prcsidacs for eadocsis Progres Bead tober 34, 2085"
    },
    {
        "image": "proginvitation2_synth_18_aug1.png",
        "label": "proginvitation",
        "ocr_text": "Republic of the Philippines WESTERN SHIDMAD STATE UNIVERSITY Supresne Student Council REGION Octopar 22, 2025 ‘wathow Jones Progras Kea Colee cf Business Henin aten: WESTERN MINDANAO STATE UNIVERSITY Dens Elizebeth, Groutings ut Peace! 11am waiting provide my highest zecommendation for Skzabeln Porrys aupitcation to tne Master of Science Engineering program. Having served as hts professor snd thests adviser for wo years, ican atest to his Suitending acadwinsc cepabitiies ond reseaich polenta. Elizabeth Perry completed ins urntergracuate 2hesis On Digitat Leaming Platierms and Suucent Enpagament with distnction, demonstrating exceptions! research shuts ‘and scholarty aobizoo. His academic record inchutes 2 GPA of 3 83 and consistent Sean s List recognition, Beyond academics, ne his shown stong leadership 2s prusidunt of he stidant cota! and volunteer coordinator ‘ur community ouveach programs. Thass expensnices nave davelopea his interpersonal sails and comment iy ‘warwick. arn conten that Bzatvetn Perry wil excel in your pragram and become 3 vahuotie mairber of your academic community, Proase contact me fyou require acionel datas Respectfully Yours, Recqmuending Approval by: Stwiey Mason Michoet Russall gee Droste’. Graduate Sere! Noted by: Approved by: Debra Hemandez Shawn Simmons Cotege Dean Progran Head October 22, 2025"
    },
    {
        "image": "proginvitation2_synth_18_aug2.png",
        "label": "proginvitation",
        "ocr_text": "Repuittic of te Ratippincs WESTERN SaREDANAG STATE UNIVERSITY Stateme Staden! Coancit REGOH Mathew Jones Frogren Brad Cotege of Susinens Adurtraion WESTERT MINDANRSS STATE UNIVERSITY tam wing fo provide my higheat recoimnmngstein for Elizabeth Parry s application ip the Masier of Sokance in ‘Engineering program: Having served as ois pets esor and thesis aaviker for wo yeaes, 12am efestiy his ‘outstanding acaderntc copahitiies and ronvarch patantal, Eleutet Henry comaicies his undergraduate thesis an Ragin Leeming Praiiors and Siusent Bngay with distinston, demonutating nxcestonal raseacch oxi Ane scholady spittune. His acadente record insides a GPA of 3 $3 ant consisinnt Thesn s List recognition Gayord acadenics, he has shown strong iaaderanip ag grenidant of te slusent cme an cotunteer Sonrdinasoe fog commenainaty ontvmarh programs, These sxpatiencas have developad ths inersarconal skile and commuter’ ty serving. |amn comident iat Elizabeth Pany will exow! in your progam and bacnne a valuable mamber oF yout aoauenic community. ease contact me you require addtional abate Recqgasenging Approval by: Micheal Russel Bimeter, Grae seta seh agit Koted by: yoved by: Debra Homnader og tse Program Head Oninter 22, 2025"
    },
    {
        "image": "proginvitation2_synth_18_aug3.png",
        "label": "proginvitation",
        "ocr_text": "Mathew Jones Program Head Gases of Buoiaas Aamniabaten WESTERN MINDANAD STAT E UNIVERSHCY Efizateih Gr tings of Pescet jon to the Master of Siar aineETing DOG culstanding acader Digital Learning Peattom d schetarly aphids Boyored acadenaes, ne has shown sirang for communi outreach programs. Thest ex int hat Etizabelh Parry will excel in nity, Please conact mie Hf you require adsitional detats. conieled nis undergraduate thasts on couptional reswacth ekils pean List recog capabiities ang research potential. Elizabeth 1g Stacient Engagement with distinction, cemar sound includes 2 GPA of 2 83 and oonsisier adershin as presicentof the eloped nis interpersonal slulls and commitnrent jaram and become a valuable member of yas Approval Respectfully Yours, Shelley Mason Michac! Russet! om oreved by Noted by Sabre Hemanden Shawn Sirareons Cotes Deer Program Head oowber 22, 2025"
    },
    {
        "image": "proginvitation2_synth_18_aug4.png",
        "label": "proginvitation",
        "ocr_text": "EIA STAT October 22, Matthew Jones: one of Suainess Agminiewaton WE! NDANAQ STATE MI ve STERN Mi Dear Elizabeth, Peace! Greetings tain waling to provide my hignest rec Engineenng program Hast appl for twa Y outstenting acacemic capabl Tupital Leaening Plation hotarly jes a GPA GT 3 83 strecognttion Beyond strong leader s pregident of the skident council and volunteer coordinator for conuonnity gute: dcommimentts is. These experisncas nave developed his interns sev berome a valuable meri bath Peery wit exoai in your orsgram y your adstiona! detaite academi contasi me ifyou requir Michael Rus: Rests Hemandex Shawn Simmons"
    },
    {
        "image": "proginvitation2_synth_18_aug5.png",
        "label": "proginvitation",
        "ocr_text": "public of the Phipps WESTERH MINDANAO STATE WnewERSITY Supreme Stadest Comacat Oeinber 22, 2025 Matthew Jones Program Read Cotene of Busines arava aman BOMAO STATE UNIVER! Dear Elizabeth, Greetings of Roacet jam wrong ts provide Enginzaning pioges ny highest recommensabon for Hlixabem Perry s application 9 ine Master of Sci: *, Haring setvse as hix professor is advicer far two years, ican attestia his ‘eery com ‘a! Learning Piatlorms and Student Engagement wit distincton, demonstrating exceptions! reso: ni scholarly aptiuae, Mis aeagomie ca 128 8 GPA. Gt 3 83 ang consistent Dear Beyond academies, ne nas shown aueny teauarship as prosicent of tie stu! ‘or community cukeoch progeems These experiences nave davelaned his Bervice, jam contisent that Eizabets Berry wih exci i academic community Please con ouistinding acaiiemic capabilites and resewteh rover 0% noepersonal sits ang commitment ws 1¢ become 2 vatuaile member of your ronal aetavs, ma it you requite au! 2 Appro’ Shatiay Mason Michest Rossel Sagar eee, Sresuate So et by Aperoved by Debra Hacnandes howe Siem Sotege Geom Proeran Head"
    },
    {
        "image": "proginvitation2_synth_19_aug1.png",
        "label": "proginvitation",
        "ocr_text": "Republic of she Platppines LUNVERSITY OF NORTHERM PHALIPPINES ‘Suprene Sede Cow PEGION Vii Oxtoves 23 2025 ‘Spence Terry Program Hood Cotoge of Arts and Semnces UNIVERSITY OF NORTHERN PHILIPPINES toforraton repanting this recommondabon Respectfully Yours, Recqmmendjng Arproval by: Rover Matin Devin Mendora anaes Vice Prescentior Aca Aare Noted by? Approved by Evie Ayala Varosse Cox Director, Geamuate Senet Progran Heed Oetoder 25, 2025"
    },
    {
        "image": "proginvitation2_synth_19_aug2.png",
        "label": "proginvitation",
        "ocr_text": "ues TY OF Nowy FERN PH sppigsees i perfor ‘DtONE! analvtcay g tnvirenenes acu is aca, ang 8 FOr Ihe past 8 preteasionat gf love CVS gh co WEY Pathoipited in acaciois wohris0n will be an axa community Pie, Beanimeny progeanis content sig \"3 83 comimuniyy mlearty ta vey ifn roganeting Te shouts you requir ditonay Airy Vanessa Cox"
    },
    {
        "image": "proginvitation2_synth_19_aug3.png",
        "label": "proginvitation",
        "ocr_text": "Republe of the Philippine ERGY OF NORTHERN Pt rave Seudeut Comet ‘Ouiober 23, 2025 Spencer Terry Program Reed Gotege al Arta und Selonees UNMWERSITY OF NORTHERN PHILIPPINES Bear Colles acre goings fram x atti! 1 Master of Sciences in 9 dance for acs eeviner for the pas nent Cal ioe fo your graduate grogea) sit yeass, {Rave had the opportunity fo ab oC fam pleased to rac Agriuitue, As his professor end acad! ss AeaUO! formance and professionai deve! n Jolson nas consi exceptional anaiyicat sills, dedication to resnaich, and strong ieadersiun qualities. 1 Environmantal Conservation and Siodiversity lection received high commnendabon fori eet vepariment faculty. 4e hoy maintained 2 GPA, of 3 68 and gclively participated in avadenuc confarenices and community oelgncion pregrams, Lam conisient fat Colleen Joivsan wil Be an aiaition to your program i contr ng aver Robert Marin Recgamend; Respectful Pvesiaont for Academis Atars Song Des di by: Appreved by Eric Aysie Vanessa Cox"
    },
    {
        "image": "proginvitation2_synth_19_aug4.png",
        "label": "proginvitation",
        "ocr_text": "aegublie ofthe Pulp ny OF HORTHERN PHILIPPINES univer ‘Sopenne Saadent Cort spencer Tery Progran Head coreg ol Aete next SORTA UNIVERSITY OF NORTHERN PHE 1p Colleen, yor ur ation wan greets in Master oF fine opportunity w oes ‘on has consistardy domonsuralee raadlersp @! is undergraduate mosis of me carnmendation trom ove Gearment cag and COMMA ign ts your gracuate Brod for ass ct ous yeas, Have dyiat for tho Ba ont. Collet OH commmmend Co ned acadterti 2 Agi is acavemic oertat excoptonal anaiyical ‘and sung eluon rececied Hie! iis, genioaion resears Enviconmel servasan and Biodiversity Pe nt, He nes misinsined 2 FAO 58 SE spovely partcipated in academic comeren saension programs. fam concent tak SOUT sateen wit be ai exarient acllon 69 $205 2° sais ari il re jomc enmmurity. Proaee ae! fae Homma SS coud you require aaationat cousinute significantly t0 your aCe jnfuration regarding 84 gation ecegesenggag Anproral DY! Robert Martin sfce resiient tie Anadis AHSES ee Vanessa 20% ogsan Head"
    },
    {
        "image": "proginvitation2_synth_19_aug5.png",
        "label": "proginvitation",
        "ocr_text": "Republic ofthe Philippines UNIVERSITY OF NORTHERN PHILIPPINES Supreme Student Council REGION VI! October 23, 2025 ‘Spencer Terry Program Head College of Arts and Sciences UNIVERSITY OF NORTHERN PHILIPPINES Dear Colleen, ‘Warm greetings from our institution! 1am pleased to recommend Colleen Johnson for admission to your graduate program in Master of Science in ‘Agriculture. As his professor and academic adviser for the past four years, have had the opportunity to observe his academic performance and professional development. Colleen Johnson has consistently demonstrated ‘exceptional analytical skills, dedication to research, and strong leadership qualities. His undergraduate thesis on Environmental Conservation and Biodiversity Protection received high commendation from our department faculty, He has maintained a GPA of 3 58 and actively participated in academic conferences and community extension programs. |am confident that Colleen Johnson will be an excellent addition to your program and will contribute significantly to your academic community. Please fee! free to contact me should you require additional information regarding this recommendation. Respectfully Yours, Recqamendjng Approval by: Devin Mendoza ei Vice President for Academic Affairs Cotege Dean Noted by: Approved by: Eric Ayala Vanessa Cox Director, Graduate Schoo! Program Head October 23, 2025"
    },
    {
        "image": "proginvitation2_synth_20_aug1.png",
        "label": "proginvitation",
        "ocr_text": "Republic of the Philippines CENTRAL LUZON STATE UNIVERSITY Supreme Student Council REGION V November 03, 2025 Jennifer lbarra Progran Hea: College of Agricuture CENTRAL LUZON STATE UNIVERSITY Dear Jennifer, Peace and good wishes! am whiting to provide my highest recommendatior n for Jennifer Richard s application to the Master of Science in Engineering program. Having served as his Professor and thesis adviser for two years. |can attest to his ly Yours, Recqnmending Approval bs Corey Baker Michele Weeks Drector, Graduate Senoo! Evan Nunez Robert Riley gram Head Registrar November 03, 2025"
    },
    {
        "image": "proginvitation2_synth_20_aug2.png",
        "label": "proginvitation",
        "ocr_text": "Republic of the Phuppines CENTRAL LUZON STATE UNIVERSITY Supreme Student Council REGION November 03, 2025 Jennifer tbarra Program Head College of Agricuture CENTRAL LUZON STATE UNIVERSITY Dear Jennifer, Peace and good wishes! ||am writing to provide my highest recommendation for Jennifer Richard s application to the Master of Science in Engineering program, Having served as his professor and thesis adviser for two years, can atest to his outstanding academic capabilities and research potential. Jennifer Richard completed his undergraduate thesis on Healthcare Accessibility In Remote Areas with distinction, demonstrating exceptional research skills and scholarly aptitude, His academic record includes a GPA of 3 7 and consistent Dean s List recognition. Beyond academics, he has shown strong leadership as president of the student council and volunteer coordinator for ‘community outreach programs. These experiences have developed his interpersonal skills and commitment to service, am confident that Jennifer Richard will excel in your program and become a valuable member of your academic community, Please contact me if you require additional details Respectfully Yours, Recqnmending Approval by Corey Baker Michele Weeks Dewste, Grasuate Senco Deector. Graduate Senoa! Noted b: proved by Evan Nunez Robert Riley Registrar ‘ogram Head November 03, 2025"
    },
    {
        "image": "proginvitation2_synth_20_aug3.png",
        "label": "proginvitation",
        "ocr_text": "RAL Luz Supmerae Seadeut Council REGION Y nowgeninse 02, 20° Jennifer tee Program Head Cotage of Acpreutare CENTRAL LUZON STAI 8 UNIVE! Dear Je Prane and good withes! A cpifer Richard s application to the taster of 2ene vas his prateusor and mesis advises 15 60 YOATE, os frost to is suntanding acadiemis capabaities and rese3e0 ‘pobeniiat, donner Richard completed fis unearqraduste thesis on Healtncare Accessihity “wah distinchon, demaretzaing exceptional es sch we is acagericrecocd Wactudes a GPA CTT ar 69% sslont Deen s Listracogniton, Beyend seanemics, he has shown song ieadershiD ss president of re shen counsit ens wouunlae ‘sociinator ft sch programs These expenecces nave ceveloped Ft terpansanal alls and cOmmnitTENE S rnvigeni that sores Pichard wilt exces 1 yOu! rogeam and becoma 3 vatuabie member of YOU\" 52 contact me Hyou require adcitona ain wilting to provide ry RBH Engineering orogens. Raving sans 8 ‘oval qpoending Ane Michele Weeks tien ser, Grataate Stb0C1 Approve! Evan Nunez Robert Riley rogram Head Regatar 3 20 November <"
    },
    {
        "image": "proginvitation2_synth_20_aug4.png",
        "label": "proginvitation",
        "ocr_text": "CENTRAL LUZON STATE U pune Sree ONY 3, 2928 Novemibe Senniter Ears Program Head calage a ngieaAe CENTRAL LA ZO STATE UNIVERSE Sear Jennifer, ster ot Seine 18 Peace and good wishes! Jennifer Rucsaie s appiiatinn fone M teeta advise for vennifor chars conpreies maqnatrating excentonal naisten Dace s Listrecoanit nd woonbeer cocidinlat Of ‘years, bean atiast is hus umtergeacuate Hass ote skits an Jn Bayon sacomennrdation 10° sfessar an sagen powental. di gigtinction, d2F highest isesiny program: qitatanaling acacenr ‘oir eaitnnare ACOs! capaiities ane Remote Areas tesa arAaras aed ity menotarty aptitude. His academic 808 Seaderis, he has down song eases snip a presitentot ine student OOune community outreach OTT ove davatones ms intorporsore: Al ‘snd corerieenene service. 1am conidens fiat sc oxegram ane become a vain member of you acarterec commen. PIES ‘you raguirs acidizorat deta Approval OY gespectiuily Yours: Recqumendit Michate Weeks Carey Baker oer, Braun SUT pppeoved an Mane? sopen Rite eyaten Frogram Head sowesninas £3 202"
    },
    {
        "image": "proginvitation2_synth_20_aug5.png",
        "label": "proginvitation",
        "ocr_text": "OM STATE UNIVERS! No: CENTRAL LUZON STATE L ry tear Jennifer Peace and goad w ts atiestto nis undergraduate thes: er of Selene sh amr writing to previce my Ai Engineering rogram, ing exceptional research skis and be jent counveal and vol nd consists List recognition, Baya Respectfali y Recqnm Ging Approval Miche Corey Baxer le Waeks Appr:"
    }
]