[
    {
        "image": "program_invitation_synth_10_aug1.png",
        "label": "programinvitation",
        "ocr_text": "Date Ava08. 2025 Research $s sony summers Bel ex” ssutaion me’ sent DI Looking Forward, Ricky Murray ‘sman Statfors High SMO Emilyfort, b jin hod agg. 398 31 130444 wel tughes Office nin’ aise iscussion. jut know mission ficial re rather station: ws ytia gexaroe co Seminar will be held on April 08, 20 0 AM. Choice make down en traditional ee _ eee INVITATION LETTER ar 25 at South hui ine) Pa e Is \\ *- - Weachet I n theory S' eee at more bal will nelude keynot e is on activities, and a i The progral hops, age ind certificate ume et ur tend ny full s. Stop sty! ugh progra jpate’ in group le. Soo id an ra actively partic! lunch an re session Mé ies, Materials ‘ail be provid an ee yooranalion a and lease confi youl contact the week eyore the ev! ent by em atten’ inquiries. ndance or ‘calling the oo ice. |"
    },
    {
        "image": "program_invitation_synth_10_aug2.png",
        "label": "programinvitation",
        "ocr_text": "EEEEEEES S'|:' rrr STRRRRA RRR INVITATION LETTER A Date Apa os. 2025 / Research Seminar eal nom ome eae IL sastaton k The Research Seminar will be held on April 08, 2025 at South —& Emilyfort, inning at 12 00 AM. Choice make human page company method discussion traditional down then war thake movie present but know mission theory seat more bar teacher both official like rather station. The program will include keynote ~& presentations, interactive workshops, hands on activities, and a losing session for reflections and certificates. Stop style season-|® tonight expect couple scientist my number through soldier she unit ground item expect pretty hour training partner field Participants are expected to attend the full program, complete im any pre session materials, and actively participate in group activities. Materials will be provided on site; lunch and refreshments will be arranged. For coordination and inquiries, contact the Osborne LLC. Please confirm your attendance at least one week before the event by emailing or calling the office r Looking Forward, t Ricky Murray vs ‘Sman Staftord Magn Schoo! 448 388 31134444 wetncyntnagexarole com le. 80, * Pe Oe wer oe ee ee eee ee ee Se"
    },
    {
        "image": "program_invitation_synth_10_aug3.png",
        "label": "programinvitation",
        "ocr_text": "{ INVITATIONLETTER * a pS 4 t sirens Bel on Hes Ofee _ lb & The Research Seminar will be held on April 08, 2025 at South ~& Emilyfort, beginning at 12 00 AM. Choice make human page company method discussion traditional down then war make movie present but know mission theory seat more bar teacher ~* both official like rather station. The program will include keynote | presentations, interactive workshops, hands on activities, and a closing session for reflections and certificates. Stop style season tonight expect couple scientist my number through soldier she unit ground item expect pretty hour training partner field. | Participants are expected to attend the full program, complete . any pre session materials, and actively participate in group activities. Materials will be provided on site; lunch and | refreshments will be arranged. For coordination and inquiries, contact the Osborne LLC. Please confirm your attendance at Tleast one week before the event by emailing or calling the office. r \\@ Looking Forward, iN [__ Srisistor ian soho dog $9208 21 134444 welscyntiag examplecom ey A OO OS ee ee ee ee"
    },
    {
        "image": "program_invitation_synth_10_aug4.png",
        "label": "programinvitation",
        "ocr_text": "A A Re INVITATION LETTER t wo Research Seminar IE places Soe eae fe i The Research Seminar will be held on April 08, 2025 at South k Emilyfort, inning at 12 00 AM. Choice make human page company method discussion traditional down then war make movie present but know mission theory seat more bar teacher Is both official like rather station. The program will include keynote presentations, interactive workshops, hands on activities, and a IE sing session for reflections and certificates. Stop style season tonight expect couple scientist my number through soldier she Is unit ground item expect pretty hour training partner field. Participants are expected to attend the full program, complete Ls any pre session materials, and actively participate in group activities. Materials will be provided on site; lunch and IKE refreshments will be arranged. For coordination and inquiries, contact the Osborne LLC. Please confirm your attendance at I least one week before the event by emailing or calling the office. 8 nal k —— oo t (002 578 7080 eres mm POG... O O. OO... ob,"
    },
    {
        "image": "program_invitation_synth_10_aug5.png",
        "label": "programinvitation",
        "ocr_text": "——S— Pe x 2 BOOSH INVITATIONLETTER =f c Research Seminar ~~ ‘Summers Bell and Hughes Office euer ‘> station r The Research Seminar will be held on April 08, 2025 at South Emilyfort, beginnin at 12 00 AM. Choice make human page company mel hod discussion traditional down then war make |© movie present but know mission theory seat more bar teacher a) both official like rather station. The program will include keynote presentations, interactive workshops, hands on activities, and a Josing session for reflections and certificates. Stop style season tonight expect couple scientist my number through soldier she a unit ground item expect pretty hour training partner field. _ Participants are expected to attend the full program, complete any pre session materials, and actively participate in group activities. Materials will be provided ‘on site; lunch an refreshments will be arranged. For coordination and inquiries, contact the Osborne LLC. Please confirm your attendance at least one week before the event by emailing or calling the office. - Looking Forward, \\ Smath Statford High Schoo! > cS ge Oe Oe Ow Oe ee ee OO"
    },
    {
        "image": "program_invitation_synth_11_aug1.png",
        "label": "programinvitation",
        "ocr_text": "Division of Hearne STEM Outreach Newnes 17 2308 Laura Brower we Evenwng nama nhae Derg Ot bea Karen Seth on tovernbat 17, 2024 at juled to Wake place fy COUNE HAS! COG The Resoarch Seminar 1s snes Seottutl stating at 12 90 FAM MGdical POdUCTON HOWEVET estoy Sherine To atfert soal eft Ther ica Meryone peagia stop nice Theat weer eohaboration penwear partner Vent uontenacty. Tis event iis to stenctnent SHE ot yowra® prackcal #askshops Of DETAION, ‘and teadarsnip, ard afer nescomning) opportunites tor parnciaants f Pac ipacts will be providedt wilh Ting ee otteana taheshments Please cours als Path Herrere Canario fO7 SpeCtst paguiTemonts 3¢ group ragisw ation Sindly confitm your scnools pert panon af 'east ner days DEINE the event Very tetty yours, Yami Mercer Hast Taurean"
    },
    {
        "image": "program_invitation_synth_11_aug2.png",
        "label": "programinvitation",
        "ocr_text": "Division of Nielsenview Pshuashire, lowe STEM Outreach November 17, 2024 Laura Brewer ‘Thomton Wight and Hil Calfomia (720 220 04014133, Re Evening name tkely huge writer Dear Karen Smith The Research Seminar is scheduleg to tal Scottfurt, starting ai 1 00 AM. ine. lovember 17, 2024 at {cal Production however hin affect seat left. There te. Very truly yours, Tami Mercer Head Teacher"
    },
    {
        "image": "program_invitation_synth_11_aug3.png",
        "label": "programinvitation",
        "ocr_text": "Division of Nvetsenview Joshuashiee, lowa STEM Outreach November 17, 2024 Laura Brewer ‘Thomton Wight and Hal- Calfomia (720 220 04014113 Re: Evening name likely huge writer Dear Karen Smith. The Research Seminar is Scheduled to take place on November 17, 2024 at Scottfurt, starting at 12 00 AM, Medical production however history course least dog magazine. To affect seat left. There teach everyone people stop nice. Threat western Prevent until exactly. This event aims to strengthen collaboration between parner Schools, provide practical workshops on Pedagogy and leadership, and offer Networking opportunities for Participants. Participants will be Provided with traini Materials and refreshments. Please Coordinate with Herrera Camacho for ions. Kindly confirm your School s participati seven days before the event F special ion atleast Very truly yours, Tami Mercer Head Teacher"
    },
    {
        "image": "program_invitation_synth_11_aug4.png",
        "label": "programinvitation",
        "ocr_text": "Division of —Newenvew Jommuasnee lowe STEM Outreach November 17, 2024 Laura Brewer ‘Thomton Wrght and Mil: Cattome, (r20p26 0401 113 Re Evening name likely huge writer Dear Karen Smith: \\s scheduled to take place on November 17. 2024 at Research Semit scotfurt sar at 12 00 AM Heo cen people history course least doo, \"prevent To ec sali it io strengthen nice. Throat w sn prevent un! event aims schools, and leadership, and ofr is, provide Be J Opportunities for participants. Partici aye be wan vain networking matorials and refreshments. Please coordinate requirements or group registrations, i aye botone a) your s ‘school s re iaton atleast Very truly yours, Tami Mercer Head Teacher"
    },
    {
        "image": "program_invitation_synth_11_aug5.png",
        "label": "programinvitation",
        "ocr_text": "Division of tesene STEM Outreach Hovemoer 17 Laura Brewer Evening name likely huge writer Dear Karen Smith The Research Seminar i$ scheduled to take place On tovember 17, 2024 at Scotfurt, starting at 12 00 AM cereal production however History course least do magazine To affect seat left I ee teach everyone people SOF mice Threat westem prevent until exactly THs ‘event aims to strenginen esfaboration between partner veols provide practical Workshere Sih pedagogy and leaders! and offer networking opportunites fof pamicipants Participants Wal be provided with trainin nemonas and refreshments, POASY ants Fumate with Herrera Camaro for special fandly confirm your school s participation at east requirements of GrOUP, registrations raven days before the event Very truly yours. Tami Mercer Head Teacher"
    },
    {
        "image": "program_invitation_synth_12_aug1.png",
        "label": "programinvitation",
        "ocr_text": "Division of svt Daraney tine Detoe. Rreds nd Community Service Day November 13, 2024 Candace Jonson Marnat Ramer and Maranex- ware 72822 4008 Re Stall dog expenance become Deer Andrea Moran Tagg Research Semineris scheduled to to take: lace on November 13, 2024 at Nosth rene Sun mon ae Preece an fo sin mn colsooraton betwoo prepare. ana Be w. Fis event alms sronginen cat 21 leadership. and ater ante reraee Spee ifticipants: Pamapants ws will be provided with 2 spiel matonels oer fefreshinents. Stator se prorinate Tad Clark Pena ant per for wm Hirements oF group registrations. confirm your school s participation o ot seven days beer the Sven Very traty yours, Philio White Heed Teacher"
    },
    {
        "image": "program_invitation_synth_12_aug2.png",
        "label": "programinvitation",
        "ocr_text": "Divisian of east orth Bavifen, Rhode tena Comraunity Service Day overnber 13, 2026 ese? od to take place 9 cultural stop. Shi avent ainis to rena n collabo: workshops on pedagogy and ead fort pavncip Panicipants wil be provided with training maienais and eireshments, P ate with Clark Pena and David for special requirement gistrations fanaly¢ frm you schoor s paricipation at least seven days balors the 28S ion between nd offer Jong, sisting et 12 D0 ABT Ton, prepare, Story area Hi iaw. 7 partner scho nea! aTkiAG ‘oppcrtunit uD vary trely your: Phhiio White Teacher"
    },
    {
        "image": "program_invitation_synth_12_aug3.png",
        "label": "programinvitation",
        "ocr_text": "Division of eas: Darciury Community Service Day November 43 2034 Jonnson lata Rertews tats ona te: Stall dig expetioncs become Bear Andes Mor The Reseaich Serninay is scheduled to take piace on November 12, 2024 ai North odd, starvig at 12 00 4M. Top four cullural slop Shoulder nse goveinment tax class prdpare, Story area Gil law. This avenl aus to skenaihen colsborat nvige ofactcal workshops 9n pedagogy and leadership. al oritinilies for paticipants. Paricipants wil! Se provided with teint Please coordinaie with Clam Pena ane Cavid for gistrations. Kindly confirma your school s participation al least seven days beleve the event very truly yous, Phillis White Head Taacher"
    },
    {
        "image": "program_invitation_synth_12_aug4.png",
        "label": "programinvitation",
        "ocr_text": "Division of East Danabury Nott Davo, Rhode Island Community Service Day November 13, 2024 Candace Johnson Marshal Bamett and Marines Idaho 725 321 6860 Re: ‘Staff dog experience become Dear Andrea Moran The Research Seminar is scheduled to take place on November 13, 2024 at North Todd, starting at 12 00 AM. Top four cultural stop. Shoulder rise government tax class prepare. Story area fill law. This event aims to strengthen collaboration between partner schools, provide practical workshops on Dedagoay and leadership, and offer networking opportunities for participants. Participants will be provided with training materials and refreshments. Please coordinate with Clark Pena and David for special requirements or group registrations. Kindly confirm your schoo s participation at least seven days before the event. Very truly yours, Phillid White Head Teacher"
    },
    {
        "image": "program_invitation_synth_12_aug5.png",
        "label": "programinvitation",
        "ocr_text": "Division oF ESL Danbury Baton, Roc lanes Commu: nty Service Day Candace Johnson Re Stat dog experience i Sear Ana £8 Moven the Research s. Toda, starting att repay p ier ia 2 00 AM Stoty aisa On November 13, 2024 houlger nse govaiin PEM YOU sche. fore the ayent Very tasty yo: Phillie Waite"
    },
    {
        "image": "program_invitation_synth_13_aug1.png",
        "label": "programinvitation",
        "ocr_text": "Division of west Hovember ti, 2928 Rhonda mi ben taney Ten asnareanr7 eee ad to take piace o: ber 141, 2024 Explais material hospital, Aga find vie chet vetween eit HS OF GOW very truly yours, Terry Scott Schoo Prinetp:"
    },
    {
        "image": "program_invitation_synth_13_aug2.png",
        "label": "programinvitation",
        "ocr_text": "Division of west Stephanie South Otviahaven, Minnesota Community Service Day November 11, 2024 Rhonda Morris Haris Haney Tennessee 450 870 8077886 Re: Discuss hotel far Dearkristina Jones: The Community Service Day is scheduled to take place on November 11, 2024 at Mannview, starting at 12 00 AM. Explain material hospital Again find each near professional general Imagine impact sign firm ever style other. This event aims to strengthen collaboration between partner schools, provide practical workshops on pedagogy and leadership, and offer networking opportunities for participants articipants will be provided with training materials and refreshments. Please coordinate with Cook Ltd for special requirements or group registrations: Kindly confirm your school s participation at least seven days before the event. Very truly yours, Terry Scott ‘School Principal"
    },
    {
        "image": "program_invitation_synth_13_aug3.png",
        "label": "programinvitation",
        "ocr_text": "Gitsion ef sect stepheae ovth Obrmnecen, Sonesta Community Service Day bar 14, 204 Ronde Mtcris Ds c89 Hotel tae 4 10 take place on No -xplain Malena’ 8 HNBACT Sign frre i Denver ogy and laadership, any M6 baits will be provided wih raining m te with Cook Lid for ai Faquirye 'S participation at le. wember 14, 2024 at id gach OUT 8 ie Hrations, Kings Seven Gays bat rly lore the event, Weng truly yours, Terry Seoit Schoui Prin"
    },
    {
        "image": "program_invitation_synth_13_aug4.png",
        "label": "programinvitation",
        "ocr_text": "Division of eestor Soo Gindetarenn, Uborasnts Community Service Day eorernoes 15, 2088 Rhonda Moris osouto geT7 sae ae Bisa nut ar Dearkristina Jones: The Community Service Day is scheduled to take place on November 14, 2024 at Mannviaw, Slariog at 12 00 AM. Explain maienal hospita professional generat i 2 ipact sign itr ever style olner 7 eOngihen eolazoration betwaes pariner schaois, provide practcat workshops pedagogy and isadershup, and offer networking upporuaties participants vamepants wilt be proviged with Haining matenals and relrestynenis Please cores with, Cook Lid for spacial requirements or group registrations. Kindly Coniim your schao s participation of least seven cays betore the event vary traly yours, Terey Scott Sehaat Pancipal"
    },
    {
        "image": "program_invitation_synth_13_aug5.png",
        "label": "programinvitation",
        "ocr_text": "Division of ‘Nae! Seegnane: ‘geist Ciraaraven, Mnesete Community Service Day Novae 11 2004 Rhonaa Morris: serine “Tenet enn aToasr7ate? Re Disaarss note far Dearysistina Jones ‘The Community ice Day Ig chante’ ate ri 44, 2024 at Mannview, starting at 12 06 AM. Explain el iat. Again find i {sign figm ever Sh Sather. This event cims 10 siren petwee: Parner yoke, provide prachcal Ww S ‘and leadership, ‘and offer networking as for parucipants, r pants wi prove with mated: fe and retresnments, se cooruinate with ‘Cook Lid for special requirments OF ishations. Kindly ‘confirm your ct least seven the evel Very tray your’: Terry Scott School Principat"
    },
    {
        "image": "program_invitation_synth_14_aug1.png",
        "label": "programinvitation",
        "ocr_text": "Ghutsien of sone. ert Receneceenie, ont Does Teaching Workshop Re Also ok high size speay Pevirick Faartin ca on arch 24, 2025 at The Youth Leadership jurnmit is scheduled 0 take Holmesput, staring 2t Ton Ak. Lange suldtar te: hundred fant Future Stage, rennet 3. TMS itas fo stoengitan colleboranon betes fer fooling address. ws on pevogouy and eedership, and afl yor something . This partner schools, prance: prackcal WOrKSNOR PAENGRONG OPPOHUAIES for participants cananis wih De presides ith HARUN nn TiS ease coordspale, wiih RIVERS JOKE a Kremer OE fons, chcol s paricipal naly COnRY pour Ranais An ioe J seven days before He gh EN ATE Group atic spony techy YOUES. Progeaen Coordin:"
    },
    {
        "image": "program_invitation_synth_14_aug2.png",
        "label": "programinvitation",
        "ocr_text": "Division of south Jonnshie East Alexandershire, South Dakota Teaching Workshop March 21 2025 Mrs. Isabella Baker Marks Lid Marfand 001 301 700 85550510 Re: Aso ok high size Dear Patrick Martin. The Youth Leadership Summit is scheduled to take place on March 21, 2025 at Holmesport, starting at 12 00 AM. Large soldier lay hundred fight. Future stage reflect for something feeling address. This event aims to strengthen collaboration between partner schools, provide practical workshops Gn pedagogy and leadership, and offer networking opportunities for participants. Participants will be provided with training materials and refreshments. Please Coordjnate with Rivers Jones and Kramer for special requirements or group registrations. Kindly confirm your school s participation at least seven days before the event Very truly yours, Nr. Bandal! Program Coordinator"
    },
    {
        "image": "program_invitation_synth_14_aug3.png",
        "label": "programinvitation",
        "ocr_text": "Bibvision of Sout donne? ast atexantertion Sou CANOE Teaching Workshop starch 2 tars. tsabella Baker sg Mann Bante eects 1708 Ke. Aigo Ok RAGE SES i Palrick Marth ‘sciciar fay Future Sage, af aims 10 pp rohaborauen bee: espn pedagogy ard ede ship, and ofler PS Gieapants wily be provid Fayith ieaining pments. PEaee, conreipatg wi ‘pivers Jones and Kramer (or ao registrations. Kiiey Fee Gar senoo! peresspaton Yeast seven days before the event sunitie ts otra yRUr va ara Frogasin Coordietor"
    },
    {
        "image": "program_invitation_synth_14_aug4.png",
        "label": "programinvitation",
        "ocr_text": "Division of scum Jotoante ‘East Aon condersne. South Debate Teaching Workshop Maren 2, 2025 Mrs. Isabella Baker aes sd tna covanysecsenea Re Alec ok nigh size Dear Patrick Martin, ote ‘outh Leadership Summit is scheduled to take piace on March 21, 2025 at folmespar slarting at 12 00 AM. Large soldier lay hundred fight. Future sta Joss aiier schol, poe practical vnkshops venga ioe ratip an oer is, Movi A fof networking si aes for ‘anepmis Panipat will be rea wah trainin op RSE eee or oe feasts’ Rend cont OT schools partpavon Very truly yours, ‘Basal Prognim Countinator"
    },
    {
        "image": "program_invitation_synth_14_aug5.png",
        "label": "programinvitation",
        "ocr_text": "Division of Ens Aloxansiarstee, Teaching Workshop Re: iso ok jh ze dershv Suny js sche fs ke place on Mareh 24, 2925 at anna 12 00 Aa Large scitie: idied Sght. Fulure Stage settee fares. This event ais 19 stengtner poration between cal workshops on pedagcgy f offer D8 icipants val cIpARIS Wi tre FON s Rindly at leas! Seven days betore th ery testy yours, ator"
    },
    {
        "image": "program_invitation_synth_15_aug1.png",
        "label": "programinvitation",
        "ocr_text": "5 at Halishne, proiessot ginen guied to take pia nen May tat fy aceraras tate\" starting att wa nage cave Far pcotes between parte! DOF ahOw vagershipy, aged afer News Tgeraining Matene' ct fae toy sacra LOGHONY Ms regestatons Kinay COMET Dolore the eve! nt serge Panta BTIOAS! yeny Ty #24"
    },
    {
        "image": "program_invitation_synth_15_aug2.png",
        "label": "programinvitation",
        "ocr_text": "Biviston of Le vetore Donelion, Sou Canina Teaching Workshop Re ry fa oe avon Obrien: ach is schedule then may theit inerselt jeministration This even 5, PHOVIC 1g ofpoHUN HE Srefreshments, Please 1S OF OTEUP YOGIST n days betore STEM Out at 1200 AM Study non Far presser wdently The S sta mani ge way profes “nly confi Snyser anc whe event your Jetirey Sanchez"
    },
    {
        "image": "program_invitation_synth_15_aug3.png",
        "label": "programinvitation",
        "ocr_text": "Bivision of Lake vets: Teaching Works Sine 92, 2025 y Parker Mayor ens Sone. Voge Ea ane eaT wens Re Property tai Beat Baron Obrien: pehacils Lito take ny at 72 00 DAM Sti a: professor dently ageanisiraton ween partner schools, provide Ores coftr net with Morris Sialy confi Very truly yours, Jeffrey San"
    },
    {
        "image": "program_invitation_synth_15_aug4.png",
        "label": "programinvitation",
        "ocr_text": "Division of inks vores 19 Howie Oswine Teaching Workshop syoperty for NOt! bea Aaron Obrien -e on dune 62, 2025 at Hal pure San aw GiEssOt ig avant alms 10 SHENG 5 OM PO The STEM Oulsoach is scheduled 2 piae t f Bingy sone then may the startin Oo AM jeniity adm gon, Tis ractical works CIBANTS a wath rennineg Mates Jyoer and Races fF SBES ‘your schools 12 e: sicipation 2 ‘very truly yours, Pregect Offtaar"
    },
    {
        "image": "program_invitation_synth_15_aug5.png",
        "label": "programinvitation",
        "ocr_text": "Division of Lake Victora pametton, South Carine Teaching Workshop ne 02 2025 Brittney Parker 292 405 837110800 Re Property fll hotel Dear Aaron Obrien juled to take place on June 02, 2025 at Hallshire, ‘their herself. Entire than away professor The STEM Outreach Is, sched staiegrat 12 00 AM. Study none ther try manage rate. Far professor identify administration. This event aims to strengthen Qillaboration between pal echeols, provide practical (workshops on peda ind offer networking ‘opportunities. for dase’ Participants will Please jinate with Morris fons. Kindly confirm ni ‘Snyder and Rhodes for ‘special requirements OF group registrati {your school s participatio! ‘days before the event. Very truly yours, Jeffrey Sanchez Project Officer"
    },
    {
        "image": "program_invitation_synth_16_aug1.png",
        "label": "programinvitation",
        "ocr_text": "Division of Lake Kimberly Lake Waynehaven, Minnesota Teaching Workshop ‘August 30, 2025 Robert Ibarra Vimsams Wisamson and Rosario -Arzona (493 850 5804x78008 Re: Allow face front Dear Jamie Walker The Youth Leadership ‘Summit is scheduled to take place on August 30, 2025 at Michealborough, starting at 12 00 AM. Business drop easy so. Woman. join better despite. This event aims to strengthen collaboration between partner schools, provide practical workshops on ped: yy and leadership, and offer networking opportunities for participants. Participan' will be provided with training materials and Tefreshments. Please coordinate with Burns Harmon and Hoffman special requirements or group registrations. Kindly ‘confim your school s participation at least seven days before the event. Very truly yours, Mr. Keith ‘School Principal"
    },
    {
        "image": "program_invitation_synth_16_aug2.png",
        "label": "programinvitation",
        "ocr_text": "Lake Waynenavce, Man Teaching Workshop Be Allow face front Deer Janie Walker d to take place on August 30, 2025 at igh, sietnng¢ ines dioo easy so. Womats join better yerit aitrs to strengtiien collaboration betwee: schools, ‘on pedagogy and leadership, and offer networking pottunitics for paflcipants, Parc provided With training materials and iefieshments Please coordin 1g Hatmon and Hotine reculnennane oan ism your schooi s pal beiore the évent ‘wery truly yours,"
    },
    {
        "image": "program_invitation_synth_16_aug3.png",
        "label": "programinvitation",
        "ocr_text": "Divition of ake Wey Teaching Workshop Robert tara 2 Wlitmeon ant Rosas Secor S588 TONE Be Allow tace tract Dea Jamie Waiter. Saderstip Summit is schortute, Ufough, Starting at 13 06 RAK Spite. This ave 2n Join boty vent alms to etiween mariner So provide pracseg} SIND, ant Offer network BROIUNIES for ents 8 SOMIGEC With tra Tan ining a Hotinan ti g AOOl s participa as. backs) OH at least Schoet Principat"
    },
    {
        "image": "program_invitation_synth_16_aug4.png",
        "label": "programinvitation",
        "ocr_text": "Division of Teaching Workshop Ropert iy Re OW fave Th The You! edership Suzan se Sheduled te take is borough Staring at 12 00 AM Bus basy ir despile T Hains lo suenainen 08 sete ariner Sch onporue tes for p Bai aticipant rolleshmonits: Ptaase, Gordina Nens OF Group regs pacers MD, and afer vided with taming AMON And Has Your schoal s yar aa the avert Very teuty y School Prinzigal"
    },
    {
        "image": "program_invitation_synth_16_aug5.png",
        "label": "programinvitation",
        "ocr_text": "Division of Lake Kimberty Late Wanenaven Menesota Teaching Workshop ‘Aut 30, 2025 Robert Ibarra Wears Witamion and Rosaro -Anzone (493 080 5804178608 Re ‘Allow face front Dear Jamie Walker. The Youth Leadership Summit is scheduled to take place on August 30, 2025 at Michealt in better borough, at 12 00 AM. Business drop easy so. Woman despite. ieee collaboration beeen, ene provide span bo, leadershi ‘offer networking opportunities for participants. Partici will be il be provided wi ‘with traini rnetorials sand refreshments. PPle jease coordinate é with Hoffman for pr soace requirements or up reaiskatons Kindy con contr your schoo’ participation at least"
    },
    {
        "image": "program_invitation_synth_17_aug1.png",
        "label": "programinvitation",
        "ocr_text": "Division of mowers South Es STEM Outreach as. saess Re Suggest young mouth Bear Jetieey Ward to taky piace an September 25. Shurch is. May happe rh Leadership Sumit |s The You Chartgsv DOA ack eurdes chair Though bans s eng vpet een, panner sei Nols, PIOVIdE Lite tical we pane offer nenworka OPPS sort ang: materials 5 and spacial equirements pation al least seven roreshine of group fee 's batste the event Sen vary truly yours,"
    },
    {
        "image": "program_invitation_synth_17_aug2.png",
        "label": "programinvitation",
        "ocr_text": "Bivision of hose STEM Outreach ote 25, 225 Jasmine Krause oieis x pan gad Herron Wisco sae 1688 Re Suggest young moun Bear Jeffrey The Youth Leadership Summit is sche: Hed fo tak Chartesview. starting al 12 00 AM. Willer nay acro: avitenice condition office chair. Though brine way Sic stengtien Collaborstion belwean pariner schools, provide practical workshops on petiauogy ald ieacership, and ofier networking spporbidites tor participants ailicinants will be provided with training materials and refreshments Ploges coumiate with Martinez. Taylor tor spacial requitemnenis or group registrations aly cot ation at east seven days helore the avent chilis. May happen accept og ative. This event airs tc Vary truly yours, Joshus Dominguez Head Teacher"
    },
    {
        "image": "program_invitation_synth_17_aug3.png",
        "label": "programinvitation",
        "ocr_text": "Division of Mullysnive julreacn 1 Morgan and Men young moutt Dear Jeffrey Ward The Youth Leadership Summit S. orovide practical V laboration be s will be provic coordinate Kindly con ofS parficipation al least sey"
    },
    {
        "image": "program_invitation_synth_17_aug4.png",
        "label": "programinvitation",
        "ocr_text": "Division of Mollyshire South En, South Dakota STEM Outreach ‘September 25, 2025 Jasmine Krause Cotins Morgan and Harrison Wisconsin 296 500 1080 Re ‘Suggest young mouth Dear Jeffrey Ward. The Youth Leadership Summit is scheduled to take place on September 25, 2025 at Charlesview, starting at 12 00 AM. Wnter pay ‘across church its. May happen accept ‘evidence condition office chair. ‘Though bring way dog arrive. This event aims to stret n collaboration between partner ‘schools, provide practical workshops on lagogy and leadership, and offer networking opportunites for participants. articipants will be provided with training materials and tefreshments. Please coordinate with Martinez Taylor for special requirements or group registrations. Kindly confirm your school s participation at least seven days before the event. Very truly yours, Joshua Dominguez Head Teacher"
    },
    {
        "image": "program_invitation_synth_17_aug5.png",
        "label": "programinvitation",
        "ocr_text": "Givishen ef soayonce Sou STEM Outreach Septowoer 25, Jasmine Kr Con Meye at Sma Wscensie sassentuss 8a Youth Leadership St mint is sete Mlesview, staring 2 Ge strabons ave; 2 Fe ont days before tr Very traty yours, Joshua Caminguar Head Teacher"
    },
    {
        "image": "program_invitation_synth_18_aug1.png",
        "label": "programinvitation",
        "ocr_text": "Division of South Metssaborough Kimberyfon, Manesota Research Seminar March 04, 2025 Margaret Phillips Sanchez Lid South Dakota (010 888 2668x7617 Re Computer real community design Dear Diane Walls The Youth Leadership Summitis scheduled to take place on March 04, 2025 at East Melissa, starting at 12 00 AM. Culture ok second show. Including nature shake some attack. This event aims to strengthen Collaboration between partner schools, provide practical workshops on pedagogy and leadership, and offer networking opportunities for participants. Participants will be provided with training materials and ‘Sfreshments, Please coordinate with Wright Gnfin and Lara for special tscaivements Or group registrations. Kindly confim your school s participation atleast seven days efore the even Very truly yours, Sherrv Howe ‘School Principal"
    },
    {
        "image": "program_invitation_synth_18_aug2.png",
        "label": "programinvitation",
        "ocr_text": "March 04, 2025 ‘Very truly yours, Sherry Howe Division of sour Metesaborous\" Kemeayton, Minnesota Research Seminar ‘School Principal"
    },
    {
        "image": "program_invitation_synth_18_aug3.png",
        "label": "programinvitation",
        "ocr_text": "Division of ‘South Metissaborough Kimberyor. Minnesota Research Seminar March 06, 2025 Margaret Phillips ‘Sanchez Lid South Dakota (610 888 2008 7817 Re: Computer real community design Dear Diane Walls The Youth Leadership Summitis scheduled to tak Melissa, starting at 12 00 AM es) k attack. This eve Iture ok second show. Includin nature shi nt aims to strengthen Collaboration betw rth Practical workshops of Nn peda and leadership, and offer for participants Participants will be prowde refreshments. Please Coordinate with Or group registrati Very truly yours, Sherrv Howe School Principal"
    },
    {
        "image": "program_invitation_synth_18_aug4.png",
        "label": "programinvitation",
        "ocr_text": "Division of soun Metesaborouy Research Seminar ‘March 04, 2025 Margaret Philips ‘Sener Ls Sout Deters (orense 2000s7817 Re Computer real community design Dear Diane Walls Very truly yours, ‘Sherrv Howe ‘School Principal"
    },
    {
        "image": "program_invitation_synth_18_aug5.png",
        "label": "programinvitation",
        "ocr_text": "Division of South Meissaborough Kimberyfor, Minnesota Research Seminar March 04, 2025 Margaret Phillips Sanchez Lid South Dakota (@16 888 260817817 Re: Computer real community design Dear Diane Walls The Youth Leadership Summitis scheduled to take place on March 04, 2025 at East Melissa, starting at 12 00 AM. Culture ok second show. Including nature shake some attack. This event aims to strengthen collaboration between partner schools, provide practical workshops on pedagogy and leadership, and ofer networking opportunities for participants, Participants will be provided with training materials and refreshments. Please coordinate with Wright Griffin and Lara for special requirements or group registrations. Kindly confirm your schoo s participation at least seven days before the event, Very truly yours, Sherrv Howe School Principal"
    },
    {
        "image": "program_invitation_synth_19_aug1.png",
        "label": "programinvitation",
        "ocr_text": "Division of Lake Sens. Coramunity Service Day Fenrasey 22, 2026 Jacobo Gonzalez, -Pennzyeria Fewer veasques ant Seth sua ata 7724x3070 Re: Play lnse whole energy best Giona Bs ry 26, 2025 at eon Febru antl Sci Ad Our hen collabor The Comenanity 8 Day is scheduled pyerstire, starting at 12 00 AM. Laugh also! lator Station between sack himsert 1h neato banner school s, provice practical wotkshops on padsg ey and 12a oer Pelwerking opportunities for participants. Perici ans will bo provi Poe ments, Piease coominnge with Hobbs Musi menis of group registrauans. Kindly ci your 8 sion at leas! sever days before the event “taming matetiais af Whnie for spacial requir partcy very traly yours, Reaina Maione 1 Cooninstor"
    },
    {
        "image": "program_invitation_synth_19_aug2.png",
        "label": "programinvitation",
        "ocr_text": "Division of Lvre Seaca Pot hachewt Temwennee Community Service Day February 20, 2025 Jacod Gonzalez outa: valanaes sag ore 77D Re Pray ince wrote enenyy Geer Gloria Bean he Community Service Day 1s scheduled to take place on February 20, 2025 at oo et Te AN, Laugh aiso ma whose fnond unbi, Scientist sen our Hater. Slation Getween seek himseit, Tine event atins to strengthen collaboration coffer netwon nies cl jarticipants wil ced wi ais Id sekesnirents Please coordinate wiih Hobbs ler and registrations Kindly ‘conarm your school s While for special requirements or group participation at Toast ‘seven days befere the evant. Very truly yours, Reaine Mstone Pengram Coordinator"
    },
    {
        "image": "program_invitation_synth_19_aug3.png",
        "label": "programinvitation",
        "ocr_text": "Fecruary 2 Jac pb Gorzates Gear Gloria Be Regina Mal Program n partner scho: and offer networking taming mater Bivisian of Community Ser vic hoy pants, Partie uIdinate with Flobbs Mueller and e Day 20 Faby end until ps0 ship provided with"
    },
    {
        "image": "program_invitation_synth_19_aug4.png",
        "label": "programinvitation",
        "ocr_text": "Division of Comrunity Service Day Community Service Day is 5 staring at 12 00 AM. Th o 4 CoHaboratio oC With and hoo s panic will be pro with Hobbs Niue! andly confirm your s ad ules nenvatking of training rasteriat While for speci of gtoup registrations sicination ei least seven days hek very tray yours, Coostinator"
    },
    {
        "image": "program_invitation_synth_19_aug5.png",
        "label": "programinvitation",
        "ocr_text": "Division of Lake Selena Pon Mechel Tennessen Community Service Day February 20, 2025 Jacob Gonzalez Foster Velasquez and Smer Penneyivansa 40 978. 7774x3679 Re Play lose whole energy Dear Gloria Bean Community Service Day is scheduled to take Fi 20, 2025 at Dyers nly Service Day is 1S0 Te Wiese aot) Ue aes ear cot, Slaton between seek eka fe sre ame waren cl ites for ts. Participants wil ovied wifi \"ae mccheeante eam ee aren ane ee for special Juirements Of group con your ss participation atleast seven days bolore the Very truly yours, Reaina Malone Program Coordinator"
    },
    {
        "image": "program_invitation_synth_1_aug1.png",
        "label": "programinvitation",
        "ocr_text": "a INVITATION LETTER \\ Jaahitation: The Research Semin at New Christine, beginning similar nealtn help age tiim pretty of appear jod reach half managst group ies one. The program will i kSHOPS, harids on activities, fificates ar will be held on September 02, 2025 ‘a ing at 12 00 AM. Any like choose i) een interview eight J& push weight choose neiude keynote pa 5, and actively, pa wili be provided on set serie presentations. interactive WO! and closing session for reflections and certi Responsibility depat sne guess eate central bate i actually nature merican despite Participants are expected x to attend the fult pro: ram, complete @ny pre session i pate in group: activities. a efeach and refreshments mater Materials ie; S nged. For coordination iries, contact the is will be arr’ Vi Miter Mcdonald and Mcintosh. Please confirm yout attendance atleast one week before the event by emailing ee or calling the office. L Drooking Forerard,"
    },
    {
        "image": "program_invitation_synth_1_aug2.png",
        "label": "programinvitation",
        "ocr_text": "iB Bae Ban Ba Bi Bn Rn Ba i am Bhs Ba Bi Ma Bia A & 4 INVI TPATION ON LETTER la a pants are expe fete any pre se: in group ac ties pate ed of co ae oe a an Coe Se eae"
    },
    {
        "image": "program_invitation_synth_1_aug3.png",
        "label": "programinvitation",
        "ocr_text": "INVITATIONLETTER ae Workshoo t _zomsecemone 4 bh Seminar will be held on September 02, 2025 ie at New Christine, beginning at 42 00 AM. Any like choose similar health heip age film pretty green interview eight —& appsar job reach halt manager group push. weignt choose set series one include keynote 'e tive WOrKSHOPS, hands on activities. and certificates . sabaation The Resear presentations, interac and closing sessi fiections Responsidilit debata she guess. create central debate actually noturs verican despite. Participants are expected to attend the full pr ram, Cor y pre session Le materials, and actively. participate in group activities. Haterials wilt be rovided on site: tunch and retresnments will be arranged. For coordination and inquiries, contact the tosh. Please confirm your i ‘Milier Medonaid and Mcinto: C attendance at east one waak before the event by emailing or calling the office. ie socking forward"
    },
    {
        "image": "program_invitation_synth_1_aug4.png",
        "label": "programinvitation",
        "ocr_text": "al oe Mo Bin a Be Mb Bi Bh Mon SoM nA MoM Baer Rosier Rein Se INVITATION LETTER ‘a, 7 a Teaching Workshop 12 Sepiemb: 2 00 ‘a Any ty uh ie age ob reach hal ima The p in group a sh and retr 2 6 coun t oy an nailiry g i Boe Ben Bon Bn Bie a Bn Bw Be Bem Bik Bie Rigi Rm Rpm Bm Mn Bw"
    },
    {
        "image": "program_invitation_synth_1_aug5.png",
        "label": "programinvitation",
        "ocr_text": "is sm ae Pa sr Sain Bon Ben ne Bn Main Main ein bn Brn, Rann Ain, Wade Me! INVITATION LETTER =k l presenta Ba Ai A BB Ae Pl A Bi Be a i lg Mn Me Bi"
    },
    {
        "image": "program_invitation_synth_20_aug1.png",
        "label": "programinvitation",
        "ocr_text": "Feraesy 25. 2025 Cynthia Smt tose oxy -Kanses reeorats Dearkayis Massey: arenig materiaks ane foes rnenits oF GrOUP Division of Lake Merkin ‘tiers Lomeey, Alo Teaching Workshop Jax simple bates be. st requil wen days dedind White for special ou! panicipation at east $8) J very teuty yours, Jessice Bnaes School ase coor’ 15. Kindy confiemm 6 tho event."
    },
    {
        "image": "program_invitation_synth_20_aug2.png",
        "label": "programinvitation",
        "ocr_text": "Division of Lake Markton West Lorbury, Alaska Teaching Workshop February 25 2025 Cynthia Smith Todd Group -Kanses Re: Taxsimple before Dearkayla Massey; The Community Service Day is scheduled to take place on February 25, 2025 at Balleyfort, starting at 12 00 AM. Radio major least north. Talk become right policy ‘small home. Arm officer work head skin able. This event aims to strengthen collaboration between partner schools, provide practical workshops on pedagogy and leadership, and offer networking opportunities for participants. Participants will be provided with training materials and refreshments. Please coordinate with Holmes ‘Sanders and White for special requirements or group registrations. Kindly confirm your school s participation at least seven days before the event. Very truly yours, Jessica Briaas School Principal"
    },
    {
        "image": "program_invitation_synth_20_aug3.png",
        "label": "programinvitation",
        "ocr_text": "Qhiskonef Lx: satin Teaching Workshop Feary nttiia Smite keanens Re Tax simale betece ied to take place on February 2 5 at Rac major least notin Tatk Docame aah: ookcy vim officer work head skin abi. ion fetween pattiet schools, provide a ndership, aid stvorking onportinines be provided with airin: ments. Phe Sanders and White pedagogy Participants wil cominaly wir Hot stlons, Kindiy the event al required ipation at ies wery truly var Jessica Briggs: Schoo! Principat"
    },
    {
        "image": "program_invitation_synth_20_aug4.png",
        "label": "programinvitation",
        "ocr_text": "Division of Lake Markion West Lorbuy, Alaska Teaching Workshop February 25 2028 Cynthia Smith Todd Grup -Kansas eoe e7e2071214 Re Tax simple before Dearkayla Massey, The Community Service Day is scheduled to take place on February 25, 2025 at Baileyfort, starting at 12 00 AM. Radio major least north. Talk become right policy small home. Arm officer work head skin able. This event aims to strengthen collaboration between partner schools, provide practical workshops on pedagogy and leadership, and offer networking opportunities for participants. Participants will be provided with training materials and refreshments. Please coordinate with Holmes ‘Sanders and White for special requirements or group registrations. Kindly confirm your school s participation at least seven days before the event Very truly yours, Jessica Briaas ‘School Principal"
    },
    {
        "image": "program_invitation_synth_20_aug5.png",
        "label": "programinvitation",
        "ocr_text": "BivisSn ef Lace takin Lorbun, Aten Workshop Re ear kayia Massey, The Community Sevice Bay is Baitoytos at 1206 AMR collaboraticn batween ix and leadership, and off be provided win tra Senders and Whi you eduled to take place on February 25 2025 at ‘dio najor least noth. Talk bacose adit poe otk Read skin able. This event ains io svenginen cal workshops on pedagogy riner schools, provide prac Relworking oppertunities for pariicinams Paricipa: materials ang Felreshments. Please coordinare wiih Holmes group registrations. Gindiy contin ven days Bekive ins evant. Vary truly yours, Jessica Bias School"
    },
    {
        "image": "program_invitation_synth_2_aug1.png",
        "label": "programinvitation",
        "ocr_text": "me 2 ftendance af least o cailing the offies. i ee A i sl"
    },
    {
        "image": "program_invitation_synth_2_aug2.png",
        "label": "programinvitation",
        "ocr_text": "[a i INVITATIONLETTER * a | Youth Leadership St it I The Teaching Workshop will be held on August 08, 2025 at l Hebertstad, beginning at 12 00 AM. Write wonder Mr program & somebody respond force community store size could common likely usually your it human often property seem get door a kitchen spring enter big. The program will include keynote we presentations, interactive workshops, hands on activities, and a closing session for reflections and certificates. Policy early &® control central week your expert especially west already mouth &_ five here almost under pay get perform including woman star ‘a> themselves me front. Participants are expected to attend the full program, complete any pre session materials, and actively participate in group activities. Materials will be provided on site; lunch and refreshments will be arranged. For coordination and —@ inquiries, contact the Willis Norris. Please confirm your 4& attendance at least one week before the event by emailing or —@ calling the office. t t <A Looking Forward, XS rt ae HE ro Foley Johnson High School - 861 219 8796 angela96 example net a | Se ee ee ee ee ee"
    },
    {
        "image": "program_invitation_synth_2_aug3.png",
        "label": "programinvitation",
        "ocr_text": "= sp Ban Bi Bn Mn Btn Min Bip Bin Trin A Bin Bin Bein Be INVITATIONLETTER g Work wil be hy OA re size 2 cou eo oa if door ‘en n for ‘oe 4 pela 5058 contrat central y pert especial ae 4 iy on inclu fi rf cted io at Be Mm Bie Mc Sa Bi Bom ico Bh fh Reo Mim om Boo om Bx Bom A"
    },
    {
        "image": "program_invitation_synth_2_aug4.png",
        "label": "programinvitation",
        "ocr_text": "{ INVITATIONLETTER * we L Youth Leadership Summit \\, deem I The Teaching Workshop will be held on August 08, 2025 at I Hebertstad, beginning at 12 00 AM. Write wonder Mr program _# somebody respond force community store size could common likely usually your it human often property seem get door _@ _ kitchen spring enter big. The program will include keynote lw presentations, interactive workshops, hands on activities, and a closing session for reflections and certificates. Policy early control central week your expert especially west already mouth &_ five here almost under pay get perform including woman star ‘a> themselves me front. Participants are expected to attend the full program, complete any pre session materials, and actively | participate in group activities. Materials will be provided on site; lunch and refreshments will be arranged. For coordination and .@> inquiries, contact the Willis Norris. Please confirm your attendance at least one week before the event by emailing or —@ calling the office. \\@ Looking Forward, t oe Hee ro [__foernson Hoh Ssh00 - 861 219 8796 angela96 example net | SO OO ee eee"
    },
    {
        "image": "program_invitation_synth_2_aug5.png",
        "label": "programinvitation",
        "ocr_text": "Ra Bi An Bin Bs Mh is ih a Bn Ba i A Bn Ra Aa INVITATION, LETTER a he ate in group a uneh eam refreshments will ct the Wi be Be BAe pia gn gin rn Bn Be Ro Bee Bi Bion Be oe a ee"
    },
    {
        "image": "program_invitation_synth_3_aug1.png",
        "label": "programinvitation",
        "ocr_text": "— Fn Shin Pn Bie Bin Bs adn Fis i Man Bon in Bi Bin Roig Ba to 7 4 INVITATIONLETTER fe 5 Leadership it will be ae September i orth Veron, beginning at 1 Mi. Shou ‘a E ainst talk one can : a | i fepresen! no 5 i io at nged. For tthe Ayers Myers ai fe your attendance by emailing oF c doa. ee Oe ee 2a An"
    },
    {
        "image": "program_invitation_synth_3_aug2.png",
        "label": "programinvitation",
        "ocr_text": "a Ba Bain Basin Man Ei Hn Piss iin Ms Bae Pian tae Buca Bin Baad INVITATION LETTER eosin TION 8 EC aenciners neem” sarnit will be held on September ig beginning at 12 00 AM. Should t ‘alk one care Body poor floor 4 ousand whit 1 Youth Lead 6 at Norn Veron, free new reduce again mmayte only sha ia int osing session for nee 5 4 refiect eeand cert i TSN Y Fi fagnrese! L nothing thelr man any D AMS ate expected to attend the full program, complete any ¢ iy Of inate and actively participa mn group ba provided juneh ack rors hinents wil be a fl be pro ne ES Mye at ONG week bs befo ectargpersroria net 8 gyn Bi Aan Rm Bom Mm Mo pe Bm Bonn om Bm SO"
    },
    {
        "image": "program_invitation_synth_3_aug3.png",
        "label": "programinvitation",
        "ocr_text": "caine oe ee PR a INVITATION LETTER ae Serta 38 a35 ‘Youth Lenders he The Youth a eadership Summit witt be heid on Se tember 29, 2025 at North Vemon, 8 eginning at 12 00 AM. Shoulder City free new reduce Boainst talk one cere ody poor floor ams are ie 2 full program, Compiete any Pre session matetiais, an; ‘IV participate in foup activities, Materials will be provid On Site: lunch and ies €rs and King. Please ig one week before the event. Y emailing or Calling the office."
    },
    {
        "image": "program_invitation_synth_3_aug4.png",
        "label": "programinvitation",
        "ocr_text": "nnn I x t INVITATION LETTER I Youth Leadership Summit 4 I Barnes Inc Office 435 Youth Leadership Summit will be held on September 9, 2025 at North Vernon, beginning at 12 00 AM. Shoulder t city free new reduce against talk one care body poor floor maybe only share south list view former thousand while. 4The program will include keynote presentations, interactive | worl shops, hands on activities, and a closing session for 4 reflections and certificates. Little tend ground program yes represent nothing their man any politics. Participants are rm expected to attend the full program, complete any pre session materials, and actively participate in group t activities. Materials will be provided on site; lunch and refreshments will be arranged. For coordination and t inquiries, contact the Ayers Myers and King. Please confirm your attendance at least one week before the event by emailing or calling the office. en iM Pave Gaze i\" n t n cap a dat tt ly"
    },
    {
        "image": "program_invitation_synth_3_aug5.png",
        "label": "programinvitation",
        "ocr_text": "f INVITATIONLETTER & Youtn Lead i Bia Bn le Ml Bin Ph I Ba Bae Bim Mi Rn Bn Bin Be. Be"
    },
    {
        "image": "program_invitation_synth_4_aug1.png",
        "label": "programinvitation",
        "ocr_text": "RR hn ae oP os REE La Re REE eS eS RT 1 ene a aoe Pin Basin Bice Pn Bide Bem Bri ate ice Baie Mein anh L INVITATIONLETTER managemen cied to ations at Pe ee ee Oe ee ee ee ee eee"
    },
    {
        "image": "program_invitation_synth_4_aug2.png",
        "label": "programinvitation",
        "ocr_text": "———= PRN INVITATION LETTER t \\. Date senvery 02. 2028 Research Seminar ‘Crat Stokes and Cole Ofte k Sanitation be held on January 03, 2025 is The Teaching Workshop will at Me ington- beginning ‘at 12 00 AM. Color your lot include 13 employee remain persona resource person condition common movie action. The program will include keynote presentations, interactive workshops, hands on activities, and a closing session for |G reflections and certificates. Degree forget thus light long create project house tax minute none speech bal management win data sprin: company. expected to attend the ful progeny: complete any pre session materials, and actively participate in group ‘activities. Materials will be provided on site; lunch an IKE refreshments will be arranged. For coordination and inquiries, contact the Blackwell Parks. Please confirm your If attendance at least one week before the event by emailing or calling the office. is is ere"
    },
    {
        "image": "program_invitation_synth_4_aug3.png",
        "label": "programinvitation",
        "ocr_text": "A. INVITATION LETTER wi Uy ti2 fe 2ase confirm your store the event by i office i i Bim Be An Ryn Ah Bo Be AB Bn lm Bm Be Bin le Rie Be Be RY"
    },
    {
        "image": "program_invitation_synth_4_aug4.png",
        "label": "programinvitation",
        "ocr_text": "As BR se PB an Min AN ie PR i Hie Bi Bin Se Mba! amen ene s INVITATION LETTER sary O03, 2 lo Werksho 9 WHL be held oie Jane sing s Fes forget thus light jong a speech baby deta 1 npany. Participants are isto any H a Be s confirm your hy emailing <& i Pin Bn Fig A Bn hs Bin By Bn A on yn Rs Be Bln Min Bn"
    },
    {
        "image": "program_invitation_synth_4_aug5.png",
        "label": "programinvitation",
        "ocr_text": "cea eric i Bin Ba Rn Bain Ri BT com By Ba Ph Bi Bn Ba a L INVITATIONLETTER & amar meernets ‘a % = eT i be heid on January, 03, 2 00 AM if fot in f 4 ciate I week huge f P pagource parsan concition some an movi i program wilt inctud KeyT eriations, interactive @) work s, hands: an for &, fe nS an jong t ore rojact house tax im by ‘detail ; man eri win dats ng compan ricipant > a pTe S: } activites Materi i eshmenis wil we arr a the Black rt a ath st one Wee g i er calling Hi + wk 1 i 4 t as & 4 ~ t dhe Bu Bion Bon Bo co Bm Bo Bo Bm Bh Bon Bom Bn Bam on"
    },
    {
        "image": "program_invitation_synth_5_aug1.png",
        "label": "programinvitation",
        "ocr_text": "& INVITATIONLETTER & a’ Research Seminar . The Research Seminar will be held on June 15, 2025 at i\" Boyerbury, beginning at 12 00 AM. She rule herself capital aspecial name difference matter traditional hope notice really ‘, production despite school trade every east view ball & mention responsibility. The program will include keynote presentations, interactive workshops, hands on activities, &_ and aclosing session for reflections and certificates. ‘® Student character make peace project outside most doctor experience across card what politics people simply cold run.) level analysis. Participants are expected to attend the full program, complete any pre session materials, and actively _‘@ participate in group activities. Materials will be provided on site; lunch and refreshments will be arranged. For | coordination and inquiries, contact the Jarvis Farrell and 4 Bennett. Please confirm your attendance at least one week _ before the event by emailing or calling the office. <i Mary Hood i\" Wilis Tate High Schoo! Me Sirdareiaiexaroe nel a 1474 5 10 186604 125, ag USER, le, hy A ee ee ee ee ee ee ee ee"
    },
    {
        "image": "program_invitation_synth_5_aug2.png",
        "label": "programinvitation",
        "ocr_text": "ee 2 2 o os \\. INVITATION LETTER pate ne 18 2028 Research Seminar Is es eroso har oft sets. Ssatutation The Research Seminar will be held on June 15, 2025 at iG Boyerbury, beginning at 12° M. She rule herself capital special name difference matter traditional hope notice really ite school trade every east view ba I include keynote hands on activities, id certificates t Student charac! eace pr xperience ac ross card what politics peo level analysis. Participants are ted to attend the full rogram, complete any Pre se at materials, and actively ctiviti will be provide We ‘or coordinal Bennett. Please before the ev! confirm you ent by ‘emailing OF callin Looking Forward, Mary Hood viie Tate High Seat"
    },
    {
        "image": "program_invitation_synth_5_aug3.png",
        "label": "programinvitation",
        "ocr_text": "GR RM RR BM RM i Me he INVITATION LETTER sel al hope roti Spite schaoj trade ever Hf ty. ihe program F capit really st view be is a fais wil be provided é nents will be arranged. Fo oo fion and ing contact the J. Farrel an j Benneit, Pies tendance at ‘eas TONG week a. before Paling or calling the office, P La ’ I Sec a ae Oe ae"
    },
    {
        "image": "program_invitation_synth_5_aug4.png",
        "label": "programinvitation",
        "ocr_text": "ON INVITATION LETTER INVITATION LENS\" k Date June 18, 2025 Research Seminar Maidonado Harrs Office Sarees ie L id on June 15, 2025 at i Boyerbury, inning at 12: special name difference matter traditional hope notice really, roduction despite school trade every east view ball mention responsibility. The proven will include keynote presentations, interactive workshops, hands on activities, and a closing session for reflections and certificates. Student character make peace project ‘outside most doctor (G experience i i cold run The Research Seminar will be hel 00 AM. She rule herself capital IK ‘across card what politics people simply level analysis. ici ied to attend the full rogram, complete any re session materials, and actively participate in group activities. Materials will be provided ‘on site; lunch and refreshments will be arranged. For coordination and inquiries, is ur attendance at least one week wi Bennett. Please confirm your before the event by emailing or cal Looking Forward, k Mary Hood We Tate High Sono! ie 001 388 70 4737 4307 SCieatenettienamon net of 1474 510 180008 125 SR YesRyeAS L ooscscsscsscssok"
    },
    {
        "image": "program_invitation_synth_5_aug5.png",
        "label": "programinvitation",
        "ocr_text": ". Pet Ma. iB i RF Se ae Roa Be Bin A INVITATION LETTER recnescmt ae The Rese Soyerbury i PS Notley really iS People sit 878 Exper: i ran, foe, af Ly pre se: iy Ja, ACtivitic I on. 1 fur 19 tefreshm a F coercination ngui land 4. Bennet Plea: contir i before the event AD ary Hood"
    },
    {
        "image": "program_invitation_synth_6_aug1.png",
        "label": "programinvitation",
        "ocr_text": "ere SE ee Fuian Ae Be Mn Bei Bin Bane Ban Brn Mee Baan Pon Min Aa Pig Brn Mise T INVITATION LETTER i be hele i [var er veer ar Ser er We ee er ee ee ee eee"
    },
    {
        "image": "program_invitation_synth_6_aug2.png",
        "label": "programinvitation",
        "ocr_text": "te Nn Ba Pain Bi i PM Big Bas Bin Bi INVITATIONLeTTER at West ia andor nc i aver of role theory kK. The prog nations, interactive workshops, hands: tivities, and a eison dawn 3 paint sGde! tough church Mes ietier structure may PM ge measure beteve create t fougt id ted to attend the full program, A Mm RA Ee a Ma Mn. BB BA. Rim Mg Bn Me yn lh"
    },
    {
        "image": "program_invitation_synth_6_aug3.png",
        "label": "programinvitation",
        "ocr_text": "t INVITATIONLETTER § Dato eon 2 Teaching Dove Gros OMe BR a Saetaiton ‘The Youth Leadership Summit will be held on February 26, 2025 I ‘at West Brandon, beginning at 12 00 AM. Team nearly final Ie accept method what instead over hand discover production who individual under medical cover of role theory beiter major few water continue thank. The program will include ksynots: 4 presentations, interactive workshops, hands on activities, and 2 closing session for reflections and certificates. Person down * your painting model toug h church Mrs letter structure may é ‘act station leave north a8 measure believe create thought. Participants are expected to atiend the full program, complete i any pre session materiais, and actively participate in group ‘Activities. Materials will be provided on site, lunch and refreshments wil be arranged For coordination and inquiries, é contact the Greene PLC. Please confirm your attendance at east one week before the event by emailing oF calling the office H a soa vane? Quan le Ren Mar Be Poe oe oe we we oe oe oe ee wd"
    },
    {
        "image": "program_invitation_synth_6_aug4.png",
        "label": "programinvitation",
        "ocr_text": "es INVITATIONLETTER Teaching Workshop: oars Crow ee t | The Youth Leadership Summit will be held on February 28, 2025 at West Brandon, beginning at 12 00 AM. Team nearly final 4 accept method what instead over hand discover production who /& “individual under medical cover of role theory better major few water continue thank. The program will include keynote presentations, interactive workshops, hands on activities, and a closing session for reflections and certificates. Person down your painting model tough church Mrs letter structure may PM “act station leave north large measure believe create thought. Participants are expected to attend the full program, complete t any pre session materials, and actively participate in group a activities. Materials will be provided on site; lunch and refreshments will be arranged. For coordination and inquiries, contact the Greene PLC. Please confirm your attendance at Tleast one week before the event by emailing or calling the office. t t B Looking Forward, «& n in n Lge eee eek"
    },
    {
        "image": "program_invitation_synth_6_aug5.png",
        "label": "programinvitation",
        "ocr_text": "SE INVITATION LETTER Date Feder 28. 2025 Wo Teaching Workshop IK eeseome ree IK Sahitation The Youth Leadership Summit will be held on February 28, 2025 k at West Brandon, Beginning at 12 00 AM. Team nearly final Le accept method what instead over hand discover production who individual under medical cover of role theory better major few Ne water continue thank. The program will include keynote presentations, interactive workshops, hands on activities, anda is closing session for reflections and certificates. Person down your painting model tough church Mrs letter structure may PM Is act station leave north large measure believe create thought. Participants are expected to attend the full program, complete is any pre session materials, and actively participate in group activities. Materials will be provided on site; lunch and refreshments will be arrat For coordination and inquiries, contact the Greene PLC. Please confirm your attendance at Is east one week before the event by emailing or calling the office. a Looking Forward, Jule Cabrera ‘Brages Cestanede Magn Schoo! (001 734 937 3861x0228 helen74 example org +1 982 762 30840032 92 ea une Manone Paap a ee ee eS"
    },
    {
        "image": "program_invitation_synth_7_aug1.png",
        "label": "programinvitation",
        "ocr_text": "en INVITATION LETTER Community Service Day Carpenter Group Office t Salutation I. The Youth Leadership Summit will be held on June 14, im 2025 at Hunterview, beginning at 12 00 AM. Raise sea could benefit amount reveal crime individual argue spend mother culture thank a subject provide ok month you few. The program will include keynote presentations, interactive ~& workshops, hands on activities, and a closing session for reflections and certificates. Attention catch recently his drop big success industry great so chair activity born resource store. Participants are expected to attend the full program, complete any pre session materials, and actively participate in group activities. Materials will be provided on site; lunch and refreshments will be arranged. For a coordination and inquiries, contact the Kelley and Sons. Please confirm your attendance at least one week before the event by emailing or calling the office. /- . ~~ ee Se"
    },
    {
        "image": "program_invitation_synth_7_aug2.png",
        "label": "programinvitation",
        "ocr_text": "is { INVITATIONLETTER + The Youth U 1 2025 at Hun 4 could benefi mother culture thank a The program will include keynote presenta' workshops, hand: ctivities, and a reflections and certificates Attention ca big success industry greai so chair activity bot source hy store, Participants are pacted to attend the full program, ? complete any pr Ssion materials, and actively YT participate in group activities. Materials will be provided i fe; lunch and refreshments will be arranged. For w ion and inquiries, coniact the Kelley and Sons. i] se confirm your attendance at least one week before the event by emailing or calling the office. x rit wil i ing at 12 00 AM. R nount reveal crime individual arg spend subject provide ok month you few. s, interactive -& ng session for fiy his drop #> pK, Le EE nnn TA ONE EDIE"
    },
    {
        "image": "program_invitation_synth_7_aug3.png",
        "label": "programinvitation",
        "ocr_text": "Bin Bein Am Mn! BR Bi Ba Mn i t INVITATIO ON LETTER ie 4 On June 14, ‘ee nit will be. hel wy, Heginning at 42 00 f cf veal crime ind x month you few 5, intera' active ie 202 o&, could bereft f mother culure The program W T work 1 F activity born allend tne full al t materials, and ac’ 4 A group i aterials wilt be 7 funch and f S will be vies, conta “the Kelley nd Sons. & Please confi your atte lee e week belore /& i the event by emailing oF call i 5 . Ve sepeceraie ne hes ig cL Bin Bie Aeon Me ig Bm Bin Rion Bie Bs Roe Bom Ro Som 0 Bl. Bin Se he"
    },
    {
        "image": "program_invitation_synth_7_aug4.png",
        "label": "programinvitation",
        "ocr_text": "SEN TEE t INVITATION LETTER Sarcaner. iz The Youth Leadership Summit will be held on June 14, 2025 at Hunterview, beginning at 12 00 AM. Raise sea could benefit amount reveal crime individual argue spend _fnother cuiture thank a subject provide ok month you few. The program will include keynote presentations, interactive workshops, hands on activities, and a closing session for ‘@flections and certificates. Attention catch recentiy bis drops big success industry great so chair activity Dorm resource si Store. Participants are expected to attend the full program, j complete any pre session materiais, and actively lp participate in group activities. Materials will be provided on site; lunch and refreshments will be arranged. For g coordination and inquiries, contact the Kelley and Sons. tease confirm your attendance at jeast one week before the event by emailing or calling the office. hooting torweed, ie s IB. $B. 9 4 4. 2 4 4. by"
    },
    {
        "image": "program_invitation_synth_7_aug5.png",
        "label": "programinvitation",
        "ocr_text": "‘ INVITATION LETTER & 4 apes ‘Youth Leadershiy nent on June 14, AM e 2025 at Hunterview, 1 Raise 86a G benefit amour! i mother culty &. The program wil workshops, hands. reflection lerials, and actively will be p provided a oe and inquiries confirm your alte i the event by eme poking Forward,"
    },
    {
        "image": "program_invitation_synth_8_aug1.png",
        "label": "programinvitation",
        "ocr_text": "4 INVITATION LETTER k Teaching Workshop J i T Snyder Anderson and Cooke Office ic ase ly, The Research Seminar will be held on April 11, 2025 at I, North Kristi, beginning at 12 00 AM. Risk information piece I 4 little network point against friend seven live return relationship tonight environmental range economy PM. The i} program will include keynote presentations, interactive workshops, hands on activities, and a closini session for \\& reflections and certificates. Thank recently collection itself vote experience above last deal over watch offer operation ig <4 garden official scene claim prevent nice cold win. if Participants are expected to attend the full program, if complete any pre session materials, and actively participate in group activities. Materials will be provided on site; lunch and refreshments will be arranged. For coordination and inquiries, contact the Maldonado Mcclure and Garcia. Please confirm your attendance at least one week before the event by emailing or calling the office. \\@ Looking Forward, sere a auageaoecen le “7 (275 740 5302x04257 —— eee"
    },
    {
        "image": "program_invitation_synth_8_aug2.png",
        "label": "programinvitation",
        "ocr_text": "I A Bs ds Ban Ban Bi Bea Be A Bi! A Hs Rae Tin 2 ca ‘ae INVITATION LETTER | ng Vearishoe gon any Core CHioe ne held on April 14 are formation piece environs ge econeny ude Kaynole presettl inte hands on activiies, and a closing id ceniiogies. Thank f cantly colle above last deal ove! watch offer fi ne claim prevent nice cold war. ne full program, acted to attend sion materials, and actively Es covided | 5, Materiais wil be manis wit be arrat For sidonade Mocture satieastone orice. |"
    },
    {
        "image": "program_invitation_synth_8_aug3.png",
        "label": "programinvitation",
        "ocr_text": "So) INVITATION LETTER C 5 Salutation: The Research Seminar will be held on April 11, 2025 at North Kristi, beginning at 12 00 AM. Risk information piece i} little network point against friend seven live return lo relationship tonight environmental range economy PM. The program will include keynote presentations, interactive workshops, hands on activities, and a closing session for reflections and certificates. Thank recently collection itself vote experience above last deal over watch offer operation le garden official scene claim prevent nice cold win. eo) Participants are expected to attend the full program, i complete any pre session materials, and actively participate in group activities. Materials will be provided on site; lunch and refreshments will be arranged. For <® coordination and inquiries, contact the Maldonado Mcclure ‘and Garcia. Please confirm your attendance at least one week before the event by emailing or calling the office. IK Looking Forward, le Melsss, Je Rae i >"
    },
    {
        "image": "program_invitation_synth_8_aug4.png",
        "label": "programinvitation",
        "ocr_text": "4 INVITATION LETTER A Teaching Workshop I SSP SthSer Anderton and Cooke Oce Ie The Research Seminar will be held on April 11, 2025 at iE North Kristi, beginning at 12 00 AM. Risk information piece J d little network point against friend seven live return w® relationship tonight environmental range economy PM. The 4 program will include keynote Presentations, interactive Ja, workshops, hands on activities, and a closini session for i) .& reflections and certificates. Thank recently collection itself ap vote experience above last deal over watch offer operation v4 garden official scene claim prevent nice cold win. iS) tT Participants are expected to attend the full program, complete any pre session materials, and activel J Participate in group activities. Materials will be provided on site; lunch and refreshments will be arranged. For coordination and inquiries, contact the Maldonado Mcclure and Garcia. Please confirm your attendance atleast one \\‘@> week before the event by emailing or calling the office. Looking Forward, N c A Seclkepemane omen r 568 776 3579 eeabetté exaple. com hs TY (2751749 5392x04257 eum &® a"
    },
    {
        "image": "program_invitation_synth_8_aug5.png",
        "label": "programinvitation",
        "ocr_text": "INVITATIONLETTER =k @ The Research Seminar will be held on April 11, 2025 at L North Kristi, beginning at 12 00 AM. Risk information piece ie little network point against friend seven live return ae relationship tonight environmental range economy PM. The ies program will include keynote presentations, interactive a workshops, hands on activities, and a closing session for qi <a refiections and certificates. Thank recently collection itself vote experience above last deal over waich offer operation i i gerden official scene claim prevent nice cold win. | Participants are expected to altend the full program, compiete any pre session materials, and actively | participate in group activities. Materiais will be provided on site; lunch and refreshments will be arranged. For coordination and inquiries, contact the Matdonado Mcciure le and Garcia. Please confirm your attendance at least one week before the event by emailing or calling the office. : pees Sa TASTY eeabersigecmpecen he |"
    },
    {
        "image": "program_invitation_synth_9_aug1.png",
        "label": "programinvitation",
        "ocr_text": "eeen ee eee ee EE Baie Prin Bain Bonn Ban Man Brn Bn Ran Ren ein Anbar Ren Prin Brn INVITATIONLETTER An Bagman Bn Ban Bm Mem Bin Ban Be Be Bae ee Be Co"
    },
    {
        "image": "program_invitation_synth_9_aug2.png",
        "label": "programinvitation",
        "ocr_text": "ia Hn Rt ema tl ca 7 invITATIONLETTER =» ‘ee Ba, Bi Bn ee Mi! & i at om The Te 4 fon Apri ne Ma! Parlicipanis are expected 16 attend any ore: and ac pes E inquiries, our atiand: f In Re Ben Bon Bm Aim Be Bm Bim Br Bi Be Bom Jas Bion Bhi Begin Be"
    },
    {
        "image": "program_invitation_synth_9_aug3.png",
        "label": "programinvitation",
        "ocr_text": "INVITATION LETTER 2 The Teaching Workshop will be held on Apt 18, 2025 at West Norman, beginning at 12 00 AM. Officer itchen source drug could on always operation question because religious effort \\@& course describe thank economic game nor many surface reality brother establish outside price have community. The program’ will include keynote presentations, interactive workshops, J hands on activities, and a closing session for reflections and <® certificates. Collection less move bank can yet or much effort everyone half whole nor increase cup lose next else bit. yb Participants are expected to attend the full program, complete any pre session materials, and actively participate in group ad activities. Materials will be provided on site; lunch and refreshments will be arranged. For coordination and inquiries, contact the King Mcgee. lease confirm your attendance at es least one week before the event by emailing or calling the office. Looking Forward, ‘Sanchez Quinn High Schoo! (714 588 9400x198 \\Cervantesvie no /"
    },
    {
        "image": "program_invitation_synth_9_aug4.png",
        "label": "programinvitation",
        "ocr_text": "Pe A Mt, be: f INVITATIONLETTER 'e 18, 2028 at West hen source gre i ality 2 18 prograry entation eS, and a ok lection fess mo If vy Wworkshon, flections ang ¥8! OF Muh effort Sup lose next aise b: 8 ful mrogran; b fn group 7 oe Orr anged, Meuse. Pleas, Sefore the ae Coordination ard ne Confirm your af vent by oma) co oe oe ‘ae"
    },
    {
        "image": "program_invitation_synth_9_aug5.png",
        "label": "programinvitation",
        "ocr_text": "yee id A A RB Al an IO Bin in Bei Mh in SAP INVITATIONLETTER ; refisctions and cert vi an yet or much effort ~Pioast one week bi 2 tb f ing the office. Oe See ec Se, a ee ee ee"
    }
]