[
    {
        "image": "project1_synth_10_aug1.png",
        "label": "projectproposal",
        "ocr_text": "CEBU CITY STATE UNIVERSITY Catege Compute Stes S y. 20232026 PROJECT PROPOSAL ee Sr Came. avgoven Sinem 2 Teun Wiambars’ Harmen. ‘aber Menus, Sherry Hansen, Rect Meanyre, Mehahe Price 9 Sammary of Protions or Chalenges: “The unwersty cangue covers 6 tse arma wetn maitghe bubaings, rainy 8 the foe a shaders, vedove, and even tacury te navicae effcinnty. The lick ct» centadttes tuaegaion eyarere ade to waeted tere, mazes angent nents, ard trustaen among campus users. Currant tonage i madteguste ans chan outa}, crating cout eopnclaty Gung peak Woury 4. Purpose of Projet: deveisp 0 matde boned aurtsaten sytiem tat proves reatiime deectons, balding niarnaton, aed tscelon secviowt wites the camcus. The aster vib het uae quik cate classrooms. ofiees, acim, and pons of mhereat, enpcovigy ora CANS enparance and tedveny Cavgiteneated ortnys 5. Atstrozokayy and enoiamentetan Strategy: “The prcject wid ute GPS tectonology, indoor patoning systems and mobs epgicaten cevatsament. The tear mi conduct Campus mney, ratect burg dal ad oeveisp 2 user tnne y owectace. The aystem wit be testes win rucient vimurteers ‘and velond dased on tnsdback, Integration wih exeing unversty systems WH ensure ‘accurate schedule and coun information. The fet apetoation wi sucgott both Meeks 39d 05 pluttorme. eer A LR A AE nates nope ame -"
    },
    {
        "image": "project1_synth_10_aug2.png",
        "label": "projectproposal",
        "ocr_text": "CEBU CITY STATE UNIVERSITY Colege of Computer Stuies ‘SY. 2023 2024 PROJECT PROPOSAL 41. Tite ‘Smart Campus Navigation System 2. Team Members’ Names: Robert Medina, Sherry Hansen, Robert Mcintyre, Michele Price 3. Summary of Problems or Challenges: ‘The university campus covers a large area with multiple buildings, making it dificult for new students, visitors, and even faculty to navigate efficiently. The lack ofa centralized navigation system leads to wasted time, missed appointments, and frustration among ‘campus users. Current signage is inadequate and often outdated, creating confusion especialy during peak hours. 4. Purpose of Project To develop a mobile based navigation system that provides realtime directions, buiding information, and location services within the campus. The system wil help users quickly locate classrooms, offices, facies, and points of interest, improving overall campus ‘experience and reducing navigation related delays. ‘5, Methodology and Implementation Strategy: ‘The project wil uiize GPS technology, indoor positioning systems, and mobile ‘application development. The team wil conduct campus mapping, colect bulking data, ‘and develop a user friendly interface. The system wil be tested with student volunteers and refined based on feedback. Integration with existing university systems wil ensure ‘accurate schedule and room information. The nal application wil support both Android and iOS platforms. ‘snat canpis Nauign sytem Page 1"
    },
    {
        "image": "project1_synth_10_aug3.png",
        "label": "projectproposal",
        "ocr_text": "CEBU CITY STATE UNIVERSITY Cotege 0! Computer Sten Sy. 10232004 PROJECT PROPOSAL"
    },
    {
        "image": "project1_synth_10_aug4.png",
        "label": "projectproposal",
        "ocr_text": "CEBU CITY STATE UNIVERSITY Golege of Computer Stuies ‘SY. 2023 2024 PROJECT PROPOSAL 41. Tite ‘Smart Campus Navigation System 2. Team Members’ Names: Robert Medina, Sherry Hansen, Robert Mcintyre, Michele Price 3. Summary of Problems or Challenges: ‘The university campus covers a large area with multiple buildings, making t dificult for new students, visitors, and even facuity to navigate efficienty. The lack of a centralized navigation system leads to wasted time, missed appointments, and frustration among ‘campus users. Current signage is inadequate and often outdated, creating confusion especialy during peak hours. 4. Purpose of Project To develop a mobile based navigation system that provides real time directions, building information, and location services within the campus. The system wil help users quickly locate classrooms, offices, facies, and points of interest, improving overall campus ‘experience and reducing navigation related delays. ‘5. Methodology and Implementation Strategy: ‘The project wil uiize GPS technology indoor positioning systems, and mobile ‘application development. The team wil conduct campus mapping, colect bulking data, ‘and develop a user friendly interface. The system wil be tested with student volunteers and refined based on feedback. Integration with existing university systems wil ensure ‘accurate schedule and room information. The final application wil support both Android ‘and iOS platforms. _snat canpis Nang Sten Page 1"
    },
    {
        "image": "project1_synth_10_aug5.png",
        "label": "projectproposal",
        "ocr_text": "BU CITY STATE UNWERSITY Sohage of Somat PROJECT PROPOSAL, 1 Tite Ws Navigation System 2. Team Memices’ Namew Robert Mecira, Sherry Mugen, Rehan Mehtyre, Michele Price muracy of Broblenns or Chater ‘The unvorety camps naw stwients, visions, sisciuion Duers a ius ares war niin Luseings, nnicng Raoul te sven faoutly to navigate elfeventy, The iack cfs camatzes ssominenis, ang huchatian among rs. Curren siyrage 8 oauaquate ated fen outtiated, orexing voetunen ing Baa reais ouincse af Price! Yo deseiep a mobie tased navigition aystem tha provides reattire drectons, gaiting intzemaben, vies wtton the campus, The sytem we holy users cack roams, offices, tacitaes, and paints ot sterest, pverad came expstionce ang reausing navigation eaten dulavs 8. Metedciogy and tmpiemertaton Siaiagy: Tne prowict wil utiue OPS tachnotagy, nagar pustianins systeins, and mete arnicatien sevaiepenent, The team wil coxduct campus mappng, celles! pulling data, ‘tients terface The system wit be tested wih stage varies s in feedback. Integrabon wih austen Uriversity systqans wis ensure accurate sehedule ans room incomation, The fe. appiciston wi suse Hon Avadtoey na Darou Nag gen a"
    },
    {
        "image": "project1_synth_1_aug1.png",
        "label": "projectproposal",
        "ocr_text": "BACOLOU BEL YTECEANC UN Sete ot Campane 2 2eztgaz PROSE: 5 Tee Ebiar Kesoutce Managucant and Recommendaten Srainen 2. Yesem Moabere' Narues PONEEG Sth, fahiey Nia, Terese Wan, doseon t ‘stray of rabtoms ar Chasenges: sfinienty. Win team ate of te ght BePeOBHte sexrces este Tovaes SHOU SBavZh Capatatins snd versonginae wOeUtivaten et ioiary resauroes *. Porpuse ot Breiect cSt 3 igo racy manasernet yates to Pee Fev oatweiatione basest on yaar preterm, fe serene aan MBM WR anhance restarn teen Sora fiery rescue CMBR More ane Mecoosy ane irsiemertaton Strategy. ‘Tow oreiect wi eetemant PRU agape NeaCease us bes ctor Rachie amis eigen thes 9% WOIOWeR Search, ane cutaben roe ih tbe chet Kem exstig tinary Teg RM. Bn ratcovpe teactg ve vate The syateen we etegraie wth ime seven foray A neung sautents on 30k. ournats, ang exgias mabe Fcemnmensatone encore user exit aysteers, Peccenenenation ares ge, ‘weiasemant sya tie, ivEResatY PROPOSAL Heene, Sinan Nest Povm televans resources stacants otn ovteiog oystem wcae fear to tes Det sonatERS resource a Sac seconstomaaten aeneratin a tig Bases an Wier sureeys aa"
    },
    {
        "image": "project1_synth_1_aug2.png",
        "label": "projectproposal",
        "ocr_text": "BACOLOD POLYTECHNIC UNIVERSITY Cotege of Computer Stes SY. 2021 2022 PROJECT PROPOSAL 41 Tie Library Resource Management and Recommendation Svatem 2. Team Members' Names: Femando Smith, Ashley Meja, Teresa Wikams, Joseph Trevino, Amanda Nash 3. Summary of Problems or Chalenges: ‘recommendations based on user preferences, search history, and academic, ‘requirements, The system wil enhance resource discovery, mprove user satisfaction, and Increase lrary resource utkzation through smart search and recommendation algorttims. ‘5. Methodology and implementation Strategy: Lara ce rage na cores Se Feet"
    },
    {
        "image": "project1_synth_1_aug3.png",
        "label": "projectproposal",
        "ocr_text": "BACOLOM POLYTECHING UHIVERSIT 2 oF Sanne Sesion Sy aoazore 1 te Lorry Heeaace tonegewnt ant 2 Team Members Saines: onan Aaivey Aiej, Teresa Yitame, Joneph Trevis, Aranda Nash 3. Summary of Pre 13 of Costenges: The waversity Rovary faces chadenges in deiping stucens Sacever relevant swacarses ficient rth thoveands ofhooks, purnats, 07 oiggal materia, studanis cflen tragge t fint appropriate scurcas fer the reanarch, The current cataiog 2318 inGks intelipenl anscon vapaites and personaizen recommersiainns, iezainy 12 nderutzzation of tbeary eeseurces, 5 Purpose of Prowet, Yo develop ae caeaigere ary management system that jroviles gersanseed ceuourre rscontmentiatons tases on user ereterancus, searcn Wolory, and aessarne “ecuiremonts, The ayotern 98 enhance resource Swcurary, mprove we uatRtaCtON, One morass foray resource uifzatin thea! amsel seRech ant recotamentaton along, 8. Methodology and implemeniaton Sivaiegy ‘Tho profest vi enpinwcant anschine fearing sigortvns natural exequane processing for ancrewad search sor bubavine. Data ee ccsiectes trary existing inva lalrere mtertoce desks, ene rratatyree ‘Yow gysteen ee magraie wet aconrmmandation gestation aitasorstve tering based or Syston. vars sumwoys tog val valgate escommandatin acc! ee ourent brary management aytom, Larry tenrtzognst re Sicnmmaian sen"
    },
    {
        "image": "project1_synth_1_aug4.png",
        "label": "projectproposal",
        "ocr_text": "BACOLOD POLYTECHNIC UNIVERSITY Cobege of Computer Stuses SY. 2021 2022 PROJECT PROPOSAL 4. Tie LUbrary Resource Management and Recommendation System 2. Team Members’ Names: Femando Smith, Ashley Meja, Teresa Wiliams, Joseph Trevino, Amanda Nash 3. Summary of Problems or Challenges: The university ibrary faces challenges in helping students discover relevant resources cfficienty, With thousands of books, journals, and digtal materials, students often ‘struggle to find appropriate sources for their research, The current catalog system lacks inteligent search capabiltes and personalzed recommendations, leading to Underutization of library resources. 4. Purpose of Project: ‘To develop an inteligent ibrary management system that provides personalized resource ‘ecommendations based on user preferences, search history, and academic ‘requirements. The system wil enhance resource discovery, improve user satisfaction, and. Increase library resource utization through smart search and recommendaton algorithms. ‘5. Methodology and implementation Strategy ‘The project wil implement machine learning algorithms for recommendation generation, natural language processing for improved search, and collaborative fitering based on User behavior. Data wil be collected from existing Ibcary systems, user surveys wil inform interface design, and prototype testing wil vakiate recommendation accuracy. The system willintegrate with the current lorary management system. say Resource Margene 3 Resim Sen Past"
    },
    {
        "image": "project1_synth_1_aug5.png",
        "label": "projectproposal",
        "ocr_text": "‘BACOLOD POLYTECHNIC UNIVERSITY Cotege of Computer Stasis SY, 2021 2022 PROJECT PROPOSAL, 1. Tite brary Resource Management and Recommendation Svstem 2. Team Members’ Names: Femando Smith, Ashley Meja, Teresa Wilams, Joseph Trevino, Amanda Nash 3. Summary of Problems or Challenges: efficient. With thousands of books, journals, and digital materials, students often ‘struggle to find appropriate sources for their research. The current catalog system lacks \\ntetigent search capabities and personaized recommendations, leading to. Underutization of ibrary resources. 4, Purpose of Project To develop an inteigent tbrary management system that provides personalized resource recommendations based on user preferences, search history, and academic ‘requirements. The system wil enhance resource discovery, improve user satisfaction, and Increase brary resource utization through smart search and recommendation algorithms, 5, Methodology and Implementation Strategy: ‘The project wit implement machine learning algorithms for recommendation generation, natural language processing for improved search, and cotaborative fitering based on User behavior. Data wil be collected from existing brary systems, inform interface design, and prototype testing wil vaidate recommendation accuracy. ‘The system wil integrate with the current rary management system. (ray Resorce Maraqenet a Reames ier Pose"
    },
    {
        "image": "project1_synth_2_aug1.png",
        "label": "projectproposal",
        "ocr_text": "CEBU STATE UNIVERSITY Colege of Intomaton Techno, SY 2021 2022 PROJECT PROPOSAL 1 Tee Campus Event Management ond Tetetne Svotem 2 Team Members’ Names, Gary Mentosh, Lee Poole, Nicole Woodard, Sharon Duke 3 Summary of Problems or Chatenges ‘Campus organzatons struggle to coordnate events, manage regstratons, and track atencance effcienty Current manual processes vole paper forms, spreadsheets, and fragmented communtcaton, leading io confusion, cupicate regstratons, and poor attendance tracking There s no centratzed system for students to discover and regster for campus events, 4 Purpose of Project To create a untied plattorm for event management hat streamines event creation, regatraton, tcketng, and attendance tracking. The system wil provce a calendar of campus actvites, alow onine regstraton, generate tekets or QR codes, and provide organzers win attendance analytes and parte pant management toot 5S Metnodology and implementation Strategy ‘The development wil use web and mobile technologes to ensure accessbaty Featizes wil nclide event calendar, regatraton forms, payment ntegraton for pad events, OR code generation for tekets, and real time attendance racking The team wil conduct requrement anaiyss wih student organzatons, mplement secure data handing, and test wan plot events before ful deployment caro feet rarer ne Tony Dye ="
    },
    {
        "image": "project1_synth_2_aug2.png",
        "label": "projectproposal",
        "ocr_text": "CEBU STATE UNIVERSITS ‘Going of een ation Tere gy, 2028 2022 PROJECT PROPOSAL Tie cape Brent Menngernent and 2 Toarn Members! Names seab, Lee Boule, Nocle Winadars, Savas KE us of Srabieans ot Chatenges! 2 Sunray of Carsqun axganizatars stage te coarsely ie savage regieicatone, sn tack a vnc re e e Hiv OHe HET SEAS, SERIA aid OF sttendance eee gists ne ragnented 20% mendance wactog, To ot somos avon ‘duplente segintaens ‘or atadents io discove® and cracaios, acto te oo ccoveraizne 2y8207 4, orpose of Proiect coat 3 ute pilot ft 2Y fepataton, wketng, and ates otpue wel, sie pote capstan, Ser Grgarczore wil atendanice aratic stet pare rranagernent det streamlines avert arcing. Te syste vik prowede Banat of rate Bokels oF OR costes, ants prove ast master e 5, mettotikogy and rglemantation SSE crokgjes to ensure ancessibily. Featsret rant integration fet Was eve wm wat cond sta hamaies, 208 “pe deesiopmentni use wed 306 naa cea ratiae event calender, opataton forme, pai vn goneratn fr tea, a0 mae tome eines ASC The a ert anes win student organization, MNEMATE SMS Test pit events aufore fuk aapiar men meee i ae ame EERSTE RST"
    },
    {
        "image": "project1_synth_2_aug3.png",
        "label": "projectproposal",
        "ocr_text": "CEBU STATE UNIVERSITY “cotage of Infomation Technology xy, 2021 2022 PROJECT PROPOSAL 1. Tite campus Event Mans ‘Feketina System 2. Team Members’ Names: ‘Gary Meintosh, Lee Poole, Nicole Woodard, Sharon Duke agement and 3 Summary of Problems or Challenges: organizi cae ce efeienty, Current manual processes HVOWS PAPE ‘duplicate registrations, and poot ‘and fragmented communication, roe eentatzed system for students 1 cover and reatet attendance tracking for campus events. 4, Purpose of Project that streamlines event creation, ‘To create a united patform for event management tekeling, and attendance tracking. “The system wil provide a calendar of ‘5, Methodology and Implementation Strategy: technologies to ensure accessibity. Features “The development wil use web and moble \"tam, paymentintegrati for paid events, OR"
    },
    {
        "image": "project1_synth_2_aug4.png",
        "label": "projectproposal",
        "ocr_text": "ces! saga of nt mnson a, sunnmany of Probes oF Crsianges rons atragats #8 anIEae 2 jp procenaes BVONE. son, abet 14 aigcovet avd togictet arate 2, Purpose of Pra siovmn for event manenerers eA SeT va atendence FRC regisater, gen Saenstance snsiyies ae PATE RE Te create a urivd ot raginteaten, “oke2P, 0 cyage Bekess 6 GR codes, wed prea i managers? oh srigent Ma 5, Metnodonogy and Trmienantatan SBME ensinsty, Featere® iy pat vis, OR quar wk vonduCt ee 30d 108 sna WRU a Ranctde exert cana reqouanen Seg anton aera! ‘tutes! orgenirabons evant snayse wth penis solace ful dent ee penne ene AA rom ee Menge STH ET"
    },
    {
        "image": "project1_synth_2_aug5.png",
        "label": "projectproposal",
        "ocr_text": "CEBU STATE UNIVERSITY Colage of infermaten Techno S¥ 20212022 PROJECT PROPOSAL 1 T0 Campus Event Management and ‘Tenatna Svatem 2 Team Members’ Names Gary Mcntoah, Lee Poole, Ncole Woodard, Sharon Duke 3 Summary of Problems or Chatenges Campus organaatons struggle io coordnate events, manage regatratons, and track attendance effcrenty Current manual processes rwvoive paper forms, spreadsheets and fragmented commruntcation, leading to confusen, dupkcate regstratons, and poor atlendance tackng There no centratzed system for students to dacover and regater {or campus events 4 Purpose of Project To create a untied patiorm for event management that steamines event creaton, regavaton texetng, and attendance trackng The system wil provide a calendar of camous actvtes, alow onine regatraton, generate tekets of OR codes, and provide Organcers wih attendance anaiytcs and partc pant management toot 5 Metrodoiogy and Implementation Strategy The Gevetooment wi use wed and moble technologies to ensure accessbaty Features wwf clude event calendar, regstraton forms, payment ntegraton for pac events, OR code generation for tckets, and reat tme atiendance Wackng The team wil conduct requrement anaiyss wih student organcatons, mplement secure data handing, and test win plot events betore ful deployment Caran Beet nagret ae ey Se aa"
    },
    {
        "image": "project1_synth_3_aug1.png",
        "label": "projectproposal",
        "ocr_text": "ILOILO STATE UNIVERSITY ‘cekege of Bins Bonini Y 2021 2022 Pacemmvandieton 2 2. Team Marbers' Names! tegen Lewis, David Fobinton, Akexandca Pn Protiness or Chavionges: “Tne enwersty foray tase cheflengon a helnng ature canovel sean aNt SOROS aoe eee ah Geecaanas of bei, cera, 20 dg aio, seas O68 Srpepge to ind wpproprie cources rete research The ewer cca 1h ‘aoke rseert wear capintline ac ptwonsizes renrenansstine, ase uneruiization of torary renoure3. 46, Purpose of Projet “Ta deveion en weesigen Sorory sanateran system fat proves rma fess renenaatiors bated wase orsterences, weaich Hata, Bn 2oaseeeE eerste vk rsee ce (290UNa ESCA, MAUD Ae 2 sa aa ee rary creme sticain Ovcugh: Smar wearch ars renoramendshon AIAN 5, Metosolayy and inopementation Strate machine ean ny abgertinms for recommendation generator sno comaberalve fern nad 22 \"he: prose wii patura lanapaege processing fn HTEAENED RATER. 8 ee Se nn coterie tre exoh brary teem, vee! uN ey9 A Senin, a protgge testing wi estate racomunenda. 325H05y cevent Wane managesrent Syke! ‘near wisci The saturn od cages wat the cams eNO COAT EY Tree ean saagaton NCNOUNSENTET OF"
    },
    {
        "image": "project1_synth_3_aug2.png",
        "label": "projectproposal",
        "ocr_text": "ILOILO STATE UNIVERSITY Catage of Beans Adnaae Aton BY. 2020 2022 PROJECT PROPOSAL 1. Tee: Lerary Rasaume Management 16 Recomm station Sines 2. Team Members’ Names. Mogan Lewis, Gavia Robeson, Aleaandira Dum 2 Sumunary of Probienss oF Chattenges: “Tre university rare faces chotengas in halving studante Gecover retevart rasourcet flict y. Wah tneusede of books, ucrale, and otal materia, stusarts chen ‘sirugy): lo td appropriate soues fee thei research, The cutvent calaiog sybtam Mes Iniobyest roarch caoubéties ena pecsonakied recoomendatinc 9, eading to unsarutiraticn of Foray vescurcas. 4 Purpose ot Pret ‘Todevelen ar maton: Reewry management xyotern that provides parsonstzed resource recommencaues haved On uses prateroncns, search hwicry, and academic recuremens. The eysien wil annonce rano tce daciwery, kngro ve wear eatetacton, and wenease Roary rence utkaaton Meough amast snare Ard rocommentaton age tient 3 Methodnicyy end imokemersation Skatoay The projet wa plement machine levning aigortrune for recommendation penersten, natural angyiage processing for eraroves' yealeh, and cosakeratis Mecng Lares on ver betwee. Outa wil be colected torn exiting Herary syaiees, user surveys WA nto bextacs design, ond prostype teateg wi vakdaie vecornmeromten accuracy. “The syatem vi meqiate wah the current Itvary maunagumert aystom Leen Peace carne oer Seget"
    },
    {
        "image": "project1_synth_3_aug3.png",
        "label": "projectproposal",
        "ocr_text": "ILOILO STATE UNIVERSITY Colege of Business Adminstraton SY. 2021 2022 PROJECT PROPOSAL 41. rary Resource Management and Recommendation Svstem 2. Team Members’ Names: ‘Megan Lewis, David Robinson, Alexandra Dunn PeRte 1 fe appropriate sources Yor ther researc ‘The current catalog system lacks intetgent search capabites and personalized ‘ecommendations, leading to ‘of brary resources, 4. Purpose of Project: To develop an intetigent earch and recommendaton agorttins 5 Methodoiogy and inpementaton Strategy Fg Poet wil implement machine learning agocthms for. ‘generation, natural language processing for improved semen rary systems, user surveys wat inform pais na CNP esingwivakaterecommendston serene, ‘The system wil integrate (ern Resouce Maupenert a Reconmeranasymor Part"
    },
    {
        "image": "project1_synth_3_aug4.png",
        "label": "projectproposal",
        "ocr_text": ""
    },
    {
        "image": "project1_synth_3_aug5.png",
        "label": "projectproposal",
        "ocr_text": "1LOILO STATE UNIVERSITY Comnge of Denies Adeematadn By. 2021 2023 PROJECT PROPOSAL 4 Vie Loney Rescue Marageniant ont Ravemneraaton sere 2 Team Menters’ Names Megon Laws, Davit Rotmece, Alezandia Duen 3. Surmary of Probiens 2° Chidengee. ‘The wiverolty teary thoes chaienges e hetbeny students decoves revit reccurces, ettecanty Nes meusands ef hocks, RUIN, 0 9 Skat materi, stants CMe ‘struggle 8 “nd approtstie wources for ther research. The currers catalog syt er aco raeGyent search capndétee wns peronalred recommencintone, inadeg ender tz atnn of ovary veecurces, 4. Purpose ot Project dereing 69 miatgent ibrisy manscerrert ayHiesn Soa proviies personaived resciece raccrmendators Deod on wer pelerances, weach Disicry, and deacon taqureneens, The systen wit entiance resource decovery, MDIOve user MatntNC RON Wd ‘nerease rary resource ulation rough amert search ang paoomuner cen meres, S. Matnatoiogy and ierpiementaean Satagy: ‘The pogect all erpiomont machne ening sigarBene for eecommanranton geneeatin, nena! onquaye processing to ergroved Saetcn, and comwborate Mans based on ner beharier, Date wit be colectas Rom mizing dbvary syzlae, ues Surveys wt {eieern wiertece deigh, 2 orcletype testa we vatente recatmendaton secrecy. ‘The esters wel nwograte wit the current lecary macagenent syste. tre) Paar rage ae Reo reae e fe"
    },
    {
        "image": "project1_synth_4_aug1.png",
        "label": "projectproposal",
        "ocr_text": "MAKATI STATE UNIVERSITY ‘sehoo of Computer Se enee sy, 2020 2021 PROJECT PROPOSAL vecareent oC Ti epatraton process for both aor «5. Menosogy and implementation SEES! and zation je Trarnaes coe org 7"
    },
    {
        "image": "project1_synth_4_aug2.png",
        "label": "projectproposal",
        "ocr_text": "7) SYATE UNIVERSITY MAKA av, 233050: PROJECT PROPOSAL 3 sumenany af Proens of CNSBIOEES sre xara saan ins nobel EE tosis 6 omer Pea meray waa. ‘Srorenorts, Aéminiewatse 2D aerate wi Tsao SNS oc, earn tun erty BES ES var an contac tsk preeee ‘echecie surgeons of Pratt sod ushering systont tit arias, ror. pren, 318 ROE paiciare CHS a eomeees! ‘po uraate an sata Fo geuete Re pas sig To” CADSR a veces MCRD SOAS, SONS ore ani wRAETES. n peace tr batt sors ge ager m8 secs ese ant SAREE"
    },
    {
        "image": "project1_synth_4_aug3.png",
        "label": "projectproposal",
        "ocr_text": ""
    },
    {
        "image": "project1_synth_4_aug4.png",
        "label": "projectproposal",
        "ocr_text": "MAKAT: STATE UNIVERSITY Tene 3? oat SORE y PREIMECE PROPOSAL 4 fuera Sings SENET Seen 2 Tei Henin Manes, Hensaua, C9 sta cog, Patek PAM siete Rang, Bs fangs oe Craerats! “rg exer iat clas eatetlrG a Seomey say one censuming, error creo, 6H ae Toe eet racing foam enarpnet E! ARS ad shgioed CEE eee lmesn, Peres ators spss eesti S50 reeneting cores. Ane eres ranmny encencse: Cos cine 6 He CaN iat geuttcred scheves 4 Papuan Bie ster rot sgtrizes ase aanignninte or aaTOE Fee patents Rotleg reco caps, Pe AEH, dewnare, 2 rt erent, Toe nye ene HORAN SOE spree sain Se Jud ean regan proces fe Bua” SENSES aad etscents 5, haetiasorapy Bed brfementnti: Seg” sips angers ark pence aCe qatar wi eosin sarees AN “The wan wBoreiny constant sath peneaain canta SEND, SEAGER IIMLETE eget #38, faruly, ana abate taeennccien wih ater ne ao Gesmersh, Trer eet wh 28oe ase Sep rye oyrsonc wie be coveeoued Us EE Seng wi coma th OUTING GM HEE ty A CTE"
    },
    {
        "image": "project1_synth_4_aug5.png",
        "label": "projectproposal",
        "ocr_text": "ery MAKATI STATE UNNER ‘nag Goma NSE px seneUs?* 3 gE Ck PROPOSAL p esey Farag, Bren nc. enemy of ProBHe oF COME sue exon ans sone MSE pes nn, eter p30, 970 of na get Set) ESE. penee™ toad pera crac t sSonectng cco. rota 0 ths Deets te gaya CONES OE ed cma)"
    },
    {
        "image": "project1_synth_5_aug1.png",
        "label": "projectproposal",
        "ocr_text": "NEGROS ORIENTAL STATE UNIVERSITY Colege of Busnes Adminstration SY. 2021 2022 PROJECT PROPOSAL 1 Tee: ‘Smet Campus Navgaton System 2. Team Members’ Names: ‘Aon Gonzalez, Dean Reyes, Brian Benton, Jason Salazar, Ere Stokes 3. Summary of Problems or Chatenges ‘The university campus covers a large area win multple bulkings, making dificut for ew students, vistors, and even facut to navigate effcienty. The lack of a centralized navigation system leads to wasted tme, missed appontments, and trustraton among ‘campus users. Current signage is nadequate and often outdated, creating contusion ‘especialy during peak hours 4. Purpose of Project ‘To develop a moble based navigation system that provides reabtme drectons, bulding \\nformaton, and location services witin the campus. The system wilhelp users quickly locate classrooms, offices, tactites, and ponts of nterest, mproving overall campus ‘experience and reducing navigaton related delays ‘5. Methodology and implementation Strategy ‘The project wilutize GPS technology, indoor postioning systems, and moble application development The team wl conduct campus mappng, colect buking data, ‘and develop a user friendly ntertace. The system wil be tested wah student volunteers ‘and refined based on feedback. Integration wih existing university systems wal ensure ‘accurate schedule and room information. The fal application wil support both Andros ‘and 10S platiorms, ora cama Nacgun yee Poet"
    },
    {
        "image": "project1_synth_5_aug2.png",
        "label": "projectproposal",
        "ocr_text": "NEGROS ORIENTAL STATE UNIVERSITY Cotege o Barrens Aonnwvaton Sy. 2021 2022 PROJECT PROPOSAL 1. Tite: ‘Sma Campus Nevgaton System 2. Team Members’ Names: ‘Aon Gonzaiez, Dean Reyes, Brian Benton, Jason Satazar, Ere Stokes 3 Summary of Problems ov Chatenges ‘The universty campus covers a large area wih mutiple bukdings, making t difficult for new students, vistors, and even facuty to navigate effcienty. The lack of a centratzed navigation system leads to wasted time, mssed appontments, and trustraton among ‘campus users. Current signage 8 adequate and often outdated, creating confusion ‘especialy durng peak hours 4. Purpose of Project: ‘To develop a moble based navigation system that provides reat tme drectons, buking ‘nformaton, and locaton services witin the campus. The system wil help users quckly locate classrooms, offces, facies, and ponts of nterest, mproving overal campus lexpenence and reducing navigaton reated delays ‘5. Methodology and implementation Strategy ‘The project wil utize GPS technology, indoor positioning systems, and moble ‘appication development. The team wil conduct campus mapping, colect bukding Gata, ‘and develop a user trendty ntertace. The system wi be tested wih student volunteers and refed based on feedback. Integration win exiting universty systems wil ensure accurate schedule and room information The fra appication wal support both Andro ‘and 10S platiorms, ran caro Naeger 2p"
    },
    {
        "image": "project1_synth_5_aug3.png",
        "label": "projectproposal",
        "ocr_text": "MEGROS ORIENTAL STATE UNVERSITY abies Ut baseane Serine oy. 3970202 PROJECT PROPOSAI. 1 ee set Campus Noazaton Stem 2 Taaen Members! damned: ‘hon Goran, Deon Rayon, Sian Benton, Jaron Salazar, Gre dren warmace, and localicn services wien he campan. The nystem wéihelp avers authly ate Caseroores, ccs, techies. and pont of ntevest, ogroving wrwcah cmp Depa ence see ISIC RaW gOS Sey 5 Webosotory 207 Insiementaton SU SINGY ‘The poet wil ulize GPS technoingy, mina mmetoncg systems, aed ranbie sect wice Seeakernent. The inam wll conduct cameus mapping, cote! baking 4, re davdiop 9 user trendy itertace, The system we be Wetted wah stadent woksnorers, dard vata based co teecouek. biegration wth enising wniersty wysteces wil wmnse socuiete achaduto and room nitrmatr. The inal appcabns wil muperet been Aner 203 OS partes. ete A CLO CCC tert cnaremna gen NR"
    },
    {
        "image": "project1_synth_5_aug4.png",
        "label": "projectproposal",
        "ocr_text": "NEGROS ORIENTAL STATE UNIVERSITY CCotege of Business Adminstration ‘sy. 2021 2022 PROJECT PROPOSAL 41. Tite ‘Smart Campus Navigation System 2. Team Members’ Names: ‘Ann Gonzalez, Dean Reyes, Brian Benton, Jason Salazar, Eric Stokes 3. Summary of Problems or Challenges: ‘The university campus covers a large area with multiple buildings, making t dificult for new students, visitors, and even facuity to navigate efficienty. The lack of a centralized navigation system leads to wasted time, missed appointments, and frustration among ‘campus users. Current signage is inadequate and often outdated, creating confusion especialy during peak hours. 4. Purpose of Project To develop a mobile based navigation system that provides real time directions, building information, and location services within the campus. The system wil help users quickly locate classrooms, offices, facies, and points of interest, improving overall campus ‘experience and reducing navigation related delays. ‘5. Methodology and Implementation Strategy: ‘The project wil uiize GPS technology indoor positioning systems, and mobile ‘application development. The team wil conduct campus mapping, colect bulking data, ‘and develop a user friendly interface. The system wil be tested with student volunteers and refined based on feedback. Integration with existing university systems wil ensure ‘accurate schedule and room information. The final application wil support both Android ‘and iOS platforms. _snat canpis Nang Sten Page 1"
    },
    {
        "image": "project1_synth_5_aug5.png",
        "label": "projectproposal",
        "ocr_text": "NEGRO: QRIENTAL STATE UNRERSTY Teatage oes BINNIE sry. peated PRQIECT PROPOSAL 9 te news Cores Nov satnen Setar ‘Tre weavers paws susan. pavigttion seat nae unre cent Tae» cape Surg pas an 4. Pace of Prec eetgasvn sene l SEONY TOO arte athe cara, TO BPN qeitnes wots EY See atin, and seats ot EE: seer Re Sscing argent SOS: sapmventatice S82 5 Metedigy ane Pe en eeiliadl pan aon arpa Da"
    },
    {
        "image": "project1_synth_6_aug1.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF MAKATI ‘Sect sf Sonpitar Sieve SY. eataaa PROJECT PROPOSAL a Sivan! outa Hoh Supe Patoo 23. Team ibeebore! Hames: Hathuyn isch, Dawe! Marios, Usa Hoa 5. Summary of Prosi ac Changes Univaresy stuserds tare torexeiey mente’ heath chatengus necaing Ntee, anwiety, 20s depeagrnm, Dis many 279 reluctant fo 369k hele AU 7 Wipes Ue ack of genera 2bezs avaiable reseiices. The univeray counening center I ofan actrebstoes wth Senter expand te nerve af otusants whe rend augue? Tiare iv a crical rae ke scene mierda! heath seeautuEE AoW aly Hemverdicn 4 Parga of Propet “s Sovenm w nero antes platcn ted prmwitina minnity naan reeset, Se assnsnoent toni, apaitiimant keheouing wilt eauneeiors, Does SUDFErL CONNEC, ure con wtervention imacuscee The nysinas ache Os rotten Soerinrs te tts! watt, ‘Ruppurl and promote atedent weibeng Bch sc oeasee lechnsdany. 9. it ‘py and Inilenantation State Davetorrrant wi filiw etnee! gurtekues for ments! neat anrteavons, Sag prteeny) Protein envi cris management proiocom, The tea Wi evabsrate win urwerey Suurteinn services, imsserons aacure tammumeaton chanel, as BUsyeabe akisted ‘asia nonth assusamers tls, User toring wi amma apnioysiats tone seit aecesstaty, Emergency proiscom Wi be eclubeaned for eras steesens ‘awe ona sam Ratz, Fart"
    },
    {
        "image": "project1_synth_6_aug2.png",
        "label": "projectproposal",
        "ocr_text": "TY OF MAKATI sen of Compaer Bemeet"
    },
    {
        "image": "project1_synth_6_aug3.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF MAKATE PROJECT PROPOSAL Rn 3. Swramary of Potions er Cn Usiversity of ins iersenton 'g trough accessible technology. tal neath seenssrart tals. Us"
    },
    {
        "image": "project1_synth_6_aug4.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF MAKATI ical Comoe seence s Y, 2021 2022 PROJECT PROPOSAL 1 The: ‘student mental Health SUPPOT"
    },
    {
        "image": "project1_synth_6_aug5.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF MAKATI Seh00! of Comader Seance SY 20212022 PROJECT PROPOSAL 1 Tee Student Menta! eat Suppon Paso 2 Team Members’ Names Katrry Black, Darvel Martinez, Lisa Hood 3 Summary of Protiems or Chatenges"
    },
    {
        "image": "project1_synth_7_aug1.png",
        "label": "projectproposal",
        "ocr_text": "MANILA POLYYECHINIC UNIVER: atege Bas ae Senos ¥. 20227002 ROJECT PROPOSAL stan Seer Senda Kinsey, Prodoriss 42 vnany c2 Problems or Chatamgns ve univarsiy rary face chatanges a habiny abaterts cecum referent vmecorce oMicieniy With feousands of books, oomais, and igen mataride, slasents alien true te tnd aporogsisie aowrees for ther research. Ths coment cataing 8 ntetigert anureh cacebttion and perencatred recommendations, lend underamizaten of trary TesOOreaS, necks 4, Purgone of Project Yo wien an atsbigant vary ma recormetations beaed on wer pretences, yeare shisiory. and avasemic raguisemants, The system w2 ualiunce resouce Gmcauey, anprcie uses saiistaction, ant lcresan loraey reguarce sation trough smart wearch and ratamavensation agar, sit aysteea that proves povsenaived rescues 5 sirthedoloey ind ireterrentation Sater: ‘The proyec wal ingecrant machine tearing bgorune foe reccarammnastion generation, elural axquaye proveasing toe enpvover search, 20d collaborate ering bases ct user behavior, Date wi be colectes rom exising itcary syeteora, uset sivas wi Inform bazriace aueign, anc protetybe twating wit vatdate recommendation accuracy, ‘The ayer wit egrals wits the current ixary imararzemont systen iran Resacor nggonv a. cemandesSysten Paes"
    },
    {
        "image": "project1_synth_7_aug2.png",
        "label": "projectproposal",
        "ocr_text": "pRarosak. pasenge seigty ot ries pone ceieuaet 286 riers O80 penta of cenaisege® Sa or te 28 caeeccremeret ovary fo gin 708 eeenr fp capapit eretgert <prop! rast oF USE vevekee on et i bast orev vote sonst i neater anor hS fe uta nate be collec: “reconnmnendatinn SSoUrCy ‘Data wi ot ing ved vaingaie £220! for vig vee curve woraTy IR"
    },
    {
        "image": "project1_synth_7_aug3.png",
        "label": "projectproposal",
        "ocr_text": "¢ POLYTECHNIC Ut Ccakge oat ani Soren sog3 2022 PROPOS 4 Phe. Lins Resource Masnanennerd ut Benumancetian Sextet 2. Tere himnpare Hannes: Robert Shenst, Anieee Sith, Hedy Hoi, Sardca Mey, “5 Suronany of Problna or Chahengat “Thus urtvecsine Sorary thes chadenges W nein Mescesve Bacecer sian EOS etienty. V8 Ihacosnds of Ges, curs, are dyfal materia, ahaa Tee Stunape fea appropri szuroes fot fat veseersh, Tite cunven czakyg System eke packgert search capaci sod personsizes rscomnmardabens, Bang t Cetera oF Hay TEAECE. 4. Purpose of Prsinet “To daveting sx woteper Karey anaes sy reccenmmendatins Saad 2 uber Rreaerene=, SEIT feteararmerta, THe 32ieis Wa arhwNce ROTTS GOT, inevnane Borary tespucee wire throu esnant sea BS ities, anf acauteros Tongecve vere aabatwctan, 8 nccarever sion BEET, 5. Sartatoiagy sed bmpiemantatin Staley “Then project oft Ingsomat machi aera algorhns for vecomunenauien Gera, panurel lengua prouensing for mssroved weerc, aunt ccaerabve ering bane caer honace Det wiz be cobecien! tom ex Saary nyse, waey seve fetoon peertgea sessign, ae protaype tesing wi vale recormnmendeban accu “Tn eysinns toga vas the creer ROcery aresqaeners Sy een RSTO NTE EL CATE TE, tart Try Meena RO PRICE ESO"
    },
    {
        "image": "project1_synth_7_aug4.png",
        "label": "projectproposal",
        "ocr_text": "MANILA POLYTECHNIC UNIVERSITY CColege of Ars anc Sewmees 3 2021 2022 PROJECT PROPOSAL 1 Tie Lerary Resource Management and Recommensaton Svstem 2 Team Members’ Names Robert Barnett, Andrea Smith, Holy Hal, Sandra Mosiey, Fredenck Ht 3. Summary of Problems of Challenges: “The unwersty Worary faces challenges in helpng students discover relevant resources Thecnwy With mousands of Books, oumals, and dota materas, students often creo tnd approprate sources for ther research The current catalog system ack ittengent search capabites and personalzed recommendations, adn 1° Underutiz ation of brary resources, 4 Purpose of Project To develop an nteigent Ibrary management system that provides personaized rescuce Tocommendatons based on user preferences, search history. and academe oramens, The system wi enrance resource iscovery, morove use! salsf9clon. and ae orary resource uttzaton tough smart search and recommendation igorshms 5, Methodology and Implementation Strategy. “The project wil emplement machine earing agorthms for recommendation gener cee a tasquage processing ft moroved search, and cotaboratve fering based on caer vehavor Data wil be colected from existeg Ibrary systems, use’ surveys We sige nterface design, and prototype testng wil vakdate recommendation accuracy The system wal ntegrate wth the current ibrary management system. ee Corny Revovce ayer na Recent ys"
    },
    {
        "image": "project1_synth_7_aug5.png",
        "label": "projectproposal",
        "ocr_text": "MANILA POLYTECHNIC UNIVERSITY Ccolege of Arts and Sciences ‘SY, 2021 2022 PROJECT PROPOSAL 4. Tite Library Resource Management and Recommendation Svster 2 Team Members’ Names: bert arnt, ndtea Smith, Holy Hal Sandra Mosley, Frederck Hl 3, Summary of Problems or Challenges: ‘The unversty bray faces challenges helping students ciscover relevant resources ‘often 4. Purpose of Project: err a rset rary managerent system at ove parsons AMS story, and academic fused on user preferences, search his ‘improve user satisfaction, and algorithms. em wil enhance resource diSCOvErY, recommendations requirements. The sys ‘utzation through smart search and rec Increase library resource ‘5, Methodology and Implementation Strategy ‘generation, “te projet wl plement machine arin aborts ft reconratgere natural language processi in, and colaborativefitering based on aaa echo Data wilbe colectd from existing rary sYs 6T ‘ser surveys wil vtgem nterface design, and prototype testing wit vakdate Yee ‘accuracy. “The system wil integrate wah the current rary management system. oe Tony nesorce agent an Recoerension 9S"
    },
    {
        "image": "project1_synth_8_aug1.png",
        "label": "projectproposal",
        "ocr_text": "MARAT STATE UNIVERSITY fete Conse Seavew Sy 20262028 PROJECT PROPOSAL 1 Te Srlne Stusont Beate Tenegemen Sago 7 Team Members teemes Thomas Temas, Mende Rasnson. Deve! Manse tary Metres Latteey Sen 2 Stornery ot omen ur Statens SASS CONTE ITN a Cenbakead sletonn is shew: francis, and exbacuer at sem tee Topioonne 2hr6, B99 undete Emciovers ana yrecale 4 r Pertiowon, out shadents etuggte ts SORE ts ae Cantar B80 When acatasre acnevaranty, Deon cortoten dn aie Ny para POW LGU Tees! Se7kn Creme OrotrNcAe eRe tote Let wok eon 4 Purpote of Proves! Memodioy so intemeetaion So ntge Descent m6 toS w sg8e matnoichogy wth user Corteres Serer tereotes The fear 43 cone Pe Sine weve Seraty shises neess, 6eanp datoane airoecnne te secure ean Forage, an wesleriant mat bave: niectace we Featuves wit ease ductor 2 POE SIT Secures measicen we pictact arated a0 won storey cet aa cones"
    },
    {
        "image": "project1_synth_8_aug2.png",
        "label": "projectproposal",
        "ocr_text": "MAK 1 STATE UNIVERSITY, Seas ot Semen Sane SY. 0862035 OFECT PROPOSAL dent Portiotn gener Sey 2. Tuam Sfembars! Aamme actaieun, David Menicaa, Kinkery Marine, Livdeey Sith “Yeinas Thomas, Méchoe! 2. Surwsary of Pramteres oF Chailonger Studende currently Wek 5 centrakted abtionn to ahowesse tar academic achioraments, exeiets, and extvacsercular activins. Tradzionn paper sonfoios are sticud to nee toi, share, acd update Emphyers so grasuare schools incressagey recat dia portioies, bat snidente avieigie ig crake sxoessions! presenta of Bir work oned sages tin and gatdence, 4. Pompase of Prose Ta oenta compawensios dts! sadtots psfonm whem saucers 2en document tir seaverse pames, unued pret wun, 42ek acnigvertanis, ag ehaze tral gecertiate wh ‘Potential engi ars oe erivaationa! santstons, Tha syaters wi grove tonalaias, SA ce exper epiire a enhance shen explo aDity and yixcuaie ahaa! smpbeatens, 5, Melnodotogy avd lansiemaniation Stateay: ponent yeik otow signe metneanioay vith usercertared dusign princes The fnern vd conduct surveys to aectiy stadent needs, devin Galauare archtacturn 2 ve doy stoenge, ane mnnemert wied besad riartace with savponsie Gash wes 8 ede dociIer UplOde, graiect shewrann, acriewwment CK, OA erport Senurlty measures wf protect student data whdo wicwing conbresec sheng, nmin RCN ONESTAT pene nd"
    },
    {
        "image": "project1_synth_8_aug3.png",
        "label": "projectproposal",
        "ocr_text": "MAKATI STATE UNIVERSITY so of Conn Sane 8, 2028 PROJECT PROPOSAL, 1 Tite: ‘Ging Sheng Haatain Sinuganent Sree 2. Team Members’ lames’ Thera Troan, Michael Rebirscm, Duval Mond Suranary of Protteme oF Gradanges, Sudan s cuanty fank a ountraizee platfonn io shovrase ter academas achievements, projects, and extacurcewar aclivtins Tradtanal paper pevtioion ace aia te mainssn, hare, wrk upiite Enghoyers on graduate xchoois inereastigy cemuest digtal portsina, but students struggle to crests orotesr ona! pewsertadions. 2 Bee weak without rope: teste aval gustan 4 Punraae of Pret: “Yo susie somewhentive sgt pone pial now narsents cs doesment Hes sundenss umey. upload spc woth, tach neNeinmnTs, g04 shave thee erature nientad ervinyers ex edueatonai nections The sysiam wi) guicense. aod eeran apsnns Ws anhanoe Haatook ammpaynbity nnn graces AahO apDeeeta nS, 5. Metnoniogy and iplementsbast Dievelnumant wi tosuw sate muProccony with uoie centmse design prices, The twain ol sonducl survey 9 wentty atudast needs, design aaiaase anchtectare for eouwe dala storage, sit implement aek hesed masters wan teagensive design \\e68 WS Niue document UNAS, Erafect ikanEwNe, aoNAWATIeN Meck, an FOF axperi. Security meceures wit protec! sitclent deta while atoning conrotes set cr So Saran Une Soe Fayed"
    },
    {
        "image": "project1_synth_8_aug4.png",
        "label": "projectproposal",
        "ocr_text": "TE UNIVERSITY ROME MAKATE PROPOSAL cows E io mania ‘share, aed unde 1 grasiuate Schou wereasingly eauest ata! potodee, bur starr teareat tons of Heir wore whos 4 Purpose of Prowet iftpa altos here students ean dzovment ee The 8 nde tap femmloyabity snl grains 42 cates comarehentue dg 25, quae, 5. Metvaciolagy ard impmementation Strategy Devenpeent wi fedow 29% met cure data storage, and mores IF exbort ry wilh weer centered asign pencipies, The ident meas, dovigr catabase neb Oasad iartace witn resocnewe dea ny measures wie steel sixdent Guta whi iva er og tanapee Sem"
    },
    {
        "image": "project1_synth_8_aug5.png",
        "label": "projectproposal",
        "ocr_text": "MAKATI STATE UNIVERSITY Setau of Camguea: Seen sy. 2024208 PROJECT PROPOSAL 1 Tee Onare sicsai Merton Management Seem 2. Tears Members’ Nees Taree Trovnze, tichael abner, Covi Wondure, Kimbtdy Marenes. Lanavey Sra 8 Sumner of Prcusern o& Cratergee Sener carrey lace 8 cont ataed placer to shawrare Ihe ar ROR BENEVANEETS, Preqects. ani merece’ activ Bins, Traditoren pager ponies are Gc to nate, rave wre upc. Expioyery and prarhete show s nermaengy ramet Ogee perardc, ut stucida a1 aggl ty “\"aale picfeeuanal presetatts of ter wevik winot (seue 0 Bnd guahanee 4. Purpeae of Propect ‘To coats o compranennve dete! portats slat atiace vents ann document thes owtemis jaumey, upland GsamCS WR, ach mona seme. eT AORN Hee BASEN wee pow Viaereinyes 9 Se suatane! matevonss, The a tiem wt ootvore monet, ZuAbsne®, renter Oumaen ie antence trtent oe Syn, wn gETLEMe TenoD epBORO 3 Memocoay and imparertston 38 09y: Covriogerant wi tatom ache meinecuiany wit Leer cemered cvsign prrmsptes. The earn we contuet nursays $9 Weniy s1u7eN: needa, Cevepr Hatabene arcruuecture for secure data stcrage, ane mysmmunt wao saned ntertace wih Veaporsize dees], Femcses od rcire Seewner? ante, rojmct showcane, actrovemant neki, and (re EE Sree uae Are vem pte toe?"
    },
    {
        "image": "project1_synth_9_aug1.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF ILOILO CITY Cotege of Computer Stacie SY. 2020 2021 PROJECT PROPOSAL 1. Tie: Qnline Student Porto Management Systems 2. Team Members’ Names:"
    },
    {
        "image": "project1_synth_9_aug2.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF ILOILO CITY Cotege of Comavtar Stes SY, 2020 2021 PROJECT PROPOSAL 1. Te: Onine Student Portfoio Management System 2. Team Members’ Names. Kenneth Mason, Amber Morse, Thomas Blake, Wayne Norris, Michael Salnas 3. Summary of Problems or Challenges, oper tools and guidance. 4. Purpose of Project: achievement tracking, and -asures wil protect student data whe alowing controted POF export. Securty me ‘sharing, (One Sues Sao aragener Ser"
    },
    {
        "image": "project1_synth_9_aug3.png",
        "label": "projectproposal",
        "ocr_text": "yeRerry OF LOO CY 2a 2e PROJECT PROPOSAL ytite conse Studer Rotel Cee araene System Yesen beaches HINES. pean toes, Herne Rasen, neoniys Shave, wep tT, Wt sey ot Probes or Cn aTECHEO sanicaes paitsem wa joe achat. Trastenal cage SEEEERS sitet pa achat eas ere TT ait recreate Be ne ye wu 5 900 geadonty coarenny EK 8 eget, ad eRRTIEEETA have, an3 wpuate, Bee porbuinn, ot teas HUTTE 5. Burpone of Proc vp come 4 songetnansve agin wos AMS TT eademe enn docu tH —, 2 ts ana anaes ONSEN NA ara syste zur emo, SS ater? et eyes Beep opuare to ennani saci8h i appar 2h eepieesbany aca senanst® 5, sennnanny Bit mia taton SAS seroyevent oft ae eeanTs WA yaw ey ISCO Mp, odes ers bases EASTER re opoae, pent seoNcaE®, ACERT ant vacions date wns alonits ant fesige alatane ®° rai regponave Cath net waking. enti tact eer FE secure cts Features sal nctute ti PDE export Securty ansting uy 28 8"
    },
    {
        "image": "project1_synth_9_aug4.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF ILOILO CITY Colege of Computer Stasis SY. 2020 2021 PROJECT PROPOSAL 1. Tite: nine Student Portfoio Management System 2. Team Members’ Names: Kenneth Mason, Amber Morse, Thomas Blake, Wayne Norris, Michael Salinas 3. Summary of Problems or Challenges: ‘Students currently lack a centralized platform to showcase thei academic achievements, projects, and extracurricular activites. Tradtional paper portfobos are dfficult to maintain, ‘share, and update. Employers and graduate schools increasingly request digital pportioios, but students struggle to create professional presentations of their work without Proper tools and guidance, 4. Purpose of Project: ‘To create comprehensive digital porfoto platform where students can document their ‘scademic joumey, upload project work, track achievements, and share thei credentials wth potential employers or educational insttutons. The system wil provide templates, guidance land expor options to enhance student employabity and graduate schoo! appications. 5. Methodology and Implementation Strategy: Development wil folow agie methodology with user centered design principles. The team will conduct surveys to identty student needs, design database architecture for ‘secure data storage, and implement web based interface with responsive design. Features wil include document upload, project showcase, achievement tracking, and POF export. Security measures wil protect student data while alowing controled ‘sharing (nme shee Pato Magen ys Past"
    },
    {
        "image": "project1_synth_9_aug5.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF ILOILO CITY Colage of Computer Stes SY. 2020 2021 PROJECT PROPOSAL 41. Onine Student Portote Management System 2. Team Members’ Names: ‘Kenneth Mason, Amber Morse, Thomas Blake, Wayne Norris, Michael Salinas 3. Summary of Problems or Challenges: ‘Students currently lack a centralized platform to showcase their academic achievements, Drojects, and extracurricular actives, Traditional paper portfolios are dificult to maintain, ‘share, and update. Employers and graduate schools increasingly request digtal Portfolios, but students struggle to create professional presentations of their work without Proper tools and guidance, 4. Purpose of Project ‘To create a comprehensive digtal pontfolo platform where students can document the ‘academic oumey. upload project work, tack achievements, and share thei credentials with potential employers or educational institutions. The system wil provide templates, gu ‘and export options to enhance student employabilty and graduate school applications, 5. Methodology and Implementation Strategy: Development wil folow agile methodology with user centered design principles. The team wil conduct surveys to identify student needs, design database architecture for ‘Secure data storage, and implement web based interface with responsive design. Features wil include document upload, project showcase, achievement tracking, and POF export. Security measures wil protect student data whie alowing controled ‘sharing, rane Suet Pao Mangere Sys tent"
    },
    {
        "image": "project2_synth_11_aug1.png",
        "label": "projectproposal",
        "ocr_text": "eee OEMS Ince relevant state suney Cite references toca! “evsnment ans. barangay profes, oraous 7, PROJECT OBJECTIVES State clear, fonean ti SMART crt (Speco, Measurabe Achievable, Rel mae teun4) Distnguish between gence cent G80 and spect obactves eon outcomes) ign abjectves with ie Sustainable Development Goals (souus are ‘nattutonal extension prortes 4. TARGET BENEFICIARIES Ny Deneficiares with de see eraitd umber of dec and mdnecloerenen Dartcpate in the project portation, supplies doe pane gy untna SOureS uniertyatocaton eae Cyplealy 5 10% of total cot) or communty leaders Memorandum of ‘communty Curculim vitae of project team me assessment report or survey results Location na, ‘organizations or agencies"
    },
    {
        "image": "project2_synth_11_aug2.png",
        "label": "projectproposal",
        "ocr_text": "ROXAS ST Roxas, Capiz UNIVERSITY instructions in Crafting Project Activity Proposal EXTENSION 4 PRGHE ay danny sasilegennent an 2, BACKGROUND ante ste -Esgaar why ine sect ‘eens, sr oannulstonsintings fom canmunty mvaren «ore fhe, narsayey prstian or prev. ores a neursoie, nenacanie, Pe (gress and sec iy tnvtieg sours nuiniy weeds es 2 teers of conasitmant fem ns REGU PDE formes A pangs must be seo, BOY AN"
    },
    {
        "image": "project2_synth_11_aug3.png",
        "label": "projectproposal",
        "ocr_text": "KAS STATE UNIVERSITY Fegan Vi« Western Voavar Roxas, Capiz R COMMUNITY EXTENSION PROEGT PROPER, GUIDELIE Inalnartni to Prot 41. PROUECT TITLE AND SDENTIFICATION oowida a oeas, onvarbius thle iat meRacts bie projets supose Heats ts privet popsseute name, eobee departnns, ens contact infomation Saat ho suaing vaginas 0 rene sonsinains edie 2. BACKGROUND AND RATIONALE Dorota tha veinmuniy s euent etvetion and Waster nals fo 4ula Evpinn why tes pros: naecesey wad how R auroras eDeesio cemamuky pasties ol target szunmacity rye barengay 2° ores p aneds asnesenent ee ee seats, st eoneunetan fcage fom pesNmunay anterior Cite laren ses to kira devslagmant pans, Wanye 7 RHE? ae pres 3. PROIEST OQJEOTIVES State ear. mamncrahis vbinotvwe uatiy SHUNT sctasn Specks, Weasombie, Monaweble, Revert Tho tun) faatinguieh serwsen gene the Sevaabie Davelannent snjeutives tovmesd goal anid speeic abjectvas feonaete auinonss} “Alyn abjear es A ‘Goa (SNS ane iatnaonal extension prsens 4 PRAGET REMEACIARIES ‘cently pimscy and eeccrsery hanalioarias wit dara Spsaiy the estonaied nummer of deest and 9) aricpete i te eecees 5. PRO, 125 ALM WETHODOLOGY Pantie detuted fraine “Des Syrunch asiny snciding mater ty Epc rat we ete lag, andes, cceupaton} beretoiatian Emaut naw kenatisanas woe seinen an nen Bey a es aed esponsibie persis racasnes, and momacuesd suiguts Inside plows es Somernty na wvalsaten enechanioas fo oek PRESS aed Ww 6. BUDGET PADRAGAL Submis davaned Sutget wii datoled cos! breakdown lec panainal, matetols, Uaneportsten, Re Prova qustatans or seat pstinates hues suoptes, st fy somnaenay= inchs soning sevecaty smveto. extemal sents, evantony y expec Explor she oe |S REQUIRED ATTA OSUGNTE Later c¢ sequent rendanseesant tm barangay sthone 9 enim ieedurs Maseavangu of Ayresrsent MDS} wen zastnes comwuney (f szplensie}- Conesmun vlee af jack teem muons shave miavant excerse can és -Laeaton mop nd enmmuiy proste --anem af sonasnent fore eainee OUPOUMER AND) SUSTAINABLY PLAN Bryeibe seaeturebie outcomes nt hom success wel be avait ie pAoiest Dues l Onnave EEe SNR PACE EAE aH Ary eOMnsNry SEVIS OF HCARDUNS et el BEBE ne Tavs lana ne owe Wursiee ane eapacty ONESSg 9, SUBMISSION REQUIREMENTS «3 1 Ye pregen eacer one alege de nrguaeni wil be ehinied tor seein insti ot agains om thes 1) gieted copies ans ar wintrane enny i POR Soros! At pages saistse signed Propose nas be wuorntad at ea 80 anys Ustowr peacosed Kiplementaton -ienaate VALUATION CRITERIA Roiesavae bp commmurtty needs and insttuonal scabs (25%) vy ana Ina Hb Galge? appinpantorene wd 1 ANS) Gastemstaty anu gotertia! or jaune aieney 22%) 118 3- Coniunty partepaton and psonarehe quatly (15%) aoe Sor technica asviatence m soponstmepaneonn, sontaat toe Sate 5 00 PR, Propones eames Ieee anorsnioutary 15220 euenang days hors ees cick Servos Olen ung often houne Moesay Fray, BOR AM"
    },
    {
        "image": "project2_synth_11_aug4.png",
        "label": "projectproposal",
        "ocr_text": "ROXAS STATE UNIVERSITY Taegan i Nestrn nova Roxas, Capiz Extension Seviens Offe® (ee LN CE Inctructions in Crafting 9 ProjectiActhaity Propasa COMMUNITY EXTENSION PROJECT PROPOSAL GUN for Pcjest Prnzonents target corey 1S PROCES ARD a HION Hentiy vie project orononencs nome, 207860 wig compete adarurs and gaagraste coamiantes F soomuntys cumeny stentin aad sdenilied Me wes wet ooeninty probes I sono 40 aca! dovelagiant ANE, GASADRY DM it winern ine renee’ pupusa and extn 2 Gar, deserve ve fm Soouty die tae Dacagary OOTY. 1 conics infenatice sdapeanont, oF ‘pueaate seis tough sees coin oeevant isdo8, 20S 4 EACROROUNG AND oe consatation Smetegs PON! lOMsAE -Tsers Sha sarcary ane We Ao reersey tenant swreash 9 eRO Eoy OBJECTIVES Stam dens, rmasuenti anjecins vine SUT eva (Gnect, Measure, Acniavstie, Fateesrt ri or gout aoa spactie visectces corarvia outonmes! AEM 0 beteenn genesal ees! Fiore hour) Oates 22} ond venom Goal atonal ertensicn snares stn) ere select! arwd ow 8ey WS reary an sovandery rvchatag wit deTioaran! 4. TARGET BEMEFICIANIES Ee rey meas cf dct ena eine aneaten Exon ew aerate ositopete vsact civics wit woocife dates sad sexpansdsi DEON soe antaded tiaine of a re patevein prosudunes, aid expected oui i ay montaring anc weahnn mechs 3 180k ae aner3ei, moana, Sango, 8 deisied cos! esata ‘eaty ore ey atooatisn, e212! fe guar for C209 Ti Tie AND MET! egy Yor 622 sete fadeg. ae sunt PROJECT AC ascea De 3 Sesiineton, opus uBGET PROPOSAL ‘subad fevaeed budget th os ere gavtons or rath emnaies fam svepiess fr mas axes Peet Spec wm sommunay -eeete centnganey evdgst (est A oF ote 2031 smepuorsbe nutsnroms one neve ones we wesuwied ome thet 8 suet ISTAINABILITY PLATE Busine ve soresnice at te soar wend ecige eunsies und east u9ANG 7, EXPECTED OUTCOMES An Ean hoa the poet bene Manis maewnunty Jairs pins ior nt emiety meas Hierroreni tha wasn f enoulan ATYASEMENTS -Letar of quest cx eamnant Mom DRM GAY ST 2 Femert uC th pacer somenanty tf appeal} Cina an oe a rea mermhars sang seevant osha ic xstan rnp 6 Torry preh Letre ct comaimmans fa Convent nade assusenen! (57 OF ERY ceganzatane or geri PREMERTS aod osoies end ne enevonic sopyn EDP soorat Ad pages mush bs Sed sod brglernestancn orgie roniea at wast O° days elon? FmOPC toasty oF pooibes 125%) Clary and ‘guste salty end een! For aa CRITERIA Reeanen to sarerunty nes eee eaaiogy st): Busges apereprtanass et sscurne eefeney GPE) Tron Conway patiipaton end pasioerng qty 2 vent narounce m piopored crmporatan, conta! fe Extension Seices Oot tenviay Pia, 6 0 AM sonny cpa review inte appecrentety YE 20 wong Gaye fam ALSO\""
    },
    {
        "image": "project2_synth_11_aug5.png",
        "label": "projectproposal",
        "ocr_text": "crating a Projecu Activity :"
    },
    {
        "image": "project2_synth_12_aug1.png",
        "label": "projectproposal",
        "ocr_text": "METRO MANILA STATE UNIVERSITY, Hotona! Cantal Rectan INCI Mardia, Meteo Mania cconmntmscenccrnran Instructions in Crafting a ProfectiActivity Prop rune PSEA BREIECT PROOF ‘pagnnes ts rae saane ne THE Tantscense een ene 9 ATA RETESET en my maane nae rue Se ARENA ser Seana soene gun tins sian apier sean joa OE a pean arm 2 aga tens, anmgro ins recto eee rarer ce enwres p ape est omegannetz ehh MSE ELAR RSE SIRT IRIAE SY vaposermyaaase Lnlin ipvas aomaton y= E88 RIMES EN eo me are TeeATUME ann) -ce ane a aot A TSN Se a ean ieunt are MAGN IES RENTS SR EAS STA AS SY uc cegpares weet He up ann aeons cena mt sasta sae pees sere sent Dians eN seroma ‘sepeanes cost aren cere inte evetON LI nseign GOMETINI RISEN aE AA TO IPN HARI ean ari PEEISEY AGES ELAINE ri gaa He Ay ESTA se ge ae OR NERS CHEM EES TA) Tcac gates UAC YI GUAT EY ea ge He PSI sess ante He RGBROH IS \\erasan buts 1 asseancswtencorsce Uprsoepean sere OAT Pipes Sona Hs TOTS A. 2 peanrue aera wo PRIS A HAO cooeuen stares Be cna AND Re RET esse mS nn RR, SIE I eta se NW SESS TS cea bie Ore egeas 0 TD Ta A somOeGY THES BR AT: PEER AEDT honey Ae 1), SA PS) proses bacon inact cuanto AH, 3 mitin nance TASTED RT ve auanee ROOK. Abe ome Rn PN gS MA AMEE REI COMERS tonnage e58 seh EIS AR AE WGA RT SSR TIRES SS ese 1 morse eS ut tt pve mcrae, re GF 1 womuoees aoa ersavnnvor 198 owstes Mata 2p: Sy OEE aay SAAT AAS sonar HREESHEEENT ce a wap omnes IN ee HeN HEAES EY IS NANOS esac ane tr nie a 2 epee 386 IB Mere sane £OrwE URN IEE, eR US nye, ean REIN cS FE I oscar Arse 88 AT IN UEDUN PO gone. ORNS UFOS A SEE symnsuan saacers 2 Mere vopsencon ce er ose ST reps ent REED APSE PERN SE NE wea ogenanen iS. gantry ae es sexing einonConsstegswsgisniach eye vane Rew oe"
    },
    {
        "image": "project2_synth_12_aug2.png",
        "label": "projectproposal",
        "ocr_text": "ANILA STATE UNIVERSITY insteuctions in Crating a Project Activity Prope: 200 2A. ce a Pane gH (TE RUHR MS NO NON a Oe NE nwSe wA sr. ae ont urn sean: Deleon Ree ta essen omnes en ese age wonstOs Saansemmnconn pies speiaick me teas rmajentcen iene een wanna REPAECES Geta Siar, 2S Sm erR 9 oes a ron Runete SEM 98 OTOH SASK ES now g amore man sutuNe e es ga Prosser maCunNeTE stan wis en Ween Mea pe en Soe Ra TOE Sotire Arte amon eR ota sees rari sao eet 0\" mr aaceesencon nem"
    },
    {
        "image": "project2_synth_12_aug3.png",
        "label": "projectproposal",
        "ocr_text": "METRO MANILA STATE UNIVERSITY Neatorat Cantat Region (CR) Manila, Metro Mania Extension Servicer Ctice senate mene aneneiee ae eine cee ae wenn Sanam ne te en mtn Senne ere rn Instructions in Crafting a Project Activity Proposat rument ansennon once ongacen remet Domne te vos ane ee EE 1 COME bee scum comin ERE nome ae RE ARES NTA a RON NE RSCRN ERS A ame pane SERNA Ay MARINE BN ENE OND LES 2 ARSTRAC mnge S a Fit DarCUR ROOMY PLRIME A SSO CeO MIRED AUD AMORR eM Ne REE oma 3 SRG LETIN Soap: Meee Renae eGR CNR NRE eS PARE ame sa Cae! WMLER Ey MEY. fame DOTA we HUNT SPE CTA NAAM OH NRE IE A PEVER CREATED JIEPATIRE 30 orp Carnes arene Eom Crem at Ree “ana TOW Ie Sean MI BEY ODP tn ma Ed PORN Hr NP Yo 1 acon COLES TES ND TION. Sem gr BE eI RTM FREON NUD Qo 4 pm W 0 mur: Ore dep Ona Dane eaenen Beene BeTCIMNAMETN LINEORETCALCCEO TUNE FRAMERS Neer RIA COIR Uh PR HCE ORIG 9M Vo Sage sce RSENS aN Yuen Loanine taste Qt Be MOY 7 REALANCH MAIMCOOLCY: any ON QUEPASA EDEN ar BERR ROP g UEC ANT NO I ET OO SUES ME ite BA COB eS) OL EA RI NLL SN EEN eye CaLBEN MME Nf A) AE HR NED RYE MOE DOGUTRD QUIENES IND OFTPCTS Caen SCORER APE PKS MLL =O SORA ERIC PT. Y renee nites Bannon MA wt OW Be Suey a 9 PRACT TALSLAME Care ars Prone Bees ta INNA BIE DESL PAN Tye Pa ae Dee Caen? seen, mer 8a 8 2 me) 12 RIONET RON cya ONT RENE MEING AIOE PARDEE. AAD NE MSY ASME EG HALE PRON OIE HE es sy Per amnve nas remem ecmeg ENE EE 1 PRCRINRE Sas NmUeN NNR Roa OR ne 2 NRA fan AS ASIN Re BO cwrasonn Penske sta caeatncementacied edtemeicemaietataieaseimeaicoaeeame Sorensen reas cnnsa Mane ARE PomUAC TOG NEURCEUENTS- aUroW Ae 1 nF Tet ts RONAN TBO ay SaMRO Aue HB a ee eS eens eg. Poon NFS Sa oN PR NEGA Eom LAG umtuon PROSEDE Rema runwen meee WP relne 2 RezeTaN Mt om Ea nite oNAD aECNiNe DE RLERE Uee Saree Neue cement aR NGETTA GeNTNE RET UA RO ION BO Po GN cectabirmmimatasdadent dnaataatiedentanton iiiene achehaenetidiienan taiedioed opera. es"
    },
    {
        "image": "project2_synth_12_aug4.png",
        "label": "projectproposal",
        "ocr_text": "METRO MANILA STATE UNIV! Nationa Capt Recin (hs Manila, Metro Manila Extension Services Offs meer eee chnnpseenerenneetnaarntnes RSTY instructions in Crafting a Project Activity Prope SEREHACM RORCT Seneimes ROMAT Sen te marr atate Ren nines BR CAGE rey eta SugNEINE ca er Tn AUIS are eh 8A Set 2 AETSACT aman BO a RNG Ne Many Te eit Ro, ENROL erase Seen SOE vexmoveee SRATRODUCTION (yee ge ana ee rane he eA RO CAS UAT sgrtorse mnisawta eebeanactow ag, Detaetwmape as oregon cde naman ATU UTERATURE Scag) TN (ee SrRerOR ECON, oe OM ete EE Bytattivare mera ma eA marten ternst he etre toe ines na ea yond nwt Se ‘terion se goons ascent pest. Poms cen Noneh iain yhpctnins Wa -et Bipee eco mnmee amas, user agent SOREN HLACOHOMPTUAL FRAME Ht eRe 6 MRS EY De eA. Dees ARR are ve Dam Te a |W Shee neh st rng vento ne DrasRce BRO Sy Ne Le re cb Dene ana eR ree a Epa EMOM MCN ake RE Oa TRAN RESTATE, EER QO, Cre aEONONAHE Den sce seeaReA meERCOR, Evaro wei eg (eee ee, Pus ay Nj Hada en Une naNteyrores eat acer 3 ORC TED CT COWES AD UTHITS- Des APR RN SONS AOE mE eee ge ey DEL Eon AME we nz Cea ROME OAT EERE Gar a Om cE NC Ee a Ty Mare), Ay (mG ng ay rn oes (sem, Deca 2 einer anneaed tm astm mie sane gs are cea meetin. wacon ergo era eR Ra wu Se AR LESAN ma gar A SOS hart Ua soa aa To NOR Een oH how PARNER MOA epiain nana She me eR [8 APPEND. tam crest Mma ane Ue POMGEATTSYG REOUIMEMENTS- Pane ue AIA (1 ‘ecm Sarge 19 aes Eape ame reas ert rst ea A peRE Fat Tas hr ana .ohnt- Sa Ose ety gem es a sat ahaa pono ap Sipe Marat TSUN SRK 1 ae taencn oo Ra Rts Mane MAS ea A eon Sa OD top lege eRe inet cara NTE SU SIN SI een Wes Heng nara one Pusat a enna med Resa rin ose 2 nee pcs tay ON, area Nr, Pa ZS omy Fe dearroneara erie mpee, oct bo Ruane rs Sanat meen nus este Retna Oo"
    },
    {
        "image": "project2_synth_12_aug5.png",
        "label": "projectproposal",
        "ocr_text": "METRO MANILA STATE UNIV] Natana! Cant Regen (NCR) Manila, Metro Manila sr marge ees a. a scopage)- crntoon nach ig KOUCROGY- Reyes Gee, aie une nere sry tmarecnn Mie eons Nets, Bet OMAS oe Rewer URE ses ute steeper Pact vnaronaesn natn a ec esnips sib se) Ads eee newest erg bac Ra EN sasibeatetres aero RSS fowl dare rae py Mo sn cob Ea AY LE na Bae sa 78 aang) Fu Tes aw Ravan, gan Sau DaMeeene See Si ee roy area oa cae envoy a ecto Cv sw stent"
    },
    {
        "image": "project2_synth_13_aug1.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITy OF Sa Ex instr, ‘ons in Crafting a SOMMRETY exTENSicH ony sustons 2 PRUE 7 onty the pee EF PROPOSAL Ey SCVAct Cerca Ab engi HONS Servisen Grice Wty Proposai UIDELINES. LAT RINIDAD ci Ragen La Trinidad, B, f od caren i OM tacts the nets pupoce 40 tage’ someon SeRepenvant. a ventact ntonesone Seetts te wae bacngey arcomneyy om compinis aac tots suet 2. BACK EROUNE Axa Se ee ettUMAY cama sass ang eniPadl needs trotgh secs eokayan ate Basia why a pry Yim OME snes onmenty roe aude waecantsntntas, sarey \"280%, 27 onset muna stonen- ke rlanoes ee Men\" Wire, Samuogey sais, or ee eauy Fee OSECT OBNSCTES Ste cea, onan Shitcvee veg SABRI enn ea at. Achinvabt, Rasecant Dag Sger: Derg senwwen Sone Jane nee nat toat aid speatecouen tee Sele auieomes 22 Ruste Oeveimorent Gaus omg ‘tina esterston prongs 4 7RRGED BeNEReLeRES SeeRty ome meee ot ane 3 on inctines AHO METHODOLOGY bro: meidedeigy tor eash wenn 9 Patepnton. cupsety twining, POH PROPOSAL -Sutuok tomy n Provela suvistisn: er coe on Be far st, Sout jeanne Puy funding rcurnes tr ntiegesy 6 8 155 ot fata! coats EMPESTED Ourceases ane Susy, CORY O82 Onserac mesrimtie etest0es a Esalen ton te prams VAs oe eaetanse sti ee RPA tdendty comraney sie tho sve Reimowedse tensor ane conway sete Ir Be ROMUESTS «ater a mest {MOA} win sacaner anmincy eds assenimens ropa ge ere eankotes or ngennn. rSSIDN RECUR MCHErs Sets and nt atecnie copy in RUIRS tie! teeter and setene dog ORG INE De SiEmaed et cet oe ERP COSZrepRrtan, contact the 5 99 984) Proposal onion kes auDedratel tote ASIA wits den for aint experene SOR eye fame ost breekioun for pe 20 4892 dato pr ries Fhe during subesien ‘ates ncaa pe dl how uous we A890 objectives sin eemupasa) iow ey was S3hs8 sei espansie pences Sek Erogwss ang trpnee aso ton, soptes \"erty stocatin, minnie 28 ereatect 8H B9 seine Inconoie i Feasts of ativan nie fer mg teem mcd hon Fritey, 600 ans"
    },
    {
        "image": "project2_synth_13_aug2.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF LA TRINIDAD Instructions ia Crafting a Pre ES. State oar, AUG, Sapuny maseing, W A BUDGET PROPOSA PECTED oUreoN 5. REQUIRED ATTACHMENTS -4 ancinne 3° 434% AND AATIONALS Deename the communay LOGY Provide 9 deinen towing La Tinidad, Benguet gona denn aritve Repo ion Services Ofce ect Activity Proposal sour sine .y bencfciaras win Uamayanne devann iage, genset, avaunetany vafecanes are aeacted sd ha Shey 8 nolusinws stares ateera782, and exnecid suns svaty «Sheedy mar toring weal vatistnn Ne pevnons ies fniers for aioe es"
    },
    {
        "image": "project2_synth_13_aug3.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF LA TRINIDAD se perdace Ries SE La Trinidan, Benguet st tension Seve all iry Propesal ectiActiv' in Crafting Pro} instruction OPO CoMMUNTY EXTENSION PROR oasnct Peoyerants AND TORNTIRICATION sa tha prior ‘Speci she tage! oe fat ee vita a ae, a soem, a 8 i erouet 7 1 eee prec penerents cat, Coe sea cen’ ares B14 BTOOTENE sats wb veemmsn oe cre seat a TS seve thenogh nacos anwessen Pe gate ovat sabes, sme 0° BAS Stee soy PN emngay nt 8 pe etpen roan Sredaaerest BN supe, Rebevests argh osiesewns A sce, Measure, Ae Sean tent 28) snte ona, rneametin corse) SATE 3 sent 4. pROIECT OBA concn genes SETS onto aware DCS ee ogrvent [ss (G8) ana etary wanebsede 3) eerog EP Sreuuin now benesiasnes acne tage, gore naeneationt> spines ave nou tee ices encooe rrsne of weceens ed spate Sule A snsis penser een vgn sh a8 6 SEEN te aes back press ane AE mera pet povsspate i the pres wots 2 dotaed sitoai, praceanes 20 mening ane avant torpersonnet eng sours sank METHODOLOGY Pas vr wash adits 20506 2 gecesi» SPOR ray was. 8 sev pmcpas e- Soon tereand vibe or ata, 20 ns Sato Fram nape 01 ME vewary aboot ya inatiaa cerns wy PLAN esate 43 1 ee taat pared Wont packs Dubai se 038 caer yore usable ounneres Sonrossaey au 8 BUD foowes quel a oskintag feos core pore suns ES ExmeCTED CUTEOMED AND ser now the pret Dec Spee for wnaesetat 29 Mromrandusn y oes va ease DAF 2 REQUIRED ATTACHMENTS Teter ot nue ce endanerant Hor OA 1 eeeirart BaD wi pee ENT me cane) car we A anders 200808 a esaammne apn ae suey mais“ rca ie eran inn tN ar pane pages mus 90 25008 Sn BDF Rearwt A rgaramtnrs 9 2gkNe atin Se00nee ena one oiaeonis SOE soya baton Bl aguissien ROW! a0 aie pointes od cates eT propnate wiD2 1 re aOR CRITERIA eee A “cw gras en cnt a ens SOAS ant eaetnod 9 2) Re cprcopinness ona eanure SANE} i ey an pani eee OS rer Gomacunity parscazan ek Marat ey ae prt anctanen prs APMIS ine Exenson Serdren toe dean oft 8 sa phonday Pday, 2 50 816 Pama 2) wating days om ENT Fer pam Paopasainociew fans PPS"
    },
    {
        "image": "project2_synth_13_aug4.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF LA TRINIDAD CAR Corsten Atminsatve Regen La Trinidad, Benguet Extension Services Offic Instructions in Crafting a Project Activity Proposal COMMUNITY EXTENSION PROJECT PROPOSAL GUIDELINES, Instructons for Project Proponents 1. PROJECT TITLE ANO IDENTIFICATION Provide a clear, descrptve tte that reflects the project s purpose and target communty Identdy the project proponent s name. colege department, and contact information Specty the target barangay or communty incudng complete address and geagraphe coordinates avaiable 2. BACKGROUND AND RATIONALE -Deserbe the communty s curent stuation and ienttied needs tough needs assessment Gata -Explan why tna propect 9 necessary and how addrestes speafc communty problems «Inctide relevant statstes, survey sesuts. or consukaton tnungs trom communty immersion Cte references to local development plans, barangay proties. or previous research 13, PROJECT OBJECTIVES State cir, measurable objectives using SMART cetera (Specte, Measurable, Achievable, Relevant and spect objectives (concrete outcomes)- Algn objectives wih 4, TARGET BENEFICIARIES Identity primary and secondary benefcianes wan demographic detals (age. gender, occupston) Speoty ie estimated number of diect and ndrect benefsanes Explain how benefcsanes were selected and how they wi paepste n the prowct 5 PROJECT ACTIVITIES AND METHODOLOGY Provide detaied timeine of actvtes wih spect dates and responsible persons, ecanbe tne methodology for each actity inciding matarals, procedures, and expected outputs Ince plans for communty icoaton, capacty busdag. and sustanabilty Specty montorng and evahiaton mechanisms to track progress and irpact 6, BUDGET PROPOSAL Sub temzed budget wih detated cost breakdown for personnel, materals, transportation, supp Provide quotations or cost estimates from suppers for mapr expenses -Identy funding sourees universty alocaton, extemal (rants, counterpart fom community) Incuide contingency budget (typicaly 5 10% of total cost) 7 EXPECTED OUTCOMES ANO SUSTAINABILITY PLAN Deserbe measurable outcomes and how success wal be evaluated Zbianr hou the project benefts wa continue afer the project perod Kenty communty structures or mechanisms that wi susan, the mtatve Dacuss plans for knowledge transfer and capacty Duking 18. REQUIRED ATTACHMENTS Letter of request or endorsement from barangay officials or communty leaders Memorandum of Jgwement MOA) win parte communty f appcabie)- Cumeutim vise of pret team members shown reinvent experi cersinry needs essessment report or suey resuRs Location mep and communty profie- Letters of commtment from paner organzatons or agencies (9. SUBMISSION REQUIREMENTS Submt three (3) by the project leader and colege dean Proposals must proposals wil be retumed for revaion 10. EVALUATION CRITERIA Relevance to communty needs and insthutonsl prortes 25%) Clary and feasbty of biecoves Toy eeredolwey @5%)- Budget approprateness and resource effcency (20%) Sustanabéty and potential for ong tamm mpact (15s) Communty pariopaton and partnership quality (15%) sented copies and one electronic copy POF format “Al pages must be sgned ‘pe submited at east 60 days before proposed mplementation Incomplete Fortechnial asistance in proposal preparation, contact the Extension Serves Offie dumng offer hours (Monday Frtay. 8 00 AM 15 00 Put), Propasal review takes approximately 15 20 working days from submission,"
    },
    {
        "image": "project2_synth_13_aug5.png",
        "label": "projectproposal",
        "ocr_text": "TY OF LA TRINIDAD pe Ra URIVERS aria nat La Tainidad, Benguet sence stonnin Sorviens OE Oe eueemmrmnn al ary Proposal a Cratting 8 ProjectAch se exrenion oroHEET #ROPERNS GOES name ws at povde oan a i sant ACEO instructions 4 mes. tess tos oct natura eee Spey fe 19088 anu onan enue fat Repeat SOE 1p DERTAROANON, paseo! TILE A anny nn cone pooper ice erie nares oe geo Toone gaara 1D SATION TOT so sverny 6 2A ain 5 8 ERE Ma pod ow wee si Egon IE NN SMS Reversion -CBe ot 5 PROJECT OF a Te ananceae Devennment Op TARGET HENEROBRIES SE 4 yt esr ches oe Gaspar in Be seme screen NE THOOCA OTE PreMee E Sorting or once SHY ONS re aceuin, peeaaehs eae taney 89H TE end gr sect meses rota, HS ta proeees vant cat at aes EES SA et anny eS 6 ace) Caen Ba Darang OBES oe epee. Heit gn sete spncta. eae meuana qoraseis OFRETIS ie inves oa ad we gna ons emma PS de desaia wae. 90” vey ey meek 320 say aan penn i oratesnces Rania Nee een ie cance’ 8 eeecrasts «Sate ar fan watever gern ES nae, separ new eyo an vwspsnate AT tor garmerS So pose erga 0 em 5 PRURCT Eweeke ereomaninn, 0280087 sae 08 ee goo ranperans se OE ‘once oe peat Ne ALP Teieiy nara prostar yentted« ‘not BIE cian weet WD pee) aos jerAmnaResTY PEAS: RATES es tn poate eS vend saps aS saga tess ot mt OO xine acters Bn 1 Lemar ok RENT feo pavers\" Eapuin now vba sinter cust fg RECRARED AFTREAMENTS ST adsaquant sore agreement msc ero: Sener’! en mers res ony SE Spanair oT eet eyaicre RECUREMENTE, SIE eves epic a3 ea SE sor ge due Pomgoas me US ead a Yanst 0 0 fe eset ap und estictnnsl pst foes ENB “gancus roe mae sepa sigan peorat «Ba AEE 2. 3k se ee) etna am wae ated Pang, EASE ne poss menos re) commer Oh ov inonisen eu On PO Mjsporan ane eae pater psec ADIN weg me Eanes Sette drsing ate TOS ae ate, 92a wR pon subreee"
    },
    {
        "image": "project2_synth_14_aug1.png",
        "label": "projectproposal",
        "ocr_text": "SORSOGON CITY STAT Regicn V- Bica! Remion Sersogon Cry, Sor sremrrnieemmamentaneetnr Re ees srarponrnacets SESS EO OANA NO TTI Instructions In Crafting a Project Activity Proposal iOS COMMUNITY EXTENSION PROJECT PROPOSAL tnetuctians for Fajees Progenents SIMCAYION Prowse dea, dessiptics Ye tu mets tho aie i ninrmation SpeCHy te ways! Darga reams iy tha poe urenenants nave ccBegeleaerine nt, and ent ss anartnaine aware ‘ehiding compte address 2. BACKOAQNO #86 RATIONALE Dewiioa he (ota «Eira why is prope we ecssery a eauts, oF exnaubuton fein frum comerarty mnverion «Sie ize sais sae ssenent sureshy s oument soaton. enc chaste’ oud Gea f eddraenes sperdic corvmunty probieres chile restvurt snsea, suvey fe loca! development pes, Fares frotHas, oF EMGU PROUEST OBJECTIVES State cess, neaezrable objections using SME qcen dened) Datinguinh tatnean genera: sbuerives vera! gah und spate objecives ‘eorsresa nunceas!- AS tho Sestanatss Demsopmnct ows (S2Cis) and instinnonal scention miowins 1 HEREFICIARLES -Tdasty piety ard saccinlany banwtiountes ath dosmogmpiie de soe br ahs we AEet esters Hontiin Semsuiante, Achindeb mn, Fesevant ‘objects with ts age, guiviar, eonupatn? ew ey oe 4 TARG: Gevoly ihe estimated nunsber Gt aers sae maint boneteiates Fig ericate me poet Ss aictaes wits nets datas and response pesos METHODOLOGY Frvvels hata rane spectes cute «inside plone far enerminty oper try metnadeingy for enc brtehy nessti raters, s0cadures, end Seea es cancel gota, and tantainabsiy Snvely mening 3c evantabent meztanisms ta Wack progenss nod ea SRAPOSAL -Subcw Resized tude wh Setated aout Heeondene for peitenn waintinls, Herapenetion, $5 noes far map exipenaes Hcerlly nedng sais luvorsty aiouation, ese ota: cel) Prevvin quotations oF st estas fom Jrmntr, snumterpet Ror ennenunay) incase sontgeioy huskyes iysieuky &10% Ne) BUSTAINABIL TY PLAM Desesne emasimable outcomes snd how tuseens ut be erasing ced tani cororaty Ssceea Wwe exeertap ourcones Expina: how the pecs sonetis we anata fre noetrn Dnuae plana for tooateage Vance und oeuRcly uni eeerof acest or andorzzmmnt ar uanungay ofits te eon ‘Suvasaiurn eipe of pinged eam marchers shearg mIewaNE ENpCIEAE if rrr pate Lata ie pees 5 REQUIRED ATTACHMENTS eoseiity F appa) nas assesacent copa or Sowey seats» Lenton aE pins een one elazronis copy in SUE format AR pages musi he ares EMTS» Suet tian Ste sf parmanton =Insongee spatula ral ve subd ate 28 cays bef prcyate a, SuBeuaion REQUIRE! by the gnojt eater ont nodegs Cee propesels wi ue retired forever 0, EVALUATION CAIERIA -Pelevinee te axeanery rads avd ineeationa panting 2948} a ecvottotgy 25m). Budget eppropsnianess ara ses afeiency (US) Suntcrstty and goteesat for agiaan iensst {894} -Communty gatiopation ana ssrawsie quety 15%) i preental pregamton, covtast the Extension Sensees O venting dey Hem scree. say acd foaneiy of vbveties or teennioalusssiaes sta duce cote house Moncey Fey, 6 90 AN 5 06 Pia, regoaai evn taken appemerainyy \"2:"
    },
    {
        "image": "project2_synth_14_aug2.png",
        "label": "projectproposal",
        "ocr_text": ""
    },
    {
        "image": "project2_synth_14_aug3.png",
        "label": "projectproposal",
        "ocr_text": "SORSOGON CHTY ‘STATE UNIVERSITY Resion V- Biot Resion Sorsogon City, Sorsogon rE Instruction: In Crafting a Project Activity Proposal COMMINETY EXTENSION PROT PRG) natactians tor Prince Proponents, POSAL CUE LNES"
    },
    {
        "image": "project2_synth_14_aug4.png",
        "label": "projectproposal",
        "ocr_text": ""
    },
    {
        "image": "project2_synth_14_aug5.png",
        "label": "projectproposal",
        "ocr_text": "SORSOSON CITY STATE UNIVERSITY Racin V- Bicol Reuion orsogan City, Sarsogon Research Sttios instructions in Crafting a Preject Activity Proposal “OMRRUNITY EXTENSION PROJEGT PROPOSAL GUIDELINES Instruction: for Pact Proponents +. PROLE rienty ‘neki compas acre: OF TITLE. AND DENTIFIGATION, brows pegnnents came velagavenarmant, sd contact intonation Se nd gogrenne ccentnate: MALE praises nacessary ane bow ta cava a lnur, Nesnionce te that reflects the proms amaze ane tempat somunay= =the iguget aararigay 9¢ sera 2, BAGKGROUND AND 2A resus, cr azul vessoreh seserze the eatamininy s current station and sosus sprite sorimunty emblems nev reinvent stats, sone tins eats hough mange enzessiven nt ings tem commun emerson Cie rafennses wo tee! Geveloomsent plans, harongay ptolses, a7 previous oa Tae touivi) Dsinguish between geneca! objects (ovasal gow) and sree ubjee IES -Stale lear minzivnnie anmovvns uma SMART evtems (Speci, Mansumbie, Seavadie, Balevan 7 GREED Een STE sk priors 4, TARGET BENEHCIARIES hlontfy prmry ancl sacondaty bunefisnes wh damagranini: datas lege, 4 se [Spenty the eximatad nuinher of cvaot and vitonet penatinstes Caplan Now vsnnticanas ware calecteg and how tay a portspete ithe paket 2. PROJECT ACTIVITIES AMT METHODOLOGY Desewbe ie metandeiogy fer ech 90h patipation, capaciy bulking. and susianahsty Spec; mantoring ana eeituation meshenisns a vz ovate denasas Haine of aufsins tn epsetic dates ond raeponsiie nevone fy erasing mginnats, reoeauies. ad atpecind outputs Indude Beans for carne ic p2gr058 a ©, BUDGET PREPOGAL Bulent temizesd oudyet wilh detesed cust Creation forperwonna) waters, avavocation, supiee Feivaie quatations or east asuscatas fam supplies for majr expenses ilantly fonaing coures (univarsiy adocatin, ener feamts 4 oie, 810% ot {EXPECTED OUTCOMES ANC GUSTAIUAGILITY PLAN Dasoite measutshle outeumes and haw sucerss wil be evanseted Eoiehs how ine poe: Eenesis wl sonines aie: fn projet send leks Sonmmenty sieauras ar mecvar aan Matin suet tne ntti Deasuss pas for eraniatlge Sarafar and sapacty euling 5, PEQUIRED ATTACHMENTS -Lettar of mequest or unatzensent fem Serangay offoias or eam Aagraeenent MO) lay eaters -Meinovansum a sv garner ome ury appicnbiel- Daneouura view 2f proc! tee mmarvuere smeusny yelovart exper Coresirty comca asvesumant spon nr sunvay masts Location up and eemiminty pre -Latieis of eonemienent faim waren pogaistane ov aganare 9, susiissiOn: fay the sraieet nade QUIRENEENTS Sune nee () ged caviar and ons mincronio say n POF fet Ad pages mci ba signe “obey dawn -Procorateavistne suposed ot ieoal 30 days bafore proposed mraiemaniatin necnmiete Fone Sows eT 10 EVELUATION ORITERIA Ralevanns to curruniy nents one Suitzulnnaprnttian (25%) Clans aed tease of cbiacives sosdoany (28%) Suligat anr opsiate Sustainealty anc poteetalier en: Sin} Community astesiunn ano oarnmane quasty 155) fess und suzinutea aersny (209%) varaset For textes! vesisieney psnptea) praparebion, ourtuet tie Emeasian Santee Diss ung off incurs Maney Fada, 2 90 AR 5 00 his Pragosat caview takes epiroriniiely 1229 oulkng days inn surmenaion"
    },
    {
        "image": "project2_synth_15_aug1.png",
        "label": "projectproposal",
        "ocr_text": "ILIGAN STATE UNIVERSITY Region X- Northern Mindanao lligan, Lanao det Norte Communty Outreach Office Instructions in Crafting a Project Activity Proposal STUDENT RESEARCH PROVECT ROBOSAL FORMAT ‘Suones ty UnryanuneResexcn seonay 8 96050) erase aroy sense 25 ree amar vet ne Resexcncce st rosa 3 Sat res 20) ergessien ses soraconmeasetncarege oyna ec acy 20%) clay ans"
    },
    {
        "image": "project2_synth_15_aug2.png",
        "label": "projectproposal",
        "ocr_text": "ILIGAN STATE UNIVERSITY Region X- Northern Mindanao lligan, Lanao del Norte ——— ee Instructions in Crafting a Project Activity Proposal ‘STUDENT RESEARCH PROUECT PROBOEAL FORMAT Cooma Uromyanate Reser Peas Fra oe nes name NUNN IR 6 ERED rave set ONS ae eects pnt ct Iran pny seater ex and senate of ean. Dae namson Fees Maer Bers) rosa acorcua urna cereale CIE meaRsOD, ec aI PAE} Temt Te reer ape Z ATIOOUCTION 2.) Presa Pe cat ry cree var Bane- Pea pee Sw spoT ra pane (Sgtcace ant pore carton Pw Hy Dene cae ore ee ne 4 REVEW OF RELATED UTERATURE (pages -Cont compre even (Use APA Teton tema a catow Rouse Dom aed an eran S RESEARCH OBLECTIVES AND QUESTIONS Sate pa an eects Poe Ser cece, er ats (5 THEORETCALCONCEPTUAL FRAMEWORK: Pasar are coca \\aranes- Egiannow ne ravewar guoe Pe ey san aie reecrt Peet COT and prea ase Symeece ara Dey a nro pare wn Peers ces Forme er eure ganton parses ec Pere gre eee ry Pm eae Oevtop cops Yarerk Sayan wowing eaRoNpA even .RESEARCM METHODOLOGY SA TS RE (Qa. que. mined NO) -Drae san ase ap pan gan apy MGR (PSs 628 ETON KT TSA TE (QAMINTE Pen QuOh Euan ence Deseret cleo ares mone. Cae rary cgi (Sante ts, neato ayes.) Ames ena enw ah Ing ared creat creas) {EXPECTED OUTCOMES AND OUTPUTS Dasara isp ets PPO IRON Sp RPE UIE OI) ay ‘ecommenaos)- Exam tos tangs we corrade ecg owes 8 PROLECT TMELNE (art Cra Provan ates tne eae ras am rnc rapa Ty tne Popa meny. Os Catan (2 mores. ay 1 mney, Weg (2 mae) 10 BUOGET PROPOSAL re rei eres OU aw, rsa oa sayES WAY egsases (prio. ens) esarch t era ti) Asa gaa ma woes CARI 500 pe 1 REFERENCES- usta tad tacet APA Tm eaten tna Enum erro oa rev Nee, Da SE 12 APPENOICES- noun ratrecexcr mes (gnsomare ie 94a Prov red wert ams eG CGR AN ACN ESE pon ro resent ue ce ie reece and ane ‘FORMATTING REQUMEMENTS:- Pape 02 At (4511 no)- Font Tes New Raman 12am pao Dasseseaces es se pak se at eres Marge: noon Sass PanuRONS Son crt acme RSG ay Ty ow {SUBMSOON PROCESS Somstrat aren antral ei 2. expr BG Rea ree opens 2 SN ree (9) pao age rue omar reer rnc print ea cine aro 8 Upon anova poses eis reve fining RENIN eC Proce eee aa ROSS Ie Se (27) Le reve 9 (2) MemaNaO aS (2) P27) Cay ant ogra Ps) ror guns oping reearen is resect ne Rees Ec Carmien ee ry 48L9N ot he Rese Ce"
    },
    {
        "image": "project2_synth_15_aug3.png",
        "label": "projectproposal",
        "ocr_text": "ILIGAN STATE UNIVERSITY Reon X. Normern Mrcanso ligan, Lanao del Norte Comemunty Outreach Ofte SS. Instructions in Crafting a Project Activity Proposal ome ray ana tna roms CORR PAE ren ere) name compet FNC 4 maa Se ot nanos tin mi aera pan ret cern Sot nanenc a uiueneie Fearon Omg hreae PARETRACT Mane Seam MMAR Reena) FTemRT paeT met merORED Eom Re nou >See ent De DNTRCOVTON 2 Rm NE 1 recom FH mT eT tae Pe maT TaN Ou we Rem ee Een he leper re pares cowa 2 he is) Dee he me re ar he ma LACH OF RELATES TEATUAE Snag Coast angen toes Sent her orem ne pe Sube SrewRSN Me LY EY me fe me ean oa Botner noun ae ae remernae trom nares ote mS ae S Reseancn GREETS ANS QUESTIONS me prs enc: sme Fam oa Stree Ea Ey pret LMEORTCACNCETUA RAUERORE Reet rer 9 ore pay te mR Sees sre Paneer Sayan wong earwne ee rape toner Pet ene quam Pe ey re nae 1 Resesncm WETC0O 06\" Seno en meg aren Saat 9 met terUm) mrE MeeT ee rep MOUs Cos Unery moe ouange eae meen Oe mars renee mre carves jm mee oe Seren aes pect Fannie Renee Boas aes (reyes terran cane tam Pavan ayes oe NOP STU RET OLIN Med COUT Fe BE feorneuae gant hay on arrange W PROMECT TENE Ge Cut Sov ane bnew ea ma ue ton pe Eh Be Type Pew as mm Os Co 2 meee Mayen nae ey tae ROGET RCRA, Nem Hm eae roy na Fa a EN Say mo NRO nro rE Tr FE eee rary Hear an ma more emg 1 om ROE: Lee eta A ems Deen sree rary mm mee Roem etme ares Dame re rete Ei onckcdieaslidhectdadteadimoaptindne eeiiahenenatattantteeaaide ome Pomuarrig REQUMEENTS Pum wan AL EY rome) Pat Tras en Ronan 130 1 Saag One Scat Mo eye eS Seren Maye none om Pap mons Ret ree Mar ke a 35a OG REI DumnON PROCESS Darra mma ene Ty vee rem vA Mea eee FoR Sere frme Ore One aN (nee cara Oman 9s Yee ee come ES Jor ae Pome Cac wee Py A se"
    },
    {
        "image": "project2_synth_15_aug4.png",
        "label": "projectproposal",
        "ocr_text": "AN STATE UNIVERSITY Xedos tin igan, Lanao det Nore Coram Suareaed eran cinco enumne instructions in Crafting a Project Activity Prones: a usr mung aime Soa cpa ij Mo enterces- Noa LERNER OTE optiewsesisacena tras areca Cele nesoineainensetre: mee ST END Merete anetE USE nea A agen sangre geome stow clan args ws sae ao Gama se resie masse tnayass pens ‘3 Page oar AEB Home Aek Tres ioe ata, Hea: Bion) Souteate ees) geome skew SPOR MarR ED Hom. BaGETUMEES BE BERS ge aK NRE Hn er 04 SS ODE 1 Sams maMSeRseen wane ER Sa ogee 1"
    },
    {
        "image": "project2_synth_15_aug5.png",
        "label": "projectproposal",
        "ocr_text": ""
    },
    {
        "image": "project2_synth_16_aug1.png",
        "label": "projectproposal",
        "ocr_text": "MAKATI STATE UNIVERSITY Makati, Metro Manila Consmussty Cubeat Otic “sevreconnctrae een mrs een ene trate etter nes instructions in Crafting Project Activity Prapass! SORRILNTTY EXTENSION PROJECT PROEOEAL GUIDELRE lesiuctene tn Project Prosar: 1. PROJECTILE AND MIEHTIBGATICN «Proves aear dosaiptve tes hie ian Hie prgnat s cumeee and tage cmrunicy iientdy tie mejact arsonists come, sadegaitanericist, ond ountael amsitan -Spenly the larger bareigey or eeorcnty, ‘nakusing so phvle nadiess and geoprantie soomtinates wreSaoie 2 GACKORDLND ANG RATIONALE Deve the ounemurdy s eurant stuaion mid alerted vets Ueough nawde aneeeemet ‘thin Ep wip tun sojnct a nanaveniy nd aw oakheace anvetie cawen nly gattams insaie ievant satorke mer ey svat, or aensutatan Pring tom ceaerinty Gamers Tite tatemmees to oval Se awiepreut aaae Barangay neaties oe partcus seuss 3 PROACT OBVECTIVES -Sinte cna oussusaiin abpctives using SMA oad SGpwike. Nussomie, Achiecn ie, Slee, Fase saeco: ftntgwich aeteren gas! optus iomerah goal and Setse uheeloes frente cuteariea)- Akon oblectnes ah ve Rusionuty Quewprant Soa’ Oe) ane matirional exianon proven 4 TAROE? BENEFICIARIES -inentty pomey ses saesivdery Dantes wih demapctin State hepa, gure, caxagatian) Seat the extenaied rami: of Newel wie insint Renatanes Extn hi beanies sur sateen have Bory orb areipaie m tie snacone 5 PROJECT ACTIVITES AME) METHOUOL OGY -Prevsie 9 deteion twine of wutvdes eh apace dates end wearin gement Barong tos matieoingy for wenn wetiey reiting matesals, gazedwet, ant gepeta Gudsite Insude sane lar epmevonty, strive, ssaanty buiting, and muininissbay Spesily moncnang and aveliaton mechanisna to bac pogtens ard aeons BUDGET PROPOSAL «Suomi Rmnaned budget ith dvtoied ones Gmakdoue far purser, meterais, exranataton aupptes~ Prema nactertons or cost wstinaion tren wupohers Ia: major excanses -aRrity aang soutses Gommersty aiceotnn, externas ‘gc, counted tenn someunty) Incite aontenyenn tuaget yeaah EER, of tsa! cans) [EXPECTED OUTCOMES AAS SLBTAINABILITY PLAM Desere maasiinbla suiccnes wad hos BioRse Wis combinted Braien hi the gage Baretta mil corttive afer ihe prin pases Migntty Somwsniy Srsoane ox machanane fat ea meta on nintis heaves inna for eneadacie masts wo sep ung 4 REQUAIRED ATTRGEAKEATTS Lats af requnct oe andoramant iors barangy Mfc or cunemanty leaders -Bicoowutrdue af Agtwesnant isk) «md animes nunsmunty f onwnreie)- Coiannan vise of projet sen merous thowneg rsevent ercerive Semenuny nesds xssesanient rer w eurvay ants Lessin miny an Gomavuniy praNa ~Latbes ef samebeant tam perbiae oaenbanans gragenoee 2 SURERRSION REQUIREMENTS Subrst muna (arnted copies ad ang etecbenis copy PRE formset Ai sages mutt aqme! ty the proet wader org ovtupa dean Mopsnis must be subinlied ot iast £0 dae Kelomn prmaceed Eglatemanin Mowplate royals WS he voted Sor ton 1, EVALUATION CRITERIA -atewence to eomsmunty needs and itnuteons! paudies 12894) Caaty and tease af sipctines a mrs ogy (25%) -Busigat sacmuetnness and renounce wliaency QUM}. Susransniy and gotenta erlang i pa! HOG) Communty pesiegstan and partrerahi Quatly (135%) Foc tecmaiza seaitenes ia pmparsl preseaicn, aostac ine Exteraion Garces Oe Siting olen bum Wianitey fete. 8 08 888- $08 Hd, Propcast nevans wees maprasimately “OSI wnting Enys hem scan"
    },
    {
        "image": "project2_synth_16_aug2.png",
        "label": "projectproposal",
        "ocr_text": "MAKATI STATE UNIVERSITY National Capital Reaion (NCR} Makati, Metro Manila Community Outreach Office Instructions in Crafting a Project Activity Proposal ‘COMMUNITY EXTENSION PROJECT PROPOSAL GUIDELINES Instructions for Project Proponents: 1, PROJECT TITLE AND IDENTIFICATION Provide a clear, descrpive tte that reflects the project s purpase and target communty- Identty the project proponent s name, colegeldepariment, and contact information Specty the target barangay or communty, including complete address and geographic coordinates avaiable 2. BACKGROUND AND RATIONALE Describe the community s current stuation and identified needs through needs assessment deta Explain why this project is necessary and how it addresses spectic communty problems Include relevant statistics, survey resuts, or conutation fndings from community mmarsion -Cta references to local development plans, Derangay arofies, or previous: research 3, PROJECT OBJECTIVES State clear, messurable objectives using SMART enters (Spectfo, Massurable, Achievable, Relevant, ‘Time bound) Distinguish between general objectives (overall goal) and spectic objectives (concrete outcomes) Align objectives with the Sustainable Development Goals (SDGs) and insttutonal extension proties 4. TARGET BENEFICIARIES Identity primary and secondary beneficiaries wih demographic detail (age, gender, occupation) Speotty the estimated numberof drect and indirect Deneficiares Explain how beneficares were selected and how they wil aricipate in the project 5. PROJECT ACTIVITIES AND METHODOLOGY Provide a detailed timeine of activities wih specific dates and responsible persons Deserve the methodology for each sctivty ncuding msterais, procedures, and expected outputs -Inclide plans for community Paricipation, capacty bulding, and sustainabilty- Specty montoring and evaluation mechanisms to track progress and impact 6. BUDGET PROPOSAL Submt itemized budget with detalied cost breakdown for personnel, materials transportation, supplies Provide quotations or cast estimates ftom suppliers for major expenses dently funding sources (universty alocation, extemal ‘ants, counterpart from community] Inside contingency Budget typialy 5 10% of total cost) 7. EXPECTED OUTCOMES AND SUSTAINABILITY PLAN Deserbe measurable outoomes and how success wile evaluated Explain how the project benefits wil continue afer the project perad Identify community stuctures or mechanisms that wil sustain the iniatve Discuss plans for knowiedge transfer and capacty duiking 8, REQUIRED ATTACHMENTS Letter of request or endorsement from Barangay offiials or community leaders Nemarandum of ‘Agreement (MOA) with pariner community (f applicable) Currculum vite of project team members showing relevant expertise ‘Community needs assessment report or survey resus Location map and commun profie- Letters of commitment ftom pariner lorganiastons or agences ‘9. SUBMISSION REQUIREMENTS Submit three (3) printed copies and one electronic copy in PDF format -Allpages must be signed by the project leader and collage dean Proposals must De submited at lass! 60 daye before proposed mplamentation- Incomplete proposals willbe retumed for revision 10. EVALUATION CRITERIA Relevance fo community needs and insttutonal prrties (2586) Clarty and feasibly of objectives ‘and methodology (25%) Budget approprateness and resource effcency (20%) Sustsinabity and potent for long term mpact (158) Communty participation and partnership quality (1586) For technical assistance in proposal preparation, contact the Extension Services Office during office hours (Monday Friday, 8 00 AM 5 00 PI), Proposal evew takes spproxmatsly 15 20 working days from submission"
    },
    {
        "image": "project2_synth_16_aug3.png",
        "label": "projectproposal",
        "ocr_text": "MAKATI STATE UNIVERSITY ivoeat Canes Reedon (ROAD Makati, Metro Manite Gsenesanty Quurrscr Otte icone et NEN NEA MNOS NOREEN MRO ETON instructions in Crafting a Project Activity Propose! SORA EXTENSION PROSEGT PBOROBAL CAADELINES Ionnsotions bye Eanes Prose: 1, PAGE? NILE AND IDETICATION Panvate a cleat, danoietive te thet weitcts the prsiets puroaae an Gorge! samen Icantty ine progect prapanents nove, code goicaparmtens. acd ayrist eros Sac te target hacwrsay coma ipanaing eoeuiets sddows ss geageanin coardnatan é gant 2 BAGKEROUNS ANG RATIONRLE Drosera the carmavity2 que staztun and Menthe! seeds Dmg needs ansestoe ota. Baphin oi #09 pret b oeoR UAE ame Naw ademanee apectin soneush ty gins tnuaika vEsR SABES, HVE dee ce rrcarautmnan feainge som snemuity meron Cha vefentnens tn cai daveinuiman pias, EARENGOY MEARE, Of pred oreash 5. PROURDY ORECTIVES State ower veasucntin tojnctoge usioy SIRE ster Gpacte. Howsrabie, Aeninsata, Renee Toeound tolajuan aetemen gonyndl objectors (Berm ge) ard apmatc eepartints fnenerise eizar} AEE aK far Suremabie eveiopen! Goes SiGe} ane aathsisna’ extention Omaeties “A TAGE SEREFICLARELE Met wsmary and seseidary Beveteanes 2A dangraphic winks thus. genes Uceupaion) ‘qeonny the extnatec coder ef act ood inieos unareimeas -Exiain Yow bunetaensn nurs aac’ cod naw ay aA potopete GO pre PADILET ACTIVITIES AND MEYHONOL IB Prove a dnteded inwine of acs win meal later ans nearensiie Desert canbe the metvodaings Sat each meneky Poking slatarate, gopoRStaN, ae anges sutguis thsa pans er onan ts SRE caamsty batten, and oevtonabty S90 Perénenig nnd ovetuntn mecharrans 9 Neh eras ane et 0, BUSGET PROPOSAL Gut Memined uci wth Stated vant areskdann for jaresamel ontariah, weeponaton, NoRpaet oer eonacn or ont achonalen bm soputart to agit ances Kinny tanding source (anlearsy aceon, SAAT Gennen countess fram armani) leven conga ay ntped type BED oF eal 2st) ATY PLAN Onseane aneaemiie guises cn how suounes ne he evacuated PECTED GUTCOMES AND DLSTAMAR: Be (ict sak contrive aber tre owe aaved oer SOrnty AnurtAreS OF NETHeTETe OK WE Beco fen wag Dawe par’ fre ewe tea en capa baking 15 Lene af aust et exdarsenent tom Lamangas ofixin a1 canny modern» Masworanturn et Ge arpteatien. Cuseyhus wise 2) project teUrn asics Breer einaw RAGE Lomesor reap nest csws rity poate -batacs f crneen paring 5. RenUIRED ATTACHING! grewivert a2 wih untner ety men raed RESeSUNeNS EOL GS BEIVES ABUTS arygnteatons oF agencies 8, EARNS SION REQUIREMENTS Butvat thea 19) paras oxplen ond ane wirtar s Bee craees wecar ona eninge azan -Prpniais mest be subertiad at ant $9 dawn Nevo eropouetl prosoeeis aba rezeied for aneRen {O. BUALUATION SATTRRA stylpuanee ts animus aed auton dnd suthasaiagy Q5 e)- Bodyer apzcopmatonens an cause atten (20% Srcamenny wesiipaten snd nacessiig gow CW) Forteshiies! antinnce ie groawaa pepeation, cuntecr we Geiaasion even a fo waring deys hom subrooan. moe ROE hone AN agin ase he Seed imolenenaitan «Insane eactts PO} Cena an Senaioty 9 eons ‘Burtmeabaey an wean! Sor ong tere area thew dng sta huns Money Peay, 8 ABR"
    },
    {
        "image": "project2_synth_16_aug4.png",
        "label": "projectproposal",
        "ocr_text": "MAKATI STATE UNIVERSITY ‘National Captat Region (NCR) Makati, Metro Manila Community Outreach Office Instructions in Crafting a Project Activity Proposal COMMANTY EXTENSION PROJECT PROPOSAL GUIDELINES naeuctont for Propet Proponents 1. PROJECT TITLE AND IDENTIFICATION Provide a clear, desorptive tte hat rfiects he projects purpose and target community ldentty the project proponents name, colegeldepatment. and contact infomation -Specty the target barangay or communty, _netsdng complete address and geographe coorinaten f avaiable 2. BACKGROUNO AND RATIONALE Deserbe the communty s cument stustion and stented needs tough needs assessment date Caplan why toa project necestary and how addresses spectie communty problems Inchide rwlevant statstes, Suey ‘evuts, or connutstion tring’ rom communty mmenion Cte references to neal evelopment plans, barangay profies, oF Prrvous, ceseeen 3. PROJECT OBJECTIVES State cee, meanumbe objectives using SMART ertere (Spectic, Measurable, Achewabie, Relevant, Tme bound)- Datnguah between geners! ciectves (overal goa!) and spectie objectives (concrete outcomes) -Algn objectives wih ne Sustanatie Onvetopment Goats (S008) and mattvtonsl extension promes 4 TARGET BENEFICIARIES Mtentty pamary and secondary Denetcanes wim demogrshe detats lage. gender ccovpaton) ‘Specty the estmated number of rect and indirect Denetcanes Expion how benetonses ware selected and how Mey wit panepate m te project {5 PROJECT ACTIVITIES AND METHODOLOGY Prove detaied twine of activites wih specie dates and responsible persons “Deserbe the methodology for each activity nckding materais, procedures, and expected ovipuis -Incude plans for community penopaton, capecty buiding, and walanabity Specty mentong and evaluation mechanams fo back progress and impact BUOGET PROPOSAL Submt temazed budget wth detaied cost breakdown for perionnel materai, vansponation, supptes Provde quotatons or cost extmates tom supper for major expenses dently nding sources (unwersty stocaton, extemal (rents counterpart bom communty)- Inchide contingency Budget Qypcaty 5 10% of iota cost) 7. EXPECTED OUTCOMES ANO SUSTAINABILITY PLAN -Descrbe measurabie ovisomes and how suconss wi be evaluated Enpion how tre proect Donets wi contre after te pret pesod -Identty communty structures or mechaname thet wi sustain ‘he mtate Onauss plant for hnowiedge tanater and capscty buking 8 REQUIRED ATTACHMENTS Letter of quest or endonement tom barangay offias or communty ade: Memorandum of ‘Agreement (MOA) wih perner communty appleabie) Cumeutsm vase of project inam members showng reivant experine Communty needs assesement por or suney remus Location map and communty profie- Letters of commament from partner omenaatons or agences (0. SUBAASSION REQUIREMENTS Submt twe (3) printed copies and one eiectont copy m POF format -Al pages must be signed by te proc ender and colege dean Proposals must be submatied at wast 00 days befow proposed implementation Incomplete prpotan wa be retumed for eran 10. EVALUATION CRITERIA Relevance to communty needs and inathutons! proses (28%) Carty and feasbity of objectives tnd methodology (25%) Budget appropateness and resource efficiency (20%) Sustanablty and potental for long term pact (15%)- Communty paropaton and pamnersne quaity (18%) Fortechnicel assatance mn propos! pepernton, contact the Extension Seriees Oftce duing offee hour (Monday Fay, #00 AM 5 00 PA Proposal wvew tates approumately 15 20 wong days tom subemson"
    },
    {
        "image": "project2_synth_16_aug5.png",
        "label": "projectproposal",
        "ocr_text": "MAKATI STATE UNIVERSITY Hater! Gactat Reaton (NCR) Mekati, Mewo Manita Comerunty Outreach Oe Seren nnereenerenenemanernesmeerae anna ener teres esentertensetrneererene Instructions in Crafting Project Activity Proposal COMMUNITY EXTENSION PROJECT PROPOSAL OUELIES asoueters to: Prope Bureenents 220uph neece wumensownt Exoian why Oi pegs ne oartaty and Now A eddtmsses wyazsir comemurnty probieme incude tlnvane tutton moeee EMS 67 consurtetun fring: tee commury inmarvon «(te mtennces te inoel deveioarwet sem mecnagey prfnn, omen veveaicn 3 PROJECT OBJECHIVER State chess ma aumnadie chezivos using SMART exten (Specks, Meaniisie. Achievatie. Re evant. TOR Datt Semmavin batwwan panera chceres tore geal ent wwente abitetnes foonente vurssmweh. Nar ouipetoes athe the Suatkinedie Dovelooment Gon CIUGa) and m Autonal ealeneion prccees SLIROE BENEFICAMES «Soars porary and wocondory borwtcaren wth Gamomepnie dates ge, gender. cooupatin)« Saecti Be esr stas manor of deuck and rtheck bonetenses Eaplan iow benatcasen wer tehcied aa how brey at Dameeete nme ceopet 2 EXPECTED OUTCOMES ANG SUSTAMUABAITY PLAN. Deseo ane: Exton ire he orject Boras ll monte elie te ‘Se ntintwe Dineute plans tor anoamege easter ara capac bultieng -sunin outers ad Doe SUCK NS we De oeatuatnd Drsect Deed -Ientty commachs eruchuws oi machonane Bato westae 10. EVALUATION CAITERNA Reiovence to FN aanee, G8) Busaet apcreuraner ens ane maaan ctauncy LON). Suntamabty ond patent’ tr megs ropneh {18%} -Commmunty paneipeton and paersp guniey (15%) Fur meno wasrinrcs in oregon pa pemtion, contact the Cerention Santen Sten 5 00 FAN Propose enw tans enprieaialy 16 20 wating dap tom wuemnvion tg aot Moun Monday? iey, 8 09 AR."
    },
    {
        "image": "project2_synth_17_aug1.png",
        "label": "projectproposal",
        "ocr_text": "IN Crating a Beene eAetiviny 9"
    },
    {
        "image": "project2_synth_17_aug2.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF MANILA Natori Copia Regier 186i Mamiis, Metre Mesila Commsety Outreach Ofe9 ‘meicrnntenenorcssincaammaatnariamanerane instructions in Crafting a Project Activity Proposal COMRMUIITY BXTENSION PROLECT PROPOSAL nettiinns ee Papas Progancnic PROUECY TIRE AND ICENNISIOR TIGA Pinsety a aay dessptin oe that rataats he projsct s susan and semgot ray» Adersty te proest peupenents nome, cetageidanunent, and contact mscconaan Specs fe tage rang a7 concurs, reusing sonnet airéerny a gungreghie ocannaaey ree JDELINES 3. 9ATKGROUNE AKO RATIONALE Gonatee tne communis som! station mn arta meats throagh needs ataasomect dana han wig Bis pouptct a peonanaty WA Now eddmaeD ape cum Janke. eae alent Sti, RIN resaha, os narensteton Anes tn Sor enenyinomac ea mbeamnsts 2s See daveepm Dank, Douay DISHES. Secs 3. PROLEST CNsECTH spasth oxtawan grow! ogjecticns oem qauh ant agate weitere. feonrete icone) Davezmnwn Qoiss COese} wis msvssonsi eenten pastes 5 inte ear mewn otpiatios wing KUAART cates onets, Sexsenin, Kerinesie Palnanat, gn nee CNEL RPE -\\dnoly pcraay and uecendiag menofciades wth demagiaatie drat (mie. gensdos, socom). Spncts te asistad numa’ of Seats ais mobest Senatewnay Eagles Now bawetaoaice waa seated seat Naw then We pate 0 ie greet &. PROJECT AGT: 1 SE THOOLORY Powsida detain toegine of aetutne wih samintin ates arn expansive pert Desaine the nethardiciy for emsh neity mesusing mateials, proousute, ae Orpacee wpe» ietody Hans He aomMNT Ty Deniopaten exnanty buldng, end DusianeDAny Spey onharing and avaiaston wats (9 tak pints end akc! 4, BUDGET FROPORSL Evens Huon Suaget vate dalaton nat Sreasdtown for pertennay malar, Panseriase%, supNeS Deeds qucratans cf cost entities hath Whats Sr Mabe eepenser —eaNihy tuncing ractoes (unmareds abecates extesra ran, eausterpa ron Canna} ieaaue contopency Badget fypicaty SLO a te) soa; TL RNDEOTED OUTCOMES AND SUSTAINABILITY FLAN -Thscioe veesurabi ovicimeg and has suorens ab oa wvunuane Ban nae ine soap Senetts ocx oferta parent pevon ENE COmeAIMA SUTIUTER oF MeCN thee Ww cstin ‘un nines Dineues glare womnasege ieees avd capnaty DARD RERSED ATTHONMENTS Lather af que sc endomanient tem pean stents ocstanumnty means -Mnenntir9 of yueeraers S2SA) mit cara: comereane [f agenstin)- Curt vine of ag ae monmiees doing Relevens expactis@ Soomonty mens aicissmont ges a see; Mat -Loanion map ans oommosaty prafbe Les of aserntimnt ent parines ennzatins 86 gare 4 SUDLESSION REOUMENENTS Pabst tose () pines ouenes and ona slectrets cats m POE feomet ~All pages mest va 08S Gytie pated acter and cadapa Onan Proposes amet be auhdied at east 8 days Bite mexpand onphenbeten Eran ete pecans we hone fer rein 10, EVALUATION CRITERIA Maiauanvn to conmundy needs acid instinteone! atierien SN 4) «City wd iewsiniy of ejections na metadeioay C55) -Shrdget aparoptatenese rnd magure atisitncy 20%) Sauiamaibiay ss patentin for ang tom expect ‘VEN Snseenanty pactvgaion and params qty (197) Fer terir joni ansictance in gropoest repent, cantacs te Eatenaian Servicay CMtew demng sites hours Montay Facey, B00 AB [Bil Pat, Paopoval devas: takes mggrorznelaly 1S weceay cys to subs"
    },
    {
        "image": "project2_synth_17_aug3.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF MANILA National Captal Region (NCR) Manila, Metro Manila Community Outreach Office Instructions in Crafting a Project Activity Proposal COMMUNITY EXTENSION PROJECT PROPOSAL GUIDELINES Instructions for Project Proponents Location map and communty protie ‘organizations or agencies &, SUBMISSION REQUIREMENTS Submit three (3 by the project leader and colege dean Proposes Proposals wil be retumed forreviion printed copies and one electronic co ‘must be submitted atleast 60 days BY in POF format Al)"
    },
    {
        "image": "project2_synth_17_aug4.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF MANILA National Captal Region (NCR) Manila, Metro Manila Community Outreach Office Instructions in Crafting a Project Activity Proposal COMMUNITY EXTENSION PROJECT PROPOSAL GUIDELINES 'nstrctions for Project Proponents: 4. TARGET BENEFICIARIES Specty the estimated number arepate in the project measurable outcomes and how success wil be evahated ; identity community structures or mechanisms that wa ean forknowiedge tansfer and capacty bulding Submt three ‘and colege dean Proposals ‘Proposals wil be retumed for revision 10. EVALUATION CRITERIA ‘and methodology (255%) Bud (15%)- Community participa Relevance to commun ty needs and insttutonal priorties (25%) lget appropriateness and resout ton and partnership quality (15%) Clarty and feasibity of objectives roe efficiency (20%) Sustainabiy"
    },
    {
        "image": "project2_synth_17_aug5.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF MANILA National Capital Peron (CNY Mani a, Meiro Manita Coemensty Ouse sats Of instructions in Crafting Project Activity Proposal Spec ect OBJECTIVES Sake at, neonate suas ed Sooptores (ave goat and 908! Jane round -Onteipian voranen gener Tenis 004) and eatastonel eiansion BREA 4 TARGE! RERSFIOUPIES rion gy pan we socanury vaneteowne 0 srrerpie ttt Gn SOP SEM) Cre a esatsetay Ergin a vanahaies 9er somens ond nse Pe eB patente mine prope! promos deate: irate of sees wn sone eatee and gente nat SL PROJECT ACTINTIES AIO METHODOLOGY seceaucns, ond expnttes cute ncvae pins ft CONANT mechonaess 1 tack ODT BO NDR ptahsewn fo: persone imate, PaNEpCeIin®. SSPPAED* Meoatty toncneg sources (ssterty Aare”. enters 10% of tate eos) 2 ornare ino STANT PLA QUADS a ra pests ri eon es Naeaady coment, Hseidet oF MAM ne aesiantve ‘ono puts ieher ne mst oe suama poe ty perind sein an erence ogy 0 POE tama. 4p 8 SO Oe can maw be wnrieed steal Oday rte mapas eperetne> imemoetn carey and tant of cates \"Suro abéty ane potent for anQAnen OS"
    },
    {
        "image": "project2_synth_18_aug1.png",
        "label": "projectproposal",
        "ocr_text": "F Ti eee Secon 2"
    },
    {
        "image": "project2_synth_18_aug2.png",
        "label": "projectproposal",
        "ocr_text": "RST Rasgion Vil C2 Tag otfee in Crafting a Pro} cliActivity Propes Y OF TAGBILARAN dilaran, Bonet deat Ais eusdeuteetynone ctegeapaenen aN! tHe ee cy eres ade NETnE Td enh RoE NF sjuion seh eug me shunsconaeenay Senaseyy Hird ashe ssbpting sips tanks sei ashen: meposns see pang cya wero sera agyan eonangraceansicses) canvaxpiomsesy- haan: eee 3 aprecusioner mec ye Minwraog sane om. Pano at"
    },
    {
        "image": "project2_synth_18_aug3.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF TAGBILARAN Regn Vit Cen Tagbitaran, Schot Office of Steseni At Instructions in Crafting a Project Activity Proposal session Samy axholnyee waver ear aoirepamttie qi agnrea 5 Foran rapeseed ase Stezenraien egtemn tans ueneRiorn gases Mean crac OH Seca net. starsnne aris oieisenaeisg. ngrerseae eee atH8 pI se susvanss trreyar aoyan sowrpsestonncn an SNES TSE TBE ONES SPRY RI RR PN MOY nga) rksucheneitesowvSoptem ie Tgonaton ctsinarte ain: meme saves peso cnewenyremaEI gn snes ta ay SNe NDEI csvaniyes acsige naz nog coinme ren gown atupo 9 vetteRaen oe"
    },
    {
        "image": "project2_synth_18_aug4.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF TAGBILARAN Reaon V- Gancarneore agbilaran, Bohol instructions in fing Projac Activity Proposal MNT RESET URC RCRD Fest ‘9808706 negate Renan Pa SOE Bae. mrs meet cree eee RES OY Sac sie eat a MOM ten nate 88 an Mev Wrmzen Donen BAROMET Aerts or meee Sexcsteutcthy Seema Ptbo8 meron wane: ones ARN Si Peete eiyaen tress atone seen rhs wants cere FRR He Fea cca aN hapa mem WIAs} Lee Mero: snomraovaesneee Ieee ALOR Sms canteNre erm ies Te sg scoot re tae rao rer on PENNAY A Se samc BiteNae MoM aacine Ee SG aameanon opsectes TRIRAAOM RAS. tt emer SE nee sate Ma aes ns ese amscenae Fenn SRN 1 pln Sey a san OEE Sn me ese eben tS ne Same mei eer Pent 8 (a ron Pe BINGET RCO ae 28 sete Pe Ran SEG MAIS MemmOH deta ny tang tac quater tena spores Aosta ae we) ne, MM cise ere gama See yr P50 Sema antoies cy one Samerarte pane MOC a ane 28 Ras “Ssesonrnaeanreaces nisms ena seny 4 eaten HO stsce Hen oe eee aoe"
    },
    {
        "image": "project2_synth_18_aug5.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF TAGBILARAN Recon Vl Central Visayas Tagbilaran, Bohol Coc of Student Afars Instructions in Crafting a Project Activity Proposal tines Unrate ResancnProposas: 1. COVER PAGE mouse Une rama colegeosparen poe Se esancns raes ndsutet numb ncaereseach aNsersnave pst awe mrmaten- Spent acatemi yen a ees of supmssion Dectsuissin 2 ABSTRACT (Mami 250 ware) Proud ore uma ot eeseacn Oe, SENS, memaisey andes oseoMes- Nee Skewes re OMe reseronmpe |. NTRODUCTION (2g) Preset aston chy ad covet reat oie Sie reentrant wn suprng late tane ‘giteae apie cornu te sty Det ne cope iano teresa 4 REVIEW OF RELATED LITERATURE (6 8 paps Cont comprenenve raven creer ese, coca 2d ONC SSE Snes tere GeFse (58s- Use ADA Th eaton trate actos nse bono sons eae ined wn eet 1) ‘S RESEARCH OSJECTIVES AND QUESTIONS. Ste gewra apes jets Formule resen n GION pomeses Wee Ense agra DEE peien size cjeces, merece gusto 6 THEORETICALCONCEPTUAL FRAMEWORK. Petar aes or coeds quay ne resexcn- Develo aaa tank dayan sronngréazonps een \\aranes Exsannon ne anew quoes eG a ‘RESEARCH METHODOLOGY Spey ese ein (quate. quate mbied mena) Oesobe esac ocaeand tre ppisten- san sanaing omg _musangeszeceieminten- ey esac nsrUmeTs (SENATE MEN Qe, cose ain Cec!) -Desebe daa calenenposeares a maine Ean za mayest (sustca tes, penato nays) aes erica sera incg varied cas ad cateray |. S 9ETED OUTCOMES AND OUTPUTS- Desome atc ess ad Pe PTE EROS Pe SIVENS (SACP. POP Ms, ley emanation) -Sesan ow tags wi come sing oe {9 PROJECT TMELNE Gar Car) Prove ates tain ean esanch rae Yom rps ta papery tan: Props 1 mam), Oa Ctectn 2 mone, nays (may, Wong 2s) 10. SUDGET PROPOSAL onze al esanch eps nung teas, Yaréptatn fa ays eRe seedy SOuee (PSE VES TeSSBEN IT, ceca using eae quatre x ar epee exesg SONS 11. REFERENCES Ustat tet eooet in APA Th aon frat- Ener nena of 2 eee unas eee ee sas Dk, needle 12. APPENDICES reuse cratresench sri (qestomare ere gc) Proceed caseomsanderica Sewanee pcan Aten aa fpamisON FORMATTING REGUAEMENTS Papr S285 tne) Fo Times New Roman I2paet- Spann Onise space rato, Sepa tesa eee Mage: nn onal de -Pagerirtons: Son cote Maximum popes lege 5 pages cry pees SUBMISSION PROCESS: 1 Supitratin researc an 6e Wnt even 2 Newpark arose ope 3. Sut ee (3) sre pes cage reserccomaan 4 Preset ropa sparen resaxc canine ror 5 Up apa, one ECS ee nrg METAS Process ert cad on Resch roan git (2), Ure even ity 20%), Menon) eerie 25%), Fase (2), cia grain (15%) For qustone rep reer ce ee crane Resch ics Coriee tee rere esighor st ne Reet Otoe"
    },
    {
        "image": "project2_synth_19_aug1.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF SORSOGC Region ¥- Bice! Region Sossagon City, Sersagon Comminsty Qutraseh Oise Instructions ie: Craiting a Project Activity Proposal pusnainuty EXTENDICN PROIEST PROPOSAL OUIELINES ct Proponents: ya DENT Sdentl tra peers prepunarcts nae, enlegetep aiduig complete ncarese end GeEgraphio ooontinates avaiable 2 BACHE ANC RATIONALE Deere the oveeilys aonentsbunton and Slanted says Frog noms enteral aoa ee ny di emul iverson) and hes Racmsee® pec corer pein aah lst alan, 9 Se con endings horn comer matunn Ce rferances to wea) devlupinent ens, Harengay profi, oF BINS reseurh, PROJECT OBJECTIVES Stata olen, rmasurabl objatties uring SMART crane ‘Sper: sinenound) -Dangusan betweon ganacsi yectves feveiat goat and 2oenie cbpctves isan Ur plmensiote Deveingment Goets SX) and msttatone! edamsion sorting <TAROET BEHEFIIMSIES Kiontly atmary and ancandary hantctaias wit demepmphis delat (age. vidas o6rENET) SRR, Set aea numa ef vet wt nooo sraraasen- Expints ho oman were alerted 70 67 WE podapata me preeer \"NON «Provide a cent, duscisic Hn thet seas Doe peaioat s purpase and targa conmmurty T Spey the target Hatargcy oF someKenky teassrnbe, namin, Reeve ty autearra} age abjetives with spastic dates and weapons parste3 incite plats for cxemarmay progres fae eect OGY Pevise a dataied cnesna of action wi pouch meters. proces, end expectte! SiADUTE ising avd avebuatin macnn 1 3. PROAOT ACTIVITES AND BETHSE Tesnioe ine matedaingy lec ech setts fadvnelicn, easety Deiking, and sistas bity BUDDET FROPOGAL Cums teoaes tnxdget uth denied sox se Drowle quotatins or coe asfinates frum sunghers for apr axconses «i ans caumapa tam cori} inate coningeroy tudo} fiaaty B 0% ef ta om) VITOR AND USYRINARL {TY PLAN. Desosne maceurabiewstoar fend Now susan wr be ayaa SUSAR Te poled pariad -leabiy commanty esonnws ermactanisns that wal scstan on tee pemariel material, usnsperatsn, suppSES fenty ning nouroas Gurwersty wBecation, enierat the preci sane thar ening —Ginguea alors tar know setae and Dears DakSONy acderrement fron barangay ofeaal or carnmanity Wes ‘Chavo vase ot prowet wan ashes vow sein Vaheen of cae t Fae) 3a 5 -Besnonanicamn of of sequent ot 2, RCRQUIRED ATTACHMENTS ramiy if epeionbie}~ gare BROS) vem care ‘Soomminty newts aaseutineant e908 or Svey PERG ogaszatens er agencas 4. SmuEgsiON BEQURENEN by he moje tader and cobegn dear sropaene ale iumed 10 rev conten sag avid eanmnanty et seit cupinn and one eiecbosie copy BUF Iowiat Ab pages mutt be signed Subeasneee 8) p04 7 Droenasts nist ve subentize of tact €0 days batore proposes mmyiereestatan «teams sien (2546) -Chasty aod foseiny wt objsotbns nade and nettutionst vaiy ane poten Yer dong enn aect 2s) stain! 16, EVALUATION CRITERIA Rebevare to seswnury sc) Buniget anprspteniaes ara mazouree eTRGeNey morse qubiey 8%) eid vateaaotoay (iSse}- Commemnay pariinaian 209 rng eticn Rees Bourne, BI ABS or teunnioal etsiatorce m powers! pemeraton, rina the Exton Toa HAN Propeaat ccna takes eapevemataly 15320 worbng days hoor sabminaion"
    },
    {
        "image": "project2_synth_19_aug2.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF SORSOGON CITY Region V Bicol Region Sorsogon City, Sorsogon ‘communty Outreach Off afting a Project Activity Proposal Instructions in Cri {SAL GUIDELINES conmmunr EXTENSION PROJECT PROFOE Instructions for Projet Proponents 1 get TUE AND IDENTIFICATION: Ps Soo aes Jaentty the pro ‘department. and conta proponents name. tReuding complete acess and ralggraphe coordinates avelable NO RATIONALE -Deseie the communis ccument stuation and eet necessary and now ad8resnes csi comemany problems Incase ewvant statistics, UeY a any everson ce reerences afies, or previous cove wi tat eects te DRS! PR ‘and target communi ve ean ~Specty he target Barend OF ‘commun Js ough needs assessment ax measurable objectives using SMART STS spect, Measurable, hetivabin Rawat a, vargas (over gon ane space HRS Ste ip orcas) gn obecoes wh PROJECT OBJECTIVES State Oe stnutonal extension P ae pound) Distinguish between 96 Te a dole Development Goals (DOH) STH 1 TARGET BENEFICIARIES Went) PTE, and SARS estrrated numberof rec ar vhaiect benefianes partespate in the pret #5, PROJECT ACTNITIES 2 peserbe the methodoiogy ‘ersopation, eapacty Bulg: a sustainably Specty mon BUDGET PROPOSAL Submit tawees udget wth detaied cost De 0 oe quotations or cost estinates FO uppers for major expenses rants eounterpadt fom commune Trude contingency Budget CP +7 EXPECTED OUTCOMES AND a sTAMABILSTY PLAN DeSoe ETG, couteor EA Eon ne prone bereft WE core LIT er poject period Identify comeruny Exam Ucuss pans fr eowiede Sone! ‘and capacty bung Pr coUiReD ATTACHMENTS “Let of te vandorsement from barangay ofa semen HOA) wn panes SOTA i sicabie Cueuhn vse of RS NTT meres Aarwerery needs assessment por or Ney aacati Seaton map and commun Proms Letters of Srganzatons oragences #9, SUBMISSION REQUIREMENTS 5 ave project leader and colege 8 ey pone wabe rete or evn rerun. Resevance to comenty needs OM institutional pro 10 Ev rodalogy 25%): Sudaet aPPrRTeTE Hy resource efficiency 20%) 5 {oer Communty partepaton ane Manmersni aly (15%) joal assistance Extension Services Offs ial review rn submission. “wth demograpie detals (298, 960420, ‘occupation ears were setecied and now ey Wi sponse persons site dates and re renunity wince plans for 2! ogress and impact cof actties with 5985 joes, and expected outputs ton meenarisms 10 tack sats, ransportation, SUPBHES ocation, external wide a de materials, proved inonng and eve aicdown for et [AND METHODOLOGY Pr Nor each actvty nosed sonnel. mat ources (university a be evaluated success wil twa sustain ses and ROW mechanisms th SSructures oF community leaders Memorandum of Spowing relevant expertise ee mien fom parte vntes copies and one electors copy PON format At pages mustbe saned one gg day Deore proposed monensin incomplete sit tee (3) jt be submitted Proposals astity of objectives ty and fe oriong em erosct vives (25%)- C8\" 1 potential stainabity an sing ofoe hours (Wanday Fy. #00 AM” For techni proposal preparation, contact Me propempproxerately 15 20 wong days 15 00 PM). Propo!"
    },
    {
        "image": "project2_synth_19_aug3.png",
        "label": "projectproposal",
        "ocr_text": "UWEMERSOY OF SORSOGU CITY wy Sogegen ba Pree WAC uity Propose!"
    },
    {
        "image": "project2_synth_19_aug4.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF SURSOGON CITY Rea V -Bico! Region Sorsogon City, Sorsogon Comnemunity Outreach OFce Instructions in Crafting Project Activity Proposal CONMIMTY SXTESEHON PROJECT PROPOSAL GUIDELINES Lnstucians fo Brower Propanants. 5. PROJECT TITLE AND IDENTIACATION Procite cot, descrttre ta thai mfiect he procs purpose anc teiget verity Nery be pret pempanen s nana cabepeltezaninen!. and coniact NiowAtan Spee ine tages eRmgY cr coma any ekckeng Complate 20849 une pengache cooranates vaiane 2 BACKGROUND ANC RATIONALE Deserta the cemmmty s oumen yAcalion AM! clentiad news svough needs assessment Sate Grptain wy a vnc rene ary and Rane edenauen epactis cmon unt pvIN- Incde telewaat Hatates warvey senor, or censuiaton nanny frm vemecune; rrmanan Ose elgrerces lc! Seveoeman plans, kasangay Drees UF Drews rome 2 PROJECT CBJECTIVES State cians, mascian chyectives ising SMART coven (#pctis, Measunsble Achinvebie, Pale vent, Vane Resa) Detegrn bgiwean gers c! SOpetmes (9neN6 GON) En hones Chpotans (eorem t Cuts) -ADye Chie Wed wh the Sumenanie Oavetiumen! Goats (OOS) ane sthationel yrtantion aeoas 4 TARQET BEREAICIARIES -aenth, pinay ana vecondery Dereteindes nth ammgraphic de ow (ape. gente, cemaetn Seaet) me estwind neta of tract an cmaet Banetiranes «£5 92 ew Seveanws we seine ed Ma Pir He Wk waricoatn m ihe pret PROJECT AUTIVITIES AMO NETHODOLCG/- Provide Cataled tootoe of activins wen speate dates wid neypanshn pernens Deserba me meinedomgy tor aaen ectty neki dng malc ah, proceduves, und Experian aviput «inckide plans fax comementy Deteipaton, capac; baking, ard sustemahMy Spnoty monsorn Ord evahuaNen MACNEAAT 2 ACK PONE Ba MAE BYODET PRCPOSAL Rube denice Budge wth Halen Eon! Breatown fe: Faron Metals MramEEaALON, Buuales Proven quitetens or cast estates ton hucpinn fer Sar ercenses -tsertsy Lasding woureen (uma wlcaien, ees! (rt, counsampen Som wowed) lneeide Santee ey Buda (aeeh 6 ND% ot tat oo) 7. EXPECTED OUTCOMES AND SUSTAINABILITY PLAN Deron memsurstie cutouts at haw suavent wi be avabssies Enpian nor the prope! Denela WE czcinue ater ti picinct pared -leesity mumenunty sinictaes or mecnantary ‘et wh Syuta So ntatve -Oeuse pions tas kngwindye trnster anc capenty LuMdeg 3 REQUIRED ATTACHUCNTE -Letin of quest ur andanesnen inet Banengay aifeis or cumeunty aden Memsandie af Aareersant MOK) we pares conerunty (f apohcadin)- Curre tem wae ot proee! team mente snewing rrievant aeDertte Conmanty Meds ostessmern! ene ct bine; BUR Lcnaon te and aSeYRUNE, Btly Lerert af KOMEN! Nom Pare Sngensetane or agentes 12 SUBLASS ON REQUIREMENTS Sub owes (1) punted amples and ane alectene tapy 5 PLF format -At pages must be syne? oye pmyact loader ane solace dass Proposal muti ne ween at east OO auys Date pmMSHED UngleeneeANED «IneSONNe prone wl be wehamed for mvion 1C. EVALUATION CRITERIA. Relovanae t comm: aty reads and instuuione) tame 2h}- Cony and Yeandblty cf abjaceves lara marrodcogy 28%). Busget uporoptalenacs and retauree atlannss GON). Sesainadiy and patenba or kay dean moet (15%) Conmeriy panepecan aw garnering ually (18%) Forster see! ausatance 9 prcots! pieparen. cectact hy Entensein Sanvans Ofce dutng Mtoe Nua Merviey Freey. 4 00 Abt 590 Pa. Preset! reve token ap ruramaiely 18 22 working days tem wuboaten"
    },
    {
        "image": "project2_synth_19_aug5.png",
        "label": "projectproposal",
        "ocr_text": "UNIVERSITY OF SORSOGGH CITY Region ¥- Bice! Redion sagen City, Sorsogal Sor instru tions in Crafting Project Activity Proposal ‘SONMIURITY EATENSION PROJECT PROPOSAL GUIDELINES PI AND IDENTIRIGATON Prova 6 stan, asc tte thal efincs the amjsots pirgoss and target 2ayvmaaiy Iunisy te proiet proponents nant colaguises rhnant, ans carlat nizmatan Speety the rget berangey ar eammuney okie, commiete address and geoqraphie ouordiinies Wavaroe 2, BACKGMGUNG AND RATIONALE Qesznbe ine cosnniy s sumnl stuation and ilentfied necks ty sta Eaoin why is erect necessary an ie, oF gensutavinn fsnige Hom corny meres {9 eal ceveicpnvent putes, serenguy reories, or grevoU 2, PROJECT OBJEC Tenmyoung) sto the Suotansbie Develoement 2 esas mensuvabie njectves using SHARY omens (Speuhe, Messionble, Anhievebis, Relesont {ED35) ang masustonal exdensiar paras wera! geal and spacitz abjerties (concise outcomes) Aga ebjestves ah 4, PARUEEY BENEFICIARIES -iJerufy prmaury and egcnndlary banefoines with daraginahie deladsfnge, genes, aeupaten) ‘Sheet the amimaied surroer of ved! arf vainct hence Exninin vam Denesnanes Wins svcd aie bow tay ai BGT ACT ed tnene cY sovviies win szeuihs cates ond spun parsans “Deserve the m snd expected autpurs indica plans fer conmnty paniopeten, eansety aulting, and acstsiaty Snenfrmantomg end evatuaicn meshenams te sock pragines ane oa 9. BUDGET PROPOSAL, Submit temzad buss Ii ETHODOL tnosbiogy foreach actly swlating malarial, proces E5 AND v2 Peovine 2 se n. sayobes Svanges -Iannlty hindieg sources lunivaraty sineaton, externa rents, suuntaroan too axreranty) neti contingency buaget typtendy 5 40 of teal act EXPECTED GUTCOMES AND SUSTAINAEILITY PLAN -Dasorne mavsursbie euteosins and naw sutouse ails evatialad Expine aw dhe prowet bovatte ws nantnwwa ster the projet need «i2anksy camewnay sxuosnes cr Mesrariams Mat wis8e the inintge Deas glans fr koniedge nara 8 REGUARED ATTACHMENTS dlorsemant fam barony aifewls or ea wmuniylensers Marmiandn of Agimenn! GA? win pannus eomeranity tf aspicee) Carsoukim ine of resect tame members shawing evan! NEMS Commnuny needa aaeesanient tepoit ar sonvey remus Location mp and oar Srjantstons oF aquncies SUBMISSION REQUIREMENTS Su hay the pice edar ana cbege daa woe tives Sj anated copia and one sheotanie copy in PDE fuema! «£8 pages wat 2 sos init oe suhustled at as! 0 <iays Galore propeeed mplaniet 1, EVALUATION CRITERIA Relevanes 19 vammunty nes and inetutionsl pate 125%). Say and fasstaliy of epee sid mithedaizay [26% Buriget apurpoaturess und teseinas efueney [2050- Sustainanasy end povental fo vang aenm inact Si Cormuinny nattoation wn! wernarsiny quay (15%) Fortenniea! exsitunce in pivausal smpereion, cuntaat na Exansin Services Offce Maing effice news 509 Fas 20 wiring days fom suinson, Gonaay HFAay, 9 00 04 nes rsview tae wap"
    },
    {
        "image": "project2_synth_20_aug1.png",
        "label": "projectproposal",
        "ocr_text": "BENGUEY stare UNE VERSITY ree Aarasbalive Bag Baguio, Sengues em tme taney inshuetions in Cratting a Project Activicy Praposat SEE Rtsecn onecec mecca rome ‘scenme tr Gana mer memes 1 Co Ge. sence seenat ser sae Rr ceapaomata er enact PAPE 88 rN Be ge A testes orm ban TIERS 9 cm mang satan Pe Sher ee BRE Re reo mate eh30 ett Pern seat csr aeryscensee Ersonsarue mee ecm a RES eer tan a AER vst niche centromere oe Sa ean MD EUTPLTD- Suwentinesiee, _ NPE Reena. 22 ome mete eines Weise Baeincewenayy oe See aL eomene SeReT Tae AN Te mes ne ac on Se, wy 2a Sateen mew aie; SOS em eco. rac semen opm, COPIA Fata ian tt, fosters SS VANG Ravactnentetgeemuancney eo pase Heres OR careers, \"SERS CR ane a cum, ew enecinams mre asprin eR a: eRe temic a RECN wa et see enn rise sot ome anspor exes cage eas rng hnsr aioe PR Nate ae"
    },
    {
        "image": "project2_synth_20_aug2.png",
        "label": "projectproposal",
        "ocr_text": "STATE UNIVERSITY zine REGO BENGUET Can cusses ae Baguio, Benguet ote of Student Aars ‘ect Activity Proposal in Crafting a Proj Instruction srupenT AESEAROH PROHECT PROPOEA FORMAT eseren rons seve grave poet Hoe cee aca oases te untrai coven oa ein nvr) 8 SAMRAT TIT ences nes 8 ny ase yr usenet ease” ‘paect mis asm AcT Maus 20 NE) OPORTO SATA) spre mayen rien BIE MORESO TAROT, ov Suejnes OEE revi’ 4. nraqpucTion 23959 rr narenen rome oe a aaa eS anne roe ioe TEST TR SES pment raze emanate sO rune saa gitence se sagen FEDS recite COED TOTEOR RIE Sine Danese na aon TE asain a S107 neceancn OECTIES AND QUESTIONS SARIS pesaste osetia FO Se ere CIES FSA TIA 1 etonETCALCONCERTIAFRANENON PALETTE cocapa pars rene DER IED OTN OATET 8 Tagen ne vaven ge esha) MOT ESTES conocer ce aurea ee soners asia eh 98 SHEET re een ei ce OS ENG ATT sg apis So HTEIDHE rayon 2088 asa a ers OH BE ance reexcnguessono IIT al rang To NE ve. 8a t O een nn cat PPD ON TIT on anncDen TM IT: IAN eo sreet rete) sen pH. FEI TOE POS 7 nezancn METHODOLOGY Tonumpesze see nn reerrrecane tates ws. Tate esc gansta conn esery ONE seta erence TO\" QUTcONES AND OUTENTE- 2 eumerancn| e panran tH Co ‘orang art crocs tng ness FIESTAS ATI ees eee 5000980 crare caren ree ETOH AES spe epsane oss 9 ne psa a, 24832 9 paquecrT coma ota one Tyssa melt so uncer ngnosks tent petra ies eT Thora trang sear aseos 14 erage nace arg are AAS I PETE cones ces. neva errors ats OE gun oe treet URTIR CAE HE veers neoumENENTO “AEST AEE TS TT gnen nova 1290 3505 Oost sas RE yest ro oxen anaes Sens NTT peg eu Soups ego er onon mocess penta re a AO vrporme aye mean. ise ama? ETAT coracanscoses Doe SN 1 ese a BOTT OTT as unnae poseeeene fesengnaran esis enn ete ies 7 USAT HET TTS reeves Neen TR =) ARI ao cane ogenenon 151 eres re Raven n ETC COTTER ET evn nusn a etre RETIN"
    },
    {
        "image": "project2_synth_20_aug3.png",
        "label": "projectproposal",
        "ocr_text": "instructions in Crafting 9 ProjuctiActivity Proposal 2 ate panes 4 Sormmasucten pe, iebeout Tee BENGUEY STATE UNIVERSITY NS Loti Roniasive Rage Bauisio, Benguet ES \"tment Pron ames stray ceo Stave A Ramiteon ossmcte ta eitsrites ow srs seen a, e tresteeoonetomi: RH apa 7 Reseancn seercscasy ‘etane da stemetsiat cas etenveraine)- Dish tere ssarrcacane Peet eet pian ae Nea Har ene srs wo 2) at errs metas i eras centage SSPEARS. ante cet seeam <8 eStart -tees Posse mie mame page sae Aa RN AO Re cate ragictg repens et “ors a a SGI BARE ay Sera ee (ere etn esc ce 8 me tA es coNESeHLm eg are 73am eta a OurEE oxsinwceaye RI reves Siapascckta toon apy ‘Oma wnectReo ones Imag enisnsimey RN eran se eB Sete eras 95), Meas, a eran tree, HRA i a sap Rn CW oe, Setar eh ater ota trary th Lae ce abana woe gies mss sete thy KE Som re rans ad Ponsa er Sonne ste vy a5 san PaRece toe"
    },
    {
        "image": "project2_synth_20_aug4.png",
        "label": "projectproposal",
        "ocr_text": "BENGUET STATE UNIVERSITY (CAR Cordier Aomnsiatve Regen Baguio, Benguet Office of Student Atta Instructions in Crafting a Project Activity Proposal STUDENT RESEARCH PROLECT PROPOEAL FORMAT Gaon Urawrrane Ratan AI 1 COVER Ae ge mrt nave SOON B9EC TE MANTIS TUNEL NON LTDN CReER ae He RIN EC vereaon: Sct scab ya MSR 2 HATRED FEN sp ABGYRACT [amy 250 woh: ROVE Acree SNA THAN FONENOYEHVE. MePONDOD) ANOS OATES OUD DENRA TDR ee 4. NTRODUCTION 2 3 pape -Prvetesaaour tn iy gvtanee nd pares cowanen 28 8) DetreT emp a ao ese [Lev OF RELATED UTERATUME (S509): Comconpenewe een eeCRE FN CICK ANE vO SDN Dyasze INE aR OE ER poe cue na resnon nat San PDA Dm aE I TET OR DENT TN Te YR 1 RESEARCH OBJECTIVES AND QUESTIONS. ate gra aasowate oecve Frnt ce revere stow parm WOE Ek rope sunrvrt apeie mMRA OSH |S THEORETICALCONCEDTUAL FRAMEWORK. Preset rir coeas Quang Peeve Devas aconcamus Fann dan DANES (arava Biganon Patan gun De) ee ES grunt o mass meet «Deron eee acae naareipsaton: Eman kamaing TO Decoe axa coecin pana metmeene £:53n cart tne eer ren Seen esern pa3eT Oey WIN GDQINN Ne: EssaNTH agretoenee 1 meseamcn METHOO0LOGY Spa aren ON garEERYe rounge est one err OF AE ATT QAROT tH USE SEO Popeuieorigae wuneteg wu Teate maye, ADTRAN COW BOE NOUITY RITES TE OTA |b eoecTeD OvTCOMES AND OUTRUTS Devroe atone atu UT APE ABCIEONE SOA) ONES AYE DORON MOOR 25) scones) Ean gel SO eR PROJECT TAELNE (G Cnat)- rove onus tee aa eUEN rae Yor SNE Gaya Yee apn may. a Covet 2 snore Any (may Weng 2am) so BLOGET BRCEOGAL: teat UAE ES MOUNT NT Yaa Sa Tye AY: RIC AIG OH ST ST NT own uray «AEN QUES a WS ELH SEDDON 1) REFERENCES. stat Sas ont n APA Tremont Burt minum 20H FORTIS AT NOUR HOLIDR TSE DOM EOE 12 PENDICES revon a ee nar ga PEN 49H «OKC FORMATTING REQUREMENTS Pape 628 AE 851 1 ne -Fort Tes New Roman (Sgr Sony Dane seaeD as, eape oced De ecrons rgre renon a de Pape renOee Bean carte Maun op ey 25 pa ING OPTS reeves comer tons a0 erica ere msicaon AC EE pN suawisson ROCESS Sumntaratio wane an ee ty introns 2 repre ane ean mee gaAE Rarer 3 SOE SDM SH euchor ar rere papas aT aN COTNGN ABN UDI AETOV LANE AIC en Nay NITAN ME ropa ae enna stes on Reve oben Stee 2D) Ura een gaa (27 MeRERDOR, EORTEETN 2) FEBS BP) Ca grin (15 a qmttre gy WARE ATCA ee COE TH RARRET ENA Coen SGT AT STW REE ORF"
    },
    {
        "image": "project2_synth_20_aug5.png",
        "label": "projectproposal",
        "ocr_text": "BENGUET STATE UNIVERSITY, CAR» Garaiiea Asninnione Reon Baguio, Benguet Offi at Shasent Aas inst ‘Activity Prepasei ctlons in Crafting a Project sane ABSA NDE ROR TSA FORGET agarose nay adane Races Peek a eset see Seana ir eS aN EGR SRO AEN OR NADI OO A Scan manic Aen NEB IS sno men emir waren 2 ASPIRNCT emer A resueycorIseS emg erakaessrsben. cmc sen UCD s mRTRONUETIN (2 Bau Susana di wae Rare TON tae SmIMe oraNN Hae wating RA BN yeas Pageant cabin cre ey Cra ERLE TTR TE a rie op racarsn srasarung esp oun cote segs ARCAS Spams ets ots Wenara tease array m oben. HaumeNNce aNABMN EH OEP ANG ss RESeAs H B ANS QUESTOR he nr ae eR Fmt ee eS GON NAN ceodan sae acne arma ae exremarren Tagen cueenseerus pRaMEnce ramen aEe gains ee seen a ean ae a [peeve NEST a ae AY ON CL Ng GOO. pity sare Se arn Gah ae RGN ke CAEN aT TTA Senate attri ¥eee ye aemnce SR ORIG ORE Pe TAS EIT BEN IE oan ance 2 EAPROTED DUTCH ID TET ON RCT a ADHEREND NS EA ENA A veemmneeiian)- Setraiou tens ye cowme nese cage ‘epeceT MeL nmr Ponce semen DNR rsa a pad tA FEN ype a aR ee ses Aes res eg moa 18 DSI SSOP. rn re Wy mA. RIDER ES tr aE ng SY MEN, eigna tnt supe qvitat te nay cea eng Sa i greRENS Leta asym SBA RS Ee MUN nacre SUTRAS EHR SrA ie OE 1 RADIOED Poe ner RHA, MED gue. Pe A RCA UNF RE, Posnkc TSS RERREUENTE Pape ma: ASLBS aa) Me Toss ana Seg Duara een ao ene RO nents ajar Haan Hak Sage ED Gm Masiam 9caR REC RRO RIAN EC \\yoeasons eRGOHS Guntime Maes Re DeSet 2 toe aon rk aN SHU 2 RaNNLNaR Sa SE ee osname ae oman eina te ar aN BOSE ICS BADE LANE ers ee aonaectnaton eave sens ete earns 84 sens Sen 2) RAEN (ML a oranco gues etassley, core mai Rv Gone reo sha"
    }
]