[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "proofbystudent",
        "ocr_text": "Alyayez id Institute Proot of Studies ‘To whom it may concer, SOE 6186160 insan SOntes andere certhes. tat Darry! Miller wilson, doe 10 cumber “sreara ‘is curently ‘nthe (Second) term of the Psychology Term 472342. August 26, 2025 The curricular progress is +3, ‘with 10 subjects ‘adgitonal to,"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "proofbystudent",
        "ocr_text": "tee Insitute prooh of Shudies ‘to whom may concert dareyt Miller be a 99 9 Mtn gots YEISIE Mn ZOTGUBEE date apt aie Smt"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "proofbystudent",
        "ocr_text": "Alyarsz yarer Insbiute, Yowbiors may concern, oes Sago nr Vataneia When, wit iene 1p (Seomastern of te THE, August 25, 20 The cxetustar ewosrees seiteonas ‘Thu cater erogaca is 2 dan: CE G15 28 eats thet Punter stage Psychology Ta Darryl Milles ‘scurry rset en 29%, wt aH Gf the osu 3 OPAL SH egtal 1, a etre by dhe Riniaby of ints Education OB} Me. SENEGA saine NE Se Aucpst 8, 2038 Siem Hsitey Seman, Dect cf Stor Saevines"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "proofbystudent",
        "ocr_text": "Alygrez insite Prosi at Stestes ‘to uton it may sensor, COR G1E5160 Jonas, Eongrgeen Vowsiecenties that Dairy! Miller ‘Witson, wah Hattant MS numbar yragray ke cusarty éosalag its (Seo tors of Be Paychoiogy Yom AAR Boras! 8, WA5 The samacuite progsoni 8 12%, wide a winjecke arcroted out OF 76 adtsinal t fan cncuctiadae wonkaheps a pat of tra atody pian. Ths wernt gimia pein! avorege COPASIS 9 och 10 The sensinmic pogrom is ienaed eco tha agroncrant (RYOR} Ho. 20 The docionont wos iene et aid henrty cnm Rininry of Pubs Baer ‘Shocar of Student Sanies"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "proofbystudent",
        "ocr_text": "Agee Institute Proof of Studies ‘To whom it may concern. COE 6186160 sons, Sagetsana neroa cafes hat Dagryl Mille ne aD ronve “sant is curty eres he ‘Seesnayterm of te Psychology cm 472342. august 26, 2025 the crcl poses is 13%, wth osubjets deed oo! 26 Tg corneal oar womshopa as pat tho sty 0% waar st avrage (GPAs Bout 10 ry of Public Education ‘The academic program ie loansod by the Minit through the agreement (RVOE) No, 20160554 da This document was issued on and twenty one Sincerely Hailey Smith Director of Student Services."
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "proofbystudent",
        "ocr_text": "Roberson, See eae Proot of Studies ‘To whom it may concern coe 6030201 _yaems, Fg ad Bames ynison, wif iSert 10 rumber 1139810 8S (Second) term of the Computer Science Term 47242, june 06, 2024 sah, with 3 subjects secreted out of 10 ear currculat workshops a8 part reerage (GPA is 4 outo! 10 ‘The academic program is eansod By 1, Ministry of Public Education oor at (RVOE) No, 20160554 dated unis 1825 ‘through tho agreer Ths document was issued OM November 10 2028 and twenty 0n Sincerely Brenda Santos Director of Student Services:"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "proofbystudent",
        "ocr_text": "Proc of Siudses ¥9 hor H easy coment, 208 Ge Bind anne SS Sateen Braces (Geri HEME vintar trot Mat thant ead, (Sees warn ct an Computer Sclonce ER. jae Og riaResSe toate 22%. wh yn SrusTe tne concn monet Tee neon ineugh th Menistry of Pate *e axrosmens ce 8 date 2808 mewniy Srowiery Brewis Santos Stacie Senvioes"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "proofbystudent",
        "ocr_text": "rach wf Stoo yo wnore A may concem. ee S02000t conttes tot Matthew Brasiley. gid be avant one smpitet rsuence Sore tame, Foard Sains vtson, wel eleeed 1D rainbee Second tore ok ee oar va 3 sbjuets acezadkter Cu The crit Proust woah 08 gi Oi 8s AN Seca gree pois! averse ToPRjis 4 cae 18 sre mune progr a toss by ihe Miia of PE education Fogogh to apemers RYDE) No, 2080554 Sonate 10 28 Hin Goeutaaet #95 issued 9° went 0, 2228 spa tes oO Sec Farenta Sarkos Dante of Brace Servos ?"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "proofbystudent",
        "ocr_text": "Roberson, 33S) sells Proof of Studies ‘To whom it may concern. CoE 6030201 \\Witiams £95 aad ames corties. that Matthew Bradley vison. wile rumber treee10 cure enoted nthe (Second) term of the Computer Science Term 472342, June 06, 2024 The cucular progress is 12%, wih 3 subjects acceded cut o 49 additional to four co curricular workshops as part of the study plan. The ‘overall grade point average (GPA is 4 out of 10 The acadomie program is iconsed by the Ministry of Public Education through the agroomont (RVOE) No. 20160554 dated August 18 202¢ This document was issued on Novemoar 10 2024 and twenty one, Sincerely Brenda Santos Director of Student Services"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "proofbystudent",
        "ocr_text": "Proot of Studien Yo whom may cnncern, SOE 6N361 Peete gies fram erage PAIS 4 unl er To ozcumint wa iaued 5° Sireetely rein Sannees"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "proofbystudent",
        "ocr_text": "Peoot of Giuties, ‘Yewhom mney concerns, Sure (Seeadh term of ih ‘The seedoenio reoge lhwotigh tre agrosm Tes docurmeat ae latin) oh fers teeesyene, OS i Sows by NS COEDS certian tags wiaet espns is Garay ae Ht (RPOE} Ne. 2E58064 dan ‘stiua Reig Phamagy y 2 Hint of Edie Sescoton We ay 15 3008 owt 24 204 Sitwcfor ef Stadene Sevvioes Wiisor Gisup Cottage"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "proofbystudent",
        "ocr_text": "ssp College Proet ot Studies To whom K may concer. COE 5633501 corttes that Joshye aten aen mace roe perme the (Second) term of the Pharmacy Tem 47242. October 26, 2024 The carcatar progress 19 29%. with subjects accredited cut ‘addtional to four co curricular workshops as part of the study plan. overal grade point average (GPA is 4 out of 10 ‘The ecademc program is Sonsed by the Minitry of Putte Education eough he agreement (RVOE) No. 20160554 dated jy 13 2024 ‘This document was issued on fort 24 238 nd tweety one Dwector of Student Services"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "proofbystudent",
        "ocr_text": "Prool ef States, To whom it may concern A aca080: Celene orien Joshua Delgace enge! BY SEV Ne ZOREDEE data"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "proofbystudent",
        "ocr_text": "Wisse College Proot of Studies ‘To whom it may concern. COE 5633591 Scott Jacobson College cerfes that Joshua Delgado Wilson, with studert (D umber serga7s i currently enroied nthe (Second) term of the Pharmacy Term 472342. October 26, 2024 Tha carne progress 20%. wih eubcts accreted ot of 26 _adatbonal to four co curricular workshops as part o the study plan overall yace post average (GPA)'». 4 ot of 10 The academic program is kconsed by the Mnwatry of Public Education {through the agreement (RVOE) No. 20160584 dated ju 13 2024 Thee document was issued 0 eri 34 2028 and twenty one Tanya Cook Deector of Student Serves"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "proofbystudent",
        "ocr_text": "Proet ot Station Towboc 8 may concern COE ses3s1 ts cease, Joshua eee Ta, at ade vs IPE” 2. 8 5 mcs wg Sra ate an we Mc at ‘Pi pa are EAs g canes a PS SU tian. ane mony ae tf Pit: Bérmaton Fhe Sonoma ert ONOE a ZOIGSaee oor uty 13. 204 (oman oo nt martyame 084 3a"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "proofbystudent",
        "ocr_text": "Proot ot Studies Towhom t may concern, $eope Gomez College certos thet VG soasse i oblUMCr Slokes (Second) term ct the the 262 Apri 21 2024 COMPUter Science Ceara BOOTING 17 wi 20 thes _ tout era asset oe ty ae Proupn ag ROUEN Sond by te Knit of pay ls dated yon secs ‘This document war \"on MO 20180884, oy #04 teertyone / fous Secor, James Curtis Drector of Student Ser"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "proofbystudent",
        "ocr_text": "Contreras Kir College Prost ot Sucies Fo whom t may concer. OOK g4szuy ee Ee Ra eae AEDT (Leeord} term of the Corrgister Science S722. apr 21, 2024 ‘The austestor progress fs 17%, with ze cudjC% eccmeditad cut Of 42 ascii! (3 four co cureat wohchops a8 part cf Ihe Sty pla ‘cena! gate pox average ‘OPA is Gout 10. Tan onatemic prayer ie Soonses by we Mirlaty of Punic Beucotne teams he ngpoument (RVOE) Wo. 2OVEDESE cater May OF 2028 ‘The document wos sued en Movember 28, 2022 aed anspor, Sree ames Outs rector 9 S01 Servis"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "proofbystudent",
        "ocr_text": "Contreras Kir- College Proof of Studies ‘To whom it may concem. COE 9432147 ‘Cooper Gomez College certifies that oe eee Ohba aceon okt SaSIONR ho (Second) term of the Computer Science Term 472342, april 21, 2024 The curiclar progress i¢ 17%, witzs subjects acceded out of ‘Additonal to four co curricular workshops as part othe study plan. The ‘Overall grace point average (GPA) is 8 out of 10 ‘The academic program ie loonsed by the Ministry of Public Education through the agrooment (RVOE) No. 20160554 dated May 05, 2025 This document was issued on Nowember25, 2023 and wenty one. Ys Sincerely James Curtis Director of Student Services"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "proofbystudent",
        "ocr_text": "Contreras Kir College Proof of Studies ‘To whom it may concern. COE 9432147 Cooper Gomez College certifies that Wisdn oth sunt ID rombersooseed is cheep OA fs (Second) term of the Computer Science Term 472342, april 21, 2024 The curnculy progress i 47, wihag subjects acceded cut of 49 addtional to four co curricular workshops as part ofthe study plan. THE overall grade point average (GPA) is. 8 out of 10 The acadomie program is lconsed by the Ministry of Public Education through tho agroomant (RVOE) No. 20160554 dated May 05, 2025, This document was issued on Novemoar26, 2022 and twenty one, Sincerely James Curtis Director of Student Serves"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "proofbystudent",
        "ocr_text": "Contreras Kii College Proot of Studies ‘To whom it may concern. Coe 9432147 certtes that Seem comee cere wee, be Set, (Second) term Computer Science 472342. april 21, 2024 The cua progress 37, wih 2a tics scredind of of 12 additonal to four co curricular workshops as part of the study plan ‘overal grade point erage (OPA is 8 out of 10. ‘The academic program is kaonsed by the Mnatry of Putte Education {rough the agreement (RVOE) No, 20160554 dated May 08 2525 ‘This document was issued on November 28 2023, bone James Curtis Dwectr of Stasent Services"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "proofbystudent",
        "ocr_text": "ar ‘To whom it may concern. COE 5611982 SSS tee (Second) tem of the Computer Science 47242. March 26, 2028 Tecrtr, pomens 21%, cin a ntinct somedies ot of 45 ‘addtional to four co curricular workshops a part ofthe study plan. ‘overal grade point average (GPA is 8 ou of 10. ‘The academic program is tconsed by the Minatry of Pubée Education ough the agreement (RVOE) No. 20160554 dated waren 14 223. ‘This document was issued on September 23 2025 and tweety one due Laura Patterson Deectr of Stusert Servos"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "proofbystudent",
        "ocr_text": "Lote Rusk ace Proof of Studies Pa wiore it ray conceen, cos SH11502 Seats Picoant SeoieUnnensay contios at Michael Maynard whnon, ett: utenti number smgr7a is surenty enol iro (Seconds rain ot the “ism ire curtar peo ch agents ssleiterad ta eur eo curcier weakens aa BUG et ime ste a vara grads peat averoige RANG Bout e 19 credited oat af 25 she ‘hho anewemla program w Soemand By tho Mlnsty of eugh tha egroncanie BVOE) NO, 20 Fhis dorwraert ma a ne vent 8, Shiver niy ‘ura Paterson ‘Suecer ef Stwtert Services"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "proofbystudent",
        "ocr_text": "i ‘Towhom it may concern. COE S611982 Laetes Pree ad Got mere omties Tot ‘wins nip evcet 1 sre \"ersrr, cm ent oa ae [Geren warn tthe Computer Science SPEHB March 26, 2004 The curacy progres 21%, om a subir screed ct of 16 scieraovat Yo Mou Cooinioias woskshows as oat ofthe waudy pan. ered gruce pret worege GPA IS Roni ct 1, ‘Tre ccademic progres Joonaos by the Minioty of Pus Bante, eugh te azpoecnent (RVOE) Mo. ZOVECSA Seton wrens 226 Th GoCOM ws HARE OF Sepaenber 2h 2E a8 tego"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "proofbystudent",
        "ocr_text": "Lutz, Rush arti Proof of Studies To whom it may concern COE 5611962 Sarcre: Pree Sears vars) cortton that Michael Maynard Wiiaon. wits studert IO rumber 572977) currerty ervciees the Second) term of he Computer Science Tem 47242 March 26, 2024 eggcamety egress 21h ina sutcts acrid cu of J ‘2d2Rona! to four co cunicuiar workshops as part Othe study plan Overall y ae pont average (GPA is 8 ovt y 10 The acadomc program 1s hconsed by the Mewatry of Pubte Educator rough he agreement (RVOE) No 201605 4 dated vans 2a Thee document was issued on Seoteree 23 2028) and tweety one, Secereh Laura Paterson Drector of Stucert Serves"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "proofbystudent",
        "ocr_text": "Lutz, Rush angele” To whom it may concern. COE 5611982 Sanchez. Pice and Beard Usversty certifies, that Michael Maynard roe eee rmbt 6720773, 16 cent enehes watson en ct he Computer Science 472342 March 26, 2024 “The curiclar progress 'S Jsiional to four couric adr ase pot erage (OPA IS out cf 10 te teonsed by the Ministry of Public Education soxtemcjoamort (RVOE) NO, 20160854 dated w= 2 wry eecument was issued OM Septet 22 205 ‘and twenty one. fs? sroetely ‘Laura Patterson Director of Student Sences"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "proofbystudent",
        "ocr_text": "oda sare ied, Proof of Studies ‘To whom it may concern. COE 3655051 King Ltd School __ceriies that_Clayton Reynolds: ‘wilson, wih student ID number s1e0172_ is currently envoled inthe (Second) term of the Engineering Term 472342, april 03, 2025 ‘The curicular progres is 5 %, with 2 subjects accredited out of ‘additional to four co curricular workshops as part ofthe study plan. Th ‘vera grade point average (GPA) is 1Qout of 10 ‘The academic program is liconsed by the Ministry of Public Education through the agroomont (RVOE) No. 20160554 dated Sesemser s This document was issued on ity 17 2028 and twenty one. ‘Sandra Perez Director of Student Services"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "proofbystudent",
        "ocr_text": "diane Gag Rofege Proof of Studies ‘To whom it may concern. COE 3655051 King Ltd School cafes that, Clayton Reynolds vuln ta Sue rime sen ny enotea nthe (Second) term gineering fem 472342, april 03, 2025 ‘The curricular progress is 5 %, with 3 subjects accredited out of Thawtonal to four co curricular workshops as part ofthe study plan. T ‘Sveral grade pont average (GPA is 100uto 10 ‘The academic program is licensed by the Ministry of Pubic Education trough bo \"FRVOE) No. 20160554 dated. SASS The document wae sued on Soy zal ed went ne fds: eiceny sandra Perez Director of Student Services"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "proofbystudent",
        "ocr_text": "Benet af Studies Foswhom Kmay concert School coiies that Clayton Rey! vols in ot te Engineering Apel 03, 2025 re gone ie tot 8 cus garsdte Paver"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "proofbystudent",
        "ocr_text": "ugh Oe ar eeT am i Sonsed by the Ministry of Pubic Education Tra the sorvement (RVOE) No. 20160554 dated semce’ us document was issued on day 2038 and tweety one, ‘Sandra Perez Owector of Student Services"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "proofbystudent",
        "ocr_text": "Broot of Stusten ‘Yowhows it may concer, SOE SERBObT King Lid Schoo! certifies: watson Sih spsseet 1D Timor pay 2 rogkess 1S 5 Ta, zith 3 subjects acoreited cut oF _agdtienat to four ee cuercutar workshops 23 eart 6! the study plan. The 1 Srorage KSPAD IS (Dout oF 12 i progrsin is logacoa by ts Itiomay of Buta geument (VOR) No. 201605 aaled Sse om doce aa Hare o8 ey, a Png"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "proofbystudent",
        "ocr_text": "Frost, Bryant Sense (COE 4792445 Foyt Watece and Mon certfes that James: watson 10 umber eenaas3 curry erroted criss ne (Second) tem of the Science ‘The curmcular progress is 28 %, with 28 subjects accredited cut of 4 ‘sdatbonal to four co cuariculas workshops as part othe study plan. The ‘overall grade point average (OPA) is 10outo 10 ‘The academic program is hconsed by the Ministry of Pubke Education trough the agreement (RVOE) No. 20160554 dated June 22 2028 ‘This document was issued on ay 1, 2008 So Seeerety ‘Shannon Johnson eect of Student Services,"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "proofbystudent",
        "ocr_text": "Proot of Studies ‘To whom it may concern. COE 4792445 Wataceantiason caries that James Petty, oe Mae gentna is. ceny ered he Computer Science"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "proofbystudent",
        "ocr_text": "yy COE 47924465 wapeesiion coties tat _ James wen sate note, grass, w csteapems Ae (Second) term of te Computer Science Tom STB January 6, 2025 The curncar progress i828 5. wid 20 sutycts accreted out of 4 ‘onal to fou cocurelat womshops as pat othe staty plan The overal grade pomt average (GPA) 100u of 10 The academe progam 1 kconsed by the Meratry of Pubbc Educator (teough the ngrooment (RVOE) No. ZO 6OSSA dated Jaw 22 228, The document wer faved on ‘Savon tae andteert oe ‘Shannon Johnson Deectar ct Stusert Servant"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "proofbystudent",
        "ocr_text": "Brost of Studion ‘Yo wher may conner, coe 4792485 James Perr 18 20%, wha subjects socvedisd out of 4 xia werksbege az petal we study pis. The neo by tho Minit af Pavia Geiss 66584 Sata Jun sy Shannon Jobson"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "proofbystudent",
        "ocr_text": "Dwectr of Student Sernces Frost, Bryant"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "proofbystudent",
        "ocr_text": "Ha Ltd insy es tt Rea Ly tn Pa ee OE ‘Seesaw of he Sem Edumaiiars TPE sctcesr ag, S005 Ste sNSt6d a8 29 dove MENA OES 35 port ote Pin, Sls foie acctare maha se eae rth Peri i Soseed by ta 8 ee SoUgh Sa sagtacneen Hetey, Eencotien, *AVOS) Ko. 20 80584 saree as 0H oe Points, a 4 anys Binet Te Wemar Stor Bsc Barioee"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "proofbystudent",
        "ocr_text": "Breot of Btodien ‘To Soham if may concn, Roe snczisa her aweasiy oat Education RastS. A lusite, oes Erie Wiiame ‘Bacon wm ot oe Tor FIRE, cetebes 04, 225 since ecm! 38 3199 ApS AF paste Oe sana phe. erarall ace soto ayarage GPA} g outet 8 The measewie opiate ie heangos by tha Minky ef Pts @ucthon Seen te agra RVR Ne, EASESES cated Og This dacurnent ws ese Sago. 3084 ses tenetpern Bream Wert Wares recto af Stzaaee Rernen"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "proofbystudent",
        "ocr_text": "Ellison fre EnSehle Prost of Stan 8H asssat4 F888 ,4d Institute 68, wel Suiden Okay Beowrds tam oye HEHE Grinoeso, 2008 ‘The corteuiae progress te 25%, antsy, srmatied out of 7 Syne fees covaatoular workshops a pat oth stety oa rere uve pois average PAHS A ax oo ‘The scadumio pecyram is tensed by feo Minit Breunh to agoemont YOR) Me BOISE This fovuenast wats feaued on Avgest 8, 208 8 Seon Enka Wikarn: Educaton ewes hector f Snagit Servions"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "proofbystudent",
        "ocr_text": "Proof of Staten ‘To whom it may eoavern. COR ag5z0R4 hehe lia} (Secondhtern of the BAZ. Octave 94, 2 ka Wil og SEI im Fhe cusacular prog 4%, wit 10% stations! fear sorkstions part othe sunly pian. Levent race yoink overage (BPa is 4 unt cl 16 The anadamio program is teenies by he Minty of Public Eduastion ‘gong wie noyoumers (ROE) No, 2618055 dated aI. This see ‘shia! on Agus 28, 28 se ety Terri Warne flor of Sader: Seren"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "proofbystudent",
        "ocr_text": "titiogn je tise Breot of Stites Fo wom Hk may e004 COR A534 cotien et Erika Willams, BQH taonsss i alten eta ‘ered taon ot Foncaion Ter SFYBAL, cygavec 04, 2S Meare a etre sat Pt Ede she cure progress *& one to (ae CO ONIEC ewe parte pal keg ‘rho wandenie program 4 Rucnood by #0 po napvornors (8 08) No. 2IEGESS Coxe ie on aga 2928 ove document bat BR sissy Teri werner eeoter of Seager Serves"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "proofbystudent",
        "ocr_text": "June 06, 2024 The curricular {xttonal to four co curricular rogram is licensed by through the agit of Pte Eaucaton ibe cone VCE No. 20160554 dated Segue sd ana December 21, 2024 and twenty one, y Tet ite Siocerety William Smith Director of Student Services"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "proofbystudent",
        "ocr_text": "Matthews: The misitute Ta whem 8 may concent"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "proofbystudent",
        "ocr_text": "Prost ot Studies Fo iawn i ney eoncere"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "proofbystudent",
        "ocr_text": "tt TI Mathews T Proof of Studies ‘To whom it may concern, COE 2560003 cenifes tha Mlsr B SSB eNoa, cies 's HMA Frederick {SS230 em ot tne seme Technology Tere “7292 June 06, 2024 The curncutar pe ‘daitional to four overall grade po oe corey ve ith 25 subjects accredted cut of ‘¢0 curticular workshops pan ian Th aS part of the study plan, th verage (GPA is 9 out o 16 Tre acodomic Program ie hoonsed bythe Min throu ry of Public Education ‘gh the agroomont (RVOE) No. 2 0160554 datod Demme 25 This document was issued on December 21 2608 and tweety one Sincerely Wiliam Smith rector of Stucent Services"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "proofbystudent",
        "ocr_text": "Proot of Studies To whom it may concer, Miler Reese Schoo) cos nat Tamara Frederi Segond term of the 0020525 is caraalha Etederi in Tec y Tom \"June 06, 2024 nation Technolog srguticular progress ix 2 %, with 25 subjects Sacer 28 Matthews 7 Nstitu ins"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "proofbystudent",
        "ocr_text": "Wiig -Jones cademy Proof of Studies ‘To whom it may concern, COE 5048283 corties. that Wt RAG Ue oenaoe sls A SAI (Second) term of the Education i) 472342, March 31, 2024 Tie cuca progres i 20, with rs subjects accreted out of 47 ‘additional to four co curricular workshops as part ofthe study plan. ‘vera grade point average (GPA) is 1 out of 10 ‘The academic program is liconsed by the Ministry of Public Education through the agreement (RVOE) No. 20160554 dated Novag 06 This document was issued on November 10 2023 and twenty one. Sincerely Erica Ortiz: Director of Student Services"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "proofbystudent",
        "ocr_text": "Weod.. -Jones cademy Proof of Studies To whom it may concern. COE 5048283 corities. that WR UR ASS eres ascot is OES e (Second) term of the Education Term 472342, March 31, 2024 The cucu progiss i620, wih rs subjects aoe cut of 47 ‘additional to four co curricular workshops as part of the study plan. 7 ‘overall grade point average (GPA) is 1 out of 10 The academic program is licensed by the Ministry of Public Education through the agoement (RVOE) No. 20160554 dated NowgBE a6 This document was issued on November 10 2022 and twenty one, Sincerely Erica Ortiz Director of Student Services"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "proofbystudent",
        "ocr_text": "-Jone= Waoscemy Proof of Studies ‘To whom it may concer. COE 5048283 Fox Group Academy cattfos that Fox, Group Academy tetas UROU RS Se {Second} term of the ‘Education “Term 472342 March 31, 2024 ‘me curieatar progres i 20%, wih xs subjects secreted oo O17 The cet our cocci workshops as prt fhe tty Pan asgirmase point average (GPA) is 1 outof 10 ‘Te acadomio program is Koonsd bythe Misty of Pb Egle \\AVOE) No. 20160554 datod MIR °F through tho This document was issued on ‘November 10 2023 and twenty one, rs Sincerely Erica Ortiz Director of Student Serves"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "proofbystudent",
        "ocr_text": "Wood Jjones x avemy uate To wane itanay concern, acted out ef 47 Hae 0 four C00 re stu pie. he VOR)"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "proofbystudent",
        "ocr_text": "rock of Brees “yeeros Hi may CODON. pe 5018283 ot, Tike Tar ceties oe TROIS, an corey exon Education Fox Graup Acagen! Gok Poin wan sonutjacts accxoneed of 9147 26 cage copa ot tre ay Dt. 7 a eGeriyis 1 cutol 10. aud by te Miniay of Piste Gece 1 net dates SEN Niven 8, 022 since"
    }
]