[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Murray Martinez £955 fret Grove Ant 582, Emile, Ax PURCHASE ORDER 99657347308 vwells example net 5626 rena Frances Andersen rr Taylor Copeland COMER aN seen har: Daniels Group Parker Alvarez Institute acwre mare 55188 Chen Drive Apt. 403, South Josephburgh, WY 69066 icclain Coves Se U5, 91 9 th J Jonathanport, 09449347420 09740700602 alexanderkely example rg qbaxter example org pe Le ape tortie E theme’ ft cables and Sa Socios (various 05 4598879 $7999 94 branes Suictota (§) 27506 64 30 days upon receipt cf the toms above Disceunt #%) 9 5710 61 Ctee Cost ($) 31802 85, Shipping Handing (& 1665042 ‘Totat Amount (2) 6958 24"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "Ee thernet cap es and Paz Conneciare ampard IS Watiou is brands)"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "Murray Martinez 5556 Brett Grove Apt 582, Emilylle, AK PURCHASE ORDER 09557347306 vwells example net 5626 ra o1 VENDOR CUSTOMER NAME awe Frances Anderson Taylor Copeland pence CoMPany AE Daniels Group Parker Alvarez Institute aaoness cones 55186 Chen Drive Apt. 403, 288 Mcclain Coves Suite 315, South Josephburgh, WY 69066 South Jonathanport, SC 49119 Puone pone 09449347420 09740700602 EMAL ADDRESS A AD0RESS alexanderkelly example org qbaxter example org I Da Ethernet cables and 885 and pencs (arous 65 43899 25 2613284 Subtotal (S) 27506 61 Payment shall be 30 days upon receipt of the items above. Discount (%) 10 571 0 81 Other Cost ($) 31802 85 Shipping Handling ($) 16650 42 Total Amount ($) 6958 34."
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "Murray Martinez 5558 Brett Grove Apt 582, Emilyille, AK PURCHASE ORDER 99557347306 vwells example net VENDOR CUSTOMER Nae i Frances Anderson Taylor Copeland ONANY Au OUPANY Nae Daniels Group P; rker Alvarez Institute 55186 Chen Drive Apt 403, 288 Mcclain Coves Suite 315, South Josephburgh, WY 69066 ‘outh Jonathanport, SC 49119 094493474209 9740700602 baxter exam leon ajexanderkelly @example org aPaxter example o; g Product Description 24 4 Eth nectors Bf. and ==_, cuantiy Lvstrice ince] and pencils (Warious 85 49389 75 30939 04 Subtotal ($) Payment shall be 30 days upon ‘receipt of the items above 27506 61 Discount (%) 10 5710 81 Other Cost ($) 31802 85 Shipping Handling ($) 16650 42 Total Amount ($) 6958 34"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "Murray Martinez 5858 Bret Grove Apt 582, Emil, AK PURCHASE ORDER 99557347306 vwells example net 5626 VENDOR CUSTOMER ae nae Frances Anderson Taylor Copeland ccle wae COMPANY nite Daniels Group Parker Alvarez Institute Aooness anoness 55186 Chen Drive Apt. 403, South Josephburgh, WY 69066 PHONE 288 Mcclain Coves Suite 315, South Jonathanport, SC 49119 PHONE 09740700602 ‘EWAN ADORESS gbaxter example org 09449347420 EMAL ADDRESS alexanderkelly example org T Code Product Description es Amount Ethern, table and connectore allpeng Rae and pencils (various ais (various 65 48960 7¢ $7990 04 Subtotal ($) Payment shall be 30 days upon receipt of the lems above, 27506 61 Discount (%) 10 5710 81 Other Cost ($) 31802 85 Shipping Handiing ($) 16650 42 Total Amount ($) 6958 34."
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER Robert Lowery Miller Guerrero 208 Holla! Du Gharnsnt re, nd Walk Sule LAZG229 ge04e7 i michelle 4 doxample net 09357689543 ek a et i"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "oH PURCHASE ORDER nipple Robert Lowery OS24880467 4 e24 examp 46956 38 3 3409 14 ga 4 44535 5254 )56 8733 44 13857 19"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER Pie o} OS 357689549 0994880467 4 dpowell 244 iets “ate Sublotah 8) $3857 19"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "4058 apexarmple org Robert Lowery Miter Guerrero yiton College ns Gu land vie a K Suite TS4 446 Summer SU. 26220 Acevadoberg, PH 99948804674 4 Zo ae ie ee re 4385719 grs3 ai 40382 98 Yokel Amos (SF"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER “Sutton College 446 St ummer Street Acevede ,PA73572 99357689549 “09948804671 poweli exa 12048 78 10549. 3 10388 96 Tota! Amount (3)"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Rodriguez, Payne and Harrison 4994 Simmons Pot Robinsonburgh, MP PURCHASE ORDER 09863387693 jeffreygallegos example com a 4203 May 09 2013 wae wave Tiffany Howe oshua Robinson eae poise Warner Johnson Sampson LLC School sores sconess 59398 Rodriguez Court Suite 046 Lindsey Ferry, North 647, Port Shellyland, AS 11275 PHONE Marybury, AS (0708 PHONE 09070010151 09528951725 EMAL ADORESS EMAL ADDRESS ashleysampson example com michael75 example com in Code Product Description Quantity Unit Price Amount Ballpens and pencils (various brands) Projector ae and screen Seti last ic, 1 A. 4 ora oxes External Tae Reams of jotocopy paper Subtotal (s) 34752 77 Payment shall be 30 days upon receipt of the items above. Discount (*%) 10 36421 31 Other Cost ($) 16567 38 Shipping Handling ($) 2408 96 Total Amount ($) 42099 91"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER Joshua Robinson Sampson LLC Scheoi examp! Subtota! 13) iP)"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "Rept dnecns a foamy Hee PURCHASE ORDER 9863387893 jeffreygallegos example com a 4203 May 09 2013 Tiffany Howe Joshua Robinson Warner Johnson Sampson LLC School 59398 Rodriguez Court Suite 046 Lindsey Ferry, North 647, Port Shellyland, AS 11275 Marybuny AS 60708 09070010151 09528951725 ashleysampson example com michael75 example. com I fl Ballpens and pencils (various brands) Projector chee 3305! and screen set Plastic 125 storage boxes External 22 4 08. 8 2536 2 hard drives Reams of photocopy paper CS s 2 2 3) 34752 77 16567 38 9S 2408 96 Total Amount ($) 42099 91"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "Rodriguez, Payne and Harrison 4894 Simmons Pott Robinsonburgh, MP PURCHASE ORDER 09863387693 jeffreygallegos example com a 4203 May 09 2013 VENDOR CUSTOMER Tiffany Howe Joshua Robinson Warner Johnson Sampson LLC School 59398 Rodriguez Court Suite 046 Lindsey Ferry, North 647, Port Shellyland, AS 11275 _Marybury, AS 60708 09070010151 09528951725 ashleysampson example com —michael75 example com I Es Code Product Description Quantity Unit Price ‘Amount Ballpens and pencils (various brands) Projector me a and screen Sef Plastic 1 So storage boxes External hard drives Reams of photocopy paper Subtotal () 34752 77 Payment shall be 30 days upon receipt ofthe tems above. iscaunt(%) 10 36421 31 Other Cost ($) 16567 38 Shipping Handing (S) 2408 96 Total Amount ($) 42099 91"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE CRDER HORBIGATEDA jeffreygaliegos exampie com oo! Joshua Robinson mpson LLC School UTE Sue O66 Hyland, AS 11278 Na indsey y remy North ry, AS GO7OS _ 09070010151 4h 9528951728 fipens and p 15 brands LL 4 Fes ATT B. ARBRE Ge SOP SEBER: i har Br 2408. 96 42009 94"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Bennett and Harvey PURCHASE ORDER Box 9510, APO AA $1306 89692028, 7A7? crystai06 example org ee Faaay 95 Mary Flores Matthew Bradshaw ~__ 08147982687 “99839353772 smithkimberly exampie org monicacraig exampie com Rearns of photocopy fe paper Ethernet cabies S6e 4s 33: and connectors Desktop 55 1 3% computers (Core (5 17) 42 q a 4 aa zs eatlermal nad drives 83 0. ers with fastener: fous) 47362 24 Paymank shai be $0 cays upon recent cf tie Sams aoeve Discount %) 10 46086 54 1275 92 34578 18 40023 34"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER mas and Hart /"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "Rocha, Bennett and Harvey PURCHASE ORDER PSC 7551, Box 9510, APO AA 81306 tia ola crystal example org 8965 Feoren Mary Flores Matthew Bradshaw Jackson, Rodrigue and Lite Ray, Williams and Hart Academy 648 Brittany Lodge, New 3225 Thomas Dale. Rhonda, VA 01392 Forreston, TX 98135 09147982687 09839353772 smithkimberly example org monicacraig example com —erneo Product Descr computers (Core i5 i7) 42 Para fasteners Reams of photocopy paper Ethernet cables 4 . and connectors Desktop 5 5 1 3 4 6% BE $5550) Subtotal ($) 47362 24 Payment shal be 30 days upon rece ofthe Rems above. Discount \" 46086 54 Mther Cost (S) 1275 02 shipping Handing () 34578 18 Teta Amount) 40023 34"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "Rocha, Bennett and Harvey PSC 7551, Box 9510, APO AA 81306 PURCHASE ORDER 959708787? crystal06 example org 8965 Fenny Mary Flores Matthew Bradshaw Jackson, Rodriguez and Lite Ray, Wilhams and Hart Academy 648 Brittany Lodge, New 3225 Thomas Dale, Rhonda, VA 01392 Forreston, TX 98135 09147982687 09839353772 smithkimberly example org monicacraig example com Reams of photocopy paper Ethernet cables f a and connectors Deskto} 5541 computers (Core iS i7) 42 a 4 ERI aM fasteners oe suniat() 47362 24 hall be 30 days upon recat ofthe hems above Discount (%) 10 46086 54 Payment Other Cost ($) 1275 02 Shipping Handing ($) 34578 18 Total Amount ($) 40023 34"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "Rocha, Bennett and Harvey pasegon7A72 crystal example org ° 8965 Fever °° Mary Flores Matthew Bradshaw IMP ANY ANE ——o Jackson, Rodriguez and Lite Ray, Williams and Hart Academy scone ss 648 Brittany Lodge, New 3225 Thomas Dale Rhonda, VA 01392 Torreston, TX 98135 09147982687 09839353772 smithkimberly example org monicacraig example com i ——SS== Reams of photoco ry Paper Ethernet cables 4 . and connectors Desktop 551 computers (Core i5 i7) 42 5 ‘6% 2 ‘85 35350; Folders wiht aevess Cs 47362 24 ‘ayment shall be 30 days upon receipt of the tems above Discount (%) 10 46086 54 Other Cost ($) 1275 02 Shipping Handing ($) 34578 18 Total Amount ($) 40023 34"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER 99541477405 david 4 example com 4585 April 09 2001 ro Matthew Kirk Theresa Cunningham OPA naa COMP naa eYaughn F; lores Oliver Group Academy 23 Rayman eS 1310 y tin He Lak eee Raymond MP 94552 Isaacport mt Wy seed 09763158778 09615524117 fae 086 fae scones nathanco nrad example com lodriguezgary example net Office Chairs al hang type) Extern, hard drives LED lights and fixtu) eo colle Ones Bats, of photocdpy Paper” ‘Subtotal ($) Payment sha be 30 days, “PO receipt of the tems above 12395 14 Discount (4 10 47131 16 Other Cost ($) 25164 36 Shipping Handing ($) 19052 98 Total Amount ($) 5340 71"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER 244 Reymond SAI TIANS david 4 exampie com wate Cunningham Matthew Kirk ignn Flores B184 Nicole Bridge Suite 552 723, Raymondiort, M net 44 A524 es £6 41 SPAR oa a fixtures O 16 ari Ay SOeB. of photacopy paper 4 ae A QBiG4 8"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER Ali PLC. 4d Raymond Cove, ‘North ‘Darrenport, OK 9841477405 April 09 2001 david14 example com Se 4585 VENDOR CUSTOMER nae ingham Nae Theresa Cunnin' Matthew Kirk eae COMPANY NAME Vaughn Flores Oliver Group Academy 8181 Nicole Brida Suite 5 4310 Justin Harbors, Lake 723, Raymondfort, Isaacport, WY 2! 28659 PHONE Hone 09763158778 09615524117 nathanconrad example com rocriquezgary example net ‘Quantity Unit Price ‘Amount Product Description Office chairs (at justaple type) External hi dives LED a D lights and oF caltesbie pe Reems a i of photocopy aper Code re 42305 14 Payment shall be 30 days upon receipt of the items above Discount (%) 10 47131 16 Other Cost ($) 25164 36 shipping Handling (S) 49052 98 5340 71 Total Amount ($)"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER plea 723, Raymondiort 67 4 a 45 joss BGSL 5340 74 Total Amou"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "e44 Raymond diet Earempo. OK PURCHASE ORDER _ 99541477405 david14 example com [0 UWB Sr DATE a 4585 April 09 2001 NAME NAME Matthew Kirk Theresa Cunningham COMPANY NAME COMPANY NAME Vaughn Flores Oliver Group Academy anoress Aooress 8181 Nicole Bridge Suite 1310 Justin Harbors, Lake 723, Raymondfort, MP 94552 Isaacport, WY 28659 PHONE rion 09763158778 09615524117 EAL ADDRESS EMAL ADDRESS nathanconrad example com rodriguezgary example net I J Office chairs (adjustable type) External hard 4 . ‘ieure LED lights and 46 1 . UI ice 4 airs 7 calKtUtgs, ble type) Reams 3 é: i 2938 9 of photocopy paper Subtotal () 12395 14 Payment shall be 30 days upon receipt of the items above. Discount (%) 10 4713116 Other Cost ($) 25164 36 Shipping Handling (S) 19052 98 Total Amount ($) 5340 71"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "19162 PURCHAS SE ORDER floressaman, the eather Smith Ailey and Poway Instinties a. 4 Visor We, UC 31829 Danel Pas 093 pt cables and Ore onmpu ter E ie en ASO tables a 40046 49 28 F 1 poor 434 F584 ane SB Bue and cuslag 3 BSE 46 aaa 404 Be 447 stor BOXES Plastic 84 Bod 4 15 eae storage boxes 2O5E 2 38 429092} 19043. 20982 es 6834 47 $5836 43"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER pores Marvin Wilson _tieather Sonith Cooper and Sens 4 Powell instituie 663 Mary Plaza, Donnastire, DC 31829 9288682529 Qo3s7 742872 8834 47 3583645 3 03 Yagat Asmmure (8)"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "f Stora: Eas ie b> ah 2 boxe ie aus 8894 47"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER ARQ tables ay eh ana dusipan s A297 Slorage boxes 3 i 20582! storage boxes 19043 76 6 20982. 68 A? $5826 45 48296 03"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER fh, Bats Dexampie com we Marvin Wilson aap eather Smith capes aoe per and Sons siel} instiate 663 Mary Pla: Donnashire, DC 3 09288652529 corm Co ample. ri i sicrage boxe storage boxes Subtotal ast Fetal Amount 0)"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Mathis White 7622 Kristina Square Sule 191 PURCHASE ORDER Zimmermanborouch, 10 67688 comeyian278 le net Panderson example ne Prowwecn oe 2978 Octghes 21 James French commifta Cervantes Lambert PLC White, Andrade and Gallagher Schoo! 566 Ci ite 5 i i 7 Molisndtown Bese 25B VSS RARE Mais, 09239221174 09606692430 ylucas example org vkane example net Code Product Description Quantity Unit Price Amount Rulers and protractors partigee room and 453 4 $88 $6 dustpan sets USB flash “6 4 Ae y drives (32GB 64GB) 44 42827 38 Projector and screen set . Subtotal ($) 6785 85 Payment shall be 30 days upon receipt of the items above. Discount (%) 10 40165 96 Other Cost ($) 48053 47 Shipping Handing () 16670 73 Total Amount ($) 1037 26"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "Mathis Wnts, PURCHASE ORDER 7622 Kristina Square Suse, 191 TeZ2 Ket rou 67688 4 gn exaIn t panderson example ne' Perens Oe 2978 Octghes 21 James French _Jina Cervantes dob hieds Lambert PLC white, Andrade and Gallager ‘School 205 cone DEBIT SEMIN TS 09239221174 09606692430 vkane example net jucas example Org __— Quantity Rulers and protractors Office tables and 4 4 4 Ag partitions roomand 453 B dustpan sets USB flash 61 a) drives (32GB 64GB) 4a S027 ee Projector and screen set . 6785 85 Payment shall be 30 day$ upon receipt of the tems above Discount (*%) 10 40165 96 Other Cost (S) 48053 47 shipping Handing (8 16670 73 4037 26 Total Amount ($)"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "rathis Whi PURCHASE ORDER F) fa09 4: 498970 panderson exampie net 2978 Octobes 24 CUSTOMER, i pores wae James French canbita Cervantes Lambert PLC White, Andrade and Gallagher Schoo! 9566 Coffey Park S 555, gt tate 2 ~_Holiancton, BE so SPN FRGASBR Sus 5 092392211 74 09606692430 “ylucas example. Fg vkane example net os eoceacemnccertte Predict Besiphion. 2: SS Ranady 2 eGo Prey 2 ot and protractors 8 parti fice! gs arid 453 $34 bi ee e dustpan sets USB flash “6 4 drives (32GB 64GB) Projector and screen set Subictot i$) 6785 85 Payicznt shalt be Orscount 0 40165 98 Other Cost ($) 48053 47 iia aa 16670 73 Teta) Amount (3) 1037 28"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER 9991498979 VENDOR CUSTOMER awe wave James French cous iN Cervantes Lambert PLC White, Andrade and Gallagher School 29566 Coffey Park Suit 555, i Hollandtown DE were 2857S ae Estatse Sue Prone Puone 09239221174 09606692430 ylucas example org vkane example net r Code Product Description Quantity Unit Price Amount Rulers and Protractors perllenaissan 94 Yeesn ap dustpan sets USB flash 61 d he 4 Project ang oa) 1 Bee Subtotal ($) Payment shall be 30 days upon receipt of the tems abore 6785 85 Discount (%) 10 40165 96 Other Cost ($) 48053 47 Shipping Handing ($) 16670 73 Total Amount ($) 1037 26"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER pent James French ntii2 C rvantes param tote Lambert PLC white, And iach 29566 Coffey Park Suite 555, 8228 Natall Hollandtown, DE 62140 25 ua 99806692439 ogezse221174 4 ei 1 Aaeasee 4072. a4 eae 35 41 64 BZ Subtatel G) Caner Cnet (8"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER Gardner Lid itis Ramp! 8774 Brian Road onvilia, UT i Erinfand, MH 0582 09595178895 09108174149 ane AT hea athers4@ 2 17 30 94 O% if o. FCVEAD 6 50 Piastic storage boxes 3D 38 Printer paper (colored) a2 ae Boe 3797 12"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER David Erickson Miler Sons Academy 8774 Brian Road, Eriniand, MH 05429 09595178895 Jexample org 508 Plastic storage box 4? 23898 53 53 38) iO? Prin vier paper (colored) 23010 24 3534732 4219! 1049648"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER vid Erickson Academy Miller and Se Gardner Lid aatog Willis Ramp, N jorth Janathonvilie, UT 82735 R774 Brian Road. inland, MH 65428 \"99408174149 99595 178895 biliywr ghi hexam e net @exampie og 42 3389852 SER G16 78 388 23010. 24"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "see nsas ra eee ean, PURCHASE ORDER e642 7RN37 rsantana exampie com CEA, 1398 May 25 2008 prs vat Dennis Aguirre avid Erickson Gardner Lid Miller and Sons Academy comes aaonees 8774 Brian Road 84109 Willis Ramp, North Eriniand, MH 05429 Jonathonville, UT 82135 _ 09595178895 _ 09108174149 heather44 example org billywright example net fo RRR RCE tase i Pete DPaehiohiee 5 Saari, enters 388 Printer paper colored) 42 3889898 SYARY feat Subtotst (8) 23010 24 ayment shat be Oivoonunt (%) 19 35347 32 Other Cost (S) 12135 09 Shipping Handing (8) 3797 12 Total Amount (3) 10488 16"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "Callins, Cur Z sea een Gomer PURCHASE ORDER 09881738027 rsantana example com ERS 1398 May 25 2008 Dennis Aguirre _ Wavid Erickson COMPANY tae Gardner Ltd Miller and Sons Academy 8774 Brian Road, 84109 Willis Ramp, North Erinland, MH 05429 Jonathonviite, UT 82135 09595178895 09108174149 144 example org billywright exampie net PrOAgh Deretption. E Quaslify Bet Price <7 3G8 Printer papericolowed) 42 3889853 HARM Sunita 2301 24 pe perry Fs 35347 32 Other Cost (S) 12135 99 Sipping 8 Hendon 3797 12 Total Arment 3) 40488 16"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Day, Gilbert and Rowe 513 Carmen Plains Suite 258, Quinnches ter, PURCHASE ORDER 9137530418 emiller example com 3190 June 27 2011 wae wae Lynn Williams William Smith COMPANY Nae erenn Rivera LLC Parks Choi University 5020 Hunt Points. East 39233 Jean Curve, Lak Brittany, NH 34685 Beannahaven, M343, 09944996831 uaa A00RE SS 09783505850 kevinglenn example net r Euan ADORESS jeffkennedy example com LED lights and fixtures 348 (adjus Se Se) 33 39899 -07 3343357 Subtotal ($) Payment shal be 30 days upon recegt ofthe seme above 19261 23 Discount (%) 10 19526 77 Other Cost ($) 47492 96 Shipping Handing ($) 6882 82 Total Amount ($) 2366 75"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "eee PURCHASE ORDER ODA 37530418 ermiller exampie cem 3190 nS iam Sr Lynn Wi Rivera LLC"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "Day, Gilbert and Rowe 513 Carmén Plains Suite 258, Quinnchester PURCHASE ORDER 09137530418 emiller example com promamcn oe 3190 June 27 2011 Lynn Williams wom William Smith Rivera LLC Parks Choi University 5020 Hunt Points, East 39233 Jean Curve, Lak Brittany, NH 34682 Beannahaven, Mf 34449 09944996831 09783505850 kevinglenn example net jeffkennedy example com I es Code Product Description Quantity 0 Amount LED lights and fixtures 348 aqusaseyse) 93 3988757 25438 74 Subtotal ($) 19261 23 Payment shall be 30 days upon receipt of the items above Discount (*%) 10 19526 77 Other Cost ($) 47492 96 Shipping Handling ($) 6882 82 Total Amount ($) 2366 75"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "Day, Gilbert and Rowe PURCH ASE ORDER 513 Carmen Plains Suite 25°, Quinnchester, DE 79789 99137530418 emiller example com 3190 June 27 2011 VENDOR CUSTOMER Nae nae Lynn Williams William Smith annie courant NIE Rivera LLC Parks Choi University 5020 Hunt Points, East 39233 Jean Curve, Lake Brittany, NH 34682 Deannahaven, MT 34449 uo 09783505850 PHONE 09944996 831 nn example net j ffkennedy example com ‘Amount Product Description ‘Quantity Unit Price wg COMES 39 HH BEB Sa suet) 19261 23 Payment shal be 20 6ays upon reC8Pt Mitheitems above. Discount (%) 10 49526 77 ther Cost ($) 47492 96 shipping Handing (S) 6882 82 2366 75 Total Amount ($)"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "S020 Hunt Points Britany, NH 34 Paton 09944596834 ample, net iis and focures ntorat ($3"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER O86 Ritter Mews, Lake Nicholasion, Wi 46304 9569586 528 thomas 17 573, 24 268 04 145 ies COGBIBAGE) Sis Bee fen 7 287584 85"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "_ fark Wright de aca uber art Goeaten O86 Ritter Mews Lake 877 Burch Lane Ay Nicholaston. WH 48364 _Bleychester, Svc O986aSa6s2a 575 Office BSR ae, par eas 1 745 drives 32GB4 23 eh aL Bay 45"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "@ institute O86 Ritter Mews, Lake Nicholaston. Wi 46364 reac 2e 573 Office gene, nae ¥h art ane h on 208 145 drives (32 GBeae GB} 23 48 bs 45 e 24 78 67"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "PURCHASE ORDER NORAGAARIOS nodonaldsheena examPie org er aiaeeel Mark Wright _vistera Gonzalez neponnt, ms 308 Gene? Miller Mcgee institute pat sess 086 Ritter Mews, Lake §77 Burch Lane Apt. 624, Nichoiaston, Wi 46364 Rileychester, DC 24292 99669586528 7 @eKAMPle. FG ann Pepiilet DeaRPPtee Office tables, and nae sq QUOI, 22 arts THE subioia! () 27982 54 cones rn 4388 97 Other Coat (S) 33642 96 nipping S Hane 7391 9 28754 55 Fokal Anmvost (8)"
    }
]