[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Cruz Ltd 15376 Jones Mews, North PURCHASE ORDER Martinoort. Hi 88935 9447684205 —. Margh14 stephaniedoyie example com ~ ier “VENDOR INFORMATION VENDOR NAME SALES PERSON Meza, Rodriguez and Ramsey William Taylor ADDRESS 263 Larry Extensions, Port Joseph, FM 58156 CONTACT NO EMAIL ADDRESS khenderson example org Cu ISTOMER Nate CONTACT PERSON cones May Williams institute Rachel Gutierrez _ JISNV Butler, FPO AP 08593 CONTACT RO EMAIL ADORESS Details’ 423 Rulers and protractors First aid 1206. wv 3 kits Projector and screen set 1646 Projector and screen set j 4 fi Additional Notag™ Ss eo ee Subtotal 41521 18 Payment shall be 30 days upon delivery of ‘the sbove items, Discount (%) 42908. 28 Total Authorized By Christopher Graves Patent examiner"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "Cruz Ltd 15376 Jones Mews North Martinport. Hi 88935 PURCHASE ORDER 09447684905 Ma tght 4 Stephaniedoyle example com VENDOR INFORMATION: 8380 VENDOR NAME , SALES PERSON Meza, Rodriguez and Ramsey William Taylor ADORESS 283 Larry Extensions, Port Joseph, FM 58156 CONTACT NO. EMAIL ADDRESS: 098554 CUSTOMER INFORMATION CUSTOMER NAME May Williams institute AvUHESS Rachel Gutierrez USNV Butler, FPO AP 08593 CONTACT NO EMAIL ADDRESS garyadams vexample com F: Gaantitys F Unit Price ph 2 3 Rulers and protractors First aid 13068. 3: its Projector and Screen set 1646, : Projector and screen set q 7 Additional Notes: ; Subtotai Payment shall be 30 days upon delivery of the above items. 44521 18 Discount (5) 43956, 28 Tota! Authbrizedsey Christopher Graves Patent examiner"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "Cruz Ltd 13376 Jones Mews, North 1SH78 Jones Hi 88938 PURCHASE ORDER 09447684905 stephan ledoyle example com Marg Ll4 8380 Meza, Rodriguez a ADDRESS ind Ramsey William Taylor, Extensions, Port Joseon, FM 86758 DRESS: EMAN ap NAME May Williarms institute “USNY Butler, FRO AP gasga 4 3 Rulers and protractors First aig g3. kits Projactor ang eal va Subtotal 4152118 Discount (%) 43956. 28 Total 5508 6 Christopher Graves Patent examiner"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "Cruz Ltd 15376 J N Fe dongs MNS8O3S PURCHASE ORDER 09447684205 _ March 14 stephaniedoyle example com ou 67 VENDOR INFORMATION ‘VENDOR NAME SALES PERSON William Taylor Meza, Rodriguez and Ramsey ADDRESS 263 Larry Extensions, Port Joseph, FM 58156 EMAIL ADDRESS khenderson example org CONTACT NO 098 CUSTOMER INFORMAT 10N CUSTOMER NAME CONTACT PERSON ome May Williams Institute Rachel Gutierrez USNV Butler, FPO AP 08593 EMAIL ADDRESS CONTACT NO 09802566158 aryadams example com item No. Details Quantity Unit Price tot Rulers and protractors First aid 130683! 0. 133 kits Projector and screen set 1646 tae 4 f 4 Projector and screen set Additional Notes: Subtotal 41521 18 Payment shall be 30 days upon delivery of the above items. Discount (%) 43956 28 Total 5508 63 Authorized By Christopher Graves Patent examiner"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "Cruz Ltd 15376 Jones Mews, North Martinport. HI 88935 PURCHASE ORDER OG44 ?BE4908 eXaMDle corn Stephaniedoyle@ Mag 1 4 8380 Rodriguez and &, amgey Willian Taylor Port Joseph, FM 58756 EMAL 8S nderson@ Nex sows May Willhams USN But NEACT NGO nStitute Rachel Gutierrez er FPO Ap C8593 EMA, ADDRESS 49% Rulers and Protractors First aid i ri 3 5 Kits Projector ang Screen set 18068 39 4 04 48 PLZC OS 48 Projector ang Screen set rea6 TER Ae 4152718 43956. 28 5 Christoph er Graves Patent examiner"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "West, Vaidez and Henson 10903 Simmons Stravenue, West Thomas. MH 09477 PURCHASE ORDER 09434373435 August 10 jonescarrie exarnpis org eT 1 Hall Hawkins —— Lynn Morales ADDRESS 80864 Ryan Views Suite : NO. EMAIL ADDRESS andreacarrilo exampie com Eugeneland, MD 26427 Patrick Bradiey ea AQORESS Lepije for faculty staff Scissors r 3. 3 and cutters Computer tables and eit i £2. desks Desktop computers (Gore 5563 o a 44 F 15717) 1D lace and card holders 555 #e5 Reams of photocopy paper i Het ig 4 Rulers and protractors i 35 i Subtotal 4364 9 2 30 days upon delivery of the ab: Discount (%) 24250 6 Tota 72 4 Gail Weils Engineer, water"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "West, Valdez and Henson 10903 Simmons Stravenue PURCHASE ORDER West Thomas. 477 09434373435 August 10 jonescarrie example org DATE 001 PURCHASE ORDER NO 1614 VENDOR INFORMATION ‘VENDOR NAME SALES PERSON Hall Hawkins Lynn Morales ADDRESS 80884 Ryan Views Suite 978, Eugeneland, MD 26427 CONTACT NO. EMAIL ADDRESS andreacarrillo@ example com ‘CONTACT PERSON 0916 CUSTOMER INFORMATION Patrick Bradley CUSTOMER NAME Rodriguez, Schwartz and Cochran Academy oreyside, PR 98332 ADDRESS 45666 Benton CONTACT NO. 09080 bergerjennifer exam| le com Laptops for faculty staff Scissors 6. and cutters Computer tables and 4 i Be 5563 . 4 8 desks Desktop computers (Core and card holders 555 ; Squares Suite 348, C EMAIL ADDRESS i5 /i7) ID lace Reams of photocopy paper Rulers and protractors 1364 9 Additional Notes: Subtotal delivery of the above items. 24250 6 Payment shall be 30 days upon Discount (%) Total 32 51 Authorized By Gail Wells Engineer, water"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "West, Valdez and Henson 10903 Simmons Stravenue, PURCHASE ORDER West Thomas. MH 09477 994343 73435 August 10 Jonescarrie example org DATE 001 PURCHASE ORDER NO. 1614 VENDOR INFORMATION VENDOR NAME SALES PERSON Hall Hawkins Lynn Morales ADDRESS 80884 Ryan Views Suite 978, Eugeneland, MD 26427 CONTACT NO. EMAIL ADDRESS Q 6 e CUSTOMER INFORMATION CUSTOMER NAME Rodriguez, Schwartz and Cochran Academy ADURESS 45666 Benton Squares Suite 348, Coreyside, PR 98332 CONTACT NO. andreacarrillo@ example com CONTACT PERSON Patrick Bradley EMAIL ADDRESS 09080 bergerjennifer exam le com Laptops for faculty staff Scissors and cutters Computer tables and i §. b g 4 8 desks Desktop computers Gee 5563 : 15 Li7) ID lace and card holders 555 E Reams of photocopy paper 4 Rulers and protractors 4 Additional Notes: Subtotal 1364 9 Payment shall be 30 days upon delivery of the above items. Discount (%) 24250 6 stat 312325 Gail Wells Engineer, water"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "West, Valdez and Henson 10903 Simmons Stravenue, West Thomas. MH 09477 PURGCARSE SORMER 99434373435 Avoust 49 jonescarrie exampie org 3001 1614 Hall Hawkins Lynn Morales ADDRESS 8086: SONTACT NO. yan Views Suite 976, Eugeneland, MD 26427 Patrick Gradley EMAIL ADDI vRESS ONO Laptops for faculty staff Scissors ' 24 8 704. 44 and cutters Computer tables and ore is j £8 desks Desktop computers (Core 556 6 3 51 8 5 6117) iD lace anc card holders c ay mn eA eams of pholocepy paper ae ey Rulers and orotraciors 19 72 es 14 Subtotal 1364 9 Discount (%) 7 242508 Total CVS) Gail Wells Engineer, water"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "West, Valdez and Henson 16203 Simmons Stravenue, : IER West Thomas. NH Daf PURCHASE ORDER 99434373435 Jonescarrie example org VENDC? NAME August 10 O04 1614 Hall Hawkins Lynn Morales fan Views Suite 878 Eugenetana, MD 26427 guez, Schwartz and Cochran Academy Non Squares Suite 348, Coreyside, pI Patrick Bradley R 98332 EMAIL ADDRESS Laptops for faculty s laff Scissors 348. 4 4 43 anc cutters Computer tables and . g j 8 desks Desktop computers (Core 5563 aes ey IS I7 ID iace arid card holders 555 sees Reams of photocopy Paper : nat Wers and Drotractors 2 4639 74 Subtotat 1364 9 Discount (2%) 24259 6 Totat 31232 5 Gail Welis Engineer, water"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Copeland Hobbs 92552 Bar Trail, Lake 4 Catone ae Daaae PURCHASE ORDER OGOBR2AB Ti? igordon example org May 19 2025 7 SALES PERSON ; Fuller Jones Shane Rosales ADDRESS: Unit 4293 Box 2088, DPO AE 61546 fe ACT NG EMAIL ADORESS lesspencer example com Jeffrey Flores EMAIL ADDRESS diana i4@ Folders with fast ers Office 8 oi G3 diustab Bie tye) gt hoo : 8 signage and labels Extermal hard 2334 drives LED lights and fixtures 263 Extension cords and power strips Staplers and Staple wires i a 1 Subtotal 2274494 Discount (%) otal Craig Cummings Editor, magazine features"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "Copeland Hobbs 52552 Berg Trail, Lake Catherine. PR 24336 PURCHASE ORDER 09068286717 'gordon example org on cco Mey 2 2025 PURCHASE Of DER NO. VENDOR INF! ORMATION VENDOR NAME SALES PERSON Fuller Jones Shane Rosales ADDRESS. Unit 4293 Box 2089, DPO AE 61546 CONTACT No. EMAIL ADDRESS amesspencerG example com 0 8 CUSTOMER INFORMATIO} CUSTOMER NAME CONTACT PERSON sess Stephens Miles Institute Jeffrey Flores 485 Vaughn Vista Suite 995, Russellbury, SC 04 731 CONTACT NO. EMAIL ADDRESS 0984780 diana14 exam le net olders with fastener. ffice fale ladjustaBr type) Sifce, d 8 signage and labels xternal hard 2331 drives LED lights and fixtures xtension cords and Power strips Staplers and staple wires Additional Notes: Subtotal Payment shall be 30 days upon delivery of the above items. Discount (%) 5223 74 Total 32840 75_ Craig Cummings 22741 94 Editor, Magazine features"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "Copeland Hobbs 52552 Berg Trail, Lake PURCHASE ORDER Catherine. PR 24336 09068286717 pate. May 49 2025 PURCHASE ORDER NO 3956 tgordon example org VENDOR INFORMATION ‘SALES PERSON VENDOR NAME Fuller Jones Shane Rosales ADDRESS Unit 4293 Box 2089, DPO AE 61546 CONTACT NO. EMAIL ADDRESS: jamesspencerG example com 0904 CUSTOMER INFORMATIO! CUSTOMER NAME, CONTACT PERSON Stephens Miles Institute Jeffrey Flores bury, SC 01731 EMAIL ADDRESS ADDRESS 485 Vaughn Vista Suite 995, Russell CONTACT NO. diana14 exam) ae 9984780 tom No. Details Foldorsatlttabis type) Qthoot Wing 4 labels xternal hard 233 1 ; 263 i : 34 9 1: 4 3 signage and la drives LED lights and fixtures Extension cords and power strips Staplers and staple wires 22741 94 Subtotal Payment shall be 30 days upon delivery of the above items. Discount (%) 5223 74 Total 2 3 75 Authorized By Craig Cummings Editor, magazine features"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "Copeland Hobbs 52552 Berg Trail, Lake PURCHASE ORDER Catherine. PR 24336 09068286717 May 19 2025 tgordon example org oate: May PURCHASE ORDER NO. 3956 VENDOR INFORMATION VENDOR NAME SALES PERSON Fuller Jones Shane Rosales ADDRESS Unit 4293 Box 2089, DPO AE 61546 CONTACT NO. EMAIL ADDRESS jamesspencer example com CUSTOMER INFORMATIO! CUSTOMER NAME CONTACT PERSON Stephens Miles Institute Jeffrey Flores ADURESS 485 Vaughn Vista Suite 995, Russellbury, SC 01731 CONTACT NO. EMAIL ADDRESS 0984780 diana14 example net ‘olders with fasteners Office nies (adjustable type) Steer j signage and labels External hard 2331 drives LED lights and fixtures 263 Extension cords and power strips Staplers and staple wires Additional Notes: Subtotal 22741 94 Payment shall be 30 days upon delivery of the above items. Discount (%) 5223 74 ae 840 7 Craig Cummings Editor, magazine features"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "Copeland Hobbs 52552 Berg Trail, Lake PURCHASE ORDER Catherine. PR 24336 tgordon exampl or oe May 19 2026 9 ple org PURCHASE ORDER NO 3956 VENDOR INFORMATION VENDOR NAME SALES PERSON Fuller Jones Shane Rosales ADDRESS Unit 4293 Box 2089, DPO AE 61546 CONTACT NO. EMAIL ADDRESS jamesspencer example com CUSTOMER INFORMATION CUSTOMER NAME CONTACT PERSON spores Stephens Miles Institute Jeffrey Flores .485 Vaughn Vista Suite 995, Russellbury, SC 01731 CONTACT NO. EMAIL ADDRESS 0984780 diana14 example net olders with fasteners Qffice c ol (a fustable t pe) ghee j signage and labels External hard drives LED lights and fixtures Extension cords and power strips Staplers and staple wires Additional Notes: Subtotal 22741 94 Payment shall be 30 days upon delivery of the above items. Discount (%) 5223 74 Total 32840 75 Authorized By Craig Cummings Editor, magazine features"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Ramirez Long USNV Lynch, FPO AE PURCHASE ORDER 09820258295 D rossjennifer example org oate: SBOP 5 PURCHASE ORDER NO. 4289 VENDOR INFORMATION VENDOR NAME SALES PERSON Rios, Ballard and Rowland Lori Lopez MD ADDRESS: 354 Jennifer Junctions, New Kimberlytown, NY 37237 CONTACT NO. EMAIL ADDRESS david23 example com ‘CONTACT PERSON 09268 CUSTOMER INFORMATION Andrew Price CUSTOMER NAME Werner, Smith and Serrano University ADDRESS 40863 Ramirez Falls Apt. 408, New Katie, VA 45119 EMAIL ADDRESS je net CONTACT NO. 09965653984 jamesbrown exam le. External ard drives Et etnet 4 a wh cables FR gone ace 4 8 waPcard holders Plastic storage 3235 2g 2 boxes Broom and dustpan sets 141 Manila folders and envelopes 7 Broom and dustpan sets 41703 7 Additional Notes: Subtotal delivery of the above items. 9511 92 Payment shall be 30 days upon Discount (%) 4900 19 Total Authorized By Jennifer Taylor ‘Advertising account executive"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "Ramirez Long USNV Lynch, FPO AE 09820258295 rossjennifer example org PURCHASE ORDER ve OReBipber 4289 VENDOR INFORMATION VENDOR NAME SALES PERSON Rios, Ballard and Rowland Lori Lopez MD ADDRESS 354 Jennifer Junctions, New Kimberlytown, NY 37237 CONTACT NO. EMAIL ADDRESS david23 examp le com 09268 66 CUSTOMER INFORMATION CUSTOMER NAME Werner, Smith and Serrano University ADDRESS 40863 Ramirez Falls A\\ CONTACT No. CONTACT PERSON Andrew Price pt. 408, New Katie, VA 45119 EMAIL ADDRESS 0996 984 jamesbrown@ example net item No. Details auantty Unit Price psoas pret AOR $8594 18 an card. ders B stic storage 6744 38 Oxes gh and Tasti t sets 8 i? 44 8 iA Manila folders and envelopes i Broom and dustpan sets Additional Notes: Subtotal P 41703 7 ‘ayment shall be 30 days upon delivery of the above items. Discount (%) 9511 92 Total 4900 19 Jennifer Taylor Advertising account executive"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "Ramirez Long USNV Lynch, FPO AE PURCHASE ORDER 381296 09820258295 Decemper rossjennifer example org Te 2078 FVENDE : Lori Lopez MD le com aS Werner, Smith and Serrano University nt Fi era ard cr Ethemet 40. 24 234 73 oC ag pain dgoan sears Place began if) a iat jee and card h vod ers Plastic slorage 3235 He 4a i ae x boxes Broom and dustpan sets Pay ee 30 a Manila folders and envelopes a Broom and dustpan sets Subtotal AV O3 7 9511 92 Advertising ac"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "Ramirez Long USNV Lynch, FPO AE 59820758205 rossjennifer example org PURCHASE ORDER 4289 Rios, Ballard and Rowland “Lori Lopez MD iter Junctions, New Kimberlytown, NY 37237 conTacT No. We ner S mith and Serranc University Andrew Price 40863 Ramirez Fa alls Apt. 408, New Katie, VA 45149 CONTACT NO. EMAIL ADDRESS Exter nal hard drives Ethe, jeinet 26 Ag boxes Broam and dustpan seis 3285 Manila folders and envelopes 7 24 49 34 73 ei ct 133 gledieanreae Wes, es i Broom and dustpan sets He ir CEs Subtotal 41703 7 Discount £%) Total Jennifer Taylor Advertising account executive"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "Rarnirez Long USNV Lynch, FPO AE PURCHASE ORDER 26190 09870258205 PEST 4289 rossiennifern examople org E Rios, Ballard and Rawiand Lori Lopez MD Nb Hf Junclions, New Kimberlyiown, NY 37237 EMAIL ADORESS david N Andrew Price EMAIL ADRESS jamesbrown e. ER hard drives Ethemet es ee 493 connect ors lace é cd care Roiders asiic storage 32 Manila folders and envelopes Broom and dusipan sets 4 3 8 hoxes Broom and dusipan sels 14 fu a uC eee z Subtotal 441703 7 Discount (55) 9511 92 Total 4900 49 Jennifer Taylor Advertising account executive"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Maldonado LLC 991 Black Branch Suite 931. PURCHASE ORDER 09958585418 j ylong example org one SURGE mn poerno: 1719 VENDOR INFORMATION VENOOR NAME SALES PERSON Raymond, Fox and Huynh Erica Graves ADDRESS 701 Steprame Creek Apt. 624 Jopnsonvitie, GU 52975 CONTACT NO EMAIL ADORESS {) 4 CUSTOMER INFORMATION CUSTOMER NAME CONTACT PERSON comes Harris PLC Academy Karen Wilkinson 0686 Michels Plains Sute 552, New Oommiqueshire, OK 30757 CONTACT NO. EMAIL ADDRESS cooperrobert examp le net f Quactiy fait Price J USB flash drives (32GB 64GB) Projector and screen set Ballpens j 2 and pencils (various brands Office tables and partitions File cabinets (2 drawer 4 drawer) First aid kits Reams of photocopy paper Additional Notes: sean Sek Sen Subtotal 47566 22 Payment shall be 30 days upon delivery of the above items. Discount (%) 33081 79 Total ‘Authorized BY Harry Rornero Further education lecturer"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "Maldonado LLC g91 Black Branch Suite 031, PURCHASE ORDER Justinmouth. NE 85634 9995858541 8 DATE Junge? PURCHASE ORDER NO 4719 ylong example org ‘SALES PERSON Erica Graves ADDRESS 701 Stephanie Creek Apt. 624, Johnsonville, Gu 52975 EMAIL ADDRESS CONTACT NO. CONTACT PERSON Karen Wilkinson ‘CUSTOMER ‘NAME, Harris PLC Academy ADURESS 0666, Michelle Plains Suite 552, New Dominiqueshire, OK 30757 CONTACT NO. EMAIL ‘ADDRESS operrobert exam Je net Subtotal 47566 22 bove items. Discount (’) 33081 79 04 ‘Additional Notes: Payment shall be 30 days upon delivery of the al Total Authorized By Harry Romero Further education lecturer"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "Maldonado LLC 991 Black Branch Suite 031, Justinmouth, NE 85634 99958585418 PURCHASE ORDER vlong example org 7 ove Syne 23 RCHASE ORDER No 1719 VENDOR INF ORMATION VENDOR NAME SALES PERSON Raymond, Fox and Huynh ADDRESS 701 Stephanie Creek Apt 624, Johnsonville, GU 52975 CONTACT No, EMAIL ADDRESS 0954 8 CUSTOMER INFORMATION CUSTOMER NAME Harris PLC Academy AUURESS, -2666 Michelle Plains s Karen Wilkinson uite 552, New Dominiqueshire, OK 30757 CONTACT NO. elopez@ e xample net CONTACT PERSON EMAIL ADDRESS 0948950459 Cooperrobert Mexample net SS and partitions Fle Cabinets (2 USB flash drives 4 ig ~drawer 4 drawer) 545 First aid kits Ream p. (32GB 64GB) Projector and scre 1 S of photocopy 3 seg BH 3 65 aper Nn set Ballpens and pencils (various brands Office tab] Additional Notes: Subtotal Payment shall be 30 days Upon delivery of the above items, Discount (%) 33081 79 Total 20204 74 Harry Romero 47566 22 Further education lecturer"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "Maidonado LLC 991 Black Branch Suite 03 |, PURCHASE ORDER Justinmouth, NE 85634 69958585418 Jupe 23 ylong example org {719 t Erica Graves Karen Wilkinson Pains Sete 952 Mew Domungueshins OK EMAL BDORES USB flash drives (32GB 64G 42 Projector and sereen set Balgens 3dgne 8 § 123 and pencils (various brands) He oe 4 58 Office tables and partitions File 31 46 3 5 ih ibe cabinets (2 drawer 4 drawer) aan BP J Be First aid kits Reams of photocopy Ree 308: ge OS aeees4 paper Subtotal 47566 22 Discs 33081 79 Tota Harry Romero Furtne educaiton lecturer"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "Maldonado LLC 991 Black Branch Suit 031, Justinmouth, NE 85634 PURCHASE ORDER 09958585418 J 3 ylong example org DATE BBS PURCHASE ORDER NO 1719 VENDOR INFORMATION VENDOR NAME SALES PERSON Raymond, Fox and Huynh ADDRESS Erica Graves 701 Stephanie Creek Apt 624, J lohnsonville, GU 52975 CONTACT No. EMAIL ADDRESS 0954 8 CUSTOMER INFORMATION CUSTOMER NAME elopez@ example net CONTACT PERSON wvess Harris PLC Academy Karen Wilkinson 0666 Michelle Plains Suite 552, New Dominiqueshire, ok 30757 CONTACT NO. EMAIL ADDRESS 0948959450 Cooperrobert exam le net USB flash drives (32GB 64GB) rojector and screen set Ballpens : J and pencils (various bran Ss 3146 3 1 Office tables and Partitions File 545 Cabinets (2 drawer 4 drawer) First aid kits Rea f ph 1 Ms of p jotocopy b 4206 Pi Paper Additional Notes: Subtotal Payment shall be 30 days Upon delivery of the above items, Discount (%) 33081 79 Total 0204 74 Harry Romero 47566 22 Further education lecturer"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Dickerson Lid 81583 Sarah Place, psa Combun DE Si4 PURCHASE ORDER 09298834902 Fefeqeny Be kingdonald exampile net p08 5057 _ Myers Group _ _ et _Charlas Shaw 428, Seuth Maryneven, VA EMAL ADDRESS anoieess Garcia Jenki ns University Brittany Rios _. Unik: 3745 Box 8737, DPO AE 72465 Bond paper (A4, short, long) Extension cords and power strips a ae Sciss rs ge outt ars with fasioners fle cabinets Scrawer! BAS Bs 4) anise 4 drawer) Office teblesand oe Be 7 partitions Office tables and aig 7 25688 Hy partitions | Subtotal 35097 11 ent shall be 30 days upon delivery of the above items Discount (%) __ 36884 37 UGE 44425 65 Sean Harris Radiation proteciion practitioner"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "Dickerson Ltd 81583 Sarah Place. North Corvbury, DE 51440 URCHASE ORDER D99288 34999 Kingdoy Nald exampie net Febsuary 20 200: 3057 _ Myers Group _ Charles Shaw 7 Metaughin Centar Apt via South Maryhaw ¥en. VA 7850 EMAIL ADDRESS, Garcia Jenkins University Brittany Rios £3745 Box &737, DPO AE 72465 GONTAGY T A \"EMAIL ADDRESS Bond paper (A4, short, fong) E extension cords ang ower B54, Z f strips £8 Scissors and c ufters Fol isers with OD a $35 1 fasteners #4 le cabinets (2. crawer d P au 4 drawer) Office tablos and 3 oS iad pattitions Office tables and “ae Pe 4% partitions Subtotal 35097 14 Disee Total Sean Harris Radiation Protection Practitions;"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "Dickerson Lid 81583 Sarah Place, North j Corvburyv. DE 57416 PURCHASE ORDER 09298834999 February 20 Kingdonald example net 200 5087 ERSON _ Myers Group Charles Shaw sDDRESS 8077 Mciaugh center Apt. 129, South Maryhaven, VA S04 CONTACT NG. EMAIL ADDRESS MER NAME sous, “Atcla Jenkins University _ Unit 3745 Box 8737, DPO AE 72465 CONTACT NO. Bond paper (Ad, short, long) Extension cords and power strips 933 bh set 4 z2 Scissors and cutters Folders with 2484 S606?\" 5 3752 4 4 5 fasteners File cabinets (2 drawer 3 55 fel 55 “ARO BS 4 drawer) Office tables and p hee is es a panttions Office apies and 4a be 7 SERaS Subtotal 35097 14 Discount (%} 36884 27 _ +, 44425 65 Sean Harris Radiation protection practitioner"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "Dickerson Ltd 81583 Sarah Place, North Corvburv, DE 51410 PURCHASE ORDER 09228834999 kingdonald example net VENDOR INFORMATION VENDOR NAME a February 20 DATE 200 5057 SALES PERSON Myers Group ADDRESS Charles Shaw 8077 Mclaughlin Center Apt 0129. South Maryhaven, VA 5 CONTACT NO, EMAIL ADDRESS 09538 0 CUSTOMER INFORMATION Vvanessa41@ €xample com CUSTOMER NAME CONTACT PERSON svvnesy CAlCia Jenking University Brittany Rios _ Unit 3745 Box 8737, DPO AE 72465 CONTACT NO. EMAIL ADDRESS 099366 9 Mpittman @Mexample net Bond paper (A4, short, long) Extension cords and power st d ders with i OB Eee 188 Sasso IPeapnes (drawer 246 4 nas 4 drawer) Office tab 8 es and 304 Partitions Office tables and 861 8 10 Partitions 4 eek 28a Additional Notes: Subtotal Payment shall be 30 days upon delivery of the above items. 35097 11 Discount (%) 36884 37 Total 44425 65_ Sean Harris Radiation Protection practitioner"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "Dickerson Lid 81983 Sarah Place, North Pl IASE OR Gorybury, DE 51470 JO ONS HOPPRRSA2999 February 2 E008 kingdonaid exampie neat oa _ Myers Group Charles Shaw 129, South Maryhaven, VA EMAIL ADDRESS Garcia Jenkins University Brittany Rios 3745 Box 8737, DPO AE 72465 oe Bond paper (A4, short, long! extension cords and p power ots TEs E bor Ss 2: issors pute will 4 1g8 SSeRee Ae abnce seeder 2488 ER aes 4 drawer) gece fables and ve 3 48 61 yee f partitions Office tables and ‘i e partitions 4aQb8 47 2068872 Subtotal 35087 74 f snall be 3G days up: Discount (%} 36884. 37 Tetal"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Martin, Brooks and Davis 915 Griffith Pines, Adamsside. PR 97725 PURCHASE ORDER Haneascass® care, April 06 2008 williamward example net is auncwase ooerno. 7074 VENDOR INFORMATION os VENDOR NAME SALES PERSON Hall, Evans and Barr Elizabeth Anderson ADDRESS: USNV Griffith, FPO AE 57374 CONTACT NO EMA L ADDRESS 95099204 CUSTOMER INEORMATION. CUSTOMER NAME CONTACT PERSON woe Conner, Cruz and Miller College Anthony Barajas Ke 441 Brandon Vista Suite 519, Myersview, AK 41394 CONTACT NO. EMAIL ADDRESS USB flash drives (32GB 64GB) Printer ink cartridges School 4 92 4 j 3 signage and labels Manila folders 6556 4 é and envelopes Rulers and 25 4 protractors LED lights and fixtures s File cabinets (2 drawer 0) 4 drawer} Asaitional Notes: (3775 26 rae x ee Subtotal 4910 83 Payment shail be 30 days upon delivery of the above items. Discount (%) 47255 19 Total ‘Authorized By: Cory Vega Soil scientist"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "Martin, Brooks and Davis $15 Griffith Pine Adamsside. PR 97725 PURCHASE ORDER 09864464802 williamward example net ome April 06 2008 _ 7074 VENDOR INFORMATION. VENDOR NAME SALES PERSOM Hajl, Evans and Barr Elizabeth Anderson ADDRESS USNV Griffith, FPO AE 57314 CONTACT KO. EMAIL ADDRESS 96099 4 SUSTOMER INFORMATION TEAS CUSTOMER NAME CONTACT PERSON Conner, Cruz and Miller College Anthony Barajas ADUKESS 441 Brandon Vista Suite 519, Myersview, AK 41394 CONTACT NO EMAIL ADDRESS anita9S example net Fe Quantity init Brice 2), Total, USB flash drives (32GB 64GB) Printer ink cartridges School 4 . signage and labels Manila folders 6556 4 j é 3 and envelopes Rulers and SO5 4 protractors LED lights and fixtures 5 File cabinets (2 drawer ai 4 drawer) Adadwional Notes-<-: Ces e Beato Subtotal 1910 83 Payment shail be 30 days upon ‘delivery of the above items. Discount (4%) 47255 19 Lon 1609 55 ‘Authorized By Cory Vega Soil scientist"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "Martin, Brooks and Davis 915 Griffith Pines, 8 i Adamsside, PR $7725 PURCHASE ORDER 09864464802 says are. April OGE wiliamward example net April 06 2006 7074 Hall, Evans and Barr Elizabeth Anderson ALDRESS USN Griffith, FPO AE 57314 CONTACT NO. EMAIL ADDRESS Kimber) Anthony Barajas ERAN AORESS USB flash drives (S2GB 64GB) Printer ink cartridges Schoo! A aries P al 65 8 6 pea Aen 3 ae 49% signage and labels Manila folders 58 4 and envelopes Rulers and 2 4 2 protractors LED lights and fixtures Fe ‘e3 ‘UR File cabinets (2 drawer ie 4 na 4 4 drawer) . Subtotal 1910 83 Discount (%} 4725519 Totat 4 BS Cary Vega Soll scientist"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "Martin, Brooks and Davis 915 Griffith Pines Adamsside. PR 97725 PURCHASE ORDER 09864464802 williamward example net oar April 06 2008 PURCHASE ORDER NO 7071 VENDOR INFORMATION VENDOR NAME SALES PERSON Hall, Evans and Barr Elizabeth Anderson ADDRESS USNV Griffith, FPO AE 57314 CONTA EMAIL ADDRESS kimberly67 exam 096099204 CUSTOMER INFORMATION CUSTOMER NAME Conner, Cruz and Miller College AUURESS: 441 Brandon Vista Suite 519, Myersview, AK 41394 CONTACT NO. le com CONTACT PERSON Anthony Barajas example net Unit Price Total EMAIL ADDRESS anita95@ Quantity Item No. Details use bi trives (32GB 64GB) cartridges School 4 9 z| a signage and labels Manila folders 6556 § and envelopes Rulers and 205 J Protractors LE lights and fixtures File cabinets (2 drawer 3; 4 drawer) Additional Notes: Subtotal Payment shall be 30 days upon delivery of the above items. 1910 83 Discount (%) 47255 19 Total 609 Cory Vega Soil scientist"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "Martin, Brooks anc Davis 915 Griffith Pines, Adamesiat DR e995 PURCHASE ORDER NOBE4464805 Avril sy willarmward example net April 06 2008 1974 ON Hall, Evans and Barr Elizabeth Anderson ADDRESS USNV Griffith, FPO AE 57314 CONTACT NO. USB flash crives (32GB 64GB) Printer ink one ecges S School Boge. 2 Ly 4: 23 signage and iabels Manila folders 556 aa i 4 48 8 and toe LED Rulers and 89 35 i 4 4 Protractors LED lights and fixtures fs File cabinets (2 drawer tah 4 a 4 crawer) Subtotal 1910 83 Discount (%) AF255, 19 Total Cory Vega Soll scientist"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Flowers Lid Unit 1104 Box x AOt6, pro PURCHASE ORDER ont IOT86 pate Desemert 9807 bro wajoshua example. Org Ronald Smith Harison Kelly RODRESS Ridge Apt. 286, North Tromaston, DE 28878 iia Kim Olsen Patton Institute si James, NV 1 FSA6 oO Broom and dusipar sets First aid hy rea fe ag 2020 BE ae 4 ie kits Extension oor strips Printer paper ds and power (colored Subiotal Discount OH) Total Sherry Rowe Ressarch scientist (medical)"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "Flowers Ltd Unit 1104 Box 4916, DPO PURCHASE ORDER AP 78706 ae org DATE Dssgmmber PURCHASE ORDER NO 9807 VENDOR NAME ‘SALES PERSON .Harrison Kelly Ronald Smith ADDRESS 3114 Kim Ridge Apt. 286, North Thomaston, DE 26678 CONTACT NO. EMAIL ADDRESS kimberlystevens examp O9 3 60 CUSTOMER INFORMATION CUSTOMER NAME CONTACT PERSON Susan Gonzales example com Unit Price Total 123 Broom and dustpan sets First aid 4 wv 3 kits Extension cords and power 2521 i strips Printer paper (colored) 4 il i Olsen Patton Institute ADURESS .332 Valerie Branch Apt. 256, East James, NV 17946 CONTACT NO. EMAIL ADDRESS smithjuan@ Quantity Item No. Details Additional Notes: Subtotal 35559 8 Payment shall be 30 days upon delivery of the above items, Discount (%) 38126 45 Total 0885. 36 Authorized By Sherry Rowe Research scientist (medical)"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "Flowers Lid Unit 1104 Box 496, BPO PURCHASE ORDER P 78706 99011770798 December prownjoshua exampie org SeSHHF _Harrison Kally Ronald Smith 3, North Thomasion, OE 26678 EMAIL ADDRESS kimberlystevens! Y PERSO! Olsen Patton institute Sugan Gonzales jerie Branch Apt. 286, East Janes, NV 4TBAS 423 Broom and dusipan sets First aid ie 8 kits Extension cords and power 2521 ie 038 strips Printer paper (colored) Subtotal -35559 8 Payment shall b Discount (%)} 38426. 45 Total Sherry Rowe Research sclaniist (medical)"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "Flowers Lid Unit 1104 i Box Aoi. DPO PURCHASE ORDER 6 nent roe dese er brownioshua example org “35 re Ronald Smith EMAL. _kimberlystevens Olsen Patton Institute Susan Gonzaies erie Branch Apt. 256, East James, NV 17946 EMAIL ADDRESS room and dustpan sets First aid 48 ip 314 123° “kits Extension cords and power 2524, oe i 133 strips Printer paper (colored) 38 20. ah 46 bY BS “Subtotal 35559 8 Payment Sherry Rowe Research scientist (medical)"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "Flowers Lia Unit 1104 Box 4916, OPO PURCHASE ORDER AP 78706 HOOti7 70798 ngs cos SREY brownjoshua example org 9807 _HarrisomKelly Ronald Smith ADDRESS 9174 Kim Ridge Apt. 288, Norik Thomaston, DE 26878 EMAIL ADDRESS CONTACT NG t Olsen Patton Institute Susan Gonzales ie Branch Apt 256, East James, NV 17946 EMAIL ADDRESS Broom and dustpan sets First aid strips Printer paper (colored) 4802279 31489. 123 its Extension cords and power 2524 ale aa ig Rane 4 P JSe8BE AKO? 28 Subtotal 25950 8 Discount (% 38126 45 Total 5 Sherry Rowe Resaaroh scientist (medical)"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Mckay LLC 97315 Brown Spurs, Andradeburah. MA 22000 PURCHASE ORDER 09327884688 karias example net pare: May 18 2018 PURCHASE ORDER NO. 8476 VENDOR INFORMATION VENDOR NAME SALES PERSON Watson, Serrano and Burton Jason Stephens ADDRESS 4872 Alexander Curve Suite 716, Hardytown, RI 30481 CONTACT NO. EMAIL ADDRESS 09448 6 noahlee example net CUSTOMER INFORMATION CUSTOMER NAME CONTACT PERSON aways Avila and Sanders College Candice Robertson ..6450 James Hill, West Edgar, SC 75875 CONTACT NO. EMAIL ADDRESS Q9 i exam, =a Staplers and staple wires aarey 18 1 4 3. Whiteboard markers (assorted 5153 8 fe colors) Broom and dustpan sets $35 94 34 xternal hard drives Additional Notes: Subtotal 36582 38 Payment shall be 30 days upon delivery of the above items. Discount (%) 32238 19 Total 18395 68 Harold Nguyen Pilot, airline"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "Mckay LLC 97315 Brown Spurs, Andradeburah. MA 22600 PURCHASE ORDER 09327884688 karias example net pate: May 18 2018 PURCHASE ORDER NO 8476 VENDOR INFORMATION VENDOR NAME SALES PERSON Watson, Serrano and Burton Jason Stephens ADDRESS 4872 Alexander Curve Suite 716, Hardytown, RI 30481 CONTACT NO. EMAIL ADDRESS 09448 6 noahlee example net CUSTOMER INFORMATION CUSTOMER NAME CONTACT PERSON wom BatTY: Avila and Sanders College Candice Robertson ..6450 James Hill, West Edgar, SC 75875 CONTACT NO. EMAIL ADDRESS 09 eo exam com Staplers and staple wires 1 3 3. Whiteboard markers (assorted 5153 i colors) Broom and dustpan sets Bee 4. ue xternal hard drives Additional Notes: Subtotal 36582 38 Payment shall be 30 days upon delivery of the above items. Discount (%) 32238 19 Total 18395 68 Authorized By Harold Nguyen Pilot, airline"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "Mckay LLC 97315 Brown Spurs, Andradeburan. MA 22000 PURCHASE ORDER ove May 18 2018 G9327BRA688 karlas example net 8476 Jason Stephens Watson, Serrano and Burton ander Cure Sue 776, Hardyiown, REGO4S4 EMAR ABDRESS ON Candice Robertson ay: Aviia and Sanders College 6450 James Hill, West Edgar, SC 75875 TNO. EMAIL ADDRESS smith Staplers and steple wires 42 4 3 133 Whiteboard markers (assorted 5453 i ISS as alg #80 colors) Broom and dustpan seis 2 343 3 j yternal hard drives 36582 38 Subtotal Discount (5) 32236 19 Total 48395 68 Harold Nguyen Pilot, airline"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "Mckay LLC 97315 Brown Spurs, Andradeburah. MA 22600 ieee 09327884688 karias example net pare. May 18 2018 PURCHASE ORDER NO. 8476 VENDOR INFORMATION VENDOR NAME SALES PERSON Watson, Serrano and Burton Jason Stephens ADDRESS 4872 Alexander Curve Suite 716, Hardytown, RI 30481 CONTACT NO. EMAIL ADDRESS 09448 6 noahlee example net CUSTOMER INFORMATION CUSTOMER NAME CONTACT PERSON mom Baty, Avila and Sanders College Candice Robertson ..6450 James Hill, West Edgar, SC 75875 CONTACT NO. EMAIL ADDRESS 09518 6 smithmichael example com Item No. Details Quantity Unit Price Total Staplers and staple wires 42767 1 1 3 3. Whiteboard markers (assorted 5153 ef ig 4 P 9 colors) Broom and dustpan sets 3 len 4 4s xternal hard drives Additional Notes: Subtotal 36582 38 Payment shall be 30 days upon delivery of the above items. Discount (%) 32238 19 Total 8395 68 Authorized By Harold Nguyen Pilot, airline"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "Mckay LLC 97315 Brown Spurs, Andradeburah. MA 22000 PURCHASE ORDER 09327884688 karias example. net ore. May 18 2018 PURCHASE ORDER No. 8476 VENDOR INFORMATION VENDOR NAME SALES PERSON Watson, Serrano and Burton ADDRESS Jason Stephens 4872 Alexander Curve Suite 716, Hardytown, RI 30481 CONTACT NO. EMAIL ADDRESS 09448 CUSTOMER INFORMATION noahleeG example net CUSTOMER NAME CONTACT PERSON sonBarry, Avila and Sanders College Candice Robertson -.6450 James Hill, West Edgar, Sc 75875 CONTACT NO. EMAIL ADDRESS Item No. 6 smithmichael@ example com Details Unit Price Total lers and Staple wires 1 3 3 Whiteboard markers (assorted Bier a8 a 5153 ie S 49204 69 OS atornal Ran e4stpan sets AGTH SG Additional Notes: Subtotal Payment shall be 30 days upon delivery of the above items. 36582 38 Discount (%) 32238 19 Tota Authorized By Harold Nguyen Pilot, airline"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "purchaseorder",
        "ocr_text": "Watson inc 49932 Lucas Square, West Ck E DE David. WY 25287 alii 09977041887 July 08 1998 perezmarisa example org ays 8680 _Parley Peters 7 __ _ Sheri Kim ADDRESS: USNS Nguyen, FPO AP 07640 CONTACT NO. NAME Sanchez Brown Institute Kevin Anderson t. Greene Loaf, East Kennsthhaven, CT 24518 ci 0. - - 7 EMAL ADDRESS Williamskelly example org Extension cords and power strips D7999 9% 34 4 4 3 3 Staplers ene elylelee Printer 3245 ae eA - paper colored) Alcohol and 6AN Ss cleaning materials 45815 06 32 23 ee ‘Subtotat _ 25163 37 Payment sitali be 30 da 7 Discount (%) 82247 45. Ab 3549 14 Stephen Bauer Dealer"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "purchaseorder",
        "ocr_text": "Watson Inc 49932 L Ss West slbileae Sues les PURCHASE ORDER 09972041887 perezmarisa example org pare: July 08 1998 PURCHASE ORDER NO 8680 VENDOR INFORMATION VENDOR NAME SALES PERSON _Farley Peters Sheri Kim ADDRESS USNS Nguyen, FPO AP 07640 CONTACT NO. EMAIL ADDRESS 09655639549 brendagraham example com CUSTOMER INFORMATION CUSTOMER NAME CONTACT PERSON avoress 22NCheZ Brown Institute Kevin Anderson _17731 Greene Loaf, East Kennethhaven, CT 24518 CONTACT NO. EMAIL ADDRESS 096106 0 williamskelly example or Details | Extension cords and power strips 4 5 3 Staplers and staple wires Printer 3245 6 19 53 Bie paper (colored) Alcohol and Fi is 33 4099 29 98 cleaning materials Additional Notes: Subtotal 25163 37 Payment shall be 30 days upon delivery of the above items. Discount (%) 32217 45 Total 3549 11 Authorized By Stephen Bauer Dealer"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "purchaseorder",
        "ocr_text": "Watson Inc 49932 Lucas Square, West PU David. WY 25287 RCHASE ORDER 09972041887 July 08 1998 perezmarisa example org one: July PURCHASE ORDER NO. 8680 VENDOR INFORMATION ‘VENDOR NAME SALES PERSON _Farley Peters Sheri Kim ADDRESS USNS Nguyen, FPO AP 07640 EMAIL ADDRESS CONTACT NO. ‘CONTACT PERSON CUSTOMER NAME Sanchez Brown Institute Kevin Anderson ADDRESS Loaf, East Kennethhaven, CT 24518 EMAIL ADDRESS 17731 Greene CONTACT NO. 096106 0 williamskelly exam le or item No. Details | Extension cords and power strips 4 4 3 _ Staplers ans stal Wi wires Pe 3245 eR i807, aper (colore cohol an Pepe leaning materials 45815 06 2385 23 suboa 25163 37 Payment shall be 30 days upon delivery of the above items. Discount (%) 3221 7 45 Total 3549 1 Authorized By Stephen Bauer Dealer"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "purchaseorder",
        "ocr_text": "Walson inc 49932 Lucas Square, West David. ive BS S287 PURCHASE ORDER 09972041887 Perezmarisa example org vp duly 08 1998 8680 .Parley Pgters Ss DRESS USNS Nguyen, FPO ap 07640 Kevin Anderson EMAIL sunRESS Extension cords and 9 1 5 3 Staplers and Staple wires Printar 3 Paper (colcred) Alcohol and 324 53 bso i eed 6aning materials POWer Strios oan AEG So Subtotal 251633 37 Discount (%) $2217 45 Total 3 Stephen Bauer Dealer"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "purchaseorder",
        "ocr_text": "Watson Inc 49932 Lucas Square. West PURCH ASE ORDER avid. wy 95287 99977044 Ba? perezmarisa example 218 oe SUNY bs Pe SALES PERSON Shen Kim grace wand Farley Peters ADDRESS USNS Nguye\", FPO AP 07640 CONTACT NO EMAIL ADDRESS 9 aham example COM CUSTOMER eR NAME San ute n, CT 24548 cust chez Brown instit t Kennethhaver Extension cords and ower strips 'y 8 1 33 Staplers and staple, vires printer 3245 8h 285 Eee ed) Alcohol an i a 60 ages 8 36 paper {color cleaning materials g subtotal 25163 37 very of the above Discount (%) 32217 45 3549 11, Total Stephen Bauer Dealer"
    }
]