[
    {
        "image": "referral1_synth_10_aug1.png",
        "label": "referral",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Makati Cay, Mateo Mania ‘Student Development Oftee Rm. 347 +63 29265 2978 Referral Form Reterral for emotional and psychologeal support services: Referrer s Name; R0bertMedonald ‘Student s Name: Sharon Hale 2021 12236 ‘Student ID Number: ‘Student has been exhibting concerning behavioral changes affecting academic performance. Reason for referral: Requres professional assessment to determine appropriate intervention and support services. Past2 weeks Date s) of observations: ‘The above checklist is designed to help the observer label or structure observations. Please elaborate upon observations in “reason for referral” section. Behavioral Observations Checklist: Self- mutilation Uncontrolled Ticsuncontrolled Inappropriate physical noises laughter giggling movements Violent _ Uncoordinated/ Poor hygiene Withdrawn lack of Manic behavior Tearful coordination Rocking Staring Distracted Incoherent speech Sadness (pervasive) Hallucinating pattern Personality change Other Angry Robert Mcdonald, Program Coordinator November 12, 2025 Signature of Referral Source Date Please be aware that a student has legal access to this information. Observations should be objective."
    },
    {
        "image": "referral1_synth_10_aug2.png",
        "label": "referral",
        "ocr_text": "MANILA UNIVERSITY sete Diy, ttre Manda Stuttane Dovetunenent tion Fen 28 2 82628 Referral Fors Reierrat tor amrotenal and oayenningieal euppest servines Mesonnid Refe dent Suudent Shudent haa Seen evhasig Reason for referral: Requires srcieesional asiesoment io deternne upptonr ste it Jos allecing avastem: pertornance son ane euppart serve Pasl2 weeks Date s} of observations’ the abserver label or erruetuve ohservations, Please erai” section. Phe ubave checklist th designed to ke elahorate upon observatians in “venson for vefe Behaviora! Observations Checklist ontrotled ticsusontrolies aos cls mutilation om physin inovents Viele poropriate Poor hygiene Withdrawn Manic behavior Tenrful Rocking Staring’ Di Incoherent spec KR Sadness (pervasi jiallucinating Personal Otter November 12, 2025 robert Meconald, Progrant ate Signature of Referral Source Pease be amare hos a student bas lege! eecess to sis iagorination, QObeereatines she"
    },
    {
        "image": "referral1_synth_10_aug3.png",
        "label": "referral",
        "ocr_text": "TY ATENEO DE. MANILA UNIVERSI sy. te ie ssh Roferval Foret eeferrs tr rn 2d EASON support sence epmes, Roper mesenats Referer s snaron Hale Susdent s Name: _ sents pestrmati views stenting 2088 Number: natant nan baz eon rec ceotgnstna sas885t fancarsing tarsal CIES nt in cere ATTIEE cerventon sna aupanr! #6\" siudent Reason for retoeral: Pests poerver tabel or sorscl coetion, Date s) of observation: ye anservations. Please signed to help the ol for coterral” She above checklist fs de syations in Crease diukorste pon obs sal Ghservations CH smepntrotied te Uncontratled, ‘agises Rehavi elf rmntitation Violent inappropriste joneghter’ giggling ements 3 Uncoordinated! Foor hygiene Wirhdrawe Manic belavior “Searful Siaring Disuected igo of coordinstion Rockix Inceherent spece! SE Sadness (serves! Hatincinating: pacer Personality change other Angry gears Coorainatat Ronert Medonad. Fr ignature of Ref vase teat 0 sea es Bega REE this inforcastian, Chaorvatlontt"
    },
    {
        "image": "referral1_synth_10_aug4.png",
        "label": "referral",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Makati Cty, Metro Manda ‘Student Development Ofce Rm. 347 16329265 2978 Referral Form “eealfor emotional and peychoogeal super servces Referrer s Name: Robert Mcdonala Student s Name; Sharon Hale 2021 12236 Student ID Number: Ree pe ey rh ay wae ey Reason for referral: Revues potessinal assessment io seam og et ‘ntervention and support services Past 2 weeks Date s) of observations: The above checklist is designed to help the observer label or structure observations. Please ‘laborate upon observations in “rence for referral” section, Behavioral Observations Checklist: Self- mutilation Uncontrolled Tics uncontrolied Inappropriate Physical noises laughter gigeling movements Violent Uncoordinated/ Poor hygiene Withdrawn lack of Manic behavior Tearful Coordination Rocking Staring Distracted Incoherent speech Sadness (pervasive) Hallucinating pattern Personality change Other Angry Robert Mcdonald, Program Coordinator November 12, 2025 SS Date Signature of Referral Source ‘ewe be avare thar a student has ea access t thi ‘information, Observations should be obje"
    },
    {
        "image": "referral1_synth_10_aug5.png",
        "label": "referral",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY sags Cy, Hoe tan stctent Sorwoicnrman 8 Rem 27 53 29065 2973, Relorval Fors patents tr emmionel ane payanceogicu sop $erFOS Shavon Hale Student s Name: Soudent 13 Neasber: dan has boun exhaxting concersing behave’ changes acing avtdeme Parinrn Rexsen far referral: Recaines profess sesierrnant ic saernine appro #RHYSTEN ‘ani muppnet oereioeR Past 2 werk Dateis) of abscrwations: help the observer label or structure observations. Please Phe above chenblist is designed to for ceferval” secon, uharnte upos observations iu “reasen Behavioral Cousreations Checktist Uncontrotled Ficsiuncontrotied physical ainvements Poor hyg! Self. emudiiation evespropriate laughies gigeting Uncoordinsted! tack of Manic behavior Yeartai coordination Racking Staring Distracted herent speech HK Sadness (pervasive) Haluciaating tity change Other pattern ny Rewembar 12, 2025 Robart Wodianait, Progeam Ceordtnats Sigaanae of Qefaral Seve ‘Plegce be enure tat 2 sradeut hes tepal accuse to tis information, Observations nhoold be abjestine"
    },
    {
        "image": "referral1_synth_1_aug1.png",
        "label": "referral",
        "ocr_text": "ATENE® anes ay, Me Mane Seager! Baveiapens ee Room 525 3532 senn sane Referral Ferm Roterral tor enotonal and poychulegical supp serene Shetty Willan Referver s Max Patricia Bryant Suxlent s Name: 2024 25265 ident 1D Nuzaber ‘aden nas been extioting concemisg bahaverat changes aflectng acartemic nartaraunce, Regutae proiessionsi ansesniannt fo Cetermies apoconmale itervamion and suppor Servinas, Last 2 3 weeks observations: ‘The above chee! celal ist is designed to hel tae observer label ay structure observations. Plexse cai upon observations is “resaa for refereat” section, Behavioral Observations Checklist Uneontcatied ‘Tiew anconuolled ical elses: inughicr giggting movements Vioient Uncesrdiinated/ Pour hygi 2 Witteteawn sot Manic behavior Tencfil coordination Rocking Staring! Distraci Incl 6 (porvasiv Hatlucinating potera lity change Othes Angry Chair Novesnbey 18, 2025 ‘Shotly Witiams, Bepartnes cteral Source Date Siguatare of Please be aire that a stesieni has toga! access fo this information. Odervations skostd ts wbjecrive,"
    },
    {
        "image": "referral1_synth_1_aug2.png",
        "label": "referral",
        "ocr_text": "ATENEO DE MANILA UNI RSITY MH Oy, Mote Manse Shien evaisennens Gine Roem $75 383 2203 gr Referral Porn tleerat for aomtional ond povenais a sepa gery farer s Naame: ShHY Weare Reiter s Name: Soeby WH Stectont 53 Rite been erthirg cancer Reaves peotessicra ae see ng ren Reason for x cedemic pertonnsnen n And Sct nerves hohvtra cemes ates Tanto deseenive se orcgwiate cater Paaiels} of observations. ‘She above shockst ie destgaasd to kelp the obsercer tohel ue set ‘etre ehservations, Please elshoraie upan ebsseeatinne ia “reasan far referral” section, Sehavioral Observations Checkie Seti reutitarion Usscontratient Tiewstoonsroti Inepproprints physica? Belses inugher gigating savernenes Violene Unewordinaed! Pour hygiene Withdrawn lack of SM Manic bohavios Tenetie ccordigation Rocking Staring Dis Incoherent sseechy Susiness Pervasive} iV change Person Angey Shetty Ratioms, Depactment naire lure Of Refoxrat Source Dae Mee be wwii Sat sae by ese weerss thie inforsmundin, Cer ations hawt be ebection,"
    },
    {
        "image": "referral1_synth_1_aug3.png",
        "label": "referral",
        "ocr_text": "SY HEO DE MANILA UNIVER Misco Dip, Matro aie ATE! Shetont Devenigerast Gite weferral Foren ‘Refecrs for enctionwd ang peychatogical seme nase Shelly witiane Referrer s Nat Paieicin Bryan Student s Mane Stadent 3 Nuneber: Stitent naa hewn wevig concerning bonsvarai cxanges atiechng dcadeurts peviormica Reason Sor redkital: Requres profensionat anscasevent tn deteeminse agnecenate iarventor and wtspat Sereices, as23 ween ne ‘The above checklist i designed te sip the observer label or structure observntians. Please slaborate agun hservations ix “reason for vetereal” section, Seif owitation Uncentrailed Ticstunconiral inaprrupriate physical noiees Jaugitter ggpting: movements Fictent Uncoondinabed/ Poor hugs Ho Withdraws tack of 2 Manic behavior Teastut soontinaion Rocking Staring Dietractest Incoherent speech Sadness (pervasive Hatlucinating tse Persumality change Angry Shelly Witents, Department Chair November 18, 2025 Signature of Referral Sewree Dave Please be ersare thai a siedons tac loge aocesn 80 this inferssation. EXtarreasians visu be abfeccive,"
    },
    {
        "image": "referral1_synth_1_aug4.png",
        "label": "referral",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Referrsi Porm Reeerae tor enrctionsi ane psychotagios! supper eerie Referses s Nome: Sheil Wiams Student s Noa Student 1D abeeeing haha Ho saemyos attecting aude po ional assaxarient 9 devermc b apoIepiate mterventon are sey Date s} of observ The above choctlive js elnhorate apa sbsesy designed to help the observer tabet av sérucice obiervasion: ‘ations in “resson far referral” section, ‘Observations Ciwektise Ties inconteited noises Vioteat Uneoes BM Witheraws lack of 3 Manic beheeior Feasting coordination Staring Distracte Hallucinesng Giher Ineppropriate faugltes seeing movericats Poor hygiene Rocking Ineaherunt speech pattern Angry Sadness (pervasive) Personality chang Shelly Willems, Gepartments Novsrinar 19, 293: Signeture of Refenal Source Pleat te woaee shat staent hus legal access t"
    },
    {
        "image": "referral1_synth_1_aug5.png",
        "label": "referral",
        "ocr_text": "ATENEO 0E MANILA UNIVERS Mie Cry Gens open Ofc Room $95 6225 Referral Porm: Bavehologcal support servi Referrer s Name: Shelly Willams Pat Bryant ient s Nome 2824 20264 udoat IY Number son for regonr charges ates amet ateEse appr Pate intervention and suswor serveee, Lest Ba observations Phe abave cheokiise is 3 elaborwte sigued ta help the observer iabet 7 abservations in “reasua for refertat” sect Or structare atiservations, Fease iow. Bohasineal Obs Fes une Unocordinated Aygiene BS Water lack of 3 Manis behavior Teartial Rook Sadre: 8 (pervasive) Personality civng Hailucinanag can her Fiovomber Signature of Referral Se Date Please $4 wre that a seadent bux ‘RE cess JO thi Patinoreation. Feservasions vhooniad be abjective,"
    },
    {
        "image": "referral1_synth_2_aug1.png",
        "label": "referral",
        "ocr_text": "Strader’ Stadent 99» Datats) ‘The above shecktis: 8 design, laborate wy Behavioral Observay of observations: ', Tees, a Narne; TNS Anderson Don ober vats a8 Checbtist: UNIVERSID Previous 4 weoks et to eb “unite Ht “reween OF THE Dixy MUPPINES om sa4ag ies, Gotan Day ist Bevetsp ment Oflew tr Biting 96329511783 the observer tai mf bel oF structure ay relerrat™ section, ‘serveititis, Please Self mutilation Ties vecamtrotied tnappropriats leugiten giggting inewernente Visiews Unewordinased: Poor hygiene Withecown jack of Manie belmvine Foarfih eowedination Rocking Staring Distracted tscoterens specets Sadness tnervasi Hatlucinating Betern Personality change BR Oiker Angry Dona Feed, Avsstent Prtessce Stynatire of Referval Source Plouse be wouse that a sti Mont fs fleeces ta Sis inforvation, Chery Nowernber 15, 202% Dee"
    },
    {
        "image": "referral1_synth_2_aug2.png",
        "label": "referral",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN man, Quezon City Student Development Office Office 174 463 2 9511 7443 Referral Form student referred for mental heath assessment and support Dana Reed Referrer s Name: Tricla Andersen Student s Name: 2022 45129 Student ID Number: ‘al changes affecting academic performance, ‘Student has been exhibiing concerning behavior ‘appropriate intervention and support services, Reason for referral: Requtes professional assessment fo determine Previous 4 weeks Date s) of observations: “The above checklist is designed to help the observer label or structure observations. Please elaborate upon observations in “reason for referral” section. Behavioral Observations Checklist: Self- mutilation Uncontrolled Tics uncontrolled Inappropriate physical noises laughter giggling movements Violent Uncoordinated/ Poor hygiene Withdrawn lack of Manic behavior Tearful coordination Rocking Staring Distracted %X Incoherent speech Sadness (pervasive) Hallucinating pattern Personality change Other Angry Dana Reed, Assistant Professor November 11, 2025 Signature of Referral Source Date lease be aware that a student has legal accesso this information. Observations should be objective."
    },
    {
        "image": "referral1_synth_2_aug3.png",
        "label": "referral",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Daman, Quezon Cay Student Development Office Office 174 163. 29511 7443 Referral Form ‘Student referred for mental heath assessment and support Referrer s Name; Dana Reed Student s Name; Andersen 2022 45129 ‘Student ID Number: Resaree as been xhtng concerning behavioral changes alecing academe perlrmance Reason for referral: Requires ‘professional assessment o determine appropriate intervention 'and support services. Previous 4 weeks Date s) of observations: The above checklist is designed to help the observer label or structure observations. Please elaborate upon observations in “reason for referral” section. Behavioral Observations Checklist: Self- mutilation Uncontrolled Tics uncontrolled Inappropriate physical noises laughter giggli movements Violent Uncoordinated/ Poor hygiene Withdrawn lack of Manic behavior Tearful coordination Rocking Staring Distracted Incoherent speech Sadness (pervasive) Hallucinating pattern Personality change X Other Angry Dana Reed, Assistant Professor November 11, 2025 —___ Signature of Referral Source Date ‘Please be aware that a student has legal access to this information. Observations should be objective,"
    },
    {
        "image": "referral1_synth_2_aug4.png",
        "label": "referral",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Daman, Quezon Cay Student Development Office Office 174 +6329511 7443 Referral Form port Student referred for mental heath assessment and su Referrer s Name: Dana Reed Tricia Andersen Student s Name; M64 Anderse 2022 45129 Student ID Number: ‘Student has been ext Reason for referral: Self: mutilation X Uncomtrotied Tics uncontrolled Inappropriate Physical noises laughter giggling movements Violent Uncoordinated Poor hygiene Withdrawn lack of Manic behavior Tearful coordination Rocking Staring Distracted Incoherent speech Sadness (pervasive) Hallucinating pattern Personality change X Other Angry Dana Reeg, Assistant Professor November 11, 2025 Signature of Referral Source"
    },
    {
        "image": "referral1_synth_2_aug5.png",
        "label": "referral",
        "ocr_text": "© PHILIP aman, Guana oy ES Dit Studion! Gevetnomant Ofice Stuck ni s Names _ Soxdene 1D Number 7 ‘Stucert has boon axhibting cencarning beta Renson for refierrct: Reoures profexstonal assevsmentto dias Previous a woot sie s) of observations: The shove checklist is designed to help the wbseever §a elaborate upon ubservations in “41 Bolavioral Gbservs ions Check! X Unconve physical movements Poor hygiene Manic Behias Rocking Sadness Signamne of Re ral Source Pleese be arcane t Fa studs has legal access te this iuformation. Obvervat abel oF s vans Tor refers?” section, pervasive) Personality change ‘eral changes affectng academe sesteemance eeopiate iiervantin and suppsrt sere eture observations. Mease Plesfancontectiog awises Pate fois shuld Be abjective,"
    },
    {
        "image": "referral1_synth_3_aug1.png",
        "label": "referral",
        "ocr_text": "FAR EASTERN UNIVE! Student Dewiogn ontee sn 18 38\" Referral Form tor psyeneiogicat evatiatin are geet somos Natalie Sawyer i Name: cote, Thales Hamendez Student s Name: ction A reyerseg vies imacting acaceris wrk, Aanesament a arpreqiate menial Neate SuoH ove checkdist is designed to help the observer label or structure observations. Please fe epon observations ix “reason far selercat” section, al Cidservations Cheoklist: Uncomretied Tiestuneontrotiee physical noise movernenis stent Poor hygiene iigrawn 3 Manic behavior Fearful coortination 2 Kock’ Staving/ Distracted Incoherent spec! Sadness (pervasive) Hallucinating patter: Person Other Natalie Sawyst MD, Prog: Signature of Referral Seures Date ce Be eomare that student Has Fegal aecens ta sais infomation, Observations shuatd be adjective,"
    },
    {
        "image": "referral1_synth_3_aug2.png",
        "label": "referral",
        "ocr_text": "FAR FASTERI UN! RSTY oom 33 18329769 Referrat Form Recta ov prvetoe gee evak ston ant earang SancaN ataiie Samyer RG Referrers Nate, MAN Se res HamaraN? Suatent s Name Stedent 1D Number Sader exper an ng OER AEROS REREING BASE UA AL aent ane Reason for referral, cougars wevces cotiande? b xevee sets yncam mental hae BEC wens Datei! of observations The above checklist is devigued (© help the ohserver Tahel or structure obvervetions. Please elaborate upon ctiser mttaay in “crayon for reformat” section Behavioral Ober stions (teexits! YE Seth mutation Inappropriate lasgbier pig niovements Vincoundie: Boor bygicre tack of XK Masuc behavior cvordinatien MH Kock i specch, Sudness (pervseateed ty change"
    },
    {
        "image": "referral1_synth_3_aug3.png",
        "label": "referral",
        "ocr_text": "FAR EASTERN UNIVERSITY evo tae ara Oty sat uvainpmee 0 Foams 383 T8336 Beferral Ferny rece tor payechosogice! erawaton ane esumeeang SEES _ Nata Serger WE 3 Hemendee 2020 7378 Siudent exeeriencg ematinat couneing services serene rin mes. Axess ae as Suppo! etfcutien zrgaecting 20702 aust prquedo aepeegaiate meta past2 weeks be J te help the observer label or strchre observations. Pease asea for referrat” section. ‘Phe above checklist i¢ desigt aoborate upon observations in “Te Behavioral Observations Checklist: x Tica un Teappropriate noises laugbiet ling Violent Unenordniaied Poor hygiene Withdrawn Jack of 3 Manic behavior eaordination SM Rockne ‘Distracted inocheseat speech Sedness iperwasive? Hoilucinatiog patient Personality change ox agram Coosdinatot Notatie dawyer 8D, Dare {Source Signature of Ref bservaiions shoud be objetve deed access to thls inferior hese bo nvoane tak tabetha"
    },
    {
        "image": "referral1_synth_3_aug4.png",
        "label": "referral",
        "ocr_text": "FAR EASTERN UNIVERSITY Student Devaiegmert Of iteforrer s Name Student s S 2020 Student 1D Number al observations Boatees) of The atnsy checklist is dosigacd to help tse observer label ov structure observativns. Please elaborate ayus observations ia “reason far re erral” sectio: Observaiions Checktist sivai seawwenienty ——\" Manic coontination HK Rocking Personabty char Natalie Sawyer MD, Program Coordi Signature of Refers Source Date suction, Obs Please Be amare that stdin ey essed gcvess ti ie be objective"
    },
    {
        "image": "referral1_synth_3_aug5.png",
        "label": "referral",
        "ocr_text": "FAR EASTERN UNIVERSITY Masse Cay Mere irs Referral Porm Retwrat ter peychoe pi! avakiston and counrtag serves ata Sane: MO Referrers Naame. _ 2020 73784 ‘Seager! experoneing sentunt “ais repacing wasn wom, Aanentrect 2 Reason for referral: somactny sevice tecorovended w prove Rap eorite ents NED SUH Date s} of observations: ‘The atyove checklist is designed te help the observer label or structare observations, Pleave claborate pon observations in “reason for referral” section. Behavioral Observations Checklist: Siguaure of Refer Source Please be awere that 4 stustons Ban legel access 9 sis information, Oteservations sintid be objective."
    },
    {
        "image": "referral1_synth_4_aug1.png",
        "label": "referral",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Manta, Metro Manta Guidance 1d Counseing Office Rm. 208 +632 9568 1012 Referral Form ‘Student referred for mental heath assessment and support Referrer s Name: {l84 Baker N Re Student s Name: Nathaniel Rogers 2023 21775 Student ID Number: Notable changes in behavior and social withdrawal observed ov Reason for referral: gusance needed o support students wet bene ano eceorsar /er past weeks, Professional success Past month Date s) of observations: ‘The above checklist is designed to help the observer label or structure observations. Please elaborate upon observations in “reason for referral” section, Behavioral Observations Checklist: Self: mutilation Uncontrolled Tics uncontrolled Inappropriate physical noises laughter giggling movements Violent Uncoordinated/ Poor hygiene Withdrawn lack of Manic behavior Tearful coordination Rocking Staring Distracted Incoherent speech Sadness (pervasive) Hallucinating pattern Personality change Other Angry Lisa Baker, Instructor October 26, 2025 Signature of Referral Source Date Please be aveare that a student has legal accesso this information. Observations should be objective,"
    },
    {
        "image": "referral1_synth_4_aug2.png",
        "label": "referral",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Many, Mero Bae Sucenes and Counseing Dice Rn 8 14322688. 1002 Referral Form Stadert raferred for mentat nena assetsmect ans suyypect Lisa Bares Relerrer s Nasne. Nainaris: Rogers Stusent s Name 2923 2 775, Student ID Nun Notable chonges m behactey art woctal wenarawa observed over rast wnels, Proeesenay Reason for referral. gudence naeded to suppres suse s wrek veRrg ane acacemi success Past mes Datel 6) of observations’ The shove checklist is designed to help the observer tabel or structure vbservations. Please chiherate upon observations ia “zeasoa for veferrai” se Behavioral Observations Checklist sett ‘Ties unconivotied physical noises movem Poot hygiene X Wahdrawn Marte behavior i Rockin: %K tucohercat speceh Sadness wervasive} Hathuein: pattern Personality change Oxher Angty Lisa Baker instructor Octogar 26, 20: ace of Referral Source Dat Fiease de wore that student hes tepal meess ie raformation, Observanons sheiald be mbjective."
    },
    {
        "image": "referral1_synth_4_aug3.png",
        "label": "referral",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Mania, Metro Manila “Guidance and Counseling Office Rm. 208 463 29568 1012 Referral Form suudent refered for mental heath assessment ane support Lisa Baker Referrer s Name: Nathaniel Rogers Student s Name: 2023 2175 Student ID Number: ocial wihdrawal observed over past WEEKS. Professional ‘Notable changes in behavior and ‘wel being and academic SUCCESS. Reason for referral: guidance needed io support students Past month Date s) of observations: ‘observations. Please to help the observer label or structure ferral” section. ‘The above checklist is designed “reason for refé elaborate upon observations in Behavioral Observations Cl ‘hecklist: Self- mutilation Uncontrolled ‘Tics uncontrolled Inappropriate physical noises Jaughter gigeling movements Violent Uncoordinated! Poor hygiene Withdrawn jack of Manic behavior Tearful coordination Rocking Staring Distracted X incoherent speech X Sadness (pervasive) Hallucinating pattern Personality change Other Angry Lisa Baker, Instructor ‘October 26, 2025 Signature of Referral Source Date sbservations should be objective. Please be aware that a student has legal access (0 this information. Ol"
    },
    {
        "image": "referral1_synth_4_aug4.png",
        "label": "referral",
        "ocr_text": "IVERSITY OF SANTO TOMA sea, Wats Mamie Referral Form ent ae sopR ON ‘chou eetercod for mina heat a5 Lina Baker set Student 1D Number oo “none aye socio ative coaerves aves puel were, Profession sergport stents web being ard Reason for referral: Date ef observation is designed to help the observer fabel ay structure observations, Please 1 Fox referral weetinn. ‘The above check elshorate upos observations fa “renee: Behavioral Observations Checklist €& matiation Uncontrolted Ties encontralted Inappropriate physical i moverants ii Fanghte Uneoordinared! Poor hye! Manic behavior ne jack of cooination Rocking 3 pscohereat speech ines (pervasive) putter paity chan Angry Lisa Baker, inairactor Date Signature of Referral Source tense be aorare that stuslent hus legal aes 10 shis information. Observations shontd be objective"
    },
    {
        "image": "referral1_synth_4_aug5.png",
        "label": "referral",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS. Manta, Sere tanta Oe Bin 238 W832 956012 Referrat Fore ‘Stusiont referred tar meatal neath aasensmnent asc! sisseort Refereer’ Lisa Baker Reterrer s Niing 84 Baber Student’ jathanie! Rogers Name: Stadeat 1 Number: Nottie changne in behavior anc social witeraua: oneenad ores past wore, rofewsionnt Reason tor referral: gursance nested te sunpart steamts weber and acauerne sotnose of observativas: The above checktlat is designed to help the observer fabel ar structure cbservations, Please cishorste upon observations in “reasan for referral” seetion. Behavioral Observations Checklist Self mutitation ‘Fies uncontvotiod Inappr y noises aught movements Violent Poor hygiene Witdeawn Manic behavior Tearfl Siaring/ Distracted S (pervasive) Hallucinating Persesality change Other pateans Augey Oetober 26, 2825 gawiere of Referral Source Date Fleas be awave thar 4 siden fas legal arcess te this infrusation, Obcervasions should be ebjeciives"
    },
    {
        "image": "referral1_synth_5_aug1.png",
        "label": "referral",
        "ocr_text": "DE LA SALI son0n Sky. Meco Hea Siudant Wieineea Center Rm a8 85 Tere SKIS Referral Form wngelng Sie aehavixal asneesemant than for gulane Cynthia Sei Refisver s Mey Anna Walken Studeni s Name: Student {D Nam’ ‘Stiutiea vonactng arademe work. kaveteinent anc vices Mourarectes to prvede xpoeaeeiste mental ieath eeppon Stuvient sxcerancing emevionat Reason for vefermal: sounpsing e= Pasta woke Datels) of observations: _ Fhe above checklist fs designed to help the abserver label or structure observat ns. Pleave elaburate upon observations in “reavan far relerret” section. Bel oral Observations Checkiist Soll mutilation YSnapproy entre Tiestunovate te physical noises laughier gigg movements Violent Uncoordiaated Poor hygiene Withdrawn lack of Manic beliavior ‘Fearkal counbination, Roe Staving iMstracted Incoherent speech Suds Hotlucinating patter Person: M Other Angry Cynitia smh Movember 12, 202) Signaare of Refers Sou 2: rave he aware hate sudent Sas toga access te this information. Observations should be objcesive,"
    },
    {
        "image": "referral1_synth_5_aug2.png",
        "label": "referral",
        "ocr_text": "DE LA SALLE UNIVERSITY ‘Quezon City, Metro Mansa ‘Student Welness Center Rm. 384 463 2 9226 5538 Referral Form Recommendation for guidance counseling and behavioral assessment Referrer s Name: ya Smith ‘Anna Walker Student s Name: 2020 90113 Student ID Number: ‘Student experiencing emotional dificuites impacting academic work. Assessment and Reason for referral: _ counseling services recommended to provide appropriate mental health support Past3 weeks Date s) of observations: ‘The above checklist is designed to help the observer label or structure observations. Please elaborate upon observations in “reason for referral” section. Behavioral Observations Checklist: Self mutilation Uncontrolled Ties uncontrolled Inappropriate physical noises laughter gigeling ‘movements Violent Uncoordinated/ Poor hygiene Withdrawn lack of Manic behavior Tearful coordination Rocking Staring Distracted Incoherent speech Sadness (pervasive) Hallucinating pattern Personality change X Other Angry ‘Cynthia Smith, Deparment Chair November 12, 2025 Signature of Referral Source Date Please be aware that a student has legal access to this information. Observations should be objective."
    },
    {
        "image": "referral1_synth_5_aug3.png",
        "label": "referral",
        "ocr_text": "DE LA SALLE UNIVERSITY ‘Quezon Cty, Metro Mania ‘Student Wellness Center Rm. 384 +63 29226 5538 Referral Form Recommendation for guidance counseling and behavioral assessment Cynthia Smith Referrer s Name: ‘Anna Walker ‘Student s Name: 2020 90113 Student ID Number: “oder expenencng emotional ffieutles pacing academic work, Assessment and to provide appropriate mental heath support. Reason for referral: _ counseling services recommended Past 3 weeks Date s) of observations: .klist is designed to help the observer label or structure “reason for referral” section. ‘The above chee observations. Please elaborate upon observations in Behavioral Observations Checklist: Tics uncontrolled Self- mutilation Uncontrolled Inappropriate physical noises laughter giggling movements Violent ‘Uncoordinated/ Poor hygiene Withdrawn lack of Manic behavior Tearful coordination Rocking Staring Distracted Incoherent speech Sadness (pervasive) Hallucinating pattern Personality change Other Angry Cynthia Smith, Department Chair November 12, 2025 Signature of Referral Source Date Please be aware that a student has legal access to this information. Observations should be objective."
    },
    {
        "image": "referral1_synth_5_aug4.png",
        "label": "referral",
        "ocr_text": "DE LASALLE en, nal ifcutes wipactng Academic woth, Aosesssnent and iniae to ono annsprate mena: reat Subs Pasl3 weeks Datets) at observations) rhe above ehechiise fy desigwed te eluhoraie upon observations in “reason for referrai” section, ofp the nbserver hited or structive observations, Ph jeval Observations Che Uncomirotte Hes uncontral noises mmevements Viedoot Vncvordicated ie Wathdrawe ko Manie behavior coordination: ooking ch Sadness {pervs Gites v chan’ pattern Perse Angry Nevers sia Smith, Gepaitment Char Date Sign sro Source: tare of Ret stian, Observations vuesht be obiretive Phease he essere than a stators fae legal gc cens to tis fe"
    },
    {
        "image": "referral1_synth_5_aug5.png",
        "label": "referral",
        "ocr_text": "BELA SALLE UNIVERSITY ‘Shaner Wetnans Center eon 268292265540 Referral Form Reconsnenatan tor gunance counselng a! aghaviors! assessment, Referrer s Names OD 9 Seautr ana Watkes jent s Name, 10 Nuamber Suacen aaperereng en Reason for retereal: courseg +6 bai dficukes mpacing seasons week saseesament ant ormaerited to aro appropiate rnitae heats ALM Past 3 weeks Datels? of abservarions The above cheektist iy designed te help the observer label ar sty Habonate pots observastians in “reason Tur referrat™ section, ec observativas, Pleave avioral Observations Uncontetiod Ties unconteolied sical noises movements Viotent ontinated Poor hygiene Withdrawn tack of Manic behavior Fearful coondinatio Rocking Staring Distracted Incoherent sp Sadness epervasive) Hatta Porsonabity change Omer ening November Signature of Relertai Source Date Phoase be amare thea e vantens has begat weve this information, Odse vaticars Boul Be objective,"
    },
    {
        "image": "referral1_synth_6_aug1.png",
        "label": "referral",
        "ocr_text": "DELAS LLB UNIVERSITY Bn, 103 183 2 BPS BES Belerral Form eter toe estore ae yayerecingical saree? Nae eferres s Name: Monee Howe 5 Andrews Srudent s Nain: op Shelard Wout aber dent 1D vitonal eekens ane oafzway cancentnatng #188 Reuson for iter et OPRAL ODT COLE, Drate s) of observations: ped te eelp the abserver satel OF structure observations. Please The whave shocklist is dest ig for refereal” section, eighorate pon observations ia \"reas signs Checktist Rehevioral Ores\" inconirolted ‘Tiesanenniroied physical provenen f mtiiation fapprapeizte laughter’ sigan Weidutraws Uncsordinsted fack of Manic behavior Tearfal esasdination Rocking Searing’ Distracted ~) Hatlactnsting Sadaess (perwast™ oxen Incoherent sie pane SX Porsonaiay change M Angry ouioter 22 2025 auchpel Howell Protester of Refereal Source fqenabsee ‘please be awa Hane a seen tas (ese 2°"
    },
    {
        "image": "referral1_synth_6_aug2.png",
        "label": "referral",
        "ocr_text": "Kelerro! Porn: crigere aul, Mease tthe phserver dnhiet or tract val soxtion, fon eof Signziaie of Reten at Source i"
    },
    {
        "image": "referral1_synth_6_aug3.png",
        "label": "referral",
        "ocr_text": "DE LA SAL UNIVERSITY, ‘isan Rasen Cry Referral Form: ‘erta for emotional and puychciogice euopert kerviees lent £9 Number ‘observes Reason for Previous 4 w. ‘The above checklist is designed co help the observer label or stinetare observations, Meas borate upon observations in “reason for referral” section. Behavioral Observations Cheskli 3% Seif: mudiiation Unconirolied resin ted Inappropriate phys noises laughter iggling movements Uncoordinared? Poor hygicne wh Mame behavior Rockis acted Sadness (pervas Personality char Michaat Howell, Professor 025 Signature of Refonat Source Piense be arare tha student has legal aceess to this iafurmeation, Ofer ions showht be of"
    },
    {
        "image": "referral1_synth_6_aug4.png",
        "label": "referral",
        "ocr_text": "DE LASALLE ut WERSITY, 65 2 ATR Referral Form Retest ‘ov emotions} ant peyehalogeal support sevice eferrer s Name: Student s Name: su at 1D Number Observed sigitivent erotonal iste: Rensoe for referrai: nenett rom Pravious 4 we 5} of observations: ‘Tre above checkiist iy desigued to hele the ohserver label or structure abservations, Pease elaborate apr observations in “reasen ier referral” section, hive savioral Observatioas Che 3% Seif ma ation Unconirali ‘Tiesfunces tnappropr physical a0 langiten gigeling movements Vivient Unccordinated: Poor hygiene Withdrawn tack of Manic behavior Tearful coordination Rocking Staring Distracted perent speech Sadness (pervasive) Hai pattern Pexsonality chs An re inating Michast Howe, cure of Referral Source Phogse Se wsvare ret as seedest has foyer. socess se this inforanation. Ohservat"
    },
    {
        "image": "referral1_synth_6_aug5.png",
        "label": "referral",
        "ocr_text": "DE LA SALLE UNIVERSITY Sener Comte Cty Referral Form eterna for emeuer a enc pm yereltyess sucoen warvicey Referrers Name: *e e! Howes Student s Name: ‘#3 Aesrows Previous 4 weeks: Datets} of cbservations: ‘The above checklist is designed to help the observer tbe! or siructere observations. Merve elaborate apon sbseryations in “reasen for referral” section, Behavioral Observations Checktist: Seif mutilation Uncontrotied Ticwuncontrolted taapproprate physic pores Isuginer giggling movements Violew Uncoontinated Four hygiene Withdrawn tack of Menic behavior Teartul ‘coordivation Rocking Staring Prstracted incohercot speoch Sautress (pervasive) Haliucinstioy pattern Personality change Other X Angry Signature of Referrat Source: Date Prcase he wwure that strlent bas Inga weves: fo this informonin, Observations shen be wbiscnie."
    },
    {
        "image": "referral1_synth_7_aug1.png",
        "label": "referral",
        "ocr_text": "DE LA SALLE UNIVERSITY Manda, Metro Manta ‘Student Heath Services Office 139 +632 8628 8500 Referral Form ‘Student requres mental heath evaluation and intervention Referrer s Name: °histopher Lopez Student s Name: “SY Hamilton 2021 49841 ‘Student ID Number: pone Changes m behavior and social wiharawal observed over past weeke Professional Reason for referral: guidance ‘needed to support ‘students wel being and academic success Past2 weeks Date s) of observations: The above checklist is designed to help the obse: rver label or structure observations, Please elaborate upon observations in “reason for refe ferral” section. Behavioral Observations Checklist: X Self mutilation Uncontrolled Ticsuncontrolied Inappropriate Physical noises laughter gigating movements Violent Uncoordinated/ Poor hygiene thdrawn lack of Manic behavior Tearful ‘coordination Rocking X Staring Distracted Incoherent speech Sadness (pervasive) Hallucinating pattern Personality change Other Angry ‘Christopher Lopez, Assistant Professor November 09, 2025 —______ Signature of Referral Source Date Please be avare that a student has legal access to this information Observations should be objective."
    },
    {
        "image": "referral1_synth_7_aug2.png",
        "label": "referral",
        "ocr_text": "DELA SALLE UE HVERSITY aa, Ras NS custo eqeres eptst NE SRA pe terenete> Refrerer s gasance nesnied Tp oehaine and aocint withers fp support states web BO A vj anaes S08 Pasi 2 weeks Date s) of observations: _ “The whove checklist bs designed (9 slp the absorved label or tevetHt2 ohservations, Phewst Mrebavats wpen ober vatins i “esse for refasral” section: ehavionsl Observations Checklist Wh Self. natilation Uncontroitert H ricwuncontrolled faappropriate physicat iaughteri gigging mevvemnents Uncoordinatsd! Paw hygiens sided. tack of Mastic beaver eartil cuordination Rocking HM Staring Dist Incoherent speech: 9% Sadaces (porezsive? Hallucinating: posters Hessonttity eleange Giher Angry Mowamber 99, 2 sient Protester pistons Lope, ASS Refereed Source gpmanare of Pease be ens thot x stant hs ig aCe hc inforoasine, Drorvatons sold Be eis."
    },
    {
        "image": "referral1_synth_7_aug3.png",
        "label": "referral",
        "ocr_text": "DE LASALLE UNIVERSITY iu, ae ate Seasort rents Serves offs 138 63. ETDS Signacare of Refereal Soures abe obit. ht smn has eel ces infec bsernaion shen Be Prease be oware"
    },
    {
        "image": "referral1_synth_7_aug4.png",
        "label": "referral",
        "ocr_text": "24 SALLE UNIV Kanth, Mase tant Statent Neat Services: Ofte 1 +63 2 Ana EO Referral Ferm stadent requiras masta neath evakcatinn und teres Christopher Lone Referers Name: =, Ashley Hamilton Suustont s Narne: SPY\" 2001 49844 siden 1? Numbers ee a owe changes densa and sock Reason for referral: guidance needa t xipport stuaenss wt inibar eval eosereet over pant weeks, Professional seb aang 3 SIONS GALEN of observations: ne crver jabel ov structure abservations. Pie “he above cheektiot ic designed to help the daborate upon absirvations in “veasen for vefer vai” secrina. sional Observations Chweckitst RK Ticsencomelied Sole ow Unconirolted tnapprepsiate physieat isos jaughter gigalit meyer Vik Uaconsdinated’ Poor hyg Withdrawn Tearful Manic be Rocking MK Sadness (pervasive? Personality change raring istractes Hallucinating Onher sack of coord! incaberent speech pi Angry ratio 2, Bsgistant Prateessr sovember 08, 2525 Ctiristoaner Loi Date Signature of Refecral Souree reane be ware Rass ste fs ta acces this IMferenee observations shanti be ebjrct."
    },
    {
        "image": "referral1_synth_7_aug5.png",
        "label": "referral",
        "ocr_text": "DE LA SALLE UNIVERSITY Manta, Metro Mansa Student Health Services Offce 139 +63 2 8628 8500 Referral Form Student requis mental heath evatuaton and interventon Ashley Hamiton Student s Name; 82 2021 49841 Student ID Number: 7 Reason for referral Past2 weeks Date s) of observations: he above checklist is d elaborate upon obse igned to help the observer Label o1 vations in structure observations, reason for referral” sectio Please n, oral Observations Checklist Uncontrolled Inappropriate laughter gigeling Tics uncomotted noises Movements Violent Uncoordinated Poor hy Withdrawn lack of Manic behavior Tearful coordination Rocking X Staring Distracted Incoherent speech x Sadness (pervasive) Hallucinating pattern Personality change Other Angi Christopher Lopez, Assistant Professor November 09, 2025 Signature of Referral Source Pleas"
    },
    {
        "image": "referral1_synth_8_aug1.png",
        "label": "referral",
        "ocr_text": "A SALLE UNiy Taf Avan Rinne RSITY Sedans end Gow Roam 84g ale enctions! aid peysheleena supe Reierer s Name: S ney Sei Seseinte spice extant htrote and ste exmenbateg h oe, Sadent wale Peneht fon unset acareas cures miepa newt convene Previous 4 wears Bateisd of obs vations: The whove ci ecklist is designed to help the observer tah eiaborvte ups cl er steacture observations, Please on vbservations in “reasan for referral” auction. Behavioral Obsarvaci ns Checklist: aati 2% lnappaypriate laughten gigeliny on LUicontralied ‘Mesfuncontestied aysical movements Violent Uncoendinsted! Poot hygiene Withdraw lack of Matic behavior arti esordin, Rocking incoterent Steriag Disieactad Sevtness tpervasivey Hallusinating pattern Persenatity ebwnge Other Angry Systhey Gntih, Dopadisent Chae November 03, 2 Signature of Retercal Date House be were teat a soodeos kas lesal accesso thts information, ‘servnttons shawid be abiecrivg,"
    },
    {
        "image": "referral1_synth_8_aug2.png",
        "label": "referral",
        "ocr_text": "DE LA SALLE UNIVERSITY Taft Avenue, Mania Guddance and Counseling Otfoe Room $49 +6329020 9770 Referral Form Referral for emotional and psychologe al support services Referrer s Name; S 8ney Gritty ‘Shawna Walsh Student s Name; S 2 3 Wal 2022 14686 Student ID Number: Sossrved stonfcant emotonal distress and dffcuty concentrating n class. Student would Reason for referral: benett rom counseing to adsress cuttent neniarecn concems Previous 4 weeks Date s) of observations: The above checklist is designed {0 help the observer label or structure observations, elaborate upon observations in Please “reason for referral” section, Behavioral Observations Checklist: Self: mutilation Uncontrolled uncontrolled Inappropriate physical noi laughter giggling movements Violent Uncoordinated/ Poor hygiene Withdrawn lack of Manic behavior X Tearful coordination Rocking Staring Distracted Incoherent speech Sadness (pervasive) Hallucinating pattern Personality change Other ‘Angry ‘Sydney Grititn, Department Chair November 03, 2025 Signature of Referral Source Date Please be aware that a student has legal access to this inform: mm. Observations should be objective."
    },
    {
        "image": "referral1_synth_8_aug3.png",
        "label": "referral",
        "ocr_text": "DE LA SALLE UNIVERSITY ‘Toft Avenue, Manis Guidance and Counseling Office Room 549 +632 9020 9770 Referral Form Referral for emotional and psychological support services Referrer s Name: S aney rth ‘Shawna Walsh Student s Name: 2022 14686 Student ID Number: Observed significant emotional distress and diffcuty concentrating n class. Student would Reason for referral: beneft from counseling to address current mental heath concerns. ___ Previous 4 weeks Date s) of observations: ‘The above checklist is designed to help the observer label or structure observations. Please elaborate upon observations in “reason for referral” section. Behavioral Observations Checklist: Self mutilation Uncontrolled Ties uncontrolled Inappropriate physical noises laughter giggling movements Violent Uncoordinated/ Poor hygiene Withdrawn lack of Manic behavior Tearful coordination Rocking Staring Distracted Incoherent speech %X Sadness (pervasive) Hallucinating pattern Personality change Other Angry ‘Sydney Grifith, Department Chair November 03, 2025 Signature of Referral Source Date Please be aware that a student has legal access to this information. Observations should be objective."
    },
    {
        "image": "referral1_synth_8_aug4.png",
        "label": "referral",
        "ocr_text": "DE LA SALLE UNIVERSITY Ta Avenue, Mes Referral Form Referal for emotaral and paychoty shawna Walsh 2027 44686 44D Number, 7 8. Steet would for severcat: Preview observations a a Datels) uisorvations, Hesse Self nseilation Unconteolted Hesiuncontc inappropriate yysicat noises 1 movements Violent Ue Poos hygien Waitdn lack of Manic behavior 3 Tearful coordination incoherent speoch Gettin, Deparment Chair nature of R"
    },
    {
        "image": "referral1_synth_8_aug5.png",
        "label": "referral",
        "ocr_text": "LA SALLE UNIVERSITY stanea Tan aver Gaciance and Counsaing Dios Room S45 Roferrer s Nam Student s Name. 12 Numb: Stuck ee 2 an etfnuty concetati rat ents Neat concerns Otserved signtirom onsstons ds Reason for refermnl: vores tem cecrseang to aciirens Previous 4 weeks ds) of observations: The shove checklist fs designed te heig the ubserver tabel or structure chservations, Please dlahoraie upon observations its Sreasan for referral” seviioa. ‘kt servations Ct ‘Ties uncortrolted Seif: nresifation frapprepriate physical noises iaughtersipgtt movements Vioient Uncvordirated! Poor hygiene Wihdraws, tack of Maniv behavior Teast ordination Rocking Siaring Disurweted BM Sadness (pervasive) Hallacinating Personality change Other £83, 2025 Signature of vet a sudden has legal sevens te tis injorsration, Wbservations siwald be objective, Picgse be eure"
    },
    {
        "image": "referral1_synth_9_aug1.png",
        "label": "referral",
        "ocr_text": "FAR EASTERN UNIVERSITY Mania, Metro Manila student Development Office Room 142 4463 29796 5001 Referral Form Referrer s Name: Jessica Jonnso? ier Ande snudent s Name: “°° eon Student ID Number: cof anxiety and stress 2020 37140 pation. Referral for ‘Student cisplaying symetorns Js affecting classroom part felopment of coping Stateies: Reason for referral: evauaton and dew __ Last2 3weeks Date s) of observations: -The above checklist is designed (0 help the observer label oF structure observations. Please Giaborate upon observations in creason for referral” section- Behavioral Observations Checklist: Self- mutilation %X Uncontrolled Tics uncontrolled Inappropriate physical noises Jaughter gigeling ‘movements Violent Uncoordinated/ Poor hygiene Withdrawn lack of Manic behavior Tearful coordination Rocking Staring Distracted %X Incoherent speech ‘Sadness (pervasive) Hallucinating patter Personality change Other Angry Jessica Johnson. Professor November 06, 2025 Signature of Referral Source Date that a student has legal access 0 this information. Observations: should be objective. Please be aware t"
    },
    {
        "image": "referral1_synth_9_aug2.png",
        "label": "referral",
        "ocr_text": "FAR EASTERN UNIVERSITY Mania, Aton Manis ‘Saasent Destiepenent Ottes aces 162 6622 9796 5001 Referral Form Refers ter paychatopet avskaton und coumcing earvces Referrer s Name: Sandent s Name: ie’ Areas _ maaan “Suaont dept eyretans of ray and unas MEcg Cae BTCDIN Der Reason for rerral: Srouton tnd toveopart of copng seaeges econmented Lst2 3 woos Date s} of observations: 00 oe a ee ‘The above checktist is designed t help the observer label or structitre ebservations, Piease elaborate upon observations in “reason fer refereai™ section, Behavioral Observations Checklist Self- mutilation X Unconteviied Tics uncoatrotied fnappropriate physical noises Javgnter giggling movements Violent ‘Uncoondinstod! Poor hygiene Withdrawn hack of Manic behavior ‘Fearful coontiaation Rocking Staring Distracted’ %X tvcohsrent speech Sadness (pervasive) Mattucinating pattern: X Personality change Gther November 06, 2925 Signotare of Referrat Source Dare Pica be aware that a sisters bes lech access 10 this infucrention, Obvervations should be objective"
    },
    {
        "image": "referral1_synth_9_aug3.png",
        "label": "referral",
        "ocr_text": "FAR EASTERN UNIVERSITY Mate, Moves Marae Referral Form Raterral ter psyerckegical evakaten anc counseieg eaves Student {D Number: _ Reason sor referral: 7 Last 2 3 weoks Date s} of observations, ‘The above checklist is designed to heip ibe observer iabei or structure observations. Please elaborate pow observations In “reason for referrai” section, Behavioral Observ Uncontrotied Tres uncontrotted physics! noises Jaugister geggling iovements Violent Uneoordinated Poor inygione Witdeovn tack of Menic behavior Tearful coondination Poking Staring/ Distracted X incoherent speceh Sadness (pervasive) Hattucinating, potters '% Personaliry change Ottex X Angry Jeesica Johnson, Professor gnvture of Reierral Scurce Please be avnare that 2 saedect has legal access to shis information Olsercations saat be odjecsone,"
    },
    {
        "image": "referral1_synth_9_aug4.png",
        "label": "referral",
        "ocr_text": "FAR EASTERN UNIVERSITY stant, Mato Marie ceadant Ooeaioperant OFF Room 142 es 2 Date s) of observations: 7 ee ian cig te ten ia sce ne Please Te aan atoms areas reer SES sgehaviorst Observations Checklist: Self awnitation Voconirolted Tiesuncannobied Jnappeopeiets physicat noises lavghter gigelie movements: Vielent us in y Poor hygiene Withdraws: ack of Manic bebevior ‘Venetia coordination Rocking ‘Siaring/ Distracted HK incoherent speech Sadness (pervasive) Haltueinaong pastor HK Personality change ‘Oiher Avey November 08, 2025"
    },
    {
        "image": "referral1_synth_9_aug5.png",
        "label": "referral",
        "ocr_text": "FAR EAS! Rania. Mate Me RN UNIVE a wennifer Ari 21D Number son for refiaral: 22h Last Dates) of cbservations Ve slaborat abel ar sirueture observations, Please at” section. lack X ncoheress spes sadness pastes 2 Personality chan Date Flease be yrerve thon siuiden as fegal access tu this infoacntions. Blbse sions sowie he ubjeetive."
    },
    {
        "image": "referral2_synth_11_aug1.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines PAMANTASAN NG LUNGSOD NG MAYNILA REGION IV A CALABARZON. Student Welness Cente er REFERRAL FORM 1, 2025 DATE: _O ebe 21. TO WHOM IT MAY CONCERN: Denise Smith Respectfully referring MMs. Emergency medical assessment (age), _ (sex) for “7” ‘este alerge reaction 23 CHIEF COMPLAINT: a recommend relerral IMPRESSION: ®t? eated symotone, rec ‘counseling Sincerely, Mark Murray, RN Nurse on Duty 1012172005 DISPOSITION SLIP Date: Notaccepted C Hospitaladmission COPD treatment SJ ER treatment Others: REMARKS: \\VITAL SIGNS: BP: 110 70 mig HR 78 bpm Temp: 37 2 C RR: 20 cpm INITIAL MANAGEMENT: -loe pack appsed to -atfected area Pan medication admnistered Spint appied for mmobicaton REFERRAL NOTES. Patent requres, ‘onhopede evaluation and maging studies. X ay requested to le out facture. Advised stict Ded rest and elevation of affected ib. Folowup appontment scheduled Patent educaton provded regarding wamng sgns Dr. Joseph Hemandez ‘Attending Physician \"Please retum this sip to the patient *"
    },
    {
        "image": "referral2_synth_11_aug2.png",
        "label": "referral",
        "ocr_text": "Republic of he Padlippines FAMANTASAN HG LUNGSOO NG MAY 1 CALABAREON Stuctent Wie sness Center OWA TT MAY CONCERN: rise Smiths Respectiully referring Mr /tis. Emergency media! araesoment (sex) for cui aes CHIEF COMP! IMPRESSIONS ANN pacity set seoonmend couretg rebar Sincerely, Bark Muy, CHSPOSHTION SF CO Mespitaladmirsion TOPO treatment GRIEK treatment C2) Others: MARKS: VITAL SIGHS: BB: 110 79 cong HSE TR Open Teme 37 290 RE: 20 cpr NTA. MAHAGERENT, athe area -Peur wadiotan asvinisnced Sait appt for mmebhaatan KEFERRAL HOTES F rhepace $vauunion aud mmaging ahd, Ky vacunetad to ria srk xature. Adve 3a DMinaned tom Catone aseonmant sanaduied, Pall esuracen asian Wgntingy REFINE 8B. mtnaing sean plea se retan tis sip to dhe pation”"
    },
    {
        "image": "referral2_synth_11_aug3.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines PAMANTASAN NG LUNGSOD NG’ MAYNILA REGION IV A CALABARZON ‘Student Welness Center REFERRAL FORM CO ATE: meet 24: 2028 ise Smith TO WHOM IT MAY CONCERN: Deni Respectfully referring Mr Ms- Emergency medical assessment CHIEF COMPLAINT: IMPRESSION: sincerely, ‘Mark Murray, RN ee Nurse on Duty DISPOSITION SLIP 10212025 Notaccepted 1 Hospital admission Clopptreatment SRJER treatment Others: IAL MANAGEMENT: «lee pack applied SEPERRAL NOTES: Patient requires ‘raved stot bed rest and elevation of ring waming 59\". REMARKS: 2 C RR: 20 opm INIT Dr. Joseph Hemandez __ “Ritending Physician ‘Please retum this slip to the patient” Oe"
    },
    {
        "image": "referral2_synth_11_aug4.png",
        "label": "referral",
        "ocr_text": "Republir of the Philippines PAMANTARAN NG LUNGHOD NG MAYIAS, TO WHOM IT BAY CONCERAL Respectietly refervinng Mie fis. foe). SHEE COMPLAINT: Pein robren syoeions, seciaienend Ce sarin an IMPRESSION: Stacerety, Hark veray, ANE Hiueseonrtncty “BBGSTION SP 2 Hotaccepied (CJ Hospitaladmissien CU0PO treatment GEIER treasnent Others: REMARKS: SBE: BO: SSID omg HE: 28 Yen Yaeree 3F 2 ties rsa Sam macnn atemieied Spina wastes ANADEMENT: «tm pase sated 5 NOTES: Pant euacns rast ans asm of roped mawatin and hagng utes. Xany sequnsted 1 7 out Hmm, Aes a nfinaloe Reis, Budo US oink wavedind, Fiaanh adiceaiion provided rogers easing M8 Pleawe resus Oe stp te the pation”"
    },
    {
        "image": "referral2_synth_11_aug5.png",
        "label": "referral",
        "ocr_text": "To WwHOM IT MAY CORT om ARR ae GYR COMPLAINTS peste IMPRESSION: Sincenely, aaask Money, BE derswoninty REMARE: EAL SIGNS: BF: 137 Seeied ane Pa 703 Sacer tak an0 HP gexptor Rat accepted C3 Geherss Republic of thee Pralipgin ts PARAANTABAR NS LUNGSOE GM REGION PA CALABAREON fhe Davise Smith Respectfully referring Eds sate ware seatit Fea symnpiarn reecueieel MMe 3) TTA, pets Caste? rename eA ETE BISROSITION SLIP j Hoapital admission ave 32M rt nig HC TRATES veaven wasnt 4T8 eh ee men, eas meted 9 Wo on 9 wt tac: Patucs eduction avowed aos ows, fe wemnteaton 82 CoP westment Serra. ct ad mas ant eens Ree weatment epee: ise a Boe See Puen ese phen vebuats his ah te See aie\""
    },
    {
        "image": "referral2_synth_12_aug1.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines FAR EASTERN UNIVERSITY REGION 1V A CALABARZON Medea! and Dental Cine REFERRAL FORM Dare: _ October 26, 2025 TO WHOM IT MAY CONCERN: 4 Respectfully referring Mr Ms. 22 u Urgent medical attention, (ee), (sex) for Jamie Coleman ‘Severe abdomnat pan CHIEF COMPLAINT: IMPRESSION: “*tets razy, needs Xray and orbopede evaluation Sincerely, ‘Manuel Singh, RN Nurse on Duty oo pete\" DISPOSITION SLIP Not accepted C) Hospital admission SJ OPD treatment CIER treatment Other: REMARKS: when to seek mediate care MD Chnstopher Evans ‘Attending Phryscan \"Please retum this slp to the patient Se"
    },
    {
        "image": "referral2_synth_12_aug2.png",
        "label": "referral",
        "ocr_text": "Republic of the Phutippines FAR EASTERN UNIVERSITY eon nat CALANARION aden’ ona Darts Cane a REFERRAL FORM DATE: Coke 28 2025 FO WHOM IT sAy CONCERN: Respectiully referring te Jas, toa! foeny ty trae ance IMPRESSION, Monies rary ceeds Way and wBupeaN CoRLaaN Streer ely, Macuet Singn, Rt Co Hospital admission 93 0 0 treatment TIER neatment SJ Other REMARKS: MO Christopher Evang Atendg Payson \"Please vet thes Jip to tive patent.” eee"
    },
    {
        "image": "referral2_synth_12_aug3.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines FAR EASTERN UNIVERSITY REGION IV A CALABARZON Medicel and Dental Cinic REFERRAL FORM pate: 2ctbet 26. 2025 TO WHOM IT MAY CONCERN: Jamie Coleman Respectfully referring Mr Ms. 2 Urgent medical attenton (age), _ (ex) for Severe abdominal pain CHIEF COMPLAINT: Muscabskeletal npry, needs Xray ang orthopedic evaliation IMPRESSION: sincerely, ‘Manuel Singh, RN —— Nurse on Duty DISPOSITION SLIP 10 26 2025 Date, 0 07 3 Notaccepted [Hospital admission KJ opDtreatment (IER treatment (© Others: “ATIONS ADMINISTERED: Ceteaine te preserbeg CLINICAL NOTES jysed fo avo known abergens: foe of antivstarnes and REMARKS: VITAL SIGNS: BP: 131 1 RR: 22 cpm MEDIC omg PO for alerge symBtoms «| hin reacton Anthistarin Tama FO fra Te acute abrge reaton Syrotoms morovng ay Telesied Ad Patan ate ewan Emergency cantct formation proved, Pant eauceled on 19 85 mimbig HR: 5 bpm Tem: 38 2 Hyarozortsone crear 1 ‘MD. Christopher Evans ‘étending Physic please retum this slip to the patient”"
    },
    {
        "image": "referral2_synth_12_aug4.png",
        "label": "referral",
        "ocr_text": "Republic of the Phitippines REFERRAL FORM pare: Ocinter 26, 2025 YO WHOM IT MAY CONCERN: ntie Coleman Respectiully referring Mr jMs. u {sex} for 2 ‘vee acorns COMPLAINT: siesta a _ {ese}, IMPRESSION: Sincerely, Banvel Singh, RN DISPGSHION SLIP CO Hospital adinicsion EI OPD peatment SERIGETONS ACMINSTERED: -Ganizne prascices CHMICAL NOTES: wer atigens. reniig HA: 98 bpm Tam. 22 8 ROE 22. eu PE far aSeagisaxmantun Hydraoartaomne ofgass tor sin roe fin presen vs az alga reaction, Symptoms snroving nes me sory, Franjoncy contact infannation provided, Pact edhcaing on use of M D. Christopher Evan’ \"pkease seta this sip bo the patiant.*"
    },
    {
        "image": "referral2_synth_12_aug5.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines FAR EASTERN UNIVERSITY REGION IV A CALABARZON, Medical and Dental Cinio REFERRAL FORM DATE: October 26, 2025 TO WHOM IT MAY CONCERN: Respectfully referring Mr Ms. Jamie Coleman (age), (sex) for Laer medealatenton Severe abdominal pain CHIEF COMPLAINT: Musculoskeletal inury, needs X ray and orthopedic evaluation IMPRESSION: Sincerely, Manuel Singh, RN Nurse on Duty DISPOSITION SLIP 10 26 2025 Date: Notaccepted (Hospital admission S 0PDtreatment [IER treatment Others: REMARKS: VITAL SIGNS: BP: 130 85 mmlig HR: 05 bpm Temp: 38 0 C RR: 22 cpm MEDICATIONS ADMINISTERED: Cetzine 110mg PO for alergi symptoms Hydrocortisone cream for skin reaction Anthistamine preserbed CLINICAL NOTES: Patent presented wih acute alegic reaction. Symptoms improving after medication. Advised to avoid known allergens. Referred for alergy testing. Emergency contact information provided. Patent educated on use of anthistamines and when fo seek immediate care M D. Christopher Evans ‘Attending Physick \"Please retum this slip to the patient.*"
    },
    {
        "image": "referral2_synth_13_aug1.png",
        "label": "referral",
        "ocr_text": "Repntite of the Philippines NTASAN NG LUNGSOD NG MAYNILA Maureen Bs ly vesterring Mc JMs, Stncarely, DEPOSIT IN SLIP DO} Not accepted Ti tespital admission 2 Th Others: OPO tresiment GEER restme REMARKS: (ENS: BP 120086 meni HR €2 bas Prescrpaan RR. 16 pin TREATMENT 6 IONS, Fata ee es Keay, Rail te"
    },
    {
        "image": "referral2_synth_13_aug2.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines PAMANTASAN NG LUNGSOO NG MAYNILA Nor cara raam Once TO WHOM IT MAY CONCERN: Respectfully referring Mr Ms. 2 (age), _F (sex) for Mey Mecca avensert ‘Sports mpury possible fracture CHIEF COMPLAINT: IMPRESSION: Vf SHe to\" WH fever, needs reat and medeaton Sincerely, Robert Henderson, Nurse Nurse on Duty —EeSFSFFFFSE 1: 117012028 su Dats Notaccepted ClHospital admission COPD treatment SER treatment Others: REMARKS: VITAL SIGNS: BP: 120 80 mentig HR 82 bpm Temp: 38 8 C RR: 18 cpm TREATMENT GIVEN: Parncetamo! 500mq PO “Ori rehydration solston Bed rest advised RECOMMENDATIONS: Patient refered to extemal tacit for futher “Gegnoste wostup neusdng complete blood count and chest X ay. Advised to tum for followup ater 3 days orsooner {fT eymetoms wonten Preseroton prowded for syrptomate reset MD. Andrew Woit ‘Attending Physician ‘Please return this sip to the patient.”"
    },
    {
        "image": "referral2_synth_13_aug3.png",
        "label": "referral",
        "ocr_text": "Republic of the Palipaines PAMANTASAH HG LUNGSOO RG MAYHILA nee cangua erence REFERRAL FORM FO WHOM IT MAY CONCE Respectiully referring Mr Ms. ne ERD CHORE COMPLAIN impression: Stncersty, Robert Headerson, Korse \"RISFOSTTION SEP JOPDireatment RIEF teataent REMARK: vate #16 aguante motup ieaing completo Rood sn eyetoars worsen, Presses proved! 97TH Pareectarne! erg PC na Easing far sen 3 aay or s0aHer BOY 8 ope TEATS cag: Paaest mires seen tar totewva 218 anny A: $2 pm Yer: He Bod seri orsnd RECOMMEND ave that Nea. Me ris vee! #0. Anvorew Wott"
    },
    {
        "image": "referral2_synth_13_aug4.png",
        "label": "referral",
        "ocr_text": "Repobiie of PAMANTASAN fee he Paippines LUNGSOR We ene REFERRAL For Dave: _Noventer 09 20 POwhoW TT May. CONCERN Respectfully caterringg nip iis, — 50 for Peo: Y (ACCA! axsessment Hor accepted El Hospital acinsission a Othe: 1 SPD wastmens BRIER treatment ENS: 8, 530 80 mone ‘Geb trie ER 22 bon, Tan “Win «Bat ost BEOCRR 18 com, TREATMENT OWEN «Preontamny B00ng Po ved REC DSI Stew w esenal inst ae complet iy \"tt 30 ro fay OI9 Stee 5 dye or tone"
    },
    {
        "image": "referral2_synth_13_aug5.png",
        "label": "referral",
        "ocr_text": "Republic of the 7hiippinss LANEASARL HG LUNGEGD NG MAYNILA 8 REFERRAL FORM DATE: November 01 2025 FQ WHOWA IT MAY CONCERN: Mauteon Resperthily refercing Mie Ms. a F Emergency medina! aspesament fageh_ tsen} for Spee Weay poosiise Sache HER COMPLAINT: ‘eet sieeiion tn fever auads veel ane! magnate IMPRESSHOM, Robert Henderson, BRPOSTION BLP OPP weainent TRIER reatment BE: 120060 sonbig MB wpm Tem Oia vebasrabon lula Bua ros adnieg KECHRREMEATICNS: Baten coined fo enters fy fr fae Jagnesin wots waking onmoade BG? wine and ohest Keay. Advices mum for fsonns ae! Eines ex vanes ="
    },
    {
        "image": "referral2_synth_14_aug1.png",
        "label": "referral",
        "ocr_text": "oan REFERRAL FORM DANE: Sincsvely, ul Paton, Nurse. Hurse on Duty DISPOSITION SEP Date, 2208 Not accepted Bl thors: JOPDireatment CEs treatment 78 bom Teang: 97 2° FR 29 cen IWETAL MANERA eve» Spit apple foe eran ‘aes img sth line. Fetomip apacnienent ay requnting tu mae out iwcture, Advise sel bed seat aid elevation of sina, Paint west regarsing wamieg gaa \"Phase retun tis olay bo Ore patient"
    },
    {
        "image": "referral2_synth_14_aug2.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines FAR EASTERN UNIVERSITY 7 REGIOR canna tent toe REFERRAL FORM TO WHOM IT MAY CONCE NS Misha Kaliey Aespectiully seferving Nie JMs. CHIEF COMPLAINT: impngssion: Not accepted I Gthers: cy HEE 78 ben Toe 37 barat seats atestes size «Foin eetoaton aéminiteiwd «Spl apie fer erating REFEREN. NOTE: nei avalonson was ennying stedies, Seay requaeled tare Ol ‘ected tou. Fabonnis apoctwtnantssheduird, Paton eccaton ae anagiuiion et Dr. Michaei Jones “Pease return Wis op to the pets"
    },
    {
        "image": "referral2_synth_14_aug3.png",
        "label": "referral",
        "ocr_text": "Republic of the Philinpines FAR EASTERN UNIV! 7 RECHORE career one REFERRAL FORM TO WHOM IT MAY CONCERN: Respectfully retersirgy Mr tts, M Madcal clearance ev shut __ {sen} for Factng spose nclararcon, 20 (age), CHIEF COMPLAINT: IMPRESSION. ‘Sincerely, en RS DISPOSITION SLIP [2 Notaccepted CBvospital admission C OPD aeatment [IER teetnent MK Other see, tehowag 2 toys REMARKS: YATAL GIS: BP S10770 renal MTB bpm Tangy 372 C REC 2 com INTIAL MANAGEMENT: toe pack oss? Jhectse ape Pan medoatins admanatres Spin\" azpied for werebizaton REFERMAL NOTES: Patent eau a eroeece srovcure and rregng notee kopy mous 16 Ue aut ackure Advaed wet Bea re t and elwvaicn of Gromer bn Fotonup apeoninant someS tm2 Patent educcier. prrmioe ErURG rormey ITY “Wirewse retoam this skp to then pationt ©"
    },
    {
        "image": "referral2_synth_14_aug4.png",
        "label": "referral",
        "ocr_text": "Republic of the Psiprines FAR EASTERN UNIVERS TO WHOM IT May CONCERN Respectiully referring MrjMs _ M Hot accepted SH) Cthers: SEMARKS:"
    },
    {
        "image": "referral2_synth_14_aug5.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines FAR EASTERN UNIVERSITY REGION 1) REFERRAL FORM DATE; O tober 26. 2025 TO WHOM IT MAY CONCERN: Alisha Kelley Respectfully referring Mr Ms. (age), (sex) for MOA ew ance evatianon Fantng epsode n classroom CHIEF COMPLAINT: IMPRESSION: “<i #01807 ntecton, requres fur evatuaton Sincerely, Carl Price, Nurse Nurseon Duty DISPOSITION SLIP ©) Not accepted Hospital admission Copp treatment CER treatment BC) Others: Reese: we mescaton totowww a} sare REMARKS: VITAL SIONS etected area P 110 70 meneg Hf 78 bom Teme. 37 2 C RR 20 com INTIAL MANAGEMENT tee pach ‘on medaton admnatered Spin! appied for mmmobacatuon REFERRAL NOTES ton ang eragng studs Xumy mavesied 19 lw ov facture Adraes sit bed rest and eavaton of ‘Sdvcaton proved reganing wemng sone Or Michael Jones, Attending Physician \"Please return ths sip to the patient *"
    },
    {
        "image": "referral2_synth_15_aug1.png",
        "label": "referral",
        "ocr_text": "ONCERN: Aabur Ray sfully vefersing Merde Respect caer IMPRESSION: sincerely esing Me Marceor Duly aneoenee— BEBO FTOM SUP opp tester’ paracetarai 5905 °2 iy fo uti fee tse a3 OT REMARKS: ata, SiN. fs RECOM auatn Boe est 304 sed te Tatoo\" sue ‘Bingnests eo? ent.” esnanse rerun this dig bo tee pats"
    },
    {
        "image": "referral2_synth_15_aug2.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines POLYTECHNIC UNIVERSITY OF THE PHILIPPINES NATIONAL CAPITAL REGION FER! FORM November 04 2025 pare: _Novemoer 0 335 TO WHOM IT MAY CONCERN: Arthur Respectfully referring Mr Ms- pie (se9) for Urgent medical ateniton Tigh fever and body weakness CHIEF COMPLAINT: IMPRESSION: ‘Acute respiratory infection, requires further evanuation 19 (ase), Sincerely, kristina Martin, Nurse a DISPOSITION S| iP pate: 7042025 jospital admission Copp treatment CER treatment managemect 1 Notaccepted CH tere pects fo haat ur GIVEN: Paracetamet 5000 PO tacit for further 15 C RR: 18 cpm TREATME! wher 3 days oF 007 yn Teme: 38. Mer gENDATIONS: Patent refered 19 C8 rood count and chest XY “parsed to retum forfotows af Jed for symptomatic rest REMARKS: VITAL SIGNS: BP: 120 80 mea HF Dra enydraton soliton Sed Tes, Jepnoste workup mouding comemte seams worsen. Presereton Prove MD. Erika Owen Fittending Physician «please return this sip to the: patient.”"
    },
    {
        "image": "referral2_synth_15_aug3.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines NCERN Respectfully refer ing iv Ge High iever ane CHEE COMPLAINT: Ression: Sincerely, (TIER treatment te vues"
    },
    {
        "image": "referral2_synth_15_aug4.png",
        "label": "referral",
        "ocr_text": "REFERRAL FORM, pare: MEER otis Rey saybacana HF MAY CO! 9 Fa a tagehs en) foe agp tv 8 CHEE COMPLEINTS nnn ome impression sown on, costae Stacey vegan Mss, NUE Murseortlarty ens renee —_ SROSTION SP pac SO A Motaccepted C9 sonpital adealssion CD opp eeatnent Be Others: eteasie sets ET sano ome sao nig nse awn THe OES scp ATE SOBTE ne se? RT. POE Seay 98 cer re eons SES NS edo SRS pnt an ons BR"
    },
    {
        "image": "referral2_synth_15_aug5.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines POLYTECHNIC UNIVERSITY OF THE PHILIPPINES NATIONAL CAPITAL REGION Medica! and Dental Cine ee ent nr pe REFERRAL FORM November 04, 2025 DATE: TO WHOM IT MAY CONCERN: Arthur Ray Respectfully referring Mr Ms. 19 (age) _ _ (sex) for Urgent medical attention High fever and body weakness CHIEF COMPLAINT: IMPRESSION: Ait ‘S0 r e= efecto, requres Re evasion ‘Sincerely, Kristina Martin, Nurse Nurse on Duty En DISPOSITION SLIP 11042025 Date. CO Notaccepted C Hospital admission COPD treatment CIER treatment (KD Others: Reeves to porate speciaat tor teter managerent REMARKS: VITAL SIGNS. BP: 120 80 mentig HRC 82 bpm Temp: 38 5 C RR: 18 com TREATMENT GIVEN: Paracetamol 500m PO \"Dolmmyorton sottton Bed ret edvited RECOMMENDATIONS: Patent refered to extemal feckty for Aer <epncece womcp ncuding complete Dood count and chest Kewy Advaed to etum ferfolowup ater 3 ders. tooner {taymptoms woren. Preseapton provided for symptomate rete MD. Erika Owen ‘Aitending Physican “Please return this sip to the patient.* ee"
    },
    {
        "image": "referral2_synth_16_aug1.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines FAR EASTERN UNIVERSITY REGIE REFERRAL FORM NCERN. Corot by Respectfully reterring MrJNs, Son s rey pase Rechoe CHIEF COMPLAINT: thesountuty Oy TER SB Pater CD Notaccapted RE) Others: Be Hospiat admission CU aPD geatment CER geatment REMARKS: SEE SESS. BP 19248 neta 198 U8 nan Tee 38 990 B32 son MEESEATIONS AUSTEREO ceeeane Paced eae eenhe zyrottim HeSmonrise aa fr aan each Anchatering amaeerbol ones eine Pasert resented wih atta otrgs mactan. Syptonn pricey shar 2 wingers Bote eae Satee. Eongerey conan ntamsaton arnsing. Petwrt acueaed on wee pantteeemen ee dorsan Bre Attending Finsilan \"Plane velcro wa hey eaisent.* renee mercer enn nena eee"
    },
    {
        "image": "referral2_synth_16_aug2.png",
        "label": "referral",
        "ocr_text": "vublic of the Philippines FAR EASTERN UNIVERSITY WATIONAL CAPITAL REGION ‘ewe er en EFERRAL FORM soos pare: _Nowenee To WHOM IT MAY CONCERN: Carol Lyons Respectfully referring Mr Ms- 20 Medical clearance evatiaton (age), (sex) for ‘Sports myx posse fracture CHIEF COMPLAINT: IMPRESSION: ‘Anxiety related symptoms, Tecommend counseling referral sincerely, Lestie eT Nurse on Duty DISPOSITION SLIP 132025 Ce (O Wotaccepted C Hespital admission Copp treatment CER treatment FL Others: eters tein hone sent ome MD. Jordan Brown eS __—— Aitending Physician «Please retum this sip to the patient.” —«"
    },
    {
        "image": "referral2_synth_16_aug3.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines FAR EASTERN UNIVERSITY DATE: November 13 2005 TO WHOM IT MAY CONCERN: Respectfully referring Mr Ms _ 2! Lyons wore eee, (ae), _F (sex) for E24 clearance ev Wuaton 20 Sports muy posse Facts CHIEF COMPLAINT: \"HY “Posse Fact IMPRESSION: \\™*0 1ates symtoms, recommend counscinp Oa Sincerely, Leslie Wood, Nurse Nurse on Duty TS Not accepted CA Hospital admission COPD treatment CER treatment Others: Reeves otenay nspta te sane ne REMARKS: TO SIGNS. BP 120 88 mig HR. 95 vom Tero 380 C RR: 22 com MEDICATIONS ADMINISTERED: «Ces Patent cere Tota Mytoconone cwamfor sun easton Annee oon presenbed CLINICAL NOTES Ratenee ern’ mah aut alege racton Symptoms eecing ates Ree Advsed 19 aver known a chen LaINay festa Emergency contac! mlomuton povans Pato care se of anthstamne ergens. MD. Jordan Brown ‘Attending Physicia “Please return this slp to the patient *"
    },
    {
        "image": "referral2_synth_16_aug4.png",
        "label": "referral",
        "ocr_text": "Republic of the FAR EASTERN UNIVERSITY NATIONAL CAPITAL REGION REFERRAL FORM DATE: Novemeer 13 2025 TO WHOM IT MAY CONCERN: Respectfully referring Mrs, “2 Lvons 20 Medea jakaton 00), _F (509) for Meta cnece Sports, Possible fracture: CHIEF ComPLAINT: Foe ne IMPRESSION: *™*t eisted symptoms, recommend Counseling fleral Sincerely, Lestie Wood, Nurse Nurse on Duty ete, \"30025 DISPOSITION SUP Not accepted Hospital admission Copp treatment OR treatment ©) Others: Retered to ertary hospital tor sévanced cave. preserbed CLINCAL NOTES Jarratt ME Scie sterge macton. Symptoms improv shar aveeen Advaed 'e avod known slerent. Relemed for ateraytestng. Emergency contact nlomaton pene Petent educated on use of anthatammes set wen to seek mmc MD. Jordan Brown ‘Attending Physician \"Please retum this sip to the patient.*"
    },
    {
        "image": "referral2_synth_16_aug5.png",
        "label": "referral",
        "ocr_text": "Republic of the PI FAR EASTERN UN RATICNAL CAP FERPAL FORM g Ruvomner 13, 702 DATE: OQ WHOM IT MAY CONCERN: Respectiully referring Mr Sincerely, Leslie Wood, ur Not accepted PD treatment CER treatment 82 others: 8 REMARKS: INISTERED: Catreine 4 t0 avert ow, ater si ancnisiamines on HR: 5 bom Teno. 38 990 BR: 22 eon HEDISATION 168 PO nig rirssoniaome ren fr sh neve Pavan fs note alargieoacten Syeapinns maracing ahar naeiee on, Ate Ralaned tor aberge testing. Ene lee i aaah oma ate opiease retain tis slip to tive pagent *"
    },
    {
        "image": "referral2_synth_17_aug1.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines PAMANTASAN NG LUNGSOD NG MAYNILA NeR Student Heatin Services REFERRAL FORM DATE; October 30 2025 TO WHOM IT MAY CONCERN: Andr Respectfully referring Mr Ms, \"02 Daniels 23 F Emer fical assessment (age), (sex) for STRIEY eset ‘Severe migraine with nausea CHIEF COMPLAINT: IMPRESSION; “2 iection wih fever, needs rest and mediation Sincerely, Natalie Thompson, Nurse Nurse on Duty DISPOSITION SLIP Date; 1002025 CI Notaccepted Hospital admission Cl opDtreatment CER treatment () Others: REMARKS: \\VITAL SIGNS: BP: 130 85 mnHg HR: 95 bpm Temp: 38 0 C RR: 22 cpm MEDICATIONS ADMINISTERED: -Cetrzne 110mg PO for alargc symotoms Hydrocortsone eream for skin reaction Anthistamine prescabed CLINICAL NOTES: Patient presented with acute alergic reaction. Symptoms improving after medicaton. Advised fo avor known allergens, Referred for alergy testing, Emergency contact infomaton provided. Patient educated on use of antihistamines and when to seek immediate care MD. Stephen Lewis ‘Attending Physician Please retum this slip to the patient.\""
    },
    {
        "image": "referral2_synth_17_aug2.png",
        "label": "referral",
        "ocr_text": "Sincerely, Naleiie T POMTON SUP Notaccepted Ritosgitaladaission Clorptreatment (ler weatment “) Others: REMARKS: Please eetucn this slip ko the patient.”"
    },
    {
        "image": "referral2_synth_17_aug3.png",
        "label": "referral",
        "ocr_text": "“po WHORE IT MAY CONCERN: gespecthally raterriog MM _ (sep for zo mars wD 9 CHIEF COMAPLAINT: “virtegcion wt? IMPRESSIO parson ty ~Fisposiion SUF Mot accepted BEI Hospital adinission Choro weaweent others: oat pat CLINE NOTES! 23 ut pin HEDICAT REMARKS: sna tt A ing sitet meses B age snttg HEA gts Sr 2 ro Pere pnesentind nah ec OY Raters foe a6\" sored, Pawent aauoated wen te sank comets oat WD. Stephen Law s epiaase retusa ts sp Bo we aN”"
    },
    {
        "image": "referral2_synth_17_aug4.png",
        "label": "referral",
        "ocr_text": "Repub PARANTASAN REFERRAL FORM DATE: _ O78 2 WHOM UT MAAY CONCERR Respecthiity soferri vere migrsins wih CHIEF COMPLAINT: WSBQSITION SL Netaccepted BM Hespiatadmission Cloroteatment [2 A reatment got Toap: 36 0 C PR: 22 cpm MEDICATIONS AUWMESTERED: at cans ponies CLMCAL ESTES 7 aher maaaatoa, Advised te avoid town stegeNs,— 2. Fala! edvanssd a ust of antratnnvies and ‘Symetome boro nesses suMteet tora ae NO. Stephen Lexis \"Please vetuon this alip La the patient."
    },
    {
        "image": "referral2_synth_17_aug5.png",
        "label": "referral",
        "ocr_text": "Republic of tis Phitinyines PRBANTASAN NO, AUNGSOO NG MAYNE 4 oe Satan: Heoth Servers arena entnnsrenn are REFERRAL FORA FO WHOA i? May ConceaN. Andrea Darts Rexpanthalty refering Mri. ‘Severe migraine wth neuses CHHEE COMPLAINT: te nnn ern wart impression, Ystecion wh teva, ments real and nadeaion NurssonDuty SEEPS TION SLB nnn Dee, RIOD 9 Wat ace cepted Ri Hospital admission Clopsreamment Cen treatment 3 Others: REMARKS: 8122. Seas: 1808 to 8 ues Tam 98 92 RAL 3 ehergho Semetoma Mybooadiane opera fat Pasco geese Retain foc ategy testing. Gomirgoncy canteot tment ‘fien to waa mmeasiaie sae 2 spr MEINCATIOND AWN TERED -Castcone 1809 FO 4 ho seacton Antiighacine gowvaiies CAIMAL tates acute Stange ain, Sympiana sopeeving Bet cencaation ou oh proeited, Peters a ian 20 avoxi nov. aStezens. sala 2 uh oceans et Seta le sip ta the pate,"
    },
    {
        "image": "referral2_synth_18_aug1.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines FAR EASTERN UNIVERSITY REGION IVR CALABARZON Student Heath Serves REFERRAL FORM SSEEAMAL FORM. DATE: November 03, 2025 Ss _ TO WHOM IT MAY CONCERN: Lisa Murr Respectfully referring Mrs, 84 Muay ee (aee _™ (sex) for EP 9e y medical as sessment 18 Diticuty breathing, chest pan CHIEF COMPLAINT: IMPRESSION: M08Uoskewtal nury necas X ray and erthopede: evahaton Sincerely, Whitney Williams, Nurse Nurseon Duty 7 Date, 11022025 DISPOSITION SLIP ——— PD treatment COR treatment MD Patricia Escobar"
    },
    {
        "image": "referral2_synth_18_aug2.png",
        "label": "referral",
        "ocr_text": "~__see at May CONCER S Republic 3 FAR EASTERN UNIVERS? BARRON pegien tA ‘Srucent ath Stee FO WHOM espectly referting M15: 8 gop TE C4: CORPLATNT remem (ia ed ronnie wa sancevelys whitney purser Onty 2: a Sanyo 9 pagrese test 90 8 anes, cont PE pact OY IMPRESSION: forms, tre® reer TN SLE BSbOR EON SUP ort dine PAPE oral ese Claes reaseent 1 greene Paraeatanmt ee ag evga tas Tene TST vp coe oe SOUDIATION ett comeval re 2 8, See erm tetas ome 3 vetonse este seen gap te cre patie” (Cle weatment aeteg PO ib, Paricia EScoDe ian"
    },
    {
        "image": "referral2_synth_18_aug3.png",
        "label": "referral",
        "ocr_text": "Republic of the Ptdtippines EASTERN UNIVERSITY RECON a wananzon REFERRAL Fora 2 Others: Seirsitome vionsea, Bre en Bed EC) Hospital adesission 7 wove spect fr fa 128 ney HS a2 IMENT GIVEN Fan (ONS: Pasent eprened ts anton fac i ope Noy. eticed sie ee nine vitor asa !36HtaIa! Seng Fy for kita"
    },
    {
        "image": "referral2_synth_18_aug4.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines FAR EASTERN UNIVERSITY REGION IV A CALABARZON Student Health Senvoes REFERRAL FORM pare: _Novembero3, 2025 TO WHOM IT MAY CONCERN: Lisa Murray Respectfully referring Mr Ms. Emergency medica assessment (age), _ (sex) for Hassessmel Diffeuty breathing, chest pan CHIEF COMPLAINT: IMPRESSION: MEScUeskebtat nny. needs Xray and ‘orthopedic evaluation Sincerely, Whitney Willams, Nurse Nurse on Duty DISPOSITION SLIP Notaccepted C1 Hospital admission [J OPD treatment CER treatment BEI Others: Reteves 1 ovate seis for futher management REMARKS: ITAL SIGN: BP: 120 80 mig HR: B2 bpm Temp: 38 8 C RR: 18 cpm TREATMENT GIVEN: -Paracetama) 800m9 FO oan pased RECOVMENOATIONS: Patent refered to extemal facity fr further ser cmant and nest Xeay, Advised to retum for folomup after 3 days or sone\" (Oral hydration souton Bed Giagnoste workup ncudng compete Dl faymptams worsen, Prescrotion provided far symptomatic‘ MD. Patricia Escobar _ _ ‘Agtending Phys «Please return this slip to the patient.\""
    },
    {
        "image": "referral2_synth_18_aug5.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines FAR EASTERN UNIVERSITY REGION IV A CALABARZON ‘Student Heath Servees REFERRAL FORM DATE: _ November 03, 2025 TO WHOM IT MAY CONCERN: re Respectfully referring Mr Ms. 18 Caan) (ced for mrt maton nnenement CHIEF COMPLAINT: IMPRESSION: MU UOsKeletal nry, needs X ray and orthopedte vation Sincerely, Whitney Willams, Nurse Nurse on Duty DISPOSITION SLI Date; 17032025 Notaccepted (C Hospital admission COPD treatment CER treatment 1K) Others: Reteres to porate spect for ter management REMARKS: \\VITAL SIGNS: BP: 120 80 mentig HR 82 bpm Temp: 38 5 C RR: 18 com TREATMENT GIVEN: Paracetamol 500m PO “Oral ehydraton soluton Bed rest advised RECOMMENDATIONS Patent refered to extemal tacity for further degnoste wortup meudng complete Blood count and chest Xvay Advaed to etum for folowup afer 3 days or sooner ‘I symetoms worten Prescreton provded for symptomate relat MD. Patricia Escobar ‘Attending Physician ‘Please return this slip to the patient.*"
    },
    {
        "image": "referral2_synth_19_aug1.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines UNIVERSITY OF THE PHILIPPINES DILIMAN, REGION ‘Student Welness Center REFERRAL FORM TO WHOM IT MAY CONCERN: Valerie Taylor Respectfully referring Mr Ms. (ony aan) for, ees eon a evan ‘Acute allergic reaction CHIEF COMPLAINT: Anuiety related symptoms, recommend counseling referral IMPRESSION: Sincerely, Elizabeth Erickson, RN Nurse on Duty DISPOSITION SLIP Date, 11162025 Notaccepted &€]Hospitaladmission CJ OPDtreatment (IER treatment Others: REMARKS: \\VITAL SIGNS: BP: 120 80 mmbig HR: 82 bpm Temp: 38 5 C RR: 18 cpm TREATMENT GIVEN: Paracetamol 500mg PO Oral rehydration soluton Bed rest ac Giagnoste workup incuding compete 4 symptoms worsen, Presciption provided for symptomatic relet Dr. Randy Edwards ‘Attending Physician \"Please retum this slip to the patient *"
    },
    {
        "image": "referral2_synth_19_aug2.png",
        "label": "referral",
        "ocr_text": "abit of the Philippines SS ONIMAAT TO WHOM IT MAY CONCERN: Aecpectfully referring Mr Ms, Vatesie Tayiot CHIEF COMPLAIN) srs IMPRESSION: Sircarely, NeseonDaty or CROTON SLIP oi 1B eur TREAT! RECOUMENDATIONS. Patient tered i9 26 Campos arg"
    },
    {
        "image": "referral2_synth_19_aug3.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines UNIVERSITY OF THE PHILIPPINES DILIMAN REGION I ‘Student Watiness Canter REFERRAL FORM DATE: November 16, 2025, TO WHOM IT MAY CONCERN: Valerie Taylor Respectfully referring Mr Ms. (ase), _\" (sex) for Medealconsutatn and evataton Acute allergic reaction CHIEF COMPLAINT: ‘Anxiety related symptoms, recommend counseling referral IMPRESSION: Sincerely, Elizabeth Erickson, RN Nurse on Duty DISPOSITION SLIP 111612025 Dat Notaccepted 1] Hospital adi n CJoPDtreatment CIER treatment Others: REMARKS: VITAL SIGNS: BP: 120 80 mmHg HR: 82 bpm Temp: 38 5 C RR: 18 cpm TREATMENT GIVEN: Paracetamol 500m PO Oral rehydration soliton Bed rest advised RECOMMENDATIONS: Patient refered to extemal facity for further iagnostic workup incuding complete blood count and chest X ay. Advised to retum forfolowup after3 days orsooner i symptoms worsen. Prescription provided for symptomatic rel Dr. Randy Edwards ‘Attending Physician \"Please retum this slip to the patient.*"
    },
    {
        "image": "referral2_synth_19_aug4.png",
        "label": "referral",
        "ocr_text": "Republic of tre Philippines TY OF THE PHILIP REFERRAL FORM Nevewber 18, 202: pare Martial conautaikin anc wsstuxtin sex) for” Strcerely, fnabett Nurseon- Duty DISPOSITION SUE isnenes Bate, Clopoweatment CUE aeatinent Mot accepted KJ] Hospital adm fC Others: 20188 mesg HER: 32 br sm TRERTMENS witebun salut ad rast ucvsed REGOMMENDATIONE: Patient refeuiee fo axtecnal faily or ta sdasgnastio warp nebicing corrgiete Dbiod eau and chest Xn. Advises to rasa for faton us afer 3 days or snonae | eprptoaa worsen, Presciption panied Yer splints tet CPR Br Randy Edwards “Please retin thie stip to the patent *"
    },
    {
        "image": "referral2_synth_19_aug5.png",
        "label": "referral",
        "ocr_text": "Republic of the P) es UNIVERSITY OF THE PHILIPPINES DILIMAN REGION 1 Student Wetness Center RE FERRAL FORM DATE: November 16, 2025 SS TO WHOM IT May CONCERN: Vale Taylk Respectfully referring Mr jms, V l tie Taylor (ge), M (sex) for Medical consuttation. and evaluation Acute alergic reaction CHIEF COMPLAINT: 19 IMPRESSION: “™-teated symptoms, recommend ‘counseling referral Sincerely, Elizabeth Erickson, RN eee Nurse on Duty DISPOSITION SLIP men ISPOSITION SLI ——— Not accepted Hospi Others: CER treatment Dr. Randy Edwards ‘Attending Physician \"Please return this sip to the p"
    },
    {
        "image": "referral2_synth_20_aug1.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines FAR EASTERN UNIVERSITY NATIONS CAPITAL TO WHOM IT MAY CONCERN: Robert Martin Respectfully referring Mr /As. es Barisal an Sincerely, John Barrell, RY (opp restment (ER beacaent SAGEVENT toe pao ERRAL, NOTES: Fe ona gig studies. ‘lenin eppointon sn geass piecing warning ge, Please return this sip to the patient.”"
    },
    {
        "image": "referral2_synth_20_aug2.png",
        "label": "referral",
        "ocr_text": "Republic of the Phitppines FAR EASTERN UNIVERSITY DATE MOM IT MAY CONCERN Respecttoly referring Melis. «t IMPeEssOn: COMPLAINT: Pee Sincerely, Jon 8: 3 Het accepted Teed veatment HIER treatment “i Others: REMARKS: ITAL, SiG: BP: 1707 oyntay BR: 78 age avtecied sma Pann sevieate nemneterns ehopent evaiosiar and ping 90"
    },
    {
        "image": "referral2_synth_20_aug3.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines FAR EASTERN UNIVERSITY NATIONAL CAPITAL REGION cern REEERRAL FoRag DATE: November 17, 2025 __ TO WHOM IT MAY CONCERN: Respectfully referring Mr Ms. Macin ee (oge _F (sex) for Medea clearance evatiation ‘Sports injury possible fracture CHIEF COMPLAINT: my Date, 172005 DISPOSITION SLIP ——__ Notaccepted CHospital admission Sorvtreatment ER treatment Others: Or. Chris Parrish Attending Physician “Please retum this sip to the —— vr"
    },
    {
        "image": "referral2_synth_20_aug4.png",
        "label": "referral",
        "ocr_text": "Republic of the Philippines FAR EASTERN UNIVERSITY leaoponna owas DATE: TO WHOM IT MAY CONCERN: Robert Martin enpecthiyrteing MIMS. ao (age) (100 for ee ena —— ee CHIEF COMPLAINT: snonessione See ee Sincerely, Jona Barnett, RN ne SS Ee DISPOSITION SLIP pote: 708 eat sion COPD treatment SRIER w a Horaccoted enna OC Others: era sions. op, 110770 mat M78 BO T0e 372, pmesaaton REFERAA. NOTES Vincted one Pan medeaton somites ppd for We nereyng mutes. Yam mavens 1 8 OA Nae ‘Aavaed sc bed est ond Nopantment seneauied Patent education provdes 0 Dr. Chis Parrish eee “Aitending Physician se return this sp to the patient.” eee"
    },
    {
        "image": "referral2_synth_20_aug5.png",
        "label": "referral",
        "ocr_text": "Republic af the Philippines FAR EASTERN UNIVERSITY 7 NATICHAL CAPITAL REGION eens man nrc Sn ioeinninn pave; Member 17 2025 TO WHOM IT MAY CONCERN: Robes Martin Respectfully refering MigMs. Oy bese carece evan FP _ (san) for oer ‘Spore muy poaviote trachae Sincerely, Jorn Bemet, RK NurseonDuty Doce, 1117025 TS Notaccepted CI Hospital admasion COPD treatment SER treatment 3 others: DISPOSITION SGP REMARKS: VITAL HONS: iF: 11076 mmtey MIE 78 Donn Temp: 7 250 RFt 20 opm INTIAL MANAGEMENT: ke ser wopind to stheoted sen an madionter acdwstered Spin apelin tor mmcetraten REFERRAL NOTES: Patent mquery’ anscece evateto end mepng tines Kary raauesied tre out aching Advaest sirct 8c eat and atswton of llected tne Futon, ee poemewnt sever ted Faber: nizaaten presled parang wearing 6M. Dr. Chns Parish fata Phyo “Pease vetuen this sp to the patient.” ———"
    }
]