[
    {
        "image": "request1_synth_10_aug1.png",
        "label": "request",
        "ocr_text": "Office of Student Attairs. Pamantasan ng Lungsed ng Mayet Records Seetina Record Request Ne. RECORDS REQUEST FORM dowtisy spaciticatiy as possibly to bel ron in identifying the Piesse lise reo! ‘ihe reoude Section stay need sme tins to ince snd review docsmwets that are responsive to your wequedt, mui Someone osertatan PURPOSE: Lianne Exam Reoweeneat REQUESTED RECORDSDOCE: Diotomna (Qvighal Teanacrat of Racor. (Ongisal GAY iCeetteaton, Aamentizaton, Ysrtcatce) RELEASED BY Relonsing Seah, S25 D6 Received by: ANAEA SHS"
    },
    {
        "image": "request1_synth_10_aug2.png",
        "label": "request",
        "ocr_text": "Otfice of Student Affairs antasan ng Langsod ng Maynila ecards Section Reguest No. Please {ul out this for the records vou 3ve need m completly toto your 1 may uved sonte tine te locate and review a wh request records See REQUESTER INFORMATION 1927 138. Contact Number: 2 PURPOSE: Lsensura Exam Requirement MELEASED BY ary Dior"
    },
    {
        "image": "request1_synth_10_aug3.png",
        "label": "request",
        "ocr_text": "Please i oust this Foote ate was Sestion Me EQUEST! ANGE Naae Can Cenitact Number REQUES Brion Ong [Geitieation, PtinencaeS, RELEASED BY Releasiiy Stat shy gue st RECORDS BEQUEST FORM complete jag. The records sectio ay nocd some tine to fo ER INFORMATION details an possible to hel agli te apni you IR re respoasiee nd geview documents 5 an idennity specdtically your"
    },
    {
        "image": "request1_synth_10_aug4.png",
        "label": "request",
        "ocr_text": "Office ot Student Ar R poten RECORDS REQUEST F ORME Fleas 8 oi form completely sil The records se fs you neve fisiny the ssash Ye a A Phe revonits Soctroa a request some ise te Tecate and review decuotents thal ay posuve fe your REQUESTER IN) ORMATION PE RB OS, RELEASED ay Rodeas! Recs by ang"
    },
    {
        "image": "request1_synth_10_aug5.png",
        "label": "request",
        "ocr_text": "Office of Student Affairs Pamantasan ng Li ng Lungsod ng Maynita Record Request No. 2025107877 _ RECORDS REQUEST FORM Please fill out this form completely with as much details as possible to help us identify specifically the records you are requesting. The records section staff is available to assist you in identifying the records you need. ‘The records Section may need some time to locate and review documents that are responsive to your request. REQUESTER INFORMATION Name _ANGELA CHANG Date _10212025 Campus: Main Campus Unit, Colege of Engreerng Email, rts Mover Goomartanan oto ‘Contact Number; _0827 136 1062 RECORDS DOCOUMENTS: PURPOSE: (Dipioma (Original) Transcret of Records (Orgnai) CAV [Lecensure Exam Requrement (Certfeaton, Aumentcaton, Verficaton) RELEASED BY 10242025 Received by _ANIGELA CHANG Dete_ aon."
    },
    {
        "image": "request1_synth_1_aug1.png",
        "label": "request",
        "ocr_text": "‘Academic Records Division san Beda University Records Section Record Request No. -202510 7553_ RECORDS REQUEST FORM sails as possible to help us identify specifically is form completely with as much de “The records section staff is available to assist you In identifying the Please fill out thi the records you are requesting. records you need. “The records Section may need some time to local «and review documents that are responsive t0 Your request. REQUESTER INFORMATION Name _CRISTIAN OLSON ‘Date _10282028 Campus, Nor Campus Unit, Colege of Eaveation Contact Number: _0928 990 9465 Email smanwenvergsanesaon REQUESTED RECORDS DOCOUMENTS PURPOSE: “Transcript of Records (Original) Dipoma (Certified True COPY) Employment (Abroad) Immigration ‘uthenteation Red Ribbon RELEASED BY Releasing Staff _Srawn Thomeson Date _1020 2025 Received by _CRISTIAN OLSON. Date _10 29 2025"
    },
    {
        "image": "request1_synth_1_aug2.png",
        "label": "request",
        "ocr_text": "Academic Records Division San Beda University Records Section Record Request No. 02510 7553, RECORDS REQUEST FORM Please fill out this form completely with as much details as possible to help us identify spe; the records you are requesting. The records section staff is available to assist you in identifyi records you need, The records Section may need some time to locate and review documents that are responsive to your request. REQUESTER INFORMATION Name: CRISTIAN OLSON Date _10 25 2025 Campus: Noh Campus Unit; Colege of Education Contact Number _0928 990 9465 Email; “envenver san ecu REQUESTED RECORDS DOCOUMENTS PURPOS! Transcript of Records (Original) Diploma (Certfied True Copy) Employment (Abroad) Immigration Authentication Red Ribbon RELEASED BY Releasing Staff _Stawn Thompson Date _10 28 205 Received by _GRISTIAN OLSON. Date _10728 2025"
    },
    {
        "image": "request1_synth_1_aug3.png",
        "label": "request",
        "ocr_text": "is Division Sar Beda Unive Recards Seetinn, RECORDS REQUEST FORM Please Bil ot this forin compteteh the recaeds you ape sequesting. The securds you reed with as mach, details as passibte to beh Fevonls section iP Us hlontiy specifically N Staff is awaifable to ‘assist you ia iedontifiving the “The seconds Sectigm may seed sete ie tn Mate and crsinw docnanemns that ase eespnsivg tos your Pogue REQUESTER INPoRRA TION REQUESTING KECGASmOCeL MENTS: [rttocee) of Records (Onginah Dekema Certins true Copy) Authentic atan ie ban Serobyeant (abesgct tn rte RELEASED BY Releasing Siat Received by"
    },
    {
        "image": "request1_synth_1_aug4.png",
        "label": "request",
        "ocr_text": "adiemic Records Civigion, im Beda Univer Records Sertion Rocard Request No. RECORDS REQUEST FORM Pease ff out this form x the rocovds you are reat records you need mopletely with as muciz dewaits as possible to help ws identity esting. ‘The mcotty sevtion staft is available ta assist you in tent! tying the way need some dine to locate and reve ocusints that 2s esponsive to your REQUESTER INDORMATION Nurse; CRISTIAN OLSON ae ee REQUESTED RRCORIYOCOUMENTS PURPOSE: Trevwserint f Rencres (Original Diplroa (Careed Tse op) foyment Abroad) temigraten, Autventeatonined Riker RELUASER BY Rete Recs."
    },
    {
        "image": "request1_synth_1_aug5.png",
        "label": "request",
        "ocr_text": "Academic Records Division San Beda University Records Section Record Request No. 2025107553, RECORDS REQUEST FORM {ues fill out this form completely with as much details as Possible to help us idemtty specifically the records you are requesting. The records sectiew stat available to records you need, ‘The records Section may need some time to locate and review documents that are responsiv. request re to your REQUESTER INFORMATION ‘Name _CRISTIAN OLSON Date _1025 2025 Campus _North Campus Unit _Colege of Education Email: \"2 eaver saneau pn Contact Number _0928 990 9465 REQUESTED RECORDS DOCOUMENTS PURPOSE: Aansctbt of Records (Original) Dptoma (Certies True Copy) Employment (Abroad) Immigration Authentcaton Red Ribbon mms RELEASED BY Releasing Staff _Shawn Thompson Date _107292005 Received by _CRISTIAN OLSON Date _ 1072972025"
    },
    {
        "image": "request1_synth_2_aug1.png",
        "label": "request",
        "ocr_text": "‘Academic Records Division ‘Adamson University Records Section Record Request No. 202511534 RECORDS REQUEST FORM Please fill out this form completely with as much details as possible to help us identify specifically the records you are requesting. The records section staff is available to assist you in identifying the records you need. ‘The records Section may need some time to locate and review documents that are responsive to your request. REQUESTER INFORMATION ‘Name _KATHRYN BAILEY Date _105 2025 Campus _Manila Campus Unit: Coteve of Business Administration Contact Number _0820 371 1058 Email: 222° se adamson edu. ph REQUESTED RECORDS DOCOUMENTS PURPOSE: Cerificate of Scholastic Record Certficate of Completion CAV Employment (Local Visa Application for Employment RELEASED BY Releasing Staff _8 2\" Norton Date _1108 2025 Received by _KATHRYN BAILEY Date _1171172025"
    },
    {
        "image": "request1_synth_2_aug2.png",
        "label": "request",
        "ocr_text": "Academic Records Division ‘Adamson University Records Section Record Request No, 20281 5382 RECORDS REQUEST FORM Please fill out this form completely with as much details as possible to help us identity specifically the records you are requesting. The records section staff is available to assist you in identifying the records you need The records Sect request on may need some time to locate and review documents th ire responsive to your REQUESTER INFORMATION Name: KATHRYN BAILEY Date _1 0872025, Campus: ManiiaCampus Unit Contact Number: 09203711058 email 20\" GOB HON A REQUE PURPOSE: Certicate of Scholastic Record Cerfeate of Completion CAV Employment (Local) Visa Appication for Employment RELEASED BY Releasing Staff _Bean Norton Date: 1109 2025 Received by _KATHRYN BAILEY Date _1111 2025"
    },
    {
        "image": "request1_synth_2_aug3.png",
        "label": "request",
        "ocr_text": "Agadienic Recstds Divist Adainson Unive: Records Section ian identity specificaity ‘you in Rderitifying the The weonts Sect upients the! Tequesi 1 may need some finte ty locate sud review di toyour REQUESTER INFORMATION PURPOSE: Emeraytnent (Local) visa Av"
    },
    {
        "image": "request1_synth_2_aug4.png",
        "label": "request",
        "ocr_text": "Academic Records Division Adamson University Records Section Reverd Request No 238 RECORDS REQUEST FORM Presse fil out this form: completely with ax inch detais 25 possibte toheip us Klentity specifically Deencconde yow are cequestng. The records section aff bs atailble to assist you in xeutifying she records you nocd. “Te records Section may need some sequest, REQUESTER IXFORMATION Namo KATHRYN BARLEY Comms, MOS COMPS Comtact Nunpber; 0220 371 1088 ime to locate and review decunneais that are reaponsive to your REQUESTED RECORDS DOCOUMENTS PURPOSE: ‘Certzeate of Senalattc Record Certfcate of Compiotion CAV $3 Emgioyrert"
    },
    {
        "image": "request1_synth_2_aug5.png",
        "label": "request",
        "ocr_text": "Academic Records Division ‘Adamson University Records Section Record Request No. 202511 5382 RECORDS REQUEST FORM Please fill out this form the records you are re records you need. completely with as much details as possible to hel Ip us identify specifically ‘questing. The records section st aff is available to assist you in identifying the ‘The records Section may need some time to locate and review documents that are responsive to your request. REQUESTER INFORMATION Name _KATHRYN BAILEY Campus _Manila Campus Date _1105 2025 Unit _Solese of Business Adminstration Email: 2 2 3# ks @adamson edu ph Contact Number _0920 371 1058 REQUESTED RECORDS DOCOUMENTS PURPOSE: Centicate of Scholastic Record Certiicate of Completion CAV Employment (Local) Visa Appication for Employment RELEASED BY Releasing Staff _B1van Norton Date _1109 2025 Received by _KATHRYN BAILEY Date _1171 12025"
    },
    {
        "image": "request1_synth_3_aug1.png",
        "label": "request",
        "ocr_text": "pecords Management Offee mamantasen ng Lungsod rg Maw eceeds Section Record Request Ne HECORES REQUEST FORM sovitieay im scenttying DE sty 8 Jy dtaits as pronthie to Bel? ‘oat this Gores cuampbetety sith 2 ap Tie esc section tall available £9 38598 OH case ft escees pos i reget 8 reoneds yw ned scopes tha are responsive 6° wad ew ‘The records Hector request BE QUESTRR IN! sa say ned some cinse 46 WoCale FORMATION agenesis te peRPOSE: pasessinnst Reverepnert RELEASED BY Releasing Stott, Oe REEteE Received bY: BROND"
    },
    {
        "image": "request1_synth_3_aug2.png",
        "label": "request",
        "ocr_text": "Records Management Office Pamantasan ng Lungsod ng Maynila Records Section Record Request No (2025112208 RECORDS REQUEST FORM. Please fill out this form completely with as much details as possible to help us identify specifically the records you are requesting. The records section staff 1s available to assist you in identifying the records you need ‘The records Section may need so request ne Lime to locate and review documents that are responsive to your REQUESTER INFORMATION Name, RHONDA AYALA Nort Campus Date _1042025 Campus Unit £208 2 Bacens Aonenaton Contact Number _0919 37087 12 _ ema) eee aGoarartanan was on REQUESTED RECORDS DOCOUMEN PURPOSE Certfcate of Graduation Authenteated Optoma Transcret of Professional Development Records (Certfed) RELEASED BY Date _11 102025 Date 111172025 Releasing Staff Dave Rar Received by: RHONDA AYALA -"
    },
    {
        "image": "request1_synth_3_aug3.png",
        "label": "request",
        "ocr_text": "Revords Management Of Pamantasan ng Lungsod ng Mayntl Records Section RECORDS REQUEST FORM ficaliy fh details as possible to fsetp us identifi cconypletely with as ms 2 stall 19 avilable to assist you ii whentilying the Please Gt ext this to ne seconds se the recurls you ane requesting. recon gone need ‘The records Section amy aved sone tine to locaée and review documents that are responsive fo yous request REQUESTER INFORMATION Ri Eats Soongnmadionnentasen et ED RECORDWEOCOUMENTS PURPOSE: sraxtuation Aethenticated Digioens Traneonet ot Professions! Devespnvsnt Records (Corvestt RELEASED BY Releasing Stath, Dove Renee Received by: BEGHDSA"
    },
    {
        "image": "request1_synth_3_aug4.png",
        "label": "request",
        "ocr_text": "fh Records Management Pamantas RECORDS REQUEST FORM fy specifically diiying the pletely wink 9s muck details as pasihte te help as x Five recoriis yeeiion siait is available ie sosict you in iden Please fit out this nds sore oe records you seview documents that aze responsive to your ‘yhe records Section may need sone tow ty locste eq REQUESTER INFORMATION Nacue: RHE Horth Campus eta, fem onnens Smoraraton ‘Campas,, Non Campus ea, Lotene ot Benne A Contact Neuse Engi ini peop tes eo REQUESTED RECORDSROCOUMENTS PURPOSE: ecttioate of Graduation Authandeated Diokmne Tearscret Pretessiona! Developement RELEASED BY easing"
    },
    {
        "image": "request1_synth_3_aug5.png",
        "label": "request",
        "ocr_text": "Recoiis Management Office Pamantasan ng Lungsod ng Maynils Records Seetine Record Reques 203611 0208, RECORDS BEQUEST FORM Ploane fi out this Yoru cornpleteiy with as mach details as pors the reconts you ace questing The recceds section stall is aval poids YOR eed. be to help us idewtily specifically ole Go assist yon on identifying the The records Sevtiin may need eaine lene to locste aad neview dactments Hud we respenzive fo your egies REQUENY ORMATION 8 BN ‘Name: RNONDA AYALA Bonn Camous OO OSTI Coatact Nurmver REQUESTER RECORDSMOCOUMENTS Casiisate of Graduation Aatrenticaing Diptina Veanver of Professsonai Daveiopenent scout (Carits Desc: HOBOS ates i"
    },
    {
        "image": "request1_synth_4_aug1.png",
        "label": "request",
        "ocr_text": "Records Management Office ‘Ateneo de Manila University Records Section Record Request No. \"2028102750__ RECORDS REQUEST FORM please fill out this form completely with much details as possible to help us identify specifically PAC ARe ons you are requesting. ThE records SECU a pailable to assist you in identifying (De records you need and review documents that are responsive {0 YUE on may need some time t0 Locate ‘The records Secti request REQUESTER INFORMATION ame. STEPHEN SMITH ate: 10162025 Campus, oue26n HY CAMO pnt, eon et Barns Aon Contact Number _0227 118 6537 ait orem oo REQUESTED RECORDS DOCOUMENTS PURPOSE: RE Oi Recrds corn) cpema cert Te CoP!) mloyment (Abroad) Inmgraton Kinentsotonfaed Ribbon RELEASED BY Releasing Staff: Dav maanet Date _10202025, Date: 10202025. Received by _STEPHEN SMITH"
    },
    {
        "image": "request1_synth_4_aug2.png",
        "label": "request",
        "ocr_text": "Records Man; AY to Ge Mania Uni Records Seetion RECORDS REQUEST Forat Please Hill o the records records y M ihis forma compesety ae Pejuesting. Ths ible te Relp us idew: ion statis ay need Fhe revo Session nay naed some tinne tn Hosate and review dc request MS Wiad are responsive to youp REQUESTED RECORDS aN aserit ot Re DUMEN ES (Gentes True fe 1Ongna Darema PURTOSE ‘20 Febbos Emiovien (tie OR Ieigr tion"
    },
    {
        "image": "request1_synth_4_aug3.png",
        "label": "request",
        "ocr_text": "nt Oe ity Records Mi tenes de Manta Une: ecards Section Record Reae ie 718 RECORDS REQUEST F GEM ve tes hedp s Klentify 80% seast you in ident us stetaits an possidl sailable £0 3 petely with 2 268 “Thee encords seetie da form coy? a Pieare Bik ost dhe records you are Teas on sia records you nee ro locste and soview detest St ane responsive 1 FANT “The records Sectian Baty seqqiest REQUESTER INFORMATION ia) y Gat s Nae ee ct Wagner. PURPOSE: REQUESTED RECORDSIDOS ‘OUMENTS regener Pacts (OMe OHI gg V8 SONY sieyracea (Aero) HERRIEES Jatnesicston ed RDO RELEASED BY Reteasing Staff AEE Received ™"
    },
    {
        "image": "request1_synth_4_aug4.png",
        "label": "request",
        "ocr_text": "Records Management Resunds Sex Record Remuest No. 09789 RECORDS REQUEST FORM sy ffl owt this forea vansptetely with se mt possible to belp us ideatity 5 the reconds you are requesting. The revends section stat¥ is avatioble to wssist you in ident eve documents that fo your ids Section may need some tines te VESTED RECORD SNCOUMENTS aceipt of Records (Ovighw) Dinowia (Certtieg True Copy) AulhsatizatensRed Ren: BELEASHD BY Dee. Releasing Staft _ Davi Magner Date: Received by"
    },
    {
        "image": "request1_synth_4_aug5.png",
        "label": "request",
        "ocr_text": "Records Management Office ‘Ateneo de Mania University Records Section Record Request No. 2228102780 RECORDS REQUEST FORM Please fill out this form with as much details as possible to identify specifically Iced meg MMU The end ecto sa aoa esc Tecords you need. ier, Son may ee some ie oleae and eve document th ste esponave oyu request, REQUESTER INFORMATION ‘Campus _2v z0n City Campus Unit; £20 Bases Aaminstaton ‘Contact Number _0827 118 6637 Bena, SS eeemenctnee REQUESTED RECORDS DOCOUMENTS PURPOSE: Nee Records (Orga Dima (Certed Trve Copy) Emetoyment (Abroad) Immigraton RELEASED BY Received by _STEPHEN SMITH Date _10202025"
    },
    {
        "image": "request1_synth_5_aug1.png",
        "label": "request",
        "ocr_text": "Registrar s Office San Beda University Records Section Record Request No. 02510 2608, RECORDS REQUEST FORM Please fill out this form completely with as much details as possible to help us identify specifically the records you are requesting. The records section staff is available to assist you in identifying the records you need, The records Section may need some time to locate and review documents that are responsive to your request. REQUESTER INFORMATION Name _SHARI MURPHY Campus _0U229\" Cily Campus Unit, Colege of aucaion Contact Number _0921 790 5615 Email: 2matlee sen eduph REQUESTED RECORDS DOCOUMENTS PURPOSE: Diploma (Original) Transcript of Records (Original) CAV ‘Scholarship Application (Certification, Authentication, Verification) RELEASED BY Releasing Staff _Daniel Price Date _10 28 2025 Received by _SHARI MURPHY Date _1073172025"
    },
    {
        "image": "request1_synth_5_aug2.png",
        "label": "request",
        "ocr_text": "Registrar s Office ‘San Beds University Records Section Record Request No. Ss RECORDS REQUEST FORM Please Git ow this form completely with os mach details as possible to help ax weatify specifically the recards you are requesting. Tae reconis section staff is availabe to assist yo ia idemtifying the rocouds you need. “The reconds Section mey need some tite to locate and review docuimets thai are respeutsive to your request REQUESTER INFORMATION REQUESTED RECORDS DOCOUMENTS: PURPOSE: Dinero (Orezna! Teanserol ot Pacorts (Oneiatt CAV ‘Sehotm ny Apotcaae (Cortteaton, Auteracaton, Verte ater) RELEASED 8 Releasing Staff _Owet Pree Recerwed by _ SHUN MURP IY"
    },
    {
        "image": "request1_synth_5_aug3.png",
        "label": "request",
        "ocr_text": "asco Request NE RECORDS BEQUEST FORM se detote as posse to Bel ws Seco assis YO8E A come sat 25 SS re to youu sais that ave respenhy ve amd rewnen GUT REQUESTER U Contact Numbers SS PURPOSE: pQquesTEs BCERDSMOCOUMENTS pninma jorge Twaneeret RAS roe segs RY Ssenciarnn Be ati eepentcn, eseneatan, We PELEASED BY"
    },
    {
        "image": "request1_synth_5_aug4.png",
        "label": "request",
        "ocr_text": "Registrar s Office ‘San Beda id RECORDS REQUEST FORM Please fill out this form completely with as much details as Possible to help us identify specifically the records you are requesting ‘The records section staff is avaiable lo aseeny fyi records you need, tifying the ‘The records Section may need some time to locate and review documents that are Tesponsive to your Request, REQUESTER INFORMATION ‘Name _SHARI MURPHY ‘Campus _20n City Campus Contact Number _0821 790 5615 REQUESTED RECORDSMOCOUMENTS PURPOSE: Diploma (01 Tr ‘of Re (Or cay Fe corona ranscript of Records (¢ riginal) ‘Scholarship Appication RELEASED By Releasing Staff _Oaniel Price Date _10292025 Received by: SHAR MURPHY Date: 03am"
    },
    {
        "image": "request1_synth_5_aug5.png",
        "label": "request",
        "ocr_text": "Ragisttar s Office versity RECORDS REQUEST FORM specitwatly ad possible to kelp ws Het tate ses agsiat you is eet sae nach etal 28 staat is ava Pianve fit nit this forin comely ite yea ase resgustig. The feces SS tise 10 reread ot ne ccoords Section may wee! some BEE so fowcate ane eeview documents CHR SF responeive 60 Ase requests REQUESTER INFO: MATION Contest Number pEQuEsTeD RECORDSAWOCOUMENTS vremnacrat st eacarta sone CAV nonce Ape Cee, REPL BER VERE SED AY pes eieasing Sat DEP. oceived Oy! SH"
    },
    {
        "image": "request1_synth_6_aug1.png",
        "label": "request",
        "ocr_text": "University Recoras Oitice Far Eastern University Recards Section Revurd Reavest No. 20287278 RECORDS REQUEST FORM out his form eanaptesely with as much details as possi words you are reguestieg. The reverts seciion stall is available to assist yor reconis 500 teed ble to help us atentify specifics ide x conits Section may ced some time (¢ locate and review dex uments thal sie responsive ty your Caraga Contact Neaaber _! REQUESTED RECORDSDOCOUMENTS PURPOSE: Corte ste ot Cruden Corttccle of Goneral Wesgtins Average Predeeaerat Daveispment ‘onocabes Dormia ie RELEASED BY Releasing Stafi Recerved by Diana Date, Date: th"
    },
    {
        "image": "request1_synth_6_aug2.png",
        "label": "request",
        "ocr_text": "University Records Office Far Eastern University Records Section Record Request No. RECORDS REQUEST FORM. Please fill out this form completely with as much details as possible to help us identify specifically the records you are requesting. The records section staff is available to assist you in identifying the records you need, ‘The records Section may need some time to locate and review documents that are responsi request. REQUESTER INFORMATION Name _DIANA KING ‘Campus _729uig Campus Contact Number _0928 846 2497 REQUESTED RECORDS DOCOUMENTS PURPOSE: Certiicate of Grades Certficate of General Weighted Average Professional Development Honorable Dismissal RELEASED BY Releasing Staff _Lauren Reid Date _11 11 2025 Received by _DIANA KING Date _11 12 2025"
    },
    {
        "image": "request1_synth_6_aug3.png",
        "label": "request",
        "ocr_text": "University Records Office Far Eastern University is Section RECORDS REQUEST FORM this form completely with as the records you are re much details as possible to hel records you need, ip us identify specifically ‘questing. The records section staff is available to ssist you in identifying the The records Section may ¥” need some time to locate and review documents that are Tesponsive to your request. REQUESTER INFORMATION Name _DIANA KiNG Date _11052005 ‘Campus _T 9uig Campus Unit _Colege of Education Contact Number _0928 846 2497 Email; *Pheys ter edu ph REQUESTED RECORDS DOCOUMENTS PURPOSE: Certicate of Grades Certtcate of General Weighted aver Professional Development Honorable Dismissal ~~ ‘a RELEASED BY Releasing Staff _Lauren Reid Date _11 11 2095 Received by: DIANA KING Date _11 1272005"
    },
    {
        "image": "request1_synth_6_aug4.png",
        "label": "request",
        "ocr_text": "University Records Office Far Eastern University Records Section 202511. Record Request No. RECORDS REQUEST FORM Please fill out this form completely with as much details as possible to help us identify specifically the records you are requesting. The records section staff is available to assist you in identifying the records you need. ‘The records Section may need some time to locate and review documents that are responsive to your request. REQUESTER INFORMATION Name _DIANA KING Date _1105 2025 ‘Campus _Ta9uig Campus Unit _C2tege of Education ‘Contact Number _0928 846 2497_ Email: 8hays tareduph REQUESTED RECORDS DOCOUMENTS PURPOSE: Certticate of Grades Certificate of General Weighted Average Professional Development Honorable Dismissal RELEASED BY Releasing Staff _Lauren Reid Date _1 11 2025 Received by _DIANAKING Date _1171272025"
    },
    {
        "image": "request1_synth_6_aug5.png",
        "label": "request",
        "ocr_text": "University Reconme Office Fae Eastern University Records Seetion Revord Rogaest No, coh RECORDS REQUEST FORA sdetails 2s yeanible to help us ideanty 5 ‘qvaltable vo sseast you in enadiying the Please PIL ont thin Soren comapbetety with as mete de records vow ave requesting, The records nectiea: wal 8 sesnmds you neced. sed soene tee Wo bosate wad sevice docauents Kt are sespansive £9 YORE ‘he records Sestton ea} request REQUESTER ENYORMA TION soshieyatplornds oh PURPOSE: Pretersional Dewelnormsrt REQUESTED RECDRESDOCOUMENTS nest Habe Maver Gonificate af Sears Cortes ot Gs Hiqnoeahie Dawes RELEASED BY Releasing Sift Heocelved by"
    },
    {
        "image": "request1_synth_7_aug1.png",
        "label": "request",
        "ocr_text": "‘ce of the Registrat university of the Pnilipnl Records Section requesting records you need. i may need some time The reconds See canes REQUESTER INFORMATION Conc! Nantber: 2 KD BECO: PURPOS coord Certheais of Completion £2 Puntos Stuhen Abrosd Reteasi"
    },
    {
        "image": "request1_synth_7_aug2.png",
        "label": "request",
        "ocr_text": "Office Of the Registrar Universily of the Phi pines Records Serten Revord Request No. aS RECORDS REQUEST FORA leave tif oct this form comptety the reconts you are reaues recor jou need with se rich details as possible to help as ident sic Ning. The cosets section staff wy avallabie tiv asta you ie The econts Section may aoud some time Requed. ts focus aad review documents that ave zespentsive te war SPQUESTER INFORMA TiGN Name: ROGER min ast Campus REQUESTED RECORDSDOCOOMENTS PORFOSE: Gurticste of Sohataote Record Certbinate of Coenstelins CAL Further Susies Abraaat fr Exployinet RELLASED BY Relewiing Seah, Received bys"
    },
    {
        "image": "request1_synth_7_aug3.png",
        "label": "request",
        "ocr_text": "Office of ihe Registrar Universtty of the Philippines Records Section RECORDS REQUEST FORM Picase fit out this form completely with as mach deiails 2s possible to help us identify specifically the reconts you ate requesing. The reccnis sectina staff ts availabie to astast vou in idendit ving the records you need: ‘The records Section may need some time to locate and review documents that are responsive ic your Deie _11022025 ‘Unni; Coton of Una fete REQUESTED RECORDS DOCOUMENTS: PURPOSE: Carttcate of Scholantc Recerd (ecttcate of Compistton CAV Furie: Stages Abenod fy Exmpoyinent"
    },
    {
        "image": "request1_synth_7_aug4.png",
        "label": "request",
        "ocr_text": "OMties of the Registrar pines RECORDS REQUEST FORM Poa fil out this form completely passible te help us identity specitioully too recoils Vout are regsiest midonitying wee REQUESTER INFORMATION Contac! st s anrsad REL ASED BY Roieasmg Stall Recewved by"
    },
    {
        "image": "request1_synth_7_aug5.png",
        "label": "request",
        "ocr_text": "Oftice of the Regisiter yy of the Prawppit Recacels Sect RECORDS REQUEST FORM day ides 2 you in ty as march details as possibie te sowiilshhe 29 ase this form completel ‘ow ate te The Date: 02 SEQUESTRE: RECORDS OCOLMENTS PURPOSE for Employment fate cf Scholnate: Record Centioate af Co!"
    },
    {
        "image": "request1_synth_8_aug1.png",
        "label": "request",
        "ocr_text": "Registrar s Ottice Sliman University Reecnels Section R RECORDS REQUEST FORM Please out this {orm cemptetety with Foconds you are requesting. The te rocouds yas nec ss stich details 2s pussibi seetion stall is at ie te help as identity spe fically ying the The reconts Section may ae san fe Unie to lowats and reviow documemis thai ate responsive t9 sour REQUESTER INFORMATION REQUEST Ei RECORDWA KC OUMENTS PURPOSE: Ceniticate of Schateste Record Cerificate of Completion CAN Eipioymam Local Vise Aggtcation (2 Emepicymens"
    },
    {
        "image": "request1_synth_8_aug2.png",
        "label": "request",
        "ocr_text": "Registrar s Ottice Silliman University Records Section Record Request No, 2 to help us identi to assist you in i ty specifically identifying the The records Section may need some time ‘0 locate and review documents that are esponsive to your request STER INFORMATION ‘Name _MELANIE THOMAS a Date _10182005 ‘Campus _Main Campus Ditiman Unit _College of Liberal rte Number. 0818 89 Contact Number _0918 591 2722 ait eral Arts Email: 8% racson siiman ec go ee —aneneren REQUESTED RECORDS DOCOUMENTS PURPOSE; for create Of Schotaste Record Certate of Compron cav Employment (Local) Visa Appication {for Employment RELEASED By Releasing Staff _James Booker Date _10222025 Received by _MELANIE THOMAS —— Date 10232005"
    },
    {
        "image": "request1_synth_8_aug3.png",
        "label": "request",
        "ocr_text": "Registrars Omer Saranan Unacctsaty Records Section Recat Reguest No DUESL FORM RECORDS R Diese bit oat ties roina ceamptetels regen yond 200d, poe we ete 4 dovenies The reunds Secties tray peed tents tee te Hos a3, m3 988 272 REQUESTYD RECORDS HOCOCMENTS creigabes Kacude Certy ste of Pcmetetn Ca weE EASES BY te 10222025 fia 1IATAS"
    },
    {
        "image": "request1_synth_8_aug4.png",
        "label": "request",
        "ocr_text": "Registrar s Gttice Sitieran University Recents Section Request No. RECORDS REQUEST FORM 8 idewtify specitieatty ft ow this forza conupletedy with as much detaiis ax possible to i in lontitying the lease 5 the records yuu are cequestiag. The recents section stalf is available ws wssist records pot need The reve requesd wih ne locate anit review do: ta your REQUESTED RECORDS OCOUMENTS Cortinnte of Scholweti: Recor Carttioute of Complain CAW for Eiesioymeri RELEASED BY"
    },
    {
        "image": "request1_synth_8_aug5.png",
        "label": "request",
        "ocr_text": "RECORE ru completes 0 aes yuu are requesting F She recarls Section may me rey REQUESTER INFORMATION Nina MELANIE (HOMAS: SPOCOUMEN? REQUESTED RECORD RELEASED WY aires booker ag Sia By wave Reson Deiticats of Comsiet Kecords See BEQUEST FORME t PURPOSE: win sdontad"
    },
    {
        "image": "request1_synth_9_aug1.png",
        "label": "request",
        "ocr_text": "Polytechnic University ef the Phitipgl Records Section Record Reguest No ogee RECORUS REQUEST FORM out this form conapletaly with ay much details as possible t help as esting, The recuids section stat? is availcdbe t naassist yons in identifying tae tion may need sente locate and 0 ow ducumants fal are responsive fo yoor IRPOUMATION rere2n2s Sotege ot Niran RRQUES ransor off dacenvcaborstese Ht BP RECORUN DOCOUMENTS pURPOS! (Grigiat) plea (Cartives Tran Ceoy' oars Exeminzaion #8 Arpicaticn"
    },
    {
        "image": "request1_synth_9_aug2.png",
        "label": "request",
        "ocr_text": "University Records Office Polytechnic University of the Philippines Records Section Record Request No. 202510 2881 RECORDS REQUEST FORM Please fill ou this form completely with as much details as possible to help us identify specifically the records you are requesting. The records section staff is available to assist you in identifying the records you need. ‘The records Section may need some time to locate and review documents that are responsive to your request. REQUESTER INFORMATION ‘Name _MICHELLE HOWELL Date _10972025 Campus _Manila Campus Unit; _Colege of Nursing ‘Contact Number; _0922 781 9396 Email: 279. <55002 paytechne edu ph REQUESTED RECORDS DOCOUMENTS PURPOSE: ‘Transcript of Records (Original) Diploma (Certified True Copy) Board Examination PRC Application ‘Authentication Red Ribbon RELEASED BY Releasing Staff _Christopher Andrews Date _1026 2025 Received by _MICHELLE HOWELL. Date: 107262025"
    },
    {
        "image": "request1_synth_9_aug3.png",
        "label": "request",
        "ocr_text": "ay Records OF uoieer of the Palippines rest Ne ord Re RECORDS REQUEST FORM entity <pecifical nie wo belp a8 i ews assist deat pp etaats as possi esely with a8 7 records section Presse fel recards YOR ng to your ats thet an ad review doettin REQUESTER INFORMATION Bae, LE Unie pany wxprecaro' PURPOSE: sCOUMENT Re Be icesthes Troe O98? CORDSIDE REQUESTED RE poms of Records (orn gaittad RADON"
    },
    {
        "image": "request1_synth_9_aug4.png",
        "label": "request",
        "ocr_text": "University Records CHice nde University of the Philipuines Recoeds Section RECORDS REQUEST FORM is form completely with as much details aa possi are requesting. The recone boelp ws identify speek the x clin stall is available uo assist yout i Beconts yor The seconds Section may ace some lime to iovate and review doe request, Bate _ ite2025 init: Come of Nuwaing REQUESTED RECORDS OCOUMENTS PURPOSE: Trasscrtt of Records (Origa) Biplona (Certhied Thue Com) oar Exavonation PRG Aepictian: suiPiceteatins Rea Retr"
    },
    {
        "image": "request1_synth_9_aug5.png",
        "label": "request",
        "ocr_text": "University Records Office Polytechnic University of the Philippines Records Section Record Request No. 02510 2881 RECORDS REQUEST FORM Please fill out this form completely with as much de the records you are requesting. The records section sta records you need, as possible to help us identify specifically is available to assist you in identifying the The records Section may need some time to locate and review documents that are responsive to your request. REQUESTER INFORMATION ‘Name _MICHELLE HOWELL Date _10182025 Campus _Manila Campus Unit, College of Nursing Contact Number _0222781 9336 Email; Ste\" ss9rera royiecinc efi eh REQUESTED RECORDS DOCOUMENTS. PURPOSE: Transcript of Records (Original) Diploma (Certfied True Copy) Board Examination PRC Appication Authenticatio Red Ribbon RELEASED BY Releasing Staff _Christopher Andrews Date _10 26 2025 Received by _MIGHELLE HOWELL Date _1072672025"
    },
    {
        "image": "request2_synth_11_aug1.png",
        "label": "request",
        "ocr_text": "& Transcript Request Form BLUEFIELD weenenened Counselor /R istear From. Subject: ‘Transcript Request send on official tra: sipt to: Mapu University cunts Division nevaid od City, Negres Covidental 6 Name While Enrolled: SABRINA BR 4 Barangay Sante Mimo Current Addeess: “98% City: 22220 Cry Code #020 Er SABRINA BROWN iad"
    },
    {
        "image": "request2_synth_11_aug2.png",
        "label": "request",
        "ocr_text": "fr Transcript Request Form BLUEFIELD Counselor Registrar To. Mapua Unversity (Name of School) From SABRINA BROWN (Name of Student) PLEASE PRINT Subject ‘Transcript Request Please send an official transeript to: Mapua Unversity Academic Records Division Student Information 2016 58654 Social Security Number: BROWN Name While Enrolled: SABRIN Current Address: 5% Barangay Santo 'i6o Davao de! 8000 city; Oe\" State Zip Code Femail Address. Mae Beonert yanan com Area Code and Phone Number: °9 98°° we at the above address or phone number. It is please bill or notify m Thank vou “If there is a fee, as soon as possible important that the transeript be sen SABRINA BROWN Signature Date"
    },
    {
        "image": "request2_synth_11_aug3.png",
        "label": "request",
        "ocr_text": "R . ie Transcript Request Form BLUEFIELD ee Tes lor Registrar Mapua Universi! From: Subject: asctipt Request Please send an offici script to: Mapua University vaconds Division 304 Esra Bouievard 'acot0d Cily, Mogias Cxeides Sects! Security Number Name While Enrolie Carrent Addres City: _Davoociy Email Address \"°h\" rea Code and Phone Number: OSB SUE 1653 “ity huportant i fee, please bil or notify me atthe above aditress oc ph ‘tat the transcript be sent an soon as possible. Thank emumber. tt is SABRINA BROWN Signature rerue28 Bate:"
    },
    {
        "image": "request2_synth_11_aug4.png",
        "label": "request",
        "ocr_text": "7 Transcript Request Form BLUEFIELD cOocrece To: Counselor Registrar Mapua University Name of Schoey From: a ___ SABRINA BROWH oe (Name of Student) PLEASE PRINT Subject: ‘Transeript Request Please send an official transcript to: Mapus University Acageme Recores Dinsion 964 Espata Sovievere Bacolod Oity, Nagros Occidental 6109 Student Information: Social Security Number: 21655 Name While Enrolled: SABRNA GROW! Current Address: 8 Barangay Santo tito State: Paso desu Zip Code! Area Code and Phone Number: 0839 285 1663 “If there is a fee, please bill or notify me at the above address or phone number. It is ireportant that the transcript be sent as soon as possible. Thank vou. SABRINA BROWH srsi202S ~-—--.-— Date _ Signature:"
    },
    {
        "image": "request2_synth_11_aug5.png",
        "label": "request",
        "ocr_text": "t i Transcript Request Form Po: Cintasetor/ Registrar Mapua University From: ids) (Name of Student} PLEASE PRR oe Subject: Transer Mons University Acad co Bars rent Addroes: cay ify here is af MAY me ae the Ve addres it bre seni a:"
    },
    {
        "image": "request2_synth_12_aug1.png",
        "label": "request",
        "ocr_text": "| B a . ira Transeript Request Form BLUEFIELD Comseior/ Reg! From: and an official transcript tot while Enroller ane ait Addeess, Avea Code ame Bhone Nuniber «bill or notify we at the abs ‘ne gent ap seort as posible, Thank You “af there importa saan Signature:"
    },
    {
        "image": "request2_synth_12_aug2.png",
        "label": "request",
        "ocr_text": "ir Transcript Request Form BLUEFIELD OLlvece To: Counselor Registrar Far Eastem University (Name of School) From: JAMES JENKINS (Name of Student) PLEASE PRINT Subject: Transcript Request Please send an official transcript to: Far Eastern University Records Management oma. 145 Muralia Steet Hallo City, toilo 5000 Student Information: Social Security Number; 2215 20081 Name While Enrolled: JAMES JENKINS Current Address; 480 Barangay santo Nito City; _Cagayan de oro State: Misamis Oriental Zip Code_9000 Email Address i Stin garcia gmail com Area Code and Phone Number: 926 103 5769 “If there is a fee, please bill or notify me at the above address or important that the transcri i Phone number, It is ipt be sent as soon as Possible. Thank you. JAMES JENKINS 10 24 2025 Signature: Date:"
    },
    {
        "image": "request2_synth_12_aug3.png",
        "label": "request",
        "ocr_text": "| 4 fr BLUEFIELD COLLEGE Transcript Request Form To: Counselor Registrar Far Eastem University (Name of School) JAMES JENKINS (Name of Student) PLEASE PRINT From: Subject: Transcript Request Please send an official transcript to: Far Eastem University Records Nanagement Ofice 145 Muralla Steet Hoilo City, toilo $000 Student Information: Social Security Number: 201209\" Name While Enrolled: AMES JENKINS Current Address: 420 82rangay Santo Nifio City: _Cagayan de Oro State: Misamis Ovental_ 7 Code 9000 Email Address sti\" 9 cgmail com Area Code and Phone Number: _ 926 1035769 “If there is a fee, please bill or notify me at the above address or phone number. It is important that the transcript be sent as soon as possible. Thank you. JAMES JENKINS 10 24 2025 Signature: Date:"
    },
    {
        "image": "request2_synth_12_aug4.png",
        "label": "request",
        "ocr_text": "Transcript Request Form To: Counselor /Registrar Far Eastern University me of School) JAMES JENKINS. (Name of Student) PLEASE PRINT From: Subject Transcript Request Please send an official transcript to: Far Eastem University Rec 145 Muralla Steet Howl City Hosto $000 0s Management Omce Student Information: Social Security Number: Name While Enrolled: “AMES JENKINS Current Address: 48° 8aa9gay Sant Ni Cagayan de Oro Misams Oven 7in Code 90° City ate Email Address 3\"? 92omail com Area Code and Phone Number: 926 1035769 “If there is a fee, please bill or notify me at the above address or phone number. It is important that the transcript be sent as soon as possible, Thank you JAMES JENKINS, Signature"
    },
    {
        "image": "request2_synth_12_aug5.png",
        "label": "request",
        "ocr_text": "Transeript Request Form From: Reconis Nanagemant Ofice {45 Muralta Steet rote City, Bois Stadeet tnt Sooial Security Mami enrolled: 8 Name While Fimall Addres: a Code and Phone Narber, address or phone nan ‘pill ar notify me at the above He. Thank you, as soon as possi oye there is a fee, ease 4 the traneerigt bes important that 1O2ADOES Signatur"
    },
    {
        "image": "request2_synth_13_aug1.png",
        "label": "request",
        "ocr_text": "counsel ne of Scho Brom: Socal Security Number warn WH c ent Address syf ane is a fee, please tall on crupestant Haat tlre transeD BRL be jsivat githman Uawe ser CE NGUYED si CE NGUYEN jossible. A Transcript Request Form 1 rien 2808 none number. 1 Yhank you Bat nis"
    },
    {
        "image": "request2_synth_13_aug2.png",
        "label": "request",
        "ocr_text": "say fr BLUEFIELD COLLEGE Transcript Request Form To: Counselor Registrar Silliman University (Name of School) ram BRUCE NGUYEN (Name of Student) PLEASE PRINT Subject: Transcript Request Please send an official transcript to: __ Silliman University Office ofthe Registrar 876 Nicanor Reyes Street Cagayan de Oro, Misamis Oriental 9000 Student Information: Social Security Number: 201943490 ‘Name While Enrolled _8RUCE NGUYEN Current Address: 546 82rangay Malate City; 220i State: 22v20delSur Zip Code_2000 Email Address, \"2than summers outlook com Area Code and Phone Number: 918 726 3564 “If there is a fee, please bill or notify me at the above address or phone number. It is important that the transcript be sent as soon as possible. Thank you. r BRUCE NGUYEN 1012612025 Signature: Date:"
    },
    {
        "image": "request2_synth_13_aug3.png",
        "label": "request",
        "ocr_text": "Transcript Request Form BLUEFIELD COLLEGE To: Counselor Registrar Silliman University (Name of School) From: BRUCE NGUYEN (Name of Student) PLEASE PRINT Subject: ‘Transcript Request Please send an official transcript to: ‘Silliman University Office of tie Registrar 876 Nicanor Reyes Steet Cagayan de Oro, Misamis Oriental 9000 Student Information; Social Security Number: 22 449° Name While Enrolled: 88UCE NGUYEN Current Address: 548 82angay Malate City: Davao oy State: 0820 de! Sur_ Zip Code 8 00 Email Address, \"her sunmers outlook com Area Code and Phone Num! Der; 0918 726 3564 “If there is a fee, please bill or notify me at the above address or phone number. It is important that the transcript be sent as soon as possible. Thank you. BRUCE NGUYEN 1072672025 Date:"
    },
    {
        "image": "request2_synth_13_aug4.png",
        "label": "request",
        "ocr_text": "a ir Transcript Request Form BLUEFIELD COLLEGE To: Counselor Registrar Silliman University (Name of School) Brom: BRUCE NGUYEN (Name of Student) PLEASE PRINT Subject: Transcript Request Please send an official transcript to: Silliman University Office of the Registrar 876 Nicanor Reyes Street Cagayan de Oro, Misamis Oriental 9000 Student Informati ion: Social Security Number: 22543490 Name While Enrolled: BRUCE NGUYEN Current Address _546 Barangay Malate City; Davao city State: Davaodelsur Zin Coge 8000 Email Address \"than summers @outlook com Area Code and Phone Number: 918 726 3564 “If there is a fee, please bill or notify me at the above address or phone number. It is important that the transcript be sent as soon as possible. Thank you. 7 BRUCE NGUYEN 10 26 2025 Signature: Date:"
    },
    {
        "image": "request2_synth_13_aug5.png",
        "label": "request",
        "ocr_text": "b ft Transcript Request Form BLUEFIELD Pa ane To: Counselor Registrar Silliman University ame of School) From: BRUCE NGUYEN Wame of ‘Student) PLEASE PRINT Subject: ‘Transcript Request Please send an official transcript to: Silliman University ice of the Registrar £876 Nicanor Reyes Street Cagayan de 010, Misamis Oriental 9000 Social Security Number: jed _BRUCE NGUYEN 2015 43490 Name While Enroll Current Address: 546 Barangay Malate Davao City state: eeode su__Zip Code 20° nathan. summers @outlook com 0918 726 3564 City: Email Address. ‘area Code and Phone Number: «if there is a fee, please bill or notify me at the above address of phone number. Itis important that the transcript be sent as soon as possible. ‘Thank you. BRUCE NGUYEN 10 26 2025 Date: Signature:"
    },
    {
        "image": "request2_synth_14_aug1.png",
        "label": "request",
        "ocr_text": "From: na PRIN Subject: Please sene 0 de Mantia Uni Sgeinent Git Current Ac at the ahove address or phone number. it is important that the transcript be sent ys soan as possible, MICHAEL BUSH"
    },
    {
        "image": "request2_synth_14_aug2.png",
        "label": "request",
        "ocr_text": "i i | BLUEFIELD j Transcript Request Form To: ahor/ Registrar Aleneo de Maivla University Prom: ‘Transcript Request Please send an official traneeript to: Davao City, Daveo sei Sur BOSE Name While Earolle Carvent Address; 28\" 2 City: Quezon City Email Address cand Phone Nursber: there is a fee, please nas the that oe notify me at the above pi he sept as soon as possi ss or phone number. Kis le. Phaaik you. 2ORRORS"
    },
    {
        "image": "request2_synth_14_aug3.png",
        "label": "request",
        "ocr_text": "i ip Transeript Request Form BLU E PIE Lo To: Number Name While Unrofle Area Code and Phone “Ef there is a fo important please t the teas"
    },
    {
        "image": "request2_synth_14_aug4.png",
        "label": "request",
        "ocr_text": "; a Transcript Request Form BLUEFIELD Tor Prom: MICHAEL BUSH ‘sane of Student) PLEASE PRINT Subject: ‘Transcript Request Please send an jl transeript to: tenes de Malin Uniearsity nigement Ofc afla Boulevars “Tt there is a fe address ov phone important ber. His esible, Thank y a Dates"
    },
    {
        "image": "request2_synth_14_aug5.png",
        "label": "request",
        "ocr_text": "Transeript Request Form Fo: Counselor Registeay de Manila Unive ‘Pranscript Request Prease pritan allicial transcript to: eta Bowiesare Save City, Devan Sur AGO jogs Social See ty Number, 2020 6052 Name While Enrolled: MICHAEL 8 Current Address Area Code and Phone Nurs f there is 2 fee, please bi Hor a isspostant that the tran: address or phone mmbe: tis is. Thank you. Signature: 1ORS2625 smvronrnnennne OY"
    },
    {
        "image": "request2_synth_15_aug1.png",
        "label": "request",
        "ocr_text": "Fe Coun air ag Lungsod ha Ni CHRISTOPHER HARDIN (Name of Student) PLEASE, RINT fesse Student Lotor a} Security Number CHRGSTOPHER NAGY Area Code ar Date Signature"
    },
    {
        "image": "request2_synth_15_aug2.png",
        "label": "request",
        "ocr_text": "ir Tr, anscript Request Form BLUE FIEL 5 ne Te: SASH PRIN (Rane 2 OF Satay PI Sebjecr; ‘Transcript Request Please send an of ial transcript to: 7 Lamson ay Acinsomic es 238 Tattaver Suszon 6 rs Civ ato Manis +109 Security Nambe Name Whi Enrolled Current Address Svea Code and Phone Number: ©: “If there i boporian fee. please bili o nt that the trance oF notify ahove address ar phone mums bee. His Sble. Thank you, Signature:"
    },
    {
        "image": "request2_synth_15_aug3.png",
        "label": "request",
        "ocr_text": "fe Transcript Request Form BLUEFIELD COLLEGE To: Counselor Registrar P CHRISTOPHER HARDIN From: en ee (Name of Student) PLEASE PRINT Subject: Transcript Request Please send an official transcript to: Parwaitasan ng Lungsod ng Meyrita Acadients: Records Division 218 Tak Avenue ‘Guazon City, Metro Mania 1101 Student Information: Social Security Number Name While Enrolled: CHRSTOPHER HARDIN Current Address: 80° Sarargay 380 Iara Zip Code 20° Area Code and Phone Number: 99594 2432 “If there is a fee, please Dili or notify me at the above address or phone number. it is unportont that the transcript be sent as soon 4s possible. Thank you. CHRISTOPHER HARDIN Siguoture:"
    },
    {
        "image": "request2_synth_15_aug4.png",
        "label": "request",
        "ocr_text": "iv Transcript Request Form BLUEFIELD To. Counselor Registrar Pamantasan ng Lungsod ng Maynila (Name of School) From CHRISTOPHER HARDIN (Name of Student) PLEASE PRINT Subject Transcript Request Please send an official transcript to: a Student Information Social Security Number: Name While Enrolled Current Address: °° Barangay Sa City State, 24 a0 9° Zip Code Email Address Area Code and Phone Number *Ifthere isa important t please bill or notify me at the above addre e tran: phone number. Its nk vou. pt be sent ats soon as possible. Th HRISTOPHER HARDIN 82 Signature Date"
    },
    {
        "image": "request2_synth_15_aug5.png",
        "label": "request",
        "ocr_text": "j FF Transeript Request Form BLUEFY ELD nnn To: Counsclor/ Registrar Prom: _ Subject: Transcript Reonesp Pease send an oftieiet fanscript to: Panantae, \"9 bangsoct p Atadenic Records BB TRA Avery Ouszen 0 Student Infor ap a Social Seenriey iy tibor: PS 242, Name While Enrolled: Curent Address: 225 Aerangey 4re8 Code und Fhone Namber: jai there fe fee, please bah oF n6 Ferportant tas the tra, Fipt be he above x NE AS S800 ag pers Signet Swosons"
    },
    {
        "image": "request2_synth_16_aug1.png",
        "label": "request",
        "ocr_text": "Transcript Request Form BLUEFIELD COLLEGeE To: Counselor Registrar Polytechnic University of the Philippines (Name of School) From: DANIEL CONTRERAS MD (Name of Student) PLEASE PRINT Subject: Transcript Request Please send an official transcript to: Polytechnic University of the Philippines Student Records Office “~ 149 Padre Faura Street Bacolod City, Negros. Occidental 6100 Student Information: Social Security Number: 2015 10665 Name While Enrolled: OANIEL CONTRERAS MD Current Address: 432 8arangay Santa Cruz City; _Cebu city State; Cebu Zip Code_6900 Email Address_ lijoves yahoo com Area Code and Phone Number; _0927 575 3126 “If there is a fee, Please bill or notify me at the above address or phone number. It is important that the transcript be sent as soon as Possible. Thank you. EL CONTRERAS ID 10 13 2025 Signature; DAN M Date:"
    },
    {
        "image": "request2_synth_16_aug2.png",
        "label": "request",
        "ocr_text": "Transcript Request p orm EMail Addte sy (8 mes yar DAML cote Sincere ERAS wats"
    },
    {
        "image": "request2_synth_16_aug3.png",
        "label": "request",
        "ocr_text": "Transcript Request Form [) BLUEFIELD COLLEGE To: Counselor Registrar Polytechnic University of the Philippines (Name of School) DANIEL CONTRERAS MD (Name of Student) PLEASE PRINT Subject: ‘Transcript Request Please send an official transcript to: Polytechnic University ofthe Priippines 149 Padre Faura Steet Bacolod City, Negros Occidental 6100 Student Information: Social Security Number: 2°\" Name While Enrolled: DANIEL CONTRERAS MD 5 10665 Current Address: 432 Barangay Santa Cruz cons ny State: eb Zip Code 60° City: Email Address, °0in ones vahoo com mber; .0927 575 3126 Area Code and Phone Nu «if there isa fee, please bill or notify me at the above address or phone number. It is important that the transcript be sent as soon as possible. Thank you. DANIEL CONTRERAS MD _ tornai2025 Signature:"
    },
    {
        "image": "request2_synth_16_aug4.png",
        "label": "request",
        "ocr_text": "Transcript Request Form BLUEFIELD covcece To: Counselor Registrar Polytechnic University of the Philippines (Name of School) SS From: DANIEL CONTRERAS MD (Name of Student) PLEASE PRINT Subject: Transcript Request Please send an official transcript to: Polytechnic University of the Philippines Student Records Oftice 149 Padre Faura Steet Bacolod City, Negros Ocadental 6100 Student Information; Social Security Number: 20 S 19665 Name While Enrolled: OANIEL CONTRERAS MO. Current Address: 432 82rangay Santa Cruz Cebu city __ State: Cebu Zip Code 6200 Email Address °°\" /o7 yahoo com Area Code and Phone Number: 927 575 3126 “If there is a fee, please bill or notify me at the above address or phone number. It is important that the transcript be sent as soon as possible. Thank you. DANIEL CONTRERAS MD 10132025 Signature. Date:"
    },
    {
        "image": "request2_synth_16_aug5.png",
        "label": "request",
        "ocr_text": "Transeript Request Form BLUEFIELD coLiece To: Counselor Registrar Polytechnic University of the Philippines WameolSchoot) a From: _DANIEL CONTRERAS MO ‘of Student) PLEASE PRINT Subject: ‘Transcript Request Please send on official transcript to: Polytechnic University of the Philtepines Student Racoits OMce 149 Pacte Faura Steet Bacciod Ciy, Negros Occigental 6160 Social Security Number: 251008 ‘Area Corde und Phone Number: O827575 3126 een *if there is a fee, please bill or notify me at the above address or phone number, It is lanporzavt that the trunscripi be seat as soon as possible. Thank you. fon32025 ee ____ DANIEL CONTRERAS MD Signatare:,"
    },
    {
        "image": "request2_synth_17_aug1.png",
        "label": "request",
        "ocr_text": "fr Transcript Request Form BLUEFIELD COLLEGE To: Counselor Registrar University of the Philippines (Name of School) From: JONATHAN ZUNIGA SE PRINT (Name of Student) PLEA Subject: Transcript Request University of the Philippines Registrar’ Office _ 443 General Luna Street Makati City, Metro Manila 1200 Please send an official transcript to: Student Information Social Security Number: 2998153 rolled: JONATHAN ZUNIGA Name While Current Address _748 82 ngay Bagumbayan Taguig City State: Mette Manila Cc oa brian owen: Email Address _\"\"*\" 's gmall com ‘Area Code and Phone Number: 99294821024 “If there is a fee, please bill or notify me at the above address or phone number. It is important that the transcript be sent as soon as possible. Thank you. JONATHAN ZUNIGA, 101972025 Signature:"
    },
    {
        "image": "request2_synth_17_aug2.png",
        "label": "request",
        "ocr_text": "' Mt ri Studer: cs +A cin"
    },
    {
        "image": "request2_synth_17_aug3.png",
        "label": "request",
        "ocr_text": "Pranseript Request Porm"
    },
    {
        "image": "request2_synth_17_aug4.png",
        "label": "request",
        "ocr_text": "| fi Transcript Request Form BLUEFIELD cOLLES Counselor Registrat University of the Philippines (Name of School) From: JONATHAN ZUNIGA (Name of Student) PLEASE PRINT Subject: ‘Transcript Request University of the Philippines Registrars Office” 443 General Luna Street ‘Makat City, Metro Manila 1200 Please send an official transcript to: Student Information: Social Security Number: led:, JONATHAN ZUNIGA 2019 81536 Name While Enroll 746 Barangay Bagumbayan Current Address: Taguig City state: Metro Manila Zip Code 182° city: Email Address. brian owens gmail com 0929 482 1024 ‘Area Code and Phone Number: Ipove address or phone number. Ttis or notify me at the al possible. Thank you. “If there is a fee, please bill ye sent as Soon as important that the transeript b JONATHAN ZUNIGA, 10 19 2025 Date: Signature:"
    },
    {
        "image": "request2_synth_17_aug5.png",
        "label": "request",
        "ocr_text": "Subject ‘Transcript Request Please send an offinial Sranseript to: Phiippines Luna Steet Naive Manta 1209 cae bill or notify me at 2 transcrip be sent tess ar phone nusnber, tig Thank you."
    },
    {
        "image": "request2_synth_18_aug1.png",
        "label": "request",
        "ocr_text": "| p24 fr BLUEFIELD COLLEGE Transcript Request Form To: Counselor Registrar Silliman University (Name of School) From: ROBERT VILLANUEVA (Name of Student) PLEASE PRINT Subject: Transcript Request Please send an official transcript to: Silliman University Registrars Office 518 Padre Faura Street Manila, Metro Manila 1000 Student Information: Social Security Number: 201535999 Name While Enrolled: ROBERT VILLANUEVA Current Address _64 Barangay San Antonio City: Cagayan de Oro State: Misamis Onental__ Zin Code_2000 Email Address !2n ifer casey outlook com Area Code and Phone Number: _ 919 4883811 “If there is a fee, please bill or notify me at the above address or phone number. It is important that the transcript be sent as soon as possible. Thank you. F ROBERT VILLANUEVA 1021 2025 Signature:, Date:"
    },
    {
        "image": "request2_synth_18_aug2.png",
        "label": "request",
        "ocr_text": "it BLUEFIELD COLLAGE Transcript Request Form To: Counselor Kegistrar Silliman University from: Subject: Transcript Request Please send an official transcript to: Sitienan University Registrars Offco” ‘516 Padre Faura Sect Mania, Mette Manta 1000 Student Information: Social Security Number: 201525999 |, ROBERT VILLANUEVA Name While Enroll Current Addvess _ 2% Baraccay San Antonio “If theve is a fee, please bill or notify me at the above address or phone nvunber, It is important that the transeript be sent as soon as possible, Thank you 5 ROBERT VILLANUEVA 101212025 Signatures —. Dates"
    },
    {
        "image": "request2_synth_18_aug3.png",
        "label": "request",
        "ocr_text": "From: subject: ‘Tran Please send student Inform a Soci Area Code and eqpthere is a fee, plea important that the t Signature __— Transcr! an official transerl jennifer Phone Number: rans ipt Request Form Counselor/ Registrar Silliman University eof School) script Request Silliman University Registrars office 516 Padre Faura Steet Manila, Metro Manila 1000 pt to: 209895988 jal Security Number! s casey outlook com sor phone number. ank you se bill or notify pt be sent ROBERT VILLANUEVA 4072112025 __Date _ Itis"
    },
    {
        "image": "request2_synth_18_aug4.png",
        "label": "request",
        "ocr_text": "i a Trar oe eript Request Form Tar From: MILLANUEVA PR pi Request Please send an official transeript to: Stliewe Student Informuarion: Social Sew Aleess or phone mumber. 1 is ‘Thank you. se bil ov notify me x pi be genet as 5: 3912112025 Dates Signature:"
    },
    {
        "image": "request2_synth_18_aug5.png",
        "label": "request",
        "ocr_text": "| a Transcript Request Form BLUEFIELD COLLEGE To: Counselor Registrar Silliman University (Name of School) _— ROBERT VILLANUEVA (Name of Student) PLEASE PRINT Subject: ‘Transcript Request Please send an official transcript to: Silliman University Registrar s Office _ 518 Padre Faura Street ‘Manila, Metro Manila 1000 Student Information: Social Security Number: 20 52 ERT VILLANUEVA Name While Enrolled: eee 604 Barangay San Antonio Current Address:, Misamis Oriental ip Code 200 Cagayan de Oro State: jennifer casey outlook com cit Email Address. 0919 488 3811 ‘Area Code and Phone Number: «tf there is a fee, please bill or notify me at the above address or phone number. It is ‘as possible. Thank you. important that the transeript be sent as soon ROBERT VILLANUEVA 1012112025 Date: Signature:"
    },
    {
        "image": "request2_synth_19_aug1.png",
        "label": "request",
        "ocr_text": "iz Transcript Request Form BLUEFIELD COLLEGE Yo: Counsclor Registrar San Beda Ur (Name of Schooly From: RNBEREY HO (Name of Student) PLEASE PRINT Pease send en official ranseript to: San Sleda Uivarty Acagemic Retonts Ommeion 378 General Lina S ect Quezon City, Mako Mania 190 Social Security Number: 2755706 Name While Enrolled: KIMEERLY HO Area Code and Phone Namber: 22682 6829 “if there is fee, please bill or notify me at the ebove address or phone auunber, it is important that the transcript be sent as soon as possible, Thank you. Signature: ERY HO pate"
    },
    {
        "image": "request2_synth_19_aug2.png",
        "label": "request",
        "ocr_text": "| Transcript Reguest Form BLUEE rmuation Nember Sacral Securit While Envc city 2 Eanail KIMBERLY HO"
    },
    {
        "image": "request2_synth_19_aug3.png",
        "label": "request",
        "ocr_text": "i it Transcript Request Form BLUEFIELD nore From: Subsiect: Transeript Request Please send an official? transeript to: San Beds University Acatenic Recon 978 Canarat¢: Gunzon City a 1S Dinaiseote 9 Straat to Manila Area Code and Phone Number: 9% “Tf there is fee, please the above address o¢ phone s Heportant that the transer si os possible, Thank your, ember. It ig KIMBER ¢ Signatene, ea"
    },
    {
        "image": "request2_synth_19_aug4.png",
        "label": "request",
        "ocr_text": "Transcript Request Form Yo: Vrom: bject: bec Please send an official transeripi to: t phone number. It is ik yor. KIMBERLY HO 1019572025 Date:"
    },
    {
        "image": "request2_synth_19_aug5.png",
        "label": "request",
        "ocr_text": "| a fr BLUEFIELD EGE cout Transcript Request Form Counselor/ Registrar To: san Beda University ame of School) KIMBERLY HO From: ee —— (Name of Student) PL Subject: ‘Transcript Request Please send an official transcript to: ‘San Beda University Academic Records Division 379 General Luna Steet ‘Quezon City, Metro Manila 1101 Student Information: Social Security Number: 2015 60308 KIMBERLY HO Name While Enrolled: 216 Barangay Santa Cruz 6100 Current Addres Bacolod Cty state: Neatos oeserts _ Zip Code. _ City Email Address eras. smine eostonk com (0929 682 6829 ‘Area Code and Phone Number: or phone number. It is thank you. ill or notify me at the above addi as soon as possibl “if there is a fee, please important that the transeript be sent KIMBERLY HO 4015 2025 _____ Date __ Signature: ___— —"
    },
    {
        "image": "request2_synth_20_aug1.png",
        "label": "request",
        "ocr_text": "7 Transcript Request Form BLUEFIELD covirece Te: Counselor/ Registrar Bicot Univarsity (ame ofScaaudy Peet SARAH HAYES Subject: Transcript Request Please send an official transeript to: Bled University Registrar Otice 298? Paredes Sveet Frasig Cry, Meo Manda 1609 Studest Information: Social Security Number; 20 520%% _ Name While Earolted: SAROH RAVES Current Address: City: So Email Address“ son ripest Area Code and Phone Number; 7898098309 “If there is fee, please bill or notify me at the above address or phone number, ft is important that the transcript be sent as soon as possibie. Thank you. SARAH HAYES 1OINQIIS Dat"
    },
    {
        "image": "request2_synth_20_aug2.png",
        "label": "request",
        "ocr_text": "pi fr Transcript Request Form BLUEFIELD To: Counselor Registrar Bicol University (Name of School) From: SARAH HAYES (Name of, Student) PLEASE PRINT Subject: Transcript Request Please send an official transcript to: Bicol University Registrars Office” 298 P. Paredes Street Pasig City, Metro Manila 1600 Student Info Social Security Number: 2018 52016 Name While Enrolled _SARAH HAYES Current Address: 351 Barangay San sidro City; Cebu City State: Cebu Zip Code_6000 Email Address_4sheppard yahoo com Area Code and Phone Number: 919 905 5389 “If there is a fee, Please bill or notify me at the above address or phone number. It is important that the transcript be sent as soon as possil L. ble. Thank you. ‘SARAH HAYES 1030 2025 Signature: Date:"
    },
    {
        "image": "request2_synth_20_aug3.png",
        "label": "request",
        "ocr_text": "fr Transcript Request Form BLUEFIELD COLLEGE To: Counselor Registrar Bicol University (Name of School) From: SARAH HAYES (Name of Student) PLEASE PRINT Subject: ‘Transcript Request Please send an official transcript to: Bicol University Registrars tice’ =~ 298 P. Paredes Street Pasig City, Metro Manila 1600 Student Information: Social Security Number: 201852016 Name While Enrolled _SARAH HAYES Current Address; 351 82rangay San isidro ity ceUcy) State: Cebu Zip Code_6000 Email Address 2sheppard yahoo com Area Code and Phone Number; 919 905 5389 “If there is a fee, please bill or notify me at the above address or phone number. It is important that the transcript be sent as soon as possible. Thank you. SARAH HAYES 10 30 2025 Signature: Date:"
    },
    {
        "image": "request2_synth_20_aug4.png",
        "label": "request",
        "ocr_text": "A i a Transcript Request Form BLUEFIELD eceeeeee eee cet to Counselor /Regtetrex SARAH HAYES From. 1) PLEASE PRINT (Nate of acvipt Request seript te Social Security Number se While Enrultedt: SAPANATES SS) Barangay San ‘G9 Address. aaietieos 208 PO Ayatwo Lom Code and Pre"
    },
    {
        "image": "request2_synth_20_aug5.png",
        "label": "request",
        "ocr_text": "Transcript Request Form or phone number. i is ik y mie at the ab nie aS pO) SARAH HAVE"
    }
]