[
    {
        "image": "research1_synth_10_aug1.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines (CAGAYAN DE ORO POLYTECHNIC UNIVERSITY Heather Howard, PhO, Coordinator Extension Services Coordinator, Colege of Agriculture Approved by cc: Prof. Teresa Baker Dean Facuty Member, Cotege of Agrcuture"
    },
    {
        "image": "research1_synth_10_aug2.png",
        "label": "researchagenda",
        "ocr_text": "Cosege of Agsiout eee a oe ec mrecmencaer acer FACULTY RESEARCH GRA\\ oct br Kes Daan, Colege of Agicutune Dear SeiMedarn. Good da jam submiting this tetior in support of Ds i project itled \"Deveionmentof Low Gost Water Fiimaton System tor Rural Communities \"1 earl 2 criicel need for acressibie cean water sot earch methedelogy is nt communities. Expected osteornes inch ily sour, employing both taborat de 5 funchonal nrotatype, Ycnnieal dackroentation, andl communtiy mors: verables ation ane commit ori projectinplementation Hoathor He natin Servings ier, College of Aiea Anpeaved by ce Poi Terese Boker Dew Facutty Meinbe"
    },
    {
        "image": "research1_synth_10_aug3.png",
        "label": "researchagenda",
        "ocr_text": "cRGRVAN DE ono FOL nemesis FACULTY RESEARCH fae, Kennet Morale euppontof De. Mana Sankes mot Lowsast glean Wak sates Fitton sonsh cronbfically sound, er\"?! chen ‘The rosea _oannnuniios, Expented out ies Tee priest eather towacs, OO. Coordinator artmatts, Cailege ANE 1 Resor, eee of Agee Ne Cunt: uHVER ITY RANT APPLICAY joviny oath 188 1ON oratory testing ana Set sellvars nur goiiage s hal sue a via cnaintation and £9 88 port for sucuesstat"
    },
    {
        "image": "research1_synth_10_aug4.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines (CAGAYAN DE ORO POLYTECHNIC UNIVERSITY Excelence m Edueaton Cagayan 6 Oro, Misamis Onenta Colege of Agrcuture rot sgrevture Qeapeyen 944 9m Tot (+43) 008 524 8700 FACULTY RESEARCH GRANT APPLICATION ‘October 30, 2025 Or. Kenneth Moraes Dean, Colege of Agreuture Dear Semtadam: Good day! {1am submitting this letter in support of Dr. Maria Santos’ application for intemal research grant funding for her Project ted “Development of Low Cost Water Filtration System for Rural Communities.” This research addresses critcal need for accessible clean water solutions in underserved areas. ‘The research methodology is scientifically sound, employing both laboratory testing and field bials in partner ‘communities. Expected outcomes include a functonal prototype, technical documentation, and community ‘Yaining modules. The project timeline spans 18 months with clear milestones and deliverables. \\We strongly recommend approval of this grant application and commit our college s full support for successful project implementaton. Heather Howard, Ph D. Coordinator Extension Services Coordinator, Colege of Agrcuture Approved by ce: Prof. Teresa Baker Faculty Member, Cotege of Agricuture"
    },
    {
        "image": "research1_synth_10_aug5.png",
        "label": "researchagenda",
        "ocr_text": "LYTECHNIG Un iueatun Ceara Or, Wears Goarst Cote Eos ‘cnet ney Ocinter 30, 2025 Oy Keine Morsies Poth Deer Seiagam: God dig {am submiting ins etse in supper Dei aria rolect hed “Ds ‘Bavelopment of Laew Cost Water *# (ribcal need tor accesstiie clown waler om 0S\" appiicstion for inemat PeacN Grant funding tor her ton Systarn tor Rursl Communities \"The ra ved areas Search addresga ‘The research metiadalogy is ac conimunities. Expaciea oy taining modales. Te Stuind, emmpisyiog Dot tude 8 tunctono: laboratory testing a tide Spans 1 igi fechmcat 8 With char i field brats in parm Hecuinentiton, and commansty nillestonas anc seliverciies Project in 2 iongiy reccmemang aupFoval ofthis grantg BrO 2e mplemertation on and coramnit our coitege s sunpert ier weceasf Houthes Howare, Pip, Svitiekn Services Geordie, Cotege ut Aerie Facsity Mem nb, Colege of Agnestury"
    },
    {
        "image": "research1_synth_1_aug1.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines DUMAGUETE POLYTECHNIC UNIVERSITY Commitment to Excellence Dumaguete, Negros Onental College of Nursing and Allied Heath Emali nursingandaliedhealth @dumaguete edu ph Tat (+83) 930 200 0355, eo Te os ooo 8h RESEARCH EXTENSION AGENDA PROPOSAL, September 13, 2025 Dr. Daniel Garcia Dean, Colege of Nursing and Alied Health Dear SiMadam; Good day! am writing to formally submit our proposed Research and Extension Agenda for Academic Year 2024 2025. This comprehensive plan outlines our college s strategic priorities in advancing knowledge creation and community engagement aligned with the university s mission and national development goals, Our research agenda focuses on four key thematic areas: sustainable development and climate change adaptation, digital transformation and emerging technologies, community health and wellness, and inclusive education and social equity. These priority areas were identified through extensive consultation with faculty members, industry partners, and community stakeholders, We respecttully request your approval of this research and extension agenda. Our faculty members are committed to implementing these programs with excellence and accountability. Donna Garner, Ph D. Coordinator Extension Services Coordinator, Colege of Nursing and Allied Heath Approved by cc: Prof. Christine Fernandez Dean Faculty Member, Colege of Nursing and Alied Health"
    },
    {
        "image": "research1_synth_1_aug2.png",
        "label": "researchagenda",
        "ocr_text": "Conmmment 19 Envatance Dumaguete, Negrer Siena! Golege of remy sr Aes Hewe Erk cursingandatidnanth e rnguets sia gh Tot 146) 626 360 9299, ‘enmencen tamenatns ane scamanns tt aih enguets oS gh Tel 140 28 Ri SSEARCH EXTEN Seatember $3, 2625, Or, Garie! Gare Bean, Colege ot Nursing anc sed Hs Dear Seisisaien ek day? tara wetingy to forma comprehensive p engenement allg shy subendt our props outings aur ed with the univ ‘ear 2924 2028. This creation and community on Agenda for Acadeny 90 s strategic prianties in acvancing kowledg: mission anid national ‘cur key vematic areas: susiginadie development and sllinate change aciaptation, digital transformation and emerging technologies, comeusnity Health and wellness, wad incisive education and sccial eqn. These priory araas were iGenitied ‘hough extensive crawuitation with facully srembers, industy pariness, and community stakeholders, W ly Faequss! your soproval of his research and extension agent 6 implementing these programs with exowi punta, ty members are commitied u Garner, PD, Coordissater Extunsinn Serves Goceeinster, Cotege of Nursiig and Aee Heath Apesmeed ky Poof Christine Femnangaz Bean Facuty Monger, abo: cf Nnsing ane Alia Mesity"
    },
    {
        "image": "research1_synth_1_aug3.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines DUMAGUETE POLYTECHNIC UNIVERSITY j Commatment to Excellence Dumaguete, Negros Oriental College of Nursing and Alied Health Emal: nursingandaliedheatth dumaguete eduph Te: (+63) 036 300 0355 RESEARCH EXTENSION AGENDA PROPOSAL, ‘September 13, 2025 Dr. Daniel Garcia Dean, Colege of Nursing and Alled Heath Dear Sir Madam: Good day! am writing to formally submit our proposed Research and Extension Agenda for Academic Year 2024 2025. This comprehensive plan outlines our college s strategic priorities in advancing knowledge creation and community engagement aligned with the university s mission and national development goals. ‘Our research agenda focuses on four key thematic areas: sustainable development and climate change adaptation, digital transformation and emerging technologies, community health and wellness, and inclusive education and social equity. These priority areas were identifed through extensive consultation with faculty members, industry partners, and community stakeholders. We respectiully request your approval of this research and extension agenda. Our faculty members are committed to implementing these programs with excellence and accountability. Donna Garner, Ph D. Coordinator Extension Services Coordinator, Colege of Nursing and Alled Heath Approved by. cc: Prof. Christine Fernandez Dean Faculty Member, College of Nursing and Alled Health"
    },
    {
        "image": "research1_synth_1_aug4.png",
        "label": "researchagenda",
        "ocr_text": "Joublic of the Plulipoines: DUMAGUETE POLYTECHNIC UNIVERSITY Commaiment 19 Excebence Dumaguete, Negros Onenta College ot Nursing and Aled Heath Vadumaguete edu on Teh (103) 036 300 0355 mak: nuts RESEARCH EXTENSION AGENDA PROPOSAL ‘September 13, 2025 Dr. Daniel Garca Dean, Colege of Nursing and Altes Health Dear Si Madam Good day! Jenda for Academic Year 2024 2025. This ssearch and Extension Agi ic priorities in advancin nd national development goals {am wnting to formally submit our proposed Re: ‘comprehensive plan outines our college s stated engagement aligned witn the university s mission af Our research agenda focu! 19 knowledge creation and community inable development and climate change mmunity health and wellness, and inclusive nsive consultation with faculty ses on four key thematic areas. sustai ‘adaptation, digital transformation and emerging technologies, education and social equity These priony areas were identied through exter syembers, industry partners, and community stakenolders. proval of his research and extension agenda, Our faculty members ate committed We respectfully request your api it excellence and accountability to implementing these programs wit Donna Garner, PhO. Coordinator Extension Services Coordinator, Colege of Nursing and Abed Heath Approved by ce: Prot Christine Fernandez Dean Facuty Member, Colege of Nursing anc Abed Health"
    },
    {
        "image": "research1_synth_1_aug5.png",
        "label": "researchagenda",
        "ocr_text": "Republic o€ the Phittwoines DUMAGUETE POLYTECHNIC UNIVERSITY Conmemans te Ercetenes Dumapueie Teges Stein Cotege oF Nursing and Aled Host Ent, nurin gacasbeanentny Gap Yet (903) £98 500 6385, RESEARCH EXTENSION AGENDA PROPOSAL September 12, 2025 Or, Darel Sac ‘Sean, Cotage of Nheuing anu Aled Heat Dear Srniadrs Good days 1 2m wnting to format subiét Our proposad Research and Extension Agena fo: Acawamic Year 2024 2026. This compransns ve pian oubines our college’ stratng’: pnoitties in advancing knowledge creason and consmunity engagemwnt signed sith tie universin s mussion and nabional developmen goats (Our research agenda focuses on four Fay themade areas: sustxinabie development anc climate change aHaplation, digital kenstormation and emerging technokagies, community health and woliness, and inciusiva ‘educadon an social equity. These pitonty areas wore idenviied trough extensive consuttaton with faculty members, Industry Oariners, ang commutaty stokehokders \\Yéw resceacthity request your approva! of this ressaicn and eytension agenda Our tscuily momhers are commited {9 implementing these prograris with exceitence and wcoountabiny. Dorma Geese, Pm D. Coardinator Exteneun Services Coordiator, Colags of Nursing ot Atles Hearth Approved by. Ce: Prot. Cnestne Fernanda Dean Frecuty Meniver, Colege ef Nussing and fii Hemth"
    },
    {
        "image": "research1_synth_2_aug1.png",
        "label": "researchagenda",
        "ocr_text": "TACLOBAN ST ros yee) 200 836. ESEARCOH CONFERENCE PARTICIPATION REQUEST br Coe grancial suppor tort urabona! inngvation te De ts and Prif Marice! Santos have bee ne, and Asse acceptac to pra t strategies ota expanses amount ants, We funas and rescecttaty 2 valance request univereiy st royal and svaport Ths investment far We samestly apozal for ys Isturns ough ennanced research capabsites a instiotonal veptitation es \\e0, PhD Sagrinator Associate Denn fer Research and Extorsion Approved by Brot Brag Tromepsen tember, Graduate Sobect"
    },
    {
        "image": "research1_synth_2_aug2.png",
        "label": "researchagenda",
        "ocr_text": "ben. Leyte atuste Sat PARTE Ostoter 30, 2075 ole Duna raduate Scnact ear SuiMadan serithig to fequeSi approval and francis! supped fo three fark emational Cor Hy members io present esearch paners at the held ws Sing March 15 18, 20: on wil provide apo Won, and sees for tae particwnanes We have nants in o 288 000 p quest university subsidy for te bajanes, ‘ity 3 pesas trams collage fw cures 190 00 We mnastly appeal for your approval ard suaze returns tirauge ‘This invesimentin [aculy develo situtional weputst Pasi, Brad Theeapson ty Mounier, Graduate Schad!"
    },
    {
        "image": "research1_synth_2_aug3.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines TACLOBAN STATE UNIVERS! ITY ‘Buiding Tomorows Leaders Tacoban, Leyte Graduate School senootG tacoben edu gh Tt C03) 8005 ERENCE PARTICIPATI mak: graduate RESEARCH CONF! |ON REQUEST October 30, 2025 Dr. Cole Dunn Dean, Graduate Schoo! Dear Sir Madam: present research papers atthe ‘March 15 18, 2025. Dr. present their research on Good day! Lam writing to request appr International Conference o! ‘Josephine Cruz, Prot. Antonio Reyes, and innovative teaching methodologies: digital learning platforms, and searchers, lear about cuting 69° Conference participation will Provide opportunites i engage with leading fy Gevelopments in education, and ennanes the universitysinternatonal silly ‘Total expenses amountto lege funds and respectully Sas 000 pesos for three participants ‘We have secured 100 000 pesos FOM CO request university subsidy for he balance. We eamestty appeal for ‘yout approval and SU feturs through enhanced research ccapabiliie! for three faculty members 10 ‘to be held in Singapore from intos have been accepted 10 sssessment strategies. oval and financial SUPPO! wn Educational Innovation Prot. Maricel Sat jpport Tis investment in faculty evelopment yields significant 's and institutional reputation. Jessica Lee, PhO. Coordinator pesociate Dean for Research and Extension Approved bY «cc: Prof. Brad Thompson Dean Facuty Member, Graduate School"
    },
    {
        "image": "research1_synth_2_aug4.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines TACLOBAN STATE UNIVERSITY ‘Bubding Tomorow s Leaders Tacioban. Leyte Graduate Schoo! mat. gradusteschool acicban edu ph Tet (+83) 200 535 7778 RESEARCH CONFERENCE PARTICIPATION REQUEST October 30, 2025 Dr. Cole Dunn Dean, Graduate Schoo! Dear Sir Madam: Good day! Lam writing to request approval and fin International Conference on Education ‘Josephine Cru, Prof Antonio Reyes, and Prot. Maricel Santos have innovative teaching methodologies, digital learning plaorms, ‘and assess rovide opportunities to engage with lea evelopment in education, and enhance the universitys interational 325 000 pesos fr three participants. We have secured 400 000 pesos from request university subsidy for the balance We earnestly appeal for your approval and support. Tis investmentin faculty development yields signi returns through enhanced research capabilities and institutional reputation. ancial support or three faculty members fo present research papers atthe at innovation tobe held in Singapore from March 15 18. 2025. Dr. been accepted to present their research on ment strategies. ding researchers, lear about cutting edge 1 visibility. Total expenses amount 10 Conference participation will ‘college funds and respectfully ificant Jessica Lee, PhD. Coordinator ‘Associate Dean for Research and Extension Approved by: ‘ce: Prof. Brad Thompson Dean Faculty Member, Graduate Schoo!"
    },
    {
        "image": "research1_synth_2_aug5.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines TACLOBAN STATE UNIVERSITY Buikding Tomorows Leaders Tacioban, Leyte Graduate School (483) 900 424 719 RESEARCH CONFERENCE PARTICIPATION REQUEST October 30, 2025 Dr. Cole Dunn Dean, Graduate School Dear Sir Madam: Good day! lam writing to request approval and financial support for three faculty members to present research papers at the International Conference on Educational Innovation to be held in Singapore from March 15 18, 2025. Dr. Josephine Cruz, Prof. Antonio Reyes, and Prof. Maricel Santos have been accepted to present their research on innovative teaching methodologies, digital learning platforms, and assessment strategies. Conference participation will provide opportunities to engage with leading researchers, leam about cutting edge developments in education, and enhance the university s international visibility. Total expenses amount fo 285 000 pesos for three pariicipants. We have secured 100 000 pesos from college funds and respectiully request university subsidy for the balance. We earnestly appeal for your approval and support. This investment in faculty development yields significant returns through enhanced research capabilities and institutional reputation. Jessica Lee, PhD. Coordinator ‘Associate Dean for Research and Extension Approved by: _ cc: Prof. Brad Thompson Dean Faculy Member, Graduate School"
    },
    {
        "image": "research1_synth_3_aug1.png",
        "label": "researchagenda",
        "ocr_text": "POLVTEC Mani, Me comege uf esueaton noe nveacensinania ode ah Tel (e630 236285 M20} GRANT APPLICATION FACULTY RES pode 22 2028 Fann, Cotnge of Eewaton Deo: Sxithaden God bey ta proce a ‘Tne rasearen methoor ve for intomnal researen grant tunding seg.\" This research acidresses: supportof Br Mana Santos! applies Jeveiopitent o! Low Cost Water Bitadon System tor Rural Commun ser colufions in underserved ar085 ns calrniting this bts i enthcai ae sty sound! eaipioying bad laboratory lesbing ard fela thaig is partner “anes inciade 2 funcional provlype, technical documentation, and conmmnunity fe spana 1S months witn clear milestones and detiverat remunbes, Expected out erodules, The eraject sme! ssrongly recomimend anproval of nis grant appitcation and commit ns covlege s Rel sunpert for succes project unpiementation donegn ttarns, PME Jere Conciente, Colage of Educa Facuily Member, C of Beucaton"
    },
    {
        "image": "research1_synth_3_aug2.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines MANILA POLYTECHNIC UNIVERSITY. Knowedge for Development Mania, Metro Manila College of Education RTS scucston Brant ecu ph Tet (83) 001 890 24809 FACULTY RESEARCH GRANT APPLICATION, October 22, 2025 Dr. Todd Wittams, Dean, Colege of Education Dear Si Madam: Good day! Joseph Witams, Pho. Coordinator Extension Services Coordinator, Colege of Edveation Approved by cc: Prof. Tammy Jones Dean Facuity Member, Colege of Education"
    },
    {
        "image": "research1_synth_3_aug3.png",
        "label": "researchagenda",
        "ocr_text": "MANILA POLYTECHMC U aim subinting this ieter in suppor of application for inkeinat research grant funding for her ont af Low Cost fem for Rural Gosimumities Mhig -esenrch, addiesses aciitical need for accessible clean w ioiogy 18 scient -xpectact 0 onal peainnyge, vewmeniat span ponte with clear wilestones anc! gly recommend aperovat of fais grant application and commit qur cailege s Mul sungott for successful loplecnentat Joseph itiams, Ph 5 Apes:"
    },
    {
        "image": "research1_synth_3_aug4.png",
        "label": "researchagenda",
        "ocr_text": "MANILA POY TECHNIC UNIVERSITY Konncge for Oe weloperent Cobage of Eaweaten 2 agveatanBregece tie 6) 78 88 ARCH GRANT APPLICATION Gr, Foe ieee rar Serban Goad dvi ap euloeratiing this fetter ih support ot Dr. Haaria Sante project aplication for intemal resaarah grant fenuing for her nunuiitien.” Thi “Daveicgment of Low Cost Watar Fitvation System Ine Rurat pentical nead for accessing clear winr solutions in underserved areas, The resare comewnties Expected outcomes inchuae a functions trabning mot We siongir and eid iain in gorines on, as comers mnatheseiogy is soiandifestly sound, emmpioying bal iaboratory test shotypn, tech ccttimeline spans 12 months vith clear siesta and detbreratis, 8, The pe .9 3 full suppeet ie surcescful J this grant agstication ana commit our recommend abate mnplermantation ‘dosegh Wiiam, PRD. Ebtention Services Cuczsinatac, Cateye of Buvrations popreved b se Pr Dew Fecuity Member, Comge of “racy sore"
    },
    {
        "image": "research1_synth_3_aug5.png",
        "label": "researchagenda",
        "ocr_text": "the Phitinse NEC UNIV bemmemert 1AM Subralting this tettr in supp Project tited Tevelonmenta? Low a orion! need for access ‘Bante’ application fer. Fulatian intone res ste for Rural Commu “DONS in unwerserved areas, moh grant tending tor tes “This reseat Cost Wal In water ‘The research mainodsiogy is ‘communities. Expact nod ntiicatly Sours, employ baratory testing and Ad outcomes inclu 2 ty es. The project: fold Bais in parmar mmaling spans 12 mons ten, and community Talestonas aie detveraptes, {his Grant application and cormit vine wh ces Hy recommend ape) Praject ieplementation, 4 soltege s tu ipa toe successful SeRepie Wham, Pro. Courdinacar Extenien ices Coordinator. Codege of Extucaton, Annroved by or Prof, Tony Jones 'y Member, Colegs ef Féxreton"
    },
    {
        "image": "research1_synth_4_aug1.png",
        "label": "researchagenda",
        "ocr_text": "ve Pheliopine HOHLO CITY ‘Gowntorent to Brent Botage of agiiutere Ena, egiuteregunarsey adu ph Te (009) 9 8 202 174 RESEARCH CONFERENCE PARTICIPATION REQU October 17, 2028 Dr Jagan Themigson, Goad day: research vapers att si approval and Snancial support for three faculty members t2 preset og an Educational innovation te be halt in Singapore hom March 15 48 2928, Dr ayes, aid Sect, Mace aigitst learning plato sam writing tore International ©: Josephine Ong, Prof ontario novalive ioactina methodetegl and asseesrrent slrategies ng r am about 3 vinibity. Tats! expenses amount to fond opportunities to engage wih leat ‘ennance the university s internation Ws have secured 109 000 pesos f mi caliege fads and respecttuby seks eigricant Member, Cateye ot ageiowture"
    },
    {
        "image": "research1_synth_4_aug2.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines UNIVERSITY OF ILOILO CITY ‘Commitment to Excellence loo Cty, oto RESEARCH CONFERENCE PARTICIPATION REQUEST Cctober 17 2025 Dr. Jason Thompson Dean, College of Agriculture Dear Sit Madam: Good day! 11am writing to request approval and financial support for three facully members to present research papers at he international Conference on Educational Innovation to be held in Singapore from March 15 18, 2025. Dr. ‘Josephine Cruz, Prot. Antonio Reyes, and Prof. Maricel Santos have been accepted to present heir research on innovative teaching methodologies, digital learning platforms, and assessment strategies. Conference participation will provide opportunities io engage with leading researchers, learn about cutting edge developments in education, and enhance the university international vsibiliy. Total expenses amount to 285 000 pesos for three participants. We have secured 100 000 pesos from college funds and respectfully request university subsidy for the balance. We earmestly appeal fr your approval and suppor. This investmentin faculty development yields significant returns through enhanced research capabilites and insttutional reputation Randal Smith, Ph D. Coordinator Dean, College of Agriculture Approved by: _ ‘cc: Prof. Amber Wiliams Dean Facully Member, Colege of Agricuture"
    },
    {
        "image": "research1_synth_4_aug3.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Pealmpanes UNIVERSITY GF ILOILO CITY ‘Commare cis Essabenee Enen sprees SOUT £.2424706 1ON REQUEST RESEARCH CONFERENCE PARTICIPAT Octoer 17 2025 fe Jason Thompson Dear, Cotnge of Rant nar Senter. Goad dart ee panne str graven ea TALENT vmemnatonat Contence on Eauraronai nncveson B B8 raid in Singapore trom niarch 1 78, 2025 Dr vepnine Chua. Pat. Artonie Reeves. ano Prot Manel Santos nave bean accepted 1 present EEE eSEATT? OF senats taacleng matroscionnes, oa stag Pagar and assessment seategies ‘contorence pavepation wit prenae oppertawes fe O78 seen vaasing rasesrchin. foam about owning edye evevopmants 0 @ducabon, a enenicn 1 UN AAFSAY puncnatonal wstbiniy Total exbersas amnouct 19 205 000 peace tor Bree pacbeinants. We have arene 190 000 pews fom eotage tance ana respect request university suosidy tor Phe Lo ance, We eamesty 2060 for your approval an6 sunpoT _Tnig uvgosment in faculty deveropment yinds sonar Feume trough enhanced research capansmes srt sstuional reputation, anea Soon, PO Coadinaior Dean, Cotece of Arras Aparoved by co: Prot auronr Wears Dean Pacuty Shemcet, Cateye of Agricite"
    },
    {
        "image": "research1_synth_4_aug4.png",
        "label": "researchagenda",
        "ocr_text": "Revublic of the Mulevtery UNIVERSITY CF 1LON O CITY Conarments Besetenn ede Cry, Font RESEARCH CORFERENCE PARTICIPATION REQUEST Oember 17, 2025 r, Sasen Tharrpaon Dean, Cotege of Agressture (eae SecMaci Good dy! ‘am waiting to requost sporove! and financial suppor tu: thraa tacully members to presen research papers ste inlesnabonal Conlarencs on Educational novation ty be held In Siigapore from March 15 19, 2025. De. Uovephine Cruz. Prof. Antonis Reyes, and Prof, Maricet Santos have boen noceperd f2 present reir research OF innovate teaching methodologies, digital leaming plattormns, acd assessriens sieategies, Conference parkcipaton wil provide opportunites to engage wih leading researcners, learn about cultng edye Gevaloprnents io educadon, and enhonce he university’ intecnavonal visibly, Total expenses amwnt 285 000 pesos for twee partcinants. We have secured 109 000 pevas tom cofege funds ang respacsuity request university subsidy for Bre balance, \\We eamesty eppual for your eppreval 8x8 cupnort. This investment in taouty Gevelopment yiekts signi Scan: returns Bwcugh ennanced nesearch cnoatitites and instiutcnal reputation andet Stn, PRO. Coordsneter Dean, Cofege of Agreuinre Apsrownd by ce: Pd, rte Wars Dra Faccaty Member. Colage of Agric"
    },
    {
        "image": "research1_synth_4_aug5.png",
        "label": "researchagenda",
        "ocr_text": "ewablio s ths Pathsmaes UNIVERSITY OF SLOG Cer Commun w Excetonen: Bale Sey, Soslage oF Agric Epes eprewturedeinanraty edu ght “encenarnceneremennr arate snail sf Lise RESEARCH CONFER 2024245 srearmenencotnnteneenieanen CE PARTICIPATION RECUEST Sema 17, 2305 &. basen Phampece: Bean, Catnge uf Agrieutire oe dat Lats ling fe eequest approvat and tinancke! support or Aw Sacuity meres te ‘norootionat Conference chi Eeucatonal innouatieg in be hats in wosephine Cruz, Put Antanis Raves, ans Fr joa bresentrosearch papers at th Singapore tom March 48 19, 2626 Dr Maries! Senos nave Deen actosted to present their eesatch an ee teaching mabknioiogies, digital isaming atatiarmn, anc assessment stategios Ranterenice nattpalion weit wvide oppomunites angen wih leading ree Sevalupments in pésation, and snance the university inemations vies 285 000 poss fr three particisants. We have secured 108 00 pesos Fedues! university subsigy for Ine stance OPS, fearN atau cutingedign fai expenses aroun be from colege unde ang respect Wa eamenty appeat tir your anqrava return sheng e nd oupivert, us snvestmaznt hanced research canablities and instintiona! focally dovetcement yinlus significant reputakion Pansat Gr, Pa Coazdenater Gear, Damage of Agrisutie Aparreed by Bo Pak. Amt Witatnn Dent Faculty Mlemioa, Colinge of bgricutate"
    },
    {
        "image": "research1_synth_5_aug1.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines BENGUET STATE UNIVERSITY Buiding Tomonow s Leaders Baguio, Benguet College of Ars and Sciences ndsciences ben; ph Te RESEARCH ETHICS CLEARANCE REQUEST October 16, 2025 Dr. Wala Hendrie Dean, College of Arts and Sciences Dear SiMadam: Good day! conducting human subject research, We have five ongoing projects re ‘with data collection activities scheduled this semester, ‘consent forms, paricipant information sheets, and data management plans Alicia Crane, Ph D. Coordinator Dean, College of Arts and Sciences Approved by. Cc: Prof. James Gonzalez Dean Facuty Member, Colege of Arts and Sciences"
    },
    {
        "image": "research1_synth_5_aug2.png",
        "label": "researchagenda",
        "ocr_text": "Reaubitc of the Phitioumes GENGUET STATE UNIVERSITY Hating Yororeis Lexoon Regus, Senger Ceboye of Ast 268 Sctences Sao amemuteecceageenguet sou nes (003 2208169705 RES ARCH ETHICS CLEARANC! REQUEST Avaroved ty Sc: Prot. James Gonzasee, Dems FACaty Meme, Colege of ans te Sconce"
    },
    {
        "image": "research1_synth_5_aug3.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philipounes BENGUET STATE ‘Boning Tomomows Leaders Baque. Bergvet Cotege of Arts ant ‘Serences ot rags om Tet (003) 8308183708 RESEARCH ETHICS CLEARANCE REQUEST October 16, 2025 (Or Waar Henare Dean, Cotege of Ats and Sciences"
    },
    {
        "image": "research1_synth_5_aug4.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines BENGUET STATE UNIVERSITY utsng Tomomow s Leaders Cotege of Arts and Sciences Emat ersenaromncengvenguet edu ph Tet (63) 020 418 708 RESEARCH ETHICS CLEARANCE REQUEST October 16, 2025 Or. War Hendra Dean, Cotege of Avis and Sciences Dear Seneca: Good day! {lam writing to request expedited review and approval of research ethics clearance for our faculty members conducting human subject research. We have five ongoing projects requiring ethics commitiee review to proceed with data collecton activites scheduled this semester. All research protocols have been carefully designed to ensure informed consent, confidentiality, privacy rotecton, and voluntary partcipaton in compliance with natonal and internatonal efhical standards. The researchers have completed ethics training and prepared comprehensive documentaton including informed consent forms, partcipant information sheets, and data management plans We respectlully request print consideration of these applications and assure full cooperation with the ethics committee s requirements. We commit to conducting these studies with utmost integrity and responsibilty. ‘Aicia Crane, PRD Coordinator Dean, Cotege of Avis and Sciences Approved by ce Prot James Gonzatez Dean Facuty Member, Colege of Arts and Sciences"
    },
    {
        "image": "research1_synth_5_aug5.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Plilmoines BENGUET STATE UNIVERSITY Buking Tomoraws Leaders Bague. Benguet Colege of Arts and Sciences Te: (+03 9308. mas ansandsconces oengvet edu on RESEARCH ETHICS CLEARANCE REQUEST October 16, 2025 Dr Witarn Hendrix Dean, Colege of Arts and Sciences Dear SiiMadam: Good day! ance for our faculty members 1 am waiting o request expedited review and approval of research ethics lear ethics committee review to proceed condyctng human subject esearch. We have five ongoing projects requinng with data collection activities scheduled this semester igned to ensure informed consent, confidential, privacy lance with national and international ethical standards. The documentation including informed ‘All research protocols have been carefully des! protection, and voluntary participation in comp! fesearchers have completed ethics training and prepared comprehensive consent forms, participant information sheets, and data management plans ‘nese applications and assure full cooperation with the ethics We respectfully request priority consideration of ng these studies with utmostintegnity and responsibilty committee s requirements. We commit to conduct ‘Ase Crane, PhD Coordinator Dean, College of Arts and Sciences Approved by ce: Prof. James Gonzalez Dean Facuty Member, Colege of Arts ang Sciences"
    },
    {
        "image": "research1_synth_6_aug1.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines UNIVERSITY OF DAVAO CITY Knowledge for Development Davao Ciy. Davao dei Sur Michele Davita, Po. Coordinator ‘Associate Dean for Research and Extension Approved by c: Prof. Nicholas Mathis Dean Faculty Member, Colege of Engineering and Technology"
    },
    {
        "image": "research1_synth_6_aug2.png",
        "label": "researchagenda",
        "ocr_text": "Repubitc of the Phehopines UNIVERSITY OF DAVAD CITY Koowmage te Ooveegment Devas Sty, eve 40! Su: Colege of Engen ans Tecrebgy sczssenenganstacronnsy Saroventy 02 6h Tek (962) 97723 3610 INTERNATIONAL RESEARCH COLLABORATION PROPOSAL Cetate 17, 2005 Dr. Wen Sabine Onan, Cotege of Erginsecing anc Techaainy (Gear Stadaen Gond days ‘am writing to propose an intsmnational research cotaboraon between cur college and the Instite of Aancattura! Sciences at National Taiwan University This pars ership wit tous an clnate snari agriculture and sustpinadle farming practices relevantto Wopica! enararcnents. The proposed cotiaborabon inchudies fcurly exchanges. joint researct projects, student intern stups, ort Mnonedge sharing actvitins cver a tree year period. Specie activites inciuoe coliaborabve falc experments, Comparniive studies of fanning systems, development of taining materials, amd yuokcaton of research findings intersvorai casrnais Wie vecpectuity ‘aquest your endorsemant and suppor for establishing ts vanatle international partnerstin hat will entiance cur college s researcn capacity and provide Intemnahionsl #xposie for our tacully and students, Minow Davis, PO. Coorthastor Aawociste Dean to Resewc and Eateraicn Approves by ce: Prot Micha Neots Dess Faculty Mentber, Cotege of Engineering ant Technctony"
    },
    {
        "image": "research1_synth_6_aug3.png",
        "label": "researchagenda",
        "ocr_text": "Phitovnes JAVAG Cry oe iy, Devas det Sux mere 309 Tachosslyy Sree Benet, mis on a Roope tor Sen Carne 3 RI iN HATONAL RESEARCH Cory ORATION PROPOSAL COMLAB Daan, Coteus ef Erainaering ane Tentratgy God duyt Aart NIG ko wrovOSG ae méemabonalresentcs Collaboration benvaen Actoulras Ssceees st Naina! fama tems His perveeshig wi sslarnabile taming practice tropical wisronments Sur E ieD8 and the tnetite oF foows on et 8 :8levae rate senan aqrieutiies gag Ries propased cotabacaiion metudee ‘acuity excranges, fosttresaareh protects Hider inteisiins, anc Sa kitee sharing azbawes era tea youn pened Soecite actatios iciuce colaborahes Bold e aparimants, SEmDIVE atidies oF farming gysiame Sovelopiment of training miatenais, and Dublication of rexeatsh Boeing in Srtamatonal joumais We respectattyequast your endecasine wall enhanne aur coviage s 8 SUEDOF for estantisrieg tnig FRSERICN capacity ane ‘valuable iniertona! parinorsnip iat cepsuiE, Bioweae international a fos our faculty ane steer Hicheie Dssota, oo, Coerdinates Asociaie Gran tor Rasewcm and Extension Aamoowed be 86 Prat Neos Nate Deen Faculty Mom, Coleg ot Begioantzg go Tachreey"
    },
    {
        "image": "research1_synth_6_aug4.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines UNIVERSITY OF DAVAO CITY i Knowledge for Development Davao City, Davao de! Sur College of Engineering and Technology technology university edu ph Tet: (+03) 977 323 50 INTERNATIONAL RESEARCH COLLABORATION PROPOSAL October 17, 2025 Dr. Wiliam Skinner Dean, Cotege of Engineering and Technology Dear St Madam: Good day! am writing to propose an international research collabor ration between our college and the Institute of Aaricultural Sciences at National Taiwan University. This partnership will focus on climate smart agriculture and Sustainable farming practices relevant to tropical environments. {me Proposed collaboration includes facully exchanges, joint research projects, student intemships, and knowledge sharing activites over a three year period. Specific activities include collaborative fold experiments, aebaralve studies offarming systems, development of training materials, and publication of research findings in Intemational journals. We respectlully request your endorsement and support for establishing this valuable international partnership that will enhance our college s research capacity and provide international exposure for our faculty and students Michele Davia, Ph D. Coordinator ‘Associate Dean for Research and Extension Approved by. Cc: Prof. Nicholas Mathis Dean Faculty Member, College of Engineering and Technology"
    },
    {
        "image": "research1_synth_6_aug5.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines UNIVERSITY OF DAVAO CITY Knowedge for Development Davao Giy, Davao del Sur College of Engineering and Technology Emai: engineeringandtechnology universty edu ph Te: (+03) 077 223 5010 INTERNATIONAL RESEARCH COLLABORATION PROPOSAL October 17, 2025 Dr. Willam Skinner Dean, College of Engineering and Technology Dear Sir Madam: Good day! Lam writing to propose an international research collaboration between our college and the Institute of Agricultural Sciences at National Taiwan University. This partnership will focus on climate smart agriculture and sustainable farming practices relevant to tropical environments. ‘The proposed collaboration includes faculty exchanges, joint research projects, studentintemnships, and knowledge sharing activities over a three year period. Specific activities include collaborative field experiments, comparative studies of farming systems, development of training materials, and publication of research findings in international journals. We respectiully request your endorsement and support for establishing this valuable international partnership that will enhance our college s research capacity and provide international exposure for our faculty and students. Michelle Davila, Ph D. Coordinator ‘Associate Dean for Research and Extension Approved by: cc: Prof. Nicholas Mathis Dean Faculty Member, Colege of Engineering and Technology"
    },
    {
        "image": "research1_synth_7_aug1.png",
        "label": "researchagenda",
        "ocr_text": "Y OF QUEZON GiTy Aaue2en Cty, Meso Raia ‘Bow Syiptaden: ned days sitheg to nequast aspactted re eondicting hasan sunt with cata collection act) nd an sal of raswarcl semester ch prolocols have besn carefully Gesignss to ensuite infh ni voluntary participation in comutance with natin: Fetearctisrs nave completed emics training and arapacod compie Sonsest fons, participant information sheats, and dala manawa tially request gnc mittne s requiternsats, We cominitia con ng these of Sets Brawn, £459, Cogzdinntoe Research Gootcinater, Colwge of Aris sexi Soiengeen Asrsoved by £0: Brot, Mehl Keigh Beas Facuty seo Cologe oT Arts and Seiences ARON ve fice ongoing projects requiting ates comin sonsideraton ofthese apsications art a lege of Acts ana Sciences oh etsoncssionon sebanieasiy mdr Tet (0 menarche Be Tl 5 ICE REQUEST eh ciearsnra for our faculty members eview to proceeds pimed consent, conisoninity, privacy ‘and international cthica! standartis, The ive docunientation incising informed Site fuk cooparation with the athice wait uimasrintsgaiy and -osnonsininty"
    },
    {
        "image": "research1_synth_7_aug2.png",
        "label": "researchagenda",
        "ocr_text": "UNIVERSITY Of Quen Oby. so Siaaie Sobege of Aris ane Scimnaes Ent, ait endssonoe sce \"ree eens eae Setober 9, 028 Be Ohieoter hata Duan, Govege of arts ane sees vet exoadited coview sng Y Subiect raseama, ction activites gy, Ap onUa! of re esearch shies ctearance toro We have tive ongoing tea Sur faculty inemsars 1d ethics commie re EW ke eee Ali Tessaren prefers have been can Broteution, anti voluntary researeny huily Sesigneg wo gna Baton a comptianes wit ed athice training and p ‘Cbentinfomation sheets, ang ae lnfonned onagent, comm Hatori! sna Malte, pevaey ethical ntsndants. The ENSHE Cocumentsiion inciuaing igornad veFe has complet conse Sarme, 2 ieragement plans, te seopectiutiy reay 0. sstiricnty cones iavation of mesg ite0 s requiternems We coat etrey Brown, Pt, Soars Reseerch Cooninaice, Cateye ct Bote ane Setences Appraved by. So: Prk Micha nigh Focuty Remy oPRBE OF ACS ce! Solero,"
    },
    {
        "image": "research1_synth_7_aug3.png",
        "label": "researchagenda",
        "ocr_text": "saulic af the Pisiiomnas UNIVERSITY OF QUEZON ory freeaoreg Tincugh Eeccones Suez fie, Late taste Gosege oi Reta we Sceseen EnRd stesosioneers Bunty ean gn RESEARCH ETM Detodee 09, 2025 Be, Chvistontier iy Gees, Cotege ot Are and Science Sead dart fathics learance tor cue te Tequining eaten culty members, ‘omimitia review is prc S Scheduled tie sensaster Allsesa6rch piowects nave be: an Bie asi9nod io essuse iniscced convent, canta ity, astm Srotection, and vosuntery nartination in Yonlation with natenel ans mlernstional of Sandstes The Searchers hv copia elties kalung and prepara Cemnatohenive dscumsntston incsciog surmed TERT, Davinicant aoomatien sheets, anu data Pincagement plans, Foxpeciully raquedt pronty consideration of tase anstics Committee s sequramants We comm tions and amsuce fe onducting hese sues wi Soon roiton wit Hie ities ‘ost tntogiiy and reeponsibiity, Petty Broa. PG, Coartine Fence Cocesetar, Coens of Arts osx Scions Agprewed by Prot abchaei Knit a Facuty Momhes, Cotiye of ay and Sciencag"
    },
    {
        "image": "research1_synth_7_aug4.png",
        "label": "researchagenda",
        "ocr_text": "Republi UNIVERSITY OF Qi Empowseng Troup UEZON CITY Quezon Cry, Meteo Mania Colege of Arts ang Sciences nce s unwversty edy ah to {+83) 907 088 4085 RESEARCH ETHICS CLEARANCE REQUEST October 03, 2025 Dr. Christopher mits Dean, Colege of Arts and Scrnces Dear SriMagam, Good day! pleted ethics taining and prepared oo Consent forms, participant information Sheets, and data man; We respectully request prionty Consideration of these appli Committee s requirements. We comm te Conducting these. and international ethical standsras The Fen ehsive documentation including informed 'agement plans ications and assure full cooperation with the ethics Studies with utmost i nleonty and responsibility vefiey Brown, PhD, Coordinator Research Coordeator, Cotege of ts ang Sciences Approved by Ce: Prof. Michael Knight Dean Faculty Member, Colege of arts ang Sciences"
    },
    {
        "image": "research1_synth_7_aug5.png",
        "label": "researchagenda",
        "ocr_text": "Rewublic of the Plutipotass UNIVERSITY OF QUEZON chy Srowaning Thee Eaicaten Suave Cy, Mowe Mane Cosa ot A8 a6 Senses Avoroved by _ co Prof, Misha Keapnt Dera Raciity Member, Cohen of Avis nd Semmens"
    },
    {
        "image": "research1_synth_8_aug1.png",
        "label": "researchagenda",
        "ocr_text": "Remublic of the Phitpatans CEL STATE UNIVERSITY Becscuaveg Tow Baas bate Cay. CuO aauate Sahoo grasunereroniteraba ere nn LTS 8 RESHARCH CONFERENCE PARTICIPATION REGU posngescnee bear Suiataniae Gawd days nest asproval anc Gnetn supper fr these euly METSTS prepantreseanch napers athe ratonal innavation f bo nels in Singapore Boar ars 15 38, 2028 06 ped Brat Marices Santos have Leer anoapie fo oraeert SA Es arch on ning pletiorts, and ausascnnen sirakegies pam aatting to international Conterence 2 Garephine Cruz, brat Anite Reyes. soe tapering mATOOVOg artcution i! provide anportriias ts angage with 698s sg regenrchers, ssn aout osting ect reeiapeneats ih aaucation, ane enhance the Unites mernatianal asbiy Tole expences amour BS Sug 280 pesus for hues carina, We have waste oe Hoo paws fom comage funds dnd ceseeraly pequed’ unieeraty subsidy for the aalance che werneatly apgeat for your approval aig euDpat, This anyentomct n Tucntty Seveionronnt yids sgniticaat abies and seston RAST satay through enhancee research 28H aninany Fes, 0) Cansdinata Flesearete Senneinate, Gracheate St Agpreved"
    },
    {
        "image": "research1_synth_8_aug2.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines CEBU STATE UNIVERSITY j Emsowerng Though Eventos October 28, 2025 Or. James Greene Dean, Graduate Schoo! Anthony Flores, Ph, Coordinator Research Coordinator, Graduate School Approved by e: Prof. Stephanie Velasquez Dean Faculty Member, Graduate School"
    },
    {
        "image": "research1_synth_8_aug3.png",
        "label": "researchagenda",
        "ocr_text": "Ensening Tease RS “sneer mcaenannsion PARTICIPATION RE QUES? Satober 29, 2025 Or. James Brean Ng fo roxas Intemational Conterene SeseDhine Coe FO papery at the 2025 Or Bronce participation wit prox opportunities eam about euting ecge se aaments in ecucaton, ana enhiagre ths un 1 Vota expenses omount ie 25 000 6680s fe: tee patients me POP 20 88 196 096 poses tom cctone funds and respectty ISMES sively subsGy oc he batons We oa AbPER! or Your apecay, Fetus through anhas Epo Hevelspmey SSC FeSeRICH capaDiltieg ara j nt viahts sini Anweny Fores, Coavdinstor"
    },
    {
        "image": "research1_synth_8_aug4.png",
        "label": "researchagenda",
        "ocr_text": "Panublic of the Fhuiexcues CEBU STATE UNIVERSITY i Expmenny Navigs Coseme RESEARCH CONFERENCE PARTICIPATION REGUEST Cotaber 28, 2025 Dr. domes Beene Dean, Graduate Schoo Conference participation wit provide opportunites fo engage wih leading cesenchars, lex stout cuting ecye Stevtiogments im education, and enhance te university international visivalty Tot expenses wmount 285 009 pesos tor fuse partctosnts, We have secured 190 000 pesos from college hands and reEDecaahy request university subsidy for tha balance ‘We aserienity apeai for your zporove ans support This investment in teculty developmen yields stgnitcant retutie SuoUTH enhanced reraarh Canaboles arc Mstzenal mpusaticn Aetna Posen, PD Cont doses Appraved by ce: Prat Stermarie Veiesquez Dem acuity Member, Graduate Schos!"
    },
    {
        "image": "research1_synth_8_aug5.png",
        "label": "researchagenda",
        "ocr_text": "Reoublic of the Philippines CEBU STATE UNIVERSITY Ensonerng Trough Easton cebu Cty, Cebu Gracuate Schock —I 21h Tot (03) 035 300 4804 RESEARCH CONFERENCE PARTICIPATION REQUEST October 28, 2025 Or James Greene (Dean, Graduate Schoo! Approved by cc: Prof. Stephane Velasquez Dean Facuty Member, Graduate Schoot"
    },
    {
        "image": "research1_synth_9_aug1.png",
        "label": "researchagenda",
        "ocr_text": "Republic of the Philippines UNIVERSITY OF MAKATI Knowedge for Development Makati, Metro Manda Graduate School mat graduateschool universtyedu 9h Te: (+03) 005 174 0867 —_S— ccc to To 0) 005 174 0867 RESEARCH ETHICS CLEARANCE REQUEST October 23, 2025 Dr. Glen Ramos Dean, Graduate School Dear Sir Madam: Good day! ''am writing to request expedited review and approval of research ethics clearance for our faculty members conducting human subject research. We have five ongoing projects requiring ethics committee review to proceed ‘with data collection activities scheduled this semester. All research protocols have been carefully designed to ensure informed consent, confidentiality, privacy protection, and voluntary participation in compliance with national and international ethical standards. The ‘researchers have completed ethics training and prepared comprehensive documentation including informed ‘consent forms, participant information sheets, and data management plans. We respecttully request priority consideration of these applications and assure full cooperation with the ethics ‘committee s requirements. We commit to conducting these studies with utmost integrity and responsibilty. David Morales, Ph D. Coordinator Dean, Graduate Schoo! Approved by cc: Prof. Ashley Lee Dean Facutly Member, Graduate School"
    },
    {
        "image": "research1_synth_9_aug2.png",
        "label": "researchagenda",
        "ocr_text": "Reublic of the Phihppines UNIVERSITY OF MAKATI Knowtedge tor Development Makan Meo Dear Se mtadam Good day! |am writng 0 request expedied review and eine wich 8c clearance fr ou faculty members Sem uctng human subject research We nave tor 9 ORCS TUNING EPs commie renew braced with data collection Scheduled this semester Approved by Co Prot Ashley Lee Dean Facuty Member, Gracuate Schoot"
    },
    {
        "image": "research1_synth_9_aug3.png",
        "label": "researchagenda",
        "ocr_text": "+ Pleinypsae UNIVERSITY OF MAKAT? fer aveboament Mast Mae Mante isouste Sones ol gaertencnenituonany egy pm Tei ian: 00n 70 9807 ESEARCH ETHICS CLEAF smn NCE REQUEST Be len Hamas Besa, Graduate Gennat ew Se Reagan: Goad day! Farr aerang to request exnedived raview and approval of reser arch sities clearance fa conaucting human subject researen, We have ve ongoing projects reesinng wits daiz colecton actuities schaduies ts semester aur Beulty members 'S committee teview to proces ich proteente have bean caretuly designed to ensure intormad consent conbilontiatty privacy Protection, and voluntary patent ace with nabanal and intemations ethical standards. The ciiers Raye completed athics train and peepared comprehensive cocumantagan facies consent fo558, pamticipamt information sheets, and sata manacemast cians intorrned ‘We respectiutly seauest urionty ol prionty consideration af thes coment id sau full cooperation with the at ath ubnoGl imtogtity and eesponsibisty Disvid Morales, PRL Coardherater Bean, Gracutte g Apnreved oy ce Prot, Aaminy Lew Dean sity Recor, Graduate Seton"
    },
    {
        "image": "research1_synth_9_aug4.png",
        "label": "researchagenda",
        "ocr_text": "Republic of {the Philippines UN 5 ‘OF MAKATI Mahat, Metro Manila ‘Graduate Schoo! ap Tet (163) 005 174 807 october 23, 2025 jproval of research ethics dearance for our faculty members review to proceed ongoing projects requiring et carefully designed 1 ensure informed consent, confidential, privacy win eompiance with national and ‘nternavonal ethical standards. The ‘documentation including in osearchers have completed etic ‘raining and prepared compre! wonsent forms, participant information ‘sheets, and data mal We respectlly request prionty consideration ofthese applications ‘committee s requirements. We ommit to conducting hese studies wt ration with the ethics ynd assure full coopet sibility. it utmost integrity and resPo! David Morales, PhO."
    },
    {
        "image": "research1_synth_9_aug5.png",
        "label": "researchagenda",
        "ocr_text": "Repub! UN SVT OF MARATE Knosiariga for Dewelepeaest Tae, Reta aes Graduate 5 seven gatas RESEARGH ETHICS Ci EARSNOE REQUE October 23. Br, Bhs acne Bean, Graduate Sehocl Das Sietadam: Gead days Lam writing f@ request exuded cevie uctng human subject research. We have daly eotiection activites sesecuied this sei nesier All fesaarch pretorots have seen carehilly tesigned 00 ers prolaction, and voluntary particinaton in compllan raining at ‘We respecttlly conmeniiag s requirements, We conn ing th David borates, En. Cosnbinatar sagume Schoo Faculy Meme, Graduate aid approval of reauarch atians clearence engaing projects requiring ettica comm werrmrangaduseh Fa) 288) OH 7A NNR? St our faculty m 190 revi 2 informed conser, contidientiaty, ivacy l2hiowal and intomelional ethical stanazrds. The pomation shwets, anc dain management atans,"
    },
    {
        "image": "research2_synth_11_aug1.png",
        "label": "researchagenda",
        "ocr_text": "FACULTY DEVELOPMENT PLAN, ‘AY 2026 2027 FROM Susan Bryan, Pm O ‘Academe Development Head Reaeanen AMET BRON mar Tray we ora Aes memo Fe oe NE: are we Naa yes MOT anne arty re pantera Re A SONNE rN rE ep wry we HG 2 Ramcsta ro Dusen ST A FF A I UT NANCE PO NRT TE ew tenes proms nongeer aan COMWCR FOE A SRST: Re CRE MANNS MASH 1 Rea Camano NAG ORNS HE eS IN SNC) Ore res oR TS eornesa mars pevwvne vecpvet. raat) came uaa ma: Aer Sue Ween ema 1 TEACHING ICRLENCE ARO PEDAGODCA, RNOVATON reratora 2 Grameen Aces mary Srey He Sara eae: Aen we wate ROTM CTO nap ne care ect UMN geod MONOID me OH NON OWE aN Sow TY 2 meu Bert ary Covpmrom aay nuyenet iy io Decor apts ay aR Owe memenet ne mart egnpret: Sor we moran mG Hye Og rae ean RIND we 2 ee Cormre .arey rau: Pree ec Ne A COE 8 Ee a AO owiees ary reteset ee Seen as He AT Rp: RANE TS MEATTIG SBE PROPESSONA, ROTH AND ADVANCEUENT nsaron Daye ne Covteton Payne REDO TE aye comet: Pears ores wee Po cman wanes rar Fay ne sy DTN Spe MOTI wT 2 Pay aye ey Maa Tay FN TN TL Re II TIE rerraans crmrees prtoptan y 74 RO TRIG Ae RN EO OI 2 Lanne 3 irageeet Oeecoert scapes aanrD i ano Fy OF Bay we Rm G we Sa marae ne aren BORO THUR I eC OLE MIU OE ATS Ne TENDON AND COMMUN ENGAGEMENT reer ges Decora re Uaupreet Caner mam amet 7s Fe! ome Pa TeeS By He RTO coer ae moe REMIT OME ORB ESO Re EL EAMES BT 2 Teonaay Tarte a ron ER sero RAN OAD Pe Pap) act TU rane oncom ty Bar eee We arL@ REDO. Comms MEO ARRON ES V MRLEUENTATION #40 SUPPORT MBNA Py oneness Maro me Ta Come “wagner re rs OaaTy Rem EID MN AeA ee PTI cm os oe mame Pep ra MD BERS er FAT AUN mor I se HY gene ty wore Spe ram"
    },
    {
        "image": "research2_synth_11_aug2.png",
        "label": "researchagenda",
        "ocr_text": "FAQULTY DEVELOPMENT PLAN FROME: Susan Bryn, PED, ResvenTrammg ztanain- ese natn co cele tnsoiering Gt and aaa ganache usar ado seminran ae eat esc ret aia waninee Sone merece eee he son ear rtgrhaaegees- Cort eeieatin ie hls Rain pat ese doneT NE erania: sere pareng seach saat pacar een ROSIN nto Sots Beene Aci larigebaagus au doniom sant -Sevener xteeruian emis. Clrmen spa acces esate, atest aes POA ac eH eB OSI +2 chineansDaas rt costs eal mangoes tylen tau eergts catreee e Suro. eiangnoes einer Sinema ce tesa aes apes Sys Naess mS NOTE em PE cporaspems ing sarc ‘auseig dcurn agence Pao anne ations Patria svonevactek- opnsanriacwine hasten sie ans any ogre Tang ease pi nents Pasian ge goon ya 2 esercap me ararie e Svtximaigeneiind net marina a ea rege Hag UM Dini Tema BUSI SME es earn Prget ence a CaS SET stony Sn rms TASTE ago Hg a fy nistetaoscae tags tan oe ia ata eset ACS Soo ene Deana prthunin enero mu aye Y ageing astm, RN A ak sg Ne ares RE Reo un uemexaei nampa aan ce"
    },
    {
        "image": "research2_synth_11_aug3.png",
        "label": "researchagenda",
        "ocr_text": ""
    },
    {
        "image": "research2_synth_11_aug4.png",
        "label": "researchagenda",
        "ocr_text": "FAOULTY DEVELCPMERT PLAN ae aT BRDIE Susun Bese, PHD Develgernent Heat neseran CARAGITY LONG Seuss rane mater Metso Pas aN ARNT AEN AS aTHL ee aNd TSHR ENE east ks UR SPE EON 2 EE RENE NI NTI AR ‘caseave na baueriemian Supe Muna enwen gE RBCRDS an Matawiet oss venom ESI TE tow eee pene ar ar esg rh rete MR Ae EPS PERI TIASTRP TRE L sisseunc casero anchoring: odor emer eora or: Hentai O arse ecu peep MA: PUA BUSEY BS WR MOTE TNT HE NAT novaron sc aAHs excouascn a PDH ‘encore Sees Rav nen apa aaron SRL eae nS RENAE ETT aegis aree Rg ESAT RNY HS SGD TA A ET TN SE 2 orn mote ar Gampeees- armament an wie gE aR J avenen punvanwyemen spines Hisiyimemstineertnye Calta nermaen bors 4 use cee Et AIO FDA AG EE TORR POA RY AT doops cary ented meas NE Sn eS EN Meats AIAN ERSTE s PROPRSIOFIN OREM 23 ADVRASEXENT gs Dap ant CaTSeRON HON 9 BRET GR eB” BEEN ARES PIS sae ue PATOL EY HE A SOTA SIAN ASR IS SEAN ss Tabi sagan pine nes Ae ER NETS ET racay er ngrarstary ructens sane prncgeton ‘hey DRS RENN af NG ERE UES FTI 4 kona aneMeuponar Geseees axis wag Se ASSES Cag Bea amin SRI HH paperanian RO TH BY IE ERENT EIR EAD EATER PD ECOEALINTTY ANEENT eosin ees bere iet a arg t Caut He Sena SMES POE Ne opener eign nenusonatn a tain, og BN ZSPN SCRE ROSSER AAA SN WHO! SS sc Teseseg, Tae ae mentee memrene cane pen aveema nemanlinicge Rare Mas roa A ee ate scaenr pars ee! BEIT pen wey EN MES 4 ANG SIERO MEEHAN sprab ee nontgioie i sane aetna nse rag gH Tea, ergin osban se pao RE ven andy even tees ar spconnan orgies Ysa OBVIG Mees OARS EES pean te mainers Sree rea BN ea HE INN tN a ae BE EAI pos. ste er 78 PH"
    },
    {
        "image": "research2_synth_11_aug5.png",
        "label": "researchagenda",
        "ocr_text": "FACULTY DEVELOPMENT PLAN AY. 2026 2027 isan Bran, Pro, ‘Academic Develooment Head FROM 5. Mage Revaxcncuse enna reapen \"TERCANGEACELENCE AND atoagoc: SoA NNOVETION 2 onmeansenn aay aeasiret resent oppor Cola ae mcometiseanay menos Soma ener Rr oh IT cate este Ree es nese emerge (oir coteenct azo ash Brsamomertavpone, vemaroessy ascroa zap ane aaa em Mnanrer Deveconer- scans ene npassinnsrzenvanng Sraeyc aay ase nmg tele Remover ms masceaciain- Tem wianmoonnnn -8on- Change vanpevetan mova anions 08) seen aa rape \"9 Busts meemaceastene: \") M099 satan mesa ny tonea meen ran ae ‘seman maser ace acon"
    },
    {
        "image": "research2_synth_12_aug1.png",
        "label": "researchagenda",
        "ocr_text": "EXTENSION SERVICES AGENDA AY Rie2035 FROM tain Calf, 28 9. stension Servinas Director 1. Fani Senay insta sa Me ote Ct CORON SOT PIG WE NC PSE ESD Ivaniaeayar cersnaia any enrnunsy seauanerinta te picnic one terse soca ge st sea mem puss Teoma sn nue Tray: Passpoatongantgrasriacy setae arp secretaries Base Seson anand coast int teres alanine ay arenes NEA BS RCRA COE LONE 2S TIBET BONN CI 9 spose mapas Ragen. segment rete SER ee NR ‘ispoccraam and zed amrsnugener agansse mene msesinanene ts Hinge enaraptartee hres res. camping Dhaosa pace mea reste FN Daren CEN essen Suro Sang acer ave aoa) MET eon tama eSeeese anageTPre 30 Sarg eoagey eons rata Promo PHOT ARCS EUR NS COS DINE ENTREE GEES nzeyenertvangara ine nena fats $M HR URE BOAT ORE OER ME SHEE a EO 2 leah As Ree. a Semmens este joguenees oy. Rewonvntteimeatr gow pokes Sans sniesar eR Ren Fey wag NS LE SANE sires Be eNO ANE Tina acMererow augtns seanons actane a sre ness Sana etn aR gltzue sistema eadrene pte era meer ee welcPiee Ren PACING NS BAN SEAT ‘yo sasare a ae Feet ang ann GDI SHEEP CE MeN Ee SELLE CEE -DNE PON A BUNA HIRE A ACN ABO ieee garana onsen saga ney ie. mane ares en ay gn Bote"
    },
    {
        "image": "research2_synth_12_aug2.png",
        "label": "researchagenda",
        "ocr_text": "EXTENSION SERVICES AGENDA AY, 2024 2025 FROM: Devin Grif, Ph D. Extension Services Director eVGAGEMENT ANO PARTNERSHE DEVELOPMENT cemprowree cor) tan Tae ey EE rapeariek parmer coemtes Cre Leoununer eae Coney tear ae Nees ASE COOH rence wen arzgeyLGUe a NN TEE DEN NI ‘arty een eas mag #7 1 imme Coupes Metro BE TE WE ORTTONE EN NGO ET FS WSS Te ao caper cardnae in aun 3 COW) NCGPEaR EAS RAD WTAE TESTE Syeaso |. CAPACITY BULDING AND BELLS DEVELOPMENT PROGRAMS {Teme and Voto Trango roca an eer on NOPD (Nino ra ramnrarce cares Weng wma eon oan Asa sac sions aragonite tare rj PUR SENT GY jtarns Compre noe rd maraarert- Arona 2 capmey acreraao ais rang Bact rong Ea FOE 2 emepwereny ma vere Deere ‘sree: Mart ratage one zope rotons on nares ang a a 20S en Orga rng a aru ao moet Ce sa aC RSIS hve rang and aa a ager Agus a a8 OFA ree mecica a oea cesar ena wea ier frases 3 a= 2 Medes mats Osan von Faun ance raya Rete je SCAT HIE OE ag cen an Ute ME NW BCURONWENTAL CONSERVATION AND DSASTEA PREPAREDNESS enero Proc ate Tee ary reat IRS CoM Se ME HT TON SN SARE eiemroerang resemeaon- Wiegmann wire promcon Baswest coMeiaon NEST ‘nae mo Reactors Mrapevet- Comma ied St eps Yang DEEN CANES somo caries nea PHYO RESET MNT RTH URGE MEDS ARERR OTS \\V EDUCATION AND YOUTH DEVELOPMENT |-umra aa erry Pagans Acton aaron Sng Se SIAN MHA EAN ATC uorcr acon eaves payne 0c a AAA PSTNEE IDI RAG AE ONES STS rgeratra Seeger Eres mares 3 ON 9 ena VRE Yr vce UC IRENE ERS VEMONTTORING. EVALUATION. AND SUBTANABLITY mecca une a cnecen repr maa Remmnenun n rordn winters suosarce Yaring maa acorn wpa ewe! onneeig ae pt meee aa ataray aIg PAT ate bee a coy"
    },
    {
        "image": "research2_synth_12_aug3.png",
        "label": "researchagenda",
        "ocr_text": "EXTENSION SERVICES AGENDA AY. 2024 2025 FROM Devin Grif, Ph D. Extension Services Director cOUMUNTY ENGAGEMENT AND PARTNERSHIP OBYELOOMENT «bare Comyn aa Nests Aart Conai compere aman proting ad mea ye ST racripe wire Gus econ gare Devs Panera AgeETIN WT Tw OHTTUNER rete vty neon dame a manny 87 overran apres NGOS Enaye rae che EEO 2 camera Calamari sna Nencrong Bud TASES ages ranO SeLTHE Frontanrn agp couarae nn ae Cre evecoer nates an gras ILCAPACITY SULDNG AND SKLLEOEVELOPENT PROGRAMS Teecal art yosatara Tranny Foo rooming aa reveraton none Caper anseasructon ils ray BSc linn nd nararares cayees Weary animes nian oy: Afonotve weicng sea\" Fang set Base pacmss naupever and tare a) Prog ieee oI) 2 Enraremrsng re Uvenond Dewar Taummapenet: Meccan wees (agree asezny crags and crne DSSS DEPT COMDEV INERT maragenet agicunea snares Eseson- Org tring sa susarane apicunresraron -Post arest andy ana ave 2ston~ that rang aaa hear are Aguanste amare eOrce Tana Cima sar aoe HT CIE i HEALTH AND WEUNESS EXTENSION PROGRAMS 1 men Econ a Anarene Campagne Dien pesto andrea pz 288 -Fary Bag SNSTENOAIC eM eismanNapon coneeing sry eye 205) Mena pea” ates a7 ees Mangere Frstaa rary 24 eve genset 2 Maca and Dera Ourean canoe Fre made a set coeutzion invert ese- Olan edness Eeanaceniny and Supontc evict rmuraaion ans abstain oy 274 RETA yee SpECSTIEH ASCH cae ENVIRONMENTAL CONSERVATION AND DISASTER PREPAREDNESS ‘rrr Pramcsn tates Tree aring an retreat gers Conia ean anc marine cntervaion 28 Sd wake raagenert acing aneinpleneratan- ai qan oi3g 2a) ACN BOVE CONAN eH EN 2 oat Rie Resco ant Mayen Commun oes Saw renee aring Deveaamet ¢eanssin ss a rome. Sewn naresc site Yarn} PeyeaEs Da ASRS SITS ood eco anda OTE \\V E0UCATION AND YOUTH DEVELOPMENT {uaa ae Mewring royame Acadene snc i eruggig Sates Snares itrnaton ra ooton spp Care gear an cvagereaase ogra Some and raMTaEC Tce AES Reng ey 3 ATE CTT. 2. Yom Langan vanes Formato Lear Trin and argaato Oniegret- EnirorTera arrest 2 oun 30 0550) ‘ps ruc decor oan. Ar d9 e 22s SECT VOL Here aC NDE eV VLMONTORNG, EVALUATION, AND SUSTANABLTY ‘Av ecewon ryan noua ane aa clacton regs at vs imsae assase rususananiny paring Pare Crvmurte nie rorak win Neca ates Faring nawiss sncortrung sie ere rye Dent acon omens ctintates"
    },
    {
        "image": "research2_synth_12_aug4.png",
        "label": "researchagenda",
        "ocr_text": "EXTENSION SER AY 22025 PSN Deve Sein, Pa AGENDA ccm REET AN TARO ERENT Pee Conc st ath Aeron ander cay HE RS BRE SS I NN PEE COANE De LENE ION eS ON EH cient een ummse samietereren 5 Baar Cromer innate Rapanui garage 2ENGLR- Spyro MeN Ye ROT eT S00 8S AM ROE A ra HON RE A re munreae SOAS RRR aD Ge neRcENNtT SENS Taawion werd Tari. Money ama wat Cay Be eB SN ty Ra Season mi armas caste eg ie re Wok Haebve se cng ee Cy fteapesanp au ase erred tae usages agent wee aN Pt See aN kts eens HERS BMY INS Ree ey ORES an eth sages A Astoae anseire Basoa -e sng a Mater aU as Pte Ey gE URN Ny a ea mB LONE: AHR. RR ENR aC Cees aes tenon Su meat aa neces: reas sac oath ganas at amare Gorgeye Seanasemn sua ee on so ay ana PrN fe ga omy Da ea Ste asE LWA wee Mae. et SEIN Sibert ose even ro netin sslevte costo Orenstein etme ate whee Tamm ennnry we ment: ram NEAR RR aEONpaFAe RA Hee aco eee ae Sew. Cece AN iRRBTEM MECHAM Luldniddiubiiiammigoaeence eee RIE ow SIN ea ay mate ME ARNNTHR ren. haseey aeverees ome 2 Poa Ri ctr aattzageras Sane Sat Pea Se ce se Fry 98 iactaredenine sotrehre Pn. Devsmens eases 3 OGRE RS LS UTS RUT SeDAT) we ‘e mvcarcn se evteuecrcenent ene mibinerng toy ees Acme esate mR a eR EN Ca War ns cia rss aya ine ae mas PONT Eh AOR EIS mar, tie Yam iamisane ae iis Rate: toaoneey ae etericas serigvoey ancora arte a yt any Ne Ba esire canon ans MIRE RA NES NBN. ME Meine BONNE ate i terTOME, CUA, NO eearetY SR Time nena esr atk reg ak ENE Pe ae ere ea a Mt san roa, aeons name en Ba FS semana,"
    },
    {
        "image": "research2_synth_12_aug5.png",
        "label": "researchagenda",
        "ocr_text": "EXTENSION SERVICES AGENDA AY, 2024 2025 FROM Devin Grifin, Ph D. Extension Services Director |COMMUNITY ENGAGEMENT AND PARTNERSHIP OEVELOPMENT {tae Canny eetcaten ar Ne Astensnt Caaat camprenerse comm) pong 2m y= Ea aren wm rng LGUs cry eETzaT- Dery mereranda ayer Wi phe COMES rete ‘Sent een danse a norioing sien 2 Sinan Cotaratn aa Nearng- iad are wh goverment gene and NGO- Engage pie ac fr reno ‘nzaon ad p= COOS WM BU COTTE ROT ERE ESA RES NR MET VEEP. ogress {CAPACITY SULONG AND GXLLS DEVELOPMENT PROGRAMS Teoma and Voston Trarng- Fd rcesng nt revere wrens -Caperty anconsrcton rang Secrit veut admarnare artes- Weg 2 ea arcana Adzochve evi near FANG 2 eterna ane Uvenond Devearner. Save buwss maragenet tare ry Proait devdoe day ‘ssn Marin eager ard orine bt aa Cooperative dev copmar 2 manor Monae a cedt magnet 2 Agios and Pees Eton Crate taming an satarane apse actoes- Posten ava 2238 reso rating and ma na manage Aqucshre 2nnarneresouce maever Cima apicutre raoges SL HEALTH AND WELLNESS EXTENSON PROGRANS ‘Hes Easton rs Anarene Campa Disene reverend ea pocon ves ary aang adreoasve a eteatn- Nurtonconeaing tne eye 0 3) Meta aa aires ad Sess marupevet- Fs adYaneg nd eve ge repos 2 Madea aa Oe Odes Series Fee mada and deta connuttens in rence eas Orton meses 23 Vain eam eceeingandgapoet ews. rmaato anos aya Reera oj pecatzed hese re NE XURONMENTAL CONSERVATION AND DISASTER PREPAREDNESS |. rvecereta Peto ates Tee parang ae retresaton es Casa Seay amare corven he Sd wae nanagener rang adinganeratan- We gant moworny a nalrnedproncton- Bovey owen ae 2 Deane Rex Renin aa rapevert- Commun ated uate prarenns Yanng- Development eeu 3s oben Sen scent Farry PHeRC ppt date rw veneer relat oyaTE \\V EDUCATION AND YOUTH DEVELOPMENT Taiat ns enzrng Boas Acaemic assarc rergyng sve Sensarep tomato and apseson ipo Cares prance msconape ease roy ane. Somos sd nanescsevcrenavitee- RENIN) AMERY NSS 2 Yom sxsrepand Valet Formation -Lanrnp Faring an rpzaor erp: Eni are ton 2005) ‘Some oshra deacpmet oyane- Arig me aun ean Vonrtew er an ve egapenet ctv VLMONTTORNG, EVALUATION, ANO SUSTANABLTY _Atecenon roy rote Dan ia cotecton repr marin Wt, pat assessment susan arin Pa ‘cnet wl be proved win eon ence, rarity appr br one Deets omy merit ates,"
    },
    {
        "image": "research2_synth_13_aug1.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORITY AREAS AY, HELD emcee Sevan Seating PRE ‘Reguarcn CoonAgt guprnnne z DA RENEAT ADENESENTS esate: ‘ona ce ese SENT sonia ponents: eT ec nareeete see: OTE 1am ere Se: NOM oa ae ACES ITED ‘remnant SE PITT gure et I ORES TT meg tga watesaa sae easy A AST von eacusacise naeG TE SITS sre ceg 2 OOF ney OR EE scan oN EORUATION AND HERE resins scree sige use PEST van asses eae SAT prenacn zte Le eae area: MER ETT SN eae apoe se avrg (TO TT sere I cas HBG TOE pepe ts SET xyes TOE pr ali reo sa irs ReeE ES ane eynneam 200 cgonussutes 000 onc Hee a pics rE seas were nests ass nen WEE oom aacen astm reset eens eS ore acne nana ENT TI sacar ETON ESS seep na FN ES as ao CER RO prev ws BF LIME ETT st gnc rage OP essen sR aan Da ETT pour as SHOAL MN powiene neste re rm AS rane eer ONDE ree, Ne ANE ENT eet peanuts PRUE HAT NA PERS gues B22 pasa resent foe BO ES rete eso RA sueesk goer AR OEE ny sper ee AS once eee Sk RAHAT eases BE ITO put EEN RTA THERE NE ema pegece its Wire Fa ee gusta ne EAN enya pen EERE ERTS re nwo I TA cern NTC pores ap cer tt SERINE ap aN DOE OTH IS ore eevee an ah ES Carve a0 ete oH"
    },
    {
        "image": "research2_synth_13_aug2.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORITY AREAS AY, 2026 2025 FROM Susan Ming, PhO. Research Coordinator BUSTARABLE DEVELORMENT AND BWUROMUENTAL CONSERVATION Coma urge Asmar organ Cam Commie Asem vires A ener mame recom ey STUY NR Sha Com Smet Sm REE Sa Fe MONTE 2 Rerenane wy Oyun ad ren Tecroap <0 pone RMON KV wecrtcan. Boma ew For ApS sae eras bey owe) manary me me corencson 2 nae ragrret ae Creda Caran) Pate wa enter Be ejay MOR Op nm como ae ACALY ame rapt eee) Fae a DITA, TRANSFORMATION AND BERGNG TESMNOLOGES Aeon rmgree we Maw Ley ASCH A poewes Ay OALs pt acon ae are Predcte maytck (ort prtrarce a ern Nar arganp wang ce IQUND Pee 2 rarntTep (oT) au Sra Ss Sea cana nearer mae anes pect ap re ome monary Asam am mamrey tytn ear) ce 2 cypress Da Py PORE PN SD AT PSY 9 ae Hens ena Sam Nr Me) permet we nse verso HEATH WELNESS ARO QUALTY OF WE 1 Comma aun au uaa Pewreon- Nocowm icne Sum peer payors Mets TED Bees me ewe omeye- ana ie oes tah rove! covets 2 Tamora wasore eres Parnaso9y rete Spas muons I ON ERA ey de cere Deere ¢sarar soe was masre 7S 2 arora Pon en) Marat mena rarvertn ay ams Oat Saracen ts pat ha ok ingots na renga rood ta ons are ROUCATION. 2060, DUTY AND NCLUBNE OEMRLOPMENT Sisstehdinteiileche leirapcadbeaneebheneietanienetee tere ed Sem nary: Asam org 2 oe) Heme sec 3 taoa roe wu comma Emameenet: eran 3a en SPU Weer narod DME OTR EAE Pm Grow en) rs woe were Da 2 aca Gonerarce aa Pc) Oeveapet: PatoBa) orerarce cme) ene Pe Macnee) inom st aaye Croce cme moj WTsRT a seat V MPLEUENTATON TABLE WO BORCTED OUTCOMES sc nbaldsepelightenbds btoskadetateaatedioeenelemtedtee beeen el SF cts comma ae a sect pans BPW! wT Pe Dae Oem Gant SOCK we NE A von. s cniepdealieaunbandastionnmemnatseertenoae Danes ema mero coy Ron we nara Forename"
    },
    {
        "image": "research2_synth_13_aug3.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORITY AREAS AY, 2026 2025 FROM Susan Mulins, Ph D. Research Coordinator BUSTANABLE DEMELORUBNT AND BCURONUENTA, CONSERVATION 1 Comm urge Aston Sramges Cama Commute Ata ry eect mame erect Hy “eareg eyo nara Sua Comm cnet rm ane TG mE SEE, 2 Repesape Dery Spon re re Teoraag Sau pw zany eace tosh Borat ew Poe aS aa tare boy Mowe) Oana maT rear 2 ae raret ne Croatoa) Pant nae ctr eeyory roo. Op na oro ra pone Cae auger re oar FN |. O1TAL TRANSFORMATION AAO EMERGING TEEHNLOGES ettoa rams ea Lary ARO ew ASA om actn aet ct may ort artrmirce reerton Na ajay roomy Ce pA 2 earns Tg (ut) we sear Ses Sra canaa arse ne ery Marana Totes pee Ae ee nary Aare an mama are a or 2 cyeruna) we Dia ry amt pr oa ao aR ae Sp pa es ma re Near wn) poet 3s trem HEALTH WELNESS AMO QUALITY OF PE Comma mean ne Sasa Beaton oorecane Suama rote 3a ae. eed Ma Bee rere, eager re oes ma Orr eC amore wagon ne neras Parmaroag Summer rare esos sat ony Etc mOsm te Sree Seearet ration woe soe rs arto ofan tama) Warren amu i reer 3a Ceres Sw A PORE TO nyse Una tery rs romros os onto oat 1 ROUCATION SOCAL EQUITY, AMO NCWENE DEVELOPMENT 1 rocan Yeager Weroasoyet Eectorent fers oe ay Mone CA ym ND ser arrt: Asem maya Cowes) m8 met 2 Sosa noun a Comm Exponent trun aya PSA ARTY IO PONE OR He eee Grow maa re net ero noo 2 es Gown ne Bo) Seat. Patent) eraree Rea yap: Pi wre my moa erga Rear snes ps) Wms ca aeeaTT V AULBUECTATON TAUBLNE ANS BPECTED OUTCOMES near ge row Pee 7% aa woe mgerrtt Araya pe wh aT ay woes an Pa ap tots coma fae Fe aearert pah Ww Pe aaIDN Dect a SO NT a roe ont sm To REN! a A Sec METONPAL ETO) NE TE SM Te RoW oe mans Sar eT Bre Fe ETE ET"
    },
    {
        "image": "research2_synth_13_aug4.png",
        "label": "researchagenda",
        "ocr_text": "JARCH PRIORITY AREAS ‘AY, 2024 2025 FROM Susan Mutins. Ph D. Research Coordinator RESE/ ausTANAELE DEVELOPMENT MNO “nan cog ge rage On CTC pacar sey 2 ee ee aor eensaonrresecrtea- at cea ONS 3 wa agent resnse- Eade nH _RANGFORMATION #ND EMERGNG) egress PS ren ‘ater Tag TE gen mr ee OT sos ret remrey ies sma canon Mase neon reer encase nea ee ety greet PI ue ag anes aE"
    },
    {
        "image": "research2_synth_13_aug5.png",
        "label": "researchagenda",
        "ocr_text": ""
    },
    {
        "image": "research2_synth_14_aug1.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORITY AREAS ‘AY, 2026 2027 FRON Katherine Wiliams, Ph D. Research Coordinator susTANABLE DEVELOPMENT AND ENVIRONMENTAL CONSERVATION ‘come crags asain Stes Coa Conus MSESTE a rar nara ser Comm Sats a8 SSP BIT TS MENA escent tea Ten- tse ave aon wena wea TOS ‘cae atria Enegy ence nrg sgn a CREA rs crear zey PR Wa AOI BEY NE reiny oie aS ceseey areca eames DESO SAR cxgrenaseconpstrg a or masa eens Sa cans TAY ie mrearann mein ens eet cat 3 cjpereonty nda rary Preto prc aan ee 2 fern sey QTE AI 2 eit TO rsh Seoue iis aye a DANES rage ‘2 eastona Mcng and eras Pramacto)~ DSN MIRO fevedes Deveopneett Sand META EIGN ODS st arnen ana Fon Say Manon asset eet POT tnyesens nan toring ares os ronson yes EDUCATION, SOCIAL EQUITY, AND NCLUSNE DEVELOPMENT «move ag a Meme ERE ONS CH THN NT Grceeterare Asesaet anges ICO 8 NCTE oreo Egor ree FFI MEF E NERTOR PPS FSSA peseitan. Gone equity 2nd woes coon PIPE met partoowiage- Enea a et de enya Pie Sve ANE MEO {EXTATION TMELNE AND PECTED OUTCOMES eso neimuevetes ve arenyex prin amd ropes een E22 Tans Te cares apes he sara DVS CRS SOE ELE, ves nese recs re De OY tage sacs conmaty ress 3 poe ‘pecans rept DE. Se TGS SST FE SINESAT anager) Soca aed nex oan a MeN EPEC AC"
    },
    {
        "image": "research2_synth_14_aug2.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORITY AREAS AY. 2026 2027 FROM: Katherine Wiliams, Ph 0. Research Coordinator SUSTANABLE DEVE CENENT AND ENVONMENTAL CONSERVATION Cate Chae Asraton Sages tr Coats Cones aring sens tra asa So we enaatnt nea eecrcton- Donan wey ton apcsnrs asenaeras Eogyencny msang amin miconrenes"
    },
    {
        "image": "research2_synth_14_aug3.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORITY AREAS AY. 2026 2027 FROM: Katherine Witams, Ph 0. Research Coordinator SS HEALTH, WELLNESS. NO QUALITY OF Ur |. Commanty Heam ard OsaaePreeetin Novconmacane, (ages Nana a cane mn erveredconmaree 2 Nuria ae Fons Sc Maren meta and reer arans ingests ean try manamee poate aera EDUCATION, SOCIAL EQUITY, AND NCLUSNE DEVELCPMENT tetsiallet haps psp atispiadentciiesietanioene aes Ree (Sve leary Assert sages tr 2st cam ts senoomet }- Devaar cnet. a rads tm at OFS maGraN CMI pe ets au reveaton- Gan aquty ad woners ean prtopatn 3 tea Govmrance a Potcy Devecprt Prtopaygoverace ae cont eget nice ene movement (Ses Eoomoe anes ie tema oa onecaet \\.MPLEETATIN TMELNE AND EOPECTED OUTCOMES evarcn ject sr ase pry eas wil be mparid oe 2 Peer prod win ad prsyss evs an eat re ‘ges ste communes acevo gant apes uh fe Sutarase Deveapeet Gost (20a0) wena rears prone, ‘once catcormes Pan research ap. eveape Hoge anna poy come Fare omy rire sc ene rear coker wm ons ero mata"
    },
    {
        "image": "research2_synth_14_aug4.png",
        "label": "researchagenda",
        "ocr_text": "CRISTINA peeLorHeENT 80 me umeeiEETR, cone ee eA AER ian Comet nme Hy a ovegepenes tid cranes Cerny AseNr oe amas Dane ty iene seman ee aera cee OE EN a ane Teme gn ates sense, Basse ew 090 year Sst masses Bara etamny ncn Sage ng soetonsy 2 Yn tanger ee ayesire- Seam tempera 8 a ae eres a SOIT: Petsronienrow At aueRseiaTeOMoAcoeS Lie Roars sustanratant ese scone Rersjertenase ane i ec tea nga ere Tae Fasdae ates ate een Fane ae OT eM: eena- ara sencimatvans mer noamet: ‘Stee rata enzo ce neva momen Asoo menmaarmswni vaeee eee soa Hany. Rene pas se nena tote ee ary gence Seco gt Wetton hasceceae 1 Sonny ae ant se Pet Se atet etemeorrenroras. teks an more ee rtraeen ‘weg Sizenx aml amatnsinunanewwnsornanes forcast Wie Tensor iawn eas cane AQUCATIN, SOC. RUT 4 EE CEreLOOUENT Sree Teg a eanas sae rmsens omearnrtipnar iecanermmmmeen 2 asa naam esc Ny Easement gare etgnaneroetre. geen sexi os recut PR nae seman stn patos RULE TaT 8H aeELR AND ge eso grace on omg Eom gee eo recur 9 rs Wo Rotem UR Ee we seer aes 2Prte ye pees rom mye tena Bas cz Stine omarase Semen dose !804 ermine sil sidinionanaccedacat eee ee poe Prins ax sracnsreemoatsmisan th aeat seormire oan connate anv senmsey"
    },
    {
        "image": "research2_synth_14_aug5.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORITY AREAS. AY. 2036 2027 FROM Katrerne Wiliams, Ph D. Research Coordinator BUSTANARLE DEFELORIENT AN ENVIRONMENT, CONSERATEN Conn gy Aaa Seman Cama Comte Maman vw my eer mame Seer Fay eeregenrn ear Seay Comat So Ba we ONT, 2 Rermsane bw Ser i ee eoaap Sou pone amas 48 emt Do wr Ta ATO amma Dep Rowe nou me werner 1 emt apres rats Caray Pate na ean ejay mI OTp: wt Como panes tame nape re ee) Fae ars 1 DaTA TRARSFOMUATION nO EMERGING TECHNOLOGIES etton rargres ro are are NTN Aeponr es APSA pm man marae. Prescot ert ene re erer SLE pap ram Ye pa Ome ee nace many Aer eam avery eae OO rH 2 Cpe sr at Pay Pema pre mcs uae 9 payee ye oa Ra Ser oe) er ne no HEATH WELLNESS AND QUALITY OF PE comme mas ae Daame rearten Na conmcane ame POE FEN RS A BL SR eam ara re es aT RO roche Teng aay ero ENN SEN EN TG MORN IY I PD ceveaene Aamenet mage DC ae ST Sona rows a cammaty Enponerert- Uvenent ayn MAPA HR ON PRE SA peeve ore at we wae eee SET 2 ee Goeerree a ey Deer PS IOP CORY RIN: A AR SEY I, ommpen. Cooree ames pay RA a SRT \\V MELEMENTATION TMELME AND EXPECTED OUTCOMES, snesare prance sr eae pry 0 be meer on Tr pra a res ne a A Spree como nen once psn ere re arene Deeper ae SOSH Sw —"
    },
    {
        "image": "research2_synth_15_aug1.png",
        "label": "researchagenda",
        "ocr_text": "2 rae Tye OE CO ee vpenve. beamemagarnn meee"
    },
    {
        "image": "research2_synth_15_aug2.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORITY AREAS AY 26 2007 PAGE Shannon Wee, 2m B raeseaith Cocidinatr susranes inet cua niet dean Cette Quon Sommer vinedtty misminECE MERiCeE Desert ORY ssemmgasansia nse Hass. Corsair cnce ESL FETE YOM LITE Eonenaoe Day Ste at Gre Ten 2 FR OCTANE SH EAE TES war Bn APE sot rianeos. Seng tomy ang np aoa ave Masagenanacg insta tener Pct waserongaon ata Spicinee toisvenarayeret ate RNS saan Ste aeons tan |. pete stag stare ce Aga pore APSARA SS HO MESS: CEI HS PL seat neterscee anrawr- Noha BEE MSLe Tea gE EEE opis sna tray Pueonstpevmet tabieaeatens Nxt Berea Wet ena tee anata seen omega Alena su seman urctexenonenutter Teekam ease ant rareacaayy- Deore enweONG Aras Net Ende BA PME SS ED sede tere eine ne 8 2 osesor Fea Sry Aaranis een neva goes eaten ete vegetese- sane mo noar sarcueon ane sy eoucxmen |r Yasorg aurea arceee Ohtani anne v6 zeew sane cnet Cun pe pg oF Due sane messed sraEgeS it Heoetas whee Ges mutans Crum err prec egane goaysreginn P sce Sorerure ru rey Cece FIAT Yen NY AGREE KE Sy omapie Bysuipetarat ory onan re apn tng escorts ms av cesta gate Hg ob Haas ee goose tenes ecaee ows, espe anaes Aa NOON BG"
    },
    {
        "image": "research2_synth_15_aug3.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORITY AREAS. AY TORT FROM. Shennan Yai, Pr. Research: Coordinator seustanamen VELMA AHL ELONARENIAN oon Sorat cane Aeon abs te Cua mn ERI ENE ARI NaN Dono eoyE vronsyitess to naira os Samy ase cr usp oinzerstse 4 Rereemie Deny oyrens a sen Tana -Dee pour geniemen ne nae Shatin mae ery en atone ase aire Egy eto oma sm eater Rae arg ir Demy nA. epee eS astovnen: Segment) a ase rae ODEN, REISMAN Mn SHARES Teen |. fot vgnn a aD ery kgs S gue ST: same omnesnrosion eit Nae ae cea stoi pecan ne rtspeaet- Base ma reese 2 Sisal Te (oT asa ele anatconawR eines) ene eae Ta AK SORE: KoNSeN a eNRA RINE Mae ae ay 02s Pas RG a 5 ener Ducks 08 paymeenar st mata Wann oc 2 gone tare SEAL, NES. SURE Lcenmy tetra eae eee Sn FERED Se SB gas Ml AN Sate ean eaters 2 asters aaney ncn Seong -Cascract fteter emipnert aeminesina etn rae |. karte ax esa te arursim acman st insreewenan ane Deins SS heron ang a mapa ne neg ea aoe Shy a any Een nis nese enspusee ie v ubLeane, se Uy, a DEEN ana Teac ae sarap eraag mech casa A Bee ean nite areipam Inca oe esa Satna aco ay Me 2 sin ea traces gee MO Soe meena maar oes aa nates REPRO ence eguy amnrnasextararotan 2s verano: fry Coomera JOTI oo ERP Aete Mane eta frau Bornes yey Way ees anand ‘y asseraperare ra ects cursos Rr te ey we Ws eM eNAL OB ERam a th as Hares os Srges somes my aes we eega eats Sn re adteany recent eae ooo exsinentc er pune eee pnd arcona min aootaasent pees ace Ports Stren sass cya esc attire mo eeeoNa emo Sea IR wean Ra aoe eRe"
    },
    {
        "image": "research2_synth_15_aug4.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORITY AREAS AY, 2026 2027 FROME Shannon Wolte, Ph. BUSTANABLE DEVELOP AND EXVRONMENTAL CONSERVATION 1 Coma Corge Aston Sramges Cams Commute Asana vara arene mane erect ay leary ena y nna suas Cowman cave om EE Bary FE MN 2 Ranesape Dwg Dyes a Gr Tecra «pone GREEN nr Wa cson- Boman ww Po AA saa naras beg Mowe nasa ae mecowncten 2 wate rare rosa tory Pate a reascton a eycny roo Org na comping ua apanse: face rape ne cone) Fae mars DIITAL TRANSFORMATION AND EMERGING TECHNOLOGIES Arto rem ane Mac eg ASC Agere AYOAA pmo ad arrow ck (rt prance ern Na Argan omg ca UNI ee 2 reer Tg (ut) a Sar Spars Sea cana reaches ery marae eT cad peer ap re veces nave Asam na mat NA WO cre 2 cypewert anaa Pray Proton Spr aa cata raft Sane 3 per or wa Dae haters wc) goer ae pa ne MEATH. WRLNESS AND QUALTY OF FE 1 Conan mean we Duane Perean. Navcore ane Sue see ay ATs. Meta TeaT neem eee ce maye Mina ae oes 9 rowers omits 2 Vana Wagore ne tat urvassoy Darran Sra mada pat mosey ERA ae te ade Cerin Seearret gear aze wa We3H 088 uate fon ac) Manus muauet 3 rarverto 3ay ams Devearvet Sire co bo ron 1 ok ingese Vaan areny ms roawas tos panto oa EDUCATION. 20008, EUTY. AND NCLUSIE DEVELOPMENT 1 rovane Teng ae Lary Meransapes Etctveress Sera re re aay Naseem Cute moe ESD cere erry: Asner erage Ew 2 toca rowsen we Comma Examen run ray are te MEME CE POO PONE OT AH eee, Gee enn ewer emer SE 2 ea cowraren re 930) Smart Putco) or roe ES ET UN ron ow) Mae range Evorce ome ig mdse cs one V MPLEUEXTATON TMELNE AXO BPECTED OUTCOMES never ge row Pete ray eat os oh ger ow are ya peat aru aye en En Pate pes tt: cova feet ance pane wipe wh re Satarupe Dewar Gant 2008) ao a ona sore om aD wes mar ae Seece! NoTOOpRL FE TOE 29) ROTTEN Pao Ares wap wes marco By Ro AT eT rE eT ETS"
    },
    {
        "image": "research2_synth_15_aug5.png",
        "label": "researchagenda",
        "ocr_text": "REST RCH PRIORITY ARE: AN. 2 2027 FROM: Soernon Wain, PRO. Renearch Coordinator SET ALE DL SRHENT AAC EAVIRONDIENT 4 CONGR ATIN, |. onan ang nag aes Ses Cums Sera tae ay SO RCN RRS. DO YE NG AS nh CN SNA TR ELEN IIT ET {Berns cry ies sun Yam ara ove eeecatn ns Pace omnes Ae TRS Sasori eng ear any sonar 1 et agama ana Sry te mera es ayl0s868- Bsinccasgenae CTO CNN “Simson orgasm uonpaney erates {Lem TRAST OMMATON No UREN TEENS Atta cage area yp me: eM ghee SR a RIE ea tes MARAE nen ene dren ss angie areas ew oa PIE 2 poe ng t afras Sycen Gnatama enor ea SANE Neen Soret rseg. haya a momen he tenors neon aparece iar «Sec npr ens Smt see Nesctn omnes, ns oun gee samen eas sme emeEn He eaumen suncase tue cesaenpmgiese. sk a wemis NS pan ein we remy rao ators carina Mia an orey een mec Fumarate akc RN ROMS “DEO ee Mot iegrany «oa amine athe tn ORT Aye Senos Sc RBULETEN, CAL SOU. a UE DevINNEN RONG IETINEE AatasSmEDK SR alm ee Zick ery aE acon 12 end aheanan coment emmarert ner Ragas wine Draiees- Cane again) Tamme eee Ea SMS ep pase on oct 2 sou Sora eae var Berea guaanns avons ep DRE Lentme mt ROY MR ee dCINER _ \\ OREM inten TAN ANS ES TEh OUCORES adores Meee) res ‘Bemoescemenety at monn wn ne Anse ae Re Gg OS Sr ys et Fase Desa orgs mers mead oh ice ties tn SOR em gael EEO NE EA, FEMI, am ease naa Seeereraes URS ORL RU aa BES mStar, ~"
    },
    {
        "image": "research2_synth_16_aug1.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORITY AREAS AY. 2026 2027 FROM: Michael Branch, Ph D, Research Coordinator SUSTANABLE DEVELOPMENT AND EXVRONUENTAL CONSERVATION 1. cima crangeAtpaton Seago fx Coast Commute -Asescne vires antec menses Oevtcprertt ey ang ystems hea dears Commun saad late tain paring aineveran 2 Rerexase ry Ojtens ad Gre Tecra or poner eamianon te ra eecrscaton Somaes ney fom ays samen. egy ony nouary ae macau ate Manopnertang Croan) Pac wav reaicon a rejcing haat Crp wa compos nan ayiosnre- Ease maugener arco cause {DIGITAL TRANSFORMATION AND BMERGNG TECHNOLOGIES {Arto rience ans Mazin eng Acton Apowers ays pst tacton ad maragevet Predche ayes ‘Sem prance aden Nara ge proce ra nae ese 2 reat of Tg (Ta Sar yen Sma camp irasrcare as ee marae Sad ren acute as venom Asem nam meng jen ey cre 3 Cypesenart ans Da Prva) Pct pra Gian east nh Sane a payer sens ena Dae Newest governess SL EALTH, WEUNESS, AND QUALTY OF FE {Commun Hex at isa Preveran Navconmuciie Asai even pans Metres ares and even ‘aay -Manera andcuaneamin ureeved commutes 2 Traston Meine stena Parnasaoy Docuverton nage mens airway cacy ay use cet revades -Deniomert sansa ra ane os Nursonan Fos eer Manton atest ant irervrton payans- eee nec to pont rm ask lyases nan trming anes oases N EDUCATIN, SOCAL EQUITY, AND NCLUSVE DEVELOPMENT: |. mrane Tegan Lering MePoasoges ERC ees fered adn earngmoae Cua epee peg aveselenrrs- Assessment sages tem ile eveopnert 2 Socal sun ans Commun Enpowernet- Lenn yams tr margraes cs gO eS Hs us Deseret Gere enya warers ere pTOpNEON 3 Local Goveranoe ana teyOevecpmer Partopatygorerance scone ERIN ee SVE inOVENEE ‘Seatejes Evomoe one py trmaton oa veep V AIPLEMENTATION TAELNE AND EXPECTED OUTCOMES Reverse rer Pee pry at be peer ove are yx pros Wh ara roe reves Sao Pe es ‘ges spect commun reek ant ovecprart gaa alps wh he Satara Deveopnet Gaus (ce) snatonareseron, porte, ‘toe coe ne anne evan pers, oped sages natn ly cones Fane ney pares an esuneresencn canyons wnat ad rierator tno."
    },
    {
        "image": "research2_synth_16_aug2.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORITY AREAS AY 226 2027 FROM, iichcei Bemnch, Pr. Research Cocrainato’ BO RTAONNELE CENCE AND ET RONENTAL COREEAVTION 1 Cann Cpe Asguee ape ty core Covet Amat Sart merece menses eee cay Ser yocees 8 Ret SARE CNN aN EN ARE ZIM BU ONT 2 Pacgname toe Dk we Ore TROND ee Pew SUSE PE SAME a my PD cas Tees Sea etcen, mam NOT wemnD Nae arn Cro IY PARR a PR EES OPE MN NODE TE sgsay. ae namo ze ene eeN EY 5 DITA TRAN SRORUANTON me ERC THOUS At ROE OMNI LUNI AOD A PON AYIOMNS CONT WY NIUDMECE SAADEE Ome orm te 2c er NES BAN EARN YS NAOMI Fe rinthin dedeatiee nen eda dateaetecae meant aeenod Ser ORV RE MMRININ HENLE EN Coe Fr italien iieeaitaaebicamcerem ante chemauataterenaed shane tea Me pore me 3 nae NCAT ENE AD ALY OF Lanenen Mae a ae nA NO CONAN SAE AE BE HN BT Be DY cena aga enn nak a Te a NS 2 aohna searceranata Aamancy DassetoN The manok PEON ha OAR, se Toate Penna Dam rete HO BS OREN amar toc tay Lamas! atm oN WS UPON ORCL NNT FEUDN Syed Sane ar owes tne EI IN RDUSATIO 20 RENTS AND MCLE DE RCN eat arty we ena pm A Pe CNN mW NOE SANS HERE ON oa nares: Ane BRCM EINE Ces WORE 2 tana Psa we Say Boner RENN OFAN MFI MET IR PRE IM SE Frese Onen mary streets nisaewseeer, ieee comema mse Dereon BEtCp A) aaarred a MN oN A Aa NEN ere ga Enarep esi) BUS MS SET Vy RURERMENTATIEN THUELIE AND LOOMED CTCCAMES Pee nga ba OS Sa mre BREN RE TANNA aye Nes Ee ARs een oot: corey Vane Seman as MPLA REE Gana Dem GN TALE REMI A pum bigeser woe veica peta ne SCE nee eG eee RIgN) MERE NON ORET E OCR PE Lene Om ANAM NN I I NE"
    },
    {
        "image": "research2_synth_16_aug3.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORITY AREAS. AY, 2026 2027 FROM Michael Branch, Ph D. Research Coordinator 1. lone chagsAsvzon Sagas Coal Conmiries- aces ovina andes meshes -Oeidoparttexty Nang sjsens tx raura dsabe s- Conmurs oxeicimae aaron naimseneraton 2 Renan Energy Stans ad Gren Teo So pone cemizon te nea decision Sonate ene Ton ayo asemaeias Enegy oan noulangcesgn demi {ate Managenan anaCrouar Soon) abo wae raison afrejcng innate Orga na compan tr aan agicunre Ssiase maugener narecoieytvaumemaeas 1 arta mages a Marae exngAplesions A pmeresayioua pest escin an nnapeve Presebemayic5 ‘sen pertranoe and rerion- Nara nage occ rca ngage pesavaton 2. meet Tang (oT) au smar Sstns- Snatcanpssitasrure nioney) maragener- Panel ress aycutemd lnannocnanirng auamsaaream mentnngejeene ade eae 3 cjsesenty nd0za ray Proacienctpesona cain easton isto Senegal payer ssn tr sal pesos Newer ses tgorermer annie sevoes 1. Commun Mean au c sase Preveion Navconmurcaie asa eieronpoyans- Mera negn axenes almeverio sraages Mazra andcnaneanin ngesavedoonmunses 2 Tastena Meson drs raraztog Dosrremzonstnagenss medica pariogniage- Enea asset ste treo revetes- Detsonetct sandzazednena mascne 02 ‘3 Nursonana fen esr Manson besser ana votonpoyans- Decaven fnaeree wodprens tm ost Inyasers rmav aming arousens nd pomcion sis 1. marae Teng and aaring Meposnoges- acest fens ag rinearing rae -Cualy essen peony aveselannes. Asessmer sraages' 2islcensy sls eveepnet, 2 Soca non and Commun Enponerer Liehondpayans te magraied secs ganas ales rs aoa pesovaton Gond equty andwaners somemisparpien 3 tora Goveranve and ley Deisepner Partopnygpreranceandconmunyenagener- Pio saioe diay Imroveve stages -Evoenoe ates pay txmusiov sa eveapret ecexcn qr nde erry embalmed Prana oeog win ama roses revene Ean mena 82 “ages speotc commun nes an cercover gas ales inne Suarane Deiscpe Gaus (SOGs) anata rescn preses. perasosces ns peed esc apes dene ees and a zON ply eoanMeNatO, Taney proes snsesanlneesencnclzpy ion Neon 2 mee sea"
    },
    {
        "image": "research2_synth_16_aug4.png",
        "label": "researchagenda",
        "ocr_text": "RESEARCH PRIORFY AREAS AY 2026 2027 FROM Monae! Bran, Pn Research Cossdinstor BIST NE IERLOP OE sees BERDOUTA, OBER ATE Come can Ace ged es CONE: HUE RO a Zt DTU N Na Dee Sa 8H NRE NRE SER OEE OY IS Me OE 2 Prewast vey trons amon Tecrny «SY aoe er tmaNte a wesmtea: Bens eary/ Oa NVA ete nana tng wears mae gong mncceeean ee Marne Crs Razr Pah an BU Sar NNR: Co wT Cay RR Wenge thane nopeU mae Fsane mara PORTAL TANIA NAT DEAD ARI TEIN I re haan belcoumteaateoteastioeaeemaedoaeraabaeanatcameainead art petenaa re etn Mare Gap iC Quay tee {Eorewte Tg tea neat tr ora Gna anaes MeN Seas ERED aOR nen ma AAR mg rT A NITY CR S oymenecety Samy REARS pM OO LTA INR esUE CL CaNRE NEL Una Daw NTA AE ean nhs SHO WEUNEID AG HET OAS Came) Arr Ne Stam Preven nooniemse Simte pear 20% Sea rem Bea ee Se semapan- haar amiodarone eat 1 Tralee agora wana Pons tay Saeouaeen nN PN BT NNN. ee MOLINE SE feats Cree nc aEN AS ater we Poa ane ANRC EAMONN FEO N UP EDA ASN ne ey Aim ea tras eam EAI \\y Reventon coca RaUTY Ang MCUIEAE SE B mre: 1 rage Tea aes tet aa get «NAN BHO SH WE HN NIN CN ARE A on ser: cetera PN NEY EE 2 bug ean aa tame enaNeeet LEM ESP INES PSPUAE: Op NE A FE FOCI A Poses abe qa BU NY ENS 9 sa Oncruann any Seema Ret gore A NUTR EAPO: NESE ise mW ero fo imge Sov em Rea mato Ya AT V mecueTAnn TWRLAE Wc Bese QUEUE eens te ova Pa (Oe) eR RDN BUFNN A ptm AUK Fa EPR ae Nar ea Ny mo A SOT DLR D Ga vere GoBN DK INE mE coon eras cuore nim narnaarmae PR eM WANE ANE BO DY OTRO SEEN NY Die nies a ee ERNIE AE we FOMNNETS OREN"
    },
    {
        "image": "research2_synth_16_aug5.png",
        "label": "researchagenda",
        "ocr_text": ""
    },
    {
        "image": "research2_synth_17_aug1.png",
        "label": "researchagenda",
        "ocr_text": "FACULTY DEVELOPMENT PLAIE AY roma? ROR SoM Oras, PhD. Acadamic Devsiopment \"esd ranarion CAPAC BERND 1 ae GB SA RR ORY HO I REN <A BE RAEN ARO ACN icra se rseay megs AA REAR ARE AO NS HORT RENO IN ‘2 pence re Danone bape. rena oman Fes mca ars mena JOS HON EE RIN OTE or nese ee nag SE METTLE SEMIN MORTEM ORES EAS 2 Rasa CM ADO ANCA EA BET PH RSE) PHA HL STE Nennare ort aio er Se A AOE TORNON AA IAT MS NINN repens BCL Ae REI, EATON We ORC PREROHUN, ORM A A APNCEMNT pneent age BCS REA: DION ATE SATO EN POH AA AER REE PE ceemeen eacenge AaSONA TON ESA APN «PRA ON A 1 ay Bacay aay BOS TI HORNA SITE ONE RAE SORTA TI arene eoorene pape 8 TEENA TIAN: SEA TIMES OOM HEY ease NNR Ny RI POS END EY 2 ncaeory ne seraqenes Deas. Rear’ papeeenpeceresbe ee ee (Saye manent ne ee mu TSE EY We CATON AD CRORE RAST acer rat Cement BN NAB: LAR OAS ION STE PED SEE 8 AAS Leorecmqnannenncan renaming Rt RAR ESAT: ROI MIS EASE RIS oem camara pity Sane an erage: 1 recnenay TUS FON ENT EET AON aoa et aN Sua magrn tet NES RAPE OLN SONATE: CATE V NPMPNTAPN AnD BRC EOIN Py erat ee CORLEY IEE (oer AON OATS SLE NNR OED nova nme tn MENS MEOSEON RO TERIOR ARNEL RY SES rae POLY se TEE, ee ae Fam ety EY WARE REED RIES"
    },
    {
        "image": "research2_synth_17_aug2.png",
        "label": "researchagenda",
        "ocr_text": "FACULTY DEVELOPMENT PLAN AY. 2026 2027 FROM Jett Diaz. Ph D. ‘Academic Development Head RESEARCH CAPACTY BURDING 1 ewarey Taney ne Wrest Ravan eeronsop ae ny Mrarverent arte gant a ayes MT espe wry re nascar wramget Reta ee SONSN CES mn Car pops arty tn Hey 2 Pancaton we Daunte Spo\" rar an 7 mpi mragreet: Josra veeton emacs Few bee es som ai pR Re mareM Comer TEER HN oneTeT Meee a Mea Ee Fy rorialeeaatedbaleonadeaienabdanniernatenued tietonaetbadeeieatateedaa ee mars Ae Se eT OA) a AE a AeaE Sate TES nae |. TEACHING EXCELLENCE AND PEDAGOGICAL NNOVATION 1 erator Dont Crane Ate aay Sangean Aue ne eT NORM CATO one a case anearet Une feos MOOG OA. ORES maT to Sore a 2 Orme ne Braet ry Conoenom ary apr eer A Decor Fags ary a= ee emia re super geet Sea Re mea MG me OF aE THR TOR 2 recast Sean rape ome 9 a COM Hg nD ay MN owes aay tes ames MAES. ron Ma yy REST yaya Nee rE eT A See PROPESSONA GROWTH AND ADVANCEMENT 1 AsarendDayee a Cette Prayans Dep ST Ong compan: Por THEO Nowe Pom reac On reno Tay ne Hy pM onc TCH He CCT 2 at Ear ae amy) Maya Tey meTTe Nahe Une Rese Re oa ae renee cote artoak a a BI Ree atte VI TINT FENTON Fa H 2 ar re iraq Devearvet hea eaprung a amet to Fay: Sra pay Fe aN ae tape mace RoR. Tar Bay FE STR! EET. Cae rape Fe MOET eS 0 XTENSON NO COMMUNTY ENGAGENENT rarer Pa Onvecrt ae Marea Consmy ek mamma ee me PUTS Ry ROO leone ec pert REMI a eB PE UB MMOL A NOTE RE IIE DING 2 Tecnooy Tare we roto, owetatan sree aN A ranecad Fey oN era Prone onearret ae mart ity: Bare EST ENS hem COT MENOOR EERO TG IMPLEMENTATION ANO SUPPORT MECHANS aay searretttes o b gare raup ces My can aN eer Paro merce Tay rE coteren eopte nema SAOTy ee RTD) MT UE) UN MIO TCA ET, ‘conto eames rasp meres a BEIM er FIT ACQUERE mo eT adore mt rT geek ean marca pera"
    },
    {
        "image": "research2_synth_17_aug3.png",
        "label": "researchagenda",
        "ocr_text": "oMREMENTATION AND racsty Seca reas, engin ILTY DEVELOPMENT PLAN ‘AY. 2026 2027 FROM: Jeff Diaz. PRD ‘academic Development Head FACUI mocusp tomes neater rarer SE acon wane ens OU SOS oe ees west 1 AN res OSS ana nays Sey wing eters 6"
    },
    {
        "image": "research2_synth_17_aug4.png",
        "label": "researchagenda",
        "ocr_text": "SiTY DEVELOPMENT PLAN AY TT pata bet Cine, PAE. _neonine Baesicgsoent Het aie cneaagn CAPE ADAG neice ae toseegees Spm ura I RO sro nvoevnsas nce Me EES A ard eich REA RITES AMET psi ee oan REY a ean gen ee MTEN een NES ek ISL AE AEN I pees es Ca RENTON CTS pros cana secur’ somemed POS ease a ae AE HR: RMT pea es TEES Panne AACN encase eer ACe PERLE wn ene EEN GINS: ep Ucn BORMAN screrwio ne DEN ee nnsnecx ear nese inn ne Siopaerneseccemeer Uaaat Fe me race? SAEIEEET omer an tern Ses ONE sre many EN vpn ger Se cea can eng SMITA TS preter NRA agin: TIS ge ne eG POET CONE AES amensmesapareesegnsoreik CO Nee ene SE ION NT supengeoes ace sniss a0 panes weer aces es 8 SHOE Lae RF ARITA SOMA pet Ss PR ICER BE PSE S nonmans ope nove rayae: etasan: RTS RE Cerone eto Tre rom enaymcenae srmeanorcane pez gon aca PA IS ana an FR SSR EAS SE Corman pT” Lets masensoRar eT OES eal eons whence SAIS sox gers 0ne9 Bong HOT! ANTE asa meer OOOH ane eae STATIS ‘pagan arms aT po eaten HD STE AEGEAN sees xr ans REIT AT UMTS TOS wane Pe MERIT cna ens SANA) OY snes EN a IEE NAR tear tocrarrentian reat aang vaeS= OMY AEST LAS seacoast MACE Satine as rem GI WOES soaepstaannansng sen mae ed nas EET AE I: Tnarerren aoe goats pees neonins oe8r, «see exit orca sero FOR Sn ape 8S NIE GSES eeamenngn mos oe MS BERELA SS EE rgcten DO spe seam raven eee ="
    },
    {
        "image": "research2_synth_17_aug5.png",
        "label": "researchagenda",
        "ocr_text": "FACULTY DCMI AY. 202 FROME Jeff Oe cadens Devenprisni Head OPMENT PLAN Fesari tracey ad ioneeps- Revenant) ly as BURR EO a DERE ng pc a8 ROSEY NE Ae ITER” IPN WE MISTEES moyen ra eo acre cas a9 aR ANE RESENEN NB? sarang watrecna SG “an: Renn une toa ease eager ceneamet Veneta rR NONE, MUSED aR UT Et iranen cyano este supe sy enon Deere ra eanivg santas on SomRSsupeenene Syera ey aN MO NANTES ig I ONE la sasragantecuetsnaites Sertoeigetcs mccanoty aaggeney Pete aw naw oe onianno bape scutes Sepans. Sar ier aap 12 Finsy Ba mae haere Fanny aac nga aro erenar ne expres SE) ET Be OER g en US RN nage cry anemic a seovciog Tee Beton ete se Berane RE} AF RONG, eG AST et DPI IO si, Tas aeenecne ree samp:"
    },
    {
        "image": "research2_synth_18_aug1.png",
        "label": "researchagenda",
        "ocr_text": "FACULTY DEVELOPMENT PLAN LLMESEARCH CAPACITY BURDING mevare Warg a Woneps Reser eI nam rg we seta oTaages- ROUEN AE oaseraton Sip rarsarch yt Mere a esprane Coen SST HS aon wa Nene EO EA ervey orecpeet- PO S04 ANDI 3 Rear coin ron ee 1 creat Bayes ad Cetteston POM rcntonvok erator YM a) OPTI 2 racy aarp ay raga Teg aT OE Ferrers cree prtpton- Sy AF an DTA ro oep treet repute co eae Gr re marayevet- se SOR INIT FO rvecgrvet- Resa REGS ASS peters reece 2 -eniens DTH neve cu sin 2 NATE IMPLEMENTATION AND SUPPORT MECHANSS assy onset che we TOS meres econ a ar CAIN ET rec and cen tas astncn Ta rrasprences arg rer ty 2 8 RAK TERR UN —"
    },
    {
        "image": "research2_synth_18_aug2.png",
        "label": "researchagenda",
        "ocr_text": "FACULTY DEVELOPM AY. 2028 2007 SHA Tas Turks. PhD, vee Development Moat eT PLAN neaepese nasser sionG Ragnaen Poeyina sent -Rovone net ses REN Daas QuatiNe ne wh A fase 208g a puna INS Ra EAE i EO TG LN mdnwtin ra tiestectn agers shane exer gam ain pre e eaten cet TIS es estat er oR uO le ETN ARSE Noe een se Cainer manic ANN ree NS CN eA Rea me ETT REINER I ENT RINE RUIN ie Winer ae 1 veut ese lemorgatsans Str ape eee ay Sema ass EMD Sian cert i near ea Me a a EAD. Dan eteN ahha ewaeanes 2 ea aroneniiacary omens tearm ger ite ane Demian Rayan Nk Seneca gato Snead Boat 23 See sorotawrmy reson Pclesnaes am DES ang Caer ve and ase ars Domenitiarm ges testmneoni even anGmoNt exaye et AElinion BaTNManA A See US RETRAIN EN |. Posed Sager anc cette eng. Ras cca agin beapai: Secacn sess eer REEAE ‘cam en us ann era HEU we DE {ay ares a tery gam Tsetse ARNE KAR Yes AIRES Prana onesie Sur Te EEO Ah MELO we RO S cexierg regent eebaatan Ai ezmeurp aN a og SPA amy a OO A Sap anigecns en cseacaaEXEO- TOMS NOM ORR. Cp ache ma SO A CORLL ENGL Beran ti gertmasmen atinngere cunnay mese aeeY met Sa Caycon a eS {gM Fe mB as AS a BEFORE A EO 2 eemcony Tae nc rater ets NENA eR GORE eS Dy TORE a ECE redeem maria Pais MsEana as SEN DUNN NENG RIN RCTS PLEMENTATION Wo sone ecHAES Pisa ceatcave ain lta ara uN ea NNER a eNleaR HaMiN MRE bag Scenes REE mE Mm ee SONMM MENSOGUY ont a, UE RW BT EEA ‘Sats a meres trcxi anne tre RO Sat, epee ES EH een was NaoeM Ne 2"
    },
    {
        "image": "research2_synth_18_aug3.png",
        "label": "researchagenda",
        "ocr_text": "PROM Tote Acaternie Daveconent ie dL mesoner aang oN enungmiet 9 recaen Sotaretin TaN: MERC ae Speen ee eae one vases ar co perigee ie ZOU E Epc oume en apeten, Snore TRY coiscaaie ana oneraniexnngena soca 90 NBN ma rary eeNET RE onnyace re ae enna siti AC COME PTAEMEE BIRT AIDEN p sseaMyTavecn sig EPIRT ae sesap oucecpna os geese"
    },
    {
        "image": "research2_synth_18_aug4.png",
        "label": "researchagenda",
        "ocr_text": "FACULTY DEVELOPMENT PLAN AY. 2026 2027 FROME Tara Tucker, PRD. ‘Academe Development Head (MEBEARON CABHCTY BALDING ere Tay wore Aaa eronaD A my nan are gar Oa ay apr ort ae paneer Sage ReaD eC we RDINN CAE mA NS wry Ly 12 Pencton we Deron gp rar a HBO Ie aN JOT Wet MEATS FEO (pew resns ome O0gson ara CO FUE Sea: AeA eM me 2 Reser Conan OMG ERG PE AE GIN SNC) RP CIO carers mre Te ae: A ANN ED RAR ROD ANE ENTS TT (1 TEAHNG EXCRLLENCE AN PEDAGOGICAL MNOVATION erator Dent Brunner Ate aay Sanya e caar enpnet Mame He BER CTO nap a cn sneak Ne SLES MOOOD HE OA OARS ATI Sow TY 2 Owe ne Bert ary Conperoe LarTey Mayet str LIN Dee SOEs ae a= Oe eneet ncaa egnpnet: Pore Fe mC ra MAG eee Oe IY A MRO OO 2 cae caer Lary Aorsares ramen oes 9902 es AY C8 FE SE A AON iowees aay uted oma ALF an ASYM NTN RRR TT US RE se PROPEDONA GROWTH AN ADVANCEMENT AsrendDayen ns Certo ayant Sp Ss Ong congon: Po THN NO PR cana wore rarer Tay re am re NCHS OT HN CT Panay ary me ay aa TaN METRE TN EE RON OE TN CS errs cote tops sy BIE FS RNG Ny PANN OMS 2 aor ne Mirage Deseret Acamres aang a amet en eG ag DUTY He oy N= (any cape eenrce RoLBeN TARR I PB eNO COUN RN ON TS Wy EXTEBON #00 COMMUNITY ENGAGEMENT erwon Pe Seager eae Comey ne MUNN IEE PETE NG FS RO cgopnet Pan mee FE MTRTG: ABST IE NEN AAO H MAES AEE DIT 1 Yeoman Tare He OB Oo IMCL ANT OA NE TNT RAO mE pone oneaonet nena May: BAN MOE Be SS REDE CON MOON AERO YY AMP. EUENTATON AND SUPPORT MECHAM ra coer hk 0 gpa rap ns MAG CA VNR Rc a MeCN FANG Coerecn pt we a OE NNN NG HU HO OG MAE TCH cm a on eames raup Meme RERCA T FAT ANSETON TONE OY HN CM eI ge eae arc aM"
    },
    {
        "image": "research2_synth_18_aug5.png",
        "label": "researchagenda",
        "ocr_text": "FACULTY DEVELOPMENT PLAN AY. 2026 2027 FROM: Tara Tucker, Ph D. ‘Academic Development Head |. Reveren Trannys Warp Revarhmemoasog/ anon teeametas- Qureane na qartane aaa ayes SS scart an pascaton ages Resexe cS SSE aN eA Ga opsa wg na neTaENg SS {2 Raat a Discennson Sapte ese gat spseson anc manayene- Jara salina mast repaeon~ Pew even roses avian ar respres- Correa resets eeganert- REGS np MERRION NES Revere Catnron aa Nery ston pr esanch Pe Merson 2 rsa oo ‘rato rent peri eer a acaeneresen ages- Reser sks Nato MAREN ILTEACHNG ECELENCE AND PEDAGOGICAL NNOUATON ‘tus Ss Enarcene- Ace eng Sages asc engagenet- Aces an ein eign Cres cera care ceopmer. Use enzaea tmay ansagta tae Omeeaad meron dveveleanes 2 nme ante Leary Competes exrny mages Azan Deieopnertt gta leringresouces Ortne sone nd sie egagenet- Sorina a apy acing seeps -Ogta Iay anderen crise 23 uate Corres eran roc Poe sased poe aes aig Calta abean compra aig meas ‘perenne eason- Sere enin an commu engapenet Reecon ad meacoyie sl Svea \"PROFESSIONAL GROWTH AND ADVANCEMENT |. aocrceDeyee an Cersteaon ras Sparta ocr capes agen Pree certcaon a cere Poser sen cps eaters Yanga opps omsated Werte elle Cetaton 2 Pay cane as Mey aan Teac genes nr ree Reach ves acters pre \"tere coe popson Say rs ander ee Veg ee masa Bayz 2 zp a anpever Dever Acai laarep and ainsi ¥arng Sratge saving an okay is ‘yet marageer rece aoatn- Ten lay aca recat Chaye maupenet snd ran esp. [N BXTENSON AND COMMUNTY ENGAGEMENT |. Ese jest Deemer and Magnet Cammy eek messmo e Print ep met- Fast npeneton memory Moke nce Reson asizaar nausea ey 2 Tetraogy Ta ancimoiton etcatntconmecatzase SFO lec rope recon a Po eveopnet anc mart stg uence ean ae nae ipa Conny may aston arin \\.AIPLEMENTATION AND SUPPORT MECHANEAS Fay ee ae a be gen ro eas covrees esto 2a ating herent Ses wi be meares rou ered resent jes, stn ascncenettongne rns nga fr esench aceon tai asa ag and etn Ser ty. aareguresnack and pertrmance wan, Ora a ens, moves suo comes. sce ein"
    },
    {
        "image": "research2_synth_19_aug1.png",
        "label": "researchagenda",
        "ocr_text": "FACULTY DEVELOPMENT PLAN AY. 024 2025 TOU Dana! Bennem Ped. Acadome Development Had REBAR CEREAL 1 mama Dane nO Rane? mea ME RR MINIM CaN BRU EN yee RIN PORERS EOE EBLE OR REF MECN EL EMER COMTI CH EE WG NEEL 12 Barca pu bseuroo: Maat Ser REAR TE OREN NTN NINE Ora INCE ACE LE few tare oman pae mT COMER BRE NN CUR: ASAT DO YER AA 1 Resear cata a: Siar ae ang Pane NRE Mars aro ae Para ders eNeeE aR ONSR: MBN me NNN 2 Pg Ren CRE NETS NaH I TEACNNG EXCLINCE ANG PEDADOSIEN BONN Tit hekinaconneniedatiacebonakauaiionerebieniemea ima mp BC eaNEmE RENT UNE HARD MEMES BRYA: DRNNLINS RST SoM AE Pda alien Leeesenttodus kemcanaieaatannadlteeeeataiieeiieenatad neces IM CHT YORE: NEAITON FE PETAR MONT RE CPN PRIMO NEY 2 uae Cer Lan He Pe BE AO em OAS OG OMIA ORS RENT OO SPE ERR ERT BOO RIT A PRSPEAR GA TITAN OMENS 1 Moreat Dog a Castter Peis Rep Cues mye CENTER CRT A sees He PRN Pore ET Sa BNO SDRC SA BCR 2 amy oenaae Nah Reyne Teasry myome mero tate Rea aseORTE PgR terest Steen IRON. TAMING AEE ON a ORC arise se rane Sevecynet- seer enn: eS Ane eT Ya Mans pmE RT ONCHNN TOG LS 29 Maggot wee TH Ady BHT mE ONIN WOT ITI NTO ND COMA BABI can Dotan EMG: CONEY MO RAYNE ENE ME FENN BAD APE CIE ES EER IEE) MOI NERE TE REE, ROGGE NIRS EEN IANS 2 Meoveny/\" amie we ronan amen aye ONT ONE NLD FORY pun re rage Prone eee Maton Web Da as oT MET CORP, GONE a em an, RELA NTANEN AnD SUPBRI MECHANN i Lentatataee title cunmeiinededciema eek inetaateenmiem eaten be” Stew ye mc aNnSR EY CARTES RoNRON NOTIN By ey DOU AEE MARIA NE ETA neve we emcee gp Pera nNOS wot RER GRR I AT ATE La ecm maps pws surceree bige"
    },
    {
        "image": "research2_synth_19_aug2.png",
        "label": "researchagenda",
        "ocr_text": "FACULTY DEVELOPMENT PLAN AY. 2024 2025 FROM: Daniel Bennett, Ph D. ‘Academic Development Head 1. Rese Trang an Wonshops Resexch mension egy saves curred quan daa nays gS ‘pease wn a pean Sages Rosen eics rs respnse cow resea- Ca pops Wang and nea sls 2 pimtcaen a Oisseminten Spar rsa resent spain andar Jour eesten ema ep Pas ree roses rags au respses- Consens esx tls evscpvet Resanch pax MESSE Mees 3 ResaxcyCatanratn an Netorng etcaen pea esac aera rns caenerzens- eran reser prnei cerscpvet- nasty -a aone esac ncages- Rese csi ion 2 nTaeTE 1 nero Sle rence Aotilearing sates anak engapent- Aces and eran eau Cush eign care ever Use tees roy ar gis Oreste stein verselearss 2 one nace aang Compre Lexringmanagenart ssi zat -Detdgane agi lexan resarcs -Ontne ‘escent and eet egagenet Syieroni anf anynevooi eaoing ergs leary ndomatan mag lle 3 star. cenered ezrin roars -Prosen baved al prje asdlanng Colnrave a compeahe leary ness ‘spurte learng and teva asa Sennen a anny egpenrt Reteton aan tl AGRE |. pasacad ayes and Catestn rojas Sip ica dayesconleen Prfesot esion ations Poxt dort reser eonsrips- son Warr rsh Oprvies- Speed ea ls cea 2 Fant Exar a Monty Poyans- Taz sigma parte Uveres Resear its awoatarabe recs ern eoeene paren: Stee brat aces Vg reer antec rane 2 Lessesip a Maragone Derdoanet- Actomc leaders and aminstatenanng Sraage pang aceon ls ‘Supt managener ares loston- Tea ur aoc ression Crage nape ovat aes exten ret Deveepmer a Maragevet- Commun ness acest pre con Parmer nulag nd cence ceagenen- Poet igleneraton andmatnng- pat eran and onrarson Resogve nin nears a9 2 Teoma Taser au vat resto of ommarciaza rosea cups secs ope recon aeimarajenet- Prot eget nave ig Sunes aon andi ipa Comm oy agen nde aeg Fast degen aes wb supra rug rece eng at reser andes rand aban Yang 2 cereres, esate as avast alee, evry seer oy, andrei eta aperomaTe aN, sures wb measred reg eased esench pistons, xara Fa SPRISHENS mrved Se Osco, ines en jens, au sty anaoener ores"
    },
    {
        "image": "research2_synth_19_aug3.png",
        "label": "researchagenda",
        "ocr_text": "TY OBVEC COMENT PLapy AY m2e2025 ROM Recie Genntt Pro, Abia: Carebspmecd tend tien cheers Remast Rite ert SUEY Keane age ene [test eae see. cee NOeaIe a came vere, scabies cena orm en sorsanersmeey oan pee a ee FRI Ee i Sa een PUY ie Sin co sepa Mas epee esa ya oad Mea ete mapa A ss pene, sume zy Pye matey twee bape eee"
    },
    {
        "image": "research2_synth_19_aug4.png",
        "label": "researchagenda",
        "ocr_text": "UL PY DEVE! AYA FROW: Danie B ragament Head OPMENT PLAN, Ragen Vaninga Wonthre- Aen nnd sats nanan Guresmesn aateoneoa mys Bete era Sapper rer ype as reine naan aot Comnseeceotson sy cao Roearonrasmaaunk ER so sergratonrce se cyt r are Sherr aw suet eigipepem. Symone soe anor oi unseat what coranciosrig x sy Deanreninerresesievelaming anna ons nervy sitesn estan mpgmsaenyee te cessor snceare Deusing cette Pepare- omer urs savant naar cettanin eemorn Piette eer ge rion vary mts) rte Greta ark ME 2 Fant Suegeans sty rears Tenzin asgnersnar rs RECT a RCSL pasa sevngacnna su eouet ope Suetmaaran ani onan \"9B UN US et AON Ung oxrg nes eae eonpeen: aesingaenmen as ony ne recone ansmige cee Syesphwlng we ee ny snattevnisananssovnenine emaroumosic arise gat ct ry es anu ever aan non gata mrt ng elec atta ohana perc"
    },
    {
        "image": "research2_synth_19_aug5.png",
        "label": "researchagenda",
        "ocr_text": "TY DEVE CPMEN? PLAN FROM San! Barina HD Academe Cevecinert Head ens: haerovranans socHey: Sones RR atin: Rater ia be enue ee ee TaN rene suns verewus a Ne Rewerrniate taatmenaaweee Soran neuer i Reet eat0 n5 ersem. Sarena atone Rowena aes eateesmasacaer. even ayimgminmmen Oe pee “ions egepra. Cetmcin re ease er nate ea te Se THAN PRON so a 5 RN Sanit eee ict Ser wean estmaruena ae oe ns gene Marais reese sang eR aaay Bw am Harn a PART remit taaene CTO Ay Cometwnrr api See ee mo ge Pere Nat Ss aga see Rm ara waren ORAS acta an Saty ea 10 ato owen amin ncn ar yore ny Mitan yang RB rev aTon ane soon ve: herd sonia eaasvan oaey ee Sree 8 mene para est"
    },
    {
        "image": "research2_synth_20_aug1.png",
        "label": "researchagenda",
        "ocr_text": "EXTENSION SERVICES AGENDA Ay. 2026 2027 FROM: Amber Proe, PhO. Extension Services Director COMMUNITY ENGAGEMENT AND BARTWERSHE OE VELOONENT CAPAC TY EVLONG AND Tecrica ae vesting Tang 3 Agoura mo Fees Sarr. organ ‘Greta aaa ret |v EXURONMENTA CONSERVATION AND DSASTER PREPAREDNESS RUS DEVRLCOUENT RocRANS roman covet ramets ares me aun scary Ya Savon asic enone anes TORNG EVALUATION AND SUSTANABLTY"
    },
    {
        "image": "research2_synth_20_aug2.png",
        "label": "researchagenda",
        "ocr_text": "EXTENSION SERVICES AGENDA Ay 20x6 2007 FROM Anger Pace, Em 2)"
    },
    {
        "image": "research2_synth_20_aug3.png",
        "label": "researchagenda",
        "ocr_text": "exerts amc me: ow a eeyremonneenn nae 1 pam Ren teen erage: Comma sat panes taro ero ene Ty: Po 1 yam nano He oan OR AAAS TTY FTP ere moeconet payne AEG AA ERI OO wt a We WONTORNG BAUATEN AND BUSTARMABLTY ere ag rns mom mee 288 a Sarre oe pon am ce merce rormae arey re ere rae: Camts care Fe Lay nmr eer ves r: SaT oo er er SE ET same preneren 12: Cee S AE PN Sea ae cork a a FIFE Smecorert ncaa Ranin A) EY SST errr meee ne youn ates oe eRe Re vary ee eee mre HAUT BIT PT wavan pecreNry tae DeesH ye Be RESIN"
    },
    {
        "image": "research2_synth_20_aug4.png",
        "label": "researchagenda",
        "ocr_text": "EXTENSION SERVICES AGENDA AY. 2026 2027 FROM Amber Price, Ph O. Extension Services Director {COMMUNITY ENGAGEMENT AND PARTNERS OBVELCOMENT |. ame Conmuny krteatn ad Ness Assit Con conprenee cmt) ong anes aay Eis beri win nang LGUs and canmuny gaits -Dveop menaranin ae win pre communes Cree commun econo annie srnrerng sen 2 Saxena Conran ad Neortng- Bud prtwrtps wn goveret agene ANGOS- Engage rae ec esas ‘mentzaon a ip Cou wn at com veep MEV ENED ager wera Sve cons {CAPACITY BULONG ANO SXLLS DEVELOPMENT PROGRAMS |-Teemeat rosa rag -Fondproceag an preservation wansops Cap anfemetuson ul raring Berit lnsiaatn antmarieuoe couse Waar arta tetany s Aeve evcrg andrea Yarig 2 Btreserere a Uvennd Devecpmer- Bae buds maagonert a tras tra) Pro eget an ty sssrzoe- Marty ranges arin Dain patoms -Compeane ceeepnert maaan: Winans ae as 23 Agrosnra Panes Beon- rg ating a suarane acute proton Post harvest andi ae 28ton- vest rats ant amatheae marapene- Aqua arneresarce marajenert Cimaemaraycuhse sage SL MEALTH AND WELLNESS EXTENSON PROGRAMS |. Hes Eason ant Anarene Cans isa preversonananezm proc ahites Fay planing andere a excatn- hr coring ey eye asa) Marta Maat aren an eres managener Prag Fare rege reoe 2 Mesca ps Derts Olney Sarvces- Fret mada a et conssators nonce wes -Oer2AAon cede arene \"eam seen ans cate servens- mmuraain a accra oye. Reta Sean epacaand made ce IV. BVURONMENTAL CONSERVATION AND OSASTER PREPAREDNESS |. Enirermera Proeconitaves- replay an rerestatn projects Canta sap an maine canervatn ates St wae ‘marogenert raring ant nseeratn- Wate qty moran an wae pect Bove) conker von hata est aton 2 Ose Resctn an Marapner- Commun ated asa pepe Yarn -Devegpner ct eracuson Saat (Poa- See aac Wk Yarng- Peco pp aa as etary aN rN OFS \\V EDUCATION AND YOUTH DEVELOPMENT |-Tara rsMenorng ayans- Acanenc ate Srying sues Senn tain ad pon spp Caer sare ansclepreaanes prayans- Scene an nanenaics evcrneT aves Render) md nary CENoaS 2 Youn vss ant Vue Famaton Lenrnp Faring a rgzatna eer Endrrmert Braet ton 2b) ‘Spits ara center payans- Ae auyae aan asain Varta vere neve egupenet ache \\VEMONTTORING, EVALUATION. AND SUSTANABLETY ‘At ecerson pyran ch bate ta acto regu mean Spat acter Saar aang PATE auris wil roves wh erica asso, raring mates, ae catrung egy ere ge ets ad Sony owners."
    },
    {
        "image": "research2_synth_20_aug5.png",
        "label": "researchagenda",
        "ocr_text": "EXTENSION SERVICES AGENDA AN KIER? FROM ower Pros, PO Extension Services Direrior GONIUNTY EYOLERUENT 9 BRATARENO CEN 1 ir oir yet oa Narn aver ae Seneca ng we ee ANS AAACN sabe tn are anos ageitane- Seep meNcren Renee py rea ee eG ‘Seeaaits Cosyraten mi Neacwy- au rma 9 nme ages MHC: Bape} rer a A Ab RAL Cota AON RST TTS ADIT I Eu oP TO cee ogee abr sku Ae BoA RACINE ROCA 1 Yearieé ae yonkers Tere Toes eney mapebe ech wameEe- Capa an uasaUnn et eg tA \\saten seemed ota ran eget Aten igo ea as itty ta onsbace eon NOD OeeRL MiCeMU AES ty ana epee eos a rinse Cigar aTNI aN ETAT tren Se ‘rogers 2 tginsten aut btane Brandon ougevtemneg msn Hgie/ eae Fame ay mee en ‘oes arama ee rapes ate ae cnet Cte mse pages tener ang ween a ER PROGRES Meat escan areets Cage Daun gre nsth aa a NN Fy ang oS ssrA zug asa Sompacaicay Nur aM ARR Het nes. PERC orgecyoansse 2 Musee attr atin See rea neck a Sims renee DRE NS an Perey aN ay seers eral TSI HGsaNFojam Ne eh NANA MEI OE WcERUROROLENT CERIO a2 EASTER REPENS 1 Sreemasta Brcon taet Tres agence ge Ca nit nme aE Pa acapoetieiie walnpereabe- Wate iy naa, wR WBesRD ISO en RR BUNT ‘ai Re Neat amar Sonenant aie Aa ma NeNSE PaNND: Suen eons Ee rene SED cue Yat iced pr SSS RIS Ln Nar RR ‘enucaron amp Yor Sau ra zd Masaryangime hea acta Ne ne. deme eNeace an reba Se {Bein eae rasss yar S2 MI NAEATINSS OMONTAN AVS SSBEME EE BG ASE EMEC ooh scar ms itn are 220— PER Ma ENS OE MOT ryan Big sD ante aio ei MI Na ARITA WORRATCRING EVRLSAMEN. AID HIOTRSNEBRCTY fa mien 299 oe iin ac oS ‘Pein om Bast ncaa Te na concen teats th eetener pacts seh ete Sera a rc an NE Ny"
    }
]