[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "resolution",
        "ocr_text": "atl towered ae wand trathacned mais ‘8 Seven gt sacs to jo ‘seinen uneg even fay tan ing"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "resolution",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "resolution",
        "ocr_text": "metas ur ‘zens. 09 encmraeg nova spite Plasmas wo Saree eeneg the mecca bay i Sac te roc a bate igmon scaderae eae remo Seen he el noe ees wae centnaue ampronnent ae aen te bail ct everyday toacing"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "resolution",
        "ocr_text": "Erongsed Pacuity say a Soran Resolution, oura ging Innovation i ais toner AH an ennanmert th ee BS Pt Of Sven Se eS ng"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "resolution",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "resolution",
        "ocr_text": "Tia pena tasty veshusin onings on Srwoeeg roneperey 9 Diindh quawincanoe s recreate Mok tacky ember be sonny wo a, pul ee ‘eS tree een ts ofa pete a reenuron alee suggesa fn selgy wu puuerie ntanneg Sot Bred stn rus we aceia"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "resolution",
        "ocr_text": "The faculty resciston foouses on e nance recommenas tat fc uty meee’ scive Ses n deasonmanng commnces Tra ace tm acaseme an soma atve ates tacury ara tached Tug tue cpemese, De scary ad staserds “enness, ‘onan ‘Bulkd sbonger bust and accountabalty ‘scademe, ‘can build sbonger"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "resolution",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "resolution",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution ‘The proposed tacuty resolution focuses on mproving transparency in ‘Sehool govemance. recommends tat facuty members be gven dine res n deosonmaking commtiees, This promotes farness and equal representation In academic and admmistratve matters, The Tosalut n aise suggests publishing meeting oulcomes to Keep both ficurty and students informed. Through ths openness, the mshituton Can build stronger tust and accountabiity within the academic ‘community."
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "resolution",
        "ocr_text": "Toa pr aca aed seversanes ‘tre y teseion sosutge erwre ny Pat on"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution The, {facuty resolution focuses on improving tra yin E emanea, recommends tat fac members be Sven 3 Tesoluton also suggests publishing mesting outcomes to Keep both facuty and st informed, Through this openness, the institution ah ull stonger ist and accouhtatty wit Ne academe"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution re proposes facut cesouton onses ob BONS Saree guen Ee facut fF fecommends hal fac vmehbers be aver \"Sefed gover ane atung coromatges, 1 Boo ten Th causegeoenaect ey ne Samsara ng gua ee cggeate pupwehing meeting Outconsss Ten aR ere amet, Trough eee ne ‘nebtston uy and sce est and accourtabiy wit te acaseme ‘community"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution “The proposed faculy resolution focuses on engroving tansparency it ne proposes facuty pala a ac iacuy members De gue Schoo govemancs eating commices. Tha promotes famess aaa ear cessor academe ang aomnisatve mater, The Tecate sppsiepaueha norma cucate eee ean a, Supa ed Through ta openness the nsHtuDON abs Bh Songer at a acsouramity wine caceme ‘Communit"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "resolution",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution ae fay ezine foo. Seer"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution Ths woperes mgr foagen ch rene rcpt (eh Scr eanibee aa Dee SE on ated SAEs Lomtecen RES, TE I ee Sembee ens re pte fe STAG TN 2 Ee eatan meters 2 GO Sg Sate an omy ners ES ‘Toncahes ar part cl aeeryaary FOTN tecuny masse"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "resolution",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "resolution",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "resolution",
        "ocr_text": "Proposed faculty Resolution remain"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "resolution",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution sg ta alrenatnes ers fenwsaauses HANES 1h dosgn tnah av eae te AoE ee reeees carseat support SUC FT cea ana varncrenee, Mees POISE, 2 eas gahaary and eal na Sch ACEISIT S Be Ee raauen, Hes seman protetes 8 ON Viscbacal grog ane Scie"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Respiution aa he cairaips, re onbot ‘ion facuby fa grow prolansionay Sic eavate the schon 8 sexta ogutaton hravgh iis recat, Coe inaction protien eabure ot Snisiacwal growin ans gmcovery"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "resolution",
        "ocr_text": "propqued taculty Resolution vine cena crater, wats seca EST TRESS Uearay amner. BIC RESRER a A a eae FANGS NR CONE ee The eathaa BER SS RAE PES Brig sentences, ora DEMETRI Spocensns EEE Gc peso ae Oa Peaceawen: Pept. TO 2 ae aieean MOOS 8 RS si gesotn aod ORCS geaication “Apietacs"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution Jed resolution aims to strengthen research and publication Opes es fecully members. it encourages teachers fo engage iN ‘hat contrbute to academe"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution ‘This resolution aims to promote faculty welfare and professional inisqa irecommends potcies that support work fe Barnes, ge USSpabes teaching loads and wellness programs, [he deen as ree cognizes that happy and motivated teachers oSfom etn ine classroom. I iso encourages opportunties {oy bette ich, community service, and continung education: By dronttong facuty wel being, te schoo! ensures sustanable ‘academic SUCCESS,"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution This resciution aims 10 promate tscasty wetfare ano professional ‘row. k recommenns pokes fi support wura e BABE, Such a& Veascreve leaching 1osds ond wainess axograms. The rescluon rocogizes hat hacpy ars mollvated warhers perlorm batt ae carom ooo encouapee cpporeneas ix research, service, and continung avucaioy Beomiorg facut we beng, Beinn, fe cro ensures sustanchle"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution ‘This resolution aims to promote faculty weltare and professional agi recommends poicies that support work Hfe balance Such 3s reasonable teaching loads and wellness programe. The resoiubon recognizes that happy and motivated teachers perform better in the classroom. 1 also encourages opportuntice 16°, research, community service. and continuing education’ Eo Pronitizng faculty well being, the school ensures sustanable ‘academic success"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Besplution arash te Syne smouvalin MEA has hae 3 Saat Pn encourages OPPO AIS pang eueater. Be he pecvice ars ee being, 2 SIRO SI RRS. granu RERAT"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution ‘This tesoluton sites to promote catty wettere and profsssior at growin. k vacomenwenis patties te surpor work s a bance, Such os rensorecbie Leacting ‘oads anc welress programs. The Fxcubon recognizes tak happy and motivaied isachors Pertaxm better st tye Classicom. alsa encaurages opportunties far Fesanich, comnuttty s ViCe, and conkhieng education. By provitzing facuty Pe School ensiIes SusteanaDle ‘acatemit: success."
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "resolution",
        "ocr_text": "Proposed faculty Resolution The proponee yesctuion bight tne wasovanes of Hiahaates wiki ia suphuten Rone wt Sia Riven ay faa sauce aa cats ear seaie 3 igen oo rearaba a, fered aerues Mo bene"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution Sse Hrs mance of hatte stat. owe ton ‘Song tesa mera Toe Ahonis, isnt of barked, iieaimont By revatne te sod ca crowie' loarnins voor eetvate. 10 plomoiee Sarr"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution Ihe ireason nenegies he woertance twenty 24 eamlippennitgn wae Oe taeincn Vege fe sans Oy Ser de Seeraly mnarerone ‘nomen \\enciton saa emcee tat eacreate, feet a wines cor cna searing enteneen Bat ce ten cremate» lear’ AG Sarnane Tes pravoles Racy tnewrnoncey wr eee reaper: nines Fe tangs"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution pesokedion nighsags ine al insiuetay ane ss udhin the Betsutoa iteats jar tines progeny WeISiy sanceneay Bore Tani apntaee Poe sseurts Hist at stinerty. Werartieny Of basins founve fas and respecths! teeter! By inpiets oraciges, the silad nan create F iean ha ernment ‘Gites ons. Tes oromeies aeaaoome respael"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution “Ine proposes resi, rightghts the mponance of inclusvty 3, ne pronase ne ator C48, Toes carn ual opportune ery awareness On tie embers. the cat pemeS Snavres hat al SUSE Fe emer ‘stoackgrouns scutn 299, 05 respect reatment BY, Ment Rak sive and espe taming envraneN a eal fe a lear mgadersianding, and mutual Giterences. Ths proMOLES \"4 rested across the campus."
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "resolution",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "resolution",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "resolution",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution “Fhe proposed aectsign seks 10 TRAE Reeders acecherts. Ao fasten arse 203, 2 eg hata EAN Pees ans cert ir tpedgach RB8eeS ‘ite nae ae"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution “The proposed resolution seeks to improve faculty accountabilty and Student feedback mechanisms. I encourages the estabishment of a fairevaluaton system where students can express ther academic ‘concems. This hes Kently areas of mprovement in teaching performance and curriculum delivery. The resolution also proposes, regular feedback sessions to maintain continuous development. Such Zolaberaton fosters mst, reaped, and a shared goal of academe ‘excellence"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "resolution",
        "ocr_text": "Proposed. Faculty Resolution nis vesckecion ain prMee reaching iat wgnizes inal Hanpy ane"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution mote facuty welfare ‘This resolution aims to Prot Wt tae policies that support wor ‘and professional rkcfe balance, The recommends Ping loads and welness PrOOrer. ers perform"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "resolution",
        "ocr_text": "Proposed Facuity Resolution ‘This rosctation aims to cromede taety weitere and pctessioral GrowE:. recomments that sunpodt work ik Deane, ‘such 38 razsoowie t toads and wetness programs The eschulion racogg setae rads tearyerosenmtge"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution This resolution aims to promote faculty welfare and professional growth. itrecommends policies that support work life balance, such a8 reasonable teaching loads and wellness programs. The resolution recognizes that happy and motivated teachers perform better in the classroom. It also encourages opportuntties for esearch, community service, and continuing education. By prioritizing facuty well being, the school ensures sustainable academic success"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution ‘This resolution aims to promote faculty welfare and professional ‘brent. recommends potcies that support work te batance, gin: fbasonable teaching loads and wellness programs, The eugien recognizes that happy and motvated teachers periom ‘oterin the classroom. It also encourages opportunities for perch, community service, and continung education, By prontizng facuty well being, te school ensures sustainable ‘academic Success."
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "resolution",
        "ocr_text": "remulion 2 Span aeeaty CRIN pats ought Fe oe arse, a ee ab at Faeroe! anes ang pusiealon fo engage"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution Me 9 sopnecich ane melas effoee arn faruly then cage Wormers te Sr lage F aba ohne fevieigs thal cant tute {0 acatierh aacincement, The renvion proosees inst te aa Supp ech fevanten gratis, comers These Gyo alos taculy to pun mofeuwanaly aid mevate the achixw 8 azader Tepunalion Tauge fas babe, te ingtnonon peomoies 3 casue OF Rial giawn aad okseavey. Tie proganed resent"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "resolution",
        "ocr_text": "proposed facut ny Resolution es pact on pene 9 spate neces eure st ros (og naumrnon premotes 3 £4 ESOPEN"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "resolution",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "resolution",
        "ocr_text": "Proposed Faculty Resolution The proposed resolution ams to strengtnen research ans publication efforts among facuty members. encourages teaches toengsse scholarly Wark and share fndings that centrbute fo scagemne agvancerant The resolution propsses nsutulonal suseor such as esearch gens oneness and partners, Tews cpootunies alewibeuby0 iow protesscaly ara iene ine scsi s sender Feputation Through fis intiaive. ee insteution promotes a cuture of intelectual gresth and dover"
    }
]