[
    {
        "image": "studentinfosheet1_synth_10_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "STUOENT PERSONAL INFORMATION FORM Tracy Abigail _ stutents biome Ci _ ‘Nave Tint tire Wiedie Hawe Due crtien _dune 27, 2600 _Move hth. Bathshire, Ecuador seudent Neeaber 51103779 Ema Adaresy: “AON Mobee te _0962 658 6282 come BS Computer Science verieres 2nd Year Permanent Agere 8205 Thompson Park Apt. 236, Emilyton, SC 69597_ ee Poone Number 9961 977 1079 resent astro 418 Adrian Drive. Piercechester, MN 74254 ——— Prone Number 0990 545 5223 others tame Kimnberly Johnson Modie Number, 929 399 9956x402 dunes Address, Allen Gioup, 874 Marsh Flats Apt. 624 Horner s Eat Addcess UEATTemeNGO THEY BL swess Ppoat No, 860 754 7226x5766 Fater s Ean Adéress: Parkervictoniagyexemple net pysiness Stone No. (353 047 2796x256 Pues te camtect in seus. of emsrecasy:, ranerstiame Ricky Brown tobe tutes. 2494835980 rane Mark Dean __ _ scores 944 Mack Ports, Port Valerieberg, VI 82339 ewes aderes Ress LLC, Unit 5126 Box 3205 _ pret: uorer 0901 908 4595 4 i ceray what the above information true ane correct Rewtionshp to Tedent Guardian i iberly Johnson Cannon, Tracy Abigail Firents Sgpacare over Snares ewe SRedents Saeature over Protea Name FOR REGISTRARS OFFICE USE ONLY j tee Shawn Wilson onic Recents: Api 21, 2025 Encsied by"
    },
    {
        "image": "studentinfosheet1_synth_10_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDRMY PORSONAL INFORMATION FORM Fis tame Theil Nase Date oftiren_stune 27, 2000 _ rue ofits _ Bethshire, Ecuador student amber S1103779 tna actos “MN sone téc, 0962 858 6289 ee verte 2nd Year Sermanent atsres 6205 Thompson Park Apt. 236, Emilyton, SC 68597 _ ee Pee Nene 0964 977 -1079 sreett acres 448 Adrian Drive, Piercechester, MN 74254 Homers tame Kimberly Johnson Mobic treser,, 929 399 9056x402 Dawes Adres Alien: Group, 874 Marsh Flats Apt. 624 Moers Emad deicess SRMMNNAEMIIN OT poses Frome No 800 754. 7228x5786 faserstime Ricky Brown ote ember 2494895980 sues Aderon ROSS LLC, Unit $426 Box 3205, _ _ Father s Seas Atéress: PAFKETVICIOAQEXAM NE NE geinees Pome No _ 353 947 279EX256 Penge 9 comtedt jn cone xf eresteeasy. tune Mark Dean 7 naees 944 Mack Ports, Port Valerieberg, VI $2939 Pione Nurber 901 909 4595 Co 4 Cannon, Tracy Abigail FOR REGISTRAR 5 OFFICE USE ONL [co _ Shawn Wilson cate Reeves: ADE 21, 2925 encoded ty Rachel Alvarado pate tacoaee, December 23, 2024 j"
    },
    {
        "image": "studentinfosheet1_synth_10_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "Pace ot Biren Bethshire, Ecuador Jain --7 $1103779 Emad Aseress ——— MobteNo 0962. Coune Yer Lever _2nd Year Permanent Aséress 6205 SC 69597 Prone Number 961 977 1079 iter, MN 74254 LS Prone Number 0990 545 5293 Meters Name Kimberly Johnson Park Apt. 236, E Mobae Number _ 929 399 9056x402 Pesmess Agéres Allen Group, 874 Marsh Flats Apt. 624 MOOS Emad Atéres: “tetmeren Goreme oy Business Prone No 860 754 7226x5766 Famers tame Ricky Brown 2 26x5766 lobe Number 2 teimess adéres: Ross LLC Unit 51, cr 2 26 Box 3205 Father s Emad Adéress -Parkervictoria example net ewes Prone No _ (353 947 2796x256 Aecewee oy _ Shawn Wilson Encodes by Rachel Alvarado a varado ate Recenee_ADril 21, 2025 Date Encotee December 23, 2024 ember 23, 2024"
    },
    {
        "image": "studentinfosheet1_synth_10_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM sucents name Cannon, Tracy Abigail ry fratewe te Rams Date of Birth -_ JUNE 27, 2000 pace of Beth _ Bethshire, Ecuador oe Mobile No _0962 658 6289 student Number _S1103779 Email Address BS Computer Science year Lever 2nd Year 6205 Thompson Park Apt. 236, Emilyton, SC 69597 pnone number 0961 977 1079 cechester, MN 74254 Course: Permanent AGéress: 418 Adrian Drive, Pier Present Address: none number 0990 545 5223 Mothers Name Kimberly Johnson. obile Number, 929 399 9056x402 tunes Adéress Allen Group, 874 Marsh Flats Apt. 624 Mother s Email Address: terbetrnamerignreren pusiness Phone No. 860 754. 7226x5766 fatners Name Ricky Brown Mobile Number 2494835980 wines: Aeéres ROSS LLC, Unit 5126 Box 3205 353 947 2796x256 Father s Email Address _parkervictoria example Inet pusiness Phone No. Mark Dean 944 Mack Ports, Port Valerieberg, VI 82339 Name Address: peuticnship to Student Guardian 901 909 4595 Phone Number: fe information is true and correct certify that the abov Kimberly Johnson Cannon, Tracy Abigail Parents Signature over Prnted Name Fuaents Serature over Printed Name FOR REGISTRARS ‘OFFICE USE ONLY necenes ty Shawn Wilson ate necewes April 21, 2025 Encoded by Rachel Alvarado Date Encoded December 23, 2024"
    },
    {
        "image": "studentinfosheet1_synth_10_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PER Stuaents Name Cannon, Tracy Last Name ‘SONAL INFORMATION FORM Abigail First Name Middle Name Oste cr Birth June 27, 2000 SS 000 Prace of Birth _ Bethshire, Ecuador Student Number _S1103779 Email Address, _ TS sewes, MobileNo 0962 658 6289 coune BS Computer Science verte 2nd Year milyton, SC 69597 Prone Numter 0961 977 1079 Present acaress 418 Adrian Drive Piercechester MN 74254 Prove number 0990 545 5223 Motners tame Kimberly Johnson Mobile Number 929 399 9056x402 Flats Apt. 624 Permanent caress 6205 Thompson Park Apt. 236, &; Business Address Allen Group, 874 Marsh Momers Email Address, KPe ymarmarieramo e ong business Phone No 860 754. 7226x5766 OO 1226x5766 freers name Ricky Brown Motie Number 2494835980 Sse aseress ROSS LLC, Unit 5126 Box 3205 Fathers Ema Address Parkervictoria example net Business Phone No (353 947 2796x256 Name Mark Dean Address 944 Mack Ports, Port Valerieberg, VI 82339 ssh to Student Guardian Relat Prone Number _0901 909 4595 SEh09 4595 \"erty thatthe above information true and co rect Kimberly Johnson Cannon, Tracy Abigail Parents Sanature over Pontea Name Students Signature over Pratea hame FOR REGISTRARS OFFICE USE ONLY ®ecenes by Shawn Wilson Date Recewes April 21, 2025 Encoaes ty Rachel Alvarado Date Encodes December 23, 2024"
    },
    {
        "image": "studentinfosheet1_synth_1_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM students Name Luna, Elizabeth Scott Last Name Fist Name Middle Name Date orien May 05, 2006 Pace ottien _ Vasquezport, Madagascar student Number _S3473413 Emaii address *unse2 raicom Mobile No _0941 792 9750 couse BS Psychology ver tee Ist Year Permanent Asdress 927 Steven Forges, Davisland, MT 62006 Prone Number 0950 255 3118 Present Address 04741 Brown Isle Suite 832, West Michael, MA 17002 Phone Number _O957 572 4255, Mother s Name Mrs. Kristi Gonzalez Mobile Number 988 269 6017x28055, business Aadress Smith PLC, 99656 Ryan Row Apt. 514 richardjones example org Business Phone No 429 456 5935 fathers Name _Tyler Scott Mobile Number (342 992 3422 tusiness aadress_Mcdaniel Group, PSC 2179, Box 1719 Fathers Email Adéress ennisreed example coM gusiness phone No _ +1 910 386 6947. Mother s Email Address ame Anthony Anthony address 887 Green Wells, Crawfordfurt, OR 06706 Relationship to Student Father Phone Number _0927 282 2256 certify that the above information is true and correct Mrs. Kristi Gonzalez Luna, Elizabeth Scott Parent s Signature over Printed Name Students Signature over Printed Name FOR REGISTRAR 'S OFFICE USE ONLY Receves ty _ Karen Garrett Date Recewea November 06, 2024 Encodes by Andrew Smith Date Encoded December 03, 2024"
    },
    {
        "image": "studentinfosheet1_synth_1_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "pian Tian! FORM STOUDKAT PERSONAL INES quezport, Mi 9944 792 975 soeee No og Number 1 MA 17002 _ rowers Eeoat newress"
    },
    {
        "image": "studentinfosheet1_synth_1_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM student s Name Luna, Elizabeth Scott last Name Fist Name Middle Name ate of itn May 05, 2006 Pace ofirth Vasquezport, Madagascar student Number _S3473413 Email Address: *tns 2 natcom Mobile No. 0941 792 9750 couse BS Psychology year Leve _1St Year Permanent Address: 927 Steven Forges, Davisland, MT 62006 Phone Number, 0950 255 3118 54741 Brown Isle Suite 832, West Michael, MA 17002 Phone Number _ O957 572 4255, Mother s Name _ Mrs. Kristi Gonzalez Mobile Number: 988 269 6017x28055, Business Address, Smith PLC, 99656 Ryan Row Apt. 514 Mother s Email Address: ichardiones example or9 usiness phone No, 429 456 5935 Fathers Name _Tyler Scott Mobile Number. (342 992 3422 Business Address. Mcedaniel Group, PSC 2179, Box 1719 Father s Email Address dennisreed example com gusiness Phone No. +1 910 386 6947_ Present Address: Person to contact in case of emergency: Name Anthony Anthony ‘Address 887 Green Wells, Crawfordfurt, OR 06706 Relationship to student _Father Phone Number O0927 282 2256 certify that the above information is true and correct. Mrs. Kristi Gonzalez Luna, Elizabeth Scott Parent s Signature over Printed Name Student s Signature over Printed Name FOR REGISTRAR S OFFICE USE ONLY Received ty. _ Karen Garrett Date Receivea _November 06, 2024 Encoded by. Andrew Smith Date Encove, December 03, 2024"
    },
    {
        "image": "studentinfosheet1_synth_1_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT pj Stents Name Luna, Elizabeth Last Name Date of Biren -_May 05, 2006 ERSONAL INFORMATION FORM Scott First Name Middle Name Place of Birth _ Vasquezport, Madagascar Student Number _S3473413 Email Address. ©4 282 mai com Mobile No. -0941 792 9750 couse BS Psychology Yerteve _1st Year Permanent adsress: 927 Steven Fo \"ges, Davisland, MT 62006 Phone Number _0950 255 311g Present address: 54741 Brown Isle Suite 832, West Michael, MA 17002 Phone Number. 0957 572 4255 Mother s Name: Mrs. Kristi Gonzalez SS Gonzalez Mobile Number: 988 269 604 7x28055 Business Agéress. Smith PLC, 99656 Ryan Row Apt. 514 Mother s Emait Address: Tichardjones @example. og Susiness Phone No _429 456 5935 AS65935 Fathers Name _Tyler Scott Mobile Number. (342 992_3. 22 179, Box 1719 Business Address. Mcdaniel Group, PSC 2 Fathers Emai Address dennisreed example. COM business Phone No, +1 910 386 6947, contact in case 7 Name: Anthony Anthony Adéress_887 Green Wells, Crawfordfurt, OR 06706 Relationship to student _Father Prone Number _0927 282 2956 S28 2 2256 Cert that the above informat Mrs. Kristi Gonzal. jon ls true and correct lez Luna, Elizabeth Scott Parents Signature over Printed Name Student’ Sgnature over Printed Name FOR REGISTRAR S OFFICE USE ONLY Reeves sy. Karen Garrett Date Receivea _November 06, 2024 Encodes ty, Andrew Smith Date Encodeg _December 03, 2024"
    },
    {
        "image": "studentinfosheet1_synth_1_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM students Name: LUD, Elizabeth Scott Last Name First Name adie Name Date of Birth May 05, 2006 Pace of Birth Vasquezport, Madagascar ‘student Number $3473413 Email Address: ena 2 meh co Mobile No. 941 792 9750 coune BS Psychology yearteet 1st Year permanent Address 927 Steven Forges, Davisland, MT 62006 phone Number: 0950 255 3118 present Address: 54741 Brown Isle Suite 832, West Michael, MA 17002 Phone Number 957 572 4255 Mobile Number: 988 269 6017x28055 other s Name: Mrs. Kristi Gonzalez Business Address: Smith PLC, 99656 Mother s Email Address: richardjones example. org Tyler Scott Mcdaniel Group. PSC scample COM Business Prone No. Ryan Row Apt 514 Business Phone No. 429 456 5935, (342 992 3422_ Mobile Number: 2179, Box 1719 Father s Name Business Address: dennisreed e +4 910 386 6947. Father s Email AdGress:. nae ‘Anthony Anthony ncsress 887 Green Wells, Crawfordfurt, OR 06706 Phone Number: 927 282 2256 ent Father Relationship to Stu! formation fs true and correct beth Scott 1 erty that the above i Luna, Elizal a Name Mrs. Kristi Gonzalez Farents Signature over Printed Name Seadents Signature over Printes TOR REGISTRARS OFFICE USE ONLY necenes oy. Karen Garrett November 06, 2024 Date Receive December 03, 2024 Date Encoded"
    },
    {
        "image": "studentinfosheet1_synth_2_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "srunEny FEarOnat INRGRMATION FORM Kelly stagencs ame Lake Ryanburge, Ghar ae 3887 Mey_t ace #20 pate of eth etopite ta. ‘geatons Mhutnber Bs formanent Batre Beesent Aadres gaone Number #40923 12 4g. 7 RBARBBOS tis ApT. 548 _ sroers Mae 2 Nach vgs MOGFFOW, Hawkins Baker, 86246 young Fat 244 ma tio Faster’ Geen AMINES me Dana Patel Ss Stephanie Law i mecered OF: {"
    },
    {
        "image": "studentinfosheet1_synth_2_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "STURT PERSOMAL INFORMATION KakaG Deborah Womber +4 823 723 7864x88US Baker, 96246 Young Falls Apt. 645 ple org"
    },
    {
        "image": "studentinfosheet1_synth_2_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM student s Name _Kelly, Deborah Kimberly Last Name Fist Name Middle Name Date of tien _ May 13, 1997 Pace of Bit. Lake Ryanburgh, Ghana student Number _S9941914 Email Address: e malcom Mobile No 0999 473 3887 couse _BS Biology Year teve_4th Year Permanent Address _353 Long Flat Suite 646, Mariechester, MP 88328 Phone Number _0925 726 3781 Present Address 2039 Santana Vista, Heatherchester, AS 19478 Phone Number _O956 464 5058 Mother s Name Michelle Weaver Mobile Number, +1 823 723 7864x8805 Business Address, Morrow, Hawkins and Baker, 96246 Young Falls Apt. 545 _ lewisjoshua exampleO9 gusiess Phone No. *1 440 381 1154x95328 Father s Name Alexander Cordova Mobile Number, +1 314 354 5264x8292 Business Address. _Lane PLC, 059 Thomas Route Father s Email Address, AMCClure example org —__gusiness Phone No. _ 829 383 5276 Mother s Email Address. on to contact in cm Name Julie Miller asdress_8704 Chavez Court Suite 935, Lake Michael, GA 63831 Retationsnp to student Mother Prone Number _0969 612 9099 certify that the above information fs true and correct Michelle Weaver Kelly, Deborah Kimberly Parent s Snature over Printed Name Student s Signature over Printed Name FOR REGISTRAR S OFFICE USE ONLY. Receves ty _ Dana Patel Date Recees_May 15, 2025 Encodes ty Stephanie Lawrence Date Encodeg, December 22, 2024"
    },
    {
        "image": "studentinfosheet1_synth_2_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM students Name Kelly, Deborah Kimberly Last Name Fast Name Middle Name Date of Birth _May 13, 1997, pace of Birth _ Lake Ryanburgh, Ghana student Number _S9941914 Email Address skely @makcom Mobile No _ 0999 473 3887 couse BS Biology Year Level. 4th Year Permanent Address: SOS. Long Flat Suite 646, Mariechester, MP 88328 phone Number, 0925 726 3781 2039 Santana Vista, Heatherchester, AS 19478 phone Number _0956 464 5058 Michelle Weaver Mobile Number’, +1 823 723 7864x8805 Mother s Name: business Address. Morrow, Hawkins and Baker, 96246 Young Falls Apt. 545 _ lewisjoshua example of9 guiness phone No _ 1 440 381 1154x95328 Present Address: Mother s Email Address: Alexander Cordova Mobile Number. +1 314 354 5264Xx8292 suiness address Lane PLC, 059 Thomas Route fathers Email Adéress AMCCIUTE eXAMPIC OFF _ Business Phone No. 829 383 5276 _. Person to contact in case of ememgency: Julie Miller 8704 Chavez Court Suite 935, Lake Michael, GA 63831 0969 612 9099 Father s Name Name Address Phone Number: Relationship to Student Mother certify that the above information is true and correct. Michelle Weaver Parents Signature over Printed Name Kelly, Deborah Kimberly Student s Signature over Printed Name FOR REGISTRAR S OFFICE USE ONLY: recewee ty. Dana Patel ate Recewea _May 15, 2025 Encoded by: Stephanie Lawrence Date Encoded, December 22, 2024"
    },
    {
        "image": "studentinfosheet1_synth_2_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "STURHSY PERSONAL INFORMATION ROBIE Kimb: 3887 Yorien Ath Year Srese te teowoer $4 814 354 Ss Route rocmea we Dana Patel ceraueaty Stephanie Lawre:"
    },
    {
        "image": "studentinfosheet1_synth_3_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM student s Name_Mccann, Ryan Michael last Name Fast Name Middle Name Date of Birth -_April 21, 2002 Place of Birth _ Lake Daniel, Bhutan student Number _S2385506 Email Address; “=™enrne™ Mobile No _ 0987 507 2537 couse BS Psychology vartee _4th Year Permanent Address, 206 Nathan Drive Apt. 124, South Danielton, CA 05204 0968 887 0116 Phone Number: Present Address Unit 7670 Box 5344, DPO AE 90262 Phone Number: 998 548 5912 Mother s Name. Danielle Marks Mobile Number 5683733638 Business Address, Reeves Flynn, 54628 Travis Drives johnsongary example net (296 267 4927x44112 Mother s Email Address. Father s Name _John Larson Mobile Number _001 621 548 1756x03511 Business Address. Peterson Inc, 39672 Summers Parkway Suite 186 Father s Email Address: Matthew91 example coM gysiness Phone No. 001 665 802 1288 Perse act Name Shelia Marshall Address 094 Young Ranch Apt. 228, East Frank, MH 27406 Relationship to Student. _Father Phone Number _0977 006 7039 Business Phone No certify that the above information f true and correct Danielle Marks Mccann, Ryan Michael Parent s Signature over Printed Name Students Signature over Printed Name FOR REGISTRAR S OFFICE USE ONLY. Recewes ty Amber Perez DDS Date Recewvea _JuNe 30, 2025 Encodes ty Yason Young Date Encoded. April 27, 2025"
    },
    {
        "image": "studentinfosheet1_synth_3_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PORSOMAL INFORMATION. SORM maeetstiene Mocann, Ryan Michael crt re fat tame Wie tome Once ters ABT 21, 2002 orn oe Beth. Lake Deniel, Bhutan atest siember _S2385506 tran aires, “ommarencn: Mente to O887 567 2537 Goune BS Psychology ver tert 4th Yaar _ Prrmanest Attres, 206 Nathan Drive Apt. 124, South Danieiton, CA 65206 a rronewmter _0998 548 5512 Muamurs tame Darictio Marks stohae amber 5683733638 tues ates Reeves Flynn, 54628 Travis Drives emer tna Ate VBE sme tone No _ 206 287 4027 44112 tatters tame Jobn. Larson ——— Mote Number 001 621 548 1756x03511 tenes stores, Peterson Inc, 39872 Sum Summers Parkway Suite 186__ Famers tron agsces: MARNEWSI DOXOMPIO COM scons phone No -.001 665 802- 1288 Pesan t9 centers je coe of sosetence: tewe Shelia Marshal <<, Actes 094 Young Ranch Apt. 228, East Frank, MH 27406 Remrimaie to totent FatNOE ace Maer 0977 096 7039 =< —— at hate tot aan ewe an cere Danielle Marks _ Mecann, Ryan Michae! Parents Wgnatore over Oreited Nome Getents Syuatare over rates Name, ‘FOR MEGRTRARS OPNCE UME ONLY ee serees wy Amber Perez DOS One Revenee June 30, 2025 H j imeenen Jason Young ute tocoaes ABC ZT. 2025 _|"
    },
    {
        "image": "studentinfosheet1_synth_3_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM Stuaents Name Mccann, Ryan Michael List Name First Name Middle Name Date crBith April 21, 2002 Pace of Birth Lake Daniel, Bhutan Student Number _S2385506 Emaii address _ 7 Bsu ce MobileNo _0987 507 2537 coune BS Psychology verte: 4th Year anielton, CA 05204 Permanent agdress _ 206 Nathan Drive Apt. 124, South D. Prone Numer 0968 887 0116 meer acéess Unit 7670 Box 5344, DPO AE 90262 Prone Number _O0998 548 5912 Mobile Number. 5683733638 Business Address Reeves Flynn, 54628 Travis Drives Mother s Email Aadress _Johnsongary @example net Mothers Name Danielle Marks Business Phone No _ 296 267 4927 44112 ASO NOT A927 x44 1- Fathers Name John Larson \"obile Number 001 621 548 1756x03511 Business ageress Peterson Inc, 39672 Summers Parkway Suite 186 Fathers Email Address _Matthew91 example com Susiness Phone No _001 665 802 1288 on 0 contact in case 6} Name Shelia Marshall Address 094. Young Ranch Apt. 228, East Frank, MH 27406 Relationship to student Father Phone Number _O977 006 7039 {cert thatthe above information is true and correct Danielle Marks Mccann, Ryan Michael Parents Snature over Printed Name Student s Sgnature over Printed Name FOR REGISTRAR S OFFICE USE ONLY Pecewed by Amber Perez DDS Date Recewes _JuNe 30, 2025 une 30, 2025 _ Encodes by _Yason Young Date Encoded April 27, 2025"
    },
    {
        "image": "studentinfosheet1_synth_3_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "STURENT SURSONAL INDOAMATION FORM stu ame Lake Daniel, Bhutan Howie No OBS Date of Biren _ AY Seagent Member BS Psyc ‘Yaar Level Danieltan, CA 05204 Scouree tunes gies Reaves Mother s Email addres. __ Hobie Number: 001 824 5 Parkway Suite 186 «Amber Perez DDS Jason Young"
    },
    {
        "image": "studentinfosheet1_synth_3_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "Student Number 007 685 87 084 You; rel Raneh A"
    },
    {
        "image": "studentinfosheet1_synth_4_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERZONAL INFORMATION FORD wsy, Lisa Harvey MD Toni Miller"
    },
    {
        "image": "studentinfosheet1_synth_4_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "ORMATION FORM Srupant PERSONAE (SF Chavez, Je regents Sarees 2 _ Watkertuct, Hungary _9943 184 1972 ae of BAR Hooke Be content Number 2 987 2, Cameron 6nd Stone, esiness AGE Father s Eras Espa ts. goo gsh x 5562 EASES. ruse aul Walker pgsoess etattannbip to Seadent"
    },
    {
        "image": "studentinfosheet1_synth_4_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM student s Name Chavez, Jennifer John Last Name Date of Birth. December 02, 2002 Pace of Birth _ Walkerfurt, Hungary Student Number _S2165988 emai Address: Me S=, Mobile No 0913 184 1972 couse BS Business Administration ver tee! 3rd Year Permanent Agéress 61302 Joshua Course Suite 471, North Keithton, PA 84018 First Name Middle Name Phone Number 962 780 5966 Present asdress 991 Shepherd Flats Suite 915, Jasonton, MH 34632 Phone Number _0995 322 9878 Mobile Number _ 680 688 3205, Business Address _ Rivera, Cameron and Stone, 3136 Williams Shoals Apt. 206 denblewalsh exampieorg a... prone No 3204106011 Fathers Name Troy Potter Mobile Number 8352466926 Business Adéress Hernandez, Reeves and Glass, PSC 6213, Box 8671 Fathers Email Address _alimonica example com Person to contact in cose of emergency: Name Paul Walker caress 94349 Nathan Gateway Suite 513, Port Billyside, NY 36802 Resting to Student Father Phone Number _0943 537 2448 Mother s Name Monica Williams. Mother s Email Address Business Phone No _ 2269289976, certify that the above information is true and correct Monica Williams Chavez, Jennifer John Parents Signature over Printed Name Student s Sgnature over Printed Name FOR REGISTRAR S OFFICE USE ONLY Receves ty _ Lisa Harvey MD Date Receive _September 06, 2025 Encoded by _TOni Miller Date Encoded October 13, 2024"
    },
    {
        "image": "studentinfosheet1_synth_4_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "PTUDENT PERSONAL INFORMATION FORM tesiness Anéras:, Rivera, Cameron and Stone, Business a rat Prguae ts contact i sae of mowgency: awe Paul Wall"
    },
    {
        "image": "studentinfosheet1_synth_4_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM student s Name Chavez, Jennifer John Last Name Fist Name Migale Name pate ofBietn _December 02, 2002 pace of Bieth Walkerfurt, Hungary seudent Number S2165988 Ema Address, SP Mobile No _0913 184 1972 coune BS Business Administration Yeartever 31d Year permanext adéres, 61302 Joshua Course Suite 471, North Keithton, PA 84018 pnone number 962 780 5966 present address: O97 Shepherd Flats Suite 915, Jasonton, MH 34632 0995 322 9878 Phone Number: Mother s Name Monica Williams. Mobile Number: 680 688 3205 vera, Cameron and Stone, 3136 Williams Shoals Apt. 206 debbiewalsh examole o! pusiness prone No. 3204106911 Mobile Number 8352466926 lass, PSC 6213, Box 8671 Business Adéress:, Ri Mother s Email Address father s Name Troy Potter Hemandez, Reeves and Gl: alimonica example com __ gusines Phone No _2269289976_ Business Address: Father s Email Adéress:. Name Paul Walker 94349 Nathan Gateway Suite 513, Port Billyside, NY 36802 0943 537 2448 Phone Number: Address Relationship to Student _Father 1 certify that the above information js true and correct Chavez, Jennifer John Monica Williams. Parent s Signature over Printed Name Seudent s Siature over Printed Name TOR REGISTRARS OFFICE USE ONLY Lisa Harvey MD Date Received Toni Miller Date Encoded _O September 06, 2025 i sen a Received by _ ctober 13, 2024 Encoded by’"
    },
    {
        "image": "studentinfosheet1_synth_5_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "STUOENT PERSONAL INFORMATION FORM cnsests tone Staffed, Emily Patrick ‘Lit Name First Name ‘Maddie Name ber cttem February 02 2007 once ctawtm _ Janiceside, Niger srocent thonber _S2882B16 tos asices, OT cate is 042 005 802 come BS Busi oncos tvomber 0982 2 772 88T5 mest neuen PSC 2892 02, Box 1953, APO AE 91829 es Phone Newer 096 344 4002 Metherstiame Melinda Wiggins Mobie Number, 938 402 3983x158 Bune Actes Lee Inc, 7306 Kimberly Terrace Mothers Ema Atécesr SC MANIRONRETIMIE OD sess prone tio (473 ITI 4405 faers tae David Perez. Mobis Number _387 200 2282x2267 tums teres Page Armold, 9842 Robert Shores Parters tad deren, CAVIGEI OxAMpIE COM ——ausness Prone No. 340 647 0629 Peeve $2 contact in cst of emmeegen sy: tome Mary Jones _ _ sderen 534 Gomez G Green, n, Carrolinaven,. 1A12064 trent niumaer 0992 235 0205 ~~ | corny that abe above information m trae and rorrert Stafford, Emily Patrick |_Moinga Wigg eestor a isto are {Ton aeaisraces onrice Git aesneesy Stephen Areltano catsecenee May 12 2025 | exoereey dames Horton _ pentane AB 8 725 | _ ———______—~. —"
    },
    {
        "image": "studentinfosheet1_synth_5_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM students Name Stafford, Emily Patrick Last Name Fest Name Mtge Name Date of ttn _February 02, 2001 Pace of teth _ Janiceside, Niger Student Nomber _S2882816 Emat Agéress “7 Hobie No _0942 005 6802 couse BS Business Administration SS Seittess Administration —_ Yer Lever 3rd Year Permanent Adéress 39636 Long Meadow Suite 285, West Alexandervile, MN 13313 aan Mest Alexandervile, MN 13313 Prone Number 0982 772 8675 PSC 2892, Box 1953, APO AE 91829 ____________hrone number. _0966 344 4002 Homers name Melinda Wiggins setae umber. 938 402 3983x158 tunes Agéres Lee Inc, 7306 Kimberly Terrace Moters tat Aééress, OTN NATO reumess Prone No _ A73 771 4405 tavers name David Perez store umber 387 200 2282x2267 tenes Atéres Page Armold, 9842 Robert Shores Fathers Emad Address, JAVIGBS exaMple com —_ayswess Prone No. 340 647 0629 Present Agéress tame Mary Jones atéres 531 Gomez Green, Carrollhaven, IA 12064 een, Sarromiaven, Rettionshy to Student Mother Prone Number _0992 235 0205 taformation fs true and correct —_ on Emily Parents Sanature over Prnted Name ‘Students Signature over Prated Name FOR REGISTRARS OFFICE USE ONLY seceneesy Stephen Arellano owe nenee_May 12, 2025 _ Encodes ty James Horton Date Encoeee April 05, 2025 __"
    },
    {
        "image": "studentinfosheet1_synth_5_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM Student s Name _Stafford, Emily Patrick Last Name Fist Name Middle Name Date of Birth -_February 02, 2001 Pace of Birth _ Janiceside, Niger student Number _S2882816 Email Address: “oer! Mobile No _0942 005 6802 couse BS Business Administration Year Level 3rd Year 39636 Long Meadow Suite 285, West Alexanderville, MN 13313 0982 772 8675 Permanent Address: Phone Number: Present Address. PSC 2892, Box 1953, APO AE 91829 Phone Number _ O966 344 4002 Mother s Name: Melinda Wiggins Mobile Number: 938 402 3983x158 Business Address, Lee Inc, 7306 Kimberly Terrace normanrobert example org Mother s Email Address: (473 771 4405 Father s Name_David Perez Mobile Number 387 200 2282x2267 Business Address _Page Arnold, 9842 Robert Shores Father s Email Address: _david83 example com Business Phone No _ 340 647 0629 Business Phone No. Name _Mary Jones ‘Address _931 Gomez Green, Carrollhaven, IA 12064 Relationship to Student _Mother Phone Number 0992 235 0205 certify that the above information f true and correct Melinda Wiggins Stafford, Emily Patrick Parent s Signature over Printed Name Student s Signature over Printed Name FOR REGISTRARS OFFICE USE ONLY receved ty _ Stephen Arellano Date Recewea _May 12, 2025 Encodes ty _Yames Horton bate Encoces, April 05, 2025"
    },
    {
        "image": "studentinfosheet1_synth_5_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDBETT PERTONAL IRPORMA TION FORM Stafford, Emi student s Nome OF Date of Bath 2 42 005 B602 ‘pukent fasonber _ aid Year, Sesiness Phone MY __ Hopte Number 387 2 Atsrers: PAQe david G exampie com esiness Phone Me. 340 547. rsnalk ASAE,"
    },
    {
        "image": "studentinfosheet1_synth_5_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM student s Name Stafford, Emily Patrick Last Name Fist Name Middle Name Date of itn February 02, 2001 Pace of rth Janiceside, Niger student Number _S2882816 Email Address: “Bm Mobile No. 0942 005 6802 course BS Business Administration YarLeer_3rd Year Permanent address: 39636 Long Meadow Suite 285, West Alexanderville, MN 13313 Phone Number, _0982 772 8675 Present Address PSC 2892, Box 1953, APO AE 91829 Phone Number _O966 344 4002 Mother s Name Melinda Wiggins Mobile Number, 938 402 3983x158 Business Address: Lee Inc, 7306 Kimberly Terrace Mothers Email Address: NOMANODEN EXAMPIC O business Phone No, _ 473 771 4405 Father s Name David Perez Mobile Number. 387 200 2282x2267 Business Address. _Page Arnold, 9842 Robert Shores Father s Email Address: GAVIdB3 example com —__susiness Phone No 340 647 0629 Person to contact in case of emergency: Name _Mary Jones Address 931 Gomez Green, Carrollhaven, IA 12064 Relationship to Student Mother Phone Number _0992 235 0205, certify that the above information is true and correct. Melinda Wiggins Stafford, Emily Patrick Parent s Signature over Printed Name Student s Signature over Printed Name FOR REGISTRAR S OFFICE USE ONLY. Recenes by _ Stephen Arellano Date Receives May 12, 2025 Encoded by. _James Horton Date Encodea April 05, 2025"
    },
    {
        "image": "studentinfosheet1_synth_6_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDY PRRSOWAL ipoRueTiOH RORE nner 004 655 589. S85Ex60859 13770 Burgess Tunnel a Sa. contort te cone of emer ence: Her Ca Erin Colon c Hemandez"
    },
    {
        "image": "studentinfosheet1_synth_6_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM Campbell, Tiffany Robert Last Name Fant Name Tiadle Name pate ottietn July 14, 2003 pace of uth _ Stephanieview, Burundi student Number —$8937150 Ema Address creenenase Mobile No, 0969 357 5403 BS Computer Science year Lever 31d Year 7266 Mia Land, Nealmouth, AS 66728 student s Name Course Permanent Address. 983 165 8058 Phone Number resent ageres, 64073 Stephanie Forks Sule 645, Duranchester, KY 49855 Phone Number 0916 645 8111 Mothers Name Laurie Morgan Mobile Number. 001 555 689 3556x60659 bb, Dominguez and Gomez, 41770 Burgess Tunnel _ sroter s eman Address YOIONGEXAMPLE NEL susness Prone us #1 281 824 6525x49035 25 594 9519x658 fatners tame Mitchell Lewis Mobile Number, 8: tunes addres Trevino, Gibson and Reynolds, 477 Cortez Loop Father s Email Address, jonathanhunter example met pusiness Prone No. +4 -633 715 7038x 19233 Person to contact in case of emergency: Jennifer Carter USNS Chavez, FPO AE 12533 usiness Aesress Wel Name address 0983 409 2337 phone Number 983 409 2001 geanonsn to stusent Aumt —_____— 1 certity that the above information fs true ang correct Laurie Morgan Campbell, Tiffany Robert Parents sqnature over Printed Name Grudents Sqnature over Printea Name FOR REGISTRAR S OFFICE USE ONLY November 29, 2024 aecevee y Erin Colon pate Receved Encodes by Diana Hernandez pate encoved JULY. 47, 2025,"
    },
    {
        "image": "studentinfosheet1_synth_6_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM Campbell, Tiffany Robert Wiadie Name Last Name First Name students Name pate of Bietn _July 14, 2003 piace of Birth _ Stephanieview, Burundi student Number _ 8937150 Email Address sameness Mobile No 0969 357 5403 BS Computer Science year tever 31d Year 7266 Mia Land, Nealmouth, AS 66728 Phone Number: present Address 04073 Stephanie Forks Suite 645, Duranchester, KY 49855 prone number 096 645 8111 Mother s Name: _LAUTIE Morgan Mobile Number: 001 555 689 3556x60659 b, Dominguez and Gomez, 11770 Burgess Tunnel _ 4 41 281 824 6525x49035 Course: Permanent Agéress: 0983 165 8058 Business Adéress:, Web Mother s Email Address: yeoton example net Business Phone No. fathers Name Mitchell Lewis Mobile Number, 825 59! 4 9519x658 Trevino, Gibson and Reynolds, 477 Cortez Loop ‘ample net_ gusiness Phone No... +4 633 715 7038x19233 Business Address: Father s Email Address: _jonathanhunter ex: in Jennifer Carter USNS Chavez, FPO AE 12533 Name: Address: 0983 409 2337 elationship to student. Aunt Phone Number: certify that the above information s true and correct Laurie Morgan Campbell, Tiffany Robert Parents Signature over Printed Name Fiudents Sgature over Printed Name FOR REGISTRAR S OFFICE USE ONLY: ate Recewvea _Novemt neceves by Erin Colon encosee by Diana Hernandez ___DateEnvosed “duly 17, 2025 ber 29, 2024"
    },
    {
        "image": "studentinfosheet1_synth_6_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "SY meary PRRS Ones, 1 Siephanieview, Burund Hobie No _ Year Level Mobile tember. -SSS GESSKROESS 2 and Gomez, T77e Burgess Tunnes"
    },
    {
        "image": "studentinfosheet1_synth_6_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PARSONAL INFORMATION FORM satents tome Campbell, Tiffany Robert st Hane Titties eee Ram ate offers July 14, 2003 _ mace of itn. Stephanieview, Burundi stogent Momber $8937 150 Emeit Agdres, SNON opie No _G969 357 5403 cane BS Computer Science vewrtee 3rd Year sermanent Atéren 7266 Mia Land, Nealmouth, AS 66728 _ oo _ Pout Nuober 983 165 8058 Present stress: 84073 Stephanie Forks Suite 645, Duranctestor, K Ky 49855 _ Prone Number _0916 645 6114 Mothers Name Laurie Morgan Mobwe Nemoer 001 555 689 3556x60659_ Sarmess adiress Webb, Dominguez and Gomez, 11770 Burgess Tunnel Heth Eras Adtran: ZOOOMBEXAMPIC HEE posers Pane Ne. 1 281 824 6525x4035 Father s Shame Mitchell ev Mobiie Munter 825 594 0519x050 Fathers Eman Adtress. Pantego A aesiness Phone te. +1 633- 715 7098 19239 Preian te contact in cone of omergsace: tame Jennifer Carter stir USNS Chavez, FPO AE 12523 Aeaticnsnig to Stucent: Aunt —_ _ ! | certty thar tie above information true ané correct, reves ty Erin Colon trceeee ty Olana Hernandez dete tocoses, duly 17, 2025 _"
    },
    {
        "image": "studentinfosheet1_synth_7_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM Sanders. Tony Matthew yaagie Name ‘ast ame Fort Name Pace of Beth Aiexandramouth, Grenada ute ottern July 09, 2005 $8567840 tmas Adore woman Mobile No 0907 821 7048 2nd Year student Number BS Education var tee! 550 Velez Underpass. Port Anthonyton, UT 96764 0931 504 4136 Permanent Agéress Prone Number penser aceres 451 Joann Route, Pamelaside, PA 41417 Prcee Number 0917 045 1871 secmers tame Tiffany Ryan MD. Hobde Number §27 747 6023x90928 Soto, Erickson and Baker, 19294 Park Views Suite 507 cornratoonergerares 7 Byuness one NC (652 413 8427 _ etners tat Agere, ee Matthew Floyd rroese numer 954 439 7379x26494 Trevino Mathis, 5211 Perez Junction Apt. 350 james35 example COM Business Prone NO (965 803 561 160946 student s Name Coune pusmess Agere Farmers Name tesines Agere: famners Emas Agéress shane Sylvia Howard 67401 William Pass Sul Adéress Prone Number Rewbomng to Student Aunt ite 983, West Donaldiand, MS 81982 0911 243 8270 «cert tat tne above formation m true and oTESE Tiffany Ryan MD Sanders, Tony Matthew Farents Sapature over Prnted Name Frogents Sapatere over Prated Name FOR REGISTRAR OFFICE USE ONLY necenes y Lawrence Wright pate necenes December 09, 2028 ion Burgess pate Encoaes December 23, 2024 tecceee vy 2"
    },
    {
        "image": "studentinfosheet1_synth_7_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM student s Name Sanders, Tony Matthew last Name Fist Name Middle Name Date of tien -_July 09, 2005 Pace ofits. Alexandramouth, Grenada student Number _S8567840 Email Address: TMS Mobile No. _0907 821 7048 course BS Education Yer Levet_2nd Year ress 550 Velez Underpass, Port Anthonyton, UT 96764 Phone Number 0931 504 4136 present Address 451 Joann Route, Pamelaside, PA 11417 Prone Number 917 045 1871 Permanent Ad Mother s Name Tiffany Ryan MD. Mobile Number. 527 747 6023x90928 Business Aééress., SOtO, Erickson and Baker, 19294 Park Views Suite 507 Mothers Email Address: 2oPeremstonher exari co™ usiness Phone No, 652 413 8427 fathers Name Matthew Floyd Mobile Number 951 439 7379x26494 susiness Address. Trevino Mathis, 5211 Perez Junction Apt. 350 Father s Email Adéress. JAMeS3S example cOM __gusiness Phone No. _ (865 803 5611x60946 Person to contact in case of emergency: Sylvia Howard 67401 William Pass Suite 983, West Donaldiand, MS 81982 Phone Number 0911 243 8270 Name Address: Relationship to Student Aunt certify that the above information is true and correct Tiffany Ryan MD Sanders, Tony Matthew arent Signature over Prnted Name ‘udents Sgmature over Printed Name TOR REGISTRARS OFFICE USE ONLY recevee by. Lawrence Wright ate Recewes, December 09, 2024 Encoded vy Dillon Burgess Date Encoses December 23, 2024"
    },
    {
        "image": "studentinfosheet1_synth_7_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDERY PRRE ONAL, te PERMA TICIN senige Seesent s bis Cute ofBeth dt omnes FREE CF Bent 0 Foca nating Sx20928 19294 Park Views Suite 607 Business ha, Pobée Momber QE! Bucners Agden 1 439. 7S7Sx26404 4 ane ations tomas aa a ceerty Lawrence Wright frceaen ey Olllon Burg"
    },
    {
        "image": "studentinfosheet1_synth_7_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PRATONAL INFORMATION FORM Stents tame Sanders, Tony Matthew Last Nome Fest Pine Moddie teane. Dave cteete dtily 02 2005 ace often, Alexandramouth, Grenade. Steer ender S8967EAG tras agora “MOO asnse ris 907 821 7048 cone BS Education Yartow 2nd Year mae ter, 550 Voloz Underpass, Port Anthonyton, UT 96764 _ Prone unser 0931 604 4138 rom sstne 451 Joann Route, Pamelaside, PA 11417 Prove Hever _9917 045 1871 Hethers tame Tiffany Ryan MD Mase Wamter §27 747 6023x90828 dewes Actes. Soto, Erickson and Baker, 19294 Park Views Sulte 507 Mowers Eoan Addces: _SePemwueherderarpie com Sesines Prone No. 652 44 soerstame Matthew Floyd srsue tamer 964 4399 7379x26494 fone: Acres Trevino Mathis, 5214 Perez Junction Apt. 350 Fetters tt Adie, JOMOSISBERAMIE. LOM erninecs Phone ti _ 865 803 S61 1x60946 Pesan te cane me cone of eemengeagye nase Sylvia Howard sve naser 0911 243 8270 eee 1 Tiffany Ryan MD Sanders, Tony Matthew Parents Ugeatuve over iota Nvwe Reteats Geaitare over Prased Vane FOR REGITRANS OFFICE UNE ONLY . | neces vy Lawrence Wright Date Recewes Decesnber 09, 2024 | escoseeny Dillon Burgess Owe tacoeng December 23, 2026 a"
    },
    {
        "image": "studentinfosheet1_synth_7_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM Sanders, Tony Matthew last Name First Name Middle Name student s Name pate ortieh -_July 09, 2005 pace ofbitn Alexandramouth, Grenada ——— Mobile to. _0907 821 7048 ‘student Number: $8567840 Email Address: yer tee 2nd Year couse BS Education Permanent Address: 550 Velez Underpass, Port Anthonyton, UT 96764 Phone Number: 0931 504 4136 11417 451 Joann Route. Pamelaside, PA Phone Number 0917 045 1871 Mothers Name: iffany Ryan. MD. Mobile Number: 527 747 6023x90928 susines Adéress:, SOLO, Erickson and Baker, 19294 Park Views Suite 507 caopechnoherrerie OM pyuness Prone No. 652 413 6427. Mothers Email Adéress Matthew Floyd Mobile Number 951 -439 7379x26494 Trevino Mathis, 5211 Perez Junction Apt. 350 S example com _susines Phone No. (865 803 5611x60946 Present Address: Father s Name Business Address Father s Email Adéress. _james3: te contact in c name Sylvia Howard 67401 William Pass Suite 983, West Donaldiand, MS 81982 0911 243 8270 Address: Phone Number: eationsip to Student _Aunt certy that the above information is true and correct Tiffany Ryan MD Sanders, Tony Matthew Parents Signature over Printed Name Giudents Sgnature over Printed Name FOR REGISTRAR S OFFICE USE ONLY: 4 December 09, 2024 evened ty. Lawrence Wright Date Receive encoded by: Dillon Burgess ate Encoded: December 23, 2024"
    },
    {
        "image": "studentinfosheet1_synth_8_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDRMY FEKSOHAL NPORMATION ROR Mother s Eom Aes Humber ie! Motorwa:"
    },
    {
        "image": "studentinfosheet1_synth_8_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "sYvouny PERSONAL INFORMATION FORM ua Date of 8 001 pare cttitn West Jit, Czoch Republic srutent Heciver S2232630 Cra Actress pomgren Hote No _0919 023 6110 come BS Biology _____— varus _1StYoar ‘Andersonchester, Hi 23798__ ermenens assce S148. Tammie Plaza. move vovaner 0042 836 1818 setts tane Salazal Scott Adrienne Last Nae Tite Nae June 14, 2001 a Karon, Vi 19865. enn nn prenet assres: 986 Anthony, tsie, New BE cn Har 0983 082 2926 vromurs ume DwoROH Nguyen, MoMA $4 5 25 482 434417997 sauna agers Fisher, Thornton and FIguero®, 70577 Shawn Sout Suite 876. ra tas Aten OAMTOATERTE_ seinen eee “9879000536 pewestnee Me, Mario Themas Hl. wows \"nt 901 660 275 8878x1724 “Howard Rios, 221 Rachel Motors 227 549. 9688x0881 paver Rees toivnss trent Ateress 58 Hy8t__sysines Prone Hho name JESsic2 Keller ae TX 00875 _ nein 2371 Gray Club, 1 cury wa ene above aormaon w wor 46 OTE,"
    },
    {
        "image": "studentinfosheet1_synth_8_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM student s Name Salazar, Scott Adrienne last Name Fint Name Middle Name ate of tien -_June 14, 2001 Pace of Birth West Jill, Czech Republic student Number _S2232639 Email Address: “se 1 netoom Mobile No _ 0919 023 6110 coune BS Biology Year teve _1st Year 8148 Tammie Plaza, Andersonchester, HI 23798 0942 836 1818 Permanent Address: Phone Number: 986 Anthony Isle, New Karen, VI 19885 Phone Number 983 082 2926 Present Address: Mothers Name Deborah Nguyen Mobile Number, +1 525 482 4344x17997 Business Address’. Fisher, Thornton and Figueroa, 70577 Shawn Spur Suite 876 _ Mother s Email Address: Sanchezashley exameleord ausiness Phone No. 8879909536. fatners Name Mr. Mario Thomas II Mobile Number _001 660 275 8678X1724 susiness Address. _Howard Rios, 221 Rachel Motorway Fathers Email Address: Saraward example net __ susiness Phone No _227 519 9688x6881 Name Jessica Keller Address 2371 Gray Club, Nicholebury, TX 00875 Relationship to student Aunt Phone Number, _0947 003 2358 certify thatthe above information fs true and correct Deborah Nguyen Salazar, Scott Adrienne Parents Signature over Printed Name Students Signature over Printed Name FOR REGISTRAR S OFFICE USE ONLY Recewee by _ Danielle Lin Date Recewes _December 19, 2024 Encoded by _JOShua Alvarado ate Encosea January 07, 2025"
    },
    {
        "image": "studentinfosheet1_synth_8_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM student s Name Salazar, Scott Adrienne last Name Fist Name Migdie Name pate of Bien -_June 14, 2001 pace of ith West Jill, Czech Republic ‘student Number. _S2232639 Email Address: Mobile No. _0919 023 6110 couse BS Biology Year Levet_18t Year permanent Address 8148 Tammie Plaza, Andersonchester, HI 23798 Phone Number. 0942 836 1818 986 Anthony Isle, New Karen, VI19885 none number 983 082 2926 Mother s Name Deborah Nguyen Mobile Number +1 525 482 4344x17997 Thornton and Figueroa, 70577 Shawn Spur Suite 876 _ Business Adéress:, Fisher, _sanehezastiey exanPeO9 Business Phone No 8879909536 fathers Name Mr. Mario Thomas. iit 101 660 275 8678x1724 Howard Rios, 221 Rachel Motorway saraward example net gusiness one No. 227 519 9688x6851 Present Address Mother s Email Address Mobile Number. Of Business Address Father s Email Adéress: Jessica Keller 2371 Gray Club, Nicholebury, TX 00875 Name Address 0947 003 2358 elationip to Student Aunt Phone Number: 1 certify that the above information s true and correct Deborah Nguyen Salazar, Scott Adrienne Parents Signature over Printed Name Fudents Snature over Printed Name FOR REGISTRAR 'S OFFICE USE ONLY: recened by Danielle Lin Encoded by: Joshua Alvarado pate Recenes: December 19, 2024 pate Encodes: January 07, 2025"
    },
    {
        "image": "studentinfosheet1_synth_8_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "sagan Maver . Fat Name West Jit, Cz age of Beth ES Bi Fermnunash Retress Cone __. Pree Wer Vi 19825 pone ttuber, #1 S2E4B2 4 awn Spur Suite B7E [lenny mares weet Nguyen Gres Pees ne i “| roeesyy. Danbetle Lin 18 4"
    },
    {
        "image": "studentinfosheet1_synth_9_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM student s Name Harper, Colin Karen ‘st Name Fist Name Hidde Name Date of Bien _July 29, 1995, Pace of ttn _ Port Karen, Iran student Nomber_S7833967 tmait Address “*Pe7 nscon Mobile No _ 0913 946 1223 course BS Biology Yer tee: 3rd Year Permanent agéress _779 Evan Lights, Michaelhaven, DC 53987 Prone Number 0917 551 2731 Present A éress 6019 Monica Shoal Apt. 332, Port Evan, MP 97141 Prone Number _0907 309 9108 Mother s Name Amanda Barker Mobile Number, 882 683 0959x322 tusiness Address. Daniels, Edwards and Yoder, 2849 Erica Land Suite 122 _ Mother s Email Address: enumwmameGexampenet sess Prone No, 951 696 1915 Fathers Name Matthew Sloan Mobile Number 415 930 1338x89602 tusiness Aeéress Hall Group, 141 Tammy Spurs. Father s Ema Adéress. heatherlynch example org —gysiness Phone No. _ (250 763 7236x13876 Name Kyle Chambers Address 3762 Malone Ford, Lake Mary, ID 22881 Reaticasne to student Uncle Phone Number _0976 679 0037 certify that the above information is true and correct Amanda Barker Harper, Colin Karen Parent s Signature over Printed Name Students Sgnature over Printed Name FOR REGISTRAR 'S OFFICE USE ONLY Recewes oy Angela Jones Date Recewee April 01, 2025 Encoded by Eric Brown Date Encodes April 01, 2025"
    },
    {
        "image": "studentinfosheet1_synth_9_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "STemeny PRAOHAL INBOAMATION Ronee Swests None Hamper, Colin Karon iidie Nene Date of niet vs. Port Karen, tran Sudese Nembe Permanent aseress Montene O813 948 4223 3d Year P BEET 31 tamer POE Plumber Hobe unter, 882 683 08 Daniels, Sowards and Yoder, 284% Erica Lang Business A cerers Petuantinesocsnue gt Metie s Cent Address _ oe Busineax Phome 20, _ heatherlynch examoie. org FADES BR Addoey Piriaa n casters seme shetty: Kyle 0) I j TSerty thas tee above formation b true aad Dams. erect i eum AnGela Jones focosesey Bt Bn i"
    },
    {
        "image": "studentinfosheet1_synth_9_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PERSONAL INFORMATION FORM student s Name Harper, Colin Karen Last Name First Name Middle Name Date of Birth _July 29, 1995 Pace of Birth _ Port Karen, Iran Student Number _S7833967 Ema addres 2MP 7 natcon Mobile No. 0913 946 1223 course BS Biology year Leve _3rd Year Permanent Address: 779 Evan Lights, Michaelhaven, DC 53987 Phone Number _0917 551 2731 Present agéress_6019 Monica Shoal Apt. 332, Port Evan, MP 97141 Prone Number _O907 309 9108 Mobile Number. 882 683 0959x322 Business Address: Daniels, Edwards and Yoder, 2849 Erica Land Suite 122 _ Mother s Email Address: _ shuawitams @example net Business Phone No _951 696 1915 Father s Name Matthew Sloan Mobile Number. 415 930. 1338x89602 Business Address: Hall Group, 144 Tammy Spurs Father s Email Adéress, heatherlynch example org Mother s Name Amanda Barker Business Phone No. (250 763 7236x13876 Name Kyle Chambers adéress 3762 Malone Ford, Lake Mary, ID 22881 Relationship to Student Uncle Phone Number_0976 679 0037 certify that the above information is true and correct. Amanda Barker Harper, Colin Karen Parent s Signature over Printed Name ‘Student s Signature over Printed Name FOR REGISTRAR S OFFICE USE ONLY. Recewes by Angela Jones Date Receives April 01, 2025 Encodes ty: Eric Brown Date Encoded, April 01, 2025"
    },
    {
        "image": "studentinfosheet1_synth_9_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "Cate of gay, ately 20. Parmanent Asitraee 7 308. 9108 Poth. B82. 683. n08i 5 2 8 Erica Lang we 122 c SHS Phone hie Berens Aedraey Dranieis, Edwards anc and a Yoder, 2849 thee eva oat Hrs Banta Fam S Mame Sutncss Attress A PeiROrs Seah Adsresy, het eNenber 445 990) 733 ss Eece00 39 Sens At8 be SE cra creme, Sime KYIG Char, bers Addons i Rersies by: Agta dings fe Enceted ty"
    },
    {
        "image": "studentinfosheet1_synth_9_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "STUDENT PEADONAL INROMHA TION RoRM studeas Name: Hf bs 83 5 Eawards and Yoder, 2849 Erica Land pshaweitanage neauety Angela Jones E cecodes bp i L"
    },
    {
        "image": "studentinfosheet2_synth_11_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": ""
    },
    {
        "image": "studentinfosheet2_synth_11_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "Mopubite of ee Positives BWepactment of taxation utah SCHOOLS BavEstone Riva: Student s Information Sheet name: Kelly, Denisa hast Stan, Flot Sean, sath 0 ans Section: Mame deiress: nde: Female FR Accounts: Fi Secours: Mother s teme: Nancy Goodwin Geeupation: —f Contact number: $272 #8 Accounts: Goaret 's Mawes Aer Martin fontact Number: 0958 692 30 Relation to student. FB Accounts ster atest iat ati mny know the ontrias information we tous, rompiate and aecturane as te the b. edge: ed mam ad sunbure of Bearden Pristed samie and Signature. ner Signed"
    },
    {
        "image": "studentinfosheet2_synth_11_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "“ eB Burpubinc of toe Dotioginee Bepartment of Curation S00 COON OF Severe ~~ filvss, Thomas ang Richmond Student s Information Sheet wane: Kelly, Denise Gast tame, Hrs Seaime, BA) Grade and Section: co ane: 175800599090 Mome sadness: _ £72 008 ie 0h 156, Neu Crest, 3c 3000 Birthdate: October 09, 2018 fathers tome: Michael Anderson __ occupation: _Rangeriwarden Contact umber: O953 777 7750___ Fe accounts: ininaeise Momers meme: Nancy Goodwin Contact Number: OFEB B64 3272 Gusrden s Name: Sherri Martin Contact Number: _ 958 692 3076 J attest that aff the entries intormation ae true, complete and accurate a5 te the best of any bnovdeaga: Printed nana Se etre Ome Siemed:. sun 27, 2028 Panel feortinn"
    },
    {
        "image": "studentinfosheet2_synth_11_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "Begulblic of the BhAiywiaee Bepartment af Cracationt vas, Themas and Student s infarmation Sheet name Kelly, 08 Geade and section: Home Aderes: nartheate pecmation Rangerwarden ga nccounts: michaels Ear crccupation: ta mothers vane Naney Goodwin B pa Accounts: 237083 4 contact Number Relation te student, Uncle Guardian s wane! Bp Acenunte: contact Number eaptete ond accurate as to the Dest 2 eat that all the enuries intermation ae SES any trowtedge: Sheri Martin. Jd wanne and Sans"
    },
    {
        "image": "studentinfosheet2_synth_11_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "Beyubite of che Philippines 2Bepartient of Chucation ‘uta SCHOOLS BNSHON DF Ste Thomas and R Student s information Sheet y, Denise (Gat ame, Fest iéame, Hit) Sender FB Accounts: Of Sreupation: FU Aceoomis: _muchaeiea motherswame. Nancy Goodwiry Oecupation: Contact Number: OOGS BG4- 2072 FE Accounts, Guardian s Name: Contact rumber: 095 692 2076 FR Accounts: Sheree S attest that all the cotries information ar ewe, complete and accurate as to the best of se Kelly Deni Sherri Me na aii 3 bare Signed eSigned han 27"
    },
    {
        "image": "studentinfosheet2_synth_12_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "sRarpotice a tor Bbstppines Pepartment of Ehucation semaecs orvmson oF Trompeoreat Student s Information Sheet owe: Valenzuela, Elzabeth see Ganct Name, First Nae, 060) un: 828987226162 Grade and section: Gade 11 9 Gender: Female romers name: Steven Long __ comact umber: 0997 172 3706 mothers meme: Rebecca Flores contact Number: 043 723 5032 Guantian s same: Nathan Rodriquez __ Relation to Student GUBiia\" Contact Nunvper: _ 09U5 705 6516 PB Accounts: mere {attest thet all the entrias information are true, complete and accurate as te the best of ny bn owiedge: _Blizabeth Valenzuela _Nathan Rodriguez __ ot Pareiosarinn Feuednsmased iguatwrsetvdent ted amar Bate signed Mar 25, 2025"
    },
    {
        "image": "studentinfosheet2_synth_12_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "‘Republic of the Pilippines: Department of €ducation kansas SCHOOLS DIVISION OF Thoms ——______ Robinson, Morris and Mccoy Student s Information Sheet Name: Valenzuela, Elizabeth (Last Name, Fiest Name, Mi) Grade and Section: Grade 11 D a LRN: 828987224162 Home Address; _599 Rebekah Ridge. Melissachester, AR 41032 1172006 a Gender: Female FB Accounts Birthdate: _Octob Contact Number: 0985 898 2700 Agicutral rathers name. Steven Long Scie Contact number: 0997 172 3704 FeAccounts: stevené3 Mother s Name _ Rebecca Flores Occupation: Bonds tr Contact Number: 0943-/ Guardian s Name: Nathan Rodriguez _ _ Relation to student: Guardian Contact Number: 0 985 705 6516 FB Accounts: _nathan23 {attest that all the entries information are true, complete and accurate as to the best of my knowledge: Elizabeth Valenzuela Printed name and si of Student Nathan Rodriguez dna Date Signed"
    },
    {
        "image": "studentinfosheet2_synth_12_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "Beoubile of she Doitiwines Bepariment of Cbucation SOM DUBIOH OF Ths Robson, Mort Student s information Sheet wane Valenzuela, Elizabeth Hast tne, ies ame, ib Grose andi Section: Ho LAR: @2SNBT Iz I62 Home Acidrass: _§ Bicthdete Breupation: contact Number: 09 Fo accounts: stevens Mother ssiamer_ Rebecca Flores eccupation: Bonds trader contact Murer: G12 FE Accounts: 1eheCr5? Guardian s Heme Relation te Student Contest umber 68 Accounts: attast that all the enatas information are tree, con my knowledge: Beinced manne and pate Signed Ma! ‘oi sturent"
    },
    {
        "image": "studentinfosheet2_synth_12_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "evade ot toe Dodipyines Department at Shucation ravens HOS CRNOR OF Tromesonget Robinson, Morris and Mc Student s information Sheet wom: Valenzueia, ane a Grade and Sectiow: Grae 11 9 Patherstame: Steven Long ——_ ‘Oreupation: _ consultant Contact Hemier. 2997 172 “33"
    },
    {
        "image": "studentinfosheet2_synth_12_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "— 4 B “SS Republic of the Philippines Department of Education $0105 Brow oF Thempsongut Robinson, Morris and Mccoy Student s Information Sheet name: Valenzuela, Elizabeth (ast Name, First Name, nl) OO Grade and Section: Grade 11 D URN: _ 828987224162 Home Address: _599 Rebekah Ridge, Melissachester, AR 41032 Birthdate: October 17, 2006 —rr Age: _18 Gender: Female Contact Number: _0985 898 2700 FB Accounts: #220 valezueas? Sees ult Father s ame _Steven Long sutra! Agri Occupation: consultant Contact Number: _0997 172 3704 FB Accounts: _stevené3 Mother s Name _ Rebecca Flores Occupation: _Bonds trader Contact Number: _0943 723 5912 FB Accounts: ebeccaS1 Guardian s Name _Nathan Rodriguez Relation to student _Guardian Contact Number: _ 0985 705 6516 FB Accounts: _nathan23 {attest that all the entries information are true, complete and accurate as to the best of my knowledge: lizabeth nzuela Nathan Rodriguez Printed name and Signature of Student Printed name and Signature of Parent guardlan Date Signed: Mar 212025 Date Signed. Sep 18, 2028"
    },
    {
        "image": "studentinfosheet2_synth_13_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "Republic of the Pbilippines: Department of pucation New Mexico ‘SCHOOLS DIVISION OF Martnezshire Burns and Sons Student s Information Sheet name: Moore, Tracy (last Name, Fist Name, MD Grade and Section: Grade 9 A urn: _ 453686517105 tome address: _075 Megrath Glens, East Zachary, RIA6S34— iedate: SeemDeF08 202 Age: 13 __ Gender: Male contact Number: 0960 820 7379 ___ FB Accounts: (ACY. moored father s Name _James Welch —___— ‘Occupation: _Geoscientist _james97 contact Number: 0926 148 9602 FB Accounts: occupation: Tax inspector mother s Name: Brenda Gill 0921 216 1735 _ re accounts: prendae® Contact Number: Sharon Washington__ _ Relation to student Father 0940 174 6457 Guardian s Name: FB Accounts: _sharon86_ contact Number: _ tries information are true, complete and accurate 2 to the best of attest that all the en my knowledge: Sharon Washington ___ and Parent /euardian Printed name and Signat Date signed: Oct 27, 2024"
    },
    {
        "image": "studentinfosheet2_synth_13_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "Bepwhtte of the WEee ites Wepartinent af Pocation Hexca SCHOOLS DIVISION OF Reiner whe t s Information Sheet Stucer: Name: Mogre, Tracy fast Hume, Siess Nee, bate ene Grate ones, Rome suse Sicthaste: Father s Wama _ Jain Somect Number. Mothers seme: Branda Citi Contact Surber: Suordinn s Ramm: Contact Runshors Stlation te student: Pathe: FB Aeneas attest thar all the asity fassinform ati My knewiedga: on are tise, complote _Trasy Moore Printed maine and Sign atone Here signed: May *"
    },
    {
        "image": "studentinfosheet2_synth_13_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "New Mexico ScHOOLS DIVISION OF Martinezshite _ Burns and Sons Student s Information Sheet name: Moore, Tracy eS {.ast name, First Name, MD Grade and Section: Grade 9 A urns: 453686517105 Home address: 07° Mcgrath Glens, East Zachary, Rl 46834 Birthdate: ‘september 08, 2012 age: 13 Gender: Male 0960 820 7379 _— pu pscovornes ACY NODES contact Number: Father s Name: James i Occupation: Geoscientist contact Number: 0926 1 48 9602 fp Accounts: james97_- occupation: _T2* inspector ._ Brenda Gill _ FB Accounts: brenda69_ Mother s Nam‘ contact Number: 921 216 1735 fan s Name: Sharon Washington elation to student: Father Fe Accounts: _sharon 6_ _0940 1 74 6457 Gua Contact Number: {attest that all the entries information are truer complete and accurate as to the best of my knowledge: Tracy Moore Sharon Washington Fried gare and Signature of student Fad name and Signature of Parent enardion Date signed: Ont 27 2024 Date Signed: —"
    },
    {
        "image": "studentinfosheet2_synth_13_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "Ragwbilic of the PHMepinrs Weparkment of Crucation New Maxieo SEROUS HIVISION OF Burns and Sons tuaek Namo, Slot Name, Ma} ban: 453080547105 Sender: Mate ore: FB Accounts: MACY Father s Name: cccupation _GeQsch Contact Hamber FS Accounts: _jamess? Mother s tune: Brenda Gill ‘Occupation: contact Sumber: 0921 21677! FB Accounts: Reta Contact Sumber: _0940 174 B8457 FR Accounts: _enaoaes fattest t ail the anwies intorination ave tee, om: ray knowledge: Tracy Moore on Wasn Signa Bote Signed"
    },
    {
        "image": "studentinfosheet2_synth_13_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "‘aepidhte af the Hrblisanceet Froartment of Coacstion New sow SHOES BIVEONOF Nationaehie Burns end Sous. Student s information Sheet name: Moore, Tracy io nr 4) tne: 452088517105 shone arse, rads and extiors: g ors Address Boas camtct mumber: 0 swenpation: norsname _James Welch connact neater; 0928 148 0802 bat i Recents: J! Grenda Gil anathec s Meme: “01 contact Namtbar: ether. olution to Stuatentt: E! hing cantact wumber: _ COAT 7A OO8T Fe Accounts: bast of arate as te the a age ta, complete ene 260 1 that all tire entrieasinformatin sates my knowledges"
    },
    {
        "image": "studentinfosheet2_synth_14_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "Republic of the Philippines Department of Education Nevada scHOots DIVISION OF Moinabury Armstrong Gates Student s Information Sheet Name: Howell, Maria (Last Name, First Name, MI) Grade and Section: _Grade 10 -A URN: 447233062165 \"77804 Stevens Bypass Apt. 030, North Dawn, WY Home Address: __54505 pirthdate: May 29, 2012 Age: _13 Gender: _ Female contact Number: _0926 023 9211__. FB Accounts: Maria howell35, Publishing rights father s Name: Martin Wade ‘Occupation: _manager contact Number: 0962 980 6980 Fe Accounts: marting8 Mother s Name _ Karen Martin _ Occupation: _snwabnentotfeer contact Number: _0981 336 6990 FB Accounts: KarentO Relation to Student: Guardian ryan70 Guardian s Name _Ryan Walker Contact Number: _ 0972 390 3981 _ FB Accounts: attest that all the entries information are true, complete and accurate as to the best of my knowledge: Maria Howell Ryan Walker"
    },
    {
        "image": "studentinfosheet2_synth_14_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "Ropwils of the Siiligpines Wepartorent of Cyucation Wotnabey Student s information Sheet nome, Howell, Maria task Raine, First Bene, A Grade aps Seat urns 447233082 tome nedren: Ee nirtadate: May 29 Contact Mutation: Qceupation: Fathers kame: Martin Wi contact numer: 9962 9 FB Accounts: smothers tame: _ Karen Martin 699). contest semnber: JOE ker Relation to Stastent: GUATCIAT 70 evardian s Nowe: Ryan We pa Accaunta: contact Member: GOT 2200 0001 nd aceamate as te the best of {attest that aff the entries infermation sre true, compiate a my kawwledge: Printed Bate S408: Jen a of Siadent"
    },
    {
        "image": "studentinfosheet2_synth_14_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "‘Republic of the Philippines: Department of Education Nevada SCHOOLS DIVISION OF Molnabury Armstrong Gates Student s Information Sheet name: Howell, Maria (Last Name, First Name, Mil) Grade and Secti Grade 10- A URN: 447233062165 Home Address: _ 2720 Stevens Bypass Apt 030, North Dawn, WY Birthdate: _May 29, 2012 Age: _13 Gender: _Female Contact Number: _0926 023 9211 _ FB Accounts: Maria howell35, Publishing rights Father s Name _Martin Wade ‘Occupation: _ manager. Contact Number _0962 980 6980 FB Accounts: _martinas Mother s Name _ Karen Martin _ Occupation: Contact Number: _0981 336 6990 FB Accounts: Guardian s Name _Ryan Walker Relation to student: Guardian Contact Number: _ 0972 390 3981 FB Accounts: _1 2070 attest that all the entri my knowledge: ;/information are true, complete and accurate as to the best of Maria Howell Ryan Walker Printed name and Signature of Student Printed name and signature of Parent euardian Date Signed: Jul0t, 2025 Date Signed:, Jan 10 2025"
    },
    {
        "image": "studentinfosheet2_synth_14_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "as wo Republic of the Pbilippines Bepartment of Coucation Nevada SCHOOLS DIVISION OF Moinabury Armstrong Gates Student s Information Sheet Name: Howell, Maria (Last Name, First Name, MI). Grade and Section: _Grade 10- A. URN: 447233062165 Home Address: _ 7 204 Stevens Bypass Apt. 030, North Dawn, WY Birthdate: _May 29, 2012 Age: _13, Gender: _ Female ‘Contact Number: _0926 023 9211 FB Accounts: Maria howell35, Publishing rights manager Father s Name _Martin Wade :_martings Contact Number _0962 980 6980 Mother s Name _ Karen Martin _ Occupation: _dewebement offcer Contact Number: _0981 336 6990 FB Accounts: _karen10 Guardian s Name _Ryan Walker Relation to student _ Guardian Contact Number: _ 0972 390 3981 FB Accounts: _1 2070 attest that all the entries information are true, complete and accurate as to the best of my knowledge: Maria Howell Ryan Walker Frinted name and Signature of Student Printed name and Signature of Parent evardian Date Signed: Jul0%, 2025, Date Signed:, Jan 10 2028"
    },
    {
        "image": "studentinfosheet2_synth_14_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "Remubiie of the stipes Bepartnene of fburation Neves SHOE BASIN OF etaabicy _ Aims Stude: sieme: Howell, Maria net s information Sheet Mast Rain, Fir Noon, 9 Grade and section BAN: 447 223HeO TES Den, wy Contect Number: 092 Father s team: NA Contact number: 0 Rather s tieme: Kary Gecupation: Contact Humber: O98 FR Aocamentg: Sraardinn s tse: Contact Rumba tattest that oy Kasia: Sfinformation are tn WS. enttnplate ond acourate as te y Pebntect naan nocd Suor, sees Dee"
    },
    {
        "image": "studentinfosheet2_synth_15_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "Student s information Sheet name. Wallace, Emity Mothers wame _ Laura Cardenas Contact Number: 992 088 1621 PR Aecounee: laeezy Gverdian s ame: Judith, Relation to Student: Mother Sowtact number: _ 936 982 2495 7 ‘Senetere of ParonAguardion Date Staneg: Aor 16 Rice ete Steet: sun 07. 2025"
    },
    {
        "image": "studentinfosheet2_synth_15_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "‘Wegnbite of he Bhiiwiees Wepartment of Pouration ors ACHONS BAIROR OE C7 Shane Student s information Sheet vane Wallace, Emily fast Minne ot Hang, Grose end Swrtion: tase: SODECR Genin Male FO Recesses: Sy ‘Oeeupation: Cen” FB Avceunts: Seoupation: #8 Accounts: Retstion to stuctant: FB Occonete: _satinte entriea infermation are tree, complete and ercu: FANE as to the best of 4 Pevantieasraion"
    },
    {
        "image": "studentinfosheet2_synth_15_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "Student s Information Sheet name: Wallace, Emily (ast ame, Fiest Name, Mi) Grade and Section: _Grade 9- C urn: _ 520408886402 Home Address: _437 Marshall Mills, Longville, Ml 27762 Birthdate: August 22, 2018 Age _7 Gender: Male FB Accounts: emily wallace32 Contact Number: _0994 314 2663 Conference Aaron Bush Occupation: _centre manager Father s Nar Contact Number: 0956 054 6206 FB Accounts: aaron92__ Mother s Name _ Laura Cardenas. _ ‘occupation: _Arboriculturist contact Number: 0992 088 1621 FB Accounts: laura Guardian s Name: _Judith Carter Relation to Student: Mother Contact Number: _ 936 982 8185 FB Accounts: _sth 2 {attest that all the entries information are true, complete and accurate as to the best of my knowledge: Emily Wallace Judith Carter Printed name and Signature of Student Printed name and Signature of Parent euardian Date Signed: Apr 10, 2025 Date Signed: Jun 07 2028"
    },
    {
        "image": "studentinfosheet2_synth_15_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "‘SCHOOLS DIVISION OF Port Sharon Fischer Garcia Student s Information Sheet name: Wallace, Emily (Last Name, First Name, Mt) Grade and Section: _Grade 9 C URN: _ 520408886402 Home Address: _437 Marshall Mills, Longville, Ml 27762 Age: _7. Gender _Male Contact Number: 994 314 2663 FB Accounts; emily wallace32 Conference Father s Name _Aaron Bush ‘Occupation: _Centre manager Contact Number _0956 054 6206, FB Accounts aarong2___ Mother sName _ Laura Cardenas _ ‘Occupation: _Arboriculturist Contact Number: _0992 088 1621 FB Accounts; laura2t Guardian s Name: Judith Carter Relation to Student _Mother Contact Number: _0936 982 8185 FB Accounts: _justh2 attest that all the entries information are true, complete and accurate as to the best of my knowledge: Emily Wallace Judith Carter Printed name and Signature of Student Printed name and Signature of Date Signed: _ Apr 10, 2025. Date Signed: Jun 07 2028"
    },
    {
        "image": "studentinfosheet2_synth_15_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "‘ScHOOLS DIVISION OF Port Sharon Fischer Garcia_ Student s Information Sheet Name: Wallace, Emily (ast Name, First Name, Mi) urn: _ 520408886402 Home address: _437 Marshall Mills, Longville, ML 27762 August 22, 2018 age: _7 Gender: Male sy. walace32_ Birthdate: Contact Number: _0994 314 2663 FB Accounts: Conference Father s Name _Aaron Bush Occupation: _ centre manager contact Number: 0956 054 6206 FB Accounts: _aaron92_- Laura Cardenas) ‘Occupation: _Arboriculturist 0992 088 1621 FB Accounts: !aura2) Mother s Name: Contact Number: Relation to student: Mother Guardian s Name: _Judith Carter FB Accounts: _sth 2 Contact Number: _ 0936 982 8185 | attest that all the entries information are true, complete and accurate 2§ to the best of my knowledge: Emily Wallace Judith Carter Printed name and Signature of Student Frinted name and signature of Parent avardian Dote Signed: Jun 07 2025 Date Signed: _ Apr 10, 2025"
    },
    {
        "image": "studentinfosheet2_synth_16_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "‘Reoudite of the Philigniwer Bepachoent of Churstion ies PEROGLE SIMI OF Canin th, Gi Leon Student s information Sheet name: Perkins, Christopher Past Fina, Gest Hearn, BP Grade wut Smetion: Seewpation: Osuugation: FB Accounts: Ratation te Student: contact umber: OSGB 897 B734 FR Becosinty: tesfintormation are true, complete and accurate os to the kest of 2 othest that aif the en! my kaweledge: ra ot Sinanigguwrsnay"
    },
    {
        "image": "studentinfosheet2_synth_16_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "Magublte of he BHNypines Mepariment of Coneation Mame: istopher wo fast Newte, frst Mane, Btty Grade and Section: e amen S19444 sender: Male Fa Acenunts. BR Account: Mother s Name _ Jennifer Harris Secuation: Contact Nesmber: 084 758 7980 FB Account: Relntion te stedent: fontect Muraper JOSE G97 8751 FS Aecnumts: rer d Signature of Pacanidgeardinn 6 2028 Rte Signa: Cot (4 2028 Date sized"
    },
    {
        "image": "studentinfosheet2_synth_16_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "Republic of the Bbteeieee Wepertwent of Eyucation sewer Student s information Sheet .e: Parkins, Chrisiaphe! ee lage Harse, Fist 8 Grade and Section’ Father s Name: pecupation: FB Account: contact Number: Jenner Harris mother s Mare. convact Member: O94) gelation to student: AU! guardian s tame: Renee P contact muinbor: _ OB68 697 8741 Fa Accounts: Ss entries information ave tue, compiote and acrurate ws to the Beste Tariest that aif any knowledge: pher Perkins _ Pointed Date signed: Oot! 202"
    },
    {
        "image": "studentinfosheet2_synth_16_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "Student s information Sheet Name: Perkins, Christopher (Last Reaene, First Mame, i) Fother s tame: Christopher Moore __ contact umber: 0955 004 2610 _ Mother s Name: _ Jennifar Harris Contact Number: 021 759 7060 Guardian s wame: Renee Poole Relation to student: AUN Contact Humber: 0968 697 6731 Fe Accounts: _vennesS Vateest that aif the entries information are tus, complete and accurate as to the best of my knowleder: _Christopher Perkins __ __Renee Poole _____ coat Frivied name end Signature of Cudent Frinind nama ond thenature of Pe aati Bate Stemnd _ Oct TF 2025 Date Signed, sep 02 2025"
    },
    {
        "image": "studentinfosheet2_synth_16_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "Republic of the Mittiapiner Sienactuent of Churation “regen senoous Student s information Sheet Rare: ristopher ‘adie and Section: tan: 679144005676 Homa Address: sate Sithdate: Hovemb Gender: Mais #8 Accounts: 2 Contact Samia Father s Name Gecupation: contact Number FE Accounts: imother s tame: _ Jennifer Harris Grenpation: 7980 044 7. Contact Number FB Account Relation te Student: contact Number: 0968 597 8751 FB Accounts: fences J attest that all the entiies information ave true, complete and accurate as to the bast ery ke Christ Printed"
    },
    {
        "image": "studentinfosheet2_synth_17_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "Republic of the Pbilippines Department of €ducation ‘North Dakota SCHOOLS DIVISION OF Bryanmouth Taylor Inc Student s Information Sheet name: Wilson, Michael (Last Name, First Name, Mi) Grade and Section: Grade 12 C tRN: 093372998553 Home Address: _ 59066 Jones Wall Apt, 257, Fareystad, DC 48952 Birthdate: July 16, 2012 Age: _13 Gender: _ Female Contact Number: 0907 334 5254 FB Accounts: michael wilson88 1 Father s Name _Jeffrey Alvarado occupation: _eylogeneticist contact Number: 0998 663 6783 Fo Accounts: jeffrey59 Mother s Name _ Teresa Moss. Occupation: _ TEFL teacher Contact Number: 971 322 1185 FB Accounts: 10 esa36 Guardian s Name: Michael Pierce Relation to student: Aunt Contact Number: 0943 652 4819 FB Accounts: _mechaelS3 I attest that all the entries information are true, complete and accurate as to the best of my knowledge: Michael Wilson Michael Pierce Printed name and Signature of Stadent Printed name and Signature of Parent euardian Date Signed: _ Jan 06, 2025 Date Signed. Apr 27, 2025"
    },
    {
        "image": "studentinfosheet2_synth_17_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "Rapwidic of he Piitiggines Yaepactaent of Ceueation ont Dakota sesupeus Divistets GF Beyenwneutt Student s Information Sheet tame: Wilson, Michael ages _O9RA72088855 gender: Female ame address: pirthdate: Fa accounts contact Hunter eceupation: Katie s FR Account cantar\" mother s tame: Tarasa Moss Qeupation 35. pip accounts: cconmtant 1BuenDET petation to student: AUD. euantian s Narne: contact tumber: 0943 852 Agi3 FB Accounts: axeurate as to the best cfintormation are ine, complete aid tattest that ali the entels: _Michael Pierce _ of"
    },
    {
        "image": "studentinfosheet2_synth_17_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "Student s Information Sheet (Last Name, First Name, Mat) Grade and Section: Grade 12 C unn: 093372998553 Home Address: _ 59086 Jones Wat Apt 257, Farieystad, OC 48952 Birthdate: July 16, 2012 Age: _13 Gender _Female ratners name _Jeffrey Alvarado Occupation: _HOpenetist Contact Number: 783, F® Accounts: _jeffrey59 Mother s ame _ Teresa Moss a ‘Occupation: _TEFL teacher ‘Contact Number: _0971 322 1185. FB Accounts: eresa36 attest that all the entries information are true, complete and accurate as to the best of my knowledge: Michael Pierce Frinted name snd Senaturs of Hdd inked name and Signature of Parent euardion Sate Signed Jane 28 Sue Signed age? 2028"
    },
    {
        "image": "studentinfosheet2_synth_17_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "@ Reopdiic af thr BOUipeiaen Bepactment of Coucatron Hore Dako sencors IveueN oF Sryarerouln Taylor ine —E Student s information Sheet nome: Wilson, Michael Aentannmaioen ees mother s Name _ Taresa Moss Contact Number: 0971 322 1435 ‘Guardien s tame: Michael Pierce Relation te student: AUN Contact Number: OC43 652 4819 FB Accounts: _wietanS? 1 ottest that all the entries iatormation are true, complete and accurate as to the best of my knowdedge: ;MichaslWitson __Michsel Pierce mame Sod Sinaturs of Saodent rinted vame and tignatere of Paretigcordion Cues an Oe 0S Dene thence: apezr ane"
    },
    {
        "image": "studentinfosheet2_synth_17_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "Student s Information Sheet name: Wilson, Michael (ast Name, First Name, Mt) Grade and Section: _Grade 12 C LRN: 093372998553 Home Address: _ 59086 Jones Wal Act 257, Farieystad, OC 48952 Birthdate: July 16, 2012 Age: _13 Gender _ Female Contact Number: _0907 334 5254_ FB Accounts: michael wilson88 Father s Name _Jeffrey Alvarado Occupation: _Spogeneticst_ Contact Number: _0998 663 6783 FB Accounts: _jeffrey59 Mother s Name: _ Teresa Moss ‘Occupation: TEFL teacher Contact Number: 971 322 1185 FB Accounts; 'eresa36 Guardian s Name: Michael Pierce Relation to Student: Aunt _ Contact Number: _ 943 652 4819 FB Accounts: _meneeS3 _ attest that all the entries information are true, complete and accurate as to the best of my knowledge: Michael Pierce Pred name and Snare of Sse Printed name and Signature of Parent evardion Date Signed J0n 06, Date Signed: Apr27. 2028"
    },
    {
        "image": "studentinfosheet2_synth_18_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "name: Taylor, Danny tion: Sead 1 8 Grade and Bee tome eutnaaier Septambot 20 2082 _ contact umber: 9906 208: 9112 Monica Trujiio Fa accounts reese tsother s Hame” quardien s Maree Bradley Rometo_____— notation to Studeat: Faitiel Contact Number _ 9940 102 8485 pe accounts: MOSES ____- J ottest that all vhe entrtesyinformas ere tue, comolete and accurate 28% the best of any knewtadee: Danny Taylor _ Bradley Romero Fes ona bie of 5 EY Terotare of paeaeomeom hemrrivarretn es) Dave amet: 86 MS"
    },
    {
        "image": "studentinfosheet2_synth_18_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "Republic ot the WO\" Reparanent of oucation Sarylaret scHaOns EIVINOR GF Ancien on Sheet Student s Informati nene: Taylor, Danny ann: _ 314080635574 Grade 11 5 arate and sectens wiethente: gay Sandy. 8 Account Goneset munber: 59 pecupation: _ pe nceounts: 20688 Seeupation: stothars Name. ss: montcas FB Arcount contect Sumber: polation te student: Pais! Bradiey xi 0102 8485 Guardian s Name: £8 Accounts’ eontact Number: eas to the best of the entéies infasmration are tose, complate and accu at 1b atkest the say kmowledire Gradiey R ane Signet, fan 18 2025"
    },
    {
        "image": "studentinfosheet2_synth_18_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "o ‘Republic of the Pdilippines: Department of Education ‘Maryland SCHOOLS DIVISION OF Arnoision Student s Information Sheet name: Taylor, Danny Gunes none ———s Grade and Section: Grade 11 68 __ urn: 314060635574 Home Address: ‘537 Jessica Unions Sute 086, Nicholasbury, VT 20991 pirtndate: Sepmmber20 2012_ age: _13 _ Contact Number: 0906 988 3112_ rather s Name: Eric Mcknight _ EET vcore mother s Name: Monica Trujillo Contact Number: 0922 891 6780_ FB Accounts: monicadt_ Guardian s Name: Bradley Romero. Relation to student: Father brady FB Accounts: Contact Number: _0940 102 8485 \\ attest that all the entries information are true, complete and accurate 2 to the best of my knowledge: Danny Taylor Bradley Romero Frinted name ond Signature of Parert eerdion Printed name and Signature of Student ‘Sep 14, Date Signed: Mar 18 2028"
    },
    {
        "image": "studentinfosheet2_synth_18_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "Student s Information Sheet name: Taylor, Danny qost tame, Fist Name, MD a Grade and Section: Grade 11 B. LRN: _ 314060635574 Home Address: 537 Jessica Unions ‘Suite 086, Nicholasbury, VT 20991 virmaate; Sepember20 2012_ Age A meetae contact Number: 412 Fe Accounts: SANny: taylor38 occupation: Eric Mcknight Father s Name: contact Number: 906 095 5608 Monica Trujillo _ a re Accounts: monica! Mother s Name: _ contact Number: 922 891 6780 Relation to Student: Father Bradley Romero FB Accounts: bradley 1 attest that ail the entries information aF& true, complete and accurate as t0 the best of my knowledge: Danny Taylor Bradley Romero Feated name and Signature of stadent Find name and signature of Parent evarsian ‘Sep 14, 2025 Date signed. Mar 18 2025 Date Signed:"
    },
    {
        "image": "studentinfosheet2_synth_18_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "Republic of the Poilippines Department of ducation Student s Information Sheet Name: Taylor, Danny Grade and Section: Grade 11 8 Home Address: Birthdate: Seok Contact Number: 0906 095 5 Mother s Name _ Monica Trujillo Contact Number: _09, PereziLC 537 Jessica Unons Sute 086 1 391 6780 _ Marylang SCHOOLS DIVISION OF “Arnokston (ast Name, First Name, nai) oo HRN: 314060635574 Gender: Female FB Accounts: danny taylor36 _ Occupation; _ FB Accounts: eric8g Occupation: _ FB Accounts: _monica9} Guardian s Name; Bradley Romero Contact Number: my knowledge: Printed nay Date Siened Sa 0940 102 8485 Danny Taylor 2nd Signature of Student _ Relation to student: Father_ FB Accounts: _¢ Slenature of Parent eua Mar 18. 2025 Date Signed"
    },
    {
        "image": "studentinfosheet2_synth_19_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "Biguillie the Brilizpoes Mepgarinent a Cevcetion nw Yor SCIMIOUS DNAHON OF Bast ates tudant s Information Sheet same Blackburn, Witiara Gast eearve, Fest pana, Ret Gracia ant Se Home Adetsexs: Birthdate: Contact Aare fathers name: Paul White __ conswet Number: BE34 4504E32 Fm ncconeitss_ pat Decupati tothers tame: Debbie Young contact Member: 9902. 950 2429 Greupation: Suardian s Narae: Relation to Stadent: Conivet Number: _ FR Accounts: 8 aétest shat all the entrins, _ covnplete and accurate as to the best of my knowledge William Biackd ate Signed, Aug 23, 2035"
    },
    {
        "image": "studentinfosheet2_synth_19_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "Republix ot the Bettegtues: aepachuent af Coucation Studant s information Sheet tone: Blackburn, Wiliam eset Morne, First Sanne, Naty Birthitate: fattecsneme Paul White Saniact Hrnber, 0934 460. 12: Mothers Mane: Debbie Young Contest Suenber: _ 8 Suardian s meme: Mr. Steven Gi Centert Sumber: _ 0972 858 97 7% BB Aocounts: F attest thes all the entries intormat Hon are tue, complete and accurate as te the best of my hnowiedge: Willa Bt pekbous"
    },
    {
        "image": "studentinfosheet2_synth_19_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "Vazquez, Gibson and Humphrey Student s Information Sheet Name: Blackburn, William (ast Name, First Name, Mi) Grade and Section: _Grade 7 -C urn: _ 559350980310 Home Address: _ 7867 Edwards Mission Apt 704, Lake Ashlee, 1D 09146 Birthdate: August 22 2008 age: _17 __ Gender: _ Male Contact Number: _0989 399 4882 FB Accounts: Sam blackburn? Father s Name: Paul White Occupation: _Mudlogger Contact Number: _0934 460 1232 FB Accounts: _paul6S Mother s Name _ Debbie Young Occupation: _orsculunst Contact Number: _0992 950 3429 FB Accounts: debbie}! Guardian s Name: Mr. Steven Gonzalez Relation to Student: Uncle _ Contact Number: 972 859 9770 FB Accounts: _1 83 attest that all the entries information ar my knowledge: 1e, complete and accurate as to the best of im. Mr. Steven Gonzalez Printed name and Signature of Student Printed name and Signature of Parent evardian Date Signed: _ Aug 23, 2025 Date Signed’, Nov 26 2024"
    },
    {
        "image": "studentinfosheet2_synth_19_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "Republic of the Philippines Bepartment of Education New York SCHOOLS DIVISION OF East Valerie Vazquez, Gibson and Humphrey Student s Information Sheet name: Blackburn, William (Last Name, First Name, M1) Grade and Section: Grade 7 C LRN: _ 559350980310 Home Address: _ 7667 Eovards higsion Apt. 704, Lake Ashes, 1D 09146 Birthdate: August 22, 2008 age: 17 _ Gender: Male Contact Number: _0989 399 4882__ FB Accounts: william. blackburn 7 Father s Name _Paul White occupation: Mudlogger contact Number: 0934 460 1232__ FB Accounts: _paul6S Amenity Mother s Name _ Debbie Young _ ‘Occupation: __horticulturist contact Number: 0992 950 3429 FB Accounts: debbie3! Guardian s Name: Mr. Steven Gonzalez Relation to student: Uncle contact Number: 0972 859 9770 FB Accounts: 69 attest that all the enteies information are true, complete and accurate as to the best of my knowledge: William Blackburn. Mr. Steven Gonzalez Printed name and Signature of Parent guardian, Date Signed Nov 26, 2024 Printed name and Signature of Student Date Signed: _ Aug 23, 2028"
    },
    {
        "image": "studentinfosheet2_synth_19_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "Bonds of of ier BUSEY of @pucatton tise YOR vazque’, srudent’ come. Blackbur, William space mom, Ft semis Pa _ _——— rainers wore: 232 qunrdion s tiaine: ME conigce number: 0972 959 9770 pattest nat di rhe entiasfinformation xy Enoelet ge Wiliam Blache ins a Hate one gs we jeu ore oe FON ST ng Humpheey _——— 5 information J tee, complete and 06st heet rood 5393280316 Mudiogger counts: paulss ae v0 ae ‘oceapation® a Accounts SINCE. 93 pe aceonte: 3 aetation to Student arate ante tne best of"
    },
    {
        "image": "studentinfosheet2_synth_20_aug1.png",
        "label": "studentinfosheet",
        "ocr_text": "Louisiana SCHOOLS DIVISION OF Wendyton Hunter Brown Student s Information Sheet ‘ame: Woods, Harry (ast Name, First Name, na) Grade and Section: Grade 11 B urn: 919189790008 Home Address: _67246 Justin Mountain, South Zachary, AK 42041 Birthdate: July 25, 2006 Age: _ 19 Gender: Male Contact Number: 094 933 3967 FB Accounts: harry woods20 Father s Name _Christopher Goodwi ccupation: 282 B hcer Contact Number _0914 905 0858 FB Accounts: christopher34 _ Mother s Name _ Kelly Jones Occupation: _Arboriculturist ‘Contact Number: _0922 304 1299 FB Accounts: kelly43 Guardian s Name _Kimberly Campbell Relation to Student _Mother_ Contact Number: _ 968 500 3695 FB Accounts: _kimberiyé attest that all the entries infor: ‘mation are true, complete and accurate as to the best of my knowledge: Harry Woods Kimberly Campbell Printed name and Signature of Student Printed name and Signature of Parent guardian Date Signed: Apr 06 2025 Date Signed: Feb 21, 2025"
    },
    {
        "image": "studentinfosheet2_synth_20_aug2.png",
        "label": "studentinfosheet",
        "ocr_text": "‘Republic of the Philippines: Department of Education Lousiana SCHOOLS DIVISION OF Wendyton Hunter Brown Student s Information Sheet Name: Woods, Harry (ast Name, First Name, Mi) Grade and section: Grade 11 B ta: 919189790008 Home Address: _67246 Justin Mountain, South Zachary, AK 42041 sirthdate: July 25 2006 age: _19 Gender: Male Contact Number: 094 933 3967 _ FB Accounts: Nafry woods20 ith an Father s Name _Christopher Goodwin Occupation: SS aaiser Contact Number: _0914 905 0858 FB Accounts: _christopher94 Mother s Name _ Kelly Jones Occupation: _Arboriculturist Contact Number: _0922 304 1299 FB Accounts: *elly43 a Guardian s Name _Kimberly Campbell Relation to student: Mother Contact Number: _0968 500 3695 FB Accounts: _Kimberh6 attest that all the entries information are true, complete and accurate as to the best of my knowledge: Harry Woods Kimberly Campbell Printed name and Signature of Student Printed name and Signature of Parent euardian Date Signed: Apr 06 2 Date Signed. Feo 21. 2028"
    },
    {
        "image": "studentinfosheet2_synth_20_aug3.png",
        "label": "studentinfosheet",
        "ocr_text": "‘Bepartsxent of @eucation Lease semen Breen os eee Hunter- Brown. wformation Sheet Student s fi ame: Woods, Harry gaan: INEI7HRIOS meade and section: C8 3 Biindate: Fy Aceountt contact Numbers 0880 994328 occu: sativests amet PH Ancount®: cemnact Humber oecupations aaotrersvame: Kelly Jones pe accouets fantact Member tetarion ve states: MOTEL, antec 8 Aceowat attest that af the untelesfinigrmution e grae, enenplate and accutane as 2 SF ber"
    },
    {
        "image": "studentinfosheet2_synth_20_aug4.png",
        "label": "studentinfosheet",
        "ocr_text": "sof the Milltasines Biepariment of Chueation SeKwors Hunter Brown VISION OF andylen Student s information Sheet wane: Woods, Harry sat Mame, Firat Name, 80} Grate and Section: LRN: Home Address: ak 42084 Bithdare: Jul Contact Number Father s some. Contact Humber, Mothers Name: _ Kelly Janes. Guardian’: contact"
    },
    {
        "image": "studentinfosheet2_synth_20_aug5.png",
        "label": "studentinfosheet",
        "ocr_text": "Kecgubste of the PHIOwIPES Mepartment 2 Sxmeatlest seapoaronesiaes oF Wendre® formation Sheet Student s tn mae, Woods, Harty suave Natne, Fra tee, Hi) Home ndstrese contact Mumia: varned s Have? contact Number Kelly Jones semnpation 922 304 1298 another s Name ya accounts: SS enmbact teenie gatation to student: MIC a Guardion s Neree! 2S _ 6968 500. -3885 PB Ancaumts: contact umber aneest that ail she entriesfinformation 26 qrue. complete ant accurate 3512 the bes! my knowledge y Woods __ patsre Foinked cave ed bate manne. A"
    }
]