[
    {
        "image": "studentrecord1_synth_10_aug1.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYNILA Sta. Mesa, Manila Student Personal Record Form Student Information ADAM BUSH ‘CAMPBELL Middle Name: Last Name: First Name: Gender: Male] Female] School Level: =¥ercx= Age: 7 Birth Date: 12 _/ 07 2007 Birth Place: cs ocen Bom Again Christian Religion: Civil Status: “°\"*4 Address: san ETE Fin Code: 2 Mother s Guardian s Name: \"n= Wison Contact Number: 921 1095 Father s Guardian s Name: 22 55™\" Contact Number: 97° °*\"#18* Who shoud be contacted first in case of emergency? 0 Mother O Father @& Other Name ___N veiss Seay Relationship _° __ Contact Number: °°73°%? Primary: 22” oreze Elementary Shoo! Scheel” Year: 2000 2015 (cal Vite, Met Manta School Address: ‘Quezon Cty High Schoo! 2015 2021 School Year: Joseph Vile, Metro Manda Secondary: School Address: University of Santo Tomas. 2021 Present Tertiary: School Year: Past Vile, Metro Mania School Address: Adam Campbell Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_10_aug2.png",
        "label": "studentrecord",
        "ocr_text": "TASAN NS LUNGSOD No MAYNILA gta, esa, Manila PAMAN Student Personal Record fornt ~~ Biudent Injorm 1 Last tame. ewvat Nome Middle fame an \\ 1 io BB Femaiet} Schoo! awels Age _t fl z Birth Piece: 52\" a \\ Birth Date: | Religie mages estan Civil Statue: vores Mother siGuardian s Nam Father si uaratan s tare: ____ Sontaet Bamber: | wag shoud be contacted first in ease of emergency? i Ti} Mother | Felationshin: _ Contact Number oes 2088 i Primary: 5 Schaal Aadrees: _ ratty of Se i i i Sehoot Address: — | Name 2 the Printed"
    },
    {
        "image": "studentrecord1_synth_10_aug3.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN IG LUNGSOD NG MANNA ‘Sta. Mesa, Manila Student Personal Record Form Student Information LastName: care. pi Name: Ada Middle Name: US# Gender: Male §&) Female) School Level: 15YeH Catege Age: 7 _syercay rc Birth Date: 12 07 2007 Birth Place: Caloocan 2 fof 2007 Stes Religion: 2°\" 49m Cnstan ee Civil Status: «=e Address: Zinn \"9 Voom sono rex on Zip Code: 29% Mother s Guardian s Newser Contact Number: °°5921 1003 Father s Guardian s Name: «= Sm Contact Number: °°7 541 1104 Who shoud be contacted first in case of emergency? O Mother O Father other Name: Nehous Bray Relationship: 7 Oo tact Number: °\"7 85 8509 Primary: 58° Lorenzo Eementary Schoo) Schoo! Year: 2000 2015 School Address: C08? Ye Metro Mans Secondary: 94 57 Cy Hon sehoo! School ier Ot School Address: seh Ve Meo Mania Tertiary: YY 01 Sant Tomas 2021 Present School Year: School Address: Pesves eto Mats Adam Campbell ToO_ Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_10_aug4.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG RAD Sta. Mata, Manila Student Personal Record Form Student Information - 7 Last Name: SS: Firat Name “OM Middle Name: Gender: Mate @Q Female) School Level _ j_Y__) 67 ‘Bitth Place: See ee er Address: Contact Ni ¢008321 033 Whe shoud ve contactad trat in case of emergency? CJ Motner DB Fathor ii Adar Campbell Student Signature over the Printed Name | j"
    },
    {
        "image": "studentrecord1_synth_10_aug5.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN Ne LUNGSoD NS MAYNILA Student Personai Record Form : Studer nicrmation .. First Name: BJ fsnaiel senoot Levet: Gender: Mats | Birth Sete: Mothar steuentian s Nama: Parhsr st uardian s Mame: Sth) | Whe shoud te Conteriod frst in cae of omergency? {3 Motror i nnn COMREE Murer: [OE Famer 8 Cinar p88 Sentact Numbar; hook Yeas: 99 ve Student Signature over tha Pr i inted Name |"
    },
    {
        "image": "studentrecord1_synth_1_aug1.png",
        "label": "studentrecord",
        "ocr_text": "TECHNOL OS IGA UNvERsmry Sani Juan, thetro tasty Student Personal Recora ¥orn Gonder: Male) Femain 8) Shoot Love Bieth Date: 0 1208 Bint 7"
    },
    {
        "image": "studentrecord1_synth_1_aug2.png",
        "label": "studentrecord",
        "ocr_text": "NEG ool) OGICAL PRERSITY HE PHILIPPIN sar Jian, Minto Mii Student Personal Record Fora Siusient Information wELODY _. iret Name, i Gender Malic {J Fen Bivth Bete: OF 1 Retigies Contact Numhex } Whe shoud be contacted first in case of emergency? 1 Mother |G Father Primary: ren | School Adsirees: nies eiy of Tentiy:* Schoo! Address:"
    },
    {
        "image": "studentrecord1_synth_1_aug3.png",
        "label": "studentrecord",
        "ocr_text": "TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES San Juan, Metro Manila Student Personal Record Form Student Information MELODY AGUILAR HEATH Middle Name Last Name First Name Gender: Male Female J School Level: sede 11 Age: a Birth Date: _ _08_/ 2004 Birth Place: \"st Civil Status: “°\"*4 Address: 7 7 8 SS Zip Code: '** Mother s Guardian s Name: Ss Adkins Contact Number: °°? 797542 Father s Guardian s Name: #0782 Contact Number: 977 \"2025 Who shoud be contacted first in case of emergency? D Mother i Father D Other Name Can Campos Relationship __ __ Contact Number: 927 '82 8°* Primary: 282 Cty Bement hoo! School Year: 2000 2018 School Address: dames Wis Mev Manis Secondary: Penns Sette Han Seto! Schoo! Year: 2ov4 2022 School Address: tenis Nevo Maris Universiy of Santo Tomas 2021 Present Tertiary: School Year: lero Mania School Address: Melody Heath Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_1_aug4.png",
        "label": "studentrecord",
        "ocr_text": "TECHNO! OGICAL UNIV! HE PHILIPPINES gsiTy ful, Metro Manila Student Personal Record Form Student Information Last Name: \"©\" First Name __ “°° Middle Name _ “°U™*® Gender: Male} Female) School Level ___ owe Age: 2 Birth Date: / 0% 20% Birth Place: Ms Religion: Civil Status: “\"\"* Address; “\"\"“ Se\" Zip Code: |*** Mother s Guardian s Name: “rm Ass Contact Number: 20 4° Father s Guardian s Name: “** re\" Contact Number: “77 '?° Who shoud be contacted first in case of emergency? Mother Father D Other Name Cot Campos Relationship __ __ Contact Number: _°*”\"\"*° Primary: 22122\" Cty Exmentany Scoot ‘School Year: 2000 2018 Jones Ve, Mabe Mane a a zovecoa2 om Vie, Mate Mas School Address: Present Tertiary, tae me Schoo! Year: aon Vanes Vi, Mave Mata Melody Heath Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_1_aug5.png",
        "label": "studentrecord",
        "ocr_text": "TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES San Juan, Metro Manila Student Personal Record Form Student Information LastName: ‘© First Name __ Y_ Middle Name _ “US _ Gender: Male] Female) School Level ___omses _ Age: 8 Birth Date: % 2004 Birth Place: Religion: \"” Civil Status: “\"** Address: \"=\" ___ zip Code: Mother s Guardian s Name: rm A\" Contact Number: 2%?***° Father s Guardian s Name: “**°*\"P°* Contact Number: °*” \"7° Who shoud be contacted first in case of emergency? Mother &) Father Other Name: Cas Compos Relationship __ _ Contact Number: °*7 _ Primary: Sw Cy erent Sees! School Year: aes nes Vn, er ne a we se a ear: eweaezz ——\" van eee 1 _ Unoerty ot Sento Tomas s Year: 202) Prevent a Vm a, eb nt Melody Heath Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_2_aug1.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES ‘Manila, Metro Manila Student Personal Record Form Student Information suit Last Name: “ASSY __ First Name.“ _ Middle Name aleO Female &) School Level __ 06 05 _/ 2006 Birth Place: 2\" °% ____ Age: Gender: Mi Zip Code: p08 ess 1 8 Bake Road B2ev9s “Contact Number: oace se270@ Father s Guardian s Name: “\"\"\" Witton _ Contact Number: Lsaneseianl acted first in case of emergency? Who shoud be conti 1 Mother Father D Other Name ___ esem __Relationship: primary. tracmmcerenunsens _ Scho! Year: meso School Addres: a Secondary: mere Serres ONS ‘School Year: ___ eae ae. Meo Manis Meagan V School Address: Unwersty of Santo Tomes __ School Year Tertiary serge Vile, Metro Manda School Address: __ Alexa Massey ee Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_2_aug2.png",
        "label": "studentrecord",
        "ocr_text": "POLYTEGHNIG UNIVERSITY OF THE PHILIPPINES Manila, Metro Manila Student Personal Record Form Student Information oe Middle Name: Age _\" —— sat masseY _ First Name:. Last Name: Gender: Male} Female ate: _/ 05 2006 Grade 12 1 School Level: Birth Place: 822° Birth D Religion: ose sexrzone tos sen S128 ip Code: 008 civil Status: Address: Hei Moris Contact Number: 980 206 2799 Mother s Guardian s Name: Contact Number: coe er siGuardian s Name: rire OES Fath se of emergency? Who shoud be contacted first in ca: (Mother Father 0008 208 2798 Di Other noe eetege a (or oer ‘School Year: 2007 2017 primary: mo tementary Schoo! School Address: Coristopher Vile, Meio Marla 20152018 Secondary: pnappine Seance Han S09! School Year: Meagan Vile, Metro Manis Name: 2021 Present school Address: School Year: nto Tomas ore of Sa ergo Vale, Metro Manda School Address: Alexa Massey student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_2_aug3.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVE OF THE BAIIRPINES Manila, Metro Manila Student Personal Record Form Student Information ALEXA ‘SMITH Last Name __MASSEY__ First Name: Middle Name: Gender: Male) Female &) School Level: Grade 12 Age: 2 Birth Date: 0 05 2006 Birth Place: vez\" Cty Religion: ***\"°*\" Civil Status: “\"** Address: 8885318555 Zip Codes\" Mother s Guardian s Name: \"Moms Contact Number: 98 278° Father s Guardian s Name: \"Wise\" Contact Number: 7°\" °°2 Who shoud be contacted first in case of emergency? @® Mother O Father O Other Name =—— Relationship __ __ Contact Number: °°\" 227° Primary: Mavis Conta Sementary Shoo meeikvear pia School Address: Christopher Vie, Mato Mania ‘Secondary: “mePne Senco” Schoo! School Your 20152018 School Addre: rare Tertiary: mrt Sere Tome School Year: ee School Address: Ser Alexa Massey EEE ‘Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_2_aug4.png",
        "label": "studentrecord",
        "ocr_text": "Sidesie py ronal Record Porm todenr information Foret Mame Mie PR Sever over fey ace Relig Cenect Mumnher _ COMIC) Montes encys TQ, whe Rotesonsnrg Contest Numiy: Address Oo Seeandary, 5 oe on. Scheel Yea, Scheer Agdrean : School ves, i"
    },
    {
        "image": "studentrecord1_synth_2_aug5.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Manila, Metro Manila Student Personal Record Form Student Information LastName__Y FirstName: “©* Middle Name.\" Gender: Male) Female &) School Level: Grace 12 Age: id Birth Date: _/ 05 2005 Birth Place: Qve 7c _ Ipiesa n: Crsto Religion: Civil Status: “2 Addrose: SMH Ba S28 Dip ggg, Mother s Guardian s Name: “**\"o\" Contact Number: °°8888279 Father s Guardian s Name: “™%* \"son Contact Number: °°\") Who shoud be contacted first in case of emergency? B® Mother O Father D Other Name Hei Moms Relationship __“°\"\"\" Contact Number _ 0 27 Primary: \"sr Carta Eerenay S091 School Year: zoor2o17 2018 School Year Meagan Ve, Mave Manda School Address: Unversity of Santo Tomas Present Tertiary: ___ School Year: _ Serge Vile, Mato Mania School Address: Alexa Massey ‘Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_3_aug1.png",
        "label": "studentrecord",
        "ocr_text": "I i TECHNOL OG, PRILBAIVERSITY Malolos, Bulacan Address: °° 5 Ross ran sg Zip Code: **°"
    },
    {
        "image": "studentrecord1_synth_3_aug2.png",
        "label": "studentrecord",
        "ocr_text": "TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES Malolos, Bulacan Student Personal Record Form rc Student Information ‘1 Last Name: °ENNETT_ First Nam Desond Middle Name: Gender: Male} Female) School Level: Grade 11 Age: 2 Birth Date: \"2 23 202 Birth Place: So Bom Again Chestan Civil Status: °°\" _ 812 Som Road, Tabon, 85 SAF Pip Code: “2? Mother s Guardian s Name: “*o y Noses Contact Number: °°'°28248\"° Father s Guardian s Name: °=\"5™=\" Contact Number: 27820\"! Who shoud be contacted first in case of emergency? D Mother I Father Other Name __ See\" Sn Relationship __ __ Contact Number: °°\"! Primary: 28622\" 0 Exmentay Senos! School Year: Ltated School Address: a Secondary: “rss” 999 School Year: a School Address: ——e 2020 Present Tertiary: rm See Tot School Year: En Vie, Metro Mania School Address: Nicole Bennett _—— Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_3_aug3.png",
        "label": "studentrecord",
        "ocr_text": "TECHNOLOGICAL INIVERSITY OF THE F HILIF PINES Student Personal Record Form Student Information Last Name: \"ETT First Name __ “°F _ Middle Name: wees Gender: Male) Female &) School Level __wse '' Age: Birth Date: '?_/ 2 202 Birth Place: S* Religion: 7 Civil Status: °°?\" Address: 2 TEM Zip Code: Mother s Guardian s Name: “°* \"*\"* Contact Number: °*' '* Father s Guardian s Name: \"°*\" °°\" Contact Number: ***°*\" Who shoud be contacted first in case of emergency? OD Mother Bi) Father Other Name Leena Relationship __\"*\"*\" Contact Number: “*°*°*! Primary: Ot\" “ty Sennen Sopoet Schoo! Year: soonaene ‘School Address: a Secondary: ““\"* \"7°\" School Year: sree School Address: Ooms ese Tertiary: ree Schoo! Year: seers School Address: nn Nicole Bennett ‘Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_3_aug4.png",
        "label": "studentrecord",
        "ocr_text": "TECHNOLOG! UNINERSITY OF THE PHILIPPINES Malolos, Bulacan: Student Personal Record Fern: r Father s Guardian s Name, Seetsom Who ahoud be contacted firet in cuse of emergency? Mother BH Fetner i 1D other Fecar co rf _ uzageece: 2008 2015 Nicole Beanett Stustent Signature aver the Printed Name | i"
    },
    {
        "image": "studentrecord1_synth_3_aug5.png",
        "label": "studentrecord",
        "ocr_text": "Wee Lest Nemes inet Same: __ Miceiie Nasne_ Gende: sale] Femstciif School Levels _ Age: if Birth Plana 2 i H Bith Bote: i Religion civ states address Mother sfGuardian s Name Miooy unex Conant Humbe: __ Contact Number: pather stGuardion s Name 2257\" of semengency? yoho shoud he contantad first in cane iy Suntan i Primary: i Schoot Address: Netoon igh Sona secondary: 0\" Bohoot Address: t i gehool Address: i | i |"
    },
    {
        "image": "studentrecord1_synth_4_aug1.png",
        "label": "studentrecord",
        "ocr_text": "UNIVERS Pry gy Diudeit Porse et Now fardute Name Age {Biren Os ‘Setigion Coat Statue oe a Ta SRstee 2p Code: Mather sigus tdi2e s Mane | Bathar eBian s Name 9 Contact is Who oh hel ODF vic Nome a td Be CONtacredt tie atin #50 CF emergeiay? Contact Number. hoal Yaar ve School Address, Secondary: Seton Adare: etiary hoot Asness,"
    },
    {
        "image": "studentrecord1_synth_4_aug2.png",
        "label": "studentrecord",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES Manis, Metts Man Student Persenal Record Form Student information jbast Bama. __ Middie Mame. _ Gonder Male fj Fematel) Schasi Level girth Det aur Hetigion: ‘ chat Saat Mother stGuardian s Name.” gather siGuardian s Hama: 27 507° | who shoud be contacted firsi in case of emergency? i __Feintionship _ _Sehooi Year: | i i i fertiang i \\ Schoot bere nr nemennnin | | i | H Kristine Acaveds i |"
    },
    {
        "image": "studentrecord1_synth_4_aug3.png",
        "label": "studentrecord",
        "ocr_text": "UNIVERSITY OF TH PHILIPPINES e Manila, Metro Manila Student Personal Record Form Student Information LastName: __A SVEP° FirstName: \"STINE fiddle Name _S S0\" Gender: Male] Female BX) School Level: case 11 Age: 20 Birth Date: °' 28 2005 Birth Place: Suscan Religion: \"=\" Civil Status: °°°* Address: Snaw sms\" Zip Code: \"2° Mother s Guardian s Name: “!\"# Gross Contact Number: °%99725728 Father s Guardian s Name: /2\"\" 8s Contact Number: 977778? 84 Who shoud be contacted first in case of emergency? Mother O Father O Other Omnia Gross Relationship __ __ Contact Number: °°***7 972 Jementary Schoo! School Year 2012 2012 ‘Aber Vile, Mato Mania School Address: ional 00 2017 2020 National High Senoot School Year: Denna Vile, Metro Mania Secondary: School Address: 2020 Present De La Sale University School Yea Tertiary: (George Ve, Metro Mania School Address: Kristine Acevedo Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_4_aug4.png",
        "label": "studentrecord",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES entia, Move Mails Stodent Personal Record Form act Mares ‘Gender Malef} Female School Level: Bath Place’ Birth Dave: so By Ratigion: Civit totus: 2 _ Aeteirewin: i Mother s Guardian s Nama S7* _ Geniast Number: 2 i i Father siGuargian s Mane: J i Who shoud be contacted tirst in care of emergensy? fl _ School Year: _ Gage ie Nermeinee"
    },
    {
        "image": "studentrecord1_synth_4_aug5.png",
        "label": "studentrecord",
        "ocr_text": "UNIVERSITY OF THE PHINPPINES anita, Met Mia Stadent Personal Record Form Student information [isst Mame: First Name Midelie Mame: (1 Fomaic i Sehoai Lave! Age: 30 Birth Piece: Civif Status: Address: _ Bip Cede: Sontact Numbe: Mother s Guardian s Name. Father s Guardian y Name: Contact Mumber: i Who shoud be contacted first in case of emergency? BE Mother Fe i Lop ote Name _ Relationship: Primary: School Addr Secondary: School fear: _ i Dora Vite Meira Mans Schoo! Address. Vertiany i Schoo! Address: Schuol Year: Kjistine Acevedo :"
    },
    {
        "image": "studentrecord1_synth_5_aug1.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Sta. Mesa, Manila Student Personal Record Form Student Information c LastName: HENDERSON First Name: TIMOTHY okt Middle Name Gender: Male) FemaleO) School Level: _ ver case Birth Date: 9 _/ 03 2005 Age: 20 Birth Place: Meta Religiot Civil Status: “*\"*# Address; SPT nse Oi Code 2177 __ Contact Number: °%9265 2554 Mother s Guardian s Nam Apel Tums Father s Guardian s Name: 0925 608 0447 Contact Number: Who shoud be contacted first in case of emergency? D Mother Father O other Name ___vansstemande: Relationship: ***\" Contact Number: °97 4 5 47 Primary: 58 Lorenzo Elementary Schoo! School Year: 2010 2017 School Address: Ere Vie Mato Mania Secondary: Sr\" Hon Seon School Year: 2012 2020 School Address: Carett Vile, Metro Manta nversty of Santo Tomas 2020 Present Tertiary: “Ye of Sento School Year: School Address: Jeremy Vile, Metro Mania Timothy Henderson i ‘Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_5_aug2.png",
        "label": "studentrecord",
        "ocr_text": "EE PHILP, St Mose, kaanis FORMS SaEBSITy Stadent Personal Record Form dent intsemation ~~ Siest Mama: Torn wnon, Milt Rome, SOOKE Gander Male BY Pury raieL] Schoo! Level; [BHA Dates 7 08) 205 gic Pines Retigion: Cieit Status, rer wy Aebibree Mother st uardian s Mame: “0 Desi Fathar siGuardian s Hamme: ems tires nan TONMAEE Numtsas: 8988847 Who sioad be cantucied first in case of emergency? ; Cy Mother 1 RY Fetter lame: SS Contact Mumisar: ese\" 1 Brienary: Se tone wo SOHO Yomr: Schoo! Addrasa: eh, set ay j Seoandary: Sehoot Schoo! Adsrens: + any tay ta Tertiary: Somer oe i Schoat Adddreey | { i i i | | i Shudent i Slgnatuve over the Printed Name i"
    },
    {
        "image": "studentrecord1_synth_5_aug3.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES 3, Mantle ~~ Student information First Namen ididdle Name: 4 Last Name sender Male Fenalelt School Levet: Birth Dale girth Place: i Retigion an 1 civ stews: 8 | i _ Contest Humber Mother s Guardian s Name: 2207\" aagenaseee7 _ Caniact Number: Father sf uardian s Naste Wao shoud be contacted firut In oa98 of emergency? | {Cy Mother [gy Farner ‘tomer i Schoo! Yents i ey i, Mats a t i i | i i i Student Signature over the Printed Name | i"
    },
    {
        "image": "studentrecord1_synth_5_aug4.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHBE ES’ ‘Si. Mena, Mania Stadent Personal Record Forn; ident information Siewt Mame | Rotingies Chat Stntues ae ennieneneenniblte Cord Mother stavardian s Name _... Bantact Number: omowanoss ~. Caritiet Member: i Who shout be convanted firnt in case of emergency? i £3 Maier BY Father .. Sehest Yeas: Tinethy Her a j i Studer Signature aver the Printed Name i H i i"
    },
    {
        "image": "studentrecord1_synth_5_aug5.png",
        "label": "studentrecord",
        "ocr_text": "L 1 ie sine ast Narie Gunes Reng Get Status: rather siC hers who shee Name (Primary senost | Second: Senoct gehoo! student ae) Bat Gardin Name” 4 Name vardis die contacted 1 Aadeon® ary Addess agdress: Student ti ersenal Re nforty 1 Name senool Level yy Place Addiess: sarin case cfeme cord Fount aation a Name Age Lin Gods ontact Number Gartacy NUITtbe Contact Hunaee"
    },
    {
        "image": "studentrecord1_synth_6_aug1.png",
        "label": "studentrecord",
        "ocr_text": "UI RSITY OF TH! FDP IN 3) Qnuezon City, Metro Menta Stadent Personal Record Form po Student Information meyer os ssun nerspse ann? Sere ree Address: rermre os tae Fother sIGuardian s Name ®™ 2\" Contact Number: S S\" Wo shoud be contacted first in case of emergency? |] Mother Gi Father Aiexander Rose Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_6_aug2.png",
        "label": "studentrecord",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES oe ‘city, Meira Manila Student Personal Reeord Form Student information i Fiest arse: Gender: Meio F 1 Birth Dates (2) Religion: oman Cathe i Civ Stat Aaidress: Sere, nt | Mother siGuardian’ entant Mumie i Father siGuardian s Name: Serer Cattact Nuumby _ [Who shoud be contacted first in case of emergency? | 8 Mother | j £2] Farner i i i othe: I Mame: Aritstnoe Retstionship: _ Contact Number: SSP i Briar __Schoat Year 20102644 { i Seheol Addrese hes, Secondary: saver High Sena: anie 2002 o20 Presan i School Year: mere is, ate Manta i i | cowemut i Aiexender i ee ~~ TE i Student Sig the Priniert Name |"
    },
    {
        "image": "studentrecord1_synth_6_aug3.png",
        "label": "studentrecord",
        "ocr_text": "UNIVERSITY OF THE PHILIPPIN' (quazon City, Mtn ft Student Personal Record Form | Gender Mate@) Female—} Schoo! Weeek__ A om sa p08 Binh Bice: 5 Birth Gale: Rotigton: sae 1 otvit Status Mother sthuardian s ame. eevee [esther etouarcion e Nama: | wsho shoud be contacted fest in case of amengoney? Mower i CJ Faroe i CJ other i t i Primary: | Sohoot Addeess: | pecundary: ST\" a | sonnel Asien: i i i l | i 5 Alexander Rose | Studant Signanire"
    },
    {
        "image": "studentrecord1_synth_6_aug4.png",
        "label": "studentrecord",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES ase a [hast Name: Gender: MaleBY Femaisl) School Level: _ St (280 Birth Place: 28 Religion nannd Civil Status: Mether siGuardian s Hama: 48% Fomor stuandian s Name H Who shoud be contacted first in caze of emergency? [RR Mother a Father HE other i 7 ect __ snes _. Schoo! Year: dese i, Mrs Bas i Schoo Addrene:"
    },
    {
        "image": "studentrecord1_synth_6_aug5.png",
        "label": "studentrecord",
        "ocr_text": "UNIVERS| OF THE PHILIPPINES ‘Quezon City, Metto Manila Student Personal Record Form Student Information LastName: Rose First Name: ALExanver Gender: Male &) Female) schoo! Level: Birth Date: 02 07 2007 Middle Name: __MEVER 2ercom Age: Birth Place: Pass Religion; \"™\" Catnore Civil Status; Moree Address; Srrenass wzPm 0087 comes sex an 34 Zip Code: 7\"*° le oe Mother s Guardian s Name: 422 Washington ae Contact Number: °%89732118 Father siGuardian s Name: 8%\" Stephens Contact Number; °°7925 473 ®& Mother O Father O other Name: ___ sea Washington Relationship: \"ter Contact Number: °%°3792118 Primary: Mrs Cental iemeniay Sehoo: Schoo! Yea 20102011 School Address: 28m Vil, Meo Mansa Secondary: \"ns! 0h schoo: Schoo! Year: School Address: Sree Me ate Tertiary; “© 0t Santo Tomes Schoo! Year: 2020 Present School Address: 42886 Vile, Met Manta Alexander Rose Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_7_aug1.png",
        "label": "studentrecord",
        "ocr_text": "TECHNOLOSISATY NIVERSITY Sta. Mesa, Manila Student Personal Record Form onr0 s040184 Contact Number: 2012 2014"
    },
    {
        "image": "studentrecord1_synth_7_aug2.png",
        "label": "studentrecord",
        "ocr_text": "TECHNOLOGICAL UN Egor” OF THE PHILIPPINES ‘Sta. Mesa, Manila Student Personal Record Form Student Information Last Name __C 4_ First Name: CHRISTOPHER Middle Name: 2 over cone Age: Gender: Male &) Female) School Lev 11 21 2002 Birth Place: Suse” Birth Date: Religion: Civil Status: °°\" nee sent Mother s Guardian s Name: S se= 8\" Contact Number: 2999975 Eve Gry connect usebor: er Father s Guardian s Nam ud be contacted first in case of emergency? Who shot D Mother DO Father Other Name: ey wason Relationship: Contact Number: °°\"°S 5'\"* Primary: =n cement Sen! choo! Year: 20122014 ‘School Address: Ateany on ate a Secondary: =™ Serre \"en Se! School Year: sevens ‘School Address: —— Tertiary: nn School Year: seni seeeet ‘School Address: ‘spn ow. oe Mort Christopher Graham _ Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_7_aug3.png",
        "label": "studentrecord",
        "ocr_text": "EC CHNOL OCIS CAL. UNIVERSITY OF THE PHILIPPIN NES essa, nant sonal Record Forts Stusient Pe Stadent iormation sTOPHER pgidedi: Name: ‘Lest Name: come Age (Gender Mase Female {J School Level einen onte: | Religion | | [co States address: i agother st uardion s Name ze i pether siuardiar 5 Name __ Gomtant Number. —. 1 | tee eheud be contacted first i oa5° pi emergency? i i} [Ep Notner G Father \\ Belationstt! Secondary: i Sokno! Adurese: teetiary: j i School Address se Printed NAPE:"
    },
    {
        "image": "studentrecord1_synth_7_aug4.png",
        "label": "studentrecord",
        "ocr_text": "TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES i Last Name: Rates Biest Name. Gender, Male EF gin Bato: 8 fz I Religion: Sivil Status: Addeess: Mother stGwardian s Nama: 22 i Pather siGuardian s Name: __ Gontsct Number: | Who shoud be contacted first in cage of emergency? i |} Mother | £9 Father H SE Other ontoseae. _ Contact Number: Primary: Boheot Year: i Pathan V8, Sahoo! Aderess: on i Seoondary: i aye Sohnoi Address: 7 i Christopher Grehan | Student Signatirs over the Prin! ted Name |"
    },
    {
        "image": "studentrecord1_synth_7_aug5.png",
        "label": "studentrecord",
        "ocr_text": "UNIVERSITY PPINES Student Personal Record Form j ~~ Stadent information i itastNaree 8°\" First Mame oe Middie Name OE | Gender. Maie (J FematoL] Schost level: cee Age: 2 | Sirti ate: a “Retigtan: we | Civil Statu “ee | Mother siGuardian s Name:* Contact Number: | FathersiGuardian s Nama: roy _ Cont |} i Who shoud be contacted first in case of emergency? i |} Father j er (Mame Feiationship: “*_ Sentact [Primary: Ses __ School Year School Address: Seconda Schoo! Adgresa: Tertiary: School Address:"
    },
    {
        "image": "studentrecord1_synth_8_aug1.png",
        "label": "studentrecord",
        "ocr_text": "TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES ‘Quezon City, Metro Manila Student Personal Record Form Student Information MARCUS ADAMS WILSON Middle Name: Last Name: First Name: Gender: Male] Female() School Level: cade 11 Age: 2 Birth Date: 12 0 2002 Birth Place: Tv Bom Again Chrstan Religion: Civil Status: “°\"*! Address: 7°\" \"ome ems Zip Code: °° Mother s Guardian s Name: ©*¥\" Tver ___ Contact Number: °°°49721854 Father s Guardian s Name: “*\" sv Contact Number: 20° '77° Who shoud be contacted first in case of emergency? O Mother D Father Other Name vee Netson Relationship: °°’ __ Contact Number: 2498° Primary: 222\" Ct Bemantany Sere! “Schoo! Year: 2008 2018 School Address: 28 Meo Mania Secondary _Pnone Sone Hon Sta Schoo! Year: 20122018 School Address: Trewee is Meso Mani Tertiary: 7°\"? Sent Tomes School Year: sere School Address: essen vee Mato Mans Marcus Wilson Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_8_aug2.png",
        "label": "studentrecord",
        "ocr_text": "TECHNOL QSAR PANES iy Mave Nana Record Form cuezne Ci Student Personal ee _ saient formation SS 5 Name: acon Te | Marcus Wilson student Signature over the Printed Name \\ —— ___|"
    },
    {
        "image": "studentrecord1_synth_8_aug3.png",
        "label": "studentrecord",
        "ocr_text": "ECHNGL OGIGAL, UNIVERSITY OF THE PHILIPPINES queen Git Hank Student Personal Record Form “Btu *_ First Name rerio} Schoo! Level __ Birth Place: ‘gam Aan Chase Religion: [eivi states: Jan s Name: t Mother’ siGuert vwonen tae Contact Humber. on s Name: no ahaud 62 contacted frat ie case ofemergency? i \\ other’ siGuardl La Mome’ \\ (Cy Father gp owner \\ Vee: Relationships. _Sohoat Year: Saheat Year soa Wie, oo eT student Signature 2"
    },
    {
        "image": "studentrecord1_synth_8_aug4.png",
        "label": "studentrecord",
        "ocr_text": "TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES ‘Quezon City, Metro Manila Student Personal Record Form Student Information LastName: _WISON First Name __ A CUS yiddie Name: “°4 5 Gender: Male &) Female) School Level: Grade 14 Age: 22 Birth Date: '2_/ 06 _/ 2002 Birth Plac Bom Again Christian Religion: Civil Status: \"*\"=¢ Address: 9 2S.\" 2700s san Zip Code: °°%* Contact Number: °°%8721054 Mother s Guardian s Name: x Tayor Father s Guardian s Name: =” Oavs overrssa7es Contact Number: Who shoud be contacted first in case of emergency? DO Mother O Father Other Name _Sxs sser_Relationship __***\" __ contact Number 2 2 2455 Primary: 907 Cty Erementary Schoo! School Year: 2008 2018 School Address: Ve, Meo Man Secondary: \"Were Senet tenses School Year: asic School Address: Theres Vae Meee Manca Tertiary: SY\" “Seno Tore School Year: 2021 Present School Address: Meissa Ye, Meo Manta Marcus Wilson i ‘Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_8_aug5.png",
        "label": "studentrecord",
        "ocr_text": "Quezon City, Were Manis Student Personal Record Form Student information Prinwary:, 2220 Sty Eamertory Sensor Marcus Wilson |"
    },
    {
        "image": "studentrecord1_synth_9_aug1.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Malolos, Bulacan Student Personal Record Form Student Information Last Name __®°°* First Name: Cas Middle Name _ “°° Gender: Male} Female &&) School Level: ye Caloocan ayer cage Age: Birth Date: 7 _/ 02 204 Birth Plac Buddhism Religiot pddress: 2otearten ne HENCE Dim Coat Mother siGuardian s Name: “else Sanches Contact Number: “7 \"°°'7* Father s Guardian s Name: SS\" Contact Number: °° Who shoud be contacted first in case of emergency? D Mother GO Father Other Name: ohn Hamiton Relationship ____ Contact Number: ESD) primary: uz coy Sarena Sees veut! 2000 2015 ‘School Address: Co Secondary: arr see Wen SET ‘School Year: serene pe ie, Metro Mania School Address: Tertiaryemennne een 2010 Prevent cya Ve, Mat Manta ‘School Address: Jaime Beck —ESES ‘Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_9_aug2.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Student Personal Record Form “Student information beck First Nome awe Middie Name Gender Mate Schoo! Levei _ Ag “ieee Date: YS Birth Place: Cs: a Fletigian: ge Ciyil Statue: Zip Gore: _ Contact Number. 7\" _ Contact Number Who shoud be contacted fir HJ Faroe i BO Othe: tin case of emergency? Sowtact Number: [Pomary: anne SthOOL Year: seaeen Sehoo! addres: a a _ a Secondary: School Year: Schoo! Address: __ [Yertiary:\"\" School Year: School Addrase _ —"
    },
    {
        "image": "studentrecord1_synth_9_aug3.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY TSE NS INES Malolos, Butacan Student Personal Record Form Student information — q Last Name: 860\" First Nome: Cond Mothor s Guardian s Name; Sse Sern: Father s Guardian s Nama: S to9 Who shoud be contacted first in case of emergency? H 0 Mother 2 Father Hi Ciher { Jaime Beck Siudent Signature over the Printed Name - J"
    },
    {
        "image": "studentrecord1_synth_9_aug4.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Malolos, Bulacan Student Personal Record Form Student Information Last Name: __ First Name _ “AME Middle Name: “O*\" Gender: Male] Female J School Level __*°\"=\" cow Age: Birth Date: °7 02 2004 Birth Place: *»ssen Religion: °““\"\"*\" Civil Status: °°°* Address: “*°°** 0\" S85 Zip Code: Mother s Guardian s Name: Mins Sencnez Contact Number: °%72 75 Father s Guardian s Name: S27™*! \"owe Contact Number: °° 888% Who shoud be contacted first in case of emergency? Mother O Father Other Name ___ s m er____Relationship __ Contact Number: °°'**7\"*\"*\" Primary: 2222\" ty Eemeniay Scho! 2000 2015 School Address: Secondary; \"#?e Sense Hh Seo Gut tes 20102021 School Address: ese Mews Manis Tertiary: “en en’ Schoo! Year: 210 Prenet ‘School Address: Gt) Jaime Beck ‘Student Signature over the Printed Name"
    },
    {
        "image": "studentrecord1_synth_9_aug5.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC, UNIVERSITY OF THE PHILIPPINES: ‘haiotos, Bolacan Student Personal Record Form Shsdent infarmetion pian Home _ First Nanes: jbast Rare. Gender: Male} Femele’ 66 Bieth Place: Se covercoien ARB i Schoo! Level: piietie Koto: t Religion: as tee vg, tS bxdebre ss: i Gist States: pMogher stiuardian s Name Suntact Numbats \\\" athar dGuardian s Nasia:.” __ Sentact Number | Who shoud be gortacted first in case gi emergency? {cy oir i 1 Seconda! Sohwol Address | Tertisry __ i Sehant Address: Stent Signature over the"
    },
    {
        "image": "studentrecord2_synth_10_aug1.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF COMPUTER STUDIES. RECORDS DISPOSAL AND ARCHIVAL POLICY STUDENT RECORDS Record Series *Office of Period of Retention Record 1, Registration Records Archives Unti graduation 2. Academic Transcripts Dean s Office Unti transfer 3. Scholarship Records Records Office 3 years after graduation 4. Student folders ‘Student Folders containing academic records, enrolment forms, grades, and other related documents A. Ongoing Academie Records Registrar Unti graduation ‘umn Records ‘arches Permanent Wihdrawn Transfemed Students Records Office 5 years D. Dismissed Students Dean s Offee 10 years 5. Financial Records ‘Admin Office 3 years after graduation"
    },
    {
        "image": "studentrecord2_synth_10_aug2.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES: COLLEGE OF COMPUTER STUDIES RECORDS DISPOSAL AND ARCHIVAL POLICY STUDENT RECORDS Record Series “Office of Record Regstraton Records ‘echives ‘Academic Transcripts Dear s Offee 7 Records Offee Sehotrehip Records ‘4, Student folders ‘Student Folders containng academic records, enrolment forme. grades. and other lated documents A. Ongoing Academic Records Register ‘Aur Records par ¢. NahdrannrTanstened Stents Records Office oe ee _ Dean s Office ‘Admin Office 5. Financial Records Period of Retention Unti graduation nti transfer 3 years afer graduation Permanent s years to yeas ‘3 years after graduation"
    },
    {
        "image": "studentrecord2_synth_10_aug3.png",
        "label": "studentrecord",
        "ocr_text": "5. POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF COMPUTER STUDIES RECORDS DISPOSAL AND ARCHIVAL POLICY STUDENT RECORDS Record Series *Office of Record 1, Registration Records Archives 2. Academic Transcripts Dean s Office 3+ Scholarship Records Records Office 4. Student folders ‘Student Folders containing acade: forms, grades, mi records, enrolment snd other related locuments ‘A. Ongoing Academic Records Regisear p, ure Reconis Archives MthdcannvTransfemed Students Records Office Oberst Seng Financial Records ‘Admin Office Period of Retention Unti graduation Unti transfer ‘years after graduation Unt graduation Permanent"
    },
    {
        "image": "studentrecord2_synth_10_aug4.png",
        "label": "studentrecord",
        "ocr_text": "G UNIVERSITY OF THE PHILIPPE OOLLEGE OF COMPUT STUDIES: POLYTECH RECORDS DISPOSAL AND ARCHIVAL FX STUDENT RECORDS ecard Series wotiica of Perind of fetention Heears secon nie grantor Rogauaton Records pevadaeic Transcript Dasris Cute Unis barater ‘yon aller gation Seneiarahig Rensoda Recerds Ofte ‘a Stason fubkare Sealant fedsen conaing neacernis resaids, scteiest Tjaden, an has esta comune Gein gaccaon Th. Organs Acadesa: Revons Sega ‘sss wens oes Paonanant 8 vanecnand Toons Sasa yao 8 gems B Denese sreaaris “s yanis after qeentonton elas Offer 5, Financia Records"
    },
    {
        "image": "studentrecord2_synth_10_aug5.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVE: PHILIPENES COLLEGE OF ComMpUTEeR STUDIES TY OF THE RECORDS DISPOBAL AND ARCHIVAL BOLICYS STLOENT RECGRDS “Record Series Siticw af Poriod of Retention Reear 1. Ragarmon Aacerte Jechivee ost grosianen B. Resear: Tresenete Daan s Cites Unt transter Ss Schvtivatia Recent Recor Otte Spears ales aration. 3. Feud Folders __ Blase Folders soteing scence nears, wauaman Yorrs, pests, wns sier Batol cosumenn R eageing Asesinis aso Feceta wt gedation og, POI Reco aeonsa Pema Mendon Tareten students Resuns Oe Freon 8. Ssmisees Studenas ees On Waa 3. Finscis Rover Aesein Ofee S y8ie8 shes gromiatcn"
    },
    {
        "image": "studentrecord2_synth_1_aug1.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSON NG BAYNILA COLLEGE OF ARTS AND SCIENC! INFORMATION MANAGEMENT POLICY STULENT RECORDS Racore Series S0ttine of Potied of Retention Pacard 4, Eeretment Recor Recoras ote sys 2. Aimideon izcords echoes Uri eatin 3. peacemi Traneeriess Actives Porearent 4. Student toldecs cain sevrreny Aes Se ees A eae Sastre Fee a aren ist gradtion ip, stato Rens aachives Fees! D. capeted Reconts: _ Deans Otte 16 years xracurcidr Records Adeoin Ofice Unt wanster"
    },
    {
        "image": "studentrecord2_synth_1_aug2.png",
        "label": "studentrecord",
        "ocr_text": "pAMANTASAN SG LNGSOU NG MAYAILA st OF ARTS AND St CHENCES cou INFORMATION {MANAGEMENT POLICY STupent RECORES eqica of Sageieed ot Sabena econ Series ascot Remnants FREE years A. Eerobnent Recor ras gradation Ge asiieaien RECO chee 30 xcartenie Trance: paces Sarna “a Saudens foiders husure Fosters comessirg seas Sn ensaieen Ste gen ns ara douse EO patie Stadt Fas pegsre wa qrsdusion pumas Rats panne oman 8 arnt OFS sven Dennen Recast fh Eepated Reeasss Dean s aor wey rains OFFS Unteerater Eaacarriewar Revores"
    },
    {
        "image": "studentrecord2_synth_1_aug3.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYNILA COLLEGE OF ARTS AND SCIENCES STUDENT INFORMATION MANAGEMENT POLICY STUDENT RECORDS Record Series “Office of Period of Retention Record 1. Enrolment Records Records Offce Syears 2. Admission Records archives Unti graduation 3. Academie Transcrots ‘Arches Permanent 44, Student folders Student Fokiers containing academic records, enrolment forms, grades, and other related documents A. Active Student Fes Regier Unti graduation ‘Alumni Records Archives ald 8. ¢, Dropout Records Records Office S years D eipetedecots SSS SC ane ves S. Extracurricular Records ‘Admin Office Until transfer"
    },
    {
        "image": "studentrecord2_synth_1_aug4.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LuNeson NG MANILA, LLEGE OF ARTS AND SCIENG! STut T INFORMATION manage T POLICY STUDENT RECORDS \"Record Seeiee \"Office oF Paried of Retestion Resora 4. rotment Recna Recous Gtice S years 2. AomBLe: Repos Archos 3 sss Peetives Beonaoent 4 Studer totders taining ocacenta genre, entnant 101 Wit wd oar thins sees: 6 <, Drpnst Saconie ts thee 5 yours D. eapeied Reeonts Deas Otice Sye0n Gvanaveike Rec fei Off Ur rater"
    },
    {
        "image": "studentrecord2_synth_1_aug5.png",
        "label": "studentrecord",
        "ocr_text": "PAMAIT ASAN NG LUNGSOD MS MAYNILA COLLEGE OF ARTS SHD SCIENCES: STUDENT INFORMATION MANAGEMENT POLICY STUDENT RECCADS Heed Saris -Gifice of Period of feetentinn Becord 4 Errore Reece Recerds ois Syeera 2 Adminewn Recante Avcheoas Un graduamee: 3. seasons Teanecsgin aecriies Ferenc &. Rudent folders Sesert Fades comaining asademis moat eneitrnt Taam, greden, ant eftar rian documents AC Ree Sauter Pan Sager ‘pnt dense : * Pewaweisnt oso Pecos Aaron Spee Ronen Fircents ottee S yaace apts Resor, Dean Ore Orem S.) Gxtacaueae Recones Adri fiice Unit reas"
    },
    {
        "image": "studentrecord2_synth_2_aug1.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF EDUCATION ACADERHC RECORDS MANAGEMENT POLICY STUDENT RECORDS Record Series often of Record Dems once Dacpenary Recoras: —- ome Ome ienation Receets 14. Student fokders ‘sradact Falter containing ecademe meccrds, enenbinent Koune godess oeher wines Gomsanea A hati Stuceet Fa teemer og ta mde Fe Lead crn nso D erpetes everss acres ‘Syears eter greduaton toyears yours ater grazaaton ea geovetes Pennanent Dyan tonan ans grarsaton"
    },
    {
        "image": "studentrecord2_synth_2_aug2.png",
        "label": "studentrecord",
        "ocr_text": "2 POLYTECHNIC UNIVERSITY OF THE PHILIPPINES, COLLEGE OF EDUCATION ACADEMIC RECORDS MANAGEMENT POLICY, STUDENT RECOROS Record Srna Reports Deans Oss Dacmeuy Recents Acchwre Student foigers i. 5. ‘Saito Poideny conaning eaadorm ees enulnant ferme, presen. ond :thas heated Sonamarts TA stow Stodert Fine [egreee 9, Dmntantes eto Fine bomen Tarte cords Recents Gatos (9 eapeted Mecente i) Made at Racers Arcotves S yeare atte: gracuation soyears S yeucy wher grasuaton ‘i mdveven Peseas ent Shea Unt gration"
    },
    {
        "image": "studentrecord2_synth_2_aug3.png",
        "label": "studentrecord",
        "ocr_text": "© UNIVERSITY OF THE BHLIMPHIES COLLEGE OF EDUCATION RECORDS MANAGEMENT POLICY STUDENT RECORDS: Record Series “Othce of Foried of Retention Record 1 Chae Reset Goan Cire S your etter gecumen 2 Decainary Recoeas semen aeroawen Records some Otee S years oer geaauron A Gohee Stutent Cae ayes nts yesvaten Peranent Tranter Ravers, Races Otee Deacons Beccrts Mecea Recceas aschven ait graduation"
    },
    {
        "image": "studentrecord2_synth_2_aug4.png",
        "label": "studentrecord",
        "ocr_text": "Ty Ge THE POLYTECHREG UO PHILIPPINES COLLEGE OF EDUCATION MENT POLICY AGADEMIG RECORDS MANAGE STUDENT RECORDS ecore Series ati of serie of aversion Beewest ‘arate Repos peawotee —— Sysars ater grater ~~ prone re yen Decpieary Recs yout ater gramistst Stindent Folders Soatent Porters ccatazving acaclais mats, SHOAENE i SESS ose, ane otter states decent Th astona Sri ies Regia ret gatas: eunduates Shadwt Bone sicher Parmesan 8. onatar Saeed ocanres Otto Byeoe oc, anata Paes 2D. exoeiea Resorts Dawes SAoe yo peers [branes ina grace S amedeal Rene"
    },
    {
        "image": "studentrecord2_synth_2_aug5.png",
        "label": "studentrecord",
        "ocr_text": "1. 2. POLYTECHt NIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF EDUCATION [ACADEMIC RECORDS MAN: Record Series Grade Reports Discipinary Records 3. Admission Records: ia. Student folders Student Folder forms. arades. an ‘A. Active Student Fles Graduated Student Fies Transfer Records D. Expeted Records iS, Medical Records \\AGEMENT POLICY STUDENT RECORDS “office of Period of Retention 1a containing academic records, enrolment other elated documents Record Dean s Office ‘5 years after graduation ‘arches soyears amin Office years after graduation Register Unt graduation Permanent Archives Records Offe® s yeas Dean s Off 0 yeus. Arches ‘nti graduation"
    },
    {
        "image": "studentrecord2_synth_3_aug1.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSOR NG MAYAILA COLLEGE OF EDUCATION YOBOSAL AND ARCHIVAL POLICY STUDENT RECORDS Record Series fice of Period af Retention Record 2 Registestion bron Her giacuston sysnissinn Recore Aen so years Raia sei great Pecande OM 3."
    },
    {
        "image": "studentrecord2_synth_3_aug2.png",
        "label": "studentrecord",
        "ocr_text": "PARANTASAN iG LUNGSOD NG MAYSILA COLLEGE OF EDUCATION RECORDS DISPOSAL AND ARCH 1 POLICY STUDENT RECORDS Raerd Series ice oF Perisd of Retention Record 1. Regalaton Recocwe arenes S yess ster gradustion Grae Rares\" years after geatusten 3. Aurriees Ruconda Aeiein Oise 1Oyears 86, uname votinent Facade Regains Ut grae 9, Kerns Peuds Aches Sees ¢, Seeman Toor Statens Reconta cites Saas D. cxusntoues Reraade Des Chee yea. 5. Extracurriutr Recores Regairar 3 years stter gaduation"
    },
    {
        "image": "studentrecord2_synth_3_aug3.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYNILA COLLEGE OF EDUCATION RECORDS DISPOSAL AND ARCHIVAL POLICY STUDENT RECORDS Record Series “Office of |——_ Period of Retention Record 1. Registraton Records archives S years aftr graduation 2. Grade Reports Dean s Office ‘years after graduation 3. Admission Records ‘Admin Office \"10 years 4, Student folders ‘Student Folders containing academic records, enrolment forms, grades, and other related documents ‘A. Cument Enrolment Records Regevar ‘Unt graduation Pemanent Alumni Records Archives Records Office S years c, WihdrawnTranstered Students D. Discontinued Records Dean s Office so years 5. Extracurricular Records Registrar 3 years after graduation"
    },
    {
        "image": "studentrecord2_synth_3_aug4.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASA COLLEG CATION RECORDS DISPOSAL AND ARCHIVAL POLICY, STUBENT RECORDS Record Series \"Office af Record 1 Regiirston 8: archives 2 Grage Repos Deen s Difco 3. kamisse Voyaars Pacuis Office bypass eens Offee"
    },
    {
        "image": "studentrecord2_synth_3_aug5.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAI NG LUNGEOD NG MANA COLLEGE OF EDUCAT ON RECORUS DISPOSAL ANT ARCHIVAL POLIS STUDENT RECORDS ‘Renard Series sffice of exon egavatio: Rucenct archives Seer Gite 2 Gravis Reports 3. petrweice Recorss “Banas oe 4. Ssudere fotders sntaning neater recor, whirnaet Tinie agers Stadt Fa Regu assem rssits pecives “B. Biecanined aware Dean s Often egevar 5 Extacurivw: scot, Derlod of Hatantion 5 yaure after graciatees ‘years after trenton soya ene eau: Baws vayenn ytore after gratuation"
    },
    {
        "image": "studentrecord2_synth_4_aug1.png",
        "label": "studentrecord",
        "ocr_text": "BULACAN STATE UNIVERSITY COLLEGE OF STUGENT RECORDS Reeves Series Sciitice st “Feria of Reteedion Record 1. Begatrasn Recoras Deen s Otieg 2ynoa 2, Schowrans Recwree Records Ottos List inanotee 2 Arve ‘2 year 4 ‘Siar Foktoce comating acca smcas, emeotnrt TWO, Geades, wid ether ished Kocrents BR. setive sant Fs agate nti pease Sead ees nS Parmanent 9, Paeator Recess Recants Orie 5 years B. expones Recor Gesa s Gos Overs S. Extrscuracuie Recos Reach Ofee Peomanesi"
    },
    {
        "image": "studentrecord2_synth_4_aug2.png",
        "label": "studentrecord",
        "ocr_text": "BULACAN STATE UNIVERSITY COLLEGE OF EDUCATION STUDENT RECORDS RETENTION AND DISPOSAL SCHEDULE STUDENT RECORDS Record Series “Office of Period of Retention Record 1. Registration Records Dear s Offee 2years 2. Scholarship Records Records Offee Uni transfer 3. Academic Transeriots ‘archives 2years \\4, Student folders student Folders contaning academe records, enrolment Studer aes, and other rated documents (A. Active Student Fes Regier ‘ns graduation Graduated Student Fes Archives Permanent Taster Recor Records Offee s yeas “D: expeted Records “To yeas Permanent %, Extracurricular Records Records Office"
    },
    {
        "image": "studentrecord2_synth_4_aug3.png",
        "label": "studentrecord",
        "ocr_text": "SULACAN STATE UNIVE! COLLEGE RST NT RECORDS RETENTION AND DISPOSAL SCHED: STUDENT RECORDS Rocard Series “office af Period of Retention Record 1 Seer s Otter years 2 Schetarsiun Peceeds Resorse Stier Un transfer 3. Acatemic Momscrcis Aechives 2yeare 4. Student foigers 8 e D. roared Recoate: Sees Os foes 5. Extracomcstar Res Records Ofer Becmanent"
    },
    {
        "image": "studentrecord2_synth_4_aug4.png",
        "label": "studentrecord",
        "ocr_text": "BULACAN STATE UNIVERSITY COLLEGE OF EDUCATION STUDENT RECORDS RETENTION AND DISPOSAL SCHEDULE STUDENT RECORDS Record Series office of Period of Retention Record 1. Regatraton Recorss Dean s Ofce yeas 2. Senetarsinp Records Recores Off ‘Unas wanater 3. Academe Transcrots pecroces 2yeas \\4. Student folders sreset Foten contanng scour moose enemas SER ysen end omer mitad socemanst A. Acta Student Flas Reo Unts graduation Graduated Student Flat eres Pee Taner Resorts Records Otten Syn D. Expeted Resorts Deen s Oftee 10 years Records Office Permanent ‘5, Extracurrcur Records"
    },
    {
        "image": "studentrecord2_synth_4_aug5.png",
        "label": "studentrecord",
        "ocr_text": "BULACAN STATE UNIVERSITY COLLEGE OF EDUCATION STUDENT RECORDS RETENTION AND DISPOSAL SCHEDULE STUDENT RECORDS Record Series office of __ Period of Retention Record 1. Registration Records Dean s Office 2years 2. “Scholarship Records Records Office Unt wanster 3 Sacademe Tansee wchwes 2years 4. Student folders. “udent Folens containg academic records, enrtmant SEE PENT ed Stier A. Active Student Fles oT Registrar ‘Unt graduation Graduated Student Files Aschves: Permanent venue necte Records Ofer syes Dae Deans Omioe == Records Offee Permanent | Extracurricular Records:"
    },
    {
        "image": "studentrecord2_synth_5_aug1.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYNILA COLLEGE OF EDUCATION ‘STUDENT INFORMATION MANAGEMENT POLICY STUDENT RECORDS Record Series *Office of Period of Retention Record 4. Enrolment Records archives years after graduation 2. Grade Reports Admin Office Syears 3. Academie Transcripts | Archives Untltranster |4. Student folders Student Folders containing academe records, enrolment forms, grades, and other related documents A. Cament Enroiment Records Regaver Unt graduation p, Osis Stent Fis poten Pemanent ¢, Wthdrn Teanstered Students Records Office S years [| D. exposed Records ean s ce 1Oyen 5. Medical Records ‘Admin Office Unt transfer"
    },
    {
        "image": "studentrecord2_synth_5_aug2.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYNILA COLLEGE OF EDUCATION STUDENT INFORMATION MANAGEMENT POLICY STUDENT RECORDS Record Series Office of Period of Retention Record 4. Enrolment Records chwes 5 years after gradation 2, Grade Reports amin Office syears 3 Sa archives Unt transfer ‘4. Student folders suudent Foters contanng academe cars ence, Sire, redes anoer elated A ‘Current Enrolment Records: Register Unt graduation A Graduated Student Files Archives co anette Ser econs Oct syeun 7 <_< toys ‘amin Oe ‘Uns ranster (G__| Medical Records"
    },
    {
        "image": "studentrecord2_synth_5_aug3.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYNILA COLLEGE OF EDUCATION ‘STUDENT INFORMATION MANAGEMENT POLICY STUDENT RECORDS Record Series “Office of Period of Retention Record 1. Enrolment Records acchoves years after graduaton 2. Grade Reports ‘Admin Office Syears 3.» Academic Transcripts Aechives ‘Unt transfer “Student Fosters contanng academe conta enrolment forms grades ang otter wated documents ‘A. Coment Enrotment Records Regs ‘Unt graduation pg, Onietted Stent ns Aries Pemanent (¢, WerdreerTranstemes Students Recents Often Spee D. Exposed Records Dean s Oftoe 10 years 'S. Medical Records Admin Offce ‘Unt transfer"
    },
    {
        "image": "studentrecord2_synth_5_aug4.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYNILA COLLEGE OF EDUCATION STUDENT INFORMATION MANAGEMENT POLICY STUDENT RECORDS Record Series “Office of Period of Retention Record A wctmere Records Arches S years after graduaton 2. Grade Reports ‘Admin Office S years 3.“ peasemie Transcrets _ ‘Archives ~— Uniwanster 4. Student folders fader Fliers contaning academic recon, enrolment ome. grades, and oer Waied docerenn? ‘A. Cument Enrotment Reconts Regiver Unt graduaton A Graduated Student Fies Archives: econ ¢, WhdraunTranstemed Students Records Ofce S years 0. Expeted Resorts [Tl SSs5 tyes 5. Medal Records ‘Admin Offce"
    },
    {
        "image": "studentrecord2_synth_5_aug5.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN fe LUnasoD NG BAYRILA COLLEGE OF EDU, KOM ATIC MANAGEMENT pow icy STUDER RecoRns Record Series “Gifice of Pariad of Rosontion Record 1. vetnere Resose sovrmves Suyears ator graduate 4, Cade Repent: Aiken Ot S years 3. Aesdamie Transcript achive Une ansrar A, Baden foisers SRgIn! Fetes sontaming ecaienns eos, enenant form, gedea, wl star mien tocomen A, Sane Enssinant Resenis Basiscar ie gadcocen Paomscent Snsuotae Staten Hee arenes 8 ¢, Meme Tivcsteme Sadents Pasar Stee years B Eratet Revo, Basa’: Oece iC yeen 5. taeicad Bacawe ‘amin Orica nts tratar"
    },
    {
        "image": "studentrecord2_synth_6_aug1.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVE! PHILIPS COLLEGE OF ARTS AND SCIENCES: QDENT RECORDS RETERVION AND DISPOSAL SCHEDULE STUDENT RECORDS facades ~AGHinw ot Ravied af atention Rect eons Ofiee Barmanart A. pommeen Becorts yams Hs groiurier Bo Cisde Rigas archives 3. Cincipsnary Baas ayonives Tyee Student fodiens ‘untere Batters soning soacere secovis aSerers eee ces and cer rte aoe AL Comms Rongtoer Ravers Regent nt gerduation ometvated Sesto Fes ounwes emnasert ¢. tanwer Poses Resco Off Byes soyens Pemanet aecewen"
    },
    {
        "image": "studentrecord2_synth_6_aug2.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF ARTS AND SCIENCES STUDENT RECORDS RETENTION AND DISPOSAL SCHEDULE STUDENT RECORDS Record Series *Office of Period of Retention Record 1. Admission Records Records Office Permanent 2. Grade Reports Acchives ‘years after graduation Archives 2years 3. Disciplinary Records 4. Student folders Student Folders containing academic records, enrolment forms, grades, and ather related documents A. Curent Enrolment Records Regstar Unt! graduation Graduated Student Fies Archives Permanent Tansfer Records Records Office S years D. Discontinued Records Dean s Offce 10 years Archives Permanent 5. Medical Records"
    },
    {
        "image": "studentrecord2_synth_6_aug3.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF ARTS AND SCIENCES STUDENT RECORDS RETENTION AND DISPOSAL SCHEDULE STUDENT RECORDS Record Series “Office of Period of Retention Record 1. Admission Records Records Ofice Permanent 2. Grade Reports Acres 3 years afer graduation 3. Dscpinary Records Archives yeas 44. Student folders Student Fotden contanng academe records, enotment tome grades ang omer ated documents A. Coment Envotmant Records Regsees Unt gauaton og “ttetts Sen Fe Archos Permanent ¢,TanaterReconts Recor Oftce S yen 0. scontnued Records Dean s Ofte 10 yeas S. Medical Records Arches Permanert"
    },
    {
        "image": "studentrecord2_synth_6_aug4.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF ARTS AND SCIENCES STUDENT RECORDS RETENTION AND DISPOSAL SCHEDULE STUDENT RECORDS Record Series *Office of Period of Retention Record 1. Admission Records Records Office Permanent 2. Grade Reports Archives ‘3 years after graduation 3. Discipinary Records ‘Archives 2years 4, Student folders ‘Student Folders containing academic records, enrolment forms, grades, and other related documents A. Curent Enrolment Records Registrar Unt! graduation Gradusted Student Fies ‘archives Permanent Transfer Records Records Office S years D. Discontinued Records Dean s Office ro years 5. Medical Records ‘Archives Permanent"
    },
    {
        "image": "studentrecord2_synth_6_aug5.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY oF THE PHILIPPINES COLLEGE oF ARTS AND SCIENCES STUDENT RECORDS RETENTION AND DISPosaL SCHEDULE STUDENT RECORDS Record Series “Office of Period of Retention Record 1. Admission Records Records Offce Permanent 2. Grade Reports Archives 3 years after graduation 3. Discipinary Records Arches 2years Student folders A. Curent Enrolment Records Registrar Unt graduation Permanent Graduated Student Fies Archives 8 Records Office S yeas ©, Tanster Records ©. Discontinued Records Dean s office 10 years Medical Records Archives Permanent"
    },
    {
        "image": "studentrecord2_synth_7_aug1.png",
        "label": "studentrecord",
        "ocr_text": "VERSITY =GE OF EDUCATION BULAGAN STATE UNp RECORDS POSAL AND ARCHIVAL BOLiGy StUuDENT RECORDS: Hered! Series “Gihice of Pacis of Raeomticn Record 1 Discisinury Rececds Adm Office 2. Seholarshier Re: Deans tice 1 years A. Agsminsice Records Records Shoe ‘dit oration: a sted locamancs A. Onguing Academis Recents g, Som Recors aectoses Peau Poeame Resorts tog S yee ©. Stumases Stasents Bens Cites —s 5. Frasca Re: Registrar S yams etter gduation"
    },
    {
        "image": "studentrecord2_synth_7_aug2.png",
        "label": "studentrecord",
        "ocr_text": "4 a BULACAN STATE UNIVERSITY COLLEGE OF EDUCATION RECORDS DISPOSAL AND ARCHIVAL POL. STUDENT RECORES Record Series “Office of facard Dacipinary Record Adin. Ofics Scasaren Recores eave Ome taimisaion esords Records Ctice Seater foxters Sludient Fotiwre contig soadarts ozuads, fore. qintns, and siior veins dancer AL Snag Assaece Bacards Bopater hin Broosss seonves Rveonis Oe ¢, Dropout Recon 3 Finances Records Pariad of Retention ranstar ‘Unti graation Unie gradation Broracant Sys Syears afer graduate"
    },
    {
        "image": "studentrecord2_synth_7_aug3.png",
        "label": "studentrecord",
        "ocr_text": "BULACAN STATE UNIVERSITY COLLEGE OF EDUCATION RECORDS DISPOSAL AND ARCHIVAL POLICY STUDENT RECORDS Record Series “Office of Period of Retention Record 1. Dscipinary Records Admin Offce ‘Unt ranster 2. Scholarship Records Dean s Office 10years 3. Admission Records Recoras Ofce Unt graduation “Student Folders contanng academe econis enrolment forms grades and otter wated documents A. Ongong Academe Records Regaver Untl graduation pum Raconts Archives Pomenent ¢, pout Reconts Records Oftee byes, OD. Damased Students Dean s Ofte 10 yeas 5. Financial Records Regetrar ‘S years after graduation"
    },
    {
        "image": "studentrecord2_synth_7_aug4.png",
        "label": "studentrecord",
        "ocr_text": "BULACAN STATE UNIVERSITY COLLEGE OF EDUCATION SVAL, POLICY STUDENT RECORDS. Hecord Series Period of Reteution tescipmca oes Dean s Otfce a age Dive Perma 6 ¢. Proonat Se Recor Ofte Byeus sven Francia R"
    },
    {
        "image": "studentrecord2_synth_7_aug5.png",
        "label": "studentrecord",
        "ocr_text": "BULACAN STATE UNIVERSITY COLLEGE OF EDUCATION RECORDS DISPOSAL AND ARCHIVAL POLICY STUDENT RECORDS Record Series “Office of Period of Retention Record 2. Decipinary Records Aamo Offce Untl wanater 2. Scholarship Records Dean s Once Oyen 3 Aamasion Records Records Offce Unt graduation “Student Foden contanng ecedeme recov enrolment tome grades ond ote mated document A Ongena Acaseme Recons Reaver Unit greduaton a Rees parm Pemanent ¢, Depot Recents Reconis Oftee Syren Damases Students Dean s Once 10 yeon, S| France Records Regavar S years ater graduation"
    },
    {
        "image": "studentrecord2_synth_8_aug1.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF ENGINEERING INSTITUTIONAL RECORDS RETENTION POLICY STUDENT RECORDS Record Series “Office of Period of Retention Record 4, Scholarship Records archives ‘5 years after graduation 2. Regatraton Records Dean s Offce ‘Unt graduation 3. Admission Records ‘amin Off 2years 14, Student folders siudent Folders contaning academe records, enrolment Suse Tes end other lated documents “A Ongoing Academe Records Register ‘nti graduation omnes Susanne avowes Permanent ¢. Windmuntranstnea Stade Records Offer syees ~~. pasmased Students oe so yens ‘Admin Office 5 years after graduation SS. Internship Records"
    },
    {
        "image": "studentrecord2_synth_8_aug2.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF ENGINEERING INSTITUTIONAL RECORDS. RETENTION POLIcy STUDENT RECORDS Record Series “Office of Period of Retention Record 1. ‘Scholarship Records Archives years aftr graduation 2. Registration Records Dean s Offce Unti graduation 3. Admission Records Admin Office 2years 4. Student folders som rae containing academic recone, enotnent fms, grades. and otherveated documern A. Ongoing Academic Records Register Unt gredustion Oded Student Fes Archives Pemanent Cc, Wihdrawn Transered Students Records Oftee 5 years Damssed Stents “yes 5. Internship Records Admin Offee ‘Syears after graduation"
    },
    {
        "image": "studentrecord2_synth_8_aug3.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF ENGINEERING INSTITUTIONAL RECORDS RETENTION POLIcy STUDENT RECORDS Record Series “Office of Period of Retention Record 1. Scholarship Records Archives S years after graduation 2. Regitraton Records Dean s Oftce Unt graduation 3: Admission Records Admin Ofte 2 years 4. Student folders feo rae containing academic cons. encinen ‘Om. Grades, and other ited dosumeces A. Ongomg Academe Recons Regisvar Unt graduation Ome Student Fees Archives Permanent C. MihdrewevTranstered Students Records Otto S yeas D. Damssed Stents eens once 10 yean ‘Internship Records"
    },
    {
        "image": "studentrecord2_synth_8_aug4.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF ENGINEERING INSTITUTIONAL RECORDS RETENTION POLICY STUDENT RECORDS ne weit wiciieicnacs Record 1 Schetarang Hecwda Pecheves Speers atter graduaton 2. Regaivaion Recorda “| Deane Offes Unt rasan 3. pimevion Records ~T aanan Ofte fy 6. Student foiders Duden Faven s0Meiny eademe macs, emeiment fonea, pages. end wSer eates deaumanst i Ongchg header Racowe 1 Reine vse og, Ome Seen Ft owes ewer ¢_ Wedron Teresa Statent: Recs Otter Sean ©. couneased Suerte [Bens otee voy S. ntenonip Recorés kein Otte Sysars of gradvaton"
    },
    {
        "image": "studentrecord2_synth_8_aug5.png",
        "label": "studentrecord",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF ENGINEERING INSTITUTIONAL RECORDS RETENTION POLICY STUDENT RECORDS Record Series “Office of Period of Retention Record 1. Scholarship Records ‘chives 5 years aftr graduation 2. Registration Records Dean s Office ‘Unt graduation 3 vaamissin Records namin Of years \\a, Student folders student Foes conaning scaei recor anne, Student aes, and othe related documents A. Ongoing Academe Records reo ‘nit gmauaton Permanent oraduated Student Fes acres 8 ¢. WehdeaeeTionatored students Records Offoe Syeen [Deans offer oe ‘amin Off 5 years after graduation %. Internship Records"
    },
    {
        "image": "studentrecord2_synth_9_aug1.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG iINGSOG Ne ESS ADMINISTRATION ORDS RETENTION PoLicy STUDENT RECoRDS Recwrd Series “Office of Poriad of Retention Recars 3 Scroiastiy Records Acti tO yees 2. Discipinary Seconds Aechives Wanefor Bs pesecenic: Varscrins declwes 2 yeas 4. Stusient foiters Student Folie sontaniog nondeme raga seeenont ‘arma, ges, nad ctner ising AL Active Stuceni Foes Reguien Un grec Mplkied Progeem Hasoiss Aeivey a 6, Bout Raomds Reasons fice Byes B. Damaced Sticente Sue s Ones 1 sway S. ieanrastin Reconde Records Omes Unti aneter"
    },
    {
        "image": "studentrecord2_synth_9_aug2.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG. MAYNILA COLLEGE OF BUSINESS ADMINISTRATION INSTITUTIONAL RECORDS RETENTION POLICY STUDENT RECORDS Record Series “Office of Period of Retention Record ‘Scholarship Records Archives so years Discipinary Records Archives Unti transfer ‘Academic Transcripts Archives 2years 4, Student folders Student Folders containing academic records, envolment forms, grades, and other elated documents A. Active Student Foes Regstar Unt graduation Completed Program Records Archies Permanent ¢, Dopout Records Records Office 5 years D. Dismissed Students Dean s Office 10 years Records Office Unti transter 5. ‘Internship Records"
    },
    {
        "image": "studentrecord2_synth_9_aug3.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYNILA COLLEGE OF BUSINESS ADMINISTRATION INSTITUTIONAL RECORDS RETENTION POLICY STUDENT RECORDS Record Series *Office of Period of Retention Record 1, Scholarship Records Archives 10 years 2. Discipinary Records Archives Unti transfer 3. Academic Transcripts, ‘Archives 2years 4. Student folders ‘Student Folders containing academic records, enrolment forms, grades, and other related documents A. Active Student Fies Registrar Unt! graduation Completed Program Records ‘archives Permanent Dropout Records Records Office S years D. Dismissed Students Dean s Offce ro years 5. Internship Records Records Office Unti transfer"
    },
    {
        "image": "studentrecord2_synth_9_aug4.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYN COLLEGE OF GUSINESS ADMINISTRATION ORDER RETENTION POLICY INSTITUTIONAL RE STUDENT RECCRDS scored Series *Gifice of Feriad of Retention Record 4. Scnoiarshee Racers echoes rays Z Dieisinary Reoores aeons ‘don tater Seager Franses _ aectsven “ayusee 4, Sudent takers AL Asis Stotare Fees 7 Reger spa purest eee Resoras Ces Besse ene Stioe so yeas B. pemisen Stasanss Records Office ‘Gal ranatier ‘Iesenahip Resores"
    },
    {
        "image": "studentrecord2_synth_9_aug5.png",
        "label": "studentrecord",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYNILA COLLEGE OF BUSINESS ADMINISTRATION INSTITUTIONAL RECORDS RETENTION POLICY STUDENT RECORDS Record Series *Office of Period of Retention Record 1, Scholarship Records Archives 10 years 2. Discipinary Records Archives Unti transfer 3. Academic Transcripts ‘Archives 2years 4, Student folders ‘Student Folders containing academic records, enrolment forms, grades, and other related documents A. Active Student Fies Registrar Unt! graduation Completed Program Records ‘archives Permanent Dropout Records Records Office S years D. Dismissed Students Dean s Office ro years 5. Internship Records Records Office Unti transfer"
    }
]