[
    {
        "image": "syllabimatrix1_synth_10_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY Diiman, Quezon City Colege of Education Elementary Eduestion Course Syllabus in Deis Stuctures and First Semester, AY 2023 2024 Course Code: cs301 Descriptive Title: oaasneresauagarems Number of Units: suns Lecture Hours per Week: srars Prerequisites: csa01 Prayawningrindanenas Laboratory Hours per Week: wm Class Schedule: Mon WediF2 00 PM 3 20 PM Classroom: Ram301 zvaneermsuiana Textbooks: Software Engineering by Sommerile (10th Es.) Course Description: This course covers fundamental data structures including arrays, linked lists, stacks, queues, trees, and graphs. Students will learn algorithm design techniques, complexity analysis, searching and sorting algorithms, and their practical applications in software development. Course Objectives: 1. Understand and implement fundamental data structures 2. Analyze algorithm complexity using Big O notation 3. Design efficient algorithms for problem solving 4. Apply appropriate data structures to real world applications 5. Develop strong programming and debugging skills Course Outline: Week 1 2: Introduction to Data Structures, Arrays and Linked Lists Week 3 4: Stacks, Queues, and Applications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8: Graphs Representation, Traversal Algorithms Week 9 10: Searching Algorithms Linear, Binary, Hashing Week 11 12: Sorting Algorithms Bubble, Quick, Merge Sort Week 13 14: Dynamic Programming and Greedy Algorithms Week 15 16: Algorithm Analysis and Complexity Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_10_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY Daman, Quezon Cty (Cotege of Educaton Eerentan Eavcaton Course Syllabus in Det Sructws ang First Semester, AY 2023 2024 Course Code: Oescriptive Tite: Number of Units: Lecture Hours per Week: 3301 2a orem we eras _ sore Prerequisites: cant maymnny ramets Laboratory Hours per Week: wa Class Schedule: enweaFa 2 00 Pu 3 30 Pu Classroom: em wera ean Textbooks: Sema Engneeing by Semmervite (100 £4) Course 2 This course covers fundamental data structures arrays, linked lists, stacks, ‘queues, trees, and graphs. ‘Students will learn algorithm design techniques, complexity Course Outline: Week 1 2: Introduction to Data Queues, and Applications Week 5 6: Ti ‘Structures, Arrays and Linked Lists Week 3 4: Stacks, tees Binary Trees, BST, AVL Trees Week 7 8: Week 9 10: Searching Algorithms Algorithms near. Binary. Hashing Week 11 12: Sorting Algorithms Bubble, Quick, Merge Sort Week 13 14: Dynamic Programming and ‘Analysis and Complexity Theory Week Greedy Algorithms Week 15 16: Algorithm 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_10_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY ‘Daman, Quezon City Cotege of Education Elementary Education Course Syllabus in First Semester, ay 2023 2004 Course Code: 3301 Descriptive Title: Sma ruta ase Number of Units; jon. Lecture Hours per Weel: Snare Prerequisites: Laboratory Ho, Data Strctures and 521 Poyanmny Pramenas urs per Week: An Class Schedule. Classroom: naman rem an Textbooks: Course Objectives: 1. Understand ang implement tunday ata structures 2. Analyze algorithm comple; date se 9 0 Notation 3. Design emcient algorithms for problem sowving 4 Apply appropriate data structures to real worig applications 5. Develop strong Programming and debugging Skills, Course Outline: Week 1 2: in to Data Structures, Arrays ang Linked Lists Week 3 4: stacks GuCUES, and Applications Week 5 6 Trees Graphs tation, Traversal Algorithms wee, 9 10: Sea Linear, Binary, Hashing Programming and Gre Binary Trees, BST, AVL rithms Bubble, Quick, Me Week Theory Week 17: Review ang Final Exar Trees Week 7 8: ching Algorithms ge Sort k 15 16: Algorithm mination"
    },
    {
        "image": "syllabimatrix1_synth_10_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "LA SALLE UNIVE! Ee 209 Cty te, Cateye of Edo Biamantnsy 4 ute Stra 2028 course SyHabus tr Fee) Gemevies AY Course Go cota senphve T er oF URNS) oa Drerequinites: ot Anpanearraaronse Laburatory Hours per Wess: ua Glass Sched RiantttediEn 290 8H 230 PAE ClassrGom. Mowe Burewm nemo Taxdooot oa Enginaring ty Sanmaeete 60h B9 course Description This course covers fundamental Gata structures in queues, trees, and graphs. Students wit fearn aigorithrs Jg, searching aiid sorting alganihins, ang their practicat 35) development isis, stack piexity Course Objectives Uncerctand and implement funcamentat data structures 2. Analyze im complexity ‘sing 849 0 notation 3. Design efficient algontnms for probiert soiving 4. Apply appronviate dala structures to realwortd agpticatians S. Develop strong programming and debugging skils, course Cuitine. week 1 2: invoducton to Data Stuctures, Arrays and Linked Lists Week 34° SHECKS, Queues, and Appicatons Week 5 6. Trees Briary Trees, BST. AVL TY Graphs Representation, Traversal Aigonthms Week 2 19: Searching Alga ians Linear, Binary, Hashing Week 11 42. Goring Aigortnms Buble, Quick Merge ert nia: Dynamic Programming and Greedy sgonthms Week 16 16: Algor Anaiysis and Corepieaty Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_10_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "DEL, A SALLE UNIVERS Ty Daman, Quezon cay COMPS es celestion: IS COURSE COVERS indamentay Queues tees and ora Hod BAYS, Inkee Hts. shacks e F algarithnn Gesiges techniques complexity an al sis, seercring and ser TNS, ane their practical apy deeeionment Coes Obinctives Unaerstana ang 5S EO notate: impieme: ASD wstures fo reaiy data 2 Seatvze aigorinm Neri solving 4 oaramniinig PDE Kity 'Y appropiate 89 eebuaging C2u0 86 Oetting. WEEK 12: Intec PUES, an WO to Data Se Applications Weng resentation T, Bhatt Hashing chutes, 26 Trees ANBYS a6 Linke Lint Binary Trees, Bot ns Week g Algor Week sa A, Tree 10\" Searching Algor 8 Bubb NG and Gieedy Anoritime SY Meek 12° Reso ang pina Stacks 1 92. Sorting INI Progra, NBIONY The"
    },
    {
        "image": "syllabimatrix1_synth_1_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYNILA Suezen City, Matto Kata Eoginewstss live Tile; pmzesmnuy Rumber of U sea 8344 fate Stuctues. BonsMiuiiey 00 PM T30 PM Taxthonks: Sones Erqaveny oy Semin ce CON EL Osurse Reserintion: s¢ covers fundamental dats structur arrays, inked lists, stacks, queues, trees, and graphs. Slucents wit teain aigorinm design techniques, complexity analysts, seareting and sorting aigeriinins, and their practical appiications in software. development. course Ohinctives. 4. Undersiang and imple: sing tion 3. Design Sata structures to reatwatid applica Sksts ial data structures 2. Analyze aigorithms for problem solving 4. Apply appropriate ons 5. Develop strang prograraming and debugging Gourse Gustine: Week 1 2: inigsducton to Uata Stuctures, Arrays Queues, and Applications Week $-6: Trees Binary Trees, BST, AV vieek 2 8 Graphs Representation, Ysaversal Algorithms Week §-12: Searching Aigonthins Linear, Ginary, Hashing Week 11 42: Sorting Aigorit Week 13 14: Dynamic Programming and Greecy Algorithms Week 4 is and Complexity Theoty Week 17: Review and Final Examinalt ed Lists Week $4: Stacks, nS Bubble, Guick, Merge Sort 16: Algerttien a"
    },
    {
        "image": "syllabimatrix1_synth_1_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYNILA (Quezon City, Metro Mania Cotege of Engineering Bletical Engineeing Course Syllabus in Software Engineering ‘Second Semester, AY 2023 2024 Course Code: —_cs303 Descriptive Title: somaeengreeing Number of Units: sume Lecture Hours per Week: émrs Prerequisites: 05301 Date Stuctures Laboratory Hours per Week: 2mm Class Schedule: Mon weaiF 2 00 PM 3 30 PM Classroom: Rano} auinessBuiang Textbooks: Software Engineering by Sommerite (10th Et) Course Description: This course covers fundamental data structures including arrays, linked lists, stacks, queues, trees, and graphs. Students will learn algorithm design techniques, complexity analysis, searching and sorting algorithms, and their practical applications in software development Course Objectives: 1. Understand and implement fundamental data structures 2. Analyze algorithm complexity using Big O notation 3. Design efficient algorithms for problem solving 4. Apply appropriate Gata structures to real world applications 5. Develop strong programming and debugging skills Course Outline: Week 1 2: Introduction to Data Structures, Arrays and Linked Lists Week 3 4: ‘Stacks, Queues, and Applications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8: Graphs Representation, Traversal Algorithms Week 9 10: Searching Algorithms Linear, Binary, Hashing Week 11 12: Sorting Algorithms Bubble, Quick, Merge Sort Week 13 14: Dynamic Programming and Greedy Algorithms Week 15 16: Algorithm Analysis and Complexity Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_1_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYNILA Quezon City, Metro Manila Cotege of Engineering Electrical Engineemg Course Syllabus in Software Engineering ‘Second Semester, AY 2023 2024 Course Code: css03 Descriptive Title: somaeegneny Number of Units: suns Lecture Hours per Week: sme Prerequisites: cs301 Dete Structures Laboratory Hours per Week: —2mmzs Class Schedule: Mon WediF1i2 00 PM 3 30 PM Classroom: Ram 401, euiness Buia Textbooks: Software Engineering by Sommer (10th Ed) Course Description: This course covers fundamental data structures Including arrays, linked lists, stacks, queues, trees, and graphs. Students will learn algorithm design techniques, complexity analysis, searching and sorting algorithms, and their practical applications in software development Course Objectives: 1. Understand and implement fundamental data structures 2. Analyze algorithm complexity using Big O notation 3. Design efficient algorithms for problem solving 4. Apply appropriate data structures to real world applications 5. Develop strong programming and debugging skills Course Outline: Week 1 2: Introduction to Data Structures, Arrays and Linked Lists Week 3 4: Stacks, Queues, and Applications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8: Graphs Representation, Traversal Algorithms Week 9 10: Searching Algorithms Linear, Binary, Hashing Week 11 12: Sorting Algorithms Bubble, Quick, Merge Sort Week 13 14: Dynamic Programming and Greedy Algorithms Week 15 16: Algorithm Analysis and Complexity Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_1_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "LUNGSOD NG MAYD LA PAMANTASAN Ni ‘ovezon City, Metro Marts cotege ot Engine ects Engen course Sytiabus in Sofware Eaginaenne ‘second Semester, AY 2023 2005 sparen as onteat 2. a0 PM -9 20 FH peseripsier Tondamentai data structures inctuding arrays, linked fists, stacks, queues, fees, and graphs Staden sal earn akjodinin desigh tecaniaues complexity see ous, searcing ave sorting exgerianins, ane HO practical applicaticns m sorhware gevelopinent course 0 This course £0 syze sigotih complentty 1g 4. Apply appropriate ming and deDuggng 1 Objectives and and implement fundamentat dala SHuCF 62. AN sign offigiant aigarithms far problems ‘applications 5. Develop swong program ct Linked Lists Week 3 4. Stacks, se88, SST, AML Trees Wee! ching Aigoriihyns Bubtle, Quick, Merge Sort 45: pagonttn a course Hstline: «top (rasoduchen to Date s, and Appicaions Week 5 6: resentation, Traversal Age vey Hashing Week 11 72: Serting Alge geanwning abd Greedy Aigonthy Week 17: Rewiew and Fina! we Queue Gap (ear, Bis Weel: 1 14 8 analysis and canrinti"
    },
    {
        "image": "syllabimatrix1_synth_1_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "PAMANTASAN NG LUNGSOD NG MAYNILA Quezon City, Metro Manta Cotege of Engineering Electrcal Engineering Course Syllabus in Software Engineering ‘Second Semester, AY 2023 2024 Course Code: cs303 Descriptive Title: simaeengneeing Number of Units: suns Lecture Hours per Week: «mrs Prerequisites: 5301 -Data Stuctures Laboratory Hours per Week: 2mars Class Schedule: Mon WeaiF1 2 00 PM 3 20 PM Classroom: Ramat. sxines Burana Textbooks: Software Engineering by Sommerite (10th Ed.) Course Description: This course covers fundamental data structures including arrays, linked lists, stacks, queues, trees, and graphs. Students will learn algorithm design techniques, complexity analysis, searching and sorting algorithms, and their practical applications in software development. Course Objectives: 4. Understand and implement fundamental data structures 2. Analyze algorithm complexity sing Big O notation 3. Design efficient algorithms for problem solving 4. Apply appropriate data structures to real world applications 5. Develop strong programming and debugging skills Course Outline: ‘Week 1 2: Introduction to Data Structures, Arrays and Linked Lists Week 3 4: Stacks, Queues, and Applications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8: Graphs Representation, Traversal Algorithms Week 9 10: Searching Algorithms Linear, Binary, Hashing Week 11 12: Sorting Algorithms Bubble, Quick, Merge Sort Week 13 14: Dynamic Programming and Greedy Algorithms Week 15 16: Algorithm Analysis and Complexity Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_2_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES Sta. Mesa, Mania CCotege of Computer Stucies Computer Science Course Syllabus in Dessbese Management First Semester, AY 2024 2025 Course Code: 65302 Descriptive Title: osmasewaayenet ayn Number of Units: suns Lecture Hours per Week: «mre Prerequisites: C5202 Discrete Mathematics Laboratory Hours per Week: 27mre Class Schedule: Tw Tu romau 2ane sx 1a0PM- «m0 Classroom: Romz01, Bareermsurana Stactbooks: Invest to Algorthms by Cormen, Lesson, Rivest Sten th Es) course Description: This course covers fundamental dat queues, trees, and graphs. Students will learn analysis, searching and sorting algorithms, an development. a structures including arrays, linked lists, stacks, algorithm design techniques, complexity .d their practical applications in software Course Objectives: Understand and implement fundamental data structures 2, Analyze algorithm complexity using Big O notation 3. Design efficient algorithms for problem solving 4. Apply appropriate data structures to real world applications 5. Develop strong programming and debugging skills Course Outline: Week 1 2: Introduction to Data Stru Queues, and Applications Week 5 6: ictures, Arrays and Linked Lists Week 3 4: Stacks, Trees Binary Trees, BST, AVL Trees Week 7 8 Graphs Representation, Traversal Algorithms Week 9 10. Searching Algorithms Linear Binary, Hashing Week 11 12: Sorting Algorithms Bubble, Quick. Merge Sort Week 13 14: Dynamic Programming and Greedy Algorithms Week 15 16: Algorithm ‘Analysis and Complexity Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_2_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "TECHNOLOGIC A} PH tamaunatt tes Labo: Course Desc: Thig queue: analysis, sear development rigsticn 4 SHLCTUTES including arrays, inked Jeam agar Sorting algorithms, and their gs its, stacks, AAGUES, complexity tical apphcations in software t fundamental data, tent alg, OF applications 8. ho 3. Design eft Ze aigoritin complexity atving Apply aj Course Sitting, Week 4 2 YS aNd Linked Lis Week 2 4. Stacks, BST, AV) Trees Weer 7 0: Searching Aigorith §: Trees Binary Tre: Vabirs Representation, Traversal atgonthme Linear, Binary. Hashing Wes 14 42. som Week 13 14: Bynamic Analysis arid Cor"
    },
    {
        "image": "syllabimatrix1_synth_2_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "HE TECHNOLOGICAL UN PHILIPPINES 4 Mesa, Nae SITY OF 7 Cotag of Commune Caurse Syitabus in Doses Menara 5252 Dacre Methenases Course Description This course cavers fa queues, trees, ana graphs. Si ysis, searching and sorti ays. inked lists nigues, ai data stuctur ents wil g algonthins, an nivame es inciuaing a course Obie 1 Understand using @ig 0 notation 3. De data sty ta reatanorte, ith vos 19 implement funcainental data structures 2. Anaiyze aiyorthm c cient algonitims for prob! Wing A Apnly appraw? Jicahons 5, Develop sieng programming and debugging course Out Week 1 2: tntraduction to sta Structures, Arrays and Linked Lists Week Queues, ard Applications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8 Representation, Traversal Algorihms Week 9 16 Searching Algorithm ar Binary, Hashing Week 11 12, Sorting Algorithms Bunbie, Quick, Week 13 14: Dynamic Programraing anit Greedy Algorithms Weex 16 16: Aigonthm ysis and Complexity Theory Week 17° Review and Final Examination Sort"
    },
    {
        "image": "syllabimatrix1_synth_2_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "SHOLOGICAL UNIVERS) 7 PRICED i Course SyMabus in Dose None eseription, 8 caver rental data structur p Hey WuciNg arrays, Hoke ish nthin: desuy stacks compe techeigu iexty ane etal applications in sttwar Understand and inpieme Seches 2. Analyze aigartn USING BiG O notation 9 nS for ty AB! Shctures to r roblem. VING 4. Appty appropria Programming and i ski Cots se Outtine. Queves StuclIeS, Aprays and Linked Lg S Bing Weow nS Weer 5 6 7 Aversa A kK IT12 Sorting egranming and Gr Ory Weel Wgortn sting v"
    },
    {
        "image": "syllabimatrix1_synth_2_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "RSITY Oi TECHNOLOGICAL UNIVE THE PAILIPRID Sa Mesa, Manis Detaness Hanagernant Bys 2025 Labor per Week: Zor Tchadule: MeTW RAM. ices sx tom sore Aorta oy Comen, Ueseeron Rivest Course Deseription: This couise covers funsamental data struciures including arrays, linked ists, stacks. queves, tees, and graphs Students wil tears aigorithin design “omoieady alysis, searching and sorting algorithms, and mair practical appli development fp sofware cosirse Objectives: 1. Understand and implement fundamen using 8ig 0 netation 3 a structures 10 real. al data structures 2. Analy gorlinms for problem solving 4. Apply appropriate applications 5. Deveiop strong programming cient a bes, and Appications Week Representation, 1 est, Binary, Hashing Week 74 42. Satting Agoritnmns Week 13 44 Dynamic Prograrnm 4 Line ge Sot cady Aigorknms Week 15 6. Algeriten Analysis and Compiexity Theary Weok 17° Review and Fi"
    },
    {
        "image": "syllabimatrix1_synth_3_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "TECHNOLOGICAL BRIVERSITY OF THe PHILIPPINES ‘Su ties, ante ohe90 ot Somes Conete tea, Conese Shots in Staching Learning 'O 8 Semester AY 2003 2026 Course Code: csegy Sescnptive Th Sumber of Unets: Semen Lecture Hours per Week Pre CQUiSiHS: Soe. i, Caboratory Hours pena! Sass Senos, te: Closarosne: Texthote:"
    },
    {
        "image": "syllabimatrix1_synth_3_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES Sta Mesa, Mania Cotage of Computer Stes Computer Soence Course Syllabus in Machine Leaming Second Semester, AY 2023 2024 Course Code: —cs4o1 Descriptive Title: dacneierny Number of Units: am Lecture Hours per Weel. Smars Prerequisites: csnt We dearer Laboratory Hours per Weel: mrs Class Schedule: Monwed Fn 200 PM 3 30 PM Classroom: mara! same sea Textbooks: Ostaease Syste Concerts by Siberschats. Konh Sudarshan th Course Description This course covers fundamental data structures including arrays, linked lists, stacks. queues, trees, and graphs. Students will learn algorithm design techniques, complexity analysis, searching and sorting algorithms, and their practical applications in software development Course Objectives 1. Understand and implement fundamental data structures 2. Analyze algorithm complexity using Big O notation 3. Design efficient algorithms for problem solving 4. Apply appropriate data structures to real world applications 5. Develop strong programming and debugging skills Course Outline: Week 1 2. Introduction to Data Structures, Arrays and Linked Lists Week 3 4: Stacks, Queues, and Applications Week 5 6 Trees Binary Trees, BST, AVL Trees Week 7 8 Graphs Representation, Traversal Algorithms Week 9 10: Searching Algorithms Linear. Binary, Hashing Week 11 12. Sorting Algorithms Bubble. Quick, Merge Sort Week 13 14 Dynamic Programming and Greedy Algorithms Week 15 16 Algorithm Analysis and Complexity Theory Week 17° Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_3_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "tiumber of uni Lecture Hours per Woek! tae Prerequisites: ceRr weowmarat (Laboratory Hours ger Weak: ne class _ Mgerttedten 2 09 FE 220 7 Ciaserocm: «nanan bare eeey, Cees comnts ty Seems Kom 8 cern 7 es course Dose rare eset gant 8 SUCRE BOIDNG 3a, A Se queues, trees, and grapns er Mak iearn angi. design Techniques, COMPLY dnatysts, searching and sarang aigortnns, vand weir practcal apprcaiions in sonware Analyze agar compienty sotving 4. Apply appropriate Understand and aroming and deDugond Joey Bg 0 notabon 3. Design efcient algorins or rom gata structuces to real wor s appicaions 5 Develop strong SOG course Outline: week 12 I on io Oats Suuctuces, Arays and Liked Lists Vee 5 6 8 mary Trees, BST, AVI. Trees Week 7 8 ‘Queues. and Applications Wei 5 6. Tees Representation, Traversal Agari Week 2 10 ‘Searching AMgoranms near, Binary, Hasting Week 17 12, Sortaug MAO, Greedy Aagertinms Week 19 16. Aigontinn Week 13 14. Dyracec Programming 394 ‘Analysis and Compientty Theory Week 17 Review and Faal Examination:"
    },
    {
        "image": "syllabimatrix1_synth_3_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES $2. Mine, Karas Cotege 0! Camoure Stathes Computer Beene Course Sytlabus i 1 Machine Leaning ‘Seeond Servesten, Av 2023 200 cosas Laboratory Hours per Vieek: Seca pete pes ‘Class Schedule: Men Wecita 200 254 3 90 PM Classroom: net em erT Fextpoaks: Comeme Syne Ganarts by Ba Description: This couise covers fundamental queues, trees, and graphs. analysis, searching and sorting deverooment Understand and amplement using 819 0 notaton 3. Design data structures to real worid epphcatons kts course Outtine: ceeeenars Hoth 8 Saarinen 7 ‘Students wil learn aigortthen design techniques. 2 data structures 2. Analyze aigoritim complealty fundareentai ‘aificient aigoritmns for problern sotving 4 Apply approoriaite 5. Develop strong programming end debugging Asrays and Linked Lists Week 9 4: Stacks, Yee 1 2 introduction to Date Structures, Sinary frees, BST, AVL Trees Week 7 8: Queues, and Appitcations Weer 5 6. 71 Graphs Representation, Traversat Aigonthyns Week 9 40: Searching Aigorfinms Linear, Binary, Hashing Week 11 12: Serang Aigorttyms Buble, Quick, Merge Sort Week 19 14: Gymamic Programming Analysis and Complenliy Theory Week t ‘and Greedy Aigoritims Week 15 16 Aigornthm 7: Review anc Final Examunation"
    },
    {
        "image": "syllabimatrix1_synth_3_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "ECHNOLOGICAL UMIVERSITY OF TH PHILIPPINES Besa, wanda eaten of Commuter Stes Course Syliebus in M ond Semin, A sr per Weel Class Sah Fextioots: Dataease Syaten Soretaie hy SAeschasa Ken Susarshos course Description cOUISe Cavers tundamental data cluding arrays, inked lists, stack: queues. fees, and yraphs Studenis wil leam algonthm design techniques, complenty chan gorithms, ang their practical appiicalions in sofware Course Objectives 4. understand and implement fundsinentat data strictures 2. Atv using Big O notation 3. Design efficient algonihims tor proplem sc eS 16 Tea! AS 5. Develop strong progi ging nming and deattisees Week 1 2 intros aphs Represent (near, Binary, Ha Week 12 14: Dynamic Programming a Analysis and Complexity Theary Véeek 17) Review and Final schon io Date ications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8 on, Traversat Algerithrns Week 9 10: Searching Algasithms g Week 14 12: Sorting Algorithms Bubble, Quick, Merge Sort ch 118: Aigo"
    },
    {
        "image": "syllabimatrix1_synth_4_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY Sea Mena, Hens qeurse syflabas in Fest Semester, AY RUB INS naa ems ne) Monerien 290 PM 3 90 Sense Engen bp Sumer (8S ou course Description: le course covers fundamental dota siructiies inckuring arrays, IBKGG ISK, Lacks, J meapns, Shadents wil ain algorititn cesigs lectnigaes, complexity and ther practical agpications tn software anaes. development course objectives: Understand and mplets ng Big 0) notation 3. Design efficient wg data structures to featworid apphicabons 5 srughures 2. Analyze aigorlihre complexity ng 4. Apply appropriate nt fundamental data athens for problem Develop sting progra course Dut Week 1 2: introduct Gueues, and Applications Week 5 5: Tracs Sivary Tre Graphs Representation, Traversat Aigorthins week 9 40 Searching Aly Linear Binary, Hashtag Week 11 12: Sevtig Algorihuns Gubple, Quick Merge Sort Week 13 14, Lynamic Programming ane Greedy Algorithms Woek 15 16 Aigorithen ‘analysis andi Complexity Theory Week 17: Review and Final geamination"
    },
    {
        "image": "syllabimatrix1_synth_4_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY Gas. Mewa, Mande Cotage of Engneeing Cart enginesrg Geurse sylheinss inn Sotwere Enginsaring First Seanmster, AY 2025 20 Souree Code: 96% Desrptve Fle: wae Rumber oF Lintts: net Lectura Hours per Weak: sare Prereqasitas: Laboratory Heur cSsUat Date Sevctuoes ontitesdts 2 56 FA 2 39 PR son es eeoa RI feteaare Ergun by Someone {1 curse Daserintion This course covers fundamental queues, trees. anc graphs, Stidents Snalysis, searching and sorting algomtnms, and nei practi Gevespmnent. data struckuies nchsdng arrays, linked tt wid iearn 2igontim design tecnniaues, complety Japplicatons in software denen: Dept ves Understand and implement tandamenta! dats structures 2. Analyze algorithm complexity sing Bg sient abgorinens for proven sobing 4. Apty apprenente ations 3. Design erties gala etrackores to reatwworts applications §. Develop stiondt programming and debupattg sls conwce Seattle: Wiook 4 2 sntrockuction to Osa Structures, Artays ANG Linked Lists Week 3 4: Stacks, ‘Queues, ang Applications Weex 6 6: Trees Bay Treas, BST, Avi Trees Week 7 6: ‘Graphs Representation, Traversal Aagorabins Week 9 10: Seaiching Algorithms Linear, Binary, Hashing Week 11 12: Sorting Augorthms Bubble, Quick, Merge Sort weak 14 44: Dynamic Programmnit Aigorthen and Greedy Aigorinns Week 15 analysis and Complexity Theny Week 17.» een and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_4_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY Sta. Mesa, Mania Colege of Engineering cid Engineering Course Syllabus in Software Engineering First Semester, AY 2023 2024 Course Cod: cs303 Descriptive Tith some tngreeing Number of Unit: suns Lecture Hours per Week: nase Prerequisites: S301 Data Structures Laboratory Hours per Week: znars Class Schedule: Mon Wed Fn 2 00 PM 3 30 PM Classroom: Ram), Emeeemaswana Textbooks: Software Engineering by Sommervle (Toth Ed.) Course Description: This course covers fundamental data structures including arrays, linked lists, stacks, queues, trees, and graphs. Students will learn algorithm design techniques, complexity analysis, searching and sorting algorithms, and their practical applications in software development Course Objectives: 1. Understand and implement fundamental data structures 2. Analyze algorithm complexity using Big O notation 3. Design efficient algorithms for problem solving 4. Apply appropriate data structures to real world applications 5. Develop strong programming and debugging skills Course Outline: Week 1 2: Introduction to Data Structures, Arrays and Linked Lists Week 3 4: Stacks, ‘Queues, and Applications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8: Graphs Representation, Traversal Algorithms Week 9 10: Searching Algorithms Linear, Binary, Hashing Week 11 12: Sorting Algorithms Bubble, Quick, Merge Sort Week 13 14: Dynamic Programming and Greedy Algorithms Week 15 16: Algorithm Analysis and Complexity Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_4_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY Sekepe ot Bngneenig et Erpneeng Gawsese Syttatess te Sean Frat Sommates, AY 2027 1024 Course Bescrip Humber of units: Menateaita 208 Fan 3 30 Bt Sey Bh, ames ethane Boge by Snes (10% £9 5 Gouri Bescviption: This course covers tundamental data stuctuess inchating array queues, Tees, and graphs, Students will i2arn alyortnm cesign techniques, complexily analysis, Searching and sorting aigorifnms, and thes prachcal applkatsns in sofware development linked Rots, stacks, cnsiesn Objectives: Understand and implement fundamental date structures 2. Analyze algostihm compienity using Big O notation 3. Geaign eficient aigncitims for probiem sotang 4. Anply appropriate daia structures to reatwwortd applications 5. Develop strong programming ane debugging ie nurse Cette: Week 1 2: introauction te Daia Seuctures, Arrays and Linked {sts Week 2 4: Stacks, ‘Gueues, and Applications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8 Graphs Representation, Traversal Algorithms Week 9 16 Searching Algorithme Linear, Binaty, Hashing Week 11 72: Surkng Algorithms Bubble, Quick, Merge Sort Week 12 14. Dynamic Programming and Greedy Algorithms Week 15 18 Agorinn Pratysis and Cempiexity Theory Week 17. Review and Fisal Exanirastion"
    },
    {
        "image": "syllabimatrix1_synth_4_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY ‘ta, Mesa, Mania Cotege of Engineering Civ Engineering Course Syllabus in Software Engineering Fest Semester, AY 2023 2024 Course Code: 5303 Descriptive Title: ssmaemgreery Number of Units: aun Lecture Hours per Week: mrs Prerequisites: 5301 -Data Structures Laboratory Hours per Week: 2mars Class Schedule: Mon WediF2 00 PM 3 30 PM Classroom: Rems0, sareemasana Textbooks: Software Engneerng by Sommene (100 Es.) Course Description: This course covers fundamental data structures including arrays, linked lists, stacks, queues, trees, and graphs. Students will learn algorithm design techniques, complexity analysis, searching and sorting algorithms, and their practical applications in software development. Course Objective: 1. Understand and implement fundamental data structures 2. Analyze algorithm complexity using Big O notation 3. Design efficient algorithms for problem solving 4. Apply appropriate data structures to real world applications 5. Develop strong programming and debugging skills Course Outline: Week 1 2: Introduction to Data Structures, Arrays and Linked Lists Week 3 4: Stacks, Queues, and Applications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8: Graphs Representation, Traversal Algorithms Week 9 10: Searching Algorithms Linear, Binary, Hashing Week 11 12: Sorting Algorithms Bubble, Quick, Merge Sort Week 13 14: Dynamic Programming and Greedy Algorithms Week 15 16: Algorithm Analysis and Complexity Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_5_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN paras, Quesan Cy come of Eagneeses tector Engen Course Syllabus in Orstese Menesenert st Sennenser, AY 206 225 course Sede: o830? Descriptive Tite: emreumevet ne Number of unit _ sare Lecture Hours par weak: Drerequssites: Ch202- Casale shinarmset Labaratery Hours pe! na ‘Cleon Schedule: Yarmmreams tana. sannl- Classroom: fanz forename a aesola, baton Exgrneing Wy Semamerte 08 G6 sow course Descriotion: So ree nase Gata structs ching Taye, HS OS queues, trees, and graphs. Students wit learn algoritnm dessgn ques, Tes. ig ovg ngs, ahd ek praca apnicasae SSNS development. course Objectives” 4. Understand and ane ot fundamental aata structures 2 Analyze algonthn complexity using Big O notation 3 ‘Design eMicient algernnes for acoblert sOWvng ‘Apply appropriaié tata structures to real world apprcations 5 Develop strong programmmng and debugaira skits Course Outline: reek. 4 2: Introdvetion to Data Structures, AAS and Linked Lists Week 3 4° Stacks, e Week 5 6. Trees Binary Trees, BST, AVL Trees Week 7 3\" Queues, ana Applications yen, Traversal Aigoranms Week 9 13: Searchg Aigoritnns. Tinear, Binary, Hashing Week 11 12, Sorting Agoenm™ 5 Vosex 13 44: Bynamic Programming and Greedy igontnms Week 15 16: Aigontnm Anatysis anc Complexty Theory Week 17 Review and Finzi Examination"
    },
    {
        "image": "syllabimatrix1_synth_5_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Daman, Quezes iy oege of Enainewng Election! Engesing Course Syllabus tty Sotsbese Menagenent Firet Semester, BY Sourse Sade. ase Be ve TG! onamaetinaamen titers Number of Urits: sieae Lecture Hours per Waok: sar Prerequisites: 05202 cuenis Rathenatice Laboratory Hours par w ny Glass Schedule: vata trom 2eimu samage rome Clas: Course Description: course covers fundamental data siructures ineluchng arrays, finked lists, stacks, queues, frees, and graphs, Students wil learn algoritim design techniques, compiexlty analysis, searching and sorting aigoriitms, and thew practical appications in sofware course Objectives 1. Understand ang impierent fundamental data structures 2 Anaiyre algors 4’ O nolation 3 Gesign efficient aigarthins for problem solving 4. Apply ehuclures to real world appitcations 8. Develop strong programming and debugging meses Gutters: feet, 4 2: introduction io Dat Algor Linear, Binary, Hashing Week 71 12: Sorting Algorithins Bubble, Quick, Marge Sort Week 19 14: Dynamic Programming and Greedy Aigortiuns Week 15 16. A Analysis and Complenity Theory Week 17, Review and final Examination"
    },
    {
        "image": "syllabimatrix1_synth_5_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Din, Cuaron Cay Cetoge of Enyewemng Fectne Engreerng Cowrse Sytianus im Smsers Mersgemen Fest Sememies, AY 2024 2025 Course Coge: case Descriptive Title: cansetnyenst news Number of Unite: yams CLecuwre Hours per Wise: tron Prerequisites: 05202. Dente Venematey Laboratory Mours par wens Ge Class Schedule: twmuimen zmm anemia vigie Classroom: men xt tase io TeethOGkS: Seman Eagoneing by Semeur (108 66) Course Duttinw, ‘Queues, and Applications Week 5 6: Trees Siary Trees, BST, AVL ; Merge Week 13 14. Dynamic Programming and Greedy Aigaiithms Week 16 16 Aigorittun, Analysis andi Complexty Theary Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_5_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Diman, Quezon city Colege of Engineering Electoal Engineering Course Syllabus in Database Management First Semester, AY 2024 2025 Course Code: csse2 Descriptive Title. Dante trapenet tens Number of unit Sums tecture Hours per Week: ja, Prerequisites: 5202. Derete Matnemates Laboratory Hours per Week: o> Class Schedule: Classroom: Textbooks: ‘TAT 00PM 2390 M, sat au sta0 ay oon 22 Scere Burg ‘Setoare Engineering by Sommer 100 Ea) Course Objectives: 1. Understand and implement fundamental data stru strong programming and debugging"
    },
    {
        "image": "syllabimatrix1_synth_5_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES DILIMAN Diiman, Quezon Cty Ccolege of Engneerng Electial Engneerng Course Syllabus in Dsiabase Management Fst Semester, AY 2024 2025 Course Code: 8902 Descriptive Title: omnmetiraperer sure Number of Units: suse Lecture Hours per Week: srars Prerequisites: c 202 Discrete Mathematics Laboratory Hours per Week: wa Class Schedule. Tw Turovew 2909M sasmau- 1100481 Classroom: —Raomst2 sseeauiana Textbooks: Sofware Engneerng by Sommervite (10h £8) Course Description: This course covers fundamental data structures including arrays, linked lists, stacks, queues, trees, and graphs. Students will learn algorithm design techniques, complexity analysis, searching and sorting algorithms, and their practical applications in software development. Course Objectives 1. Understand and implement fundamental data structures 2. Analyze algorithm complexity using Big O notation 3. Design efficient algorithms for problem solving 4. Apply appropriate data structures to real world applications 5. Develop strong programming and debugging skills Course Outline: Week 1 2: Introduction to Data Structures, Arrays and Linked Lists Week 3 4: Stacks, Queues, and Applications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8: Graphs Representation, Traversal Algorithms Week 9 10: Searching Algorithms Linear, Binary, Hashing Week 11 12: Sorting Algorithms Bubble, Quick, Merge Sort Week 13 14: Dynamic Programming and Greedy Algorithms Week 15 16: Algorithm Analysis and Complexity Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_6_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES: ‘Quezon City, Metro Mania Ccolege of Computer Studies Computer Science Course Syllabus in Dstsbase Management Second Semester, AY 2023 2024 Course Code: 5302 Descriptive Title: oamaewaupener systns Number of Units: suns Lecture Hours per Week: snars Prerequisites: S202 Discrete Mathematics Laboratory Hours per Week: wa Class Schedule: hetume 2snew saaonau- tana Classroom: Ram301 eraresrmauiana Textbooks: Oataoare System Concepts by Siberschatz, Kor Sudarshan (7th &3) Course Description: This course covers fundamental data structures including arrays, linked lists, stacks, queues, trees, and graphs. Students will learn algorithm design techniques, complexity analysis, searching and sorting algorithms, and their practical applications in software development. Course Objectives: 1. Understand and implement fundamental data structures 2. Analyze algorithm complexity using Big O notation 3. Design efficient algorithms for problem solving 4. Apply appropriate data structures to real world applications 5. Develop strong programming and debugging skills Course Outline: Week 1 2: Introduction to Data Structures, Arrays and Linked Lists Week 3 4: Stacks, Queues, and Applications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8: Graphs Representation, Traversal Algorithms Week 9 10: Searching Algorithms Linear, Binary, Hashing Week 11 12: Sorting Algorithms Bubble, Quick, Merge Sort Week 13 14: Dynamic Programming and Greedy Algorithms Week 15 16: Algorithm Analysis and Complexity Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_6_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "TECHNGLOG Se EAI VERSTTY, OF THE ‘Quseoe Sty, Netra iene ote oF en Bases Course Syilabus in Seccs Seinastos, ayy esn02 Decisesearserer gets Prersquisites: Dini Mattes Leboratery Hours par Week cls: am FM PRL HHO system Leveepts oy Sibrschace Kur Sitar Mh Dosren Oeserivtion This course covers fundamental 28, and grap jorithn design fecnniques net compienity vctical applications ins software Coursw Obinctivas 1. Uncerstand and implemet Tungamental a strucivies 2. Analyze algorithen complexity y avprontiate foming and debugging using Big C nolaten 3. Design efficient algoritrms tor problem satving a, Ap ications Qewsiop strong prea data straaures 1D real world sKhis Sours Outtine: Week 1 2: Introduction to Data Struct Gueves, and Applications Week 5 6 Tees esantation, Traversal Aigorthn ¢. Binary, Ha Week 13 14: Dynan Analysis and Comps ks, Ginary Trees, SST, AVL Trees Week 7 8 Week 9 10: Searching Aigerithins sg Week 14 12: Sorting Algoritnins Bubbie, Quick, Merge Sort 2 Programming anc Greedy Aigarthins Week 15 78: Aigorithis ty Theory Week 17: Review and Final Examination Graphs Rey"
    },
    {
        "image": "syllabimatrix1_synth_6_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES ‘Quezon City, Metro Mania Colage of Computer Stes Computer Setence Course Syllabus in Detsbese Management Second Semester, AY 2023 2024 Course Code: 3302 Descriptive Title: ozmaewamenersysens Number of Units: suns Lecture Hours per Week: snars Prerequisites: 5202 Discrete Mathematics Laboratory Hours per Week: wa Class Schedule: heTurmew 2snew sasonau t1aaw Classroom: Ram301 eraneermsuiana Textbooks: Datsoase System Concepts ty Sieersonatz, Konh Suearshan (7th Es) Course Description: This course covers fundamental data structures including arrays, linked lists, stacks, queues, trees, and graphs. Students will learn algorithm design techniques, complexity analysis, searching and sorting algorithms, and their practical applications in software development. Course Objectives: 1. Understand and implement fundamental data structures 2. Analyze algorithm complexity using Big O notation 3. Design efficient algorithms for problem solving 4. Apply appropriate data structures to real world applications 5. Develop strong programming and debugging skills Course Outline: Week 1 2: Introduction to Data Structures, Arrays and Linked Lists Week 3 4: Stacks, Queues, and Applications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8: Graphs Representation, Traversal Algorithms Week 9 10: Searching Algorithms Linear, Binary, Hashing Week 11 12: Sorting Algorithms Bubble, Quick, Merge Sort Week 13 14: Dynamic Programming and Greedy Algorithms Week 15 16: Algorithm Analysis and Complexity Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_6_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "Tee eanaese mylianes Hy This course Comers fumtarie Sorctutes ste shaken tists. sta prays. Muse rte Mit nats AMZOTnN Tenge RESDINGURS. COTE quévcs Hees 2 33% neve’ Sp settanre actea ane searching ard sorting eer bier Lees 4 Hingerstare arg migieinent turd unt etter Araiye algonthe oe problem solving Appiv a Qoutanen 3 sata sirurture sn wes and"
    },
    {
        "image": "syllabimatrix1_synth_6_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES Quezon Cty, Metro Manta Colege of Computer Studies Computer Science COUFSE Syllabus in Database Nanageneny Second Semester, AY 2023 2004 Course Code; s cssoz Descriptive Title: Sma aperer Sane Number of units; $= Lecture Hours per Week; 1% FreTeqisites: 65202 Ones Matberates Laboratory Hours per weer, Class Schedule: Nemwianau sapay SADA. apa Classroom: paras ar TEXRDOOKS: Duseae yom Contes y ‘SREICARE, Kor Sudarshan (7m &) ourse Description; This Course covers tundamental $28 structures including arrays linked lists, stacks, queues, trees, ang graphs. ‘Students wit learn algorithm: design techniques, complexity See e s: Searching and sorting algorithms, and their practic) Applications in software development. Course Objectives: using data structures Skills Course Outline: 1 Understand and implement fundamental data sing Big O notation 3. Des) {0 real world applications Deve) Stfuctures 2. Analyze algorithm complexity ign efficient algorithms for problem solving 4. apply appropriate Strong programming ana debugging"
    },
    {
        "image": "syllabimatrix1_synth_7_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "Lecture Laboratory TECHNOLOGI UNIVERSI PHILIPNIVER TY OF THE ‘Sta. Mesa, Mania Colege of As a ind Seiences Mathematics Course Syllabus in Probabity and Statistics First Semester, av 2024 2025 Course Code: manasoy Descriptive Title: Number of Units: Som Hours per Week: ion, Prerequisites: Hours per Week: Class Schedule: Classroom: Textbooks: mare Course Description: This course covers queues, trees, ang analysis, searching development fundamental data structures in Graphs. Students will learn alg and sorting algorithms, and th Prom ar Sates MAT Dee Egat ‘Tsu 1000 2300 ca 8a0Au saa fam 22 comater un a nee Metta ad ts Aopatons by Lay to Ea) cluding arrays, linked lists, stacks, jorithm design techniques, complexity leit practical applications in software"
    },
    {
        "image": "syllabimatrix1_synth_7_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF THE TECHNOLOGICAL PHILIPPINES Sta. Mesa, Mania cotege of Ans and Sennen Mathematics course syllabus in Probablty and Statistics First Semester, AY course Code: MATHHO! Descriptive Tite: ramevnsnmlt Number of Units: 2% Lecture Hours per Week: sme UaPequisites: uaTiiny Darens cnr aon Hours per We ‘Class Schedul tonpat 2900M Sa 00AM- 11004 Classroom. ‘Textbooks: Laboratory em hoon 28 cao DA Terr neea and ts Aopteatons by Lay NES) Course Description: Fris course covers fundamental data structures including arrays, linked lists, stacks, queues, trees, and graphs. Students wil eat algorithm design techniques, complexity aWeysis, searching and sorting algorithms, and their practical applications in software development. 5 2. Analyze algorithm complexity blem solving 4. Apply appropriate ing and debugging course Objectives: 4. Understand and implement fundamental data structures Using Big 0 notation 3. Design efficient algornmns for pro! data structures to real world applications 5. Develop strong programm! skills course Outline: ata Structures, Arrays and Linked Lists Week 3 4: Stacks. ‘Week 1 2: introduction to ‘Sueues, and Applications Week 5 6: Trees Binary Trees, BST. AVL Trees Week 7 8: Graphs Representation, Traversal Algorithms Week 9 10: Searching Algorithms tinear Binary, Hashing Week 11 12: Sorting Algorithms Bubble, ‘Quick, Merge Sort ing and Greedy Algorithms Week 15 16: Algorithm Week 13 14: Dynamic Programmi ‘Analysis and Complexity Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_7_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "TECHNOLOGICAL UNIVERSITY OF THE PHILIPPINES Sta, Mesa, Mania College of Arts and Sciences, ‘Mathematics Course Syllabus in Probabity and States First Semester, AY 2024 2025 Course Code: MATHIO1 Descriptive Title: mommyausatetos Number of Units: suns Lecture Hours per Week: snore Prerequisites: MaTH00 pimrens Sqatow Laboratory Hours per Week: 2s Class Schedule: TweTutmeu 2mu, Saeq0AM- 11 20AM Classroom: mamas. conase ima Textbooks: __ Unear Algebra and Its Appicatons by Lay (&th Ed.) course Description: This course covers fundamental data structures including arrays, linked lists, stacks, queues, trees, and graphs. Students will earn algorithm design techniques, complexity analysis, searching and sorting algorithms, and thelr practical applications in software development. course Objectives: 1. Understand and implement fundament using Big O notation 3. Design efficient al data structures to real world applications 5. Develop strong programming skills tal data structures 2. Analyze algorithm complexity gorithms for problem solving 4. Apply appropriate and debugging Course Outline: Week 1 2: Introduction to Data Structures, Arrays and Linked Lists Week 3 4: Stacks, ‘Queues, and Applications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8 Graphs Representation, Traversal Algorithms Week 9 10: Searching Algorithms Linear, Binary, Hashing Week 11 12: Sorting Algorithms Bubble, Quick, Merge Sort Week 13 14: Dynamic Programming and Greedy Algorithms Week 15 16: Algorithm ‘Analysis and Complexity Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_7_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "Lectur Laboratory Hours ‘TECHNOLOGICAL UniveRsiTY OF THE PHILIPPINES: ‘sa Wen, conga et Ata on Sonnets tuonematct Provansy an Suenos course Syttabsus 1 pees Samanta, AY 2908 2005 seneet ome nna course Code pescnptve TUS: umber vf Unites vive Hours Ost ome urs OMsitas: wATaae Damas per waek: 7a0r ‘oe socnedue: ar™ em oem enone Siessroom. San ACwO TE Textbooks: Se Tpern te Hates or ay) caseve Oescriation: om gamer gata srucares HUGS ‘agartinm design !echn saves, This course covers queues, wees, 200 grants wil teart analysis Tsearching ana sorting algorenns ana th development 4 course obiactives: ern ofr erent unsamen 2 Se Big O notation 3 er Tae nant f° OBR SO Apply ‘applications 8. Ce eioD strong programning 12, anatyze akgorthin complet veins sata structures te reabworrd skits course Cutters none ov pen toa SMES, NOYES oe week 3 4: Stacks, Queues. ant week 5 6: Trees Binary Trees. BST. AVL Trees Week 7 8: Graphs Rep Traversal Week 2 10; Searcrang AgorITT Linear, Binary. ashing Week 17 12: Soiting AQonRMs Merge Sort weex 13 44 ‘Dynamic Programming a S Week 15 16, Aagortnen ity Theory week 17 ‘and Final Examinator"
    },
    {
        "image": "syllabimatrix1_synth_7_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "LOGIC) “A UNIVER 8e ‘yarn Dams iors ours per Week: ames Laboratory oo peverintion ‘This course cavers (undamentai data structures and nis will learn al sorting algeriinms, and stana and implement fundamental data structures 2. Analyze algorithm complexity 5 nolation 3. Des! gorithms for pre oiving 4. Apply app aromning and de Seurse Gutting. Week 1 2: tntroductia Queues, and Applica’ Graphs Reprasentation, 7 Lineas, Binaiy, Has Week 13 14: Dynan and Compe Bubole, 1s Week 18"
    },
    {
        "image": "syllabimatrix1_synth_8_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY Taft Avenue, Mania Ccotege of As and Sciences, Mathematics course Syllabus in Abstract Algenr First Semester, AY 2023 2024 Course Code: MATHSO4 Descriptive Title: ratagea Number of Units: sum Lecture Hours per Week: Sere Prerequisites: WaTHs2 Lner Agere Hours per Week: 2m ‘ibs Schedule: Movver900A- 190 Classroom CiSteooks: _ Pesbaty and Sates by Wane ES) Laboratory ps. er 900 88 20 .g arrays, linked lists, Stacks, ‘design techniques, complexity applications in software course Description hig course covers fundamental data structures includin’ queues, trees, and graphs. Students will learn algorithm Snalysis, searching and sorting algorithms. and their practical development .5 2. Analyze algorithm complexity m solving 4. Apply appropriate rogramming and debugging course Objectives: 1. Understand and implement fun using Big O notation 3. Design effi data structures to real world applications 6. Develo damental data structure: cient algorithms for proble! p strong pI skills course outlit Week 4 2: Introduction to Data Structures, Arrays and Linked Lists Week 3 4: Stacks, Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8 ‘Queues, and Applications Graphs Representation Traversal Algorithms Week 9 10: Searching Algorithms Linear, Binary, Hashing Week 11 12: Sorting ‘algorithms Bubble, Quick, Merge Sort Week 13 14: Dynamic Programming and Greedy ‘Algorithms Week 15 16: Algorithm analysis and Complexity Theory Week 17 Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_8_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY Ta aver Cateye of ats wna Sciences Motnemstion Course SyHabus in Abst Fret Semester, AV 202 course wesrina6 <n Lo egn Textboove: Ceurse Dexerintion: This cour covers fundamental aa ane graDhs. Stuer Searching and soning aigor devslonment a Stra HG allay, linked sts, stacks arP algorithm design technigues, complexity Wa thei practical applications in watiware Soiree Cblectives 1 Understand and implement fundiamentsa data SHichures 2, Analyze aigeritam complexity Cait BiG O Astation S. Design eftcient aigoriinms sor problem sowing 4. Apply appropriate Sata Structures te reat woria appications 5 Develop strong pr IF aNd Yenugging skits Courie utline: Wisek 1 2: Introduction to Queues, and Appications Wee: Gtaphs Representation, Trave Lineat, Sinary, Masini nd Linked Lisis Week 3 4: Stacks, Si Te ry Tiees, BST, AV. Trees Week 7 8 Algorithins Wes 9 10: Searching Algor: Sorting Agorit K Programing ate Greeay Aigoritses Week 15 16. A 'd Complenily Theary Week 17: Review and Final feng"
    },
    {
        "image": "syllabimatrix1_synth_8_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY Jatt avmoue, Mente cotege of acts and Sciences Maicarnatics yibebeas ire MS AY 20S 2024 course umber of Unit Lecture Hears per Weal: Srorequisitas: WANNA oon emeaeuea Promeey se hatsas Wie 6 ES) cabarato 355660. ‘ren tonoks: a lists, Stacks, 8, comMpIENTY mm sofware course Gescrintion: ourse cavers tandamentat $9 se gral graphs, Stecents wal ieaen algartnm a thms, and thet practca! appl ychures inckiding arrays, fnke jesigh tec ructares 2. Analyze aigorithn compiexty colaing 4 Apply appropriate i¢ debugging understand anc iM undarventa! data st Using Big 0 notation @. Design efficient atgorinn™ Yor probe fos to rea word agpications &. Develop Sireng programing 3% trent skits Week 3 4. Stacks, 78 course Outta: week 1 2: tniroduction to Dala Queues, and Applications Week Giapts Representation, Traver Linear, Ginary, Hashing Week 14 42 SORES Aig Week 12 14: bynansc Programming and Greedy Theory Week 17: Review and Final ures, Arrays ane Linked Lis 5 6: Trees Binary Aigariiimns Week 8 40: Se ninms Bubble, Quick, Merge Aigontnins Week 16 16. Agora rarrination analysis and Compiestty"
    },
    {
        "image": "syllabimatrix1_synth_8_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY TaR Avenue, Manta, Gatnge ot Aa and Stnnews Mamonaecs, Course Syitobus in Abstact Algebra Feet Serene, AY 2022 2026 Course Code: MATHMM Descriptive Title: samasagos Number of Units: tam (Lecture Hours par view: aaacs Prerequisites: UAMoR- vem gees Laberatery Hours par Wowk: ame Class Schedule: Mewermmaw seman rremen crow Classroom: ssw at sanamuane Textbooks: Pmaanity aut Sucvtce Wy eratucr mn Et) Cow se Description: Tis course covers fundamental date structures including arrays, linked Asis, stacks, queves, trees, and graphs. Studenis wal ieam algorithm design techniques, complexity Bnalysis, searching and sorting aigorithms, and ther practical apphcations in sofware evelopment Course Chicctives: +. Understand and implement fundamentai data siructures 2. Analyze sigorithin compiexty using Big 0 notation 3. Design efficient algorithms tor croblem solving 4. Apply appropriate cata structures to real world appications 5 Develop stiong programnming and debugging ‘Sails: Course Cuttin: Week 1 2\" Introducuon to Data Structures, Arrays and Linked Lists Week 3 4: Stacks, ‘Queues, ang Applications Week 5 6. Trees Binary Trees, BST, AVL Trees Weeh 7 6. Graphs Representaton, Traverse! Aigorths Week 9 10: Searching Aigoriths Linear, Binary, Hashing Week 11 12: Sorting Algorithms Bubble, Quick, Merge Sort Week (3 14: Dynamic Programming and Greedy Aigorihins Week 15 16: Aigorithan Analysis and Compiextty Theory Week 17: Review and Final Examinaton"
    },
    {
        "image": "syllabimatrix1_synth_8_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY Taft Avenue, Manila Colege of Ars and Sciences Mathematics Course Syllabus in Abstract Algebra First Semester, AY 2023 2024 Course Code: MATHSO4 Descriptive Title: scsraxagera Number of Units: suns Lecture Hours per Weel: snare Prerequisites: MsTssi2 uner gira Laboratory Hours per Week: 2nmrs Class Schedule: Novivesamaw- 1osoaM srgo0att r200eM Classroom: Ramat sseeesuisra Textbooks: Prbabity and Statstes by Walpole (@th Ea) Course Description: This course covers fundamental data structures including arrays, linked lists, stacks, queues, trees, and graphs. Students will learn algorithm design techniques, complexity analysis, searching and sorting algorithms, and their practical applications in software development. Course Objectives: 1. Understand and implement fundamental data structures 2. Analyze algorithm complexity using Big O notation 3. Design efficient algorithms for problem solving 4. Apply appropriate data structures to real world applications 5. Develop strong programming and debugging skills Course Outline: Week 1 2: Introduction to Data Structures, Arrays and Linked Lists Week 3 4: Stacks, Queues, and Applications Week 5 6: Trees Binary Trees, BST, AVL Trees Week 7 8: Graphs Representation, Traversal Algorithms Week 9 10: Searching Algorithms Linear, Binary, Hashing Week 11 12: Sorting Algorithms Bubble, Quick, Merge Sort Week 13 14: Dynamic Programming and Greedy Algorithms Week 15 16: Algorithm Analysis and Complexity Theory Week 17: Review and Final Examination"
    },
    {
        "image": "syllabimatrix1_synth_9_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY Fatt Avence, Manin Cote of Business Aunmionstion Sonapecent Course Syttabus in canase Unesgemsnt Second Semester, AY 268 2005 course Cade: esa02 Bascripyvs Tide: canmenamerduens Rumber ef univ Lectura Hours per Weal Prerequisites: Lebsratery Hours per weet Claes Schedule: Classroom: eunese Desevintion: ‘This course covers func: quotes, trees, analysis, searching and sorting a development menial date ciivctures including arrays, inked list is, stacks, nd Graphs, Students wit iearn algorthm design techniques, complenty tthns, and tes practical applications in sottware tourse Obsectives: *. Dnderstane and iraplemert lundamental data shurtures 2, Analyze algoritn compiediy using 8ig 0 notation 2. Design efficient algoritiens tor probient spiving 4. Apply approoriate Gila Stiucturts fo tealwerss appications 8. Beveiap strong programming ans debugging seas Course outing: V inftoduction to Data Stuckwes, Amays aed Link Queues, anid Appi ek §-8: Trees Hinmy Trees, BST, AVE, Trees Week 7 3. Graphs Represeniation, Traversal Algorttos Week 9 70: Searching Algorithms Linear, itary, Hashing Week *1 72: Sorting Aigoriinms Bubole, Quick, Merge Sort Week 12 14: Dynamic Programming ang Greedy Aigoriihis Week 18 18: Algorithm Analysts and Complexiy Theory Ween 17: Review and Final Examination Lists Week 3 4: Starks,"
    },
    {
        "image": "syllabimatrix1_synth_9_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY “tat venue, Sas Sotege of Buivene Adonis Mrsapenmrt 2 Patina Htenagemen course Byitabas ie Seccind Sammesios, AY 2824 2025 course Cade: Descipere Tite: Semxesumyeceretins Number of units: Lecture Hours par Week. Penta Laboratory Hours per ecb Saae as eek: Claes Behahig, Nsree RAL NORM eH OEM Shosercorn; mains conte uae Sevebacka, finabanen ts Abyss uy Carmen, tains, Sweet 8 Ste erhotions: rg ondamental date syuctures inching artays, Hiked Heis, stat) jaiaues, fees, and graphs. Students wil iearn aigar hm desigh techniques, campienty is, searching and sorting algorithms, and thelr ptactical appfications in sofware desiepinent, course Objetions: implement fundamental data siructres 2. Analyze aigoriinma complexity uuing Big O rolation 3. Design efficent algortias for problem sowing 4 Apply appropriate vjale structures to reat warkd appicatons 5. Develop strong pragrammitay and debagging satis ey nuction to Data Structures, Arrays 2nd Linked Lists Week 4: Stacks, &: Trees Binary Trees. BST, AVE Trees Week 7 6 Graphs Representation, Traversat Algontinms Week 9 40. Seaice igaoetrs Cinuat, Bary, Hashing seek 17 12: Sorting Aigorétios Bubble, Cui sarge Sett week (3 14: Dynamic Prograniming and Gresdy Aigarihine Week 1 46: Aigonthin Analysis and Complexity Theory Week 17: Review and Final Examination Geessr se Out Week 12: intron Queues, and Applications Week 5"
    },
    {
        "image": "syllabimatrix1_synth_9_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "~ LA SALLE UNIVERSITY Fatt Avene, Marsa Sotege of Buses Adeeeetatan Management Course Syitatiers in DeiAbase Vannzemens Sanenter AY 2024 5098 S202 -Daerte Mamnermses Laburatory Hours per Wael Cormen eaerson, Rent Sass 69 Deseription OUrS covers fundamental data structures including arrays, links: tees, and g Students w p algorithm d analysis, searching and sarting algoritims, ana tho ol development Sourse Chie 1 Unaerstina ang i Analyze algorthm compicnity eng BG 0 notation 3. Design eftivent algonitims for provlem sowving 4 Apply appropnia” data structwes te real worls apgheabons MAING and SehuggiNg shut fement tundamen casters Ousetivne y AVL Trees Week 1 5 ims Week 9 4: Searching Algorithms Sar, Binary. Hashing Week 711 12: Sorting Alortnms Bubble, Quick, Meige Sort Week G14 Cynamic Programming and Greedy Algorittins Week tS. 16 Algorithm Analysis and Campiexty 7 17. Rewew and Final Geamunation"
    },
    {
        "image": "syllabimatrix1_synth_9_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "DE LA SALLE UNIVERSITY Colege ot Busiiens Adis ange Course Byliatus try Melneace Mangement ccesd Serer, AY DOD AN Soursa Code: essa Descriptive TG: camaeiaemnme sate Number of Units: ure Hours per Wea! Rrarsquisite: Laboratory Hours per Week: arm owes Dan sat 90 at Sea at cian e Agsetns by Gsemen, Lasavron, Rivest 2 Ste th Gourse Description: This course covers tuncementai data structs quaties, (ress, analy development 3. stacks 12S, complan fications in software plement fund 3. Design real norid applica nenie: data stuctives 2. Analyze algontiha complenty jent aigoritims for prublem solving 4 Aoply appropriate tune 5. Develop sirong progranwning ae debugging Course Guttine: Week 1 2: Introduction {6 Data Structures, Arrays and Linked Queves, and Applications Week 5 6: Trees Binary Trees, BST, AV: Graphs Representation, Traversal Aigerithms Week 9 70: Searching Aige: Linewe, Binary, Hashing Week 14 12: Sorting Algorithms Bubeie, Quict Week 15 14: Dynarnic Programming and Greedy Algorithins Week 15. Analysis and Compieuty Theory Week 77: Review and Final Exam"
    },
    {
        "image": "syllabimatrix1_synth_9_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "BE LA SALLE MIVERSITY Tet Avewe Colne of Business adm Suurse Syllabus in Osiedese Meravereot Secna Semester, AY 2034 20: Pamasusegscen eens 8 of Units: Decale Miathometes Go This course mental i HANNS Students ya gortne 3 THING algontims, and tneir pra 8 technique: applications in 1 Unterstang ane using BK data str lyee algori solving 4. App ly appropriate ging Course Week 1 2: introduc on lo Date Stuctures, Anays and Lis S. and Applications Week 6 6: Trees Binary T ns Rep) ion, Traversal Aigorithn r Pat Binaty, Bashing Week 14 12: Sorting Algorithms Bunnie. Os 18 14: Dynamic Programming and Greedy algorithms Week 15 18: Aigorithin Analy nity Theory Week 17 Rewew and Pinal Examning ed Lists Week 4 4: Stack 831, AVL Trees w, 8 ane Conipy"
    },
    {
        "image": "syllabimatrix2_synth_10_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF SANTO. TOMAS Course Syllabus BUS 401 Strategic Management ‘Svatege Management by Dave David (7th £4) 80S 201 Course Description This course intoduces stusients to fundamental programming concepts usng Pytnon. Topics node varabiey. 3 funetons, fie I ‘ypes. convo! structures 0. and objectorented pragrammng. Students wa develop problemsoiving shils and learn fo wite efferent, nedocumented cade for reatword appicatons COURSE LEARNING OUTCOMES: Understand funcamerta aragamming conetats are syntax 2. Dengn arc clement agortrme te save seems hasty sbectorerted poyanmng prnepes 4 Debug sn test programs energy ‘Document coaefoloung novsiry stansards TOPICS COVERED. Wess 8: Pihon Basics» Varabies Oata Tyoes. Operators Wlees 34, Conra Stuchres Gonstonas and Looos Wees £8 Functons ana Medves West 72 Cais, Toles 20 Dctonaves Week 810 Fie inutiOvieu Operations Ween Td Suet Oventes Programming Week 1 14: Ever Hanging ona Desuagrg Week E16: Final Proget ang Presentations GRADING SvSTEM Proganncy Assarmeris: 20% Quazes anc Exams. 42%, Fea Proest 20 s Cans Pane gabon"
    },
    {
        "image": "syllabimatrix2_synth_10_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS: Course Syllabus pus 401 Strategic Management rescanee AY lonine Renee Tet ‘seatege Management by Dara 8 80 17 ES) Prereisie: ‘BUS 201 caunaes stents to tunaarenta DOBTMTTNTG Snes ee ae varabes a PR8: CT Se wea FN 10, and obnctonented PBT Sruderts wa develoe to rng shas and lear to wee effet Meudocumented code fo\" Starman appieatons Course Decrpton: ‘Ths coune seg Pytmon articulation titative AD arate LEARNING OUTCOMES, Uneer oe tencamertal ropa oe ana syrezs 2 ONS 2, “Ze oem w save ones 3 APY a pane at 8 a 5 PRED Wess 2 PYEA oceans cose eee erates, Data Tyee een 4, Contr SEES Trot, Srey are eau ene 78 a woe Coane opens Wee 7s Orang 33 Densaag wees “5, Sine system Progamming eet, 20\" clas PANE nots"
    },
    {
        "image": "syllabimatrix2_synth_10_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Course Syllabus pus4o1 strategic Management cial corns guesses ES tet age Managers by Dave O30 LTT ES) ‘BUS 201 rng conceets Sr poes, ano sete: Shucents wi develo? Iooumented cade 1° core Destino jamental 90908 sents fund Ge varabis. d3t ies programming Neve efpcent. wel rroduces jos ne yaoi propiensoivng Mrgeward appvestone vs Artcaaton nitive LAD RSE LEARNING OUTCOMES: Coes are syvian 2 OTE Se Ti ey Seen coe ean tie: Bror arg Eg SrSTEM Promannes Eptcss Parvenston eke Fat issorments S"
    },
    {
        "image": "syllabimatrix2_synth_10_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF SANTO. TOMAS ‘Course Syllabus 8US 401 Strategic Management Pes seme A Statege Management by Dave Dave (tTin Ea BUS 201 Course Description: ative ay COURSE LEARNING OuTe. Pausty Standards TOPICS COVERED Weee 15 Bon E2Et Varaoin, Data Types Coerator Ween 14 Cont Seat oa anaes Aaa itt S8 Fontons an Uaauen Wee £8 Us aes ana Detonares Week 19 Fie Ips"
    },
    {
        "image": "syllabimatrix2_synth_10_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS: Course Syllabus BUS 401 Strategic Management Prat ena AY Ofie: oem tecrerc unezco2z0 Pu neon) Sal eracgenngerreny asem Irate owe aus Wet enamcanes Poor ease Tea: ‘Strategic Management by Davis David (170 Es) BUS 301 Course Desrition: ‘This course intoduces students to fundamental programming concepts using Python. Topics ncude vasables, data types, contol seuctures, functions, fle VO, and objectonented programming. Students wil develop probiem soling sls and leam to wnte ecient, welcdooumented code for reabword apphoatons nos Articulation tntaive QA) ‘COURSE LEARNING OUTCOMES: 1 Understand handamental programming Scncepts and syetax 2. Design and impiementsigrtins to sive probiens 3. Aesty ‘Srectoneted propamming ponies 4. Debug ad test programs effective Scien cose tokowng nécatry standards TOPICS COVERED: Week 1 2 Python Sn Dictonares Week 10: Fae InpulOutput Operations Week. 1 12: Best Onented Progamming Week 13 14: Emer Handing and Debvapng Week Sens Foal Proect ang Presentations GRADING SYSTEM: Progamming esguments: 30% Quazes and Exams: 40% Final Projet: 20% Cass Parcipaton: 10%"
    },
    {
        "image": "syllabimatrix2_synth_1_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": ""
    },
    {
        "image": "syllabimatrix2_synth_1_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Course Syttstes ENGR 201. Thermodyeamnivs, Londamertis of Mhernucenanies ty Suigahan Shoning ik 22) Conse Desgtons Tris couse mvouacus skies funsamentel emgrarenig concepts losng Python, Topiee mois vanabies, dat tyra, poato! stusses funclitns, fe WO, und abjactevanted azugrarmning. Stadents Ws seep [grigisneighing sls sr aann Innes ainsi qutoomanten oe fot ‘eotons naaieatans, is Asticating tase AAG COURSE ARNG OUTCOMES 3. Jeaancand Sondamaste egamiatig apnepis 203 aysian 2 engpad impitaen septs Po se proses f ABBY Sojestonnas wragrernng srocnina seta and tant sagrane aint osonient sede ogeng adoste stains TUPICS SOVERES. Wuek #2 Seegrinass an trey Week Aeneas ec ew Fr sie, Tai ao Dictavaes Weak 8 15: Vie vga Ooi Cpertans Waa 112 Chjersoveed Pagani Weer te ee aca ae aaa Henk Sea Pas Psst a Preseutstees GRADING SYSTEM Progamming Agpagomana: #81 Guages soe Gon. 40% Prem Pageot, We Clase Penta"
    },
    {
        "image": "syllabimatrix2_synth_1_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "ATENEO OE MANILA UNIVERSITET nod Panve 3 gar zor Taeaneynarcs anten cr nmmengeren ot pagan of Taine te Banat SECS ceneas eee, ee 10 coun et i gundaces tee fda sonsate Ta een Tap wees WaCahets AD Bento! wrvctes ucts ek e528 Wein 00. on ohaen Mepremaceing shen 270 Neaedacutrassee 308 197 acco apnoea ii Acetone AB, Ae ins DISCORD. 1. ote emecys SER Bote Sree gas e aenre ns ones wis Nt it nat ecemaeg sooner Wee Fea et etter en rcs Pt"
    },
    {
        "image": "syllabimatrix2_synth_1_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Corie Sphabes Thermodynan cl een eeenpeen en Fscamentas of Thesmestnaios by Borgathe Sarg Trosepnibe: ENGI cor use Desetton This course invaawows stlents ta Lodsminta! po using Peenan fonatns, ois ‘es riucie venwsieg doin toes. convo’ veanes nd chiectonented aangrirenny Student wit veka ding shes £0 Wan 19 wa avons, wadeeumented cate ee sod apatenons, on tehetatinn tan SOMES 1. Ussesstans imamate! sapeciming °2 Besa ant wrgserers myo ton rare Wee BS P80 bgus put Coa Yawn Qurevdrariea Miogeaemny Vaok Ftd oe es Haneing 20 Detagying Wak Gh Pegs, Piyect ant Pueemations GALI S Beeson:"
    },
    {
        "image": "syllabimatrix2_synth_1_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "ATENEO OF MANA WWE RSHTY Canepa Sytleos ur Tnacmeatynarmcs eonemnaene ch Tremennramen 9 Ragoanan Serra 6S cece erin Teng Tene Tapes cease Seoancaaweg say end Wah Teneo sppewtont ao! congener senons emer re ett (ANY eee pemnens CULMS Coowwans Seamer VO cx oe SOE, A imac mene sane memera 5s Se Le Rares 8 See yee 8 IRE ET gh FE oa nanos nora TS MERE, Begs La Maas 28 Conve reioet re Jeol eet Papen ny fe 3 Secis Aaa"
    },
    {
        "image": "syllabimatrix2_synth_2_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES Cavree Ssitabay E8101 mtosachon to Programming rest: Python Fingramnony, a imredvaina to Cemuutee Sune ap ote Zale Be.) sans Dour his ouarse stoduces students w fundamanter pmgeetanany concepts lisnig Fyn, Tepes nokse veramies, tay oes, corte cane i a 3, and comciaratine paging Sheses we dese Jaon sving shila ang such to ta eifsans wabdaaurentes cre tor reonnard apmcetons: ‘ers sthsitina Pitti COURSE LEARNT CAITCOMES: Uren Rennes pega Sonuaits toe aye 2 Deng oo wipsersan ayiettne 3 sate owe (Siecrananees grigraning ps pat 4 Date ma tee oars ewe Soranant end tem wawty sansa TOMGS COVERED. Wank Oo Pyther Rascs varaves, Dain Types, pean Nowe 2s. Cases: Sree (Geoiisoons and iano nen 86. Portens 986 Moskas Wack ME Lore dhe Dative Veen BID Fle LiiOueut Coeraiaes nen $552 Bee Gomaes tropmnmig awn hk owe Henin re Dessay Wok UEUp fea Begess Gos Pesnctsnone GRATIS SYSTEM Praearni) Resorts So Sette: ane Eaqsiy 20% Pe Pgs 20 Cass Pavenator 2"
    },
    {
        "image": "syllabimatrix2_synth_2_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES. S830 tne 28 10 Sogiamming Ae Prarie: Ao toon Camas Senn by Dale int ey Premises Nene Corse Besvgten: ation aidan iy COURSE CEANINS Oe 5 1. Untertand tendons geparnming sheet onan ae Sen ed riko tation scape Aopy RE Se eoprenineg sarenes 4. Lenya teat gop ee Doounem cee teu Bases Varies. Gat Types, Coaratom Ween Berntaeaie wd Leege Yaee Sa Fo S00) 4. Savi! Seaewees soos and Mrsae Wa 2 i Bstonsres fess 610: Fou butngpas Doeemone Meee beet Deane: Prac fe S344 Baar 1208 Fon fryer one Pe Asngersene Oh Ge"
    },
    {
        "image": "syllabimatrix2_synth_2_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES Course Syllabus C8101. mrasucten t Programmng Teecoimiamean: mal encsamemenn ene tot Pymer Progamnng Ae intnaton to Compute Seance by som Zate ie Ea Proven (oer eerie ‘Tha coune ntpaveas students to Kindamenta! pegrammng concepts ang Pymon Topes meade verabiwn Gata types conto wvctows functions tie U0 and objectonented programmng. Students wl Saree problemsoivng this and eam to wrte cent wetdocumented code tor ewow wopmcatons Maes Arian atv COURSE LEARNING OUTCOMES Underntans Kntamerts pogammnng cerca wn syntan 2 Dang and mownen agen vce Pec) ACO Giectorwces poy tnnng rocenn 4 Deng oa wnt wagons recnrey Decamert coos loner nasty vaneae TOME COVERED hems Td yen Riser Viruses Dus Tysen Cowon Wem 34 Cone Srwtows Conghonan ond Lense Woes $4 Fonctare bet Wotan Wee 74 Dats Togs re Deters New $90 Fie vet Oane Opwrmrs Wome 12 meet rented Pragamonng Wane ie Ene ana we wen Ie Fea Prog! na Pevetmne OMUDING STSTEM Progen Aangomerts DON Outten ad Exams #5 Few Paget 200 Cann Patepaton ~"
    },
    {
        "image": "syllabimatrix2_synth_2_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES Course Syllabus CS 101 —- Introduction to Programming Instior agers ee Wet gunraten neat Pon #3 seuss ae Test Python Progamming: An Inoducton te Computer Setence by Jota Zese [3 Ea) None Course Description ‘Ths course moduces students to fundamental programming concent sng Python, Topics nowde vanables, datatypes, contol stvctures, functions fie V0. and objectorented programmng. Students wil develon problem olong shae and learn fo wete ettcent, welldocumented cade for reaiword appicatons Minos Aeietation Initiative LAD (COURSE LEARNING OUTCOMES: *. Understand undamenta sogrammag concepts ana syntax 2 Design and implement agortims fo save probens 3 ACsiy bject ovented programming principles 4. Debug an test programs efectvey Deswmen cove forouing ndusty stanaarce TOPICS COVERED: Week \"2 Python Benes arabes, Data Types, Operators Week 2: Contos Sructres Constonas and Loops Weer 58 Functons ang Modules Week 7 5. Lsis, Tes, 4d Dctorares Week (10 Fue In Ovtpt Operations Wee 11 12 Gpjet Orantes Progamming Week 1 4 Err Hansing ara Desugeng Week TEN: Fra Pogct ang Prasenigtons GRADING SYSTEM Proyanmg Assgrmants: 20% Guazes anc Brams 40\" Fea Proect 20% Class Parsgaton"
    },
    {
        "image": "syllabimatrix2_synth_2_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF PHILIPPINES Course Sytisieas gg 1a1 mean Pepe Fragman oe sera oe Bait LEE arigatr Sianes aye Proranags Be ssi 2G roe conene Deception “ine san suants tz frsarrariet pagar Oe SL aie Sata fypes, Sara UIE nts wb develoe fing Peta. Tooes ete Ha, and copaastinted PS “ibe asd wn to abe ett reming. Me obdsaumanted pomaaesoheng raves eepbeatons LEA c COS so sym Das SH EAC oneal Sot amning eeotes 2 Osi 2 ee sate sxceng ted es Der eratien. ne Types, OE Sati ee pa Lugs Week Ste Femme at careers Weak E19. Foe bs a ces Propaning Week Breet on Fasesesions pees wo Eaend te"
    },
    {
        "image": "syllabimatrix2_synth_3_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "t NIVERSITY OF santo TOMAS Cosrve 8rtistas 2YS201 Financial Accesintng Powe oe ams Pest Aoccitig by Yersont, Seems Kiara (8 63) Povvonsisies Kone Destin SRS couse trimacews stctents ta ston Prtion, Pooisn neue Neste, 80 amd soy Problems sks and pee mabnonl apotetans *uetiamentat prego Sacahies, ints iver Ww oneapte tants! siacnenee Sent WS dove SUC end tap \"ed arageammaig Ste ate effient, wean ‘nol raion ttn easy COURSE LEARNING Ouro: seein ns, ssansvae Toe Bats Nysoe, Bin 500 Longe Wess Ba 28 Deion ack Bie Fa, kine Onerted Pegemmesng ek {SM Fi Boies! ag Porton Sssirmerts. 30h hanes 1h Prosacimc Pomoc 20%, Cats Pexipution"
    },
    {
        "image": "syllabimatrix2_synth_3_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": ""
    },
    {
        "image": "syllabimatrix2_synth_3_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Course Syllabus BUS 201 Financial Accounting Fratsenese Ay Ofc: noon ea Taree Aneel eam enon Phone -e saree functions, fie VO, and ed programming. Students wil develop Peabo wee S38 and eam 0 wnteeticent woken code for ‘ealword applications, Operations Week tiz- amning Week 13 14: Est 2 Debugging Week dosset ators GRADING SYSTEM Pega, Sone 9 Onszes ans Erma Oh na Paget Se Participation: 10%"
    },
    {
        "image": "syllabimatrix2_synth_3_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSHTY OF SANTO TOMA! Coarse SsHapos BUS 20) Financial Accountieg posenaim #0 ce: ee 2 foe ena ee ven eo kone ose Ot\" EAS Coase Beeson ‘his oaunge hades sealants te Kindamnla gcopemcnang exneety using Python Tops mace verso, cata tyes, dono) eins aurey functions. 8 3. asd oiapctavanied exgiammeng. Suidents wa coos provlensoiveng als an learn to une etagnn veredoouena mest oot ets owas Satatine Ady COURSE LEANING GUTUCAS Unlaste todanatt opacity Sonsges ara syetas 2 Dwe gn ait ampere agent s to aah Woke AOS capetemen prog amg passes. Debug bra Tone grgrans aetney Dermat sede leloung meusity sardane TOPIGS COVERED: Week Me Pyar Bigs Varies. Data Tysen, pues Week 24 Covel Srustancs ‘Gonasienas and Langs Wowk 6 Fonivra son Minho: Week Ps, fg. ea Dtonanas Ways $10: Pa ingalOuina Oprasom Week rectinensea Pyeng Weck (e s: Ena! Nandinn we Genoa Wash BEG, Fees Paya and Prevetatons SEALING ESTEN ropa dogigvnerss. 2a Gaaias and Bigee. ih Fs Prgey 20 age Pe"
    },
    {
        "image": "syllabimatrix2_synth_3_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Conve SyMtadus 2US 201. Financiat Accounting Con rome. tte mene Seneca mes mere met eaene mner Ye mecnenonme Pome atnowaTes Heat: Frances Asacurnna Uy Woygarat, Kenai 8 Nien (120 Ge) Promainer ae Cenees Dsermton ‘The cursa womens stadeate te nsemema! pageranng cones ang Pynen Tones made vangbles zt ioet eontel mune. Eumemuna fhe vO. and eject tanta’ eregramneng Susdecrn #8 Gereiny robinmgiong sey took wa “2 arte eon wesc ed 6078 her ebnens pape nery ends Arve ene COUR LEMANS CUTECMES Unttan en Sorin itn Sug niin cgeas ves Ps Ae Sorcrenes mapermngimeran’ Deng ns en papecueetee Siting san cara nanny eeaons Tones COMED fo 82 yom Ses voees bas Tyee. Poeraan Ruan 54 Conss Schon Coates sat cae Wn 4 Penns fot Bete row 8 To, Dae Srrarenoes Nepermey Rea ttre Nancoy ne Dears eet Soin Fina Pane nd Reseranwe ORAOBS NITEM Pepeersy Magee bos Gates ow gammy ak na rae Ioan Power bs"
    },
    {
        "image": "syllabimatrix2_synth_4_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": ""
    },
    {
        "image": "syllabimatrix2_synth_4_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES, Cosese States ENGR 30% Fuki Mechanica Pre pene my 86: ame Terome tmoraios ceo mee; sal: onary eaure Prota: sassaeae Feat Fe thechanice by Wie ten C9 Prcegertie, Baa 20 eae Session ‘This ecco interes sodente te Seounastat wing rehion. Tepicx ute vascome, das Seat, eomaat volowe fesetons Fa M0, ans ehepotavented sreqrumnme. Swdanin i daveGy Srabierrsabing sks unc Sear f2 wibe elie, vmeatourmarien rose ee eaoed epaseatane pega soneegts ‘hoc Nisin Pits LAE COURSE LENRING OUTOUMEE: 1. Unsenians urdomnta eegpemnieg Senenats me syriae 2. Lavan aU! mplenant ageive i sabe Secon t Aggy Sesterac aegmnnng screws 4 ekug and tent pam paneer Qasonant sure héeng Dest sedirgs WOHES COENEN. Mace ok Fete Been Verses, Data Type, Samar Weak 5 Sect’ Sevutoes erent aro Loven ene $8 Tuncsas ane Nein Howe Fe ta, Tosi, ao Disnoman Wash BE Fos Ingen Comraae Weeae Tek Goat Grantee Perpamiing Bose F315 Enos Hang ant esc) wees 1558 Feu Pest and Peneweers ONIDNG SrETEN Supee Revepaiants: 30% Oeaaes and Easens 40 Pad Pek. PL aes Pein: oS"
    },
    {
        "image": "syllabimatrix2_synth_4_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF THE PHILIPPINES Caney Spates ENGR 20! Flot Mechanics Sea pacers eocne 8 Bab wraun masseuse Prats, AY Tee deena Phage se PIE 7 ica Hacaanion 9 Was th AS Peavegsinit Ena at ‘cere oneeitons ra bourne btsutese shanty i Fneacarta aogreming cone oy Syien, Topas oohude zrchns, cata types, contre! sevorute® Se Ea UO. cnc objechanoited pragermorny, SSud4786 6B Aveta “poms sent, webcienitonnnd sos robin var ana xn feabord expiewton’ ‘igo areoainn Hater CAN OURSE LEARHING QUYCOMES: 1. Undertens feetemastst propacnirg aR eran 2. asiga 3 magamrs eters stk mbes 702 cer creed eegeroming posses 9, ete ded ost cnaracs wae 5 Sa es along erent aandarts TOPICS COVERED: Ce C2 FjOemt Ree ime, Gren Tyas, racemes Week A: Contet Seelre ete ear nage ihned Ba, Fines 2nd Wear Weak 72st. Tot Ce Ae Re wank Ge Fae ngeslintnes Sentra hawk 19 SE 2 eared Peeroung weds t3ts, Eoas Handog an Onmoeer Wats Se Se enet me Snsecesins GAALDOKE SYSTEM Seagate FER ENS ED Gemzes ae Exar st Foes Proper te Case Foe on"
    },
    {
        "image": "syllabimatrix2_synth_4_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "ERSTTY OF THE PHILIPPINES: Canese Sp thebae RGR 307 Fluid Mechanics pion Meananes ny Westie bx Preece we Decision ‘Tne voune od using Prine Ta Linvtoos ha iS) nag vemctonentes prgiarenng Sh pice nanny Seba arb mart Ho mete AEN wwe Hioaven apsicatene Ws nthe vanabieg, dasa Knee, ouieul wructaes, i nek enveroe wanted ea0 8 couse 5 Urlentane tasanmite eogrenenng eoregats ang syrtas Deigt an rpm agantng 1 bowe weEAMS TACKY chest antes beging sues Gatug ans WM eopreM weary F owing ay angers TOPICS Eis aimed Se fet Devoe ne sss Outanaowa Ween b 0 Fae teat Outpt Oowenvors fees e 2 Sch rates Panny Wits The ar gas Degg Vee"
    },
    {
        "image": "syllabimatrix2_synth_4_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "ENGR 301. Pate Ay UNIVERSITY oF E PHILIPPINES Course Svilabvas Fluid Mecanics thm maonas SMEAR meses al yee ae Wb eee, Home: oa seme"
    },
    {
        "image": "syllabimatrix2_synth_5_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Curae Sylisbue 84101. Inleodcten 1 Programming Python Srewemmng: As irscwedios to Corpatey Selena ty Jobe Sate es BE) Conse Bizet ‘Tres rowan inimuoes sivtente io fundlestental pagienmng seoonnts gong Prrnoa, Tepes nude varabien, data gee vantts) erties Juels, Te WO. and objactovientaa yrogiaranmig. Scudtets we uevelp pebieregieng sias un nar te hte akon saikdncurvented cose f Pentoore spperatons COURSE LERRWING JUTCUM soanstane hes estcees aa syntax 2 Dogg and implement sgetens to sae $e biel snewted seoprvting Sneiies 4 Deg tater regres Bevniwr uses laigning oni siaenos TOPICS COVERED Wee 2. ythan Rises. dvabas, Sate Types, Opens Week 3a: Cove Sects Gerdessis a Loops Wiens EF files Vou 7 toa, Ta, sc Dishinares Weee 10. Fe Inga Gutpet Cparations ask AZ estatanied Pogrmarang Wao Wiley Bor sanding ane Dewees Yee Sib, Foal thoe® and Pagoriasers GRADING SUSIE Pagraming Aapomame sos Gnzaes tou Passe. 05 Fina Pooach 2) Case Paeionstan 8 5S"
    },
    {
        "image": "syllabimatrix2_synth_5_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "ATENEO BE MARILA UNIVERSITY Canrse States E8191 neoductna te Prograrantnn Prem Programm As etd io Dae 8 aente 12 anda eginrinang eanoapts antag 28 88s ane eam ta wee eee atigcomennteese ealsions espicancne ra aetistatien Heine th Unter Saami searing Sst ad nyt08 2 Desge me msament agers sescsoreies pogamwning on per e Dag S10 toe aeaiens 3 Aes Bosiee ease etn» oe a ors Nes neu rest Outnt Goevstore Wee Sune 12 Brae raters, GRACING 3 say Eanes, “etal"
    },
    {
        "image": "syllabimatrix2_synth_5_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "ee Se ior cnmmneromset Ye yay open heme ORES sevens Sve Ra 8 ES oS crore syestac esha ANTS See Ton se 3 RY Powe nok rena ae Lowen a, wi Mocs see 78 Lt Cerca 2s ae Fi emi 1 See EE rg te ne eS pang io Ope er puns RATING ST en SSDS asses we teers fenuspaner"
    },
    {
        "image": "syllabimatrix2_synth_5_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Course Syllabus C8101 Introduction o Programming Seece prossoranemses Sl nau magaensenn Phone ea asacearae “Test Python Programming: An Introduction to Computer Science by John Zee (2d Ea) Nene Course Description: “This course introduces students to fundamental programming concepts using Python. Topics include varables, dats types, contol stuctues, functions, fie VO, and object oriented programming. Students wil develop problemsoiving skis and learn to wete effeient, wel documented cade for restword applications Minos Aeictation Initiative LAD ‘COURSE LEARNING OUTCOMES: ', Understand fundamental programming concep and syntax 2. Design and implement algortnms fo salve problems 3. Aly cbjet onented programming principles 4. Debug and test programs effective 5 Desument cose folouing ndustny standards TOPICS COVERED: Weer 2: Python Basics Vanables, Data Types, Operators Week 34: Cond Structures CGondtonals and Loops Week £4: Functons and Modules Week 7 8: Lists, Tope, 4nd Dietonares Week 9 10: Fe Input Output Operations Week 11 12: (nject Onented Progamming Week 13 14 Eor Handing and Debugging Week {E 1: Fina Project ang Prasentatons GRADING SYSTEM: Progamming Assgnmants: 20% Guazes and Exams’ 40% Fina Projet 20% Cass Paeipaton soe"
    },
    {
        "image": "syllabimatrix2_synth_5_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Course Syllabus 68 101 Introducton to Programming secre ones A ice Moon tt Wor corancamoneowars yin Progamming An reaaucton te Comper Seance by Jobe Zee 9 £4) Protege: Corse Description: \"Tha course etvoduces students 0 TEE Soymon Topes mouse verabies, datatypes, conta! sSrvcures yong Panes (o. and objctoranted programmng. Students wil develop erent Sng ats and eam to wrte efter weldocumented code fr reasword appieatons. fundamental programming concepts Amgois Arica tate AAD aiinse LEARNING OUTCOMES: 1 Understand ancamenta rogammeg COURSE eta 2 Denar and moment agers io v8 bie SASF Set Ee Sapam soocwes Debug a es peas ANS ae i ee ng sat wancarts TOPICS COVERED Wees 12 Pyiton Seca Seles, Dua Types, Operators Week 38 Contr Srvciees Bases eT ops eer 8 Functors ond Mosues Wate 74 Listy, Tut Coreen Veet 6 10 Fie inowQws Opersions Weve 112 Bee prapammeg Ween 4 Err Hang an Densgang ee Cee oreo ecrting Preseresors GRADING SYSTEM Pregame TEIEORE Sis ataaes ane Exams 40% Fiat Poet 20% Cate Paces, co"
    },
    {
        "image": "syllabimatrix2_synth_6_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "FAR EASTERN UNIVERSITY C8101 tnbeducton te Pragcemmeg seem sewn Af Oise Reve °F Aa inapsson to Cemeatee Science iy Jahn Za nt E, Case Deipion: This course rtiuces sludants to fundamieat! programing concapts wii Ryton. Topica male varanies. data types. torte vinatonee ‘enctans, tis HO. and atjectarented progrecmmmy, Students nt dese tinting Oks arc warn te win alfa, sw lacaimunied cove f Loc aepleatinns, Ma Aciclaiondnttine (hts SOURIE LEARAING OUTCOMES: t. Undecsane fatiments popramning esr2tett and ystan 2 Bate 4nd inion hgctars to sei okenn ogy hie onanied smaqramoing eitaiies ¢. Dring and Sa omgarms tteotces Suaavact cos tering eccany slastnas THES SINERED. Wek US Pow ‘Besar Verein, Date 'yoat, Opens Wack 24 Conte Stack Scotts and cos Waal 36: Fuancters ant Wndsies Ves Th Les, Yves, an Oinsensons Waar BAG Poe iattntocd Spersanca Wee 1 eiea Oneciet Programing Vian FEN Be sae 1856 Boa Pigjoet wa Preseoatns Ganon Baseoomesis: 1 ="
    },
    {
        "image": "syllabimatrix2_synth_6_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "FAR EASTERN UNIVERSITY ‘Course Syllabus CS 101 _- Introduction to Programming ‘eons cameo AY Office: tense 2 nu peonsea ll: rcaaereason ‘foewcor vases wage Web: names nas ooeasie Poe ss seeanane a ‘Python Programming: An Introduction to Computer Science by John Zee (3rd Ed.) Preroule: Nese Course Description: ‘This course introduces students to fundamental programming concepts sing Python. Topics incude variables, datatypes, conto structures. functions fle UO, and object oriented programming. Students wal develop problem solving stals and leam to wite effiient. weldocumented code for eabnond appicatons. Minois Articulation Inttive IAD ‘COURSE LEARNING OUTCOMES: 1. Understand fundamental programming concepts and syntax 2, Design and implement agerthms to sve probes 3. Apply chjectonented programming prncbpies 4. Debug and test programs efecivey 5 ‘Document code folowing industry standards TOPICS COVERED: Week 1 2 Python Basics Varabies, Data Types, Operators Week 3 4: Control Structures Condtonas and Loops Week £8: Functons and Modules Week 7 8 Ls, Tupls, and Dictonaries Week &10: Fae InputOtput Operations Week 1 12 Programming Week 12 4: Eror Handing and Debugging Week 15 16: Final Project and Presentatons GRADING SYSTEM: Programe ‘Assigements: 3% Quzzes and Exams: 40% Final Poet: 20% Class Parcipaon"
    },
    {
        "image": "syllabimatrix2_synth_6_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "FAR EASTERN UNIVERST Conrse SyBanus reonuction to Og! es tot seresenacie 0 haooe ee sey Progam: veonenites Sere Coane Pap jarenvat prapransig Camere’ seca types. rik acute xi ven prantems Clerc! spgeator ont Netter fiseane GAD pants uTZONEE: $. terse Psa ms excimer SQ I 9 agin ga PE er anaes, ToPIGS GOWERED eats 1 Phen Fe ae 28 Ces SOW, re Oe Seta ae tons Haak 7% Sts Tou ge ignaroutia Onerters Week 17 42 Se aon ae aiegna Wee Sepia Sve TePe Pagan AED aa eset: 1s Gas Paice: ondomerial ieee io ave enous 8. Ny 2 eral Mosconi Ne ES Feat gat we Reserscons 6 Depipencrte: Bom anata aa Baas os"
    },
    {
        "image": "syllabimatrix2_synth_6_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "FAR EASTERN UNIVERSITY Ovanrse Syiizbus C8101 fahedecton te Programming eine Desseptons Thi: save itmelons shents to fundamental srigracaning consepes using Python. Taples indude vaviaties, dale yas, contol stusices, funetans, Ke V0. end ubjactonanted grogeamnang. Students wt davon pmblannoohing cue gad arn wre aif, wmbaseamented ode fat eabaosd wpnioetons eu els Antevlation tdtatine QAR, COURSE LEARNING CLTCOMES: 5 Understand letaments sgemsnng cseceps and evan 2 Design and uiaiem agortans to ative prem ©. Asay Shaskcnaned pepining macyies 4 Untug sno ies! mograets atecivey Dissument \"eae tezung minty standagds VEIGS COVERED: Wenn oP yO satis, Da Types, Opes Wess 2 Contet Sata Gonstonss are tops Ween $4. Panscene ant Mons dat 2 ite, Tus, tt siemens law 0 His input Dasatons Week IE Gascturnntes Progamming Wess Vi citer Hansen ona Dacoagng Wak S508: Pop Pgect ang Praranatins GRADING Se STEN Programm Aaggnriente: 20 duicees ano Brame: bse Pesan. 208 Cavs Paron"
    },
    {
        "image": "syllabimatrix2_synth_6_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "ours: Ds peng bamvigwng th: sich mum i uie attoent, welcteeumented"
    },
    {
        "image": "syllabimatrix2_synth_7_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Course Syllabus BUS 301 Marketing Management Prstsamese. Ay Office: Room 308 ‘Seon 8 77 180339244 Roem 208 (qual: trermarnaigaterescousn ATU. carta Woh meats cau srcecemce ‘Course Description; ag BUS duces students to tundamenta progr fineder 220 Topi include varabies, data yee een structures, saan Le UO. and object orented propane ‘Students wil develop Fab one SAEs andeam to ete eticene mobs code for ‘eahword applications, Minos Artcaation Initiative AA) COURSE LEARNING OUTCOMES: 1. Unies Operations Week tiz~ fanning Week 13 14: Est and Deboneing Week cusses ators GRADING SYSTEM Pega, Sonne 9 Onczes ans Erma s0% na Paget Se Participation: 10%"
    },
    {
        "image": "syllabimatrix2_synth_7_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Conve eHabus US 30% Marketing Management Sat axeting Managerenty Keter Kebes jth ES) Coosee evap: Tis anuise mibrduces students to favamavtsd negimniring anon lisng Byshon, Tenine noua vavables, dala types, sorte sues Runcions. He WO, and abectorienied pragranning. Shidents wit devalon ssbie suing ee andl vm sts niftent Weelzovenanted eae fF eater apprcetons ots Arielaen tae (Lt (COURSE LEARNING OUTCOMES: Undeertang fandamants! pregrama Cconaes sa sya 2, ange ardimpiner agorznne to sve grtieme ADS Sepouenwitas egrsing pronglas 4, G8bu sot lent aearams aoe Dasterers seve avonny weiiny sineards TMCS GOVERCA) Weak OE Fino Buss Voubies. ata yore, Qpeatrs Week 24, Deche! Suse: Coniicnse ani Use hast £6, Fopatens ana Mestsus Vash 7 ats, Tone, ant Diovonarita Week 7G Foe one! uaa Coaraars Weak Chen ted Progeny Vaan SIC Eros Homans ane Gehan Wee Up: fan Pepest ana Pramunalons GAADING SCTE Progaming agonists Sots cuetzes one Gears: 4%, Foal Pager 10s Sass Pahapi"
    },
    {
        "image": "syllabimatrix2_synth_7_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "ATENEO DE MANILA TE UHIVERSITY ‘Course Syltabus BUS 301 Marketing Management poe A Ofte: Aeon een tao ee che! gene tere rar wenere Se nee Powe oreo Tew Marseeng Management by Hater Kater (180 Ea Us 201 Cer tree ‘Tha coune mtoduees students io tindamenta! pogremmng concepts wang Pymon Tepes neue verebis dete types conto. seus Aanctons te \\O end obpctorented progenmng Stusent wt sereoe prbemtowng ti andieam to we eMcen! wetdocumented code tr Teese apematons ren ttn) ‘COURSE LEARNING OUTCOMES. 1. Unsantan tndomere Soe ena gna coe agent wea eaone soroeee ‘ener cose lou nasny nonawee eso Saver vara, Gun Typ Spon Won 3 Cons Steere Conant ond Langs Wa 88, Pecan be Medan West 74 Ui. Tis, Sateen fom $10 ia ear Orem ee 2 Sees reees Pay ennny fee og Demagry Woot {sie Fra Prec! ta Peveranons GRADING SYSTEM Peagemeny Meggentes Ss Gates we toes ene Pe 2 Ca Pepto"
    },
    {
        "image": "syllabimatrix2_synth_7_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Course Syllabus BUS 301 Marketing Management 1 Kote 8 Kee Manetng Maragen 30S 201 Conese Des ‘This course ntoduces students to fundamental programmng consents Using Pyinon Tonies mouse varabies, sata types. contol svctures, Honctons, fie and abjectorented programming, Students wi develoo Droblemsolng shes and lear fo wite effzent, welocumented code for feacword appleatons Minos Ativan iat LAL) COURSE LERRNING OUTCOMES: Unsersang turdamenta Tee tevoung mover) wanaaas \"OPI [gaces, Dace ryoes, Operators Wane 2a Conv Sruztures Lee Factors ano Moawes Ween 78 Lis Tunes bt Brov anding 3 Deowgong Week ADING SYSTEM Pagan g Ges Parcoaton me aos Fa roe"
    },
    {
        "image": "syllabimatrix2_synth_7_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "ATENEO DE MANILA UNVERSIT Coarse Svitetos QUE 301. Marketing Management Pca Fests Soruntng Mavagamen by Noted Hee ate Desert une aiasuces susants fo tanta mente progrerentg onies nehida varabee caia ypes, eaiai enictes, Grand anjectanentad ningramrong Silane wa Seumiog prohieniang ts Rata 3 wre afl, Neb acumen cod fot rea word aapieotions"
    },
    {
        "image": "syllabimatrix2_synth_8_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "FAR EASTERN UNIVERSITY ‘Conse Sy Mabiey BUS201 Financial Accounting Reni) all ate reuraaupe Phen a9 seas Test: eames Aacouig oy toygane, Kenn ting ye ta) oer Decca This couree tenuis sivdents sy Py grein Sonepty iMG Skaters wi develeg 7 Yo wit afisen, me Seonveniea soa ‘daaks Avesta Feta ctaty SehHSE LEN eseceuis 02 eteranied Barret sos Bases Sen! ROA BHF fas inpanect eae, Dante Orestes Peery 3 Mont {3 55 Goon nee oer Bg Sah Suet me Peseta ean See Spas PO Svea aon ee Pow eee Steieaten oe"
    },
    {
        "image": "syllabimatrix2_synth_8_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "FAR EASTERN UNIVERSITY Conese Sytabus pus 201 Franciat secnunting ‘meurhonns 2 ce ans cgi pee Ween aoe ee Wor sernaans oa fv abet ess Financat Doameeng by Wears, Seams Hints: em te? rateoubate Bue anne eatio “Tes eens aN song Parent. Foie ne orsbuce. Be 3. ard 2230 as OPH Soheerutrng cat one tan 12 wes efor Reni ana sien ect: eine AAT te tiertes encarta EES CRE ENRIGNG RAOSMED RFR ae man aa 1a PEN, Sere a segregates 3, Ce 8 ergo ewe ee aes conics Seen) ME ee ned 8 0a EET ae Te ant indies Weed TE LEER. SO. Fe cae ents sensors Week 1 E eee oe anterg won tiwocaary Went Weg MUADINS SOTENS SaenS Fre a Fil Prenat 20% GNs PaRicsTeC pe pecs Seocroenes agers Op Font Pret ad Pte Fepmverts, XP TENS HE oo"
    },
    {
        "image": "syllabimatrix2_synth_8_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "FAR EASTERN UNIVERSITY Course Syllabus BUS 201 Financial Accounting Gracramimscriosoey aconaoy tll mraveoearreson Financial Accounting by Weygandt Kimmel Keso (10th Ea.) BUS 101 ourss Description “This course introduces students to fundamental programming concepts usng Pytnon. Tops nelide varabies, dats types, contol sivetures, functions, fie VO, and object oriented programming. Students wil develop problemsoiving skis and lear to wrte effeient, wel documented cade for resuvord appicstons Minos Aeietation Initiative (LAD ‘COURSE LERRNING OUTCOMES: ', Understans funsamenta srogramming oveents ane syntax 2. Dasgr and migament agerivns fo soe stove 2. Acly Gomcrsrantes sogranmag suvocias 4. Denug sno tent cograms afasivey 5 Desument case foloning nausiy standards TOPICS COVERED: Weex 12: Pyiton Bonar arses, Daa Tyoss, Qoersors Weer 24 Corre Sructres Consieras ang Loses Wass £5: Fonctors ave Moves Wase 7 2 cate, Tuoi, So Detoravas Wess 0 0: Pa navi Gute Onaratons Wee 17 2 (pject Oremed Progamming Weex 13 14 Eror Hanging ana Deouggng Week Seng: Fra Pact ane Prasenistore GRADING SYSTEM: Progemnne Assigoments: 30% Quazes and Exams: 40% Final Project: 20% Class Parcigaton"
    },
    {
        "image": "syllabimatrix2_synth_8_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "FAR EASTERN UNIVERSITY Cosese Syl BUS 209. Financial Accounting fermen sores tame, Sa een nancik Asceuntng by Weygardh, Kina Reo Nuh Protege 3901 ‘Ces Hori ‘This couise Iibasuces students to Aondmente! enigremning cannes, sig Python, Tepes eude earohis, dats iysts, Sorted souaures Furcbuns, Se Bf, are ebjecteanenrant sagraete s. Stents wi eran are satay aly 20s main to wae efferon, wakelurwnnanted e298 far reac appieasin, ins nests kane NB COURSE LEARNING OYTTONES: 1. Uadectios Letanaltn seogananing Senses asd syrtsa Deeg aot souianget pt Ghenanieeas progauneg prosglan De ceumane cate fessring neat sams T smote, USt9 Tyee, Hpwuiaw Weim 24 Cette Conttionss ara ine Werk $6 Functions we Hinton Waeh 7 Line, Tosi, 3nd Dictonis West G16: Fas Inpelata! Cparaone Ves I Genel ented Piogameieg Ween 2 14 ew Having a Omang Week SEI. Fins Pract ang Prestaatons GRADING LETH, Pagan \"s Ozzes ane Eaaers 20% Foal Pras 70% Cites Mei"
    },
    {
        "image": "syllabimatrix2_synth_8_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "FAR EASTERN UNIVERSITY Course Syllabus BUS201 Financial Accounting ‘seams semen Ay esti: geen one Phone: neem Text: Otic: Roam ae mal seanane erage Webs mates ont, Financial Accounting by Weygandt, Kimmel Kieso (10h Ed) Prerequisite: BUS 101 Course Description;"
    },
    {
        "image": "syllabimatrix2_synth_9_aug1.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSHTY OF SANTO TOMAS Daurse Sytebw BUS 701. Pracipies of Management ace vanes AY ce: tae eal San manangh aie sewecureconsons samen A anna Mecae esoicueree tens seanagavae by aes Cute (SER BL) anette see ‘os Boeri: “Thi anne stwocunae fcnawerantal manager gohoties const piecaing. emsmieng, easing, ore sanbering. Tuan exkute oMgEncatst Dehewes. burnin enovunce Managem, keg PIAS, deoouiteneking, sacl eosinenracare managerrHnt tes Fe PRIsypiN® busben sone Litas Aes tse COLNE LEARNS OUTCORE 1. fagty managenart pairs 1 Sepprectnon Suivi \\Pekoetant mpetaanoem iras 2 hates 3 Breaks warty anu acceuncnaaieg tant Bnmves wrayer apes romans ste! 9. naan ethan anager aciens TOPE ROVERED GHEE TE isimescins wo Manspacnart Thaw eat 24 Pama ae Shab? Riarageness eae 88 Crgrntocenal Saree a ovign ewe Ph Moras Brsceee Sheagerers rs #0, samersoy 204 Satan Fomee S132 Commaneaner ane Tuam 2g Wee 7284. Comms Bytaans ws Furemnce twos se: Serceneay Maraigece t Mass"
    },
    {
        "image": "syllabimatrix2_synth_9_aug2.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF SANTO. TOMAS Conese Sottahas BUS 161. Pre plen of tanagennect ore omee ay Cee ene See wets ea) Sl nee ee Sore oo mone Vd vere ouneess Foe an daree samagace by Heine Coxe (8B Preorgeanns oe Couns estan ‘Do course munuses tuncaments manezemert ooncipars soveeng planing vigsrnng. Masing. ena sewtnore Tapes echsne aipare steal behower, Fomwn wesoure raragement wala Petre deocermatng End sootemmeunry reagent! eaves Phizpina Danrens conten OURS LEARNS OJTCCURS: hopy marae preva fo SES Mates 2 Unaentne mrears noo oe here 2 oop wate de te tesco sing veh Posie naniponet oon, Piigera cnsers onrnrers aon nian otey Toe COTERED Bascane Monsyerun Want &12 uroaeane tod Mate ston ooeh Kormanemun ano Teen Bury Week thd Coneet Sy nten ar Pesermnye Werk 288 Cotengorary atrvagement trhuse GRADING SYSTEM One Stade: 10 Geom Prot. 26% Fowreutens. 38% Cans Pasesaren 1k"
    },
    {
        "image": "syllabimatrix2_synth_9_aug3.png",
        "label": "syllabimatrix",
        "ocr_text": "RSHTY OF SANTO TOMAS Course Syfiabes BUS 101. Sinciptes of Management ansgoment ay Rovbins Coutes 115 Peerage: “ys couse iocuoss hinaooantal nansgamens pmnoies o0 oe and canteting, Fapien vetcas orpanaational sRerugarmnt, states sinning lagument suas Potgcine pissnng. sganany. ancn Sennvor tuier rates Seomnemoang, ang sontenpersry en Sunes oo IidnoisAvcuetonfltaive 4A COURSE LEARNING CUTZOMES: |, ugly manager’ pines to cgarzatol srasions 2 Unaeastanecogaseatonsh suchas ad oehavins 3 Deng taderts 2x] dcisenenating sis 4 Ars mosaamaneonatenges Fruigane consent mpiarnent sive menagenant posiegs TOPICS COVERED. ‘Haak as innonvstcn te Meageinaal Teast fiaey 2 Pranteng 38 Sums Baragenes te wed Dvn eas 78 Hamar euaoree Managemen: Weak O10 Leasarshp ane Wott tion Week £012 Gommanezsea end Team Susng Week “et4: Cone star s and Peviomane Wisat 15 18 Conemporary Management trsues ORADING 5) STEN: Case se Kits Gey ject Zork Eeamiantens: 30% Class Patebwor 1"
    },
    {
        "image": "syllabimatrix2_synth_9_aug4.png",
        "label": "syllabimatrix",
        "ocr_text": "uni YY 0 IVERSITY OF SANT Course Syitsbus 88101. Prmceerofntaragnnare Oe tomas Saat neem mee AAO ine eee we ome cat nares animes"
    },
    {
        "image": "syllabimatrix2_synth_9_aug5.png",
        "label": "syllabimatrix",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS ‘Course Syabas BUS 101. Princgie® ct Managernent wow wets Mg Aan teaenc wurteonenamaenans Se areomgarneme ner Tecate: as see Wee sermrmawsnnieees Thor orseren Ant, Managemen ey Rate 8 Cove 86 68 Proreganties aoe Cane meoegtian, ‘Tha courte cmaauoes K adumaie! mana panent ptiapes 22 4% slening egenaag sedng, ard carteing Tepes nauce cogennatona: Lehavor tuman rence managanent saleye planning, ethigh eriey) are coniemy ara) ANAgETeN: Mivet F Pndcone waseats worn ior Commcevestne tt Team Butdng Werk 1316. Conta Systeme and Pertomece ‘faa ik Conemporny Marae lnsoes GaAD8 SYSTEM. Care."
    }
]