[
    {
        "image": "syllabi1_synth_10_aug1.png",
        "label": "syllabi",
        "ocr_text": "UNIVERSITY OF SAN CARLOS SCHOOL OF BUSINESS AND ECONOMICS CS 101, Section A: Introduction to Programming MWF 10 00 AM 11 30 AM Room 301, Engineering Building First Semester, 2026 2027 ental programming concepts using Python. Students will learn problem solving techniques, algorithm development, and basic programming constructs including variables, data types, control structures, functions, and file handling. This course introduces fundam COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Dr. Deanna Brown Office: Room 292, Faculty Building E Mail: george kidd university edu ph Phone: (+63) 915 471 7614 Office Hours: Monday, Wednesday Friday, 2 00 PM 3 00 PM Y_WiFi Password: Available at IT Office 5 Resource Center: Learning Commons Hours: Monday Fri WiFi Support Wi Fi Network: UNIVERSIT Business Resource Center’ Busines day 8 00 AM 8 00 PM COURSE DESCRIPTION sive introduction to computer progr ables, data types, operators, con kills, algorithm development, and logical thinking. ts will gain practical exper! lopment guage. Students will learn fundamental amming using Python as the primary lan unctions, arrays, and basic file operations. The This course provides a comprehen: programming concepts including vari trol structures (conditionals and loops), fi course emphasizes problem solving s Through hands on laboratory exercises and programming projects, studen include structured programming principles, modular design, documentation, and software deve integrated development environments (IDEs) and version control systems. The course is designed for students with little or no prior programming experience and serves as foundation for ad debugging code. Topics ience in writing, testing, and d to it best practices. Students will also be introduce vanced computer science courses. COURSE OBJECTIVES s course, students should be able to: g of fundamental programming concepts includin ques to analyze problems, develop algorithms, and Upon completion of thi g variables, data types, operators, and expressions. 4. Demonstrate understandin 2. Apply problem solving techni implement solutions using Python. 3. Write well structured programs us| 4. Create, manipulate, and process data 5, Design and implement programs that read fi 6. Debug and test programs to ensure correctnes ing control structures (sequence, selection, iteration) and functions. using arrays, lists, and dictionaries. rom and write to files. s and reliability. documentation, meaningful variable names, and code formatting. 7. Apply good programming practices including proper 8. Collaborate effectively in team programming projects and communicate technical concepts clearly."
    },
    {
        "image": "syllabi1_synth_10_aug2.png",
        "label": "syllabi",
        "ocr_text": "SCHOOL OF BUSINESS AND ECONOMICS CS 104, Section A: MWF} introduction to Programming 10 06 AM 11 30 AM Room Engine 1g Building First s Mester, 2026 2007 O27 This course Students wi learn pro! Programming o CONTACT INFORM ATION CONTACT INFORMATION Professor Dr. Deanna Brown Office: Room 292, Facy E Mail: Georges kidd uy Phone: (#83) 915 471 7644 Office Hours: Monda ty Be Hiding Sity edu oh ¥. Wednesday WIR] Support WEF Network UNIVERSITY_wir iff i Source Center & Friday, 2 00 PM 2 00 pry 45iN Ss Resource Cenier: t COURSE DESCRIPTION T his course Provides a miming concepts sphasizes propy Through hand. inchide struct, Ntegrated prog /@ introduction to compu eS, Operators, aigorithin developr data typ as the Primary language. Stu (conditionals ang Te Nd loops), funet EM solving Skiis, damental Operations. The y S On laboratory exer 5, anid basic tik rad programy 3 4G Drogrammin, N ‘eStng, and debugging code Topics Dracticas. St iS will also be introduced ta 94IN practi (perience in writi pment environments j The cou 'S designed for Students with lithe or no PROF progres ACE and serves ag foundation for adva courses, COURSE OBJECTIVES Upon cOMpletion of this COUTSE, Students shoul 1. Demonstrate unders 2. Apply Problern id be able to: landing of fundamen “Solving tech 3. Write well struct tal Programming GnCeDpis inclu: ding variables, data t nNalyze problems, dey: 0 aigor hms, and tures (gs uence, selec 8 data using arrays, NnIqUES fo a Operator: 8, and expressions. ufions using Python, @nd functions. implement Sol ured programs us Gn, iteration) AAS CONITO! struc Create, Manipul, ate, and proces aNd dictionaries, 2 Design ang implement programs that read from and write to files, 8. Debug end test Programs to ensure correctnes SS and rellab ”. Apply good Programming practi clices including proper Collaborate effactivel documen: feam Programming p tation, Meaningful va atiable names ly ia and code formatting. rojects ang cc AMunicate tach nical concepts clearly,"
    },
    {
        "image": "syllabi1_synth_10_aug3.png",
        "label": "syllabi",
        "ocr_text": "UNIVERSITY OF SAN CARL OS SCHOOL OF BUSINESS AND ECONOMICS CS 104, Section A: introduction to Programming MF 10 60 AM 14 30 AM Room 201, Engineering Building First Sernes' 326 2027 Am develop data typ CONTACT INFORMATION CONTACT INFORMATION Professor: or. 0 OWFICe: Room 292 E Mail: geo Prone: 463) 915 471 7 Office Hours: Monday, Wednesday Friday, 2 00 PM 3 00 PM anna Brown wily Building WF Suppert WI FI Network: UN VERSITY_WIFi Password: A Business Resource Center sus iday 6 00 AM 8 00 PM COURSE DESCRIPTION This course amming using Pyth: a g Py programming concepts inch VOSS, ‘oO! structures (condi rse emphasizes problem. tat arn fundament 5 the orl als anc roops), ‘ranstions.- ough hands on la’ include struc’ in writing. pract ugging code, be intraduced to Studenis syamnming experience and serves as foundation for acivanced cornputer COUTSES. COURSE OBJECTIVES Upon o pletion of this course, students should be able to: 1. Demonstrate undersianding of fundamental programming concepts inchiding variables, dela types, operators, and expressions. 2. Apply problem soiving techniques to analyze crabierns, develop algorithms, and implement solutions using Python. S. Write well siructured programs using control structures (sequence, selection, iteration} and funcilans. lonaries. 4, Create, manipulate, and process data using arrays, lists, and di &. Design and implement programs that read from and write to flies. 6. Debug and teat programs to ensure correctness and reliability. 7. Apply good programming practices including proper documentation, meaningful variabie names, and code formatting. 8. Collaborate ef tively in tam programming projects and communicate technical concepis clearly."
    },
    {
        "image": "syllabi1_synth_10_aug4.png",
        "label": "syllabi",
        "ocr_text": "OS BUSINESS AND ECONOMICS SCHOOL OF CS 101, Section A: introduction to Programming fe 4 40 00 AM 44 30 ARM Roor 364, Engineering Building First Semester, 26 i prograrnming concepts U opment tructures, This course introduces fundamss Students wil learn probierr g techniques, aigoriihm 3 programuning constructs including variables, data types. functions, and He handling. COURSE SYLLABUS CONTACT INFOR CONTACT INFORMATION Professor: Or. Deanna Brown Office: Room 292, Faculty Bulicing e Mail: george kidd university edu. Ph Phone: (69) 9154776\" Office Hours: Monday, Weene & Friday, 2 00 PM 3 00 PM ERSITY MFI Password: jay Friday 8 00 AM 8 00 PM 4g Hours: Mone “8 WiFi Support Wh Network: UNIV Business Resource Center Business Resow DESCRIPTION irmary language. St ionais and taps}, functions, arrays. and The bi variables, data types. op _ algorithm develop ence in wring, testing, and debugg! st prachoes Students wil also ne introduced to ts wil gain practicar and sofiwa studer’ 5 and programming pr goon laporatey &xercis Through hands tude structured pi pri 1g, modular design ocumentalio vated development enare «ments (DES) and versian oof trol systems. prograrnring experience 2 nd serves 8S foundation for advanced computer science Courses. The course Is designed for students with bile or he prics COURSE OBJECTIVES COMPSS, of fundamental program: 2 problerns, develos uid be able to: sions. students sho jes, data types, operators, and expres: jutions Using Python. luding varia! Upon completion of gq concepts incl algoriihms, 4. Demonstrate understanding and implement So to anal 2. Apply probier solving techni ration) and functions. 3. wre well structured prog e ures (sequence, geiection, He 5 using contro! struct _and dictionaries. 4, Create, manipulate, and process dala using arrays. implement programs sure correctness and reliability. ocumentation, meaningiu! V technical concepts clearly to files. 5, Design and that read front and write 6. Debug and jest programs io en 7. Apply good programming practices rating. nojuding proper 3 arigble names. and cade f ejects and eommunicale n team programming PP 8, Collaborate effectively |"
    },
    {
        "image": "syllabi1_synth_10_aug5.png",
        "label": "syllabi",
        "ocr_text": "UNIVERSITY OF SAN CARLOS SCHOOL OF BUSINESS AND ECONOMICS CS 101, Section A: Introduction to Programming MWF 10 00 AM 11 30 AM Room 301, Engineering Building First Semester, 2026 2027 This course introduces fundamental programming concepts using Python. Students will learn problem solving techniques, algorithm development, and basic programming constructs including variables, data types, control structures, functions, and file handling. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: pr. Deanna Brown Office: Room 292, Faculty Building E Mail: george kidd university edu ph Phone: (+63) 915 471 7614 Office Hours: monday, Wednesday Friday, 2 00 PM 3 00 PM WiFi Support Wi Fi Network: UNIVERSITY_WiFi Password: Available at IT Office Business Resource Center Business Resource Center: Learning Commons Hours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTION This course provides a comprehensive introduction to computer programming using Python as the primary language. Students will learn fundamental programming concepts including variables, data types, operators, control structures (conditionals and loops), functions, arrays, and basic file operations. The course emphasizes problem solving skills, algorithm development, and logical thinking. Through hands on laboratory exercises and programming projects, students will gain practical experience in writing, testing, and debugging code. Topics include structured programming principles, modular design, documentation, and software development best practices. Students will also be introduced to integrated development environments (IDEs) and version control systems. The course is designed for students with little or no prior programming experience and serves as foundation for advanced computer science courses. COURSE OBJECTIVES Upon completion of this course, students should be able to: 1. Demonstrate understanding of fundamental programming concepts including variables, data types, operators, and expressions. 2. Apply problem solving techniques to analyze problems, develop algorithms, and implement solutions using Python. 3. Write well structured programs using control structures (sequence, selection, iteration) and functions. 4. Create, manipulate, and process data using arrays, lists, and dictionaries. 5. Design and implement programs that read from and write to files. 6. Debug and test programs to ensure correctness and reliability. 7. Apply good programming practices including proper documentation, meaningful variable names, and code formatting. 8. Collaborate effectively in team programming projects and communicate technical concepts clearly."
    },
    {
        "image": "syllabi1_synth_1_aug1.png",
        "label": "syllabi",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY SCHOOL OF MANAGEMENT CS 101, Section A: Introduction to Programming MWF 10 00 AM 11 30 AM Room 301, Engineering Building Second Semester, 2026 2025 This course introduces fundamental programming concepts using Python. Students will learn problem solving techniques, algorithm development, and basic Programming constructs including variables, data types, control structures, functions, and file handling. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Dr. Ashley Moore Office: Room 467, Research Building E Mai joseph kennedy university edu ph Phone: (+63) 983 301 2686 Office Hours: Monday, wednesday Friday, 1 00 PM 4 00 PM WiFi Support Wi Fi Network: ATENEO_WiFi Password: Available at IT Office Business Resource Center Business Resource Center: Student Center Hours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTION This course provides a comprehensive introduction to computer programming using Python as the primary language. Students will learn fundamental Programming concepts including variables, data types, operators, control structures (conditionals and loops), functions, arrays, and basic file operations. The course emphasizes problem solving skills, algorithm development, and logical thinking. Through hands on laboratory exercises and programming projects, students will gain Practical experience in writing, testing, and debugging code. Topics include structured programming principles, modular design, documentation, and software development best practices. Students will also be introduced to integrated development environments (IDEs) and version control systems. The course is designed for students with little or no prior programming experience and serves as foundation for advanced computer science courses. COURSE OBJECTIVES Upon completion of this course, students should be able to: 1. Demonstrate understanding of fundamental programming concepts including variables, data types, operators, and expressions. 2. Apply problem solving techniques to analyze problems, develop algorithms, and im plement solutions using Python. 3. Write well structured programs using control structures (sequence, selection, iteration) and functions. 4. Create, manipulate, and Process data using arrays, lists, and dictionaries. 5. Design and implement Programs that read from and write to files. 6. Debug and test programs to ensure correctness and reliability. 7. Apply good programming practices including Proper documentation, meaningful variable names, and code formatting. 8. Collaborate effectively in team programming projects and communicate technical concepts clearly. ee"
    },
    {
        "image": "syllabi1_synth_1_aug2.png",
        "label": "syllabi",
        "ocr_text": "ATENEO DE MANILA CS 101, Section A: MVE introduction to to Programming 70 00 AM 11 30 AM R OUrSS introduces fundament ts will ‘earn problem solving tech b brogramn tructs Including variables, data i i functions, ang He Randling, Studen Cons: COURSE SYLLABUS CONTACT f. T INFORMATION CONTACT INFORMATION Professor: p; as; Office: Reom 467, Research Buliding E Mail: Kennedy @university edu ph Phona: 1s) 983 301 2586 Office Hours: Moore Monday, Wednesday Friday, 1 09 PM 4 00 PA WHE] Support W Fi Network: are ENEO Business Resource Cente Password: F Business Re source Center Student Center Hours: a COURSE DESCRIPTION Tt 00 AM 00 PM Nis course Provides a co; Programming cor COUrse amp! Pripreh introduction to MiG Variabi, problem solving Ski computer Programming uSing Pytho: eS, data types, opsrator ontro} 4 4S, algorinm de eiopment, and fo and Programming projects, Students vail gain ipiss, modular design, documentation, an (IDEs) ang Version contro} lary language Students COPS}, functions will learn fi undamental aTays, and basic fle operatic Through hands on laboratory exercis jude s tured program ing integrated development pra Eris! software development environment and debugging Cc nts Wil aise be The course is ode. Topics introduced to Gesigned for students with litle or ng prior Programming expe and serves S foundation for ad COURSE OBJECTIVES Upon ©: OPMDletion of this COUrse, Studen: 1. Demonsiraie understan tS should be able lo: ding of fundamental 1 Programming concepts 3 inch 2. Apply Droblem so} 3. Write Well striz ving techniques to an 9 Variables, data type ialyze problems, devel op algorithms, and WES (Sequenc, 8, operators, and expr implement sclutions using Py Selection, iteration) ctured brograms Using contro! Structy 4, Create, Manipvlate, anc Process data usi 2 arays, fists. and dic and functions. 8, Design and imph 8. Debug tonarles ement programs that read from and write to files, and test programs to ensure correctness and ity AG proper documenta ?. Apply good Programming Practices inc} TPG 8. Collaborate effectiv tion, meaningful varlabie names @ly in teary Programming Projects a and code formatting. nd communicate technical comceots clear y."
    },
    {
        "image": "syllabi1_synth_1_aug3.png",
        "label": "syllabi",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY _ SCHOOL OF MANAGEMENT CS 101, Section A: introduction to Prograrnming MWEF 10 00 AM 74 30 AM Room 361, Engine H Bt ng Bul Second Semester, 2026 2026 mcepis using Python. sm development, anc b control structures, oF ogramming construc CONTACT INFORMATION _ CONTACT INFORMATION Professor: Or. Ashley Moore Office: 3 E Mail: joseph. kennedy ur Phone: (69) 963 301 2086 Office Hours: Monday, arch Building vednesday Friday, 1 00 PM 4 00 PM WIFI Support W F Network: ATENEO WiFi Password: 4 Business Resource Center susiness Resource Center: Student Cen jours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTIGN. This course provides a comprehensive intreduction to computer programming using Python as th programming concepts inc! j Varlabies, data types, cperators, contre! structures (conditio course emphasizes problem saiving skills, algorithm development, and logical thinking. Through h ‘on laboratory exercises and pro: grammnin wg pr inci pl amming projects, students wil gain pra ri, documentation, and software devel lopment t best fee stems. nis will al COURSE OBJECTIVES Upon completion of this couree, students should be abje to: +. Demonstrate understanding of fundamental programming concepts including variables, data types, operators, and expressions 2. Apply problem solving techniques to analyze problems, develop algorithms, and Implement solutions using Python. 3. Write well structured programs using controi structures (sequence, selection, iteration) and functions. 4, Creaie, manipulate, and process data using arrays, lists, and dictionaries 5. Desion and implement programs that read from and write to fles. 6. Debug and test programs fo ensure correctness and reliability 7. Apply good pro amming practices Including proper documentation, meaningful variable names, and code formatting. 8. Collaborate effectively in tearn programming projects and communicate technical concepts clearly."
    },
    {
        "image": "syllabi1_synth_1_aug4.png",
        "label": "syllabi",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY SCHOOL OF MANAGEMENT CS 101, Section A: introduction to Programming MWF 10 00 AM 11 30 AM Room 301, Engineering Building Second Semester, 2026 2025 This course introduces fundamentai programming concepts using Python. Studenis will learn problem solving techniques, algorithm development, and basic programming constructs including variables, data types, contro! structures, functions, aid file handiing. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Dr. Ashley Moore Office: Room 457, Research Building E Mail: joseph kennedy university edu ph Phone: (+63) 983 301 2686 Office Hours: monday, Wednesday Friday, 1 00 PM 4 00 PM WiFi Support Wi Fi Network: ATENEO_WiF' Password: Available at !T Office Business Resource Center susiness Resource Center: Student Center Hours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTION This course provides a comprehensive introduction to computer programming using Python as the primary ianguage. Students wili learn fundamentat programming concepts inciuding variables, data types, operators, contro! structures (conditionals and loops), functions, arrays, and basic file operations. The course emphasizes problem soiving skills, algorithm development, and logical thinking. Through hands on laboratory exercises and programming projects, students will gain practical experience in writing, testing, and debugging code. Topics include structured programming principles, modular design, documentation, and software development best practices. Students will also be introduced to integrated development environments (IDEs) and version control systems The course is designed for students with little or no prior programming experience and serves as foundation for advanced computer science courses. COURSE OBJECTIVES Upon completion of this course, students should be able to: 4. Demonstrate understanding of fundamental programming concepts including variables, data types, operators, and expressions. 2. Apply problem solving techniques to analyze problems, develop algorithms, and implement solutions using Python. 3, Write well structured programs using coniroi structures (sequence, selection, iteration) and functions. 4. Create, manipulate, and process data using arrays, lists, and dictionaries. 5. Design and implement programs that read from and write to files. 6. Debug and test programs to ensure correciness and reliability. 7. Apply good programming practices including proper documentation, meaningful variable names, and code formatting. 8. Collaborate effectively in team programming projects and communicate technical concepts clearly."
    },
    {
        "image": "syllabi1_synth_1_aug5.png",
        "label": "syllabi",
        "ocr_text": "SITY ATENEO SCHOOL OF MANAGEMENT CS 101, Section A: Introduction to Prograraming 2 Building MUWF {| 70 00 AM 44 30 AM Room Engineer 2025 Second course introduces fundamental programming concepts using Python, will earn problem solving t chniques, aigonthm development, and basic ramming constructs including variables, data types, contr fui s, and file handling. Truckures, CONTACT INFORMATION CONTACT INFORMATION Professor: Dr. Ashley Moore Office: Room 467, Research Building E Mail: joseph kennedy university edu ph Phone: (+62) 983 307 2686 Office Hours: monday, Wednesday Friday, 1 09 PM 4 00 PM =O_WIFi] Past WiFi Support wi i Network: A a Business Resource Center Business Resource Center: Student Center Ho US COURSE DESCRIPTION 3 a comprehensive introduction to computer programming ts including variables, data types. operators, control structures (conditior problem solving skills, algorithm develop: 3 Students will jearn fundamental id basic file operations. The sing Python as the prime is and loops), fury ming projecis, students wil gain pre ctical expenence in writing, t rn, documentation, and software development best practices. Students will aiso m conirel systems. s on laboratory exercises and progra’ uindation for advanced computer science courses. with little or no prier programming experience and se! designed for stude: COURSE OBJECTIVES Upon completion of this course, stucents should be abie to: 4. Demonstrate understanding of fundamental programming concepts including variables, data types, qperate ions. ms, and implement solutions usi 2. Apply problem solving techniques to anaiyze problems, develop aigoritt nag Python. 3, Write well structured programs using control structures (sequence, se ection, iteration} and functions. 4, Create, manipulate, and process data using arrays, lists, and dictionaries. §, Design and implement programs that raad from and write to fi @, Debug and test programs to ensure correctness and relianility 7. Appiy good prograrnming practices including proper documentation, meaningful vari ncepts clearly. 8. Collaborate effectively in team programming projects end communicate technical cor"
    },
    {
        "image": "syllabi1_synth_2_aug1.png",
        "label": "syllabi",
        "ocr_text": "CENTRAL PHILIPPINE UNIVERSITY COLLEGE OF AGRICULTURE, RESOURCES AND ENVIRONME NTAL SCIENCES 101, Section A: Introduction to Programming MWE 10 00 AM 11 30 AM Room 301, Engineering Bulding mester, 2024 202 Second bles, data types, contro! structures, and fie handling. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Prof. Michelle Reid OPFiCe: Room 229, Fac E Mail: Phone: Office Hours: monday Wednesday, 2 00 PM- 11 sara pete } 980 887 1230 a i Network: __ WIFI Pas: WiFi Support W F c Business Resource Center Business Couns DESCRIPTION isive introduction to computer progress using Python as the primary language. Stu es, data type: 3 (conditionals and too aigortinm de elopment, and logical thinking. fons. The cluding variant sm solving projects, students will gain I practical epee in writing, test d program ciples, modular is (IDEs) and ve ISS jred programming development environ udents with litte or no prior programming expe The course is designed fe: COURSE OBJECTIVES _ Upon completion of this course, students should be able to: nctuding variables, data types, operators, and expressions. 4. Demonstrate understanding of fundamental programming concepts develop algorithms, and implement solutions using Python. 2. Apply probiem ng techniques io analyze problem 3. Write well structured programs using control structures (sequence, selection, iteration) and functions. 4 Create, manipulate, and process data using arrays, lists, anc 5. Design and implement programs that read from and write to Mes. 6. Debug and test programs to ensure correctness and reliab cluding proper documentation, meaningful variable names, and code formatting. od programming practices 7, Apply 8. Collaborate effectively in team programming projects and communicate technical concepts dearly."
    },
    {
        "image": "syllabi1_synth_2_aug2.png",
        "label": "syllabi",
        "ocr_text": "CENTRAL PHILIPPINE UNIVERSITY COLLEGE OF AGRICULTURE, RESOURCES AND ENVIRONMENTAL SCIENCES CS 101, Section A: introduction ta Programming MWF {| 10 60 AM 11 30 AM Room 301, Engineenrg Buitding Second Semester, 2024 2027 This course introduces fundamental programming concepis using Python Students will learn probiem sob techniques, algorithm development, and basic programming constructs inciuding variables, daia types, contro} struciures, functions, and file handling. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Prot Michelie Reid Office: Room 229. Faculty Building E Mail: sara petersen university edu ph Phone: (+63) 980 887 1230 Office Hours: Monday Wednesday, 2 00 PM 11 00 AM WiFi Support WiFi Network. CENTRAL WiFi Password: Business Resource Center a. bie at IF Office iness Resource Center: Library 2nd Floor Hours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTION This course provides a comprehensive introduction to computer programming using Python as the primary lanquage. Students will learn fundamentat programming concepts including variables, data types, operat course emphasizes problem solving skills, algorithm developme ts and iogical thinking Through hands on laboratory exercises and programming proie studenis wil! gain practical experience in writing, tes and debugging code. Topics include structured programming principles, modular design, documentation, and software deveicpment dest practices. Students will also be introduced to integrated development environmenis (IDEs) and version control systems The course is designed for students with tittle or no prior prograrnming expetience and serves as foundation for advanced computer science courses. COURSE OBJECTIVES Upon completion of this course, students should be abie to: 1. Demonstrate understanding of fundamental programming concepts inciuding variables, data types, operators, and expressions. 2. Apply problem solving techniques to analyze probierns, develop algorithms. and implement solutions using Python. 3. Write well structured programs using contro! structures (sequence, selection, iteration} and functions. 4. Create, manipulate, and process data using arrays. lists, and dictionaries. 5. Design and implement programs that read from and write to files. 6. Debug and test programs to ensure correctness and reliability. 7. Apply good programming practices inciuding proper documentation, meaningful variable names, and code formatting. 8. Collaborate effectively in team programming projecis and communicate technical concepts clearly. control structures (conditionals and loops), functions, arrays, and basic file operations. The"
    },
    {
        "image": "syllabi1_synth_2_aug3.png",
        "label": "syllabi",
        "ocr_text": "CENTRAL PHILIPPINE UNIVERSITY COLLEGE OF AGRICULTURE, RESOURCES AND ENVIRONMENTAL SCIENCES CS 101, Section A: introduction to Programming MW 16 00 AM 17 30 4M Room 3014, Engineering Sulldi Seco emester, 2024 2027 This course Students w BFOG) niroduces fundamental programming concepts using Python. n problem solving techniques, algorithrn development, and basic constructs including variat jata types, centro! structures, functions, ar: on COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: prof. Michel! OPMce: Room 229, Fa E Mail: sara petersen university Phome: 63) 080 887 12 Office Hours: monday Reick wlcling Cu pr Nednasday, 2 00 PM 44 00 AM Network: CENTRAL WiFi Password: Available Business Resource Center Business Resource Center: Li fixe 200 AN 8 00 PM course provides a comprehensive introduction to compulsr programming ing including variables, data types, operators, contro! structures fcanditionals anc oblem solving skills, algonthm development, and logical thinking guage. Students will learn fundarnental functions, arrays, and basic file operations. The course armnphe Through hands on laborstory exercises and programming projects, stud incluce structured programming , integrated development environm in practical experience in writing, tee’ ng, and debugging code. Topics soflware development best practices. Students will also be introduced ta nciples, modular design, documentatia: $3 (IDES) and version control systems. The course is designed for students with little or no pri je ‘Or brogremming experience and serves as foundation for advanced computer scle: Ses. COURSE OBJECTIVES Upon complation of this course, students should be able to: 4, Dernonstrate understanding of fundamentai programin Bn ng concepts inciuding variables, data t eS, 2. Appiy problem solvir echniques to analyze problems, develop alg 3. Write well structured programs using c: fhms, and implement solutions using Python. oniral structures (sequence, selection, ration) and functions. Gala using arrays, lisis, and dictlonaries. 5. Design and implemen programs that read from and write to files. 3, Debug and fast programs ta ensure core iness and rellabili *. Apply good programming practices including preper documentation, meaningful varia 2 names, and code formatiing. 8. Collaborate effecti vely in team programming orojects and commu BEM OMY ects an tunicate technical concepts clearly."
    },
    {
        "image": "syllabi1_synth_2_aug4.png",
        "label": "syllabi",
        "ocr_text": "PHILIPPINE UNIVERSITY CENTRAL COLLEGE OF AGRICULTURE, RESOURCES AND ENVIRONMENTAL SCIENCES CS 101, Section A: introduction to Programming “3G AM Room 304, Er neering Building ising Python. jundamenta: p ncepts t achniques, algorenm development, and pasic variables, data types control structures, file handling This course intraduc Students functor COURSE SYLLABUS CONTACT INFORMATION SONTACT INFORMATION Grotessor: Prof. Michelle Reid Office: Room 229. Faculty Bulli: E Mail: sara. petersen unive’ ty edu ph Phone: 87 1236 Office Hours: monday Wedr sday, 2 00 PM 44 00 AM WiFi Support WiFi Networs CENTRAL WiFi Password: Avail Business Resource Center gusiness Resource Center ye, Students funotions, array tures (conditionals and toops), _ testing, an 5, Slude nm practical expe software developm i best practic Through hands- include structured programming pr integrated develop _ modular design, do: ersian contre ry ni environments (DEs} ed computer Scienc ming experience and serves as foundation for 2 nts with litte or no prior progre The cour: COURSE C Upon completion of this course, students should be able to: including variables, data types, operators, anc expressions. problems, develop algorithms, and implement solutions using Pyihon. 1. Dernonstrate understanding of fundamental programming conce Jing techniques to anal 2. Apply problem 2. Write well structured programs using control structures et », galection, iteration} and functions. 4, Create, manipulate, and process data g arrays, lists, and dictionaries. 5, Design and implernent programs that re: §. Debug and test programs to ansure correctness and reli ocumentation, meaningful variable names, and cade formatting. 7. Apply good pragraniming pr 8, Collaborate effectively in team pr ogramming projects and communicate technical concepts clearly."
    },
    {
        "image": "syllabi1_synth_2_aug5.png",
        "label": "syllabi",
        "ocr_text": "CENTRAL PHILIPPI INE UNIVERS! ITY COLLEGE OF AGRICULTURE, RESOURCES AND ENVIRONMENTAL SCIENCES CS 101, Section A: introduction to Pregramming MW 10 00 AM 11 30 AM! Room 301, Engineering Suil Second Semester, 2024 2027 programming cons tructs inch ang functions, and file handing. COURSE SYLLABUS CONTACT INFORMATION E Mail: cara pel uni PRONG: (+63) 980 887 1290 Office Hours: jmoncay 2 wed orsity.¢ ecu ph day, 2 00 PM 14 00 AM tary 2nd Fiocr Hours: y Friday 6 00 AM §:00 Pr or as the primary language. Students will learn fundamental ures (concitionais and loops}, functlons, arrays, and basic file overations. The i thinking. course emonas Through hands o Inclice s Struc experience in writing, t oprment besi practic ing code. Topics 20 be introduced to terre YStams, IDEs) and version control s' The course is designed for students with little or no prior programmir experience and serves as foundation for advan ced computer science courses. COURSE OBJECTIVES Upon completion of this course. students should be able to: 1. Demonstrate understanding of fundamental prog gramming concepts including variables, date types, operators, and expressions, le 3. Write well structured programs using contro! structures (sequence, selectio 2. Apply problem solving techniques to analyze problems, develop a gorithms, and Implement solutions using Python. iteration) and functions. 4, Creale, manipulate, and process data using arrays, lists, and dictionaries. 5. Design and implement programs that read from and write to files. 8. Debug and test programs to ensure correctness and reliability. 7. Apply good programming practices inciuding proper d nation, meaningful variable names, and code formatting. 8, Collaborate effectively in team programming projects and communicate technical concepts clearly."
    },
    {
        "image": "syllabi1_synth_3_aug1.png",
        "label": "syllabi",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS FACULTY OF ARTS AND LETTERS CS 101, Section A: Introduction to Programming MWF 10 00 AM 11 30 AM Room 301, Engineering Building Summer Term, 2024 2027 COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Office: Room 222, Research Building E Mail: keith ellis @university edu ph Phone: (+63) 917 319 7794 Dr. Edward Kennedy Office Hours: Tuesday Thursday, 9 00 AM 3 09 PM WiFi Support Wi Fi Network: UNIVERSITY_WiFi Password: Available at IT Office Busi ness Resource Center Business Resource Center: Library 2nd Floor Hours: Monday Friday 8 00 AM 8 00 pm COURSE DESCRIPTION integrated development environments (IDEs) and version cont rol systems The course is designed for students wit COURSE OBJECTIVES Upon completion of this Course, students should be able to: 1. Demonstrate understanding of fund. control structures ("
    },
    {
        "image": "syllabi1_synth_3_aug2.png",
        "label": "syllabi",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS FACULTY OF ARTS AND LETTERS CS 101, Section A: Introduction to Programming ineering Building MWE 10 00 AM 14 30 AW Roorn 267, Summer Term, 2024 2027 using Python. and basic ctures. ental programming tS al ge) deveiopment, ing variables, data types, con viral struc and file handling. This course introduces 1 Students will learn probier programming constructs in fur CONTACT INFORMATION CONTACT INFORMATION Professor: Or Edwa Office: Room 222, R E- Mall: keith. Phone: (63) 917: 319 7784 Office HOUFS: Tuesday Thursday, 9 00 AM 3 00 PM TY _WIFL| Password: Aval WHF: Support WiFi Network: UNI Business Resource Ceriter susiness Resource Center: Library 2nd Fioor Hours: Moncey: Priday 800 AM £00 PM COURSE DESCRIPTION» This course provides a comprehensi introduction t aT fing variables, data fypes, operator course emphas sizes problem solving skilis, aigoriinm develop computer programming using Python as the primary jangquag 's, control structures (conditionals ar nd leops), fa nections. arn Tap. and basic fe op nt, and logical think! ions. The ts will gain practical experience in writing, testing. and 4, and software development best practices Students ‘Through Rands on laboratory axercises and programming projects student ed programming principies, f rodiular design, decur nvironments (IGEs) and version control systerns in Htegraied devel n for advanced compu sas founds The course js designed for students with litle or no prior programming experience and serve COURSE OBJECTIVES Upon completion of this course, students should be able to: 4. Damonstrate understanding of fundamental prograrnming concepts inciuding variables, data types, operators, and expr d implement solutions using Python. 2. Apply problem solving techniques to analyze problems, develop algorithms, ar 3. Write well structured programs using control structures (sequence selection, iteration) and functions. g arrays, lists, and dictionaries. 4. Create, manipulate, and process data u 5. Design and implement programs that read from and wiife t fles programs fo ensure correctness and reliability. 6. Debug and te! 7. Apply good programming practices including proper documeria n, meaningful variable names, and code forma ts clearly. 8. Collaborate effectively in team programming projects and communicate technical concep"
    },
    {
        "image": "syllabi1_synth_3_aug3.png",
        "label": "syllabi",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS FACULTY OF ARTS AND LETTERS CS 101, Section A: Introduction to Programming MWF 10 00 AM 11 30 AM Room 301, Engineering Building Summer Term, 2024 2027 This course introduces fundamental programming concepts using Python. Students will learn problem solving techniques, algorithm development, and basic Programming constructs including variables, data types, control structures, functions, and file handling. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Dr. Edward Kennedy Office: Room 222, Research Building E Mail: keith ellis university edu ph Phone: (+63) 917 319 7794 Office Hours: tuesday Thursday, 9 00 AM 3 00 PM WiFi Support Wi Fi Network: UNIVERSITY_WiFi Password: Available at IT Office Business Resource Center usiness Resource Center: Library 2nd Floor Hours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTION This course provides a comprehensive introduction to computer programming using Python as the primary language. Students will learn fundamental Programming concepts including variables, data types, operators, control structures (conditionals and loops), functions, arrays, and basic file operations. The course emphasizes problem solving skills, algorithm development, and logical thinking. Through hands on laboratory exercises and Programming projects, students will gain practical experience in writing, testing, and debugging code. Topics include structured programming principles, modular design, documentation, and software development best practices. Students will also be introduced to integrated development environments (IDEs) and version control systems. The course is designed for students with little or no prior programming experience and serves as foundation for advanced computer science courses. COURSE OBJECTIVES Upon completion of this course, students should be able to: 1. Demonstrate understanding of fundamental programming concepts including variables, data types, operators, and expressions. 2. Apply problem solving techniques to analyze problems, develop algorithms, and implement solutions using Python. 3. Write well structured programs using control structures (sequence, selection, iteration) and functions. 4. Create, manipulate, and process data using arrays, lists, and dictionaries. 5. Design and implement programs that read from and write to files. 6. Debug and test programs to ensure correctness and reliability. 7. Apply good programming practices including proper documentation, meaningful variable names, and code formatting. 8. Collaborate effectively in team programming projects and communicate technical concepts clearly."
    },
    {
        "image": "syllabi1_synth_3_aug4.png",
        "label": "syllabi",
        "ocr_text": "CONTACT Professor E Mail: Phone: (63 9 Office Hours: Tu WARE? Support WEFT Network: UNI Business Resource Center Busi om 222. R OFFice: Root Studer INFORMATION 2 Dr. Edward Kennedy ch Bull ing duniversity edu on 319 7794 COURSE DESCRIPTION include struc infec The course is COURSE Upon compl 3. Write wei 4, Create, manipulate, and proc a 7. Apply good programmne practices inclucing pi Ry a t dt 8, Collabor: ted development envir 2. Apply probiem solv ate off ied programming princi Op OBJECTIVES UNIVERSITY OF SANTO TOMAS ay Thursday, 9 00 AM 1ensive introduction te 2 (DES) 2 8 (IDEs) a gned for students wilh FACULTY OF ARTS AND LETTERS gramming CS 101, Section A: introduction to Pre A} Roors 304, Enginee uilding 8 ah MWE 1 16 00 4 ri, 2024 2027 Summ This course introcu COURSE SYLLABUS ab IT Offic: avliT OR ce nor Hours: Monday Friday 8 00 AM 8 00 PM iage. Students will amming using Pyth ig and loops), functions, arrays, ar tructures (CO students will in writing, t tation, and ne version control systems advanced comput as found: ation of this course, studenis should be able to: structured programs us nd implement programs that read frorn and wr actively 4. Demonstrate understanding of fundaments techniques to analyze probiems. develop aig i obug and test programs fo ensure cor n team programr programming concepts inc uding variables, data types, operators, and expr rithms, and implement solutions using Python. ng control structures (sequence, selection, iter: tion) and functions. using arrays, list ciness and reliability jon, meaninglul s proper document pts clearly. ing projects and communicate technical cor clices. Students wil code. Topics 7 science Courses: essions."
    },
    {
        "image": "syllabi1_synth_3_aug5.png",
        "label": "syllabi",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS FACULTY OF ARTS AND LETTERS CS 101, Section A: Introduction to Programming MWF 10 00 AM 11 30 AM Room 301, Engineering Building Summer Term, 2024 2027 COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Dr. Edward Kennedy Office: Room 222, Research Building E Mail: keith ellis university edu, ph Phone: (+63) 917 34 9 7794"
    },
    {
        "image": "syllabi1_synth_4_aug1.png",
        "label": "syllabi",
        "ocr_text": "POLYTECHNIC IC UNIVERSITY OF THE P NLIPPINES COLLEGE OF BUSINESS ADMINISTRATION BA 301, Section C: Financial Management MW 3 00 PM 430 PM Roorn 40: First Seme This course examines finan: cial di including capital bud dividend policy, ane ri nizations, nis will a yze vinancial statements ial tools. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Or. Susan Simmons Office: Room 269, Research Buil sing E Mail: nathaniel Prone: (63) 902 Office Hours: puniversity eduph Tuesday Thursday, 1 00 PM 44 00 AM Quiey Support Wi Fi Network: POLYTECHNIC WiFi} Password: Business Resource Center Business Resource Center: Lib COURSE DESCRIPTION Th provides comprehensive study of financial man analysis, time value of money, capital bu dig capital management $, tisk and returr Students will t The course co pporlunities, determin using real world $ both f applic asis Is placed on developing en critical thinking, and deci FS, Spreadsheet software, and financial anal lysis tools on Making abilities essentiai iO seive problems and analyz COURSE OBJECTIVES By the end of this course, students should be abie to: 1, Analyze and interpret financial statements to ase 3S Company performance and financial haaith, 2. Apply time value of money concepts to e uate investment and financing decisions, budgeting techniques (NPV, IRR, Payback Period) to evaluate investment proiecis. 3. Use ca 4, Assess risk and return relationships and apply portfolio theory concepts. 5. Calculate weighted average cost of capital and understand its role in financial decisions. 8. Analyze capital structure decisions and understand trade offs batween debt and equity financing. Evaluate dividend policy alternatives and their impact on shareholder value. 8. Develop strategies for efficient w OFKING apital management including cash, inventory, and recelvabies manag gement."
    },
    {
        "image": "syllabi1_synth_4_aug2.png",
        "label": "syllabi",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF BUSINESS ADMINISTRATION BA 301, Section C: Financial Management MW 3 00 PM 4 30 PM Room 462, Business Building First Semester, 2026 2026 This course examines financial decision making in business organizations, including capital budgeting, working capital management, capital structure, dividend poiicy, and risk management. Students will analyze financial statements and apply financial tools. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: br. Susan Simmons Office: Room 369, Research Building E Mail: nathanie sneiton university edu ph Phone: (+63) 902 729 3903 Office Hours: tuesday Thursday, 1 00 PM 11 00 AM WiFi Support Wi Fi Network: POLYTECHNIC_WiFi Password: Available at !T Office Business Resource Center Business Resource Center: Library 2nd Floor Hours: Monday Friday 8 00 AM 8 00 PM OURSE DESCRIPTION This course provides comprehensive study of financial management principies and practices in business organizations. Topics inciude financia! statement analysis, time value of money, capital budgeting techniques, risk and return analysis, cost of capital, capital structure decisions, dividend policy, and working capital management. Students will learn to analyze financial statements, evaluate investment opportunities, determine optimal capital structure, and make strategic financial decisions. The course covers both theoretical frameworks and practical applications using reai word case studies from Philippine and international companies. Emphasis is placed on developing anaiytical skills, critical thinking, and decision making abilities essential for financial managers. Students will use financial calculators, spreadsheet software, and financial analysis tools to solve problems and analyze scenarios. COURSE OBJECTIVES By the end of this course, students should be able to: 1. Analyze and interpret financial statements to assess company performance and financial health. 2. Apply time value of money concepts to evaluate investment and financing decisions. 3. Use capital budgeting techniques (NPV, IRR, Payback Period) to evaluate investment projects. 4. Assess risk and return relationships and apply portfolio theary concepts. 5. Caiculate weighted average cost of capital and understand its role in financial decisions. 6. Analyze capital structure decisions and understand trade offs between debt and equity financing. 7. Evaluate dividend policy alternatives and their impact on shareholder value. 8. Develop strategies for efficient working capital management including cash, inventory, and receivables management."
    },
    {
        "image": "syllabi1_synth_4_aug3.png",
        "label": "syllabi",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF BUSINESS ADMINISTRATION BA 301, Section C: Financial Management MW 3 00 PM 4 30 PM Room 402, Business Building First Semester, 2026 2026 This course examines financial decision making in business organizations, including capital budgeting, working capital management, capital structure, dividend policy, and risk management. Students will analyze financial statements and apply financial tools. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: br. susan Simmons Office: Room 369, Research Building E Mail: nathaniel shelton university edu ph Phone: (+63) 902 729 3903 Office Hours: tuesday Thursday, 1 00 PM 11 00 AM WiFi Support Wi Fi Network: POLYTECHNIC_WIiFi Password: Available at IT Office Business Resource Center Business Resource Center: Library 2nd Floor Hours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTION This course provides comprehensive study of financial management principles and practices in business organizations. Topics include financial statement analysis, time value of money, capital budgeting techniques, risk and return analysis, cost of capital, capital structure decisions, dividend policy, and working capital management. Students will learn to analyze financial statements, evaluate investment opportunities, determine optimal capital structure, and make strategic financial decisions. The course covers both theoretical frameworks and practical applications using real world case studies from Philippine and international companies. Emphasis is placed on developing analytical skills, critical thinking, and decision making abilities essential for financial managers. Students will use financial calculators, spreadsheet software, and financial analysis tools to solve problems and analyze scenarios. COURSE OBJECTIVES By the end of this course, students should be able to: 1. Analyze and interpret financial statements to assess company performance and financial health. 2. Apply time value of money concepts to evaluate investment and financing decisions. 3. Use capital budgeting techniques (NPV, IRR, Payback Period) to evaluate investment projects. 4. Assess risk and return relationships and apply portfolio theory concepts. 5. Calculate weighted average cost of capital and understand its role in financial decisions. 6. Analyze capital structure decisions and understand trade offs between debt and equity financing. 7. Evaluate dividend policy alternatives and their impact on shareholder value. 8. Develop strategies for efficient working capital management including cash, inventory, and receivables management."
    },
    {
        "image": "syllabi1_synth_4_aug4.png",
        "label": "syllabi",
        "ocr_text": "POLYTECHNIC COLLEGE MW i 3 00 PM dividend poli CONTACT INFORMATION Professor Office: E Mail nathanie Phone: (463) 902 Room 369, Re Bulla Universit Office Hours: Tuesday Thurs WHF Support Business Re i Network: p COURSE DESCRIPTION i iss The course co 3 both theoretical Framew. analytic, COURSE OBJECTIVES By the end of this course, stud. 1. Analyze and in Srpret fi 2. Apply time value of money concepts to 3. Use capital budge 4. Assess risk and return Felationshins any (@r Structure decisions and end policy alternatives 1OP Strategiag for efficient work YTECHNIC_Wirj iF Source Center 3 evaluate inye. UNG techniques (NPY, IRR, Pay Med average cost of capi aphal and ur @S and their img OF BUSINESS ADMINISTR SO1, Section c: Financial Management 4 35 PM i Room CADial cement. Stude, ancial and apply inanciz fH tOOiS. CONTACT INFORMATION -edu gh day, 1 00 PM. 44 00 AM Business Re OfKS iocis to s shouid be able to: &SSSss compa stment CUP understand trade o verrang capital management inc ement princip de offs between st On shareha} Monday return termine op ai for financial ry Ove pe POEMS and analyze scena NY performance and jancial health, and Brancing decisions. vesiment proj oncepts, rele in fing and equ Y eF Value, luding cash, inventory, ar UNIVERSITY OF THE PHIL state sta laniagers. Stu Management, 2 00 AM 8.¢ PICS INGlude fin Cecisions, dividang policy, APPINES RATION and working USé financial"
    },
    {
        "image": "syllabi1_synth_4_aug5.png",
        "label": "syllabi",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF BUSINESS ADMINISTRATION BA 301, Section C: Financial Management MW 3 00 PM 4 30 PM Room 402, Business Building First Semester, 2026 2026 This course examines financial decision making in business organizations, including capital budgeting, working capital management, capital structure, dividend policy, and risk management. Students will analyze financial statements. and apply financial tools. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Dr. Susan Simmons Office: Room 369, Research Building E Mail: nathaniel shelton university edu ph Phone: (+63) 902 729 3903 Office Hours: tuesday Thursday, 1 00 PM 11 0 AM Password: Available at IT Office Wi Fi Network: POLYTECHNIC_WIFI e Center: Library 2nd Floor Hours: Monda' urce Center Business Resource! WiFi Support y Friday 8 00 AM- 8 00 PM Business Reso include financial statement y, and working COURSE DESCRIPTION mprehensive study of fin oney, capital budgeting techniques, ris! tices in business organizations. Topics les and prac pital structure decisions, dividend polic ancial management principl nalysis, cost of capital, ca This course provides Co! analysis, time value of m k and return al capital management. ucture, and make strategic financial decisions. timal capital str ernational companies. al statements, evaluate investment opportunities, determine op! practical applications using real w' king, and decision makin to solve problems and analyze scen: orld case studies from Philippine and int ers. Students will use financial analyze financt th theoretical frameworks and skills, critical thin! ial analysis tools Students will learn to The course covers bol g abilities essential for financial manag} eveloping analytical arios. Emphasis is placed on d software, and financ calculators, spreadsheet COURSE OBJECTIVES ts should be able to: tatements to assess company P' By the end of this course, studen' 4. Analyze and interpret financial s! erformance and financial health. financing decisions. pts to evaluate investment and evaluate investment projects. (NPV, IRR, Payback Period) to s and apply portfolio theory con capital and understand its role i een debt and equity financing. 2. Apply time value of money conce 3. Use capital budgeting techniques ess risk and return relationship: cepts. 4. Assi 5. Calcul n financial decisions. 6. Analyz 7. Evaluate dividend policy alternatives Pp strategies for efficient workin late weighted average cost of e capital structure decisions and understand trade offs betw r value. and their impact on shareholde' g cash, inventory, and receivabl les management. g capital management includin 8. Develo}"
    },
    {
        "image": "syllabi1_synth_5_aug1.png",
        "label": "syllabi",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF BUSINESS ADMINISTRATION BA 301, Section C: Financial Management MW 3 00 PM 4 30 PM Room 402, Business Building Summer Term, 2026 2027 This course examines financial decision making in business organizations, including capital budgeting, working capital management, capital structure, dividend policy, and risk management. Students will analyze financial statements and apply financial tools. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: pr. Brad Madden Office: Room 421, Research Building E Mail: stacie robbins university edu ph Phone: (+63) 963 983 1409 Office Hours: monday, wednesday Friday, 9 00 AM 12 00 PM WiFi Support Wi Fi Network: POLYTECHNIC_WiFi Password: Available at IT Office Business Resource Center Business Resource Center: Learning Commons Hours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTION This course provides comprehensive study of financial management principles and practices in business organizations. Topics include financial statement analysis, time value of money, capital budgeting techniques, risk and return analysis, cost of capital, capital structure decisions, dividend policy, and working capital management. Students will learn to analyze financial statements, evaluate investment opportunities, determine optimal capital structure, and make strategic financial decisions. The course covers both theoretical frameworks and practical applications using real world case studies from Philippine and international companies. Emphasis is placed on developing analytical skills, critical thinking, and decision making abilities essential for financial managers. Students will use financial calculators, spreadsheet software, and financial analysis tools to solve problems and analyze scenarios. COURSE OBJECTIVES By the end of this course, students should be able to: 1. Analyze and interpret financial statements to assess company performance and financial health. 2. Apply time value of money concepts to evaluate investment and financing decisions. 3. Use capital budgeting techniques (NPV, IRR, Payback Period) to evaluate investment projects. 4. Assess risk and return relationships and apply portfolio theory concepts. 5. Calculate weighted average cost of capital and understand its role in financial decisions. 6. Analyze capital structure decisions and understand trade offs between debt and equity financing. 7. Evaluate dividend policy alternatives and their impact on shareholder value. 8. Develop strategies for efficient working capital management including cash, inventory, and receivables management."
    },
    {
        "image": "syllabi1_synth_5_aug2.png",
        "label": "syllabi",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF BUSINESS ADMINISTRATION BA 301, Section C: Financial Management MW 3 00 PM 4 30 PM Room 402, Business Building Summer 2026 2027 saaking in business onde policy, and risk management and apply COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: pr. Brad Madden OPICE: Room 421, Research Building E Mail: stacie robbins Phone: (459) 963 983 1409 Office Hours: wo ersity edu ph Wednesday Friday, 9 00 AM 12 00 PM WiFi Support W Fi Network: POLYTECHNIC WiFi Pas Business Resource Center susiness COURSE DESCRIPTION cial statement ,and working Students willie The course covers bot aim to analyze financial statements, evaluate investment opportuni oretical frameworks and practical apr ermine optimal capital structure, and make strategic financiai de d studies frorn Phitippin temational companies. critical thinkin sential for financ' i managers. Students will use financial lysis tools COURSE OBJECTIVES By the end of ihis course, stucients shouid be able to: 1, Analyze and int rprei financial statements to assess company performance and financial health. time value of money concepts to evaiuate investment and financing decisions. 3. Use capital budgeting nloues (NPV, IRR, Payback Period) to evaluate investment projec 4 4. Assess risk and return relationships and apply portt iheary concepis. 5. Caiculate weighted average cost of capital and und i its role in financial decisio i 6. Analyze capital cture decisions and understand trade offs between debi and equity finan 7 7. Evaluate dividend pclicy alternatives and their impact on shareholder value. 8. Develop strategies for efficient working capital managernent including cash, inventory, and receivables management."
    },
    {
        "image": "syllabi1_synth_5_aug3.png",
        "label": "syllabi",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF BUSINESS ADMINISTRATION Financial Management 30 PM Room 402, Bus ne vent. Students appiy financial to COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: or Bram Office: Room 421 R E Mall: st obbins university edu ph Phone: (+63) 963 983 1409 Office Hours: sonda adden 1 Building 00 AM 12 00 PM WIFI Support Wi Fi Network: POLYTECHNIC Business Resource Center susin Fi Passwo: Resource Center: Le COURSE DESCRIPTION provi value off anagement. yine optimal capital structure from Philinpi and make strategic financial decisions will learn to analyze financial stalements, evaiuaie investment opportunities i and interna we WOrKS and practical applicati lial for financial me COURSE OBJECTIVES By the end of this course, students should be able to: 1, Analyze ari interpret financial staternents fo assess company perlormance and financial heai 2. Apply time vaiue of money concepts to evaluate inv ecisions. siment and financing 3. Use capital budgeting techniques (NPV, IRR, Payback Period) to evaluate investment projects. 4, Assess risk and return relations theory concepts. 5. Calculate weighted average cost of capital and undersiand its role in financial decisions. 6. Analyze capital structure decisions and undersian je offs between debt and equity financing. 7. Evaluate dividend policy alternatives and their impact on sharehoider value. &. Develop strategies for efficlent working capital manager neluding cash, inventory, and recelvabies management."
    },
    {
        "image": "syllabi1_synth_5_aug4.png",
        "label": "syllabi",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES COLLEGE OF BUSINESS ADMINISTRATION BA 301, Section C: Financial Management MW 3 00 PM 4 30 PM Room 402, Business Building Summer Term, 2026 2027 This course examines financial decision making in business organizations, including capital budgeting, working capital management, capital structure, dividend policy, and risk management. Students will analyze financial statements and apply financial tools. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: pr. Brad Madden Office: Room 421, Research Building E Mail: stacie robbins university edu ph Phone: (+63) 963 983 1409 Office Hours: Monday, wednesday Friday, 9 00 AM 12 00 PM WiFi Support Wi Fi Network: POLYTECHNIC_WIiFi Password: Available at IT Office Business Resource Center Business Resource Center: Learning Commons Hours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTION This course provides comprehensive study of financial management principles and practices in business organizations. Topics include financial statement analysis, time value of money, capital budgeting techniques, risk and return analysis, cost of capital, capital structure decisions, dividend policy, and working capital management. Students will learn to analyze financial statements, evaluate investment opportunities, determine optimal capital structure, and make strategic financial decisions. The course covers both theoretical frameworks and practical applications using real world case studies from Philippine and international companies. Emphasis is placed on developing analytical skills, critical thinking, and decision making abilities essential for financial managers. Students will use financial calculators, spreadsheet software, and financial analysis tools to solve problems and analyze scenarios. COURSE OBJECTIVES By the end of this course, students should be able to: 1. Analyze and interpret financial statements to assess company performance and financial health. 2. Apply time value of money concepts to evaluate investment and financing decisions. 3. Use capital budgeting techniques (NPV, IRR, Payback Period) to evaluate investment projects. 4. Assess risk and return relationships and apply portfolio theory concepts. 5. Calculate weighted average cost of capital and understand its role in financial decisions. 6. Analyze capital structure decisions and understand trade offs between debt and equity financing. 7. Evaluate dividend policy alternatives and their impact on shareholder value. 8. Develop strategies for efficient working capital management including cash, inventory, and receivables management."
    },
    {
        "image": "syllabi1_synth_5_aug5.png",
        "label": "syllabi",
        "ocr_text": "BA 301, Section C: Financial Management Room 402. Business Building nay 3 00 pay 430 PN 2028 2027 Summer Term cigion making 19 business OF janagement. ist ge finances ens nancial de yee EXATINES fi nent. Students wilt ar apely financial tools. CONTACT INFORMATION RMATION CONTACT INFO professor: or, Brad Madden Office: Room 421 8 ch Bui E Mail: giacie roppins u ersity edu ph Phone: 66°) 963 983 1409 office Hours: Friday. 9: nda. Wednesday 3 00 AM 8 00 PM onday Ft WIFI Support WHF Network: POLYTECHNIC WH i urce Center Business Resource Center Learning Commons Hours: Mic Business Reso include fi rganizations. Top business 0! ure decistons, divid en of ial management princik s, risk and return ana re provides 60 e@ of money. acial decisiof nd make strategie finat enpanies nal capital structure. 4 ppine and intern: portunities, deter world case from Phil stment Op uate if acial staternents, sa watt use fina rg. Students Students wil ze fine for financial manage The course naxing ab ty and decision T jams and ane s tools to solve Broo iators, spreadshe COURSE OBJECTIVES students should be able te: aclat statements to assess carnpany per stand financing decisions. By the end of this COUrse, mance and financial and interpret finar is ney concepts to evaluate investmer io evaluate if NPV, IRR, Payback Period) astment projects. 2 Apply time value of me geting techniques 3, Use capital bud aly portfolio theory concepls. role in financial de rationshias and af 4. Assess risk and return fe ted average cost of capital and understand its ebt and equity financing. 5, Calculaie Weg 6. Analyze capital structure decisions and undersianc trade offs between d chon shareholder value. management. jeng policy alterna’ y, and receivables F 7. Evaluate divic 8. Develop strategies for afficlent working capital management including cash, inventor"
    },
    {
        "image": "syllabi1_synth_6_aug1.png",
        "label": "syllabi",
        "ocr_text": "UNIVERSITY OF s N CARLOS SCHOOL OF BUSINESS AND ECONOMICS BA 301, Section C: Financial Management PM Roo mM 402, Business By This course examines fin cing capital Dudgetin and policy, and risk m, ganizations, ‘al structy Hl analyze financial statements f fools. manag ement, 54 COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Or. Norn Office: E Mail: Phone: Brooks Room 445, Faculty Buliding ond @university edu ph 942 9751 Monday Weanes ¥. 2 00 PM. 4 00 piy WIE] Support Wi Fi Network: UNIVERSITY _w, Business Resource Center Sword: Avail Business Resox Cormons Hours: Monday F: Niday 8 00 AM 8 00 PM ices in business organi. IVSIS, Cost of capita agement, ations. To; 1. Capital structure decisi t@ financial Statement dividend Policy, and working Students y The cours fo analyze financial Statements, ayaiu: le invesiment opportuni overs both frameworks and practical anolications using ri ties, determine optim ‘ond case stud .and Sécision making abi 8 toals to solve prob nal capital structure and p rom Philiopine an, 1d Infernational companies, make Emphasis is Placed on developing analytical skills, or calculators, Spreadsheet sofware, an strategic financial decisions. nA al thin les essential for financial managers. Students will use d financiai anaiys feMs and analyze scen Clal COURSE OBJECTIVES By the end of thi S Course, students should be able to: 1. Analyze and interpret financial stan 8S Company Performance 2. Apply time value of money concepts to evaluate invesiment and financing di 3. Use capital budgeting techniques (NPV, IRR Payback Perlon) to evaluate investment p 4. Assess risk and raturn relationshing and app s 5. Calculate weighted ave; ements to asse nd financial health, cisions, roecis. Hy portfolio thear pital and understand its ncepis. cost of ca in financial decisions. &. Analyze Capital structure decisions and under: derstand trade offs between debt 7. Evaiuate dividend policy alternati 8. Develop and aquity financing. \"NauVes and their impact on shareholder value, Strategies for efficient working capital Management including cash, inventory, and recaivabh eS management,"
    },
    {
        "image": "syllabi1_synth_6_aug2.png",
        "label": "syllabi",
        "ocr_text": "UNIVERSITY OF SAN CARLOS SCHOOL OF BUSINESS AND ECONOMICS BA 301, Section C: Financial Management MW 3 00 PM 4 30 PM Room 402, Business Building First Semester, 2024 2025 This course examines financial decision making in business organizations, including capita! budgeting, working capital management, capital structure. dividend policy, and risk management. Studenis will analyze financial statements and apply financial tools. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: pr. Norma Brooks Office: Room 445, Faculty Building E Mail: jessica bond university edu ph Phone: (+63) 989 942 9751 Office Hours: monday Wednesday, 2 00 PM 4 00 PM WiFi Support Wi Fi Network: UNIVERSITY WiFi Password: Available at IT Office Business Resource Center’ susiness Resource Center: Learning Commons Hours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTION This course provides comprehensive study of financial management principles and practices in business organizations. Topics include financial statement analysis, time value of money, capita! budgeting techniques, risk and return analysis, cost of capital, capital structure decisions, dividend policy, and working capilal management. Students will learn to analyze financial statements, evaluate investment opportunities, determine optimal capital structure, and make strategic financial decisions. The course covers both theoretical frameworks and praciical applications using real world case studies from Philippine and international companies Emphasis is placed on developing analytical skilis, critical thinking, and decision making abilities essential for financiai managers. Students will use financiat calculators, spreadsheet software, and financial analysis tools to solve problems and analyze scenarios. COURSE OBJECTIVES By the end of this course, students should be able to: 1. Analyze and interpret financial statements to assess company performance and financial health. 2. Apply time value of money concepts to evaluate investment and financing decisions. 3. Use capital budgeting techniques (NPV, IRR, Payback Period) to evaluate investment projects. 4. Assess risk and return relationships and apply portfolio theory concepts. 5. Caiculate weighted average cost of capital and understand its role in financial decisions. 6. Analyze capital structure decisions and understand trade offs between debt and equity financing. 7. Evaluate dividend policy alternatives and their impact on shareholder value. 8. Develop strategies for efficient working capital management including cash, inventory, and receivables management."
    },
    {
        "image": "syllabi1_synth_6_aug3.png",
        "label": "syllabi",
        "ocr_text": "UNIVERSITY OF SAN CARLOS SCHOOL OF BUSINESS AND ECONOMICS BA 301, Section C: Finan MW {3 00 P clal Management 4 30 PM Room 402, Bt Buliding St emesier, 2024 2025 anizations, ma working agement, and app! pital management, widenis wil i nancial tools dividend policy, and r statements COURSE SYLLABUS c CONTACT INFORMATION Professor: pr. Norma Brooks Office: Room 445, Faculty Buildi E Mail: jessica bonu us Phone: (+63) 989 942 9751 Office Hours: monuay 3 Wednesday, 2 60 PM 4 00 PM COURSE DESCRIPTION This course provides compr is, ime value of money, c capital management. nsive study of financia fat budgeti statement fes and practices in busin and return analysis, c Students The course ct! eam to analyze rs both theorelica cial statements, evaluale investment opportuniti 3, determine opti capital s! i case studies from Pr ucture, and make strat fin jecisions. lipgine and international compar is placed on developing analytica culators, spreadsheet software, and fi ical thinking, and decision making abi essential for financial managers. Students will use financial inalysis tools to solve prob 83 ECTIVES COURSE OC By the end of this course, students should be able to: 1. Analyze and interpret financial statements to assess company performance and financial health. 2. Apply tirne value of money concepts to evaluate investment and financing decisions, ques (NPV IRR, Payback Pari 3. Use capital budgeting techni 4. AS: <i} to evaluate inves’ ént oroje: sess risk and return relationships and apply portfolio theory conc: pis. 5. Calculate weighted averaye cost of capital and understand iis role in nancial decisions &. Analyze capital structure decisions and understand trade offs between debt and equity financing. 7. Evaluate dividend policy alternatives and their impact on shareholder value. 8. Develop strategies for efficient working capital management including cash, inventory, and receivables management."
    },
    {
        "image": "syllabi1_synth_6_aug4.png",
        "label": "syllabi",
        "ocr_text": "UNIVERSITY OF SAN CARLOS SCHOOL OF BUSINESS AND ECONOMICS BA 301, Section C: Financial Management MW 3 00 PM 4 30 PM Room 402, Business Building First Semester, 2024 2025 This course examines financial decision making in business organizations, including capital budgeting, working capital management, capital structure, dividend policy, and risk management. Students will analyze financial statements and apply financial tools. COURSE SYLLABUS a CONTACT INFORMATION CONTACT INFORMATION Professor: Dr. Norma Brooks Office: Room 445, Faculty Building E Mail: jessica bond university edu ph Phone: (+63) 989 942 9751 Office Hours: Monday Wednesday, 2 00 PM 4 00 PM WiFi Support W Fi Network: UNIVERSITY_WiFi Password: Available at IT Office Business Resource Center Business Resource Center: Learning Commons Hours: Monday Friday 8 00 AM 8 00 PM NN _— COURSE DESCRIPTION This course provides comprehensive study of fi analysis, time value of money, capital budgeting capital management. Students will learn to analyze financial statements, evaluate investment opportunities, determine optimal capital structure, and make strategic financial decisions. The course covers both theoretical frameworks and practical applications using real world case studies from Philippine and international companies. e financial nancial management principles and practices in business organizations. Topics include financial statement techniques, risk and return analysis, cost of capital, capital structure decisions, dividend policy, and working Emphasis is placed on developing analytical skills, critical thinking, and decision making abilities essential for financial managers. Students will us calculators, spreadsheet software, and financial analysis tools to solve problems and analyze scenarios. nn. COURSE OBJECTIVES By the end of this course, students should be able to: 1. Analyze and interpret financial statements to assess company performance and financial health. 2. Apply time value of money concepts to evaluate investment and financing decisions. 3. Use capital budgeting techniques (NPV, IRR, Payback Period) to evaluate investment projects. 4. Assess risk and return relationships and apply portfolio theory concepts. 5. Calculate weighted average cost of capital and understand its role in financial decisions. 6. Analyze capital structure decisions and understand trade offs between debt and equity financing. 7. Evaluate dividend policy alternatives and their impact on shareholder value. 8. Develop strategies for efficient working capital management including cash, inventory, and receivables management. SC."
    },
    {
        "image": "syllabi1_synth_6_aug5.png",
        "label": "syllabi",
        "ocr_text": "UNIVERSITY OF SAN CARLOS SCHOOL OF BUSINESS AND ECONOMICS BA 301, Section Cc: Financial Management MW 3 00 Pm 4 30 PM Room 402, Business Building First Semester, 2024 2025 COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Dr. Norma Brooks Office: Room 445, Faculty Building E Mail: Jessica. bond university edu ph Phone: (+63) 989 942 9754 Office Hours: Monday Wednesday, 2 00 pry 4 00 PM Fi Network: UNIVERSITY_WiFi Password: Available at IT Office rce Center Business Resource Center: Learning Commons Hours: Monday-| Friday 8 00 AM 8 00 PM COURSE DESCRIPTION This course Provides c analysis, time value of Capital management. Omprehensive study of fi Money, capital budgeting tech nancial management princi niques, risk and return ples and practices in business organizations. Topics include fi Inancial statement N analysis, cost of Capital, Capital structure decisions, dividend Policy, and working COURSE OBJECTIVES By the end of this course, Students should be able to: 1. Analyze and interpret fi i"
    },
    {
        "image": "syllabi1_synth_7_aug1.png",
        "label": "syllabi",
        "ocr_text": "F AGRICULTURE, RESOURCES AND ENVIRONMENTAL SCIENCES CENTRAL PHIL! COLLEGE MATH 204, Section B: Calculus il TTH 4 0 C5, Science Building PM 2 30 PM Reom 2 2026 2027 First Semes shniques of int Hon, applica parametri equations, and polar ed on problen s olying and real world appl This course COV sequences and ser plac: T <NFORMATION CONTAC CONTACT INFORMATION Mack culty Buiiding arsity edu ph Professor: Prof. Ke Office: Room 442, Fa Phone: (63) 943 214 5359 Friday, 9 60 AM 4 00 PM Office Hours. Monday. We sword, Avail ef Hours: Monday Fieay B00 AM 8 00 PM WiFi Network: ENTRAL_Wi Center su nter, Student WiFi Suppor Business Resoure siness Resource Cai COURSE DESCRIPTION 1, focusing on advanced integration techniques and th ation, improper integrals. and appil iy applications ions to area, ¥C This course is a continuation of Caic' ne, numerical integr 5 will study trigonometric substitution, partial fracho aurin sis, power series, Taylor and Mact yes and pol uding convergence te hus with parameinc auences and series, jar functions. cu infinite RE anding applications in tems fo and unders The course also cove’ d@ computer algebra equations and polar problem solving ski gq graphing calculators an reasoning, nology inctudiny paramet! use tech Se, ernphagis is placed on devel ering, economics, and other fi aids, Students will oblems. explore concepts and solve pt COURSE CBI ECTIVES rse, students will be able to: titution, and partial actions. Upon successful completion of this cour cluding gubstitution, integration by parts, trigonomel! ic subs termine convergence OF divergence. 4. Apply various integration techniques 1 9. Evaluate imprope' is 3. Use definite integrals to calculate areas, yolumes, arc lengths, and surface areas of revolution. equences and series using appropriate tesis. 4, Determine convergence oF divergence of infinite se es representations of functions and determine interval is of convergence. 5 Find power ger gciaurin series to appr oximate equations and polar coo! realaworid probiems rdinates, including finding derivatives and areas. s including physi yior and M 6, Use Ta 7, Work with parametric os, engineering, and economics. in various field: 8. Apply calculus concepts to solve"
    },
    {
        "image": "syllabi1_synth_7_aug2.png",
        "label": "syllabi",
        "ocr_text": "CENTRAL PHILIPPINE UNIVERSITY COLLEGE OF AGRICULTURE, RESOURCES AND ENVIRONMENTAL SCIENCES MATH 201, Section B: Calculus ii TTH 1 00 PM 2 36 PM Room 205, Science Building First Semester, 2026 2027 This Course covers techniques of integration, applications of definite integrals Sequences and series, parametric equations, and polar coordinates Emphasis is placed on problem solving and real world applications COURSE SYLLABUS CONTACT INFORMATION Professor: Prof. Kelly Mack Office: Room 442, Facuity Building E Mail: patricia beli university edu ph Phone: (+63) 943 214 5359 Office Hours: monday, Wednesday Friday, 9 00 AM 4 00 PM WIFi Support Wi Fi Network: CENTRAL WiFi Password Availabie at IT Office Business Resource Center susiness Resource Center: Student venter Hours: Monday Friday 8 00 AM 8 00 PM COURSE D This course is a continuation of Calculus j, focusing on advanced integration techniques and their applications. Topics include integration by parts, trigonometric substitution, partial fractions, numerical integration, improper integrals, and applications to area, volume, arc engin. and surface area. The course also covers infinite sequences and series, including convergence tests, power series, Taylor and Maclaurin series. Students wil! study parametric equations and polar coordinates, including caiculus with parametric curves and polar functions. Throughout the course, emphasis is placed on developing mathernatical reasoning, prob physics, engineering, economics, and other fields. Students will use technology includin explore concepts and solve probiems. iem solving skilis, and understanding applications in G graphing calculators and corputer aigebra systems to Upon successful completion of this course, students will be able to: 1. Apply various integration techniques including substitution, integration by parts, trigonometric substitution, and partial fractions. 2. Evaluate improper integrals and determine convergence or divergence. 3. Use definite integrais to calculate areas, volumes, arc lengths, and surface areas of revolution. 4. Determine convergence or divergence of infinite sequences and series using appropriate tests. 5. Find power series representations of functions and determine intervals of convergence. 6. Use Taylor and Maciaurin series to approximate functions and estimate errors. 7. Work with parametric equations and polar coordinates, including finding derivatives and areas. 8. Apply calculus concepts to solve real world problems in various fields including physics, engineering. and economics."
    },
    {
        "image": "syllabi1_synth_7_aug3.png",
        "label": "syllabi",
        "ocr_text": "CENTRAL PHILIPPINE UNIVERSITY COLLEGE OF AGRICULTURE, RESOURCES AND ENVIRONMENTAL SCIENCES MATH 201, Section B: Caiculus If TTH 1 00 PM 2 30 PM Room 205, Science Building First Sem 2026 2027 COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Prof OFFICE: Room 442, Faculty E Mail: patricia bel Phone: (+63) 943 214 535¢ Office Hours: monde Wednesday Friday, 9 00 AM 4 00 PM WiFi Support W Fi Network: CENTRAL WiFi] P: Business Resource Center Bus Jay 3 00 AM 8 00 PM COURSE DESCRIPTION continuation of Ca trigonometric substitution, partial fracti This cour nd their applications. Topics inc pplications to area, volume, a gration by parts, th, and surface area. The course alse covers infinite sequences a parametric equations and polar coordinates, includ r series, ae and Ma: fing caettenins Throughout $s piaced on developing mathematical reasoning, problen physics, e ering, economics, and other fleids. Students will use neiogy including gre explore concepts and solve problems. and understanding appt ical tors and compu COURSE OBJECTIVES Upon successful completion of this course, students will be able to tial fractions. 1. Apply various integration techniques including substitution, integration by paris, trigonometric substitution, and pe 2. Evaluate improper integrais and determine convergence or divergence. 3. Use definite integrais to caiculate areas, volumes, arc lengths, and surface areas of revolution. 4, De rmine convergence or divergence of infinite sequences and series using appropriate tests. d power series representations of functions and determine intervais of convergence. 6. Use Taylor and Maclaurin series to approximate functions and estimate errors. 7, Work with parameiric equations and polar coardinat iding derivatives and areas. 8. Apply calculus concepts to solve rez -worid problems in various fields including physics, engineeri"
    },
    {
        "image": "syllabi1_synth_7_aug4.png",
        "label": "syllabi",
        "ocr_text": "CENTRAL PHILIPPINE UNIVERSITY COLLEGE OF AGRICULTURE, RESOURCES AND ENVIRONMENTAL SCIENCES MATH 201, Section B: Calculus II TTH 1 00 PM 2 30 PM Room 205, Science Building First Semester, 2026 2027 This course covers techniques of integration, applications of definite integrals, sequences and series, parametric equations, and polar coordinates. Emphasis is placed on problem solving and real world applications. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Prof. Kelly Mack Office: Room 442, Faculty Building E Mail: patricia bell university edu ph Phone: (+63) 943 214 5359 Office Hours: monday, Wednesday Friday, 9 00 AM 4 00 PM WiFi Support WiFi Network: CENTRAL_WIFi Password: Available at IT Office Business Resource Center Business Resource Center: Student Center Hours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTION is a continuation of Calculus I, focusing on advanced integration techniques and their applications. Topics include integration by parts, This course n, improper integrals, and applications to area, volume, arc length, and surface area. trigonometric substitution, partial fractions, numerical integratiot The course also covers infinite sequences and series, including convergence tests, power series, Taylor and Maclaurin series. Students will study parametric equations and polar coordinates, including calculus with parametric curves and polar functions. oping mathematical reasoning, problem solving skills, and understanding applications in Throughout the course, emphasis is placed on devel tudents will use technology including graphing calculators and computer algebra systems to physics, engineering, economics, and other fields. S explore concepts and solve problems. COURSE OBJECTIVES Upon successful completion of this course, students will be able to: 1. Apply various integration techniques including substitution, integration by parts, trigonometric substitution, and partial fractions. 2. Evaluate improper integrals and determine convergence or divergence. 3. Use definite integrals to calculate areas, volumes, arc lengths, and surface areas of revolution. 4. Determine convergence or divergence of infinite sequences and series using appropriate tests. 5. Find power series representations of functions and determine intervals of convergence. 6. Use Taylor and Maclaurin series to approximate functions and estimate errors. 7. Work with parametric equations and polar coordinates, including finding derivatives and areas. 8. Apply calculus concepts to solve real world problems in various fields including physics, engineering, and economics."
    },
    {
        "image": "syllabi1_synth_7_aug5.png",
        "label": "syllabi",
        "ocr_text": "CENTRAL PHILIPPINE UNIVERSITY COLLEGE OF AGRICULTURE, RESOURCES AND ENVIRONMENTAL SCIENCES MATH 207, Section B: Calculus PER 1 00 PM 2 36 PM Room 205, Sei First Sern: 2026 2027 s of definite integrals, ates. Empnasis COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Proi. Kelly Mack OFFICE! Room 442, Faculty Building E Mail: patriciat Phone: (+63) 943 Office Hours: Monday, Wednesday Friday. 3 00 AM 4 00 PM T Office Network: C ailable WIPFi Support C Business Resource Center oe RAL WIFL) Password: ss Resource Center: Student 8 00 AM 8 00 Pi ter Hours. Mon: COURSE DESCRIPTION uO include in Hons. cations to area, vc n by parts, ea. pic ume, arc length, a cour trigonometric substitution, partial factions, numer id surface a! rintegrals, and appl Maciaurin seri and set s, includ wergence fests, power series, Taylor and and polar functions. aiculus wit netic curve ic equati Throughout the course, emer physics, engineering, e explore cancepis and fill use technology Including grant COURSE OBJECTIVES r of this course, students will be abie to: Upon successful cornpietio 1, Apply various integration techniques including substitution, integration by parts, trigonometric substituien, and partial trac rd determine con evaluate improper integra nee or divergence. 3. Use def in ite integrais to calculate areas, volumes, are: lengths, and surface areas of revolutic 4, Determine convergence or divergence of infinkte sequences and serias using appropriate tesis. 5. Find po ions and determine intervals of corvergence. r series representations of ful 6. Use Taylor and Maciaurin series to approximate functions and estirnate errors. 7. Work with parametric equations and polar coordinates, including finding derivatives and areas &. Apply calculus concepts to solve real world problems in various fleids including physics, engineering, and economics."
    },
    {
        "image": "syllabi1_synth_8_aug1.png",
        "label": "syllabi",
        "ocr_text": "CONTACT INFORMATION Room 255, Admin Buildi il: allison cooper universit Phone: (+63) 979 347 8988 Office Hours: Tuesday Th COURSE DESCRIPTION This course Provid chemical bonding Solutions, and acids and bases, ©S a comprehensive ionic, Covalent, metallic), ATENEO DE MANILA UNIVERSITY SCHOOL OF MANAGEMENT CHEM 101, Section E: General Chemistry MWF 8 00 AM 9 00 am Room 101, Chemistry Lab First Semester, 2025 2026 This course introduces fundamental structure, chemical bo ding, Stoichiometry, thermoche! reactions. Laboratory work provides hands on techniques ang analysis. COURSE SYLLABUS CONTACT INFORMATION Ing y edu ph lursday, 1 00 Pm 12 00 PM introduction to general ch"
    },
    {
        "image": "syllabi1_synth_8_aug2.png",
        "label": "syllabi",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY SCHOOL OF MANAGEMENT CHEM 101, Section E: General Chemistry MWF 8 00 AM 9 00 AM Room 101, Chemistry Lab First Semester, 2025 2026 This course introduces fundamental principles of chemistry including atomic structure, chemical bonding, stoichiometry, thermochemistry, and chemical reactions. Laboratory work Provides hands on experience with chemical techniques and analysis. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Dr. Charles Torres Office: Room 255, admin Building E Mail: allison cooper university edu ph Phone: (+63) 979 347 8988 Office Hours: Tuesday Thursday, 1 00 PM 12 00 PM WiFi Support Wi- Fi Network: ATENEO_WiFi Password: Available at IT Office Business Resou rce Center Business Resource Center: Student Center Hours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTION This course provides a comprehi chemical bonding (ionic, covale solutions, and acids and bases. lensive introduction to general chemis try principles and practices. To) nt, metallic), molecular geometry, pics include atomic theory, periodic table, nomenclature, stoichiometry, chemical reactions, thermochemistry, gases, Students will develop understanding emphasizes quantitative problem sol Laboratory component includes expe scientific report writing. Safety protoc and application of chemical principles riments demonstrating chemical concepts ‘ols and proper handling of chemi to real world phenomena. developing laboratory techniques, data collection and analysis, and cals and equipment are strongly emphasized. COURSE OBJECTIVES After completing this course, students will be able to: 1. Describe atomic Structure, periodic trends, and relationship between electron configuration and chemical properties. 2. Explain different types of chemical bonding and predict molecular geometry using VSEPR theory. 3. Write and balance chemical equations and perform stoichiometric calculations. 4. Apply gas laws to calculate pressure, volume, temperature, and moles relationships. 5. Calculate concentrations of solutions and perform dilution calculations. 6. Analyze thermochemical reactions and calculate enthalpy changes. 7. Describe acid base theories and perform pH calculations. 8. Demonstrate safe laboratory practices, proper use of equipment, and accurate data collection and analysis. He"
    },
    {
        "image": "syllabi1_synth_8_aug3.png",
        "label": "syllabi",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY SCHOOL OF MANAGEMENT CHEM 101, Section E: General Chemistry MWF 8 00 AM 9 00 AM Room 101, Chemistry Lab First Semester, 2025 2026 This course introduces fundamental principles of chemistry including atomic structure, chemical bonding, stoichiometry, thermochemistry, and chemical reactions. Laboratory work provides hands on experience with chemical techniques and analysis. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Dr. Charles Torres Office: Room 255, Admin Building E Mail: alison cooper university edu ph Phone: (+63) 979 347 8988 Office Hours: tuesday 3 Thursday, 1 00 PM 12 00 PM WiFi Support Wi Fi Network: ATENEO_WIFi Password: Available at IT Office Business Resource Center Business Resource Center: Student Center Hours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTION This course provides a comprehensive introduction to chemical bonding (ionic, covalent, metallic), molecular solutions, and acids and bases. general chemistry principles and practices. Topics include atomic theory, periodic table, geometry, nomenclature, stoichiometry, chemical reactions, thermochemistry, gases, Students will develop understanding of the relationship between microscopic atomic structure and macroscopic properties of matter. The course emphasizes quantitative problem solving, conceptual understanding, and application of chemical principles to real world phenomena. Laboratory component includes experiments demonstratin ig chemical concepts, developing laboratory techniques, data collection and analysis, and Scientific report writing. Safety protocols and proper handli ng of chemicals and equipment are strongly emphasized. COURSE OBJECTIVES After completing this course, students will be able to: 1. Describe atomic structure, periodic trends, and relationship between electron configuration and chemical properties. 2. Explain different types of chemical bonding and predict molecular geometry using VSEPR theory. 3. Write and balance chemical equations and perform stoichiometric calculations. 4. Apply gas laws to calculate pressure, volume, temperature, and moles relationships. 5. Calculate concentrations of solutions and perform dilution calculations. 6. Analyze thermochemical reactions and calculate enthalpy changes. 7. Describe acid base theories and perform pH calculations. 8. Demonstrate safe laboratory practices, proper use of equipment, and accurate data collection and analysis."
    },
    {
        "image": "syllabi1_synth_8_aug4.png",
        "label": "syllabi",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY SCHOOL OF MANAGEMENT ces fundamental pr sanding, stoichior tory work provides har techniques and ai COURSE SYLLABUS CONTACT INFORMATION OF ice: Room 2 E Mail: allison y Phone: (63) 979 3474 gyfflce Hours: Tuesday Thur 12 00 PM Wayei Support Wi Fi Network: ATE! Business Resource Center COURSE DESCRIPTION a comprehensive introduction to g¢ +, covalent, metallic), molecular 9 d practices. Topics include rnical reactions, thermochem principles ar Yature, sto ry, ichiomett if develop understanding of the relationship between Ir icroscopic ator The course izes quantitative problem solving, conceptual understanding, and apf and macroscopic properties of matter jes to real world phenome! ,and ollection and analys Laboratory compo scientific report W COURSE OBJECTIVES 3 course, students wil be es. nerties atomic structure, periodic trends, and relationship petween tron configuration and chemical propert bonding and predict molecular geometry using VS! Rese! 4, Des 2. Explain different types of chen) ulations. Sons and perforrn stcich 3. Write and be chemical eat 4. Apply gas laws to calculate pressure, yolume, temp 1d moles relationship ions and perform dilution calculations. 5, Calculate concentrations of so 6, Analyze thermochemica reactions and calculate enthalpy changes. s acid base theories and perform oH calculations. pment, and accurate date collection and analy ate safe laboratory practices, proper use of eq"
    },
    {
        "image": "syllabi1_synth_8_aug5.png",
        "label": "syllabi",
        "ocr_text": "ATENEO DEM SCHOOL OF MANAGEMENT CHEM 10%, Section E: General Chemistry MWE 0 Ald 9 00 AM Room 101, Chemisiry Lab First Semester, 2025 2028 isse introduces fundamental principles of chemistry includi chemical bending, stoichiornstry. therrnochernistry, and actions. Laboratory work prov hands on experience with cher techniques and analysis. COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: o7 Charles Torres OPICE: Room 255, Admin Build E Mail: atison c sper univers! Phone: (53) 979 347 8988 Office Hours: tuesday 3 Thursday, 1 00 PM 12 00 PM WiFi Support Wi Fi Network: ATENEC_WiFi Password: Available at IT Offi Business Resource Center susiness Resource Center: COURSE DESCRIPTION This course provides a comprehensive introduction to general chemistry principles and practices. Topics include atomic theory, periodic table, chemical bonding (ionic, covalent, metalic), molecular geometry, nomenclature, st hiometry, chemical reactions, thermochemistry, gases, solutions, and acids and bases. Students will develop understanding of the relationship between microscopic atomic structure and ma FOSCOPIS DF periies of matier. The course emphasizes quantitative problem solving, conceptual understanding, and application of chemical principles to real world phenomena, i Laboratory component includes experiments demonstrating chemical concepts, developing laboratory techniques, data collection and analysis, and scientific report writing. Safety protocels and proper handling of chemicals and equipment are strongly emphasized. ene areas ae etter tes After completing this course, students will be able to: 1. Describe atomic structure, periodic tends, and relationship between alectron configuration and chemical properties. 2. Explain different types of chemical bonding and predict molecular geometry using VSEPR theary. 3. Write and balance chemical equations and perform stoichiometric calculations. Apply gas laws to calculate pressure, volume, temperature, and moles relationships. 5, Calculate concentrations of solutions and perform dilution calculations. 6. Analyze thermochemical reactions and calculate enthalpy changes. 7. Describe acid base theories and perform pH calculations. 8. Demonstrate safe laborator y practices, proper use of equipment, and accurate data collection and analysis."
    },
    {
        "image": "syllabi1_synth_9_aug1.png",
        "label": "syllabi",
        "ocr_text": "ENG 102, Section D: Academic Writing and Researcn Room 267, Humar Heng 4030 AM! Summer Tem, 2026 2025 og academics ynethods ortical riting gentes. prnent research acader elops advanced writing ar 3 incude argument Ge gocumentallen, and v ap proper INFORMATION Prof, Randy Branch arch Building Professor: office: Roor E Mail: Phone: (463) 935 1197 Office HOUPS: Tuesdy Thursday, 9 00 AM 41 00 AM WORK: ATENEO_WT 4 Password: Ava! 2 00 AM 8 06 PM 2ESOUTCe is WiFi Support WiFi Net Business Resource Center Business! Senter, Learning ie SCRIPTION elop students’ academic WHLEG and research skills essential for university level wor and profe art to retruct wall organized, logicany developed assays and research papers oF various topics. roness inclu jection, resear oh qu jation, titerature SOUrce evaluailion, emphasis is placed on critical thinking, ion, synthesis of si er view. ourees, and prop zis designed tc a Students will jete research PF revising, ane editing. Thig cour cornmunicatlon. estion formu _argumentatl topic Se The course covers the comp: note taking, outlining, cra! doournentation using APA ot MLA format. yanous academic writing genres including expository, ar 1 4 as clarity, coh cornamon whteg chatienges as well a formal research avoiding plagiarism. Aicnk eSSByS. y, and ye, and at rnatical accure’’ ument erence, gram engage with Students wi rse aise addresses papers. The cou COURSE OBJECTIVES nts will be able to: ree, studer nts and evidence. soned argume dible onfine SOUTESS. eo i Upon completion of thers with well Te ear, focused thesis statements and support 4. Develop ol regeareh using Yorary databases, academic journsis, and 2. Conduct effect les saUrceS tO support arguments and develop new insights. nQ WaNsitions, opriaie structures ar io avoid plac y for credibility, f 3, Evaluate sources orlth 4, Synthesize information from multi’ ays and research papers using appr 5. Organ 6, Document sources g APA Gi MLA citation style to rarnmatical accut 2 effectiveness. purposes and audiences. 7, Revise and edit writing for clarity, coherence, g acy, and stylistic diferent academic le and tone 16 3. Adapt writing sty"
    },
    {
        "image": "syllabi1_synth_9_aug2.png",
        "label": "syllabi",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY SCHOOL OF MANAGEMENT ENG 102, Section D: Aca amic Writtr and Research TTH 9 00 AM 10 30 A 1) Roan 2 Hum: Summe 226 2025 COURSE SYLLABUS CONTACT INFORMATION CONTACT INFORMATION Professor: Prof k Office: Room 314 E Mail: wi Phone: (+63 9 Office Hours: tuesday Thurs WHFi Support Wi Business Resource Center sus Fit work: AT: vM 8 00 PM COURSE DESCRIPTION This cours: sd ta develop students! ac communication. Students will learn to cons’ iat for university and r y developed ess on formu tion, research ch nate. docu dents wil! papers. The cot age with va also address: ays, as well as formal research vacy, and avol i COURSE GCBIECTIVES y completion of this course, stucenis will be able to: the avelop clear, focus tatements and support them with weil reasoned arguments and evidence. 2. Concduet effe ve research using brary databases, academic Journals, line sources. fe sour ity, relevance, and blas information from muitinie sources te support arguments and deveiop new insights. opropriate structures and tran Sing HONS. g APA or MLA citation sty 7. Revise arid edit writing for clarity, cone atical accuracy, and styi fing style and tone to diferent academic purposes and au"
    },
    {
        "image": "syllabi1_synth_9_aug3.png",
        "label": "syllabi",
        "ocr_text": "IVERSITY ATENEO DE MANILA UN SCHOOL OF MANAGEMENT ENG 102, Section D: Academic Writing and Research BOING am 204, Humani 49 30 AM Roi Surnmer Term, 20. 6 develops advanced wri Topics inclu praper document This cours Succe: COURSE SYLLABUS CONT CONTACT INFORMATION Srofessor: Prof. Ransy Branch OYFicet Room 314, Research Building E Mail: 1 rodriquez university ediu ph Pore: 663) 935 119 7758 Office Hours: yuesday Thursday, 9 00 AM 11 00 AM i Network: ATENEO. WiFi Support Business Resource Center 6 COURSE DESCRIPTION This course is designed to develop stuc communication. Studeris will learn fo construct well professional igi for university level work and us topics. search skilis essenti developed essays anc resect ch papers on vari literature review, Source avaluation, hesie of sources, and proper dents’ academic writing and re -organized, logically arch process including topic selection, researen question formulati 4 nd editing. Em phasis is placed on critical thinking, arc urnentation, syn 3 be The course covers the complete r note taking, oullining. drafting, revising, documentation using APA or MLA format, Students will eng: with variot adermic writing genre including expasitory, ar umentative, and analylical essays, as ence, grammatical accuracy, and avoid papers. The course aiso addresses common writing che larity, coner i wel! as formal research COURSE OBJECTIVES Upon completion of this course, siudents will be able ic: uments anc easoned a statements and support them with weil 4. Develop clear, focused thesis s, academic journals, anc credible online sources. brary datab: 2. Conduct effective research ust ievance, and bias, %, Evaiuate sources critically for credibitity, t tion from multiple sources fo Support arguients and de g appropriate structures and transkions. ep new insights. 4, Synthesize informa Organize essays and research papers b ising APA or MLA cite io 5. tyle to avoid plagiarism. 8. Document sources properly and stylistic effectiveness. and edit writing for clarity, coherence, grammatical acct 7. Rev &. Adapt writing style and tone to different academic purposes and audiences."
    },
    {
        "image": "syllabi1_synth_9_aug4.png",
        "label": "syllabi",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY SCHOOL OF MANAGEMENT ENG 102, Section D: Academic Writing and Research TTH 9 00 AM 10 30 AM Room 201, Humanities Building Summer Term, 2026 2025 This course develops advanced writing and research skills necessary for academic success. Topics include argument development, research methods, critical analysis, proper documentation, and various academic writing genres. COURSE SYLLABUS CONTACT INFORMATION. CONTACT INFORMATION Professor: Prof. Randy Branch otto: Room 314, Research Building Mail: william .rodriguez university edu ph Phone: (+63) 935 119 7758 Office Hours: Tuesday Thursday, 9 00 AM 11 00 AM WiFi Support Wi Fi Network: ATENEO_WiFi Password: Available at IT Office Busi ness Resour ‘ce Center Business Resource Center: Learning Commons Hours: Monday Friday 8 00 AM 8 00 PM COURSE DESCRIPTION plete research process includi Fesearch question formulation, lite: note taking, outlining, drafting, revising, and editin rature review, source evaluation, 1g. Emphasis is placed on critical thinking, argumentation, sy! documentation using APA or MLA format. nthesis of sources, and proper Students will engage with various a icademic writing genres including expository, Papers. The course also addresses argumentative, and anal common writing challenges such as clarity, lytical essays, as well as formal research coherence, grammatical accuracy, and avoiding plagiarism. COURSE OBJECTIVES Upon completion of this Course, students will be able to: 1. Develop clear, focused thesis statements and Support them with well- 2. Conduct effective research using library databases, academic journal 3. Evaluate sources critically for credibility, reasoned arguments and evidence. Ss, and credible online sources. relevance, and bias. 4. Synthesize information from multiple sources to Support arguments and develop new insights. 5. Organize essays and research papers using appropriate structures and transitions. 6. Document sources Properly using APA or MLA citation Style to avoid plagiarism. 7. Revise and edit writing for clarity, Coherence, grammatical accuracy, and stylistic effectiveness. 8. Adapt writing style and tone to different academic purposes and audiences. eee"
    },
    {
        "image": "syllabi1_synth_9_aug5.png",
        "label": "syllabi",
        "ocr_text": "Professor: SMFices Room 314, Reseale BA E Mail: wiliarn rodrig} ENG 102, Section This cou success. ana’ Prof. Randy Br anch 395 119 7758 Phone: (63) 9 Office Hours: Tuesday $1 C This cours: COURSE OBJECTIVES OURSE DESCRIPTION is designed to develop §' udents will learn to cor cornmunicalion The courge covers the complete research outlining, draling. revising. af ing APA oF MLA format. documentation us Students wil engage with variQus academ papers. The course also this course, students Upon completion of sta tear, focused thes 4, Develop 2, Conduct effective research u 23, Evaluate sources critically for ci edi 2 information from mu 4, Synthesize itiple 5 _ Organize essays and 6, Document sources properly using 7. Revise and adit writing for 8, Adapt writing style and tone 10 di wifi Support Wi Fi Network: ATENEO. Business Resource Canter Business iants' academic W struct well organized, log process including addresses common fermients ane ary database pitty, releve BEA or MLA citation sty! grammatical acour clarity, coherence, es and audiences. ‘erent gcademic purpos! TTH g 00 AM Summer Term 2028 20 include argu lysis, proper documentatia GAM LF SCHOOL OF MANAGEMENT Room 201, Human Fiting and esearch skills f WF n, and yanou COURSE SYLLABUS CONTACT WIFI Pasewor Ava iting and d editing. Eriphasis ist ras jnoludin io wei wilt will be able to: support nem with wel y s, acaden nce, and bias. ources using appropr a 10 OU gioally developed ess selection, rosea! placed on critical ihinking, argument challenges such as cia to support arguments and jaie structures ane INFORMATION as Hours: M agearch skills g expository, 4 rity, conere urnals, and eredible nd transitions. avoid plagiarism. agsertia’ for university ays and pegea rch panes tion, literature review, rch question formulat 5 of SOUTCES, and proper ation, symih gumentative. and at L reasoned argumen: online sources. davelop new insigt racy, and stylistic effect p: Academic Writing and Research Building oniical 5 academic writing gear es. onday Friday ov) “ley jytical essays, ai accuracy, and aVOIC 00 AM 8 00 PM swork and professional OF VETIOUS topics. as weil as for source evaluation, maj research ding plagiarism."
    },
    {
        "image": "syllabi2_synth_11_aug1.png",
        "label": "syllabi",
        "ocr_text": "CS 201 SYLLABUS Central Philippine University Department of Biology Data Structures and Algorithms LINSTRUCTOR INFORMATION, \"Name. Assoc. Pro. Tammy Pane Phone Nomber (+83) 908 886 8711 (Orice Locton: Room 308, Faeuty Bsa Mal Ades: pn waters unwersty 26u ph N. Gonsal Cou information re curate: 25% Comper 7 COM 3727 IAG, CS GU, SEI aes ras turner 29% Cre can ene se, ACT ATMS HONS mays Jago nin propreung gee: 20% Fou mfr profes evan ao a SAS coment (cerry nrc: 1% ety rain arses a rte ace WV, Cou Ressinements ‘COURSE REQUREMENTS: 1 Texeonc \"reoauon Agate 2 praying ron Pen J OK WM DE (Eee, a Ca) copie ter: Rep ces a cap Wat tx FOTN SENET 4 Atetrce Met comer uncer Rvs a Sn ITE) sun bn bec eure: exes Doe ay tN RES aE"
    },
    {
        "image": "syllabi2_synth_11_aug2.png",
        "label": "syllabi",
        "ocr_text": "CS 201 SYLLABUS Central Philippine University Deparment of Sosy Data Structures and Algorithms INSTRUCTOR INFORMATION Name: Assoe. Pot Tammy Page Phone Nember (968) 9084868711 Scena Roo 3 Fay EMS Aden: pnw ph M Gneral Course information (Course Coo C3 201 Cream Sunt Prreqlste CS 10t mecaxton Progamming ‘Tr conver compre to trove daa Srces 2nd agers eset eet scmarecendopvert Tass ncute 273s ass Sass, ques Tek JS SOE AGT, sarong agurers. a canpent jos SORTS wil mpener aa SALEM BONNY langue aayze agra ence wang 3 0 naan WL Composition Folds Pontitio COMPOSITION OF FNAL GRACE: ae Exar: 29% Compre coven 272), a ack, quem 9 agree ‘Pes Exarniton 29%. Cumuatve ean every Pe. TS. ACT TRS. CONT, nae Proyarming Aaece 2S: Fos mag aes peer ara GAR ETE RE AGETET omen ee oy WV, Course Requiteats COURSE REQUMEMENTS: 1 Tesnox \"Reon Agartres” by Corman Laverton Rove a EN ress) 2 Pring Enero yon 3 Ja OK WE (Exp, Pa VEC Compu Aco: Regus comp wh me Reng ASF ones {Cpe Mee 0% sec ee ese ARN may EL TON FIO"
    },
    {
        "image": "syllabi2_synth_11_aug3.png",
        "label": "syllabi",
        "ocr_text": "CS 201 SYLLABUS Central Philippine University Department of Biology Data Structures and Algorithms LINSTRUCTOR INFORMATION Time Assoe. Prof. Tammy Page Phone Nember (96) 908 886 8771 Dates Location: Room 308, Facuty Bg. OM Address: fn waters @ewersty 261 99 Hh Ganga Course infomation M1, Composition FoiderPontiia COMPOSITION OF FNAL GRAQE: aocaremat 29 -COWPEWE ET CORN A ELISE LS OME ATES apm er nna 29 -Cinsv 8 TEATS ER FDS PTT ANS TPC) ast roping rec Bh For mae pes mgr a Sa cemetn coma Eero 1 Wetay azn eC BH EDEN PIGS sree ma agers WW, Couns Reauraments ‘COURSE REQUREMENTS: {expo \"rents Agarees 0) ‘ropa renee 3s 84 OK WE ER RL. VSO) pA: Regs ms DBE MERE FOTN MATTE samen en Pes rd EN IES)"
    },
    {
        "image": "syllabi2_synth_11_aug4.png",
        "label": "syllabi",
        "ocr_text": "CS 201 SYLLABUS opine Univers Daperonen’ af ology Central Phi! Data Skuckues and Algorithers LINSTRUCTOS INFORIKATICH ree enon C8 ROMER RATNIR pick ensure is ema a ters mE REE TEE SUE Gaerne Taine aree aie MA EHD ONE TH SHR ST GST Cecnnngaetins YaoN BaN ME LURING TATIONS lingua no eayere win atowcy ceuroamin ern tans Sher ems Senge aes ArT ap ei, HE SON gene pons an Se as engrearg ete, MAE ANE SEO NOY rai eget EO AN SST meaty esse 1 viene Poe scr re eng aes w sRieians aS ERAIPASNT 1 Taxssac “vecaonss gate oy oon see Ar SSMS «gregory vemos Da Gave Oo ALS MS VEO 2 cep Sos: Rep wae UO ARUN AS STN ROE 4 Ang ith RAMAN EM I a ea ETI"
    },
    {
        "image": "syllabi2_synth_11_aug5.png",
        "label": "syllabi",
        "ocr_text": ""
    },
    {
        "image": "syllabi2_synth_12_aug1.png",
        "label": "syllabi",
        "ocr_text": "CS 207 SYLLABUS te University Giatage oF Esionton Minganac Data Stuckines and Aigorimins HnstRUCTOR INomNaTION ome Dr Cory Ruane fone Newey Ces ae ar fis Lacaiar ee BP Adm By, EM} Ab pestis Mtedeneasiy aes vette, Hh Gescc ‘Daeee Soke 28 Sr Sune Sera Hs eaan Raps “in casera ann cat oie aa ston IMC Ue Keare seeaenin Sa3es nom atop. 2055s nas tase owe BU ee apr, area EEG scp HI ATE ENN NS OU, Sepay auinwynugaane mane cu tg emOHEA Wh Cesena FuidecPnies uMEITIN Ge PrIK coe Mae Burson am, wares Pas eames ea ogra sega: Rae ge ps mean in ck eK aS eh Sorereien ve ae mes Ce Be Sameer ma enasig ks, pane ESR aL ese Sao Carona Py: essen rc Aa ag eR WW. Cotwaytensumnate cootamunawers Temmstc oemaetan gure ty Sane dren Mae mee Ne {rapamycin er 9 OR ORE IE 3 engl Aca eg sone Sat ete Rep wae ONE AS 2 Wantage amc Ge SUR RE Re RN Hae RII"
    },
    {
        "image": "syllabi2_synth_12_aug2.png",
        "label": "syllabi",
        "ocr_text": "CS 201 SYLLABUS Mindanao State University CColege of Education Data Structures and Algorithms LINSTRUCTOR INFORMATION ‘Name: Dr, Cory Russell Phone Number (+83) 004 870 3700 Office Location’ Room 227, Admin 8g E Mail Ades: jessica banks @unwersty e u ph Th Gensel Cour nbemstion couse cose 65201 Crea: Sunts Preeqisie: C5 101 rrometent Meaning ‘Tis cnrse poses compere st of vera daa srchres a agers esata tr eet senuzecetacgart Tose nce 273s mess, ac, queue, 058, Fas Sg SBT, sera agen, ae empl 2) Shoes wl mplevert aa ruses nya langugesndsnaye garam etc) srg 3 0 roto. ‘Composition Folder Ponta arm Exeter: 25 Comprenerste eam oven 2726s, et, es, rj grime ‘rat Examiner: 25% Cuan eran engages, aps sencing agrees, compe) ays Progaming eget: 50% Fox mer rgecs plover ras Ga srihres axl agriee Nm ary Exes: 1% Weady prayaming excises aaroen- saving 805 WV. Course Reaurements Tespone \"romans Algae by Coren sere Rest ain egies) 2 pgyanmingEniromrt Pen 3 0 sara JOK WO DE (sips alc VScom) compete Accs: Renda sces in compe winx pry amig ase 2d «4 Atewtnce: Menum 0 sees eq excessive sens may esuin op TI"
    },
    {
        "image": "syllabi2_synth_12_aug3.png",
        "label": "syllabi",
        "ocr_text": "CS 201 SYLLABUS Mindanao State University Catege ot Gsveatey Data Structures and Aigontivns UINSTRUCTOR SNECRMATION sen Coy eee Pie Sai oB8) ATE Ofc Vncar® Revns 23) here Ohag ENA NARI pen wenger, «0 98 1 ser motes Snsae Cam C501 Crem Hn wenn CONN MRaeN MUP em Pe owe pn onparere ay carpe 288 ut mS Agee mare tart sctore mene Lan NO TAA OMEN Ha Bem tem GE ORIEN ar seg npn Beare FO 4 AAT YD MPT RECITES ry we eae west ese) wey BPS seems Tania ITN Pa 0 Nem Darran Dh Came werme wae ney ie Sat Oh ene a a ow Danton 20 Crnsde im MRE Re gk bey ET MOONE rep anere™ Yat A Fay 98 paca Rnetmeng ange #84 Lode Come tam Wop mersee ME EN ON NER 1 Lretaeeicr Couns nO AON Toa Mea TN By Come RL Po As Bae 2 Rapeomeg te mene RI La so RR Oe MOL"
    },
    {
        "image": "syllabi2_synth_12_aug4.png",
        "label": "syllabi",
        "ocr_text": "CS 201 SYLLABUS Mindanao State University Colege of Educston Data Structures and Algorithms LINSTRUCTOR INFORMATION ‘Name’ Dr. Cory Russel Pane Number (483) 868 070 9790 Dice Lovato Room 237, ame Beg sal Aioss ggeiea earns @anversty e000\" Cousecose C5201 cre Suns Sreeusss C5 101 rronsten mayan ‘Tis cnse poses conpenesiestn) of anera arasrinres wd ageitme ssera r eset nro chicoer Tact Meese need aot. ques Tose Gare #9779 497 78 sex agyirns aweament )56. ers Wl ImaeTeT sare NOTIN Uanpaeanaing 2eagrer etcereyusrgag oreo. Asem Exams 25 Congrenne ig qian covery 273s mess. Sa. ques. 679) ages Fea aman 2% Camsaieauam anaraszng 766s. game sercTgageiIMs acon) propaga 2h Fax aor sacs mere iaran ana sree magetes en aoe Eee 0% Way ogannngaeroeee a rover eon eS Tesmum reonston Age AS 0) COTTER LeGeon Ries ee) 2 pagan 2 copa sess Rapuara: OR WT TES BOATING BETTE poweanee Wn 8% eT auras ese DEST ORE NTO"
    },
    {
        "image": "syllabi2_synth_12_aug5.png",
        "label": "syllabi",
        "ocr_text": "CS 201 SYLLABUS Mindanao State University College of Education Data Structures and Algorithms LINSTRUCTOR INFORMATION Name’ Dr, Cory Russell Pane Number (483) 864 070 3790 Dice Location: Room 237, Admin Bag E Mail Adios: jessica banks @unwersity edu ph couse cose C5201 creas: Suns reuse: C5 101 rrontenn meaning “Tis oarse poses commenerie stun) uvanera drasninres ad ageinms essen tr eet envcre diac, Tancredo aye vedi act quons Pees Game sommg age sexagenarian 2). ShoeTs wi imaever dma srures nO ITN langage ndinayzeagarem etcery wary ag Oreo. ML, Compoction alder Pontatia Nisan Easton: 25% Congrense qian cong 273s mslss sass. ques song ago Fg Sxamnaton 25% Comsaneauam anor ree. gan, scary agri acon) ass Dopamine 9% Fou mao pas mpeerungiaios da srumtres agave wn Lavraay Eercses: 10% Nesey royanng execs aupasen saung aces Tesoonc rronton Aigaers oy Coen asesen Rest a Sen ened 2 ogyaming Eniromer: Pen 3x. 1a .OK Wm DE ise Mal oVS Com compe Accs Reps sces comp. wnat ryaingasgMners and 4 Aces: Miu 6s sence reqired xcssve sense mayresuin op Ta"
    },
    {
        "image": "syllabi2_synth_13_aug1.png",
        "label": "syllabi",
        "ocr_text": "CHEM 301 SYLLABUS Central Philippine University Decanment of Boegy Organic Chemistry INSTRUCTOR INFORMATION Tecan om orzewees te Zap owner OMG ETALE way wre peer ery ete Re nrtene 2p ooo Aor aa ant Te Aa 728 HAO Be PCLT CD: AON LUE ET A RTT Om AOR TM BER ARO FEES A TT, Pome on Nem oreo gree setae ecu Re Nee Sum ON or gus may rary Feat 1 Uaenuy Wome «1 Meaecty rorsarany tree srarecra Hntse ERT A Dum i De Te sha Bn ot emer Zoe Fe LE, OR oe, Sauer oo mr) con Une, popes sco be oom eS Mme"
    },
    {
        "image": "syllabi2_synth_13_aug2.png",
        "label": "syllabi",
        "ocr_text": "ssine University ganic Chemistry TOR MFORMATION Sis out 736, Reseaeon Belg eee eegpuneoany ee. sngerenea onemrateness Anna pee REET, OR AR ATEN evry conpmer nas resin ESE Me, ENE RTA HM Syne Ele Rie so OFF AIOE su tan asrioy DEAS Ge peene SEE AES BU gota 1 near ea noe aye Page tracer gare NEMS Bp A meray Maca Carmenswonninis re 28 Sy age HOSA Ie eA Sa"
    },
    {
        "image": "syllabi2_synth_13_aug3.png",
        "label": "syllabi",
        "ocr_text": "CHEM 301 SYLLABUS Central Philippine University Deparment of Biology Organic Chemistry HINSTRUCTOR INFORMATION WME Ass00. Prof Robert Owens Phone Number (483) 828778 Ofic< Location: Room 438, Research Big E Mail Addons: ancrew sice ureersty eau ph Geneal Course information Core Ca CHEM 30a: cre.) rem CHEN 01- Cena Crreery COUPOSTON OF FNAL GRADE ache Barina: 2% (ome 19% an ra ea 10%) (seers Petomaren 0% (epee apres pasta ea) Prien Sk: 12% Wamoy Ronen age eaten mecanene assem (cae 1 Sr gaan ateneng ng recat sce (ners Noman pw Goonies ae Re aS Tox 10%, WW. Goure Reguineneats COURSE REGUREWENTS: Testi “Orarc Crema” by Pasa Boe “gate Cis yom ky (1, nay 2 Monod Mot Reires r ssanary tre arirtons snctres nd rey 23 Lary Mana: Oeprrneraaued a mans win epermres root asa sores |< Sy gsr Lara om. ay ary, eso et equ aa care"
    },
    {
        "image": "syllabi2_synth_13_aug4.png",
        "label": "syllabi",
        "ocr_text": ""
    },
    {
        "image": "syllabi2_synth_13_aug5.png",
        "label": "syllabi",
        "ocr_text": "CHEM 301 SYLLABUS versity itippline Us Mire’ sgese, Pek Ropes Coes x or i) wae Tne iaae lon Regen 2, Ressoeen 2p ‘Tecan aise oxrremenestny erga ens; ouley our eg nem, Gseenrery cauins aieyeie carpi antssine Sete ao mpnrenon wasn Seeaane 4p Came RSPR CaaS RAS A DURE ERATE, casi sonemauinuates sya enecgae Eaten mates means ge ONSTAR 1 counties alu \\vneny mann attra arses asoueice aye casas Sar pane sens arsrang aon ce men soinea “ong 2 nesuar nae Se mega 4 oe Squeeze em ay aga 2 otatD Ks e SN RRE"
    },
    {
        "image": "syllabi2_synth_14_aug1.png",
        "label": "syllabi",
        "ocr_text": "SRUETOR Wecee: ‘See Cois eaam: yang ‘is soe ene ‘eoueaorca Or rave aeace ‘exam Revere a om Braco a 4. 8 mae ya maar ies seument Sena sesuesawtis SRR Ronee 1 Sekine Sta eaepiee my 8 Mogg incest a9, Rut exten aro ©S 207 SYLLagus University Gaego 6! Secoatin fa Structures and Algorithms aad Pea 02 Bee aesames Soran waza Came ote tes BA ten man a te"
    },
    {
        "image": "syllabi2_synth_14_aug2.png",
        "label": "syllabi",
        "ocr_text": "CS 201 SYLLABUS ao State Universi seg of Escravion Sala a cawes and Algoritinys sineTRUCTOR sayz ere saa Toss ch IN. SE RE 2. EO arvrmagonins amcrenyy near Se ingame am cnseaw rc9 YONG logan ovimmesionion eae engage nnen sew ioes saagiranne shot aaa 28 crane a vag raps ota vaio: 2% -Senasie nan anaime hess gts very ages 2 lariqieh Soh Parnine pasesonse ee Hoey ony ue AACN scree Someta cage Wy Conn sgoptroe uh es aoe reais neem ny en Brame"
    },
    {
        "image": "syllabi2_synth_14_aug3.png",
        "label": "syllabi",
        "ocr_text": "6S 201 SYLLABUS Minganao State University Cateye of Eeueaton Gala Sinuclares ane Algorithms nas sey By *ii8S. Seon Sexton eo: Me Sour Cra tat coven cc 00194 etic Hae EonUaHNRE C8 Eom SYNE Tesonete nahin seem hast Sar ET Asa rE I ROE Sparen mic grny Yaseen ry SHER SB AS Te FAT Oe MN fersuyeguins WEG OE BAR ARSE RUSS STENT gt ew ayes mee MG AE 80. Sanewuina tele Paitin eouBeT OF FA. SAE scene Raper 298 Comrennson mast sa ita a an NE ‘inv Cinco SE Comsabe a an re ga eRe aD, ent srgamnycroten: 2s hes mk aemonreneDarUN am NEIS THIEN {aay Snr 1 wey aya a NES ous sents coumsaAE NNT, ‘reine Seeaenun an age’ some saan Ros 2 Ren ein ee Yam A $89 Cw BE a LL NE, 1 Seas seater re asa ea pew NY OER RE «Saga nam i eR niet CT RUNNERS SE TIE"
    },
    {
        "image": "syllabi2_synth_14_aug4.png",
        "label": "syllabi",
        "ocr_text": "GS 207 SYLLABUS University canege of Educator Mincanao Data Structures and Aigorithins, 2UCTOR INFORMATION Neondisoninwety 0 ncse coe 55201 es Sta MEMES CS HO Le pT Oh xnernil pen raeemgagrars anions propewnnyeee sie Foe na geese copansing magpeare ast"
    },
    {
        "image": "syllabi2_synth_14_aug5.png",
        "label": "syllabi",
        "ocr_text": "LABUS OS 297 SYL Mindanao State University caikage of (ata Structures and Aigorthms a ORMATION py gtodonars sa nde wages sats we rss qe Pee YAY ATBRINTS oes ae FOO fesseejageare 207 Spunpesa unieagenen eens NBER mf vrnansy sae Conant oMapjSTs. NTIS OES Oae SEST secre 05 ENS ENESTGEA BOI EMH HESITATE ve sgecnorseneenge sajaneigovoane oh cpowiin eat caee ON aR ZUPANOR REM FGREPRT AEST fp magnscto ceri 2 XEN aoa tui ae eR"
    },
    {
        "image": "syllabi2_synth_15_aug1.png",
        "label": "syllabi",
        "ocr_text": "MATH 301 SYLLABUS Mindanao State University Cotege of Educaton Linear Algebra INSTRUCTOR INFORMATION ‘Name: Prof, Emily Cole Phone Nome (483) 676 428 0512 Office Location: Room 361, Research Bigg E Mail Adres: matthew sanders unwversty edu ph Genera Cour infomation (Sure Cove MAT 301 Creat: Sum rete: MATH 201 Caouns (W. Gous Reosinemests ‘COURSE REQUREUENTS: |Request\" Agera a pst Data oman ate) 2 Sperry Mana: re esarces a vos cre pi on any mayen seen 2 Cota: Some yap acuity tr compan nor (ToL epee) 4 Sater MATLAB Pyro ne Nay ryt compat acer"
    },
    {
        "image": "syllabi2_synth_15_aug2.png",
        "label": "syllabi",
        "ocr_text": "MATH 301 SYLLABUS. Mindanao State University College of Education Linear Algebra LINSTRUCTOR INFORMATION ‘Name: Prof. Emily Cole Phone Number\" (83) 874 828 512 Ortce Location’ Room 201, Research 8g E Mail Adis: matinen sandars unversty 28 98 Th Gane! Cour ormation (course ose MATH 31 Cress: sus rerapstes MATH 20 -Cacuust ‘Tis casero near oe nen agualntugsstns ne eens, mares, cerns veer sues nex Yastrnaions, gevaies ma eganectrs, da7OxRaIy. Te case engruszes on peica wnesing a raca alesis mses ewNee 2 comp seen ‘Composition Folder Ponain ‘Mar Exit: 30 Cor mae. emia, eco pce, anda ants ‘rat Examiner: 3% -Comprennsve ex enprasang agenaues agenesis armas) Pre Ss 2% Was nomnor assigns ning ows and compton pons Praee 1- Appanonprjdonenstanngrea worsect inex aguas (lass Partopaon t Acoveengapevetn asco adidas peter chig 28865 WV. Course Reaurements 1. Request \"UnearAgnra ans Apatow” Dada (Smedtonoiat) 2 Sear Marat Onn recount sac ote nearing marae tn cea: Soto anger compara wrk (Toto eqs) 4 somare MATA Pron Nu ryt compton ase"
    },
    {
        "image": "syllabi2_synth_15_aug3.png",
        "label": "syllabi",
        "ocr_text": "MATH 301 SYLLABUS State Universit ApgureeTen wise avpornand saver a wise Penge ORIN HA GR AEG A SIGE ss ney owe"
    },
    {
        "image": "syllabi2_synth_15_aug4.png",
        "label": "syllabi",
        "ocr_text": "MATH S04 SYLLABUS Mindanae State University coaieye at ESUOREON Linear Algebra INSTHUCTOR AIPORTATION ame Beet, Say Ge, Re weecese2 “Room 331, Reseach seen 28 thee Nabe Pract aes canton. koestBY i Gralcenetaacae canna son cums Hone eens ATH payor nee IAN I ETS MSE fon rasa Te rae pearoestan apna BORRENYE eo AN SETS ITP sre toene ee yee eI HR Sener 6 ‘senpow wie is, reset atta cauerrigs OF A ASE esta i Sree ST STA EE sures ee pont Ye COMPETE LE SARE TEES estes ue UP eens pa OT ere eR BT te te apa peers on sas Ae EEN AT san ix. Sew ssa evan SeaSREHEUTY vaaapeeson war NYSE HES ATE ppb egies Ree \"enn nse peRgOMERT H OUP IES see apn NaF EF RASTA ATI guns 8 eee bn CRIES enews"
    },
    {
        "image": "syllabi2_synth_15_aug5.png",
        "label": "syllabi",
        "ocr_text": "MATH 301 SYLLABUS Mindanao State University Cotege of Education Linear Algebra “INSTRUCTOR INFORMATION ‘Name’ Prof. Emily Cole Phone Number (483) S4828 959 en: Room 394 MM Comptia Fld Ponty COMPOSTON OF FNAL coe Mawr Eamiton 308 1%. Coupe Resume"
    },
    {
        "image": "syllabi2_synth_16_aug1.png",
        "label": "syllabi",
        "ocr_text": "BA 401 SY Carlos, Scho! of Enyineasig LLABUS Universdy of S. course sae 8S ons Dt eee NA) naw gener SA Manages sons sone nora. ep mana Tipmarsin seareegcemne cers seatuntle ea Sian ar Begs a Comgranene tag a Fea Baroni Bh Care Ye aE PONE BS TAI CG ERIS ‘arenas Gan eeaeanomicasregtN see LERNER seta 1 Rug neater essen anes owns"
    },
    {
        "image": "syllabi2_synth_16_aug2.png",
        "label": "syllabi",
        "ocr_text": "BA 401 SYLLABUS University of San Carlos Schoo! of Engneemg Strategic Management LINSTRUCTOR INFORMATION Name Assce Prot Lagan Sa Pre Nembet (083) 02 290 2510 ‘Onice Lovanon Room 491, Researen Big Mal Addo mara granam uwversty 68s 9h 1 Tectaot Srage Maragrert Coreg Cae res Davee Por Ot 2 Cae Suen marae Bawa Soas cat as Pgs Sue aaa ey 3 arene Pacis Repu raary 2 oar re Sarat Prosar Baas"
    },
    {
        "image": "syllabi2_synth_16_aug3.png",
        "label": "syllabi",
        "ocr_text": "BA 401 SYLLABUS University of San Caries Denoo! ot Engreesng ‘Strategic Management MNSTRUCTOR INFORMATION. See Annas Po Lon 2, ase Maat 80) 2 30359 tee Unc Room 48%, Rasench By EG A natin gonaaieen ty a8 oF Me Aerdtoscs tment ‘oar De Baas Gee em LB Pees anaes SM, wn msmare arr tog ne rm fo es Seats arr Nag TE pemee macnenon Tied coumenanens ew 3 Eig PRIS WS Spetrean. pscraysnoes aaraya moycesn casey Hee oO ML Corser Totes cowcamon ce race once Poa orn Rantrane de emprmmeve baa ROS enpoR Mee NE heme ea TN ee MBAR oN WALA MENTE vat easing: IR Cewmwan en ear ging: neyreRt mE BITES chetrmserae th Uae metare eae hemm one amg mS nna ee Wey oan ne MUI MUNN ran Gere Rawingees ceum erases: 1 noe me ho agreet CaReR a Cale oy Pel oarc a Pome Dae 2 Ce mate Farema Cuan Cos Ban am PR, DU am (9A NER 1 Deena AbeSOM eps neg isan ey aM ie FEE Re NE moms"
    },
    {
        "image": "syllabi2_synth_16_aug4.png",
        "label": "syllabi",
        "ocr_text": "BA 401 SYLLABUS University of San Carlos Schoo of Engineering Strategic Management LINSTRUCTOR INFORMATION Tame Assoc. Prot Logan Smith Prone Nomber (v6) 002 202 2510 Dee Location Rom 491, Reseach Big. EMI Adres marcus raham unversty atu ph Gonsal Coue nrmatin course Case Ao rei 3 Prequees: BA 1 «Prana Marayenie. B43 Mareetg Maapreet “Tue capstone care rages mows tom revs nase caress arene sage maT ‘Poon merges. Tc cu eNrornert CRTIG, Fa) SIO. STAT) Froemetanon an eta coe. Sune we rayae cite des of Pps rs rs ‘Compostion Folder Pil ‘COUPOSTION OF FNAL GRADE: ‘ra Sramge Pan Prec 39 Compre sraage anny ans pan Wee COMERY Mugu Cas ry: 275 Ween nay of 5 buts cate Wm Sage recaMeNAON rr Bainter 25 Comper cong Hage MINEO COCR TENTHS cave reser 1 ep reves aang Sa CRs AIEEE au Auger: YON Reps ate Dts ar sraage EES ‘ra 00% WV, Cou Repaiats ‘COURSE REQUIREMENTS: 1 Tecmnac “Sraage Manageme Coc ad Casey Prada nd Presta (et corey 2 cae ates Harare BuSnest Sos cna and rire aes ae AFCO ea) 2 bats Pisco: Rega renag oases ns (Busnes Ppa Sa Bes secon"
    },
    {
        "image": "syllabi2_synth_16_aug5.png",
        "label": "syllabi",
        "ocr_text": "BA 401 SYLLABUS University of San Carlos Serco! et Engram Swategec Management INSTRUCTOR SNFORMATION Ve ones Pot tase Se tro Neer (ee) RE Dict emma, hese EXE Sova panmabeety me aah ce aba ne Soares Pt tosaenamadatin teat ease FM ONO faa pea REN CONANT ON REIN NECN ene Cae BP LOM RANE SEL AO OEE IES poe Ramte Ps COM COO RT OE ANAS TIT, can reese NC PENBLS FLYER AE ME ETS een Meigen ge 8 NGS NO om W. Cece tecn conn REDERONENTS asa “Drange apa on ‘ema mutex tare Boar ard 2a a Ge TEN te AN ES acim Fier nee rena He RY creme 90 aE 88 AMG OPUS EN 3 dare sascann Mae vn"
    },
    {
        "image": "syllabi2_synth_17_aug1.png",
        "label": "syllabi",
        "ocr_text": "MATH 301 SYLLABUS Mindanao State University ‘cotege of Edueation Linear Algebra INSTRUCTOR INFORMATION Rome Assoc. Prot Holy Newnan Prone Number (+83) 008 045 742 Ostce Lorton: Room S87, Facuty Bi f Mall AGUS: ye santos Qunversiy €82 h Gensel Coun infomation cose prs St 25- Westy Mann ears eG PO tra nO 8 MA STC prtpanon Po AcaveenppeTetn SESS 2 H FEDER ST pret: 1 pation eles WW, Coupe Resuaments (COURSEREGUREVENTS: {unequre Tet\" Lar Moira as CEN DIL (AGRON A) ‘npr sree ache ne TG EIEN YOST caer sot cr aig eS fF CONSE WOK TB GAYE) “soneare MATLAB ot Pye wih NUP HY fx COTO SATE"
    },
    {
        "image": "syllabi2_synth_17_aug2.png",
        "label": "syllabi",
        "ocr_text": "MATH S501 SYLLABUS sniversily cokege et Mindanao Stats Lingar Age! LINSTRUCTOR INFORMATION Som Assoc. Pf Ht Nevis hom Namive (oe2) eee 72 ice Leston: Fern 957 “ee snore ran aa ee spa tag sen ea eRe ess, ssa sane oes sans, yen ezanenesers eam. 8 Sur easing MN aT NAN RG ee EAI CR RES coy ncn aca ee Pras: oh Aemngse dances stn esau eines Squracos ue seeatan fe sede Bgambamtineloe ring 28S nara tunes gers ee Ae 2 spseramyuateas ile HB BIN ACUI We NRL HR Tota Oy pat oon SMO"
    },
    {
        "image": "syllabi2_synth_17_aug3.png",
        "label": "syllabi",
        "ocr_text": "MATH 3014 SYLLABUS Minganay State Linegr Algebra corres ne MT et cra: ue Soe eaR HATER ‘ne sareahtnicestreanerta creas Oty Sgerdoeesig Re Ha ee theremin ena yin, ans, anton er ee 2% Wey mur seperess ne tpg res ecnoraeg aac cuss aren Re eave gram mena Ssepaes Tet \"e mgewaane a naan wena enseN eae)"
    },
    {
        "image": "syllabi2_synth_17_aug4.png",
        "label": "syllabi",
        "ocr_text": "MATH 301 SYLLABUS Mindanao State University College of Education Linear Algebra INSTRUCTOR INFORMATION me Assoc Pot Hay Newnan Pane Number (483) 908 048 872 Otce Location Room 557 E Mall Adds: tyler santos ureesy au hk Carve cane Mare 31 39era Ty Sens tine eine ace artecrecan aN FEMI gira aaegmears soa Spar oon ore aga epeaton mice poe oe comae ssee M. Compstion Folder Ponty COMOSTION OF FNAL GRADE, Maem Barna"
    },
    {
        "image": "syllabi2_synth_17_aug5.png",
        "label": "syllabi",
        "ocr_text": "MATH 204 SYLLABUS Mindanao State Universtiy uhage of Esucasion Linear Algebra snustaucToR mroRuaTIO Soure coat PtH st Sree Soe rey RTD) DanSP ‘Terasaa nea “etre emma tie agerainsany fn atone egy. stern, 9 ars ee TaN, A ae Vppween ERNE, Te cearsnenanze tot burarea sins aac Ma nie en Mi Caameatoa uite teie oouroaeTn oF ee Nie se enn 2 er CORSE ch aN Ae Pc Pre Eiannaiss i tengreononenr ac IR EN aT EOS Picea oe BL ey peer spear Ne and come eT Pry ene een ee tha Rg ‘tas Peeper Den sre GE MoO Ween ES WS. Gare Resumen: cove msuReeNTS Renae Tete geno Aas waa Shahn es} 2 supremty ak Sires a acre pa ein nem He 9 Cassin Saher ess coadHONE ERTS MELEE 4 tmene Homa Rem AM ery eoipeat at Ree"
    },
    {
        "image": "syllabi2_synth_18_aug1.png",
        "label": "syllabi",
        "ocr_text": "BA 401 SYLLABUS De La Salle University Department of Mathematics Strategic Management LINSTRUCTOR INFORMATION Name\" Asst, Prof, Hunter Lang Phone Number (+83) 908 170 5125 Ortce Location’ Room 287, Admin Bi E Mail Adress: tary wrght unversty edu ph couse cose So ress Suns Prensstes 84301 -Fanca Mangener 84 32 Nareing Maragenet “Tas caps couse may skagen preva Sess couses examin Srataje M QETE posessesincrgatzatons Toss nsute romana Soang aay OmUaton S35) Implneraten acraage cua. ets wl 3 2e cab cses Puppet ‘Composition Folder Ponain Prat Sraugo an Project 25% Compre erage mayest steed company Msn cab rays: 20 rsen nyt spe cave sraage resonant ‘rat Exar: 2% -Comprennsve exam covering say manager cogs au FaneHS (cae Pesaraions: 14 Group reseanos ayn cates and eng reconmensons au Ase: 1 Regd cove ics ausraage mayss meses 1V, Cour Rewcmenta Tespose \"Seago Maragene Coens a Cates\" FresDaid a Foes Oai (test 2 case utes Harcrd Bess Seon cases and Pppne nses abs (rca sey) 3 susnes testes: Raia rengt anes ens Sunesiord Pie Starrs"
    },
    {
        "image": "syllabi2_synth_18_aug2.png",
        "label": "syllabi",
        "ocr_text": "BA G1 SYLLABUS e La Salle University Department of Mate roseeee Fogeseaien onset ern pene ae ote eo sean 274 whneranneeo seepmoansowe catenin aosenerecomnanin ig stange ano sanipe me eaNe a saving nen Replace as eds Ste me I RIN eS"
    },
    {
        "image": "syllabi2_synth_18_aug3.png",
        "label": "syllabi",
        "ocr_text": "SYLLABI De La Saile University LICTOR INFORMATION Somes asst Psd Haar ae fie Nae (08 5 ra BA SF Maen. SA I A Ts aso oct tinea? esos nas opts mons Ae ma nero 9 Sees eranyereowneneen nonin Season ITER camtonanainn 1 Grug asoneao maverqusines cea ws tena ean Sak AR nin Ne Reg eter ems E OS"
    },
    {
        "image": "syllabi2_synth_18_aug4.png",
        "label": "syllabi",
        "ocr_text": "BA 401 SYLLABUS De La Salle University partment ot ateratss Prone canon Room 267. Aerie BAO, QIN Aaies: fany wegreeonrer y Gera Couns formation carve cos 84 01 cre 31 axogenet pn capnere corse nT pe non erro oom nop Popenertanon a mI Prague perme a oun 30) -Pranca argent A 2M nes sag oa eT ST Tass Prise"
    },
    {
        "image": "syllabi2_synth_18_aug5.png",
        "label": "syllabi",
        "ocr_text": "BA 464 SYLLABUS De La Salle University apecinent of anemtet Sisategee Management ae, mages 3EF A Be ragneoery 685 Entel east: etiey Me eau ieee cnvnnenn 4 C9 SOB FEL A REIT A ATES pause donne encanta om scien perom Daten coven OTN A dS ST Far Top uae OITA TY 2G II STS OS ess ste AES PERERA SEE O Pa stn a coumcereni cr PRA SRA farcry mange Coreen AAS SCR apes act ot AN SEES anaes tect BEE ore ce ss 2 rm a err mene So EE ines cae A OMEN AOS mersorenss 1 Gre etanupar ae ae aegis Oe SARIS REE SEE APS ANH E EM vase“ mg pe RECN Hs FIONA ANE FE I EE cage hste Hprp CONES SCR TH OOADI NENA AR AER ARTE rane gSASCORHTE STN NOTES 3 seems ate gH NS"
    },
    {
        "image": "syllabi2_synth_19_aug1.png",
        "label": "syllabi",
        "ocr_text": "ENG 201 SYLLABUS University of the Philippines Diliman Deparment of Computer Science Philippine Literature LINSTRUCTOR INFORMATION RIDE Asse. Prt James Mache Prone Noth (88) SSB ST Office Locton Room 519, Amin Bp EM Adds chery ews Quest) 2 ph Wns Cou information (course Cook 246 201| Cres 3 us| regs ENG 12- Acai Weg “Tas carse rvs Pigone ieatre t pec test canenparry pe, xan wasn ros geves cus poy fen ana, ad css. Ses wil nay ery ss we, ra, oc crt, erg ee oer, coal, a joe ‘Toe coreeenpanzs ca eng ear anys and aprecion Ppp ry tates. N. Composition Folds Ponaia COMPOSITION OF FNAL GRADE: ‘Mar Bcamitn: 20% Bay exam on recs Aenean coma perosinenet Prat amino 20% ay exam rtenprary Pug rane sma Peet Resear Paper 30%. 1 12papearayca pa onset Pipe ry norte (Dery pry aye 19% Tree er paper ayy spect acortest (Cas Presets: 1 Grip pestatonen siesta pers ase Patopaion ani Ducution SN Ate agement ss SSE a ae WV. Couns Reaunements ‘COURSE REQUAEMENTS: |. Requred ogy: \"Pipe Leahey an aay by ewe Lb 2 stecad Nova No Me Tangy Jose Reza “Sale an nate Cle by FH. Baan 3 carsePacc Coco tpoens, srt stares, essays (aalase tbote) maser Reson: oc ray ass trary cee aay 68"
    },
    {
        "image": "syllabi2_synth_19_aug2.png",
        "label": "syllabi",
        "ocr_text": "ENG 201 SYLLABUS University ofthe Philippines Diliman Department of Computer Science Philippine Literature LINSTRUCTOR INFORMATION Name: Assoc. Prof James Machel Phone Nbr (665) 9801648737 Ofie Location” Room B19, amin i E Mail Ads cheryLiewis universiy edu ph Th: Goel Cour normation couse cone ENG tt |cress: Suns] Prensa ENG 12 Acaemio Weg ‘Tas carsetarvys Pippen ton precio Ses ontop pete exaning wasn ‘aos goves nag prey. tcen ara a essys. Sues Ml yz ery as WINNS, ora, asada crac, xs eves dey. rseale, cova Osa Se ‘Toecoreeenpaszes cra eng rary anys. and secon poe ery taste. ML, Composition olderPontilia Mar Exeter: 20 Esay xan npre ouera' Anercan clot peroainetre ‘rat Exner: 2 83) exam on conenperay Pippen amar ees Rese Pape: 9% 10 120ae raya pane on sea rin ary work amor rary nays Esa: 15 Treesnat panes yay cpt tacs ancora lass Pesos: 10%- Grp pesetatonen siesta peor aie Pacpston and Discusion Acne egagenertn cas scisins anaes WV. Course Reaurements |. Reques Amaiogy Palppre rake: AMI an Anmogy by Seerco MDE 2 seleeaNoves NaLMe Tang’ y Jose Reza \"Sale an nate Crees by FM Baan 3 carse Pace Cotecsoctpoons sat stares, essays (aalase nosis) 4 Resancn Resouces: oces ray tases tr ery ceasem ascrary aes"
    },
    {
        "image": "syllabi2_synth_19_aug3.png",
        "label": "syllabi",
        "ocr_text": "University of te Py Phitippine Literature sagTRUCTOR INFORMATION kam BAG Ghee Hawn 293, Sen iy pone oP esa 2 MG BH Ce ‘reese er tN Rr gave nts reac a waa SOME cnacovegsngrsnes x He Away SE IPRAES. seven Enid Dutt Ln PNA vege exe en nck e AE PTSE eves icine SMENESE] POE ONS SS oe ap eS NH ETS LTS es IIT, ATES TE ergy EE i, arn Sh Oj NAA TTT erage own eon ne rte eo EIA. on prt sesso ea: 2 song ry SOR gry kn Cg 1 TO genres eee on nse TRH crag enti he sarewegeetes mtspemn acre Wy aucune craps ccep er sagem aince 1 4 Regan eh ny nd ey TOS SID sons en CHET OTS sey so NOTES"
    },
    {
        "image": "syllabi2_synth_19_aug4.png",
        "label": "syllabi",
        "ocr_text": "ENG 207 SYLLAB ofthe Priiprares b"
    },
    {
        "image": "syllabi2_synth_19_aug5.png",
        "label": "syllabi",
        "ocr_text": "° sive Bama nes Bs 1 Tne oes me ny ais toa re vnigey"
    },
    {
        "image": "syllabi2_synth_20_aug1.png",
        "label": "syllabi",
        "ocr_text": "BA 401 SYLLABUS Ateneo de Manila University Department of Information Systems Strategic Management LINSTRUCTOR INFORMATION ‘Name: Dr. Faith Willams Phone Number\" (+88) #25 5842610 Office Locition Room $82. Research Bigg E Mail Address gen patersongrwersty edu ph ‘Gsoaal Coun information Corse Coo 84 01 Cre: 3 Preequsis S401 Panda Mangere. 84 32 Margtng Maroy ‘Tas cope couse yes rege Yom revs bane arses ean age nape processes negarzzios Tapes cue urea Sang ay WU SY mpeneraton an craege coma, Suet wl 228 abe ses Pippen MK, Composition ForPonfain CCOMPOETION OF FNAL GRADE: ‘ra range Pan Pret 39% Congreve sraeye mays pany seedy ‘wate Cave Anny 20% Write nay ct acer oss case wn erage reconmentons rat arena 20% Compete ea cong srange maageneT oreers stamens case Presets: 1 Gaertn ayy ures caves an etengeoonmenons east Ages 1 Regier caseanes an sage Mayes erat a 1005 WW. Coupe Regimens |. Tesenac Saage Maupene Coren an Cases by Presa a Fret Oa ast ena) 2 case Sues Havanese Sr cae Pp bus caesar esa {ews Pues: Rags reaang ness ens (unasWoris Pape Sx ness eazy"
    },
    {
        "image": "syllabi2_synth_20_aug2.png",
        "label": "syllabi",
        "ocr_text": "BA 401 SYLLABUS Ateneo de Manila University Depoarent of Infor St agic Management LNSTRUSTOR Ps FORMATION lle Loceos: From Sa Ete) naciew: arn patteannmosweniy ah Me Saeco Couns tarmsion corset 8408 ores ame PmoRE SADT. FoR AEE aay Secaagecee “ree upenmu nari nga imag so cae ens craton RecmeR arse pomeranian ee MSNA OH SDE ENE TR, eamaraim snag oath NSN A ath EMIS a ET ‘Suomi Ea Paiate couse oF aac sane Pra range ing te Commnranca site nye nda cae ITs Sto cme ans a an mur epee cane pT ear a Bans PS Copan th seagrass Rt Te RO PRNEEE coe rete Fk ome pana smitten se as tint eer asc ASE 1 Sag ewe eh an age RS Sa ne 1 AV, doers swims course eeu, Tasnee svangoutmapener Cavute wnat y Arm Daeg natreG rt way 2 CHASE Hance Bane Sih Ste ea MTORR ENA a GRE HES) {sores Pusnee Noae ecarg ates ee siesest PE a BSNS"
    },
    {
        "image": "syllabi2_synth_20_aug3.png",
        "label": "syllabi",
        "ocr_text": "BA 401 SYLLABUS ‘Ateneo de Manila University Department of Information Systems Strategic Management LINSTRUCTOR INFORMATION ‘Name Dr. Faith Wiliams Phone Number (#83) 822 584 8610 Office Location’ Room 592, Research 8g E Mail Adress: ern paterson unwersty e u ph (Gesea Cousefostion course cote ress 3 us| Perens 84301 -Fanca Mangere 84 32 Nareing Maragenet “Tas apse couse ay aes awe rn preva Sess couses examine Sree m= pocssesinrgazatons Tos ince eiromera Soaring Yaa musi Se) Implomeraten aera cae. hots wi aa 2e cab cides Puppet ‘Composition Folder Pontalin rat Sanyo Pan Prec 5% Componente sraaye mays dpi seca compay Mrm cas rays: 2% rsen nyt ssn SSS case WM Saag ese rat Examiner: 20% -Comprenensve exam covering sry manager cores au Fans (Cae Pesaran: 15% Grip resets nays cates and eng recommends ast Ages: 1% Regd cove ics ausraage mays ces 1V. Course Reaurements Tespone \"Seago Manage Covers a Cassy FresDaid ad Farsi Oa (est 2 casa Sues Harera sess Sco cass an Piping bess ass (prose a) 2 susness tess: Raglar eng tne ens (Sunesiord Pipe Six Brass"
    },
    {
        "image": "syllabi2_synth_20_aug4.png",
        "label": "syllabi",
        "ocr_text": "Ateneo de Manila BA 401 SYLLABUS University se ea ee Se a genre Fetes opMGHO® Teper non sors ay rman say PRM an eraeye cone owen matte come MM Compton tilde Pong SOMPOSTON OF Pa. orton Create nate eran rea erm mrenenan a Pra Corwen 275 Congres wan, SAK Manet nce ms tanewns Cae Peto. cn, TOEWOI Ce errno raat Ayres 05, OMe Ce es ware way earn, Yo sm, Come Rewsieneats (COURSE RequReNers- valine ee estoy Scone ne eet ease pra 2 Bante Raton: ‘NOE ready one nes (Sam a"
    },
    {
        "image": "syllabi2_synth_20_aug5.png",
        "label": "syllabi",
        "ocr_text": "BA 401 SYLLABUS Depanment af Infomation Systems Strategic Management NINSTRUCTOR INFORMATION Sims! Dr Fath Willams Pane Numer 989) BEE S26 Due Fatou Room £92. Reseach Bag EsMal \\Stios gen paterson unversty eau gt SADT Cas Dune etait £4 01. erata Uaopenen SAEs Misgever ‘Ts abo onsen tas see ton pei ares castes Weaning rane orssesinrgasatons Tones mee arena teary saa Ornelas ey rmpenetsion sesrangs cota SLoets wi mayzecaeetuteedOnipane soe ceo ra Sraage Ran gat 3. Conmenewieersege mays aniganty sewcessonany Saw Cane anayss a0 rnin nays segs vat ate wn srzage ere Fa Examination 2 Connie cuan cour trays manger ones metas ose at eng eon menae novo ssegrien (4 Ragu catemes meraige mass nieces Tesoro “Srgage Mangere Coca a Cat\" Sre 2avdae Festa 3 Sunness Suan Rays enone (Besos Pag!"
    }
]