[
    {
        "image": "terminal1_synth_10_aug1.png",
        "label": "terminal",
        "ocr_text": "ge May oa Coastal tmny Little Senry beaslay mrenting Vee: i Beta Sg aera istainaby ntot awareres. among university foo Stare prow ting cr vnenial ipgres be OO ENED IES ML Conducted Fecueation The stidy surveved nee Necuhy HOSot mertews wth eve HGH TION feadets ah CaMptts Sustaiiabity cones tars Eindin y SUES 2MON Fy ne Phiepinies Howayer the Ge adh mpact oF SUCK aS Waste GENERATION, er demuristrate now Ss amplementavon of sustamate bebavions NES sures sul gy cor aospartatan cern neons eciMtaves Wi ledIng gree PufAInG prea ties tant f grQuips. Hutadie prac! su pies min unversty cunwita <3h es chide dhe tse anon of etre iy aus y Fecotene cr anens einpns Pershing veith Kee at aoc crnmens anes ict SIM -be sed Revionoenial proms KL nent 8 Noy HI te Hteoraton of coywonnient Provision ef mit eran s custo Tee ntVe SySteMS ust ene outage ero Meta,"
    },
    {
        "image": "terminal1_synth_10_aug2.png",
        "label": "terminal",
        "ocr_text": "— University of Sento Tomas | TERMINAL REPORY Committee Study Title: Climate Change Adsptation in Coasta! Communties Researcher: Penny Uitte, Shury Bossiey, Crystal Russel, Gonaid Sparks Implenserting Agency: Prtepion Counc or hgricute, havi ai Mane Resources Duration: December 2023 Marcis 2025 1 Bacontive Susewary justamnabilty practices and environmental awareness among university concrete Mento. pevidng critcalimaghts no the Currant state of meen Consciousness in Philippine higher education. The Research tr! Oeuetopmant PCARRD) BUPREMD U6 Ehictineg : Page ae Cotomer 13, 2025 tor Rev22 ae"
    },
    {
        "image": "terminal1_synth_10_aug3.png",
        "label": "terminal",
        "ocr_text": "University of Santo Tomas Graduate School Research Ethics TERMINAL REPORT Committee Study Title: Climate Change Adaptation in Coastal Communities Researcher: Penny Littl, Sherry Beasley, Crystal Russell, Donald Sparks Implementing Agency: Pnipoine Counc for Agriculture, Aquatic and Naural Resources Research and Development (PCARRD) Duration: December 2023 March 2025 L Executive Summary This research examines sustainability practices and environmental awareness among university students in Metro Manila, providing critical insights into the current state of environmental Consciousness in Philippine higher education. The study surveyed 2 500 students across ten major universities and conducted in depth interviews with environmental science faculty, student organization leaders, and campus sust tainability coordinators. Findings reveal a growing awareness of environmental issues among Filipino youth, with 78% of respondents expressing Implementation of sustainable behaviors nergy conservation, and sustainable transportation remains mroensistent. The research highlights successful campus initiatives including green building programs, waste management systems, tree planting activities, and environmental advocacy Campaigns organized by student groups. Notable practices include the integration of sustainability principles into univ BU F RDMD 06 Effective a ~~ ~ ~~ Page Tof 29 October 13, 2025, Page tot Rev23 wee"
    },
    {
        "image": "terminal1_synth_10_aug4.png",
        "label": "terminal",
        "ocr_text": "Graduate School Research Ethics Committee University of Santo Tomas ‘TERMINAL REPORT AIS oastal Communities sell, Donald Sparks Natural Resources Research and Dev imate Change Adaptation in C' Little, Sherry Beasley, Crystal Rus: prappine Count or Agree, Aquate an Study Title: Cli Researcher: Penny Implementing Agency: Duration: December 2023 March 2025 1 Executive Summary selopment (PCARRD) This research examines sustainability practices and environmental awareness among university students in Metro Manila, providing critical insights into the current state of environmental consciousness in Philippine ation. The study surveyed 2 500 students across ten major universities ted in depth interview: i ity, student leaders, and campus awareness of ‘environmental issue: ‘concer about climate change and its i hilippines. significant gap between awareness and actual sustainable practices In daily life. Whi demonstrate knowledge of environmental concepts, implementation ‘of sustainable behaviors such as waste segregation, energy ‘conservation, and sustainable transportation remains inconsistent. The research highlights successful campus initiatives including green building management systems, tree planting ‘activities, and environmental advocacy Ne practices include the integration of .¢ among Filipino y' impact on the PI However, the study identifies and partnerships with local gov he need for stronger institutional ‘commitment infrastructure that that encourage eco friendly BU F RDMD 06 Effective ~~ $$$ Pa ot October 13, 2025 Page tot Rev23"
    },
    {
        "image": "terminal1_synth_10_aug5.png",
        "label": "terminal",
        "ocr_text": "- University of Santo Tomas Gracuste Schoo! Rasaerch Eshics TERMINAL REPORT Comeniiten oh ue Stody Title: Climate Change Adaptation in Coestat Communities Researcher: Penny Little, Sheiry Beestuy, Crystal Russell, onaks Sparks Imploeseniing Ageney: Potcene Couto Agree, Aquaie ans Natu! Resources Researen anc Oevmapee (PCAARPO) Duration: Qecembar 2023 Match 2025 i Executive Semmary ‘This research examines sustainability practices and environmenial awareness among university students in Metzo Manila, providing critical msights into the current state of environmental consciousness in Phisppine higher education. The study surveyed 2 500 students across ten major universities ang conducted in depth interviews with enviconmental science faculty, student organization teaders, and campus sustainabity coordinators. Findings revea! a growing awareness of environmental issues among Filpine youth, wih 78% of respondents exeres sing concer about chmate change and its anpact on the Philigpines. However, the study identifies a significant gap between awareness and actual sustamable practices in daily Iie. While students demonstrate knowledge of environmental concepis, implementation of sustainable behaviors such as waste segregation, energy conservation, and sustainable transportation remains inconsistent. The researci: highighis successful campus initiatives: including green building programs, waste management systems, tree planting activities, and eniviranmental advocacy cempaigns organized by student groups. Notable prackoes include the integration of sustainabiity principles into university curricula, eotabbshment of eco inendiy campus faciities, ‘and pattnerships with local government ursts for commundy bases environmental projects. Key recom mendations emphasize the necc for stronger institutional commitment to sustainabiity, integration of environmental education acruss ai disciptines, provision of infrastructure that ‘enables susiainable practices, and creation of incentive systems that encourage eco tersly behavior among students and statf. BUF RDMDI6 Effective ee _ Page fof 29 ome fs Davee"
    },
    {
        "image": "terminal1_synth_1_aug1.png",
        "label": "terminal",
        "ocr_text": "Ateneo de Manila University Institute of Engineering Research TERMINAL REPORT sonst, Management Office Study Title: Digital Literacy in Philippine Basic Education Researcher: Christina Jenkins, Dawn Carter, Ellen Jimenez Implementing Agency: Department of Science and Technology (DOST) Duration: July 2024 August 2025 1 Executive Summary This research examines sustainability practices and environmental awareness among university students in Metro Manila, providing critical insights into the current state of environmental consciousness in Philippine higher education. The study surveyed 2 500 students across ten major universities and conducted in depth interviews with environmental science faculty, student organization leaders, and campus sustainability coordinators. Findings reveal a growing awareness of environmental issues among Filipino youth, with 78% of respondents expressing concern about climate change and its impact on the Philippines. However, the study identifies a significant gap between awareness and actual sustainable practices in daily life. While students demonstrate knowledge of environmental concepts, implementation of sustainable behaviors such as waste segregation, energy conservation, and sustainable transportation remains inconsistent. The research highlights successful campus initiatives including green building programs, waste management systems, tree planting activities, and environmental advocacy ‘campaigns organized by student groups. Notable practices include the integration of sustainability principles into university curricula, establishment of eco friendly campus facilities, and partnerships with local government units for community based environmental projects. Key recommendations emphasize the need for stronger institutional commitment to sustainability, integration of environmental education across all disciplines, provision of infrastructure that enables sustainable practices, and creation of incentive systems that encourage eco friendly behavior among students and staff. BU F RDMD 06 Effective ~~ Page 1 of 29 October 28, 2025 Rev29 Page 1 of 1"
    },
    {
        "image": "terminal1_synth_1_aug2.png",
        "label": "terminal",
        "ocr_text": "Ateneo de Manila University Institute of Engineering Research TERMINAL REPORT jonsioe Management Office Study Title: Digital Literacy in Philippine Basic Education Researcher: Christina Jenkins, Dawn Carter, Ellen Jimenez Implementing Agency: Department of Science and Technology (DOST) Duration: July 2024 August 2025 1 Executive Summary This research examines sustainability practices and environmental awareness among university students in Metro Manila, providing critical insights into the current state of environmental consciousness in Philippine higher education. The study surveyed 2 500 students across ten major universities and conducted in depth interviews with environmental science faculty, student organization leaders, and campus sustainability coordinators. Findings reveal a growing awareness of environmental issues among Filipino youth, with 78% of respondents expressing concern about climate change and its impact on the Philippines. However, the study identifies a significant gap between awareness and actual sustainable practices in daily life. While students demonstrate knowledge of environmental concepts, implementation of sustainable behaviors such as waste segregation, energy conservation, and sustainable transportation remains inconsistent. The research highlights successful campus initiatives including green building programs, waste management systems, tree planting activities, and environmental advocacy campaigns organized by student groups. Notable practices include the integration of sustainability principles into university curricula, establishment of eco friendly campus facilities, and partnerships with local government units for community based environmental projects. Key recommendations emphasize the need for stronger institutional commitment to sustainability, integration of environmental education across all disciplines, provision of infrastructure that enables sustainable practices, and creation of incentive systems that encourage eco friendly behavior among students and staff. BU F RDMD 06 Effective Page 1 of 29 ‘October 29, 2025 Page 1 Fe) age 1 of 1"
    },
    {
        "image": "terminal1_synth_1_aug3.png",
        "label": "terminal",
        "ocr_text": "Ateneo de Manila University tnatavte of Enginowing Moseatch anagemnaat OFee io Stody Tite: Cagial Lactacy in Phipoine Base. Eaucaton Researcinet: Cleistinn Jenkins, Dawe: Carver, Eile Jimena tmpicsentiog Agency: Decartmant of Science are Fecinatsgy (D087) Waratiaw: July 2024 August 2025 4 Peeutive Suoemary Ths research exemines sustainably prackres acd enveonmenta awareness among wAerScy diucdents Metro Mania, rowseing cvlecel wrsagits amo the current state of enewerment2) conse rassness in Phppce higher exhication The strely suveyed 2 500 students actes9 tN may urversi tes avd c conducted widepth interdcws wath environmental scence faculty, student craanzaton ladces, an! campus sustanabity cooenatons Findings reveal a gene crareness of environmental istics among Fétpano yout, wi 749 of responddents express 2 aeaees about eimnate charge atv fs enpact on the Phippanes Humever, the study ssenties nadle practces on daily ie White students sugnicant gap batween awareness 3nd actuat str derons muwonmental concepts wmplementaion of yustainable behaviors ais such as waste segregation, energy conservation, and sustain ante transportation reoncistent, Tie researc hahighls successful campus ingatves including green baiding programs, waste managernent systems, tee plant vies, and environmental avoracy cernpayes organizes by siuden! groups: Notable practices clade the mig 2tan of cestanabity oencpes info earversity cusacida, estabishment of eco frendly campus far tes seal pammerstupe wth focal governvtierd us fox community Dased stm Konmeniat propects Key vecoramencaions emphasize the need for sIFcNKT wis butlonal commément to sustaabAty tegration of envronmental ediscaion acions a ciples, provision of niasti ture that Loerahy enables sustanable piactices, and creation of mcentive systems that encourage behavior among students and staf HUF RDMD-& Ei eicoar 29 205"
    },
    {
        "image": "terminal1_synth_1_aug4.png",
        "label": "terminal",
        "ocr_text": "_ ‘Aienoo de Mania University instinde of Enginaering Resoarch Management Ottice ‘Stady Tite: Digital Literacy in Phitppne researches: Chiistina Jenkins, rplementing Agency? Depertnant Durston: uty 2024 August 2025 1 Executive Seammery ‘This research examines sustainability practices ae TERMINAL REPORT Basic Education Dow Carta, Elfen Jenene of Sclence and Techraogy (OST) awareness among univers and environmental tate of environmental into the current 3 students in Metro Manda, provKkng erdical insights study surveyed 2 500 students across ten coracinusness in Phikppine higher education ‘The interviews wih env science facsity, student smears cmvate Change and ts meet on the PAPEETE ‘sustamabit practices in daiy fle Wide students: signticant gap between awareness and actuat demonstrate knowledge of envirorimentat conces s of sustainable behaviors energy conservation, and sustainable pansportation remains eves including green building October 73, 2025 Rv 2s £063 ail GISCIPHNES, PFOVESIOY ch hightghts successful campus wntatives environmental acvocacy that encourage _ Page Tot 20 Page tot"
    },
    {
        "image": "terminal1_synth_1_aug5.png",
        "label": "terminal",
        "ocr_text": "searcher: Christine Jen OST) nantal awareness ameng university e of environments: fucents organization feaders, and wareness of er in about cl dents expres the study in daly life. Wh fe behaviors port planting activites, and environmental advocacy able practices Inchide the integration of tablishment of eco te ional committnent to sustainabull $, plovision of infrastructure that purage eco fr recommersat infegranor ena behavier amon cation susiaing RDM G6 Fiiecin Bage bol 28 Page of"
    },
    {
        "image": "terminal1_synth_2_aug1.png",
        "label": "terminal",
        "ocr_text": "‘Study Tithe: Digital Lteracy in Philippine Basic Education Researcher: Ashley Gonzales, Christina Anderson, Amy Donaldson Implementing Agency: Deparment ot Education (DepEd) Research Management Service Duration: November 2023 October 2024 L Executive Summary employability of graduates from Philippine higher programs: BUF RDMD 06 Eifecve M6 Page 1 of 29 ner Page tot"
    },
    {
        "image": "terminal1_synth_2_aug2.png",
        "label": "terminal",
        "ocr_text": "University of the Philippines School of Economics Research TERMINAL REPORT Division Study Title: Digital Literacy in Philippine Basic Education Researcher: Ashley Gonzales, Christina Anderson, Amy Donaldson Implementing Agency: Depariment of Education (DepEd) Research Management Service Duration: November 2023 October 2024 Executive Summary This comprehensive study analyzes the employability of graduates from Philippine higher education institutions and assesses the alignment between academic programs and industry requirements. The research involved collaboration with over 200 companies, 30 universities, and included surveys of 5 000 recent graduates and 500 employers across various sectors. Results indicate a concerning mismatch between graduate competencies and industry expectations, with ‘employers reporting that 45% of fresh graduates require substantial additional training before becoming productive employees. Key skill gaps identified include critical thinking and problem solving abilities, communication and interpersonal skills, adaptability and innovation, and practical application of theoretical knowledge. The study examines successful university industry partnership models, work integrated learning programs, and curriculum development initiatives that demonstrate improved graduate outcomes. Notable examples include cooperative education programs, industry sponsored capstone projects, internship and practicum arrangements, and industry advisory board involvement in curriculum design. Recommendations emphasize the need for stronger collaboration between academe and industry, regular curriculum review and updating processes, enhanced experiential learning opportunities, development of soft skills alongside technical competencies, and establishment of graduate tracer studies to monitor employment outcomes and inform program improvements. BU F RDMD 06 Effective November 08, 2025 Page 1 of 29 Page 1 of 1 Rev 3 1"
    },
    {
        "image": "terminal1_synth_2_aug3.png",
        "label": "terminal",
        "ocr_text": "Unrvecsity of the Philippines | (ED) serussatconoicsRevnn loon Division Study Tide: Dintal Lteracy in Phiipone Basic Etucaten Researeber: Ashley Genzsles, Chvistina Anderson, Amy Donaldson: Linplementing Sponey: Depaitssont of Euscaton (Danke) Reawaich Macageient Service Unration: Noventer 2023 October 2024 L Executive Sumaeary This comprehensive study analyzes the employabiity of graduates from Philippine higher education mstitutions ord assesses the alignment between academic programs and wxtustry tequnements The research involved collaboration with over 200 companies, 20 universities, and included surveys of 8 000 recent gradual indicate a concerning misinatch between graduate compet einplovers reporting rat 45% of esh graduates tequite substantia! additonal training before becoming productive employees. Key skill gaps ientined include chiical thing ant problem solving abies, communication and interpersonal skis, scaptatwity aud innovation, and practic at application of theoretical Knowiedge. The study examines successtes universdy indust y partnership models, work integraied learning programs. and curriculum development initiates that demonstrate improved graduate outcomes. Notable examples include cooperative education programs, industry sponsored capstone projects. internship and practicum arrangements, and lndestry advisory beard mvotveinent in curriculum design Recommendaions emphasize the need for stronger cojlaboration between academe and industry. ‘gular curncutuni review atid updating processes, enhanced experientia’ leaming oppurtunties, development of soft skitis competencies. and estabtishment of graouate tracer studies to monitor emplovment outcomes. an anfeurn program imptoven ven F EDARD O8 Fitective leaventier 96, 2025 bet 28 Page tet t Bets"
    },
    {
        "image": "terminal1_synth_2_aug4.png",
        "label": "terminal",
        "ocr_text": "/Z _ University of the Philippines (27) school of Economics Research Division TERMINAL REPORT Study Title: Digital Literacy in Philippine Basic Education Researcher: Ashley Gonzales, Christina Anderson, Amy Donaldson Implementing Agency: Department of Education (DepEd) -Research Management Service Duration: November 2023 October 2024 1. Executive Summary employability of graduates from Philippine higher education institutions and assesses the alignment between academic programs and industry requirements. The research involved collaboration with over 200 companies, 30 universities, and included surveys of 5 000 recent graduates and 500 employers across various sectors. Results indicate 2 concerning mismatch between graduate competencies and industry expectations, with employers reporting that 45% of fresh graduates require substantial additional training before becoming productive employees. Key skill gaps identified include critical thinking and problem solving abilities, communication and interpersonal skills, adaptabilty and innovation, and practical application of theoretical knowledge. The study examines successful university Industry partnership models, work integrated learning programs, and curriculum development initatives that demonstrate improved graduate outcomes. Notable examples include cooperative education programs, industry sponsored capstone projects, internship and practicum afrangements, and Industry advisory board involvement in curriculum design. Recommendations emphasize the heed for stronger collaboration between academe and industry, regular curriculum review and updating processes, enhanced experiential learning opportunities, development of soft skills alongside technical competencies, and establishment of graduate tracer studies fo monitor ‘employment outcomes and inform program improvements This comprehensive study analyzes the BU F RDMD 06 Effective lovember 08, N 2025 page tot Rev 3"
    },
    {
        "image": "terminal1_synth_2_aug5.png",
        "label": "terminal",
        "ocr_text": "University of the Philippines School of Economics Research TERMINAL REPORT Division Study Title: Digital Literacy in Philippine Basic Education Researcher: Ashley Gonzales, Christina Anderson, Amy Donaldson Implementing Agency: Department of Education (DepEd) Research Management Service Duration: November 2023 October 2024 1 Executive Summary This comprehensive study analyzes the employability of graduates from Philippine higher education institutions and assesses the alignment between academic programs and industry requirements. The research involved collaboration with over 200 companies, 30 universities, and included surveys of 5 000 recent graduates and 500 employers across various sectors. Results indicate a concerning mismatch between graduate competencies and industry expectations, with employers reporting that 45% of fresh graduates require substantial additional training before becoming productive employees. Key skill gaps identified include critical thinking and problem solving abilities, communication and interpersonal skills, adaptability and innovation, and practical application of theoretical knowledge. The study examines successful university industry partnership models, work integrated learning programs, and curriculum development initiatives that demonstrate improved graduate outcomes. Notable examples include cooperative education programs, industry sponsored capstone projects, internship and practicum arrangements, and industry advisory board involvement in curriculum design. Recommendations emphasize the need for stronger collaboration between academe and industry, regular curriculum review and updating processes, enhanced experiential learning opportunities, development of soft skills alongside technical competencies, and establishment of graduate tracer studies to monitor employment outcomes and inform program improvements. BU F RDMD 06 Effective Page 1 of 29 November 08, 2025 Page 1 of Rev 3 1"
    },
    {
        "image": "terminal1_synth_3_aug1.png",
        "label": "terminal",
        "ocr_text": "4a Polytechnic University of the Philippines // School of Economics Research TERMINAL, <<. Division Study Title: Indigenous Knowledge Systems in Agriculture Researcher: Chelsea Adams, Eric Young, Kenneth Griffin Implementing Agency: National Research Council of the Philippines (NRCP) Duration: January 2024 January 2025 1 Executive Summary This comprehensive study analyzes the employability of graduates from Philippine higher education institutions and assesses the alignment between academic programs and industry requirements. The research involved collaboration with over 200 companies, 30 universities, and included surveys of §,000 recent graduates and 500 employers across various sectors. Results indicate a concerning mismatch between graduate competencies and industry expectations, with employers reporting that 45% of fresh graduates require substantial additional training before becoming productive employees. Key skill gaps identified include critical thinking and problem solving abilities, communication and interpersonal skills, adaptability and innovation, and practical application of theoretical knowledge. The study examines successful university industry partnership models, work integrated learning programs, and curriculum development initiatives that demonstrate improved graduate outcomes. Notable examples include cooperative education programs, industry sponsored capstone projects, internship and practicum arrangements, and industry advisory board involvement in curriculum design. Recommendations emphasize the need for stronger collaboration between academe and industry, regular curriculum review and updating processes, enhanced experiential learning opportunities, development of soft skills alongside technical competencies, and establishment of graduate tracer studies to monitor employment outcomes and inform program improvements. BU F RDMD 06 Effective P October 23, 2025 meee Page 1 of 1of 29"
    },
    {
        "image": "terminal1_synth_3_aug2.png",
        "label": "terminal",
        "ocr_text": "/ox _ Polytechnic University of the Philippines (G7) school of Economics Research MINAL REPORT Division Study Title: Indigenous Knowledge Systems in Agriculture Researcher: Chelsea Adams, Eric Young, Kenneth Griffin Implementing Agency: National Research Council of the Philippines (NRCP) Duration: January 2024 January 2025 1 Executive Summary This comprehensive study analyzes the employability of graduates from Philippine higher education institutions and assesses the alignment between academic programs and industry requirements. The research involved collaboration with over 200 companies, 30 universities, and included surveys of 5 000 recent graduates and 500 employers across various sectors. Results indicate a concerning mismatch between graduate competencies and industry expectations, with employers reporting that 45% of fresh graduates require substantial additional training before becoming productive employees. Key skill gaps identified include critical thinking and problem solving abilities, communication and interpersonal skills, adaptability and innovation, and practical application of theoretical knowledge. The study examines successful university industry partnership models, work integrated learning programs, and curriculum development initiatives, that demonstrate improved graduate outcomes. Notable examples include cooperative education programs, industry sponsored capstone projects, internship and practicum arrangements, and industry advisory board involvement in curriculum design. Recommendations emphasize the need for stronger collaboration between academe and industry, regular curriculum review and updating processes, enhanced experiential learning opportunities, development of soft skills alongside technical competencies, and establishment of graduate tracer studies to monitor employment outcomes and inform program improvements. BU F RDMD 06 Effective Page 1 of 29 October 23, 2025 fevos Page tof 1"
    },
    {
        "image": "terminal1_synth_3_aug3.png",
        "label": "terminal",
        "ocr_text": "= rnapies VERRNAL REPORT indigenous Knowledge Systems in Agriculture Heseurener, Chelsea Adams, Erle Young, Kenneti: Gitin Anoplenienting Agescy: Halional Rasearch Council of the Phitippinas (MRCP) Bovati ty 2624 January 2025 i, Esccutive Semseary dy analyzes the employability of graduates trom Phikppine higher nd assesses the alignment between academic programs and industry requirements. The alien with ever 200 companies, 39 unwersifies, and ices surveys of 5 600 recent graduates and 806 otnpoye Resa! indicate a conceming wduate competencies a eae SEESTseT tha 45% of fresh ‘graduates require substzovial additional raining belore beceming productive employees. Key skc niified inchade csitical thin problem solving abilities com sepaten and interpersonal silis, adaptability and tical application of theoretical knowiedge. The study examines surcesst partnership models, work inlegrated leaming stogiams, and curriculum development initiatives that demonstrate improved graduate outcomes. Notable examples incluls cooperative education Ty sponsored cay internship and practice iments, ara sy advisury board involvement in curriculum design. Recommendations emphasize the d for stronger collzboration belween academe and industry, reguisr curriculurn review and 5, enhanced experientia! fearing ageiintea. develonmnent of sof skils to monitor ‘This comprehens: education instity and inform program improvements. fective . Rage Por 38 BOPREMD SE Cietopet 23, 202"
    },
    {
        "image": "terminal1_synth_3_aug4.png",
        "label": "terminal",
        "ocr_text": "finplementhag Apeuey’ Neilonai fe Duratlons Janicary 2024. Janvary 2025 es th of grat the alignment between acader ation with ov surveys of 5, duates and 500 empl indicate a conceming mismatch between graduate competencies and indust empha porting that 46% of flesh graduates require substantial edcifionai taining bel bec ice critical thi dandy examines successful universit viculum d amples inciude internship and practicum lopment initiate smonstvaie ograms, indusity spor z ‘sory board involvement in curriculum need for stronger collaboration between ac: z updating processes, enhanced exnerienti 2portunities, development of soft skills aionyside techn ishment of graduote tracer studies to monitor empioyment outeos j gram improvernents. prev ne pHTJC! ¥. Hreview and Boge tof 28 Page tof i"
    },
    {
        "image": "terminal1_synth_3_aug5.png",
        "label": "terminal",
        "ocr_text": "4c Polytechnic University of the Philippines ) S41) School of Economics Research TERMINAL REPORT =<, Division Study Title: Indigenous Knowledge Systems in Agriculture Researcher: Chelsea Adams, Eric Young, Kenneth Griffin Implementing Agency: National Research Council of the Philippines (NRCP) Duration: January 2024 January 2025 1. Executive Sumn ary This comprehensive study analyzes the employability of graduates from Philippine higher education institutions and assesses the alignment between academic programs and industry requirements. The research involved collaboration with over 200 companies, 30 universities, and included surveys of 5 000 recent graduates and 500 employers across various sectors. Results indicate a concerning mismatch between graduate competencies and industry expectations, with employers reporting that 45% of fresh graduates require substantial additional training before becoming productive employees. Key skill gaps identified include critical thinking and problem solving abilities, communication and interpersonal skills, adaptability and innovation, and practical application of theoretical knowledge. The study examines successful university industry partnership models, work integrated learning programs, and curriculum development initiatives that demonstrate improved graduate outcomes. Notable examples include cooperative education programs, industry sponsored capstone projects, internship and practicum arrangements, and industry advisory board involvement in curriculum design. Recommendations emphasize the need for stronger collaboration between academe and industry, regular curriculum review and updating processes, enhanced experiential learning opportunities, development of soft skills alongside technical competencies, and establishment of graduate tracer studies to monitor employment outcomes and inform program improvements. BU F RDMD 06 Effective October 23, 2025 1of 29 Page 1 of 1 Rev oS"
    },
    {
        "image": "terminal1_synth_4_aug1.png",
        "label": "terminal",
        "ocr_text": "De La Salle University Institute of Engineering Research ‘TERMINAL REPORT Management Office Study Title: Mental Health Services Assessment in Philippine Colleges Researcher: Lisa Delgado, Holly Hoffman Implementing Agency: Department of Science and Technology (DOST) Duration: November 2023 June 2025 L Executive Summary This research project investigates the current state of digital literacy and technology integration across Philippine basic education institutions, examining the readiness of schools, teachers, and students for 21st century learning demands. The study covered 150 public and private schools Nationwide, involving comprehensive assessments of technological infrastructure, teacher Competencies, and student digital skills. Findings demonstrate significant disparities in digital literacy levels between urban and rural schools, with Metro Manila and major urban centers showing substantially higher rates of technology adoption and integration. The research identifies ctitical factors affecting successful technology integration, including availability of devices and internet connectivity, teacher training and professional development, administrative support, and alignment with curriculum standards. The study reveals that while the Department of Education has implemented various programs to enhance digital literacy, implementation challenges persist due to limited resources, inadequate training opportunities for educators, and lack of sustainable maintenance systems for technological equipment. However, successful case studies from innovative schools demonstrate the transformative potential of effective technology integration when supported by comprehensive planning and stakeholder commitment. Recommendations include development of a national digital literacy framework, increased investment in educational technology infrastructure, establishment of sustained teacher training programs, creation of locally relevant digital learning resources, and formation of public private partnerships to address Tesource gaps. The research emphasizes the critical importance of digital literacy in preparing Filipino students for future workforce demands and global competitiveness. BU F RDMD 06 Effective a September 26, 2025 sevens Page tof 1 Page 1 of 29"
    },
    {
        "image": "terminal1_synth_4_aug2.png",
        "label": "terminal",
        "ocr_text": "| Ba La Satie University i anattute of Engirecing Resear i TERMINAL HERSRT sanagement Ofc 4 th Gervices Assessment IN Pb sendy THe: Mental Het sa Detgatio, Holly Hotfenen Receercteer inent of Sch Jnuplementing Agency? Caper na and Technoingy BUST) Berapions thyvembor 2023 2206 2B Enecutive Semamaney catch prokect wert ve current state of digit Heracy andsectmoiogy west philiapine baste eucétlon exansining the readiness of SCRO0%. teachers, 2 sradents for 2ist century airing eamands. Te study covered 190 pubic ane private soho anonwade, involving comprenensy pesesenvents of echnnlosica (ras uecaute, teacher competencies, and sudert di sat skis, Findings demonstrate 5 nficara cicparties «0 ight Hieracy levels petwern urbar choos with Metts Manila and major urban IOS homing substarcialy higher Fates Thnotoay ardopion and integration “The casearch identities eptical factors affecting 3u°¢ qaturechmokegy inlegraion, inchding avaiabilty of Ceve vntemet cannectivay, teanher tai and professional deveronment vaipnieuptrative support, and akgnmort wah curmecnions Stare The study reveats that white the Department of Educates Frae iaeplesneninxd warious prograin enhance digital Weracy, impiementation challen gue to lnniten! TeSOUTCeS. rie raving opportunities for UCAS and tack maiianance systems for techie squcal equipment, Howecet, $V ful case mhucies feos rmvative schenls demonstrate tne War aemnative potential of efiectve technology egeaton ehen supported by BEmprenenshys planning are stakeholder CON ent. Recommendafions vmeinde development of 2 ctor digtat Inecacy framework, IN eestroent ny educational echnsiogy infrscucture, establish mrt of sustained feache: taining PP was, creation of focally relevant digital leat resources, and formation of Pubs: pevate pantnorstips 19 address resctoe GRRS: ohasizes the criical importance ‘of digital Meracy in preparing Figpinio students for Future WO nde and qobal COMPERRINETIESS i Thus across saab force GOMaF . age LO TE"
    },
    {
        "image": "terminal1_synth_4_aug3.png",
        "label": "terminal",
        "ocr_text": "be institute of Enginessing Reseach Management Office 1 io Phiiypine Colleges Mental Health Services Assessnet Saande Fiske: stm Geigad, Holly Hof Researcher gy (GOST) roplesweating Agency’ Dapactment of uration: Aiovamiber 2023 June 2526 4. Rxewutlee Sommar sb iteracy and technology integrator sigs the currant stale of digte of schools, teachers, and islinmons, examining the readin ig demands. The study covered 180 pai nig of technological infiasinecture teacher demonstrate sighvficant disparifes in gt ath Metro Manda and major urban Gamers ation The researca entihies This research pro students naticowede, AVORIEG comorehensive Asse rie competencies, and stude digitat ski nd seracy wovets between wba and rural Scho: chowing substantially higher rates of FECT adoption anc integt ccesatul technology integraon, we! auling availabilty of devices and vand professions: davetopariant, aeuniSaty® suppor, and vas that whvle the Depariment of Educaiion wteracy. ampiermentation challenges per for educators: ndtiack of susiainabie shi case stuties from basic edi century m standards. The iy enhance deta! partie een with Corneal setaed YOFNUS HOES due to banited resoatces, madequate training maintenance mg for tech innovative s hoo s rate the transtormattve pot ed ty compreneneive paneang ard stanenor pent of a national digits Merac framework, mere snotogy te Sash id teaches tranny pt clgital learning rescur c psivi The resnarch emphasize eof digital ti force demands and cial jal of effectwre technolngy #0 Ber commmument, Reconmmer ced investment in ed progranas, creation of ye partnerships 1 vent of SUS! s_ arxd formation of publ ve the crmical umportanc pal commpalitivencss cescutce GAPS Féjpine sitxdents for future wer Page Y0f 2% page tof"
    },
    {
        "image": "terminal1_synth_4_aug4.png",
        "label": "terminal",
        "ocr_text": "De La Salle University Institute of Engineering Research TERMINAL REPORT Management Office Study Title: Mental Health Services Assessment in Philippine Colleges Researcher: Lisa Delgado, Holly Hoffman Implementing Agency: Department of Science and Technology (DOST) Duration: November 2023 June 2025 L Executive Summary This research project investigates the current state of digital literacy and technology integration across Philippine basic education institutions, examining the readiness of schools, teachers, and students for 21st century learning demands. The study covered 150 public and private schools Nationwide, involving comprehensive assessments of technological infrastructure, teacher competencies, and student digital skills. Findings demonstrate significant disparities in digital literacy levels between urban and rural schools, with Metro Manila and major urban centers showing substantially higher rates of technology adoption and integration. The research identifies critical factors affecting successful technology integration, including availabilty of devices and internet connectivity, teacher training and professional development, administrative support, and alignment with curriculum standards. The study reveals that while the Department of Education has implemented various programs to enhance digital literacy, implementation challenges persist due to limited resources, inadequate training opportunities for educators, and lack of sustainable maintenance systems for technological equipment. However, successful case studies from innovative schools demonstrate the transformative potential of effective technology integration when supported by comprehensive planning and stakeholder commitment. Recommendations include development of a national digital literacy framework, increased investment in educational technology infrastructure, establishment of sustained teacher training programs, creation of locally relevant digital learning resources, and formation of public private partnerships to address resource gaps. The research emphasizes the critical importance of digital iteracy in preparing Filipino students for future workforce demands and global competitiveness. BU F RDMD 06 Effective \"Page Lot 29 September 26, 2025 page ott Rev 34"
    },
    {
        "image": "terminal1_synth_4_aug5.png",
        "label": "terminal",
        "ocr_text": "——— ‘alle University insthiveg of j Ecgingering Reseweh Managoment Often Usa Delgades, Hotty: Holfieary Leptessenitug Agere: Bepsitmect of Sctonce ane Fochnoisgy (087) Etouttite Seasary tipping basic This resaar ard technology eadiness of schools, tem, g fels betwicen wuntan Ad Turel oes Datentiaty higner rates of techs thsearites in dente \"6 Rialor arban SION. The rages tment of Education Hoey chaiterges persis: *, 2200 lack of sustatiabie ful case studies tram fective techantog, integration COMME “4 iCreased investy fairing prosrains, Of Rublic private porineys ot WAOr ance ct dias fteran ve global comy attiveness, GWOT ji fof Sustained teachar Formation COMM eNetations, BUN tac ateral Feation of bins te address Yi pr ing SOHO EH —— - i"
    },
    {
        "image": "terminal1_synth_5_aug1.png",
        "label": "terminal",
        "ocr_text": "University of the Fhiippiees Dilmpn £2) casts School Raseorch Etics VERMINAL REFORT Commision Reseneeber: Joy Payne, Kandre Ry son, Heather Moiing, Crystal Sam Kenaleaenting Agency: Comission on Higher Baucation (CHED) Daretion: Decanter 2023 Mey 2025 2 Ruceutive Senesory This research examines sustainability practices and environmental as Sluents it Motto Manis, proviting critical insights info the: current z 8 in Philippine higher education, The Ror tmiversiies anes conducted in. FENESS Amory Unvers: tate of envizonmental Study Surveyed 2 500 students across ten eth interviews wit environmental science far student ‘Srganinton leaders, and campus sustainabitty coordinators. Fy ings reveal a growing Swareness of eruxonmental iscues among Filpino youth, with 78% oF spondents expressing cern chout climate change and ts impact on the Phikgpines. However the study identifies a significant gap nhess and actual sustainable practives in daly ile. White students, Gemonstiats knowledge of ereironmental concepts, impianentation of sustainable behaviors Such as waste Secregation, anergy canservation, aivt sustainaite irarspertation remain inconsistent, The research high eeesful Campus initiatives inclueking green bullding Programs, waste manapemerd systems, tree planting ax: tivities, and environmental advocacy Cambaigis orgenized by stulent grouns. Notable practices include the integration of ‘sfainabity principles into university curncula, estanisiment of sco trienet and partnerships with focal government units for conn unliy- bas secornmendations enphasi campus tacities, Siviranmental proects, Rey re ie net for stonger insthsional commitment fo sustanabity aitegration of environmental education anos: Giscipines, provision of nhastucaas that Cibles sustainatie practices, and creation of icentive eyete that encourage eco friendly behavior among staierds and stall BUS RORER Bisa 7 Page tes ‘October 28, 2005 Page tof Reza"
    },
    {
        "image": "terminal1_synth_5_aug2.png",
        "label": "terminal",
        "ocr_text": "University of the Philippines Graduate School Research Ethics TERMINAL REPORT ‘Study Title: Quality Assurance in Higher Education Institutions Researcher: Joy Payne, Kendra Robertson, Heather Molina, Crystal Cruz Implementing Agency: Commission on Higher Education (CHED) Duration: December 2023 May 2025 L _ Executive Summary This research examines sustainability practices and environmental awareness among university students in Metro Manila, providing critical insights into the current state of environmental consciousness in Philippine higher education. The study surveyed 2 500 students across ten major universities and conducted in depth interviews with environmental science faculty, student organization leaders, and campus sustainability coordinators. Findings reveal a growing awareness of environmental issues among Filipino youth, with 78% of respondents expressing concern about climate change and its impact on the Philippines. However, the study identifies a significant gap between awareness and actual sustainable practices in daily fe. While students demonstrate knowledge of environmental concepts, implementation of sustainable behaviors ‘such as waste segregation, energy conservation, and sustainable transportation remains inconsistent. The research highlights successful campus initiatives including green building programs, waste management systems, tree planting activities, and environmental advocacy Campaigns organized by student groups. Notable practices include the integration of sustainability principles into university curricula, establishment of eco friendly campus facilities, and partnerships with local government units for community based environmental projects. Key recommendations emphasize the need for stronger institutional commitment to sustainability integration of environmental education across all disciplines, provision of infrastructure that enables sustainable practices, and creation of incentive systems that encourage eco friendly behavior among students and staff. BU F RDMD06 Effective Page Vol 29 (October 29, 2025 Page tot Rev 23"
    },
    {
        "image": "terminal1_synth_5_aug3.png",
        "label": "terminal",
        "ocr_text": "TERMINAL KEPORY Steady atte: ducation instituti: Researcher: Joy Payne, Kerns Robertson, Heather Mal tai Cru, lngirmenting Ageiry: Commistion ducation (CHED) Buratiow: Decemnour 2024 May 2075 L Eneeutive Summary earch examines s in Meta Manis consciousness in Philp ‘iainability practices are environment TOviGiNg critical insights into the curent sta honment liigher education. The study surveyed 2 508 students across ten nator universities and Conducted m cepth interviews wath environenental science tactdly, student organization fe and campus sustainability cooniinators. Findings reveal a growing feness of envircrmentat issues among Flipino youth, with 78% of respondent. Concern boul climate change and iis impact on the Phiinpines. However the si significant gap between awareness and actual sus vate Knowledge of enviromental conceals, impter fas Waste Segregation, energy conser Inconsistent, The research highlights success campus ini programs, wa: stems, tree planting activities, and environmental advocacy 'S Organized by student groups. Notable prar fude the integration of ity principles into university curricula, establishment of eco fie lly ca ‘and partnerstips wth focal government unifs for community ta Tecominendations empliasize the read for stonger institutional ation of environmental education across ali disc ustsinable practices, and creation af ine ravior among students and statt among university DUS faciitties sed erwironmental projects. Key ammitment to susiainabl vines, provision of inkactructure that itive systems that encourage eco friendly integy BEE RENN facta ever 29 2025 Page toi Reve ae"
    },
    {
        "image": "terminal1_synth_5_aug4.png",
        "label": "terminal",
        "ocr_text": "eNsity of Gracsate 9, Committe Se Pritppines cig \"oct Research Brives TERMINAL aepoRy Mads Title: Quatiy Assurance 5 Researcher: Joy Payna, ter Snplemewting Agency: con Dnration, eirhes 2923 Eeemative BCA exam, Students i Metro Kar BOnSCiOUSNESS in Philisnine hi ustainabilty vractices ancl iron ®, providing critical Mal awateness amon *eighis into the cure iG university 't State of environment her education. The study eset 2 509 students across ten tajor SS 8AU COndluCtEN ince erviews with emvicgomentat Stenne faculty, student “Paton leaders, and campus Sustainability coordinst SHRFEHESS Of enusor nent Ai, with 78% OF se, Philippine sslainabie cepts, mpl HeIVatlon, ands ISSUES amONY Fliping vate change and WEEN awe SOnCEN about cli, Skiniicant gap be demonsty, eal a growing, fortes expressing S. However a StUUY Kenting SFOCHCSS 9 daily ie, White stun Henitation of stainable beh, Donation renscsi NOS inctudting green tes Betivities, ang nvitonmentat advocacy lade the into #8, establishment of nunity baed en Onger insti Nal ecucabion across al aiseypig CEES, and exeation of ince, tine NS and! stage chon the NESS ANC actual 5: P Seuregat oonsistent The Progray campaigns on Sustainabiiny, STU Conan ing YSEMS, tree planting ites, ‘jects. Kay statriability uchwe that ‘o ttienty Metal pr ‘onal Comaibrent te sug 2S, BIOWISION Of int mnable Behavior among stucian"
    },
    {
        "image": "terminal1_synth_5_aug5.png",
        "label": "terminal",
        "ocr_text": "REPORT oa institutions Resenrrher Crz Molina, Crystai jon ont Boeath 23 May 2025 Esecative Soman This reseaich exa’ students in Me mines sustainability practices and environmental awareness among university sights inio the The study with environmer organization leaders, and campus sustainghilly coordinators. Findings reveal a growing a ofimental issues among Filipino y pondents 4: change and its anpact on the Philippines, How sal sustainable practices in daily lif impiementati ainable trans; ampus initiatives including green buieing planing activities, and environment ma uh, with 789% of res tury certifi behavior among students and staff BU Deter:"
    },
    {
        "image": "terminal1_synth_6_aug1.png",
        "label": "terminal",
        "ocr_text": "© University of Santo Tomas College of Social Sciences Center S290, for Policy Studies TERMINAL REPORT BU F RDMD 06 Effective October 12, 2025 Rev21 Page Tof39 Page 1 of 1"
    },
    {
        "image": "terminal1_synth_6_aug2.png",
        "label": "terminal",
        "ocr_text": "University of Sante Tom Sciences Center Stoily Vite: Commurity Based Disasier Rick Manager Researcher: Karen Rojas, Gabriella Tate, Amy Munoz Impinnenting Ageucy: National Research Council of the Phillogines (NRCP) Dawratiows Jarwary 2034 August 2024 votive Somemary ssinent of mental health services ang support sysiems availeble to students caffeges and unive ducted across fifteen insti 3 and siute universities, private collages, ar! sectarian schoots. T study employed multiple research methodologies inciuding surveys administered ts 3 000 rudents, inter counseling center staff and mental health professionals, and analysts oF Jional polities and programs. Results 2 alarming 8 juddent mental with 42% of respondents reporting experiencing munxerate to severe arwiely, 35% ing symptoms of degression, and 28% indicating acactemic siress affecting thet overall wellbeing. Assessment of existing mental nt gape ir service provision, While larger institutions tnaintet ing centers with icersed cileges lack adequate mental hsalth 1 Thy tio in mas i: NS eds recommended standaris, with an averay 12 5 000 students, Furthermore, stigaa surrounding mental neaith sues continues te prevent many stuser The research documents innovative programs and bast prectices, including 2ling intiatives, mental heath areness carnpalgns, stress management warkshaps, and integration of mental heat education info orentation oragrams. Recommendations nding for mental health services, taining prograins for faculty to recognize and respond to student mental health development of crisis silervention protoco s, and creation af supporlive cain environments thal priontize student welbang af one counselor serving 3 000 BEE RDM Btloctive ~ Hage Pat 2 3 Page ttt robber 12 2 Rov24"
    },
    {
        "image": "terminal1_synth_6_aug3.png",
        "label": "terminal",
        "ocr_text": "University of Santo Tomas College of Social Sciences Center TERMINAL REPORT for Policy Studies Study Tit Community Based Disaster Risk Management Researcher: Karen Rojas, Gabrielle Tate, Amy Munoz Implementing Agene National Research Council of the Philippines (NRCP) Duration: January 2024 August 2024 1. Executive Summary This terminal report presents findings from a comprehensive assessment of mental health services and support systems available to students in Philippine colleges and universities. The research was conducted across fifteen institutions representing diverse geographical locations and institutional types, including state universities, private colleges, and sectarian schools. The study employed multiple research methodologies including surveys administered to 3 000 students, interviews with counseling center staff and mental health professionals, and analysis of institutional policies and programs. Results indicate alarming statistics regarding student mental health, with 42% of respondents reporting experiencing moderate to severe anxiety, 35% reporting symptoms of depression, and 28% indicating academic stress affecting their overall wellbeing. Assessment of existing mental health support systems reveals significant gaps in service provision. While larger institutions maintain counseling centers with licensed professionals, many smaller colleges lack adequate mental health resources. The student to counselor ratio in most institutions exceeds recommended standards, with an average of one counselor serving 3 000 to 5 000 students. Furthermore, stigma surrounding mental health issues continues to prevent many students from seeking help. The research documents innovative programs and best practices, including peer counseling initiatives, mental health awareness campaigns, stress management workshops, and integration of mental health education into orientation programs. Recommendations include increased funding for mental health services, training programs for faculty to recognize and respond to student mental health concerns, development of crisis intervention protocols, and creation of supportive campus environments that prioritize student wellbeing BU F RDMD 06 Effective P: October 12, 2025 of 29 Page 1 of 1 Rev 2 1"
    },
    {
        "image": "terminal1_synth_6_aug4.png",
        "label": "terminal",
        "ocr_text": "Stags tile: Cormmmunity Based Disaster Fask Manas _Gabnelle Tate, Amy tance ational Researen Counell of the Phitppings Prevation: Jortary 2524 August 2024 i Exceutive Saas i sment of mental health dainiversities. The 2 from 2 comprensasive This terminal report pre cenvices and eupport systems avaiable 6 stucents in Philippine colleges sp igtttons TER? diverse geograniical location’ esearch was conducted aos ft ans) institutional VF seciatign 5c! ssdy employed muiple res rading state uraversities, private CoHEOES and ys administered to 3 000 earch metneslss students, nerves wi fing CeTser Se ental health pe clessionals, and analysis of snsthufionst palies and regres. Jjarding student ments anxiety, 35% Papondents reporing experienc ung their overalt snoderate te severe s aft heattt, with 42 reporting syrnptoms of depress, and 28% indicating academic mnant of existing mental hea! eres reweals significant gas i ings. Aasesst provision. White larger instigions: maintain cou many sriaier college: adequate mental gtudent io counse most isttutions exceeds recomune t fone counselor sere ing 3 000 to 5 000 students. Putherinore, sig event many students from seeteng PEP Th counseling: inibative est practices, inching pee NL WOTKSHODS,, and integrator of mental fe ndards, wilh on average ing mental health tines to jenovative programs ond sw areness CAMPAIGNS, SUE Sccahon info onemtation programs, Reco? nendate jude Increased TUNE dent mental health voftn services, waining programs for fa ps, development 6 servention protocols, and that prioritize student welloe: Page bof 29 UTE PERG Bilocive page (oft"
    },
    {
        "image": "terminal1_synth_6_aug5.png",
        "label": "terminal",
        "ocr_text": "University of Santo FERS eas Fite Cormmariy S958 pisaster Risk Managarent Reossrctat: Kasan R88, Gatstetie Tate, Amy Maaz snopiementing Aanses: Henbone! 28 August 204 Resaerch Council of the PREIS ANROPE Sranatbea: Jaeeiary 20: Exactetise Suimseatt sats: Hira gyaiable 0 ipontensive avsessment oF mental health certs i Phigpane cobeges and GEN ges. The senting diverse geomet vedios, asvaie couRES, Htd SCE schoo! se agimanistered te 9 000 vofzssionale, and analysis of af mental This termina! report preset ices and supprast syster was COMUCles across ding sive URE: earch mvethedotogies incnting SuEVEY unseing center stall pial aits indicate alarming Staoics reguded 3 vena axnecroncingy mecierale Se arminty, 38% von. and 25% nsicalng acaaern SHEE afiocting hen avert vrei teat seaport systems (8 ais significant gaps venoms mann coreg cera WL research ‘and institutional types, FE ssludy exngiayed ansipie F students, ntecviows wait inatiutonal policies and progrelns He eaten, with 42% of FES: reporting symptoms of depres atbeing. Aasessmont of exist pervice provision, White larges 10st crater cokeges lack adequate ments neaith rescurtees norvied stonedards, wilh an aveT age neal jo i rnost westinaiones exceeds reo (G00 studerss. Parthermare, 98072 gunounding menial freon seeking help Thevesearttt documents rp awe county iat, mental heals oneahops, arc nmecgrancn af ments health “pene inoreesedd Faring for mea espond to student mental healt of supportive CaS nt enn, coursetar Serving 3 000 10 santives ko prevent Heany Sealerts innovative orogens and best BACIEE onegs camparg, stress managers? education into orientation POG AMS Recommensiations programas for fscully to recogni: and sis inerverition prctecnls, 3M HEIN shident weibeing arrvironmentts tat POS ‘oeteber (2, 2025 fe 24"
    },
    {
        "image": "terminal1_synth_7_aug1.png",
        "label": "terminal",
        "ocr_text": "University of Santo Tem Vice Bresidant for eseareleer Kimberly Petes oveesosuting Agetey! ShepanmentorEduraton (DepEd) Rese Management S2° Desation: dy 2024 May 2025 1 Executive Summery the multtinceted impact of online a ppine higher This comprehensive research study investigates on shident academic performance ac stains carch ernproyed a mixed ws of academic reconis with qualtaive Facuiby members, and adnainistraters fron The study seveais sig platiorms, highlighting bot 2 that while access to te af harrier for many stusients, particularly *es innovative solutions and mstitue 4 support ring cutcomes. The research Wenifies se wags in onfine learning environments, exch sufonat infrastructure, and the quality of ing fevels of adaptation acrOss cared O58 Var mathe interviews and focus universities ive andlys rhying stuien s. ey regional areas educators to digital jonal context. Kay findings indie: ain logy and frown raral ane students and in the Philippine edu internet connectivity ren economically disadvantaged backgrounds, mechanisms have enabled success! factors that conitizute to academic sue wi, faculty W arai preparednes zanagement sysiems disciplines, #7 seignces programs. Re ns, mnvesiment var 2 challenges COME: include the develor J infrastucture, commendalin in robust technoloaic eracy PIO eon of inclusive policies thal address the J divide, and continuous professions! as a framework Zor sustainable ontine and Jf for educators. The study alse prop plementation that consi of Phi onomic realities £3 the Socio blended leartiing education. —— Page bot 29 Bape tot"
    },
    {
        "image": "terminal1_synth_7_aug2.png",
        "label": "terminal",
        "ocr_text": "University of S Offieg of tha Vice Pi Academic Aitairs ter Risk Management Study Tile: Commneuty Based Osast Kriutt Clie Hesrarchee: Kimberly Peterson, Molly Gabrer Arapleimeating Agency’: Oepartnentot Education (Dera) Research sanagariant SaiViCe Daration’ July 2024 -May 20 Precutive Semmmary 1 study investigates the multifaceted unpact of onine learn qiodaities on sksient academic performance across various GISCIPHNES Priippine higher ceeation instivions, The esearch employed a muixed ineitiods approde combining ceanbtatve analysis of academic records with qualitative inierviews anc fonus GOAT discussions involving stiafents, faculty members, and adminwstratars them sit Mor ceiversities iv Metro Monta ore vey regional areas. The study reveals signiicant finaings regarding the adaptation of orton anv educciors fo Sigal earning piaitens, nightiyring beth challenges a opponuniies in the Philippine educat indicate tsi while access to technology and internet connectivity remains a criical harrier shadents, particularly those from rural and aconomicaly disadvantaged backgrounds, nnovative sokstinns and mstiutional support mechaniems have enabled successtul Ieamig outcornes identifies severat ees tut conrbute 19 academia success online learning envionments, weiucing student set regulation, faculty traning and preparedness, institutonal infrastructure, anv? the quality of faarning management syster dtferent academir, discpines, wih STEM Belds fecing unique chalenges compar fumanties and social sciences programs, Recommendations inchate the de comprehensive digial Reracy programs, investment in rebust technological infrastruc wire, creation of inclisive policies that ackiress she digital divide, and continunus professionat development far edacarors, The study also proposes 2 framework for sustanabie oring and dierwied learning implementation hat consklers the socio economic reathes of Piiippine esc This comprehensive 1esear Datu analysis shows vaiying levels of adaptation across res te ee tect r overt £7, 2023 tig ta Fee 23 Page 1004"
    },
    {
        "image": "terminal1_synth_7_aug3.png",
        "label": "terminal",
        "ocr_text": "Academic Affairs Research and Development Center University of Santo Tomas. Office of the Vice President for ‘TERMINAL REPORT ‘Study Title: Community Based Disaster Risk Management Researcher: Kimberly Peterson, Molly Cabrera, Kristi Cline Implementing Agency: Department of Education (DepEd) Research Management Service Duration: July 2024 May 2025 1 Executive Summary This comprehensive research study investigates the multifaceted impact of online learning modalities on student academic performance across various disciplines in Philippine higher education institutions. The research employed a mixed methods approach, combining quantitative analysis of academic records with qualitative interviews and focus group discussions involving students, faculty members, and administrators from six major universities in Metro Manila and key regional areas. The study reveals significant findings regarding the adaptation of students and educators to digital learning platforms, highlighting both challenges and opportunities in the Philippine educational context. Key findings indicate that while access to technology and internet connectivity remains a critical barrier for many students, particularly those from rural and economically disadvantaged backgrounds, innovative solutions and institutional support mechanisms have enabled successful learning outcomes. The research identifies several factors that contribute to academic success in online learning environments, including student self regulation, faculty training and preparedness, institutional infrastructure, and the quality of learning management systems. Data analysis shows varying levels of adaptation across different academic disciplines, with STEM fields facing unique challenges compared to humanities and social sciences programs. Recommendations include the development of comprehensive digital literacy programs, investment in robust technological infrastructure, Creation of inclusive policies that address the digital divide, and continuous professional development for educators. The study also proposes a framework for sustainable online and blended learning implementation that considers the socio economic realities of Philippine ‘education. BU F RDMD 06 Effective Page 1 of 29 November 07, 2025 Page tof t Rev23"
    },
    {
        "image": "terminal1_synth_7_aug4.png",
        "label": "terminal",
        "ocr_text": "University of Santo Tomas Office of the Vice President for TERMINAL REPORT Academic Affairs Research and Development Center ‘Study Title: Community Based Disaster Risk Management Researcher: Kimberly Peterson, Molly Cabrera, Kristi Cline Implementing Agency: Department of Education (DepEd)- Research Management Service Duration: July 2024 May 2025 L Executive Summary This comprehensive research study investigates the multifaceted impact of online learning BU F RDMD 06 Effective _ _ ~~ Page Tof 29 November 07, 2025 Page 1 of Rev 23"
    },
    {
        "image": "terminal1_synth_7_aug5.png",
        "label": "terminal",
        "ocr_text": "University of Santo Tomas Office of the Vice President for TERMINAL REPORT serves, Academic Affairs Research and “ESSSSS0. Development Center Study Title: Community Based Disaster Risk Management Researcher: Kimberly Peterson, Molly Cabrera, Kristi Cline Implementing Agency: Departmentot Education (DepEd) Research Management Service Duration: July 2024 May 2025 L Executive Summary This comprehensive research study investigates the ‘multifaceted impact of online leaming modalities on student academic performance actoss Various disciplines in @ducation institutions. The research employed a mixed methods approach, combining Quantitative analysis of academic records with qualitative interviews and focus group discussions Involving students, faculty members, and administrators from six major universities in Metro BU F RDMD 06 Effective — _ _ Page Tof29 November 07, 2025 es Paget oft"
    },
    {
        "image": "terminal1_synth_8_aug1.png",
        "label": "terminal",
        "ocr_text": "sity OF Sarde: Tomes RNG BE mie sted Bitte THEY BSS In ein ingher F dun atin Messer deed rion Senge finages Aripienie sting Bertin So ccemnes CM SeaE aes ite TENS APH Erne USL Avity Corti Peatat ec atri MIMZ A gee sons bans ANBEN OSS OF any tes Noe Or ey caper tidy de akties, tuttents behay ur app ht atne SUSE PN De tins paint, uns SEEPS bates ei at eet oad se ENE erator y a) eke ACI US se ese thee tony tens aw PUNCH estobus STOP OMEN Es tae ttle SERIE eat ts eb eturarmenial omets Key Seton evttate Peed ie EMM ENE tO cond aereat ty Nateation ot ecietorunnt edt ates soins aie dt ake pra hees, Pebavint aiene steefer Perec ot y BLP PPM eg"
    },
    {
        "image": "terminal1_synth_8_aug2.png",
        "label": "terminal",
        "ocr_text": "‘Study Title: Quality Assurance in Higher Education Institutions Researcher: Jenna Roy, Pamela Bridges Implementing Agency: Prappne Counci for Agricuture, Aquatic and Natural Resources Research and Development (PCAARRD) Duration: September 2024 November 2025 Executive Summary This research examines sustainability practices and environmental awareness among university students in Metro Manila, providing critical insights into the current state of environmental Consciousness in Philippine higher education. The study surveyed 2 500 students across ten ‘major universities and conducted in depth interviews with environmental science faculty, student ‘organization leaders, and campus sustainability coordinators. Findings reveal a growing awareness of environmental issues among Filipino youth, with 78% of respondents expressing ‘concern about climate change and its impact on the Philippines. However, the study identifies a significant gap between awareness and actual sustainable practices in daily ile. While students demonstrate knowledge of environmental concepts, implementation of sustainable behaviors Such as waste segregation, energy conservation, and sustainable transportation remains inconsistent. The research highlights successful campus initiatives including green building Programs, waste management systems, tree planting activities, and environmental advocacy ‘campaigns organized by student groups. Notable practices include the integration of sustainability principles into university curricula, establishment of eco friendly campus facilities, ‘and partnerships with local government units for community based environmental projects. Key recommendations emphasize the need for stronger institutional commitment to sustainability, integration of environmental education across all disciplines, provision of infrastructure that ‘enables sustainable practices, and creation of incentive systems that encourage eco friendly behavior among students and staff. ‘BU F RDMD 06 Effective Page 1 of 29 ‘October 15, 2025 Revs Page 1 of 1"
    },
    {
        "image": "terminal1_synth_8_aug3.png",
        "label": "terminal",
        "ocr_text": "University of Sante Tomas Staty Thies Quality Assur ip Higher Education tnstituions Revearcber: Jenna Ray, Pa la Bridges Wiplersesting AgereY: orgy Coun t0e Bareuhire, Amish ont Habis Resource Siacas aration: Sep at Bevelaemen mber 2024 Ny 2025 E Executtee Ssmimaey ‘This research examines suustairatiliy pee Students in Meto Mania, Providing eri SORSCIOUSRESS int Phiingings OrgaMZation EFS. aN cam) Swareness of enviponmentas imental awarene, al insights inte 1 higher education, The MICted In depth interview BUS Sustainability coordinators, ty Filipina WONG University umentat iS across jen ce faculty, shtide 2 growing ndings reveat ih, will: 756 of respondents expr essing a8 Change a AS impact on the Phi eS ever, tf Hes Bisrlicant gap between awareness anc actual s demonstrat e knowledge of 28 in daily fents vironmental concepts, feniation of 5 behaviors suck Seton, energy conservation, and Sustainable transportation remains ‘altghis successhey campus initiatives including green bulding Ment Systems, tree planting activities, and eevirenmental advecacy Carnaigns organized by stud groups. Notebi ices fn Sustainability princi ‘okie the integration of SWC University curricuts, estaliie ment and partnerships 3 with fecal govern wallons emphasize the need for tS for CoH ny recommen, strony -AMDUS Taciities fy based environmental projects. x one! Commitnent to sustainabity, Ol envitonmental eduction across disciptines, prov fastructure that ‘CLES, ad creation 9 on ol incentive systems tyat encowage aco triendy Page Pot Page tors"
    },
    {
        "image": "terminal1_synth_8_aug4.png",
        "label": "terminal",
        "ocr_text": "of Santa Tomas ee Unversity fies TED) scmpated Freromdes Rarsmarshs 7 H ser Eg ucations Ins tRURIOne le Quay Assurance 11M Rescatcress Senne Roy Panels Brenes ance tenner #0 Hasonemers MERE crigane Coutts Apeakes Sate mE Hrapherrentineg METH: rawrattom, Secterstar D024 Nemeneet or t Peceutive Nusmaeeary ravine pepe peaennses son emsgorTs tat awareness 9 vy hariia, prowesseg carat t apts ant ae cater state of enw Drappne twrner educate TPF cvely surveyed 2400 siasents 8° COOGEE ndepth interes wth erraronmental scomce facuty sf dent 2S Caynabelny ccasenaions FRM ens 1 with 78% of Fespendents OXF =: wy der Tne research prs S07 concern abou cannadic ant gap beter ve kromviedge of ensHeoHMENES awareness and actus susla concepts. sperm Such as srabte: Segre eR onservauen ncansmiemt The 1e5caec a enghts successta carrans PAIS ne sigs. ee planing CINE? gaegrams, sy fa. dies canpan sustanabity puncipie’ ravtenrshigs wih fore’ ps Notable pr? ncuia estataenrnent ft eo\" iy communty based env oor ges sh ona! LO Pay a En OS tuprety camo eniah presets SCY rong to sustamssnany gore that co taenetly op ruewersity C0 gevernenent 2% tte need for stor af scrpbsHes, MONS rive systems ecommend2tio\" intaga ston oF enusrcrareen ta pmabies sustanabie pricies, leg ohaents and stat ehavine anes page ttt BU TERME"
    },
    {
        "image": "terminal1_synth_8_aug5.png",
        "label": "terminal",
        "ocr_text": "stady Tide: Quality Assurance In Higher Education fost Reeceneeters Hen srveia BeiSge® fnvplessenting Agenes® Pole our tos Aapicnione, Amu? aged Hater awaurees Cesseoreh anc Qeveboprnant (PORARAD? 24. Roveenber 2825 dueation: Septascber among anaversty 4. Bawentive Semen? This research examines sustainably s2setieSs gyaderts ip Netto Mana, raved of ervicorenental ce Piaigypane higher education. 175 students across Heh vpnenias science faculty. stent jens wath ereeiton comscioway inecepth iter reveal 2 growin rar universities and COM ‘rganization eaders, 3718 CaP Trustainablity cocedinasiors, FAI gwareness of environment ISS among Faipine yours, wits 7B of respondents expres? npact on ihe Priprines. HOWE the study ident sings in say ite. Wie students af sugtanatle prot apis. implementa energy congervaion, and sustanable: igges successta “nia jon of sustainable beraviars trencportabet reas jacking green Duading nd environmental MBYOCACY ani gap betwee? signe: emonsizate RncewtedTe: uch as waste Seo\" nconsistet. The researe programs, waste pement systems, tee pt anny activites, mpaigiss organizes oy SHUICTH GEOMES Nietabte practices inckate the integration of centainainity oricciptes ae SraNRTERY curtiguia, epiabishment of ianady campus facilities ‘ard parirwranips wa fora government units 107 vromenuaaty ased emvirananenkal OOF Wey recommendations emphasize ack for sianger insite ornmionent to sustainabay ntepration of envsonmentat auction acoso GECITIEES, PINE of iifrasiurture thet enables sustainable practices, ‘creation of aicontive: systems Brak encourage ecowendly pehavior amang seudents and staf Faget ots"
    },
    {
        "image": "terminal1_synth_9_aug1.png",
        "label": "terminal",
        "ocr_text": "University of the Pippines Diep meal Ethics nelgenous Knowledge S ystems i &, ercliure Resessehee: Mary 2 Parkes, Heity Hensley, Dariatte Carteen, Megan Adams Taiplementiog Agemer: Deparment of Education ie, Research Managonain Gervien Bratton: December 2023 Recomber i Executive Stsmnary This terminad report ings from a comprehens; ASSessmunt of mental haath “RUCGT SySlems iavaiisble t9 stucionts in Polipoine colleges as tires The Eaeaich was conducted across fines litions represonitins Hiverne Secgray hical iocations and institutional tye versitins, private colleges, ane Sanly enpinyeds mu sectarian schoois, Tye TOarCh etocoionies including SUIVeYS atieninisteraet te 3 008 Students, interviews win, ragrtbtiing Cente stall and mental neem, Prafes sionats peepttional policies and peagramna. Fe alts miicate heath, with 429% of S, ond analysis yt ding shictont mental Feporting symptoms of depsess Wg muerte to severe aniiely, 25% 28% incicating acagernic stress aflocting their averat Seibeing, Assessment uf exe vial heaith sugcort systems reves Significant gaps ix Senice provision. White iarger Sma Nes with fcensed pe HFS, Mery smatior 0 Fesources. The Stitenttis SIO Talia in mest insititesios ed Standards, gts an average Of one counselor serving 3 000 tn 5 000 stesdents. Furthermore Sterna Surrounding mental heath Rats SoninuES t prevent many Stuctoris from seoking hety “he research documents innovative ercarams and best Stactices, including pear Counseting awareness campaigns. iiitives, mental health YESS Management weg HOH of mental haan, education int ‘RSHODS. an inten) ews 2 OW Tease funding for Mertad {ralbing plograms ter facuty ts J ahiee andl ressore to sttent meng heath develnomiaet 3 criss imtervention Prolucels, and coration of supportive anus SmYirCnttisnts that priettize sues welbeing RLSSIS 08 Eifestieg i September 15, 2025 Reva Sepe tots"
    },
    {
        "image": "terminal1_synth_9_aug2.png",
        "label": "terminal",
        "ocr_text": "Unversity of ina Prtippines Oaiembn Graduate Schost Ressenh Ethics Committee Fite: ioigenoug Researcher: Moran Parkes Helly Renshes, Daniel Sampleroenting Ayoncy: owsting: ystems in Agricutn ire Gepartmert ore MCRtOR DEED) Researn Mansgemant Servicy December 2673 December 2235 Bacvattse Gmmansry terminas Feesort Senices i DESENtS Freres from Md StRppOT sy stern ent of mental health Phitiopine coteges angi universities The feseatch was conducted across fiteen institutions represenan Gems geographical locations Gnd Destiutional types, inciacin NUNES, Private caliegne. ancy Sectarian Schock. The ERA erpeyad mutiple researen methodologies inckicing FUIVESS acininisieceet to 3 000 Studetts, imerviews with con ‘all and menial heath pe YeRutional policies and prov health, with 42% of re E fencing maderste $9 (chatting symptoms of deprecsi 30d 26% indicating acscemic ain Welbeing Assessment Support sy BANC BrOVision. White tage Sstiutions maintain counsel Bidlessionals, many smater Colleges lick adequate rion Stitlenisto. conngas and analysis oF 'eg2rding student mental Severe ansiety, eS8 affecting their overage ems feveals signticant gape in NG CeOrs wit j alginate state need tal heath ree waRCes The Hor ratio in mos: WsHiHiOnS exowedig Tecommangesd Standarels, wah an average Of one Counseior SENING 3 006 te 5. ann Stushents, Furthernors, 5 SSUCS Continues to presvey f Many Students from sees: ineovetive Programs ares best Practices, inc OURIN mentat heath iG hile, The rasearch decyan ens tuding peer Courisoting initiatives, ment neat Svareness campoians. size t Workshops, anc in Stication inte orientation Programs. Recommerstato health services Sasa orogramns for fae uty Ces, development of crisis intervention Sovronnents that provtize suudens Weibeing SW BHON OF mental health i tnckate increased furvbngy 1 recgnize and resporey to SiMICGIS, and BONDS KGa ~ Sehiembee #5, ange Page Toh 3B Page toe"
    },
    {
        "image": "terminal1_synth_9_aug3.png",
        "label": "terminal",
        "ocr_text": "unwweraity of the Patippines: ae Graduate Setwxd Pasearch Ethics t t Comnealttes H Pere eee enenemnemrmnnn see thee j sandy Vite: ivigencass Keowlerdge Systems napicutture Bescarehers Morgan Paster, Heby Henaiey, Dnietie Cadsem, Magar Adnan. oaplementing, Ayeoey? Deparment en EaueaNs (pet -Fessearch Management Samvice Dewstlon: Dacemibes 2023 Decembar 2026 1. Excoutive Seamary “iris terminal eapart presents Boingo fom a SONNE ye veuesament of mentat healthy ‘lable to stadenis in Philippine CORES ged uaversities. The ‘2 geagraphical locations: secvices and supper! systems ‘sheen institutions representing a research was comdiucted BCHOSS ‘eexd gvstinetional types, INCRE ciate universities, private colleges, and sectarian shosts. The ‘stunly employed autos research methodologies mcksing SUvEYS erninisinred 0 3 008 srudents, ineervigws wih counseling COME! eral and menial neath professionals, a analysis inatiuioral poles and programs. Rvs aerate atarning statics regarding Swudent mental ew de of respnquents Pepa BABS srg mnoaerate to severe ancety, 337% reporting symptoms of depression me 26% indicating acadernie ewress affects their everatt edbeing. Assessment of existing mena eat sapped! aystenns reveals significant GES 1 sunvice provision. While larger insttutens m tain coureelng conkens wih HeNSed professionals, many sinaer cole nial heawh resources. The radent to counsetoF Fauo is most mathabons exceeds recommen andards, with an average er ene counselor serving 3 000 10 5 000 siaherl Funhermore, sogma sunscanaing mens health vraues conmnues te prevent many shaders FON geoking hel. The cesearch GOCUrerts nnowative programs ard best practices, seine pees counseling mates, mental Me ih marreness campaigns, sess management rorkehop, nod integrason of méréal health education inte orenkation pograms Racornmendations ectade increases Rreng 1 mental health services, taining plograrss for facutty to recognize and respond to student menial heath aac of SUpPORE CAMPUS concerns, developement of crisis ery ston protacds, and crest wervieonments thal prierdizs aiudent wellbeng. nanan fags Pol page tet"
    },
    {
        "image": "terminal1_synth_9_aug4.png",
        "label": "terminal",
        "ocr_text": "University of pines Graduate Schoai Research Ethics Comramtes Iinplemeniing Agency Depariwent of Education (DepEd) Research Management Service Shoration: December 2023 £ This texrni services and 5: aid institutional types, including state ur study employed muttipie researct methodoiog ig Surveys administered to 5 006 interviews with counseling center staff and mental f ionals, and analysis of salicies and programs. Resists indicate alarming statistics regaraing student mentat of respondents reporting sneing moderate to severe anxialy, 35% ing sympions of ession, and 2 iG stress affecting their overnt wellbeing. Assessment of existing mental health supeart sy reveals significant gaps in Service provision. Vifile iarger institutions maintain c many smatier colieg Aseior fatio in mest institution: YEFAGE ounselcr serving 2 000 to 8 006 students, F sti heath nfs thom seeking help. The research documents 65, inclining peer counseling miialives, mented health workshops, and integration of mental pealth sessment of mental graphical cukeges, and sectarian schocts, espond to abasent mental he nd creation of supportive bot Pope t att"
    },
    {
        "image": "terminal1_synth_9_aug5.png",
        "label": "terminal",
        "ocr_text": "University of the Philippines Dilimpn Graduate School Research Ethics TERMINAL REPORT Committee ‘Study Title: Indigenous Knowledge Systems in Agriculture Researcher: Morgan Parker, Holly Hensley, Danielle Carlson, Megan Adams Implementing Agency: Department of Education (DepEd) Research Management Service Duration: December 2023 December 2025 1 _ Executive Summary This terminal report presents findings from a comprehensive assessment of mental health services and support systems available to students in Philippine colleges and universities. The research was conducted across fifteen institutions representing diverse geographical locations and institutional types, including state universities, private colleges, and sectarian schools. The study employed multiple research methodologies including surveys administered to 3 000 students, interviews with counseling center staff and mental health professionals, and analysis of institutional policies and programs. Results indicate alarming statistics regarding student mental health, with 42% of respondents reporting experiencing moderate to severe anxiety, 35% reporting symptoms of depression, and 28% indicating academic stress affecting their overall wellbeing. Assessment of existing mental health support systems reveals significant gaps in service provision. While larger institutions maintain counseling centers with licensed professionals, many smaller colleges lack adequate mental health resources. The sstudent to counselor ratio in most institutions exceeds recommended standards, with an average of one counselor serving 3 000 to 5 000 students. Furthermore, stigma surrounding mental health issues continues to prevent many students from seeking help. The research documents innovative programs and best practices, including peer counseling initiatives, mental health awareness campaigns, stress management workshops, and integration of mental health ‘education into orientation programs. Recommendations include increased funding for mental health services, training programs for faculty to recognize and respond to student mental health concems, development of crisis intervention protocols, and creation of supportive campus environments that prioritize student wellbeing, ‘BU F RDMD 06 Effective _ _ Page of 29 September 15, 2025 page tot Revi 4"
    },
    {
        "image": "terminal2_synth_11_aug1.png",
        "label": "terminal",
        "ocr_text": "on Oly 1108 estunan Avenue, regarohpavene ects Tomiad Report SEARCH TERMINAL REPORT AND PROJECT CLOSE Dear Vice President for Academ! compilation of the 7 auspices of thls insthution and funded by Deparment c eam, lad by Mark Farley and 5 within the stipulated timeline af August 2024 exerutive $uramary, and all Supplementary documentation have been prepare nsthutiena! and funding agency reairumnents. Key accomplishmen 9 data collection and enalysis, publication ready manvacitn .¢ higher etucation and develope signticandly to the body of kaoaledg inthis fad and provide actionable insights for financial obligations have been 8 vance Office. Equipment ie units for contiausd institutional w duration. 7 ali 12 oF th nem prforiies. The findings subimitted te\" and veanslened to the appropriate azadey 2. We express our sip 2 research outcomes rafigct positively on our institeaion s commiiment to and community serv Respacthuly submitted, pared by Gila MEYERS eagenen Beeston Noted GLORIA MELTON fens Altace lanier"
    },
    {
        "image": "terminal2_synth_11_aug2.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Terminal Report RESEARCH TERMINAL REPORT AND PROJECT CLOSEOUT Dear Vice President for Academic Attire, This latter serves as format natification of the successtot conipletion of tha research project thted “Digial Literacy in Basic Education” conducted ures the auspices of this insthution and funded by Deparment of Science and Tocteciogy (DOST) Ths research tazm, tad by Mask Festoy and comerizing distinguished faculty members, has successfully coinpiated si project delivecahies within tne etipulated timaline of August 224 to Octabsr 2025. The terminal vapor, ‘exneutive sumcnary, and ail eupplementary documentation harve been propared in azcordance with Insthutionl and funding egoncy requirements. Key accomplishments of this research incivde comprebunshve data collection and analys s, publicaticr ready manuscripts, policy recammendalions, aoe procticnl applications relevant to Philippine higher e ucation and develepmort priorities. The fines Contribute signiticantly to the body of knowledge in this field and provide actionable insights for stakeholders. All financial obligations have been setiied, and the final accounting report has heen Submitted to thw Finance Office. Equorient procured through project funds has been propery inventoried andl transfered to the appropriate academic units for continucd institution use. We express ou sincere Susie for the instilutionat support provided througout the project duration. The research cuicemes tefiset positively on our Inattution s commitment to academic excelienze and community service Respecttully subsnitied, Prepared by GINA MEYERS Oxgem Orem Noted GLORIA MELTON Vee Present ir Asedinc Attrrs"
    },
    {
        "image": "terminal2_synth_11_aug3.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Ofee of Researcn and Creat Katiounan Avenve, Loyola Heights, Quezon City 1108 research ateneo edu (02) 8426 6001 Terminal Report RESEARCH TERMINAL REPORT AND PROJECT CLOSEOUT Dear Vice President for Academic Affairs, This letter serves as formal notification of the successful Completion of the research project titled “Digital Literacy in Basic Education” conducted under the auspices of this institution and funded by Department of Science and Technology (DOST). The research team, led by Mark Farley and comprising distinguished faculty members, has successfully completed all project deliverables within the stipulated timeline of August 2024 to October 2025. The terminal report executive summary, and all supplementary documentation have been prepared in accordance with institutional and funding agency requirements. Key accomplishments of this research include comprehensive data collection and analysis. publication ready manuscripts, policy recommendations, and Practical applications relevant to Philippine higher education and development priorities. The findings contribute significantly to the body of knowledge in this field and provide actionable insights for stakeholders, All financial obligations have been settled, and the final accounting report has been submitted to the Finance Office. Equipment procured through project funds has been properly inventoried and transferred to the appropriate academic units for continued institutional use We express our sincere gratitude for the institutional support provided throughout the project duration. The research outcomes reflect positively on our institution s commitment to academic excellence and community service Respectfully submitted GINA MEYERS Program Drector GLORIA MELTON"
    },
    {
        "image": "terminal2_synth_11_aug4.png",
        "label": "terminal",
        "ocr_text": "Teeminal Report RCH TERMINAL REPORT ANI PROJECT Pastel The terminal and att sunptem nation have been p epared in accontance wi accomplish: Nand analysis, publicedio pare inctuche recommendations, and ers. Al financial obligations have hon sate sibamitted te the Finance Ot stakehei are is been proj nie unlts for continued instiiuticnal use. gratitude for the institutisnal s throughout the project duration, The reseaieh out ution s cormmitenent i acadie pectiully submited Noted GLORIA MELTON for Ssuaemns Puen"
    },
    {
        "image": "terminal2_synth_11_aug5.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Ofice of Research and Creative Wort Katounan Avenue, Loyola Heights, Quezon Cty 1108 tesearch ateneo eau stom Terminal Report RESEARCH TERMINAL REPORT AND PROJECT CLOsEouT Camp eae: Ay. Ti Mtr serves 8 oma rtcaton oe secon aurpces othe omen,” ted \"ig Lieacyn Baie Cacao’ coca sen ier, od by Ma Pn heed by Onprner et Scance and Teche nea The research project att Fatey and comping dstiesished tacitly nome cnacuive setts wit the stipdsted timeline of Aug 224 Geena The terminal report, ttn an can uPerianydocienaton hve been pect wna Institutional and funding agency requirements Key accomplishments of this research include Comprehensive data collection and analysis, Publication ready manuscripts, recommendations, and cern Cpcations relevant 1 Philppine higher educaten ron Upd Priorities. The findings stake Rae 1 the body of knowledge inthis ld and ere insights for Stakeholders. All cbiigations have been settied, and the final report has been Submitted to the Finance Office. sane BOcued twough pct ands hes been propery ented at teed 10 the appropiate academic units for contis Fatitude for the institutional Prepared by GINA MEYERS Program Orector"
    },
    {
        "image": "terminal2_synth_12_aug1.png",
        "label": "terminal",
        "ocr_text": "UNIVERSITY OF THE POLYTECHNIC PHILIPPINES pment Ofte on and Dever ia 1016 feet, Sta Mesa. Man eduph (02) 8716 7832 Report SUBMISSION NOTICE Terminal SEARCH REPORT FINAL RES documentavon fre rese ai) project ‘September 03 2025 THe ural Resources ‘scholarly contibutlons minal report ational search team \\d evaluation and final a, Tis ttter formally wansm cessfully compl sn Services Assessment srpzarch nwvanve, runded BY FM aquatic and Nat Dear Deat supstantal mental He multi year ‘pmitang interim TEP‘ gin monitoring 30 .¢, including comm Notable achiev es, develo?! wumity engagemet ements inci 9 for mentor research nsvurenis syonal research 1\" capability pity Regular 15, Ai procurement ely. This project societal ners in future maintal junior researcher that can be used DY ‘These outcomes exten ganancement Financial MNS pats contmed comlrance foiiowed proper procedures and igemonstvates our insttuon® capability sralienges. We look fora\" continue Gaaeavors. Respectly YOU cy and accountat 1 financial policies ‘and documented appropri varen addressing comples <aieang agencies ana eseaten pat 14 beyond im ygement ith funding agency fe .4 collaborat Prepared bY VANESSA F' ERNANDEZ vice Cnaneetor Noted DAVID VANCE bean"
    },
    {
        "image": "terminal2_synth_12_aug2.png",
        "label": "terminal",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES esearch and Development Ofte ‘Avonas Sweet, Sta. Mesa, Manta 1016 rdo pup edu ph (02) 8716 7832 =? Terminal Report FINAL RESEARCH REPORT SUBMISSION NOTICE Dear Dean, This letter formally transmits he terminal report and final documentation for the research project “Mental Heallh Services Assessment which has been successfully completed as of September 03, 2025. The ‘mult year research initatve, funded by Philippine Council for Agriculture, Aquatic and Natural Resources Research and conducted by our esteemed faculty researchers, has produced substantial scholarly contributons ‘and practical recommendations relevant to Philippine development. The comprehensive terminal report esearch standards. Throughout the project duration of June 2024 to September 2025, the research team ‘maintained consistent progress, regularly submitting interim reports and participating in monitoring and evaluation activites. The project achieved all specified milestones, including community engagement, stakeholder consultations, and dissemination of preliminary findings. Notable achievements include capacity building for Junior researchers, establishment of research databases and repositories, development of research instruments that can be used by other scholars, and creation of networks with national and international research institutions. ‘These outcomes extend beyond immediate research objectives and contribute to institutional capability enhancement Financial management was conducted with utmost transparency and accountability. Regular ‘audits confirmed compliance with funding agency regulatons and institutonal financial policies. All procurement followed proper procedures, and project expenditures were justiied and documented appropriately. This project, demonstrates our insbtubon s capability to undertake large scale research addressing complex societal ‘challenges. We look forward to continued collaboration with funding agencies and research partners in future endeavors. Respectiully yours, Prepared by VANESSA FERNANDEZ Vie Chancetor Noted DAVID VANCE"
    },
    {
        "image": "terminal2_synth_12_aug3.png",
        "label": "terminal",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES Resesich aot Cavelopnert Ctice Aocnas Siem, Sa. es, Manin 1016 Teminal Report FINAL RESEARCH REPORT SUBMISSION NOTICE ‘Omar Doan, This tener formaiiy ranstits the termina! eort and final documentation for hs rasearch praject “Mental Healt) Servicas Assessment which nas been sucessfully compicted as of Saotemoat 03, 2025. The ste your sesearc: initiative unded by Phvigpine Gouna for Agriculture, Aquat and Kuwtal Rasouces Researcn ard conducted by ou: exteamed facutly researchers, hus produced substantial schotavly conmntaions and practical recomwmndations relevant to Philiosne development. The comprehensive theinal report encompasses research mamodaivay. findings, anatyes, and policy recommendations thet meat iniemagenal rosearch standards. Throughout he project duran of June 202+ wo September 2025, the research team ‘rairtained consistent progress, regularly submiling inten reports and partkcioating in rroniioring wnt evaluation activities. The projet aciwoved ai specified milestones, inciuaing comanunity engagement. stakanciaer consutations, and disseminatin of pretrrmary findings, Notable achievements include capacity building for Junior tesearchors, sstabien nent of research databases and teposricres, development of rasearch insbuinents yal can be used Ly olver schola s, end creation of networks wth national and intemnationel rosearch insttuaons ‘These outcomes axtond beyond immediate research objectives and cnctitule to institutional capaniity enizonicement. Financial management was conducted with utmost vansparency and accountability. Regular ‘sudits confirmed compliance with Sunding agency reguiatons and instiutionat fnanciat policies. Ali procurecnent followed prope: provedures, and nroject axpenctiures ware jusbiag and documented aupropriaiely. This project emonsiraies our mstiasbon s canebity 1o undertake large scale research addressing compiax Societe chatiengas. We ‘00k onward 19 cenunued collaboration with funding sgances and research parirers in hiture endaavors. Respoctuily you s, Prepared by VANESSA FERNANOEZ Vee Cranceter Noted DAVID VANCE One"
    },
    {
        "image": "terminal2_synth_12_aug4.png",
        "label": "terminal",
        "ocr_text": "OLYTECHNIC UNIVERSITY OF PHILIPPINES Terminal Report FINAL RESEARCH T SUBMISSION NOTICE cumentation tar tha reseaich graleot the -suort and tinal d esefvly completed as of Septersber 03, 202 abc ana Natura! Resources tantial scholarly comiby oe terminal report mts the termi: ‘whch has been Su ne Coureil for Agriature, A oetcedt sl 1. The comprenany and praehcal recommendations ch matvocolegy, Endings, anniysis, anit policy recnmmensabon: encompaa rosearch standards, Throughout the nieiac ‘uaintainad consistsnt progress, sequiart activities, The project achiewed at speci consultation semination of preliminge junior ree Bat can be used by other 5 These cuicomes extend beyond immediate research abjectives ant consibuly roe tertt, Financial management was conducted with unos! irenspates Notable echievernonte incite canacity bulldiag for Hass, develooment ef savearch inntuments swith national and interabonl rnoparct instuiions: itulional expabtity lxnilty. Raguiar yoticles AV onscurement cvlately. Tels oroject tox gauigt into enh suite contr fovieared proper ers demonsyates cw challenges, We iagk iueward to continued 2 endaavers, Respecttity sour, 1 samen eaduies, and project oxi"
    },
    {
        "image": "terminal2_synth_12_aug5.png",
        "label": "terminal",
        "ocr_text": "Y TEGHNIC UNIVERSITY OF THE PHILIPPINES Reseach and Develapaient Otten Anonas Street, Su Mona, Mania 1078 rea eup ect a} 378 7832 1 SATS UNOS EE SSR OSS SEPM GNSS SUSE A ETE AS TIS HEA IS Terminal Report FINAL RESEARCH REPORT SUBMISSION NOTIC! forthe 88 of September 03, 2 aich inswelve, tudes by Prifipaine Comer ar Agieutture, Aquatic ang Natural Resour stoomad faculty sesearchers, has pa unsiantiat schofarly contabutio ntto hil omen. The comprehensive terminal report etinterrational docacnentat saath profes psshully corsa junior researcners, ssiabisiiment of research datahanes and repositories, d ‘that can he used by ether acholors, anu creation of networks with national ane infernational esearch insdtutions. yond iamadisie research objectives and contibate to insttitionsl capabilty ment was conducind with ulmost transparency afd accountabibly. Regu ih hanging agency reguiations and inettutior: AA pioeurement ject expenditures were justified and dour 's capably t uinderlske iarge soaie esearch add cnnbinued eoitaboradon with funding 2 inencial polis wented angropitately. This project challenges. We lin future endeavors. Res Prepaced by Noted. DAVID NCE Dean"
    },
    {
        "image": "terminal2_synth_13_aug1.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY oe €? Raseuteh aed eave Hoe Rattan Avenue, Lavan Heights, Quezon Cty 1196 erpearchtatenac. 20 (a) 2426 8001 Terminal Report FINAL RESEARCH REPORT SUBMISSION NOTICE Dear Vice Preskiant for Academic Alfsirs, This letter serves as formal notificalign of the successful completion of the research project titted “Climaia Change Adaptation Study” conducted und tha suuspices of this institution and fended by Coenmission on Higher Education {CHED). The research tearn, les by Cynthia Valdez and comprising distinguished faculty members, has successtully completad alt Project deliverabies within the stinwated iimeline of June 2024 to August 2025. The terminal reeert, executive summary. and all suopleneniary documentation have been pravared in eecontarice wth institutional and funding agoricy requirements. Key accomplisherens of this research inclte comprohensive dats cctection and anslys s, publicallon ceady manuscripts, policy raconmendations, and practical applications ralevant 'o Phiggine higher education and developers peivities. The findings contribute sigrificancly to the bady of kneakedge in this fiak! and provide actionsabie insights tor stakeholders. All financial obligations have been settled, and the first accounting report hes Dewi submitted to the Finance Office. Equipment procured through protect funds has bsen property inventoried and transferred to the appropriate acadomic tits for continued institutional use Wo express cur sincere rtitucs for hw instittion’ suppeet provided throughout the peoject dumtisn, Tha research outcomes roflect positively on our institutions commitment io academic excellence snd community service Respactiusly submitted, Prepared by JACQUELINE SANCHEZ MD Oeparnect Cree Noted ‘SUSAN MAXWELL View Mrousent ty Aawdeme bites"
    },
    {
        "image": "terminal2_synth_13_aug2.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY office of Pasar and Smativa More Aueru, Lovele Heighta, Quezon Cy 1196 ‘Terminal Report FINAL 8 POR? SUBMISSION NOTICE BEARCH Ri succevafel ear Vice President for Academic Atala. Tih camnplation of the rsscarch project titled “Climate Change Adaptation Stuy” auspices of this inatitulion and funded by on on Migher Education led by Cynthia Valder ing dlatingulsbed facurty mambwrs, has suocessh project deliverables ‘within the siipuaiad timeline of June 2024 te August 2025. The termin pared in accordance with of this research inelede ication seady manusciins, policy recommendations, ang 3, The findings pder the Tie eesearch team ty completed all ra xt comprt contribute significsnly t¢ the body of krawledue in tis fh Leholders. fil financial obligations have be onal the final ance Office. Equipment orecured thn the epprootiate acaden: sitetionel supeort provides tongheut the po ively on our institut itmont 1 acedernt properly inventcvied sional use. We express ay si curation, The mesarchs setoomes nrmunity service ie units for continued cone reflect posi Respectiuiy subinitiee, JACQUELINE SANCHEZ 6 Noted SUSAN May Vion Pansiterdt fer"
    },
    {
        "image": "terminal2_synth_13_aug3.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Sica at Senoares and Greate Yea, Heieunan Avena, Layee Hagtas, Gunoon Cty 68 sssrabdpatenea 20k (02) $a78 00 PORT SUBMISSION HOTICE Dear View President fer Academic Affalre, is totter S us fcemal notification of the euccesshd Coniplatian of the research prelactitied “Cimate Chang Aduoiation Study\" eaorkicted undoe tee Suspines of ths instidion and hundedt ty Commies on on Higher Education (CHED) 7 wuulshed faculty members. hye iipulated timeline of June ‘eed la: Cprtis: Valder and ceensr sic bigject delivenbies within the si Sxceuve nimmary, ood ofl sursteraentery documentatian have heen Prejnared in accordance with Insthitioral and furding agency roauiramands. Key acceenelahments ti seevnatch inshudt Compchensive data cadction and analysis, aublinstenoudy manserpte, Boley ecommnensiatians, and Practical anpicetions celevsrt to Phitingres Higher education an Geo Sispenert pricing. Fhe findings Contibute significarty to the body of kaowladigs i de fied gens Prwvide actionable insights far taksholsers. All fhanciei oigations have bade eetled. ai! tha fond socounting repo nas bon suismitted ta the Finance Office. Equipment procured {ivesygh prmject funds hes heen propery inventoried ari transfered ia the apercpriate scaderic nits for contin lnstitutional use. We express aur sincere Sead fort instal suzprtsroviced teougtout the Project duration, The research avicomes fect poskivety on our institution s commitment to ecsderni ene fo and community service, Rasnecttiy submits research tearm, 2028 10 August 2825, Tha terrainal report at Prepared by JACQUELINE SANCHEZ MD Sepncinem ange Noted SUSAN MasaveLL View Prasidant for Sesame Aces"
    },
    {
        "image": "terminal2_synth_13_aug4.png",
        "label": "terminal",
        "ocr_text": "a) 8328 c04 Tewinal Report SSEARCH Ry SUEMISSION Ny adeenic Ay /e8 as forma ai tation of Feet led \"Cimate Che stitution ara! fancied by Somes: Vaiciez anit comising cisting, verabios wi Stipulated tin plemontacy nding agency cuuin auspices of led by Gye Study\" conducted undar th Won OF Higher Eaueation (Cp Fed faculty line of douumentotion hav been p repent in Sof thi nanuse: Key acc: analysis, publi, ation ready ppine higher etsnation ilicantly t9 the vex, AN finan, Submittes to the &: holder is actionable insta ial ob fits te inal account Wd the fi procisred thenugh py report has bean fe oxpreas our s Hatitude for the iY OF our ins! fect duration. The Respecttully stbenits academic excel ch oeorae and community seyvic SANCHE? Nov"
    },
    {
        "image": "terminal2_synth_13_aug5.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Cian of Peuanch and Saention Wow Kotoavan vere, Layola Hemme, Quazan Cy 1160 reerarch utanee es aR AST NN cers Taminad Report FINAL, ROH REPORT SUEiM HON NOTICE Prasidant for Acad mt of he reaparch prok auspices of ths ina led oy Cyn project dst mie Altai is (eller serves as fonmal not ct lied \"Ciimste Change Adaptation: Stuy’ a fad by Com vation of the successtul con 2 Edvcatinn (CHED) The mecaich team, has successfully completes all ist 2025, The terminal report, within nated rons of dene 2028 to 8 uuive summary. ard al! supplementary decumentat been prepara! in wcconiance with nstlcesat ar hunting agency reamere te Key compichensive dats vollaction id analyse, p onstesdly mans ant to Philippines higher education ily te the body of knewledge in this fiatd and have beer ibinitted to the Fixznce Office. Equlament gece ferred to the appropriate acasiomis, unite for o raltusie for the institutional sunpon provisos th reflect positively on eur inetitetion s has nis has been preps We ought the prelect duration The «essa beans 'y inventories’ our sincere aeomes ty servi commits demic excalisnes anc gomerunt Brepered by JACQUELINE Denadnen Chae Noted SUSAN ASWELL ise Srositens foc Deadenss Aifues"
    },
    {
        "image": "terminal2_synth_14_aug1.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE MANILA Office of Research 2nd keatpunan Avenue, Lovo COMPLETION OF ities. Financial utilizat institutional potices. All unused submitted to port and guidance from the 23 titution s dedication to liquidation reports have been unwavering St exemplifies our ins! priorities. Very truly yours, research ateneo (02) 8426 6001 UNIVERSITY crestve Wor ‘Quezon Cty 1108 eau Terminal Report ELIVERABLES RESEARC! to formally submit ‘Student Performance” which \"and community QrOuPS documented and audited in counts, and necessary on has been properly funds have been rett the Finance nitration throughout this res: ing knowedge that addresses H PROJECT AND FINAL O' that may lead to rumed to the appropriate ac ‘and Accounting Offices. Prepared by JEFFREY UNDERWOOD Deparment ha Noted MRS. MELISSA KNAPP Lnwersty President the terminal report for the ‘was conducted from January 2024 to completed research ‘accordance with We appreciate the ‘earch endeavor. This project national development"
    },
    {
        "image": "terminal2_synth_14_aug2.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY qeriainal Rep ort EARCH PROJECT AND FINAL COMPLETION OF Ri thee co! from Jara The veseacch nv subrnit the te yas conducted ed tc forme! aim piva on Student Pedtormnan sernat F i Oaifioe pga vader th airing WnPat ne financial SuPF fished, with sidan signific arabies specifier cavigated various che ont of O compre! va enn folky cpjeativen he fine suudy 18S andanis and ethical coanenunsty apis research nateriais thet vi ste partrerabins at may from ecaden bp pract 509m vafarence presentations, pote ‘Wie have alee est izations, and C pen govermental organ aunities. F ial uth nes sser furs Ha 2 apgropiate orices, We counting jnstite paren endeavor liguidat gubmitted to the Fin ation Heoughout Bs soport and jautions Se edge yours. oP EREN MRS MELISEAKNAFP"
    },
    {
        "image": "terminal2_synth_14_aug3.png",
        "label": "terminal",
        "ocr_text": "COMPLE Dear University Pr project “Griine Le Septsraber 2025 a va been fully iippine aication aed s setistactorly. 7 turing the pardemis paviod, ieseaich protcenis, Despit resgarch pract and broader society. Ye has pporiurities, Finan Institutional noticias. Al Jquidotion reports hax wavering support and ‘exemplfies our institution prlotties. Vary beer val recat. The sty has yisided si ghost the project. ATENEO DE MANILA UNIVERSITY Sittin of anaseca and Crentiva isch Ralgaman Avene, Layens hte, Quecan Cy 1195, ators ese ARCH PROJECT AND FNAL 8M pleased te fermally submit the terminal rept for the compl fect on Student Pertornance” wich was condusted from Jen f Evhication Research Office, F accomplished, vansive findings documented rat cont deliverables specified in the resem’ proposed awe ot Ssfisly navigaiod varicus chalenges ‘swordination wits igritican grOUpS, and adaatoton t maintained Ngurous acade Puts fom this research inclusie peor: ce S, snd waining matatiats that wil hers 0 also eatablishedt Hons, and corn rment ager fo Futwe collaborative groups ‘summed te the apprepriate accat \"submited to the Finance and Acrounting CF inistmation throughout thie research endeavor ing knowiedgs thel adsresses nay JEFFREY UNDERWOOD Depsinet it Noted MRS. MELISSA KNAPP. Ete to addressing artical issues DELIVERABLES research Ty 2824 to Re research ie n complied Jvctuiing data collection sings indards and ethical ces. We appreciate the Rls paujoct nal development"
    },
    {
        "image": "terminal2_synth_14_aug4.png",
        "label": "terminal",
        "ocr_text": "sone Aree Wop ae Mens Catron ERY 11 seeaentatere nny Ker sett APE SARNIA UN LOR DETERIORATE PION IC OS LOE AEN ON Fermatanal Report OF RETEARCH PROJECT AND FINAL DELIVERABLES he taeminal rept for the complnted reser Hort Hertornance” vibtch wae conducted fon January 274 10 upper of Deperurent of Education Reswurch OF Dojecitves huv9 bon filly accomplishes witit comprenersive finalags docutsirtest in the atiac’ ot J repost The stucly has yieitad sionficast waits thet cuntituie to addewesing critical isstee ity Lon and sox aty Ali detiverabiws specitied ta ihe meseacch prouusel have bees: comple! factory Tha vesese! ily nanigaled vasiars Challanges inchuting Gate COM tion the: pavulenvc period ccexdination wih mutighe slakehwidor GiCUpE, snd asaplation to avelving are pitincels Despite hese cbsinctes, aw inairtained dgorwus academic sisndanty god ethical restarch procticar throughout the peaiect Outinats fron this ressarch irchust peervevinwed oubhications, conferance peoseetations. policy beats aud training malecials that wi benefit the acagomic comemersty aaxt beasdder society Ye have ished v cae parinersnaps with Goverment aqencia nongovernmental oranizations. and community groups thet mzy lead 10 future coftsboramtive opuenunities stig mon hes vee proparty documented an aurited ordance att a punkcles AE Ln. 0 Hat acproptiate accounts, and necessary othe Finance ant Accounting Offic ns We arpreciie the fren the axinsnistraticr Nocagieans ths cescarch ardeavar Ths prfort J nooaledge thas adchesses national davetarcicet foamaiy su08 Tie esearch team succes’ 54 peperts huae boon submived Ueaaventey SuBpaR 2 exempites our viorilies ary Prepared! PREY UNDERWOOD! MRS MELISSA Kt oPP"
    },
    {
        "image": "terminal2_synth_14_aug5.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY ‘piece of resus und Ginave esi diner, Lupo Hgts, Gumeon ty 1108 cogerrenGoteneu ede 52) BID AS enemas tent DA TANCE Terminal Report COMPLETION OF RESEARCH PROJECT AND FINAL D Deas University Presisert,! am plansed to formally submit the termina mio for he completed resaaenh project \"Crile Learirg linpact on Studtert Performance” wiih was conducted from Janahy 2028 te Coplember 2025 under the fiancial eupaort ot Onpartment ot Education Research OFReo, The wes ct shlectives have bests ceenpiished, sath comprehensive fndings dacumanted {n the attacked amino! ror. The shady hea yiekded skwificant resus that cenit to adrossing orca! sss Philippine education and society, Alt deiverabies spectted in the rexeecch proposal fiwa Doe compteted getistactonily. The resoaich team successhily tawigated varus chelienges including date colec ton cising the pondermic ported, couenetion with rmitinie stakecider groups, ant adaptation io evolving cceoarch prtocels, Donte these cbstacies, we maintained rigorous acodamic standarcs and slhiea! recearch practices throughs the project, Outputs from this reanerch inciues peer reviewed publications, confarence presentations, psiicy blefs, ane! training materats that wil benef the scacmic cominurvty cae broader society. We have alge established valuable parinedshiges with govamment egenciss qongoverrmentel orgstizations. and coment groups thet mary teal te future cotiedavaitee Siization bas twee properly ckacumented and audited in accordance with ad junds heve heen retumad to the appropiate eccounte, orc! necessary tiguidation reports have ben submitted 19 the Finance and Accounting Offices. We appreciate te ng appa aed quidurce Kom the administration throughout this research endenves. THES prfec fon ta generating krsanioniga tiat addresses national developriatt Prepeced JEFFREY UNDERWS Secsemnat Cra MRS MELISSA RMAPP ante Price"
    },
    {
        "image": "terminal2_synth_15_aug1.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE sarccongiatenen ede ie. ‘Tareninal Repart RTIFILATE FOR RESEARCH GRANT PROJE projuct “Guality Ass ruult yeae feszatch Inikative, fended by Phiigpine Coun Roagarci: and conducted by aur esteqmed facut e504 encomnasses 163681 0. the ragagrch ean reports and participating in monitoring and eval iSing community engagement, stakeholder Notas vemenis inuitde capac riainteined cor sclivites, The gn consultations, and dissers sete that can pe used! by other se These eutcomes extend beyond enhancanens Financiai si auchts cons followed proper proced of expenditure: strates our insliutor s capability undertake uniieages We tack farward to continued collaposeaion wii neavans, Respacttally yi fod all spanitad milestones, ation of preliminary ctr of researen 63! in netaores wi ve and coninbute fe insiititens! capatiny veney Bex! acocuntabety. Raysiar and creation nadiae research objec sted wi ations a uiimost tanspa saty. Ths pres x societal yors in vue CARMEM THOME Noted ICA COLLIER,"
    },
    {
        "image": "terminal2_synth_15_aug2.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY fine ef Rene qian anid Cenatve Ps Keteunan Avenue, Layols Heights, Genes City 1 reseurzhiBatenco edy Terminal Repart COMPLETION CERTIFICATE FOR RESEARCH GRANT PROJECT rie reportend fas! dccumentaton sail Pebraty 28, 2026. The hare, Aquatic and Natural Resournee arly euntabubons Dear View Chancellor. This tether formally tanzmils the terraina project \"Cauaily Ast on” wihici nas been sh by Phikippine Council for Agneu 6 produced suostantal so in ve, tone ‘cut esleamed txcully research and oractical recommendations relevant ta Pokippine development, The comurehen: nadalogy. tndings, aalys recomineadations 19 project duration of Octuber 2024 te Fauniery 2026, seponts and pert 28, including vornmunity engagement, SiskoHokser javenents incite capacity bulaing instuments Rezearch and conducted at peat nlemations! sagt team evaluation encompasses research sterwdaves, Tr cad a8 spe ation of prolratary search daisbuses and tepostories, development af rezear ner acholars, and creation of nedwarks with rationat and inten junior researches hai can ne usea by ase cultomes exiand bazorid bnmedials reswarcti obj anhancement Financia! manageinent was conducted wlth stm with funding agency reguizhons and instiviians thianciat policies, Ail wocurement ening appropriately. This project dressing complex societal 108 and reseanen nartners in fot inathations austits cunfrmed complian Foner piO0e! inetiution s sop enges. tha look fore2ts to continued coltaborslion wil nfo uridestate arga scat th handing agen: eporet by CARMEN THOMPSON Pregysm Bite sted JER JESSICA COI View Ghancoter"
    },
    {
        "image": "terminal2_synth_15_aug3.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY ‘lee uf Fans asen end ieatve Yk Termlnel Report THON i ATMFIGATE F OR RESEARCH Gi This fetter formality trangmus th Peohest Caualty Assurance in Edtcations mu iat IeDOr and final documentyton, Substantial schoiaay contrib! nprshes 'v fecamtnandiations that me Hons encompasses i teeearcn nt prog 1, DuiGtly Bubmiting tntants repens anc paticisstng is monitaring ar ‘aclivties. The project achieved ali speniion Including community engagement, sazohoiaer consutatians and dissemi ation of preliminary tndings funlor researchers, exabhshinent of hat can be usec ins adter schotan These outcomes aszons beyand ancemant. Fina ‘olabie achievements incinde cape, search dalsbases and ro tories, Govetoomn: Ae Gealion of newovae wth national and inerational reewane institutions, mediate research objectives an conkni nnatstiona! capabiity ncial Management was corehiciod wy most transparency aid accountabiity aie confirmed compliance with tasting agency rapulat ROICIES AN procrement iollosent peapar pmcedures, eng nrojact expencie (98 Were j led appro Semonstatas our inst abil undertake inuas scale research addressing eon cham We look iorware to continued Heboration wht Renda enoeavers. especialy sf research instr stifed an Gocumey it s agzicies and rese: Derbiers in tuiuees Prepacod by Noted JESSICA COLLIER Wee Shanaetir"
    },
    {
        "image": "terminal2_synth_15_aug4.png",
        "label": "terminal",
        "ocr_text": ""
    },
    {
        "image": "terminal2_synth_15_aug5.png",
        "label": "terminal",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY lon, of Peuuacch ane Crate Wore Renguran Avene, Covela Neng, Cuezon Sty 1166 ‘Yerminal Repart COMPLETION CERTIFICATE FOR RESEARCH GRANT PROJECT neniotion fer the ese Hebmuaiy 28, 2026. The ral esewrens Dar Vics Chanceior, This fetter Rar projert Qually Assurance in Eduction” whieh 4 research initiates, tundies by Phiippine ly complstoc as utara, Aguatic an sty nd oraek ippine develop: encom analysis, andi pel saaearch stand Br won of etek: rain pinitieg intenm reports and partespatr actvlliss. The orojec! achieved aif specified miisstones, including community angegement, stakeholder consulta ngs Notabig achievements include capacity ouilding for bases and repositories, development of resaaich instruments, af namworks with national and sniematicnss research instiakons 7d cominute w institutions! capatiiy 1oted with utmost vansparency and accuuntabiny Regwlar suds oratimed compliance win funding agency seguistions and institution! Mnencial policies. A procuremer followed proper plocedures, and srajact sxpst vere justiied ang documented appropriately. This prajsct eg ut Ens Bhatlon uly to uneartake large scale sesenmch adeassing Complex societal foo foowatd te woration with funding agencies and ch pavtners in four ortuty yous, that can be used hy These outcomes extend beyond eb Prepered by EN THOMPSON Prager Eimer Heted SSICA COLLIE Vice Chameans"
    },
    {
        "image": "terminal2_synth_16_aug1.png",
        "label": "terminal",
        "ocr_text": "POLYTECHNIC, UNIVERSITY OF THE PHILIPPINES Research and Development Offer ‘anonas Street, Sta. Mesa, Mania 1016 .eduph (02) 8716 7832 Terminal Report CERTIFICATE FOR RESEARCH GRANT PROJECT COMPLETION ts the terminal report and final documentation hhas been successfully completed as of for Academic Affairs, Ths letter formally transmit ‘search Council ofthe Philippines and forthe research project \"Mental Health Service® “Assessment” which February 28, 2026. The multi year research iniaive, funded by National Re: Conducted by our esteemed faculy researchers, Nas produced substantial scholarly contributions and practical <erommendations relevant Pilippine development “The comprehensive terminal report encompasse® research Tecommendations that meet intemational esearch standards. methodology, findings, analysis, and policy ‘Throughout the project duration of November 2024 ‘p February 2026, te research team maintained consistent progress, regularly submitting interim reports and participating in monitoring and ‘evaluation activites. The project a epeved al specified milestones, including community ‘engagement, stakeholder consultations, ang ‘Gissemination of preliminary findings. Notable ‘achievements include capacity Dulding for Junior researchers, iments that can be used bY etabishmentof research databases and reposiione®, development of research instru Sther scholars, and creation of networks with national “snd intematonal research insbtutions, These Uc! swtena beyond immediate research objectives and vontrbule to institutional capability enfrancement, Financial management was conducted with utmost ransParerey ind accountability. Regular audits confirmed compliance vuth funding agency regulations and institutional nancial policies. All procurement followed ProPer procedures, ‘and project expenditures were justified and ‘documented appropriately. This project demonstrates institution s Capability to undertake large scale research addrese0d complex societal challenges. We [ook forward to continued collaboration with funding agencies and vnearch parners in future endeavors. Respect YOU S, Dear Vice President! Prepared by REBECCA SMITH Program Director Noted AMANDA PAGE Vice President for Academic Aftais"
    },
    {
        "image": "terminal2_synth_16_aug2.png",
        "label": "terminal",
        "ocr_text": "POLYTECHNIC UNIVE! PHILIPPINE RSITY OF THE ana! documentation \\eations 12k y, fasings, anotee the project durst ve lermunalr ees et 202 ort 6 nes, inch fiona and ietarnational bute fe insitutiona ransnerency 4 capably ta undone o1 search addressing conipiex soviet: hariners in fature 20 ued covaboration with tunding agencies and"
    },
    {
        "image": "terminal2_synth_16_aug3.png",
        "label": "terminal",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES seusesen anu Dec nuns Smee, awe ENS saosgen ea 2) TSG TORS sor Terminal Rep’ att epic CERTHICATE COR RESEARCH GRANT PROVECT 2 sins eosumnentatier year viens Brosidontlor AS genic Aine, THe Het socmatry want a rein eoport eee eecech project Msn vregits Senvioss Assegernot rst es Be n auceesIAY computa as of Pebrsary 26, 2026 THe TURE YEA ae nae, funded SEE research Corns EP cipaines an woe rari eoswarcwers, HBF raced sunctabal seheaary Roamans on or et Tee comm peeTei 9 th EO BE nipanges fenen\" ona concearch aTHEOESS, ur #6126 voievand to PHssopine HET ps vats. 2rd DEY TP ecuaraien preemie 262 soe waste nes, inches ding, soatabie ah wearer aatebases 20d PEATE ‘op nanents t sense bons fe Ferry 028, he OSA ating i mon songucneed BE ecco mnatsadoingy, tng ‘ragougha! te BOHR progress, eaguiatt pacite rhe mac interna aps ergentainien erence MCAS. as, an raaercondor consunaor puting got eas artt rawearch snahtysor® at capaity OES! The orate seis anc parte regasyornens, bg ican CADBOT 5, deveroomne! eng, convened Se cevtend Devers eA remngseh oninceres pagavnent xa corte #7 cenaet vanssar ney a4 accounts raps ing gener ease gna natnations! iz yroncies. AB oar prOceGuTes, yack axpensatares Were Fe ishfad and gomamenter septs, Tas protec Seen uit bssstuores srgeriake 1a\" ger sea SENT suctes ey eocinist cnatien ges WE 6% forward 19% governs, RS PACH FUE: capa fine conden gysaong agancs 2 cont ato wat ‘Noted ARABNDA POE oe Soin for haste MORSE"
    },
    {
        "image": "terminal2_synth_16_aug4.png",
        "label": "terminal",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPH. Researah and Development Office weet, 3a. Masa Terminal Report 2 RESEARCH GRANT PROJECT ally wansmits ine terminal spoitand final cecumentation vocesstully comp! fine Ph \\y costibutions ana orackes facuity reves! elev2nitts Pit dings, eualys hers, has prog velopment. Hf ehoompasses research mendations national research statisarcs, ‘Yhraughout the pinjact diwton 5 ulatly Subrriting intern reports and Sisseralaation of pretinanary findings. Not of teseatch database rotars, and ch bie achievars ry butiaing fo ofresearch in athe: exiens beyond inmmedtiat sha repositorias, 19n of networks with mallona! and internat fegnarch objectives and contioule fo inatiuto cred wilh utr manogeimest wes with funding ct expensiluies were j fled ant dee scale resuarch ndaressing complex societal ch as, SMerH Noted AMANDA PAGE Vion Presse for dloatornic iia"
    },
    {
        "image": "terminal2_synth_16_aug5.png",
        "label": "terminal",
        "ocr_text": ""
    },
    {
        "image": "terminal2_synth_17_aug1.png",
        "label": "terminal",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS ‘redoate Debos! Research Caner spate Boviowars, Sampatoe, Marts 1015 Terminal Report RESEARCH TERMINAL REPORT AND PROJECT CLOSEOUT V8 Capability to undertake fessarch acinunsing compen socteiat challenges. ‘We look tonward to AGENCIES Bn reseaIch paxtners in future endoavers Respecttutly yours, Prepared by DAVID WooD Dean Noted GRACE FRANK"
    },
    {
        "image": "terminal2_synth_17_aug2.png",
        "label": "terminal",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Graduate Schoo! Research Center Espafia Boulevard, Sampaloc, Manila 1015 research ust edu ph (02) 8731 4031 SS Terminal Report RESEARCH TERMINAL REPORT AND PROJECT CLOSEOUT Dear Dean, This letter formally transmits the terminal report and final documentation for the research project “Digital Literacy in Basic Education” which has been successfully completed as of July 24, 2026. The multi year research initiative, funded by National Research Council of the Philippines and conducted by our esteemed faculty researchers, has produced substantial scholarly contributions and practical recommendations relevant to Philippine development. The comprehensive terminal report encompasses research methodology, findings, analysis, and policy recommendations that meet international research standards. Throughout the project duration of August 2024 to July 2026, the research team maintained Consistent progress, regularly submitting interim reports and participating in monitoring and evaluation activities. The project achieved all specified milestones, including community engagement, stakeholder consultations, and dissemination of preliminary findings. Notable achievements include capacity building for junior researchers, establishment of research databases and repositories, development of research instruments that can be used by other scholars, and creation of networks with national and intemational research institutions. These outcomes extend beyond immediate research objectives and contribute to institutional capability enhancement. Financial management was conducted with utmost transparency and accountability. Regular audits confirmed compliance with funding agency regulations and institutional financial policies. All procurement followed proper procedures, and project expenditures were justified and documented appropriately. This project demonstrates our institution s capability to undertake large scale research addressing complex societal challenges. We look forward to continued collaboration with funding agencies and research partners in future endeavors. Respectfully yours, Prepared by DAVID wooD Dean Noted GRACE FRANK Dean"
    },
    {
        "image": "terminal2_synth_17_aug3.png",
        "label": "terminal",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Seveuste Seta! Research Canter Betemonbatadaot Terminal Report RESEAHCH TEHAINAL REPORT AND PROJECT CLOSEOLT Dear Dean, This ieties project “Dighal Liter The rag formally tranvemits the tenninal report and floal docu fer the teseach in Basic Education” which fas tien successfidly completed as of duly 24, 2006 ‘yede reseurch inkiative, funded by National Masewrch Counc of the Plilipsines and conductee! by cir esteumod fouulty meacatchars, has pradkiced sutstartisl scholany comtdbutione anal practice! iececiimeciations ratevant so Phiippine development, The comprahensivs temning! nport encompasses ‘esearch rathodology, findings, analysis, and pel recommondatone thal moet inturnationa! sesaserh Starstich. Througizost the project curation oF August 2024 to July 2026, the reseator tea memainad Sevelstent progass, regularly subeviting interim rapodia and particigating fr momtaring and evaluation ee The project achinved ai speci! casters, including comiaumily angugemans, staeholier consultations, and deweminavion of pretiminacy ments Inckete capacity tuildieg ‘or junior resaauchers, extabishmient of eszarch dataioses and sppotiioren development of saseanch croitisn of natwevts with national anu iatemsatlonal mis, These outeomes extend beyond imniasivie msearch objectives and curttbuta io instlnslonss cepabilty enhancement, Financia! managemere was conducted with utmost 1 sheparsncy and 's confined comotiancs wih funding agency regudati ional renelc! paliees, AY geccurwment flowed proper procedurss. av project expencitines were sth ceaauatted spproptiaily, This peaject demonstestes aur Insttatlons capably fo undertake farge se feseach adanosing complan eucivial challenges, We leok forazed ie contnued ecilabenition with fueiog Aguncien aed reseaich partners ir Tulum endeavews. Respactiuly yours Prepared by GRD WORD: Osan Noted GRACE FRANK"
    },
    {
        "image": "terminal2_synth_17_aug4.png",
        "label": "terminal",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Graduate Schoo! Research Center Espafia Boulevard, Sampaloc, Manila 1015 research ust edu ph (02) 8731 4031 Terminal Report RESEARCH TERMINAL REPORT AND PROJECT CLOSEOUT Dear Dean, This letter formally transmits the terminal report and final documentation for the research project \"Digital Literacy in Basic Education” which has been successfully completed as of July 24, 2026. ‘The multi year research initiative, funded by National Research Council of the Philippines and conducted by our esteemed faculty researchers, has produced substantial scholarly contributions and practical recommendations relevant to Philippine development. The comprehensive terminal report encompasses research methodology, findings, analysis, and policy recommendations that meet intemational research standards. Throughout the project duration of August 2024 to July 2026, the research team maintained consistent progress, regularly submitting interim reports and participating in monitoring and evaluation activities. The project achieved all specified milestones, including community engagement, stakeholder consultations, and dissemination of preliminary findings. Notable achievements include capacity building for junior researchers, establishment of research databases and repositories, development of research instruments that can be used by other scholars, and creation of networks with national and intemational research institutions. These outcomes extend beyond immediate research objectives and contribute to institutional capability enhancement. Financial management was conducted with utmost transparency and accountability. Regular audits confirmed compliance with funding agency regulations and institutional financial policies. All procurement followed proper procedures, and project expenditures were justified and documented appropriately. This project demonstrates our institution s capability to undertake large scale research addressing complex societal challenges. We look forward to continued collaboration with funding agencies and research partners in future endeavors. Respectfully yours, Prepared by DAVID WooD Dean Noted GRACE FRANK Dean"
    },
    {
        "image": "terminal2_synth_17_aug5.png",
        "label": "terminal",
        "ocr_text": "Yenninat Report RESEARCH TERMINAL REPORT any funded by tartial scholarly c: The com uration of Augy cra repr he cosparch team maintained nts include Capacity uliding neoworks. with pat institutional sretitty ey regulations and institutional GRACE FRANK"
    },
    {
        "image": "terminal2_synth_18_aug1.png",
        "label": "terminal",
        "ocr_text": "DE LA SALLE UNIVERSITY Research Coordination Office 2401 Taft Avenue, Malate, Mania 1004 research dsu edu ph (02) 8524 4611 ll Terminal Report FINAL RESEARCH REPORT SUBMISSION NOTICE ter formally transmits the terminal report and final documentation for the ,en successfully completed as of August 23, conducted by Dear University President, This le research project Climate Change Adaptation Study\" which has be 3025. The mult year research intatve, funded by Department of Education Research Office and cur esteemed faculty researchers, has produced substantial scholarly contributions and practical tecommendations relevant o Philippine development. The comprehensive terminal report encompasses research ‘rethodology, ndings, analysis, and policy recommendation that meet international research standards, ‘Throughout the project duration of April 2024 to August 2025, te research team maintained consistent progress, regularly submiting interim reports and participating in monitoring and evaluation activites. he project achieved ail specified milestones, including community engagement, stakeholder consultations, and dissemination of preliminary findings. Notable achievements include capacty building for junior researchers, establishment of crsvarch databases and repositories, development of research instruments that can be used by other scholars, vend ereation of networks with national and international research institutions. These outcomes extend beyond aii eclate research objectives and contibute to instutonal capabiliy enhancement. Financial management was ‘Conducted with utmost transparency and accountabiliy. Regular audits confirmed compliance with funding Soency regulations and instutonal financial policies. All procurement followed proper procedures, ‘and project ‘expenditures were justified and documented appropriately. This project demonstrates our institution s capability to cmdertake large scale research addressing complex societal challenges, We look forward to continued ‘ollaboration with funding agencies and research partners in future endeavors. Respectiully yours, Prepared by EDWARD DAVIS Program Diector Noted MITCHELL VANG Universty President"
    },
    {
        "image": "terminal2_synth_18_aug2.png",
        "label": "terminal",
        "ocr_text": "2 UNIVERSITY DE LA SALL seh Qeoretnation OF santo, Mana 1 nag Ya avers Yerminal Report SUBMISSION NOTC PINAL RESEARCH BE! rat aocureentation 1 Hh 445 of Aust she termina’ report ane on successtuiy oo onl Tals fetter frre sar University Pest nesnasch praject camate Onan Atactsot ‘stusiy’ wien tas Ba sialive unded by santot Equeation Resear: ioe aM cone sted By yout vasearchs ur eaigeried meutty ese stUheN ciimencations rarevent io PA jabal eohavariy eonsbas Jo termi 2028. Tre mult has prentucee Substal ane davionmedt, The sp resbaxeh unenddatons that meet pind to Augask 2025, the reseetch teen AEE participating in snanioniea 3° on activites nity engagement, skenaises chesie capacity Dull f yo istrea iat report ono? standart ined consistent eroures™ qin pinjact aoniaved isgnanination ot 5, agtablisnent of eompennensi ‘ponings, anatase, ana paikey \"ee sion of APS scm ropsts ar including comm proliminary Brings, Rela ache RE Meewearen databases and repose, GAVE dana cxeaton of netics with sation anf veer are eomte resnaren anyeckves ane contol 6 ingtvutional capaiity en ennteschadd with Ue 7 ney sna accountability. Regular audits CoN joeney requiazons ane wisttichonal 2N8F i paces. All procaramert Ritowed 0° sea and iceuniented apprograiety THIS 9 splget damon’ sng corapten sociedst chatenges, 28 jook forward to con partners in fate enefeavars: RUSE ry YOU, jamnant of cera, Finatteh 2 nomgliancs with TuNZiNG per procedures, 370 Br seates out reatiution s Cabal) 1 continued angie regeaich aad Tonging agencies end 12528 ungorake ‘aiyaration with Prepawed dY EDWARD DAVIE Pragrass Oneeta Hated RATOHELL VANS ivessty Presinat"
    },
    {
        "image": "terminal2_synth_18_aug3.png",
        "label": "terminal",
        "ocr_text": "DE LASALLE UNIVERSITY Research Coonsnaton OfiCe ‘neo Ta Avera, ata, Mare OOH senearcnGpows et i Yerminal Report FOWL RESEARCH REPORT SUBMISSION NOTICE repodtand sna docasmerienten fe te “succerstiy comerated a8 of Aergust 25, Rempsach OMe art Coneircted By formally Wansents the leer ‘Susy whuch hat been socintal chatlenges We (09% cincenake targe scals rannacch acaressing Comme lenseavorn, ReapactBy YOUN, research partners mn NO Frepwed by EOWARD DAVIS rogram Dent Noted MITCHELL VANG Unmeraty Prevent"
    },
    {
        "image": "terminal2_synth_18_aug4.png",
        "label": "terminal",
        "ocr_text": "DE LA SALLE UNIVERSITY research dlsu eduph (02) 8524 4611, Terminal Report FINAL RESEARCH REPORT SUBMISSION NOTICE Prepared by EDWARD DAVIS Program Drector Noted MITCHELL VANG University President"
    },
    {
        "image": "terminal2_synth_18_aug5.png",
        "label": "terminal",
        "ocr_text": "LA SALLE UNIVERSITY Conidinaton tice Terminal Repert SEARCH REPORT SUBMISSION NOTICE pur esteenied faculty earche, fh svantto Philippine deveisame methodology findings, analysis, and patiey recammenc ‘Throughout the ar fi prelininary all specified milestone: ings. Hate! iy ou developmental research instrume ng toe junior researchers that stitutions 7 Fosuoreh ava astiutonal capability tabilly Regutoe aualts acy and x nd institutional nani fuies were justi undertake large scale np wclicias. All procurement totio 6, aNd proiect nied appcopiiafely, This project semana capabiiy t Doras MITCHELL VANG:"
    },
    {
        "image": "terminal2_synth_19_aug1.png",
        "label": "terminal",
        "ocr_text": "POLYTECHNIC UNIVE! PHILIPPINES ITY OF THE Resear and Terminal Report sn a a i cl ct ef em titled “Climate fea tt hens es et a Department of Education Research Office research team, led by Jeremy and comprising eto a as SUCeSShuly competed al projns within the stipulated timeline of March 2024 to March 2026 The terminal report, Prepared by ROSE SIMPSON Program Drector Noted EDGAR JOHNSON:"
    },
    {
        "image": "terminal2_synth_19_aug2.png",
        "label": "terminal",
        "ocr_text": "POLYTECHNIC ONIVERSITY OF THE PHILIPPINES Resoasst end Oavelosment eo Ataies Brees, Ste Sows, Wteeea tte \"Cop oh pes Mids 8798. 7as2 Terminal Report TERMINAL REPORT SUBMISSION AND RESEAFC: COMPLETION NeTiCE Dear Dimetar, Ths later tiled “Chmate Change fd Saves as format ratification of the succes! complation of the research project Pitiine Sualy” conducted wl the austicas of thie Institution ane fried ty Department of Education Racmarch Office The cosearch tea, ed by Sonsmy Bammer and comprising istinguistad fy obs, has uy com torstinn of Merch, et all ojact deliverables within th rch 2026. The termed recor, executlve Ssitinany, ard all sepstemerteny Sutuiventattor have bean prepared in secontance nt kstutlonet ond feveing agsrey rectéremente Sxconiplishimenta ef this rnsearch incuse cern nessive data extincten are anlyels sudication rancty amwscriets, gol actical appications relevant to Phitinging higher education and evelopment peontion, The tne tontbats 5 acy of kewego in this fale sui Browioe actionable Insights for atakeheltars a fesse been Setting, ar the Reosurdlog oport has been subenitad fo ty stiulated mmendstions, ane py ane Office. Eseiproten eeocued txcesgn Peojnct finds ‘ss bosn properly inventoried ext (anstaned to the seprogiigte acdc: ie We exseess exw sincare gy continues institutions: hunt the aeojsct curation WH 10 academic excatisnee and ‘The reseaich outcanas retiec ORMIURY Sorvice. Rearacitis SHU for tha inatiutlonal support provided throug Bositivaly on eux insitiaion s conni y suberited, Noted EDGAR JOHMEOy Birecioe"
    },
    {
        "image": "terminal2_synth_19_aug3.png",
        "label": "terminal",
        "ocr_text": "POLYTEGHNIC UNIVERSITY OF THE PHILIPPINES events and evelapsiant Ot nee Seas, Sta Mesa, Manda 1D16 ite. edu. 2) 8718 7882 oe et Re SAAS ODI OSE WBS EW ASIA RRR SO ‘Terminal Report TERMINAL REPORT SUSMISSION ANG RESEARCH COMPLETION NOTICE tu coraplation of the research project 4d this iuslitution: anc funded tye Wy Bennatt and compesing distingsinhed faculty members, he ompsted ail prmject deliverables within the stipulated simeling of March 2024 to Merch 2026, The terminal repott, executive summary, an doountest proptrad in accordanes with inslitstional andl fu accomptist reyenach tories c tection publication raady manwscipts, policy recommendations, anc! pr ppine hight education ond development pricsties. The findings contilbauta significantly to the hody of xnowied: ron provide actionable insights for stakeholders, Ail francial obligations have been settled, and the final accounting meport has been submitted ts the Finsnee Office. Exulpment procured through pmisct funds has beer: propery inventoried and tranafered! fo the approurfate academic unity fos continua use. We express our sincere gratitude for the institution! The r comes net iv on our insti! camimunity service, Respectfully submited, titutional ppoit provided thraxghoud the project dara tis commitment ia seadeniec exe int ont 5 postin Frepored by ROSE SIMPSON Progrom Oeesioe Noted EDGAR JOHNSON Shroxto:"
    },
    {
        "image": "terminal2_synth_19_aug4.png",
        "label": "terminal",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES. snd Develonment Office 3, Mania 1016 Anonas Terminal Report TERMINAL REPORT SUBMISSION AND RESEARCH COMPLETION NOTICE, Dear Director, This letter serves as formal notification of the successful completion of the research project titled \"Climate Change Adaptation Study\" conducted under the auspices of this institution and funded by Department of Education Research Office. The research team, led by Jeremy Bennett and comprising distinguished faculty members, has successfully completed all project deliverables within the stipulated timeline of March 2024 to March 2026. The terminal report, executive summary, and all supplementary documentation have been prepared in accordance with institutional and funding agency requirements. Key accomplishments of this research include comprehensive data collection and analysis, publication ready manuscripts, policy recommendations, and practical applications relevant to Philippine higher education and development priorties. The findings contribute significantly to the body of knowledge in this field and provide actionable insights for stakeholders. All financial obligations have been settled, and the final accounting report has been submitted to the Finance Office. Equipment procured through project funds has been properly inventoried and transferred to the appropriate academic units for continued institutional Use. We express our sincere gratitude for the institutional support provided throughout the project duration. The research outcomes reflect positively on our institution s commitment to academic excellence and community service. Respectfully submitted, ROSE SIMPSON ProgramD Noted EDGAR JOHNSON Director"
    },
    {
        "image": "terminal2_synth_19_aug5.png",
        "label": "terminal",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF TH PHILIPPINES Feesninal Report OM AND RESEARCH CON omplation of the research project institution and func my Bennett ard camp ation Bear Direct ditied “Climate Change Adup ducted under minent of Education Research OF jesearcin team. ted by J embers, has diy completed ali peject deliverables within the stipula ry, and all supplementary funding agenc vel analysis, put os, end practical appisati U9 Pb re Ng eh icant to he body of krotaig nth lar ot this res accomgiishment: arUeRAS, paty y re bute 5) fo siakeholders Mi fractal n submitted to the Finance Office Fie funels nas been proply invari! ane transfert othe appropri eoac gratitude forthe inst sitively on ots submit use. We Therese community Prepared by ROSE SIMPSON rogenen Fo Noted EDGAR JOHNSON Duector"
    },
    {
        "image": "terminal2_synth_20_aug1.png",
        "label": "terminal",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS wot Pumaren Centar Repute Racevard, Sompaine, Mats 3 seszarchagues (OD) SrsM4035 Terminal Report COMPLETION CERTHICATE FOR RESEARCH GRANT PROJECT Dear Desi, This tet sorteaety tanemis the terminal report “Disaster isk Managemess nal docurnentatinn or the resaacch erniact Revsaich which nas been successtuy complstad as of Eebruaty 14, 028 The Reoded by Nalional Research Council ef the Philippines end conducted ty oor ie tau resacchars, bas prorhuced substanieal schaiasiy contibutans ans peaches cecamtoneandatons ‘plevari le Phiiopine devsingmans, The canigeenensiva feminal repr encnenpassns reeneeen matiovotogy, Soeings. ataysis, end poley recommuandanons that meat email esearch santede Theoughout toe projet duratin tha reasearch Seger mainteined constsient progewss, i Aubnvtting iiteiien reports and participating tn manitory Techiewed alt Spanked pitestones tncacing community engagement solder sancustons, ai cmsaminaon ot Brolitnaty Endings, Notable achievements increde capecity hiding for junio: tesm Heanarch Gniatases and resostones, development of Ani tiaation ofnetwares wi inmiealate feseatch obiscivee en cortivui to inedhitonal capably entencernsct financie mansyerent es Conduched wits wines! fanseaiancy and accantabiy. Rasadtar audits confined comotanre with fy ring Sushey regulations ard instttonsi fnancie! notcies, Al araouement osee miner giocacizes, ant nralvet Spends were jetted and documented appropiate. This prcisel detnonsicates out retin capabisty i WAGeraie tarde scale sesvaich adcressing congiax saeielss halionges. We tock forked o canteweg ‘Sotiahoraics wih funding eeancies and rasgarch partner in iulure endeavors, Respacthlly yous ACOs eaten beso Prepared by MICHAEL WRIGHT Osan Hotes COREY MARTINER ean"
    },
    {
        "image": "terminal2_synth_20_aug2.png",
        "label": "terminal",
        "ocr_text": "UNIVERSITY OF 3ANTO TOMAS COMPLETION CE ANT PROMEOT mentation forthe reseaich maieet 4 2028 of Feomuary 4 ond this! Jeesshily caranieted Council of he PRINS ANE signs, on DACA eat Des “oygaster isk Man esearch init reseaicne s weyoionmnent es contninst conenendanons ‘encompasses wesenten mewn gates Trougrsucthe awk astaemess as prostuced suestantal schol sive terminal rep 09% relpvant 5, aad pone HEC consistent nag cingis, aay aintained proiact duration at Fensiary 202 Guemitong interim “pons ad PATEARCS ede cluding carne inary sang. No Jitapons, and dissemi astapissronent of vay ttt Bo cep istnannerts NBL poonai capa! sudits ecniravedd compa jos prover proces rabonal aed ote! eau yes, Al RI ‘rg piovest 2 res, and praiec om s capably t@ ayated with uemost any regulations ana snsotunenal fi sephaiey monsivates Ou social chatienges. complex pe naure enieavors Rest is patinat’ Beas EY MARTINES Dean"
    },
    {
        "image": "terminal2_synth_20_aug3.png",
        "label": "terminal",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS Graduate School Research Canter Espafia Boulevard, Sampaloc, Manila 1015 research ust edu ph (02) 8731 4031 Terminal Report COMPLETION CERTIFICATE FOR RESEARCH GRANT PROJECT Dear Dean, This letter formally transmits the terminal report and final documentation for the research project, “Disaster Risk Management Research” which has been successfully completed as of February 14, 2026. The multi year research initiative, funded by National Research Council of the Philippines and conducted by our esteemed faculty researchers, has produced substantial scholarly contributions and practical recommendations, relevant to Philippine development. The comprehensive terminal report encompasses research methodology, findings, analysis, and policy recommendations that meet international research standards. Throughout the project duration of February 2024 to February 2026, the research team maintained consistent progress, regularly submitting interim reports and participating in monitoring and evaluation activities. The project achieved all specified milestones, including community engagement, stakeholder consultations, and dissemination of preliminary findings. Notable achievements include capacity building for junior researchers, establishment of research databases and repositories, development of research instruments that can be used by other scholars, and creation of networks with national and international research institutions. These outcomes extend beyond immediate research objectives and contribute to institutional capability enhancement. Financial management was ‘conducted with utmost transparency and accountability. Regular audits confirmed compliance with funding agency regulations and institutional financial policies. All procurement followed proper procedures, and project expenditures were justified and documented appropriately. This project demonstrates our institution s capability to undertake large scale research addressing complex societal challenges. We look forward to continued collaboration with funding agencies and research partners in future endeavors. Respectfully yours, Prepared by MICHAEL WRIGHT Dean Noted COREY MARTINEZ Dean"
    },
    {
        "image": "terminal2_synth_20_aug4.png",
        "label": "terminal",
        "ocr_text": "UNIVERSITY SANTC TOMAS Graduate Sotps! es Fabata Bexdevard, Rants 1915 rohQust couoh ara Terminal Report TUFIOATE Foy reve SMPLETION OF) Rt RESEARCH GRANT PROJECT Dear Gear, this ies formiatiy trenacaits the tema t Research” a8 OF Fabriary 44, 2 ofthe Philippines ang conduct ariy Contibutlons arc grace Counest Pas growed eutieaaey velopment. The ccmprehars 8, 8nd policy reconyenday Piviedt duration of Fetzuary 2024 w Feprary 2078, cee iris tepoits ane parScioatng in maint Raladig comemaniy engagement stakeneiter conn ations, an nunsey frdings, Newbie schicveme eabacity building tor junior re SeEStCh daisbaves ars ropositaries, devsionmmunt of enseare’ iasirarn ahd creation of networks imation research inst lomediste resnarct oni {9 insiutions! capahisiy eduction with SATENCY and accountability. Regular au *ioitionay ted by ous tial sohes Fecommenaatins atch methonoicay CATCH Standards, 7 findings, analy ial FBpor encemnp. that mivet international powgheut the sient prowess, ex 8 fesearch team maintai ng ae actilles. The ‘dissemination of NBS, estahtisnman: of 0 Ue By other exon Hons. These outcomes ext ahcament Eman, alte contre? coy ti Beyond iia rhanazement was ‘ance with funding hentfahiowed vroner proceed Blolect demonstrates aye 2NG0S. We took forwara in talure ence treat te agency regulatons and ins ip contineed Respectioy yours, Prepared by MICHAEL. wri Dean Noted Y MARTINEZ eur"
    },
    {
        "image": "terminal2_synth_20_aug5.png",
        "label": "terminal",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS seatuote Expats Boslevard, Sara researchdust 6 74 cr sation 19 1 rah dooumer ror te research HO} sfity completed quasi at Bie PREIGEE vy cantibations net the ferminat report a winigh nas Been SUCKS yal Reseateh Ci Lesianial schol pina report en sonal regnatch sis fonnaty wanes as orFet mask Mariagement Reeearel” swatiative, fund enpit yeat 128 gsigemet F enisive We ropment ung that mest int 26 tne reset wing and avait i, sizhatio! finsings, analysis, and pebey <ecorNe projectduraion of Feorvary 2024 16 F vuiniting nteris reports ans oarcat siigstones, peieding commen\" ig im mowite junior rengarenens, e836) gutcomes extend bey management ¥85 rota achiew ig with atineat nc te\" ihe: bute to insti nnancemant ational canatilty compliance at fit ang sesaatch objecilzes 896 anspaten aguiar audits conmemedt mant fobnwad proge eronedures, and PTOse stn continined ely, This project ig took formard 6 jusuied ana document sang research acesyeS5in9 COME siag and rosea Stare Ww anes Prepared MiCHy NRUGAT Dean nutes pear"
    }
]