[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "; CERTIFICATE ‘of ‘COMPLETION {| ‘This is te certify that i u i Brandon Bolton ha eted the course 7 Front Office Services i NCH on i August 16 iT pater comets ae is wos aces watana sgnskes"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "1 CERTIFICATE of COMPLETION i i Brandon Bolton i H has completed the course"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "Ge CERTIFICATE of COMPLETION This is to certify that Brandon Bolton has completed the course Front Office [Pervices on wugesy This 8 computer generated conticte, tis vad even witout signature"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION i Brandon Bolton i bas completed the course I Front Office jPervices"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "| This is to verily that Hi Brandon Bolton has completed the course i Front Offige Services fon i on i August 16 i j 2007"
    },
    {
        "image": "tor_synth_11_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "Se CERTIFICATE of COMPLETION This is to certify that Abigail Medina has completed the course Health Gale Pervices January 18 2025 This 2 computer gorerated comticat, is vad even witoxt signanae"
    },
    {
        "image": "tor_synth_11_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "nnn CERTIFICATE of COMPLETION a ‘This 3s to certify that i Abigail Medina | i bas completed the course i i ~~ eps sh bs Health Gare Services | SEP |"
    },
    {
        "image": "tor_synth_11_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "ate TESDA CERTIFICATE of COMPLETION ‘This is to certify that Abigail Medina has completed the course Health Gare pervices on January 18 3023 rita a computer gonarated conical, tis vad even weno SPAN"
    },
    {
        "image": "tor_synth_11_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "ahete. CERTIFICATE of COMP “This is to contify that LETION Abigail Medina has completed dhe cour 8 Health Gare Services aith GP on January 18 2023 crn s xeon genre cates XS eos ere soos Ba"
    },
    {
        "image": "tor_synth_11_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "an ann SE an eel ae a We CERTIFICATE of COMPLETION | This is to certify that Abigal Medina i og the Health Gage penvers wary 18 eraser RCE UAE EM, 1 Hal ON NOS MINS '"
    },
    {
        "image": "tor_synth_12_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "% TESDA CERTIFICATE of COMPLETION This is to certify that Cole Welch has completed the course Caregiving NC II"
    },
    {
        "image": "tor_synth_12_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "& i CERTIFICATE E of COMPLETION Cole Welch | hus completed the course i | Caregiving NC Il |"
    },
    {
        "image": "tor_synth_12_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "& CERTIFICATE of ‘COMPLETION This is to certify that Cole Welch has completed the course Caregiving NC Il on Fer 008 04 por generat even wanons sagnature"
    },
    {
        "image": "tor_synth_12_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "= TESDA CERTIFICATE of COMPLETION ‘This is to certify that Cole Welch has completed the course Caregiving NC \\l Febnie 04 ‘This is a computer ganerated certicate ints vad even witout signature"
    },
    {
        "image": "tor_synth_12_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "ceRTIFICATE of COMPLETION 5 to certify that Cole Welch jas completed me eORRERE Caregiving NC ll F reg 4 Zo08 ses nin He"
    },
    {
        "image": "tor_synth_13_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE ‘of 4 COMPLETION This is to certify that Cody Anderson has completed the course Driving NC Il seg? a oun ia a compan gonratns comms Sones —uasor ere naa"
    },
    {
        "image": "tor_synth_13_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "ae arama Ba CATE of COMPLETION This ia to cestify that Cody Anderson jas completed the corse meee neecaataals ee CERTIFI Driving NC Hi sigs 8 conn geno cont, 22 ai en WO seen"
    },
    {
        "image": "tor_synth_13_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "TESDA CERTIFICATE of COMPLETION ‘This is to certify thai Cody Anderson has compieted the course Driving NC I Saga e° Thee ie 2 congas gunncatad caercank, Km WIS oven wimONt MENS"
    },
    {
        "image": "tor_synth_13_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "& CERTIFICATE of COMPLETION This is to certify that Cody Anderson has completed the course Driving NC II on “3598 This is a computer ganerated cerdicate, (18 valid even witout signature"
    },
    {
        "image": "tor_synth_13_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION This 1y to certify that Cody Anderson has completed the course Driving NC Il Ms 8"
    },
    {
        "image": "tor_synth_14_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "Ste Ne CERTIFICATE of COMPLETION Phis is t corufy that i David Hall bas completed the course Dressmaking NC I on"
    },
    {
        "image": "tor_synth_14_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "TESDA CERTIFICATE of COMPLETION This is to certify that David Hall has completed the course Dressmaking NC II Mn January 27 2022 Lomputer generate Yon without signature"
    },
    {
        "image": "tor_synth_14_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "Ko i TESDA CERTIFICATE of COMPLETION This is to certify that David Hall has completed the course Dressmaking NC II January 27 2022 This is a computer generated corticate, iis valid even witht signature."
    },
    {
        "image": "tor_synth_14_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "Si CERTIFICATE of COMPLETION This is to certify that David Hall has completed the course Dressmaking NC II January 27 2022 This is a computer generated cortticate, tis valid even without signature."
    },
    {
        "image": "tor_synth_14_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE This in David Hall has completed the course Dressmaking NC Hf fy che"
    },
    {
        "image": "tor_synth_15_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "& CERTIFICATE of COMPLETION This is to certify that Dr. James Evans has completed the course Tailoring NC II July 01 1997 ‘This a computer generated cemticate, X s vad even wehout signatre"
    },
    {
        "image": "tor_synth_15_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "Si CERTIFICATE of COMPLETION This is to certify that Dr. James Evans has completed the course Tailoring NC Il on July 01 1997"
    },
    {
        "image": "tor_synth_15_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "& CERTIFICATE of COMPLETION This is tc certify that Dr. James Evans has completed the course Tailoring NC tl July 01 1997 The ia Cancer ganaciied CORES 4 i vais eur wma Seo"
    },
    {
        "image": "tor_synth_15_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "& CERTIFICATE of COMPLETION This is to certify that Dr. James Evans has completed the course Tailoring NC II July 01 1997 a computer gonerated contiicate, is valid even without signature."
    },
    {
        "image": "tor_synth_15_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "ete TESDA CERTIFICATE of COMPLETION This is to certify that Dr. James Evans has completed the course Tailoring NC || July 01 1997"
    },
    {
        "image": "tor_synth_16_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "ity ae CERTIFICATE of COMPLETION This is t0 cer ty that Patricia Anderson has completed the Hare Masonry NC I duly 29 2003 3 ra toes ogee"
    },
    {
        "image": "tor_synth_16_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "Si CERTIFICATE of COMPLETION This is to certify that Patricia Anderson has completed the course Masonry NC II July 29 2003 ‘This ts a computer gonerated corficate, tis vad even without SnaNi e"
    },
    {
        "image": "tor_synth_16_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION This is to certify that Patricia Anderson has completed the course Masonry NC Il on July 29 2003 This isa computer generated corticate tis valid even without signature"
    },
    {
        "image": "tor_synth_16_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "i CERTIFICATE of COMPLETION This is to certify that Patricia Anderson has completed the course Masonry NC II on July 29 2003 This i a computer ganerated coniicte, i valid even witout sgnatire"
    },
    {
        "image": "tor_synth_16_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION ‘This is to certify that Patricia Anderson has completed the course Masonry NC II Juiv 29 2005 1 Semis, 4 8 volt enn wd SIAN"
    },
    {
        "image": "tor_synth_17_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION ‘This is to certify that Laurie Sandoval has completed the course i Plumbing NC |] on August 26 300"
    },
    {
        "image": "tor_synth_17_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "ARN —— ooo Ge CERTIFICATE of of COMPLETION TRis is to cost ey thag Laurie Sandoval has eu pleted the oxas ares Plumbing NCH"
    },
    {
        "image": "tor_synth_17_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "ny CERTIFICATE of COMPLETION ‘This is to certi vy thal at 1 iH 1 Base Sandoval pleted the course i H L Plumbing NC il i"
    },
    {
        "image": "tor_synth_17_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION This is to certify that Laurie Sandoval has completed the course Plumbing NC Il on August 26 004 ‘This is a computer generated centicate, ti vad even wahou signatire"
    },
    {
        "image": "tor_synth_17_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "= CERTIFICATE of COMPLETION his is to cestify that i 1 ie Sand Laurie Sandoval | Plumbing NC Ii"
    },
    {
        "image": "tor_synth_18_aug1.png",
        "label": "tesdacertification",
        "ocr_text": ""
    },
    {
        "image": "tor_synth_18_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION This is to certify that Tammy Contreras has completed the course ds Assent BR ones, PENH i on ORS 09 Hr generated corticate, fis vad even wahout signature"
    },
    {
        "image": "tor_synth_18_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "Coe i TESDA CERTIFICATE of COMP This is to certify that Tammy Contreras LETION has completed the course Asset Arnis Eng NC ul on rave computer govt corseate, «8 vad even wine snature"
    },
    {
        "image": "tor_synth_18_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "ie TESDA CERTIFICATE of COMPLETION This is to certify that Tammy Contreras has completed the course Assembly anf Seracue cil Cctpbes 09 Th computer generated corte, 1 ah even witone signatice"
    },
    {
        "image": "tor_synth_18_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "cernmicare’ of COMPLETION This is to certify that Tamm y Contreras ‘bas completed the cours tronics «Products ang S Sereing| Nic Ocipbas 09 ‘SO De Goneate cee, ia aie en ithe skpnute"
    },
    {
        "image": "tor_synth_19_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "Co ti TESDA CERTIFICATE of COMPLETION This is to certify that Mark Morris has completed the course Graphic Design NC HT] July 10 2012 hie a compceer"
    },
    {
        "image": "tor_synth_19_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION This is to certify that Mark Morris has completed the course Graphic Design NC Hi on July 10 2042 Tis a coe gacwenta onrStenke, 2 baked aver wives metre"
    },
    {
        "image": "tor_synth_19_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "Si CERTIFICATE of COMPLETION This is to certify that Mark Morris has completed the course Graphic Design NC III on July 10 2012 ‘This is a computer generated cortticate tis valid even without signature."
    },
    {
        "image": "tor_synth_19_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "This is to oonity thot Mark Morris has completed the course Graphic Design NC iW July 10 2042 TE HE ce esbiecl oncate 44 Sale yey WHA ater"
    },
    {
        "image": "tor_synth_19_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION This is to certify that Mark Morris has completed the course Graphic Design NC III on July 10 2012 ‘puter generated certicate, tis vakd even without signature,"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "ng CERTIFICATE of COMPLETION ‘This ts to certify that Kathryn Sawyer has completed the course Computer Systems Servicing foal on Maish 02 9 compute: genera samba, 4 valet even wate tigree we,"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "Kon ie TESDA CERTIFICATE of COMPLETION This is to certify that Kathryn Sawyer has completed the course Computer Systems Servicing March 02 ‘This a computer generated certticate, 16 vakd even want"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "Son ti TESDA CERTIFICATE of COMPLETION This is to certify that Kathryn Sawyer has completed the course Computer “kei Servicing Mag 02"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "TESDA CERTIFICATE of COMPLETION This is to certify that Kathryn Sawyer has completed the course Computer syste Servicing Mag? edi wey COOL APES,"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "ny CERTIFICATE of COMPLETION This is to certify that Kathryn Sawyer has completed the course Computer Kei Servicing Mapp 02 ea a a computes gonarated coricate 41 vad even wanes SIPane"
    },
    {
        "image": "tor_synth_20_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "iG TESDA CATE of COMPLETION This is to certify that Marissa Jacobs CERTIFI has completed the course Contact Cantey Services tangas 8 ria ln a computer goneraned conscase, 818 wad even Wat OF"
    },
    {
        "image": "tor_synth_20_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "TESDA CERTIFICATE of COMPLETION This is to certify that Marissa Jacobs has completed the course Contact Center Services January 04 2013 Thin a canon pret RAC, hs Ad I A EIS"
    },
    {
        "image": "tor_synth_20_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "TESDA CERTIFICATE of COMPLETION ‘This is to certify that Marissa Jacobs bas compieted the course Contact Center Services om January 04 Dots TIS 2 CORNY Gane Lome, HM ad mu Ns BhgrURS,"
    },
    {
        "image": "tor_synth_20_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "Son ti TESDA CERTIFICATE of COMPLETION This is to certify that Marissa Jacobs has completed the course Contact Cent Services Re amy 4 <ontcate, 88 Vad even wtoxe signet."
    },
    {
        "image": "tor_synth_20_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "Cos na TESDA CERTIFICATE of COMPLETION This is to certify that Marissa Jacobs has completed the course Contact Seater Services on January 04 20 1 Seneratedconticate, tls vad even wiht signatre"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "& CERTIFICATE of COMPLETION This is to certify that Eric Mejia has completed the course Electrical Installation and va enance NC ll on Maghre ‘This is a computer generated cortticate, tis valid even without signature."
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "& TESDA ATE of COMPLETION This is to cemity that Eric Mejia CERTIFIC has completed the course Fl R GAS March 22 Nm ee"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIF: ICATE of f COMPLETION This is to cer Eric Mejia ! has compieted the course i 4 ' if ore RSeEN r ASH gered i9 ad id ope atten ps."
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "Ko TESDA CERTIFICATE of COMPLETION This is to certify that Eric Mejia has completed the course ale fice Installati ntenanc SNe, Mag 29 This is a computer generated coriicate it 's valid even without signature"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "& TESDA RTIFICATE of COMPLETION This is to certify that cE Eric Mejia has co —_* course \\ ani penance NE ‘way? rina compra goreses crm, a vats even mato aaNe®"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "TESDA CERTIFICATE of COMPLETION ‘This is to certify that James Krause has completed the course Automotive Servicing NC fi on Mah hes am comouren guneront Satrone, 6 vid evan matt 9"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "| CERTIFICATE of COMPLETION James Krause hus completed the course Autornotive Servicing NC 1! i"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "& CERTIFICATE of COMPLETION This is to certify that James Krause has completed the course Automotive Servicing NC II ‘This fs a computer generated certificate tis valid even without signature."
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "& CERTIFICATE of COMPLETION This is to certify that James Krause has completed the course Automotive Servicing NC II Masts! That a computer generated cericate 4 vabd even weno sqnatre"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "airaenaisedninianeiaireneaesieniapeaeiceannipneetinsnntennstiteneniatensansintanmeaimeiagiinanreentne| 1 CERTIFICATE of COMPLETION i i This is i cevtity that iT James Krause has completed the couse i Automative Servicing NC il em cman genonned camiane, 1 vile coe hens stent, i {"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "Si CERTIFICATE of COMPLETION This is to certify that Philip Fitzgerald has completed the course Shielded Metal Arc Welding (SMAW) NC II on Oxi Tint acomputer generated cortical vad even witout SONaANG"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION This is to certify that Philip Fitzgerald eided Mi re Weiding (Suave NC ll"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION This is 10 cestily that Philip Fitzgerald Oop 03 spear gacerited 12, wa sees rc Sgro th"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "we CERTIFICATE of COMPLETION his is to certify that Philip Fi tzgerald veided M felding (SMe wy) 3 NG i 9 _Oeigg 08 Og cn wi rata"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "| CERTIFICATE of COMPLETION Philip Fitzgerald fy thy detail Arc Weidin (SMAW) NG I] |"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "apt. ng i CERTIFICATE of COMPLETION This is to certify that Christopher Simpson Housekeeping Ne it px overt Cte, ik iS a I MN Hl"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION “Phis is te certify that Christopher Simpson has completed the cours? Housekeeping NC fi July 12 2004"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "| CERTIFICATE of COMPLETION This is fo certify that 4 Christopher Simpson ; has completed the course Housekeeping NC {] | 4 duly 12 2001 i; i Raed Bae cet ms, i"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "We TESDA CERTIFICATE of COMPLETION This is to certify thes Christopher Simpson has completed the course Housekeeping NC i July 12 2004 foam a cmpene RPeOS COS, ais vant oon mates wpeare"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "& CERTIFICATE of COMPLETION This is to certify that Christopher Simpson has completed the course Housekeeping NC II on July 12 2001 ‘This isa computer gonerated certticate, tis valid even without signature."
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION ‘This is 0 certify that Terri Lindsey nas completed the course Cookery NC Il DergaRe sana yoseeacen canal, oer gt"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "| CERTIFICATE of COMPLETION i ‘This is to certify that i Terri Lindsey i Cookery NC Hi \"This 9 eoryaioe qoranaied cures weno wap"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "TESDA CERTIFICATE of COMP This is to certify that Terri Lindsey ras completed the course Cookery NC ii oft sepia ote OAT, RE OLS ic SR LETION"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "Me CERTIFICATE of COMPLETION i ‘This is vo cestify thet i H Terri Lindsey t has completed the conrse tj Cookery NC il"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "~ it i CERTIFICATE E of COMPLETION ti if i Terri Lindsey if Cookery NC i |"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "CoO Mi CERTIFICATE of COMPLETION This is to certify that Dr. Cynthia Bush has completed the course Bread and Fastty Production NC July 07 2004"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION ‘This is to certify that Dr. Cynthia Bush has Completed ihe course Bread and Pastry Production NC if on July OF 2004"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION sto contify that | Dr. Cynthia Bush 1 has completed the course Bread and Pastry Production NC 1"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION This is to certify that Dr. Cynthia Bush has completed the course Bread and Pastr Production NC on July 07 2004 This Computer generated canticate, ks valid even witout signature"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "LO Ni TESDA CERTIFICATE of COMPLETION This is to certify that Dr. Cynthia Bush has completed the course Bread and Pees ‘Production NCI July 07 2004 in a computer ganerated corticate, KS a valid even wihout signature."
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "ATE of COMPLETION ceruty that CERTIFIC This sf Gregory Rodriguez MD nas comple Coad and Beverage Services NCH on"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "i} CERTIFICATE of COMPLETION | ‘This is to certify that i Gregory Rodriguez MD has compicted the course Food and Beverage Services NC th on i September 16 i 2044 Tha ts eorgneer gener curled an mC Sera"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "TESDA CERTIFICATE of COMPLETION ‘This is to certify thar Gregory Rodriguez MD has compleied the course Food and Beverage Services NC ti on September 16 2014 ‘TH a CoN Gannaner CORON, 4 Wa WHER wheat arate,"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "Anoka om csunreuna t CERTIFICATE of COMPLETION This ts to wartify thar Gregory Rodriguez MD fas completed the cogese Food and Beverage Services NC H on"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION This is to certify: that Gregory Rodriguez MD has eo LOUIE Food and Beverage Services NC"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION ‘This is to certify that Shelly Zuniga has completed the course Tourism enter” M apap Trin 8 DEO DUY Qovestoes COTM 6 rand Ou WOT RENNIE"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "tesdacertification",
        "ocr_text": "CERTIFICATE of COMPLETION This is to certify that Shelly Zuniga has completed the course ToueMIoes NOH”"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "tesdacertification",
        "ocr_text": "| CERTIFICATE of COMPLETION i This is toc certify that i Shell iy Zuniga has comy i j \"aneRetapeen igs"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "tesdacertification",
        "ocr_text": "Si CERTIFICATE of COMPLETION This is to certify that Shelly Zuniga has completed the course Toutes Ne IPS on Mapsi® “This is a computer generated cortiicat, I is vad even without signature"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "tesdacertification",
        "ocr_text": "ASS ie TESDA CERTIFICATE of COMPLETION This is to certify that Shelly Zuniga has completed the course SESMLEC potion Maps THs i 9 computer generates cerita, 418 valid even without signature"
    }
]