[
    {
        "image": "thesismanuscript1_synth_10_aug1.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of ihe Poinpives Bache! Science in Bidlogy An oe Waste Segregation System Using Computer Vision BSED 2B Group 6 Sharon Wright Brandy Clark Austin Molina Sarah Brooks Dr. Patricia Gomez 2019"
    },
    {
        "image": "thesismanuscript1_synth_10_aug2.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines University of Know 566 Joshua Flat, Heatherstad, NC 47309 Bachel Science TAs low, An intelligent Waste Segregation System Using Computer Vision BSED 2B Group 6 Sharon Wright Brandy Clark Austin Molina Sarah Brooks Dr. Patricia Gomez 2019"
    },
    {
        "image": "thesismanuscript1_synth_10_aug3.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines. University of Know 566 Joshua Flat, Heatherstad, Nc 47309 Bachel Science eG Slogy An Intelligent Waste Segregation System Using Computer Vision BSED 2B Group 6 Sharon Wright Brandy Clark Austin Molina Sarah Brooks Dr. Patricia Gomez 2019"
    },
    {
        "image": "thesismanuscript1_synth_10_aug4.png",
        "label": "thesismanuscript",
        "ocr_text": "University of Know Bachelor .o Science el Sogy An Intelligent Waste Segregation System Using Computer Vision BSED 2B sharon Wright Brandy Clark Austin Molina Sarah Brooks Dr. Patricia Gomez 2019"
    },
    {
        "image": "thesismanuscript1_synth_10_aug5.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines University of Know 566 Joshua Flat, Heatherstad, NC 47309 Bachel Science EG logy An Intelligent Waste Segregation System Using Computer Vision BSED 2B Group 6 Sharon Wright Brandy Clark Austin Molina Sarah Brooks Dr. Patricia Gomez 2019"
    },
    {
        "image": "thesismanuscript1_synth_1_aug1.png",
        "label": "thesismanuscript",
        "ocr_text": "Bachelor of Arts in English Language Siudies al Time Fail etectiog and ert system or Biden y care Using Deep Leal hg BSCS 1A dustin Erickson Mr. Jonathan Ora"
    },
    {
        "image": "thesismanuscript1_synth_1_aug2.png",
        "label": "thesismanuscript",
        "ocr_text": "Bachelor of A Langue uel Studies A Real Time Fall election and Ale orf System ore =iderly 2are sing Deep Learni ing BSCS- iA Mr. Jonathan Cruz 1989"
    },
    {
        "image": "thesismanuscript1_synth_1_aug3.png",
        "label": "thesismanuscript",
        "ocr_text": "ublic of tne Py ines institute pf figertands Bachelor of Arts in English Language Studies A Real Time Fall electio and Alert System for Ek erly Care Using Deep Learning BSCS 1A Groupit Sharon Wright Justin Erickson Mr. Jonathan Cruz 1985"
    },
    {
        "image": "thesismanuscript1_synth_1_aug4.png",
        "label": "thesismanuscript",
        "ocr_text": "380 Sana 511, Perezsade. Bachelor of Arts in English Language Studies RSP SRS for Pideny Care ee Deep Learning BSCS 1A Groupit Sharon Wright John Cook Savannah Clay Justin Erickson Mr. Jonathan Cruz 1988"
    },
    {
        "image": "thesismanuscript1_synth_1_aug5.png",
        "label": "thesismanuscript",
        "ocr_text": "institute herlands Bachelor of Arts in English Language S A Real Time Fall Detection ana Alert System for Padest Care Using Deep Learning BSCS 1A Sharon Wright fon Mr, Jonathan Cruz 1989"
    },
    {
        "image": "thesismanuscript1_synth_2_aug1.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines University of James Unit 8246 Box 9172, DPO AA 87140 BaGNeASinstration Somniscape: An Al Powered Dream Interpretation Web Application BSCS 2B Group 5 Sharon Wright Dr. Tamara Anderson Matthew Hayes Christopher Maxwell Ms. Angelica Santos 1977"
    },
    {
        "image": "thesismanuscript1_synth_2_aug2.png",
        "label": "thesismanuscript",
        "ocr_text": "dames Bachelor of Science in ‘Public Administration Somniscape: An Al Powered Dream Interpretation Web Application Ms. Angelica Santos 1977"
    },
    {
        "image": "thesismanuscript1_synth_2_aug3.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Priinpines University of James Unit 6246 Box 9172, DPO AA 87440 FAA Gninstrauon Somniscape: An Al Powered Dream interpretation Web Application BSCS 2B Group Sharon Wright Dr. Tamara Anderson Matthew Hayes: Christopher Maxwell Ms. Angelica Santos 1977"
    },
    {
        "image": "thesismanuscript1_synth_2_aug4.png",
        "label": "thesismanuscript",
        "ocr_text": "Renuntic of 2 sity of James agnelor of Science in Bub ic Administration Somniscape: An Al Powered Dream interpretation Web Pplication Group 5 Ms. Angelica Santos 1877"
    },
    {
        "image": "thesismanuscript1_synth_2_aug5.png",
        "label": "thesismanuscript",
        "ocr_text": "University of Jarnes 2 SA nite achelor of Science in hel FB cign ation Somniscape: An Al- Powered Dream Int erpretation Web Application BSCS 2B Group 5 y f Maxwell Ms. Any a Santos"
    },
    {
        "image": "thesismanuscript1_synth_3_aug1.png",
        "label": "thesismanuscript",
        "ocr_text": "Mii ation FecanSe est: iA Task Gam ied aes Ma anagemen syaek, BSCS 3¢ Sroup 4 Sharon Weight Jammie Martinez Paige Henry Tyler Alten Mrs. Karen Dela Peng 1979"
    },
    {
        "image": "thesismanuscript1_synth_3_aug2.png",
        "label": "thesismanuscript",
        "ocr_text": "Acade Bachelor Of Science informations Tee ANGIo, in ay Task G Game Qu vest A Gamified 3 ask Management System BSCS 3C"
    },
    {
        "image": "thesismanuscript1_synth_3_aug3.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines: Academy of Norfolk Island ya a8 Bache} yr of Scienc' in Information Technology Task Game Quest: A Gamified 3D ‘Task Management System BSCS 3C Group 4 Sharon Wright Jamie Martinez Paige Henry Tyler Allen Mrs. Karen Dela Pefia 1979"
    },
    {
        "image": "thesismanuscript1_synth_3_aug4.png",
        "label": "thesismanuscript",
        "ocr_text": "Bachelor of, Information T Task Game Quest: A fsamified 3D Task hanagement System BSCS 3C"
    },
    {
        "image": "thesismanuscript1_synth_3_aug5.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines Academy of Norfolk Island 3469 Php Forges Sute 646, Maynardrouthe 85 wie infornelet OF Seienc ogy Task Game Quest: A Gamified 35 T k Managemes, System BSCS 3c Sharon Wright Jamie Martinez Paige Henry Tyler Allen Mrs. Karen Dela Pefia 1979"
    },
    {
        "image": "thesismanuscript1_synth_4_aug1.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines University of Lay 29538 Hancock Mountain: Ellisburgh, OR 96610 Bachelor of Science in Accountancy Predictive Stud Performance Ree Using Machine Learning BSCS 4D Group 8 Sharon Wright Bradley Ortega James Ruiz James Dean Mr. Robert Mendoza 2016"
    },
    {
        "image": "thesismanuscript1_synth_4_aug2.png",
        "label": "thesismanuscript",
        "ocr_text": "Repudic of the Pritppines Univ ity of Lay Bachelor of Science in Ccountancy Predictive uden Performance Analyse Using achine Leaming BSCS 4p Group Sharon Wright Bradley Ortega James Ruiz James Dean Mr. Robert Mendoza 2018"
    },
    {
        "image": "thesismanuscript1_synth_4_aug3.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines University of L 29538 Hancock Mountains y Bachelor of Predictiy Stud Performance. nal isu alys, sing achine Learning BSCS 4p Group g Sharon Wright Bradley Ortega James Ruiz James Dean cience ancy Mr. Robert Mendoza 2016"
    },
    {
        "image": "thesismanuscript1_synth_4_aug4.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines University of Lay 29538 Hancock Mountains, Ellisburgh, OR 96610 Bachelor of Science ccountancy Predicti d Performance, rae sing Machine Learning BSCS 4D Group 8 Sharon Wright Bradley Ortega James Ruiz James Dean Mr. Robert Mendoza 2016"
    },
    {
        "image": "thesismanuscript1_synth_4_aug5.png",
        "label": "thesismanuscript",
        "ocr_text": "Universi Lay Bachelor of Science in Accountancy Predictive Student Performance Analysis Using Machine Leaming BSCS 4D Ar."
    },
    {
        "image": "thesismanuscript1_synth_5_aug1.png",
        "label": "thesismanuscript",
        "ocr_text": "Elernentary Edu Smart Irrigation System for Sustainable Agricutture BSIT 1A"
    },
    {
        "image": "thesismanuscript1_synth_5_aug2.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines University of Discuss 085 Ashley Dam Suite 991, West Oscar, TX 73863, Bachelor of Elementary, Education Smart Irrigation System for Sustainable Agriculture BSIT 1A Group 6 Sharon Wright Mallory Larsen Rhonda Martinez Sarah Cortez Prof. Maria Isabel! Reyes 1977"
    },
    {
        "image": "thesismanuscript1_synth_5_aug3.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines University of Discuss 085 Ashley Dam Suite 991, West Oscar, TX 73863 Bachelor of Elementary Education Smart Irrigation System for Sustainable Agriculture BSIT 1A Group 6 Sharon Wright Mallory Larsen Rhonda Martinez Sarah Cortez Prof. Maria Isabel Reyes 1977"
    },
    {
        "image": "thesismanuscript1_synth_5_aug4.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines University of Discuss 085 Ashley Dam Suite 991, West Oscar, TX 73863, Bachelor of Elementary Education Smart Irrigation System for Sustainable Agriculture BSIT 1A Group 6 Sharon Wright Mallory Larsen Rhonda Martinez Sarah Cortez Prof. Maria Isabel Reyes 1977"
    },
    {
        "image": "thesismanuscript1_synth_5_aug5.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines University of Discuss 085 Ashley Dam Suite 991, West Oscar, TX 73863 Bachelor of Elementary Education Smart Irrigation System for Sustainable Agriculture BSIT 1A Group 6 Sharon Wright Mallory Larsen Rhonda Martinez Sarah Cortez Prof. Maria Isabel Reyes 1977"
    },
    {
        "image": "thesismanuscript1_synth_6_aug1.png",
        "label": "thesismanuscript",
        "ocr_text": "University of Monaco Bachelgt of. Science in Nursing Al Powered Language Translation for Filipino Dialects BSIT 2B Sharon Wright Edwin Romero Christopher Bell Dr. Anthony Ramos 1982"
    },
    {
        "image": "thesismanuscript1_synth_6_aug2.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines University of Monaco 230 Marshall Lock Apt 549, West Danielville, DC 09808 Bachelor of Science in Nursing Al Powered Language Translation for Filipino Dialects BSIT 2B Group 8 Sharon Wright Edwin Romero Kimberly Sanders Christopher Bell Dr. Anthony Ramos 1982"
    },
    {
        "image": "thesismanuscript1_synth_6_aug3.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines University of Monaco Bachelg of. Science in Nursing Al Powered Language Translation for Filipino Dialects BSIT 2B Group 8 Sharon Wright Edwin Romero Kimberly Sanders Christopher Bell Dr. Anthony Ramos 1982"
    },
    {
        "image": "thesismanuscript1_synth_6_aug4.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines University of Monaco 230 Marshall Lock Apt 549, West Danielvilie, OC 09808 Bachelor of Science in Nursing Al Powered Language Translation for Filipino Dialects BSIT 2B Group 8 Sharon Wright Edwin Romero Kimberly Sanders Christopher Bell Dr. Anthony Ramos 1982"
    },
    {
        "image": "thesismanuscript1_synth_6_aug5.png",
        "label": "thesismanuscript",
        "ocr_text": "University of Monaco Bachelor of Science in Nurs sing Al Powered Language Translation for Filipino Dialects BSIT 2B"
    },
    {
        "image": "thesismanuscript1_synth_7_aug1.png",
        "label": "thesismanuscript",
        "ocr_text": "Academy of Snyder Bachgior of Science in Mathematics An Automated Baran oc gay Health “enter information S$ System BSIT 3C"
    },
    {
        "image": "thesismanuscript1_synth_7_aug2.png",
        "label": "thesismanuscript",
        "ocr_text": "nilippines f Snyder AL Bachelor of Science in Mathematics An Auiomatec Barangay health Center Inforrnation System Mr. Vincent Navarro 1970"
    },
    {
        "image": "thesismanuscript1_synth_7_aug3.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philipines Academy Snyder 369 Hil Pas: Bachelor of Science in Mathematics An Automated Barangay Health Cenier information System BSIT 3C Group 8 Sharon Wright Ronald Jones Bevany Sandoval Thomas Perez Mr. Vincent Navarro 1979"
    },
    {
        "image": "thesismanuscript1_synth_7_aug4.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Prinppines Academy of Snyder Wert Sia, AL ‘3a0 Fee Passage, Bachelor of Science cher ematics An Automated Barangay Health Center Information System BSIT 3C Group 8 Sharon Wright Ronaid Jones Betheny Sendovel Thomas Perez Mr. Vincent Navarro 1970"
    },
    {
        "image": "thesismanuscript1_synth_7_aug5.png",
        "label": "thesismanuscript",
        "ocr_text": "Academ 385 Hil Passage Bachelor of Science in Mathematics An Automated Barangay Health Center Information System BSIT 3C Group 8 Sharon Wright Ronald Jones Bothary Senden al Thomas Perez Mr. Vincent Navarro 1970"
    },
    {
        "image": "thesismanuscript1_synth_8_aug1.png",
        "label": "thesismanuscript",
        "ocr_text": "Acad. em of Jenkins Bachelor F Science in Public Adm Wns L BrainBoost: a A amilied “earning App fo for Aemifiec Improverne nt BSIT 4D tration emic Ms. Joanna Castillo 20a9"
    },
    {
        "image": "thesismanuscript1_synth_8_aug2.png",
        "label": "thesismanuscript",
        "ocr_text": "nkins Raghelor of Science in upblic Acministration wee BrainBoost: A Gamified Learning App for Atademic improvement BSIT 4D Grouptd"
    },
    {
        "image": "thesismanuscript1_synth_8_aug3.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Phiippiies BBE Annee BrainBoost: A Gamified Learning App fr Aca émic Improvement BSIT 4D Groupia Sharon Wright Bryan Davidson Timothy Suiivan Ashiey Manning Ms. Joanna Castillo 2009"
    },
    {
        "image": "thesismanuscript1_synth_8_aug4.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines Academy of Jenkins achelor of Science in age! Administration BrainBoost: A Gamified Learning App fr Zenties Improvement BSIT 4D Group10 Sharon Wright Bryan Davidson Timothy Sullivan Ashley Manning Ms. Joanna Castillo 2009"
    },
    {
        "image": "thesismanuscript1_synth_8_aug5.png",
        "label": "thesismanuscript",
        "ocr_text": "Academy of Jenkins nelor o Science in Ge! AG dministrali on BrainBoost: A Gamified Learning App for Academic improvement BSIT 4D Ms. J Castilio"
    },
    {
        "image": "thesismanuscript1_synth_9_aug1.png",
        "label": "thesismanuscript",
        "ocr_text": "Bachelor or of Science in Criminology A Study on Al Bias Mitigation Strategies in a Decision Systems"
    },
    {
        "image": "thesismanuscript1_synth_9_aug2.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines College of Ricky 941 Tricia Radial Apt 498, Lake Barbara, OC 66464 Bachelor of Science in Criminology A Study on Al Bias Mitigation Strategies in Decision Systems BSED 1A Group 5 Sharon Wright Joseph Rocha Mark Arnold John Mueller Prof. Daniel Villanueva 1985"
    },
    {
        "image": "thesismanuscript1_synth_9_aug3.png",
        "label": "thesismanuscript",
        "ocr_text": "Bachelor of Science in Criminoiogy A Study on Al Bias Mitigation Strategies in Decision Systems BSED 1A Group 5"
    },
    {
        "image": "thesismanuscript1_synth_9_aug4.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Phiippines College of Ricky Bachelor of Science in Criminology A Study on Al Bias Mitigation Strategies in Decision Systems BSED 1A Group 5 Sharon Wright Joseph Rocha Mark Arnold Jonn Mueller Prof. Danie! Villanueva 1985"
    },
    {
        "image": "thesismanuscript1_synth_9_aug5.png",
        "label": "thesismanuscript",
        "ocr_text": "Republic of the Philippines Colleae of Ricky ‘e941 Tricia Radial Apt. 498, Lake Barbara, OC 66464 Bachelor of Science in Criminology A Study on Al Bias Mitigation Strategies in Decision Systems BSED 1A Group 5 Sharon Wright Joseph Rocha Mark Arnold John Mueller Prof. Daniel Villanueva 1985"
    }
]