[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "tor",
        "ocr_text": "PUP TROR S UNRO O27 ATO Rev. 0 N wp eQVB QO 2013 02 15 2003 08 09 Republic of the Philippines a wr mam wm way wasrwan wa an &fry Roilins Academy OFFICE OF THE UNIVERSITY REGISTRAR a GRADUATE SCHOOL STATE U ooo a OFFICIAL TRANSCRIPT OF RECORDS Student Nurnber 1721487 Student Name o Ralph Turner Date: 2001 08 26 Address 54836 Holden Stream Apt. 696, Archeriand, NY 05770 Date of Admission 1970- 07- 28. oe a. Entrance Credential Transcript of Records from “ee gare an wane ws ahelton, Arias and Waiters University Elementary School Gilbert, Russell and Si immons Univer iy oo Year Graduated 9023 High School Shaw PLC University Year Graduated 1986 College Flores Richardson College Year Graduated 2001 Attended: Semester: 4 Summer: 2 {= ees v B r E c T Cees I ENTRANCE DATA: i “GRADUATED with the degree of Master im Philippine History and Governance i (MPA) on 4982 12 28 from Underwood PLC Academy Port Lindseyshire || per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003.” 1 <n ann _Pemty Rollins Academy ss GRADUATE SCHOOL i 4980, Summer i ACI 905 Research Methods in IT 2 15 4 1 Object Oriented Programming 7 857 esorenedrors adhe 1753 FHX 553 systems A Analysis and Design, 995 5 | i ami 99a} Obiject- Oriented Programming 2 AD 4 I || SUL472 7 Digital Logic Design 3 00 9 | 1994 2015. Second Semester i ORL 887. Systems Analysis and Design 2 00 a | XGR O48 Software Enaineerina 2 00 3 1 OOM 770 Project Management _ 2 25 5 i OPH 246 Mobile Application Development 2 50 5 it 2006 1978. Hirst Semester || UJH 069! Object Oriented Programmi ing 1 75 5 iI ii ¢ ie flop r ae i CAT 809 i gveranea 3 00 5 I] 2019 2017 _Secand Semester || EN 278 Business Process Reengineering 978 5 ii TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 1999 07 25 || X X K X K X X K K X X K X K K K K K MK K B R E X- Nothing Follows -x x X X x M M x X X K K X K X N X X M M K K K K 1 copy ror: Clark and Sons Academy 1 7444 Elizabeth Via Suite 088, New Robert, MH 81170 Vi i if a i gE Be i 1 if GRADING SYSTEM 1 00 97 100% a 23 94. 96% 5150 91 -93% 5 1 75 88 90% 2 00 85 87% 2 25 82 84% | 2 50 79 81% 2 75 76- T8% ; 3 00 73% 5 00 Failed P Passed NC No Credits | INC leeomaplets W Withdrawn UW Unauthorized Withrawal. TS One college unit is at least seventeen (17) full hours of instruction in academic or professional || hee subject within a ies sal se 6 OF se fnorEnry A AND MONEY ACCOUNTABILITIES. Checked Vs Kar en M ae e DVM wag versity payis"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "tor",
        "ocr_text": "Rev. 0 2013 02 15 2003 08 09 Republic of the Philippines Bowrmem een ne.--~ ~..Perty Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR idl =~ GRADUATE SCHOOL Sees STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 1721487 is Fe) ~~ Student Name ee Ralph Turner Date: 2001 08 26 Address 54836 Holden Stream Apt. 896, Archerland, NY 05770 Date of Admission 1 970 07 28 Entrance Credential Transcript of Records from _ _. Elementary School -—~ ~-- __ Shelton, Arias and Walters University Gilbert, Russell and Simmons University Year Graduated 2023 High School Shaw PLC University Year Graduated 986 College Flores Richardson College Year Graduated 2001 Attended: Semester: 4 Summer: 2 a | GRADES CREDITS SUBJECTS L_ CODE DESCRIPTIVE TITLE ma G ENTRANCE DATA: “GRADUATED with the degree of Master in Philippine History and Governance (MPA) on 1982 12 28 from Underwood PLC Academy Port Lindseyshire per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003.” =—--—...___ __Perry Rollins Academ GRADUATE SCHOOL 190290, Summer ACJ 905 Research Methods in |T 2 15 4 Object Oriented Programming WJ 857 Sse crated oarmeg AN 175 3 FHX 553 Systems Analysis and Design, _ 2 25 5 RNI 994 Obiect Oriented Programming 2 50 4 SUI 472 Diaital Logic Design 3 00 2 _ Second _QRL 887. Systems Analysis and Design 290 A XGR 042 Software Engineering 2 00 3 OOM 770 Project Management _ 2 25 5 OPH 246 Mobile 48 19 86 men 2 50 5 2006 1978, First Semester UJH 069! Object Oriented Programming 1 75 5 CAT 809 ooo story and 3 00 5 2019 2017 _Second Semester IEN 278 Business Process Reengineering 275 5 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 1999 07 25 X X X X X X X X X X X X X X X K X K KEX x. -X X x x- Nothing Follows POX KK E X X X X X X X K X X K X XK X K X X X X COPY For: Clark and Sons Academy 7444 Elizabeth Via Suite 088, New Robert, MH 81170 GRADING SYSTEM 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84% 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P= Passed NC No Credits INC Incomplete W Withdrawn UW Unauthorized Withrawal. CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or professional subject within a Ee —— (Not valid without the University seal) se A Prepared By. Charles Martin 2 0 9 (Mapa ufso y erek Davis Checked By: Karen Mckee DVM University Registrar"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO 027 Rev. G AIO N pup Reh 1398 2013 02 1 m 2003 08 09 Republic of the Philippines nares w mee weseee --Petty Rollins Academy e é ft OFFICE OF THE UNIVERSITY REGISTRAR Mise GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 4721487 ! Be Date: 2001 08 26 Student Name Ralph Turner 54836 Holden Stream Apt. 896, Archerland, NY 05770 Address 3 Date of Admission 1970 07 28 Entrance Credential Transcript of Records from —. .-.- ~~ Shelton, Arias and Walters University Elementary School Gilbert, Russell and Simmons University. Year Graduated 2023 High School Shaw PLC University Year Graduated 1986 College Flores Richardson College Attended: Semester: 4 Summer: 2 Year Graduated 2004 ee ee a a a t nt yj F CODE DESCRIPTIVE TITLE GRADES CREDITS F ENTRANCE DATA: ir “GRADUATED with the degree of Master im Philippine History and Governance {| J (MPA) on 1982 12 28 from Underwood PLC Academy Port Lindseyshire H li per Special Order (C} No. 80 345201 13 s. 2003 dated May 8, 2003.” 1 _ _ Perty Rollins Academy __- GRADUATE SCHOOL 40R0, Summer ACJ 905 Research Methods in IT 2 15 4 Object Oriented Programming Wd 897 2010 1981, First Semester 1 75 | FHX 553 Systems Analysis and Design, 22S 5 1 (| mt 9904 Object Oriented Proararnmina AO 4 1 =SUL 472 i Digital Logic Design 3 00 2 F 1994 2015 Second Semester _QRL 887. Systems Analysis and Design 2? 00 4 1 XGR OAK Software Enaineerina 2 00 3 OOM 770 Project Management _ 2 25 1978 1986 OPH 246 Mobile Application Development 2 50 5 2006 1978 _First Semester UJH 069! Object Oriented Programming 1 75 ss) 3 00 5 1 Philippine History and t CAT 809 aie varnance ane S] ir 2019 2017 .Second Semester t EN 278 Business Process Reengineering 2 7H 5 1 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 4999 07 25 KK EKEK RUX OX X X K XK OX EOX K KN K X X X X- Nothing Follows -xX X X K K X X X K K K X K X X E N- XK KKK NN 1 i copy For: Clark and Sons Academy i 7444 Elizabeth Via Suite 088, New Robert, MH 81170 1 ogee one meee Se adel checbatgn Aha STEM 1 00 97 100% 5 1 25 94 96% .1 50= 91 93% «1 75 88 90% 2 00 85 87% 5 2 25 82 84% 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P= Passed NC No Credits {NC Incomplete W Withdrawn UW Unauthorized Withrawal. ast seventeen (17) full hours of instruction in academic or professional i CREDITS One college unit is at le 1] subject within a semester 1 a $$ a“ | REMARKS: L 4 CLEARED OF ALE PROPERTY AND MONEY ACCOUNTABILITIES. y prepared By Charles Martin 2 0 9 h (Hadveyelin! fso i9 Derek Davis Checked BY. Karen M ckee DVM University Registrar Lo eee eee a (Not valid without the University seal) cee anssnnaenen ren eet CN LOT CC I A A AS eal een ent ne A LATE I LOLA COO"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO 027 0 Ne wp reBRe 3013 02 18 2003 08 09 ESsT¥ On SS Py, EY Republic of the Philippines etree wee eee ~~ Perty Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR ae GRADUATE SCHOOL ~~ STATE U = OFFICIAL TRANSCRIPT OF RECORDS | Student Number 1721487 fe) Student Name tL Ralph Turner Date: 2001 08 26 Address 54836 Holden Stream Apt. 896, Archerland, NY 05770 Date of Admission 1970 07 28 Entrance Credential Transcript of Records from _.- _ __-. — Shelton, Arias and Walters University Elementary School Gilbert, Russell and Simmons University == Year Graduated 2023 High School Shaw PLC University Year Graduated College Flores Richardson College Year Graduated 2001 Attended: Semester: 4 Summer: 2 SUBJECTS L- | . CODE DESCRIPTIVE TITLE GRADES CREDITS ENTRANCE DATA: “GRADUATED with the degree of Master in Philippine History and Governance (MPA) on 1982 12 28 from Underwood PLC Academy Port Lindseyshire per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003.” -Perry Rollins Academ GRADUATE SCHOOL 4920 Summer ACJ 905 Research Methods in IT 2 15 4 Object Oriented Programming lJJ 857 2010 1981, First Semester 1 75 3 FHX 553 Systems Analysis and Design. 2 25 5 RNI 994} Object Oriented Programming We\\ 0) 4 SUI 472 __ Digital Logic Design 3 00 2 1994 2015, Second Semester _QRL 887. Systems Analysis and Design 200 A XGR 048 Software Enaineerina 2 00 3 OOM 770 Project Management _ 2 25 5 1978 1986 OPH 246 Mobile Application Development 2 50 5 2006 1978: First Semester UJH 069! Object Oriented Programming 1 75 re) CAT 809 Pate eeemared ot 3 00 5 2019 2017 Seco r IEN 278 Business Process Reengineering 9 7A TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 1999 07 25 X X X X X X X X X X X X X X X X X X K X X X X X x- Nothing Follows -x x x x xX x X X X X X X X X X X X X X X X X X X copy For: Clark and Sons Academy 7444 Elizabeth Via Suite 088, New Robert, MH 81170 | GRADING SYSTEM 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84% 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P Passed NC No Credits INC Incomplete W Withdrawn UW Unauthorized Withrawal. One college unit is at least seventeen (17) full hours of instruction in academic or professional subject within a semeste CREDITS (Not valid without the University seal) A Charles Martin 2 0 9 (hoyle life /9 erek Davis Checked BY’ Karen Mckee DVM versity Registrar Prepared By:"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "tor",
        "ocr_text": "2003 08 09 ublic of the Philippines ry Rollins Academy NIVERSITY REGISTRAR 0\" CEEICE OF THE U RADUATE SCHOOL G OFFICIAL TRANSCRIPT OF RECORDS 4 Date: 2001 08 26 Rep Per 4721487 Ralph Turner 54836 Holden 4970 07 28 1 of Records from — <2 Lt _ Shelton, Arias an ussell and Siemons University. enn Student Number 96, Archerland, NY 05770 Student Name Address Date of Admission Stream Apt. 8 d Walters University Entrance Credential Transcrip Elementary School Gilbert, R Year Graduated 2023 High School Shaw PLC University Year Graduated 1986 College Flores Richardson College Year Graduated 2001 Attended: Semester: 4 Summer: 2 ——— = ee ——T— ———_— — a | —— suBIECTS —___| CODE DESCRIPTIVE TITLE GRADES CREDITS ENTRANCE DATA: «GRADUATED with the degree of Master in Philippine History and Governance (MPA) 0D 4982 12 28 from Underwood PLC Academy Port Lindseyshire per Special Order {C) No. 80 345201 13 5, 2003 dated May 8, 003.” y ee -Perry Rollins Academ _ GRADUATE SCHOOL 4020 Summer ACJ 905 esearch Methods in IT 2 19 4 Object Oriented Programming JJ 85/ 2010 1 First Semester 1 79 3 FHX 553 Systems Analysis and Design. 995 5 ani 9943 Obiect Oriented Proarammina 250 4 SUI 472 __ Diaital Logic Design 3 00 2 Second Semester ——-QRL88T- Systems Analysis and Design 2 00 4 X R OAR oftware Enaineering 2 00 3 OOM 770 Project Management 2 25 5 4978 19 | OPH 246 Mobile Application Development 2 50 5 | 2006 1978 Semester \\| UJH 069! Object Oriented Programming 4 75 5 3 00 5 9 7A 5 CAT 809 Philippine i 2019 2017 Second Semester IEN 278 Business Process Reengineering TOOK AND PASSED THE co. REHENSIVE EXAMINATION ON _x x x- Nothing Follows SRK BIR IIE RII X K X K- XK copy FOR: Clark and. Sons Academy 7444 Elizabeth Via Suite 088, New Robert, MH 4999 07 29 x xX- K X X X X KEXKK KKK ERE 81170 _ GRADING SYSTEM 1 00 97 100% 1 25= 94 96% 1 50 91 93% 1 75= 88 90% 5 2 00 85 87% 5 2 25 82 84% | 2 50 19 81% 3 2 15 16 18% 3 00 75% 5 00 Failed P= Passed NC No Credits | INC Incomplete w Withdrawn UW Unauthorized Withrawal. CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or professional subject within a semester. PROPERTY AND MONEY ACCOUNTABILITIES. (Not valid without the University seal) Charles Martin 2 80/ a] Derek Davis Registrar Prepared By: VA Cardone! ufsoly University Checked BY: Karen Mckee DVM"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "tor",
        "ocr_text": "PUP TROR S UNRO O27 0 Rev. 0 Ne rue rch 1220 020) 2017 10 24 Republic of the Philippines norms we meen es +o Sfry Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL OFFICIAL TRANSCRIPT OF RECORDS Student Number 3666784 ie ae Student Name —_—— Robert Woods Date: 1971 10 17 Address PSC 8657, Box 2603, APO AE 76681 Date of Admission 4995- 01 711 Entrance Credential e Trassetiyt of Records from W 00..-. . . Carpenter Parsons College Elementary School RiveraPLC College tti i i CS C é tS Year Graduated 4981 High School Sweeney Lee College Year Graduated 1976 College Odom Group University Year Graduated 200A Attended: Semester: Summer: 2 ENTRANCE DA DATA: “GRADUATED with the degree of Master in Software Engineering (MPA} on 2011 11 08 from Edwards Group School_ Port Sarah per Special Order (C}) No. 80 345201 13 s. 2003 dated May 8, 2003. ____Perry Rollins Academy ss GRADUATE SCHOOL 1 2nn0e8 Sumner 1 AFS 742 Operatina Systems 3 00 4 i : Operating Systems e | JYZ 295 4904 1998 First Semester 2 00 3 || 10G 931 Probability and Statistics __ 1 50 4 l IPM ANAS Web Develooment 100 5 || || LTS 890 Software Engineering _ 300 5 2009 2007. Second Semester | _IMM 009. Ethics and Professional Responsibility 125 1 X IF 149 Data Anaivtics 2 75 3 | 1ZX 786 Digital Logic Design _ 2 25 5 {| GGF 307 Data Structures and Algorithms 2 5 4 2011 2014, Fizst __ DON 524 Human Computer Interaction 1 75 2 i KYI4 Artificial Intelligence 3 | nied 1983 1983 Second Semester 2 79 OVS 272 Business Process Reengineering 450 4 i| TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2013 10 16 X K X N K M K X K X N K K H K K K K X K R X X N- Nothing Follows -x x x K X H K K X K X K X K M N K K X K M K X H cory For: Henry and Sons Academy 1 9534 Beasley Knolls Apt. 858, Warrenton, KS 11608 1 00 .97- 100% 1 25 94 96% 3 1 5 50 91 93% , 1 75 88 90% 2 00 85 87% 2 25 82 84% | i 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P : Passed NC No Credits i it INC Incomplete W Withdrawn UW Unauthorized Withrawal. One ee unit is at least seventeen (17) full hours of instruction in academic or professional ii {Not valid without the University y seal) Amy Powersini0 7 rf AVWUter (i eoyrdrnr! ufole Ell zabeth Lyons hacienda bh: University Registrar Checked BY Diane Brown ty Reg Prepared By: ssermersennemagmeenpaperenmetih iSO 8 TELEKOM OLEAN NEL A DETTE NN OEE M EEN TC LINE AE LE DED LIE EE DDE SEDO AEE EDI OIA stuart _ cream ‘"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "tor",
        "ocr_text": "prchs 49 2017 10 21 Republic of the Philippi __Perry Rollins Academy BS XP Bem m BAM we OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL PUP TROR 5 UNRO 027 Rev. G 4986 04 04 nes STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 3666784 ue Hee Student Name Robert Woods Date: 1971 10 17 Address PSC 8657, Box 2603, APO AE 76681 Date of Admission 4995- 01 11 7 Entrance Credential ; Transcript of Records from Lu... 2. «. ~~ Carpenter Parsons College Elernentary School Rivera PLC College ee Year Graduated 4 O81 High School Sweeney Lee College Year Graduated 1976 College Odom Group University Year Graduated 2004 Attended: Semester: 4 Summer: 2 il SUBJECTS 1 tL i CODE DESCRIPTIVE PEELE _ GRADES x CREDINS S- 1 ENTRANCE DATA: h “GRADUATED with the degree of Master in Software Engineering {MPA} on 2011 11 08 from Edwards Group School. Port Sarah F per Special Order (C}) No. 80 345201 13 s. 2003 dated May 8, 2003. 1 ee Petty Rollins Academy CC GRADUATE SCHOOL QNNA Summer AFS 749 5 Operating Systems 3 00 4 perating Systems JY 299 1994 1998, First Semester 2 00 | IOG 931 Probability and Statistics __ 4 50 1 rf IRA ANA Web Development 400 5 LTS 890 _. Software Engineering 3 00 5 2009 2007. Second Semester IMM 009 Ethics and Professional Responsibility 1? — XAR 149 Data Analytics 2 75 3 IZX 786 Digital Logic Design 2 25 5 1 2020 1970 _ GGEF 307 Data Structures and Algorithms 2 15 4 H 2011 2014; First Semester DON 524! Human Computer Interaction 1 75 2 Artificial intelligence 3 i KYJ 461 eee OSecond. Ser 2 15 OVS 272 Business Process Reengineering 4 AN 4 i TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2013 10 10 || X K X M X N X X X X X K K X K X K K X X X R X K X- Nothing Follows -x x x X K X X X X X K M X X X N K K K M K N N K \"GRADING SYSTEM 1 00 = 97- 100% : 1. 25 = 94. 96% i. 50 91- 93% | CREDITS One college unit is at least seventeen (17} full i! subject within a semester -, i REMARKS: (Not valid without the University seal) cory ror: Henry and Sons Academy 9534 Beasley Knolls Apt. 858, Warrenton, KS 11608 2 50 79 81% 2 75 76 78% 3 00 75% 1 75 88. 90% ; 2 00 - 85- 87% 2 25 82 84% §.00 Failed P= Passed NC No Credits INC Incomplete W Withdrawn UW Unauthorized Withrawal. Prepared By: Amy Powersi si/ h f DaMhaylinn! ipso) 7 Checked BY Diane Brown hours of instruction in academic or professional ned OF ALE PROPERTY AND MONEY ACCOUNTABILITIES. i Elizabeth Lyons University Registrar"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "tor",
        "ocr_text": "BUP TROR eS Urea! Rev 8 4986 04 07 alo O N “pur mk v2 cas 2017 10 21 Republic of the Philippines eo wresm we meee __Perry Rollins Acacemy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U Student Number 3666784 Student Name 5 Robert Woods Date. 1971 10 17 Address PSC 8657, Box 2603, APO AE 76681 Date of Admission “| 995 01 ~{4 Eyntrarce Credential Transcript of Records from —.--.-—~-- >> Carpenter Parsons College Elementary School RiveraPLOGollege wee Year Graduated 4981 High School Swaeney Lee College 1976 Year Graduated College Year Graduated 2004 Odom Group University Attended: Semester: 4 Summer: 2 coarseness nance penne: coomnaeenni oy i GRADES oe DESCRIPTIVE TITLE i ENTRANCE DATA: “GRADUATED with the degree of Master in Software Engineering (MPA) on 2011 11 08 from Edwards Group School. Port Sarah per Special Order {C) No. 80 345201 13 s. 2003 dated May 8, 2003.” _Ber Special Ore Pemy Roline Academy __= GRADUATE. SCHODS 9nns Summer AFS 74? 5 Operating Systems 3 00 4 i 7 Fa Yperating Systems r JYZ 299 4994 1998, First Semester 2 00 | lOG 931 Probability and Statistics _. 4 50 4 \\| IRA ana Web Development 4 00 5 | LTS 890 Software Engineering 3 00 5 || 2009 2007. Second Semester IMM 609. Ethics and Professional Resp 1 25 | XIE 149 Data Anaivtics 2 19 3 \\| i7X 786 Digital Logic Design 2 20 5 oe 2020 1970 | GGF 307 Data Structures and Algorithms 2 75 4 2011 2014, First Semester DQN 524! Human Computer Interaction 1 79 2 | 4 Artificial Intelligence 5 3 KYJ 461 4983 1983 U Second Semester 2 19 4 50 4 | OVS 272 Business Process Reengineering TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 9013 10 10 M K K K K K K K R K K ER- Nothing Follows ne K KOKORO KOKORO RXR XK RK RIS || KoE BOK E K “S B- Ree Be RB 1 copy ror: Henry and Sons Academy 9534 Beasley Knolls Apt. 858, Warrenton, KS 11608 i 1 25 94 96% 51 50 91 2 6. 225= 82 84% -93% 51 75 88 90% 5 2 00 85 87% 1 00 97 100% i INC Incomplete W Withdrawn 3 \\| CREDITS One college unit is at least seventeen (17) full hours of instru 5 OF ALL PROPERTY AND MONEY ACCOUNTABILITIES. 1 ra ‘ GRADING SYSTEM ;NC No Credits 9 75 76 78% 3 00 15% 5 00 Failed P= Passed UW Unauthorized Withrawal. ction in academic or professi onal ae REMARKS: te pa * Prepared By: Amy Powers 0 82 9 j /. Cheenti fig Elizabeth Lyons University Registrar _ Ghecked BY D —ceamenamnnceenanane essen iE ELST ITED"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "tor",
        "ocr_text": "PUPA TENN Rev. 0 4986 04 01 9017 10 21 Sar y o Republic of the Philippines a S a wre eet oF ___Perry Rollins Academy & y OEFICE OF THE UNIVERSITY REGISTRAR a GRADUATE SCHOOL oo s OFFICIAL TRANSCRIPT OF RECORDS _ Date: 4971 10 17 Student Number 3666784 Student Name _-- Robert Woods Address PSC 8657, Box 2603, APO AE 76681 4995 01 11 Le Carpenter Parsons College Date of Admission Entrance Credential Elementary School f Records from ~~ ---—--~ ==\" Transcript 0 Rivera PLC College Year Graduated 4981 High School ' Sweeney Lee College Year Graduated 197 College Odom Group University Year Graduated 2004 Attended: Semester: 4 Summer: 2 (ne SUBJECTS [_ CODE DESCRIPTIVE TITLE _ GRADES CREDITS ENTRANCE DATA: “GRADUATED with the degree of Master in Software Engineering (MPA) on 2011 11 08 from Edwards Group School_ Port Sarah per Special Order {C) No. 80 345201 13 s. 2003 dated May 8, 2003.” _ _ GRADUATE SCHOOL _ Perr -Rollins Academ sane. Summer ‘| AFS 742 operat Opera Systems 3 00 4 perating Systems JYZ 205 Operating CYS rst Semester 200 3 1OG 931 Probability and Statistics .. 4 50 1 IRA Ana} Web Development 400 5 LTS 890 __ Software Engineering 3 00 5 _Second _IMM 009 Ethics and Professional Responsibility 1945 X IF 149 Data Analvtics 2 79 3 \\ZX 786 Digital Logic Design 2 25 5 GGF 307 Data Structures 979 orithms 2 75 4 2011 2014 First Semester DQN 524! Human Computer Interaction 1 75 2 KYJ 4 Artificial Intelligence 3 J 461 1983 1983 Second Semester 2 79 Business Process Reengineering 4 5N 4 NSIVE EXAMINATION ON 2013 10 10 oX K K X K K X X X X X KA OVS 272 TOOK AND PASSED THE COMPREHE Vee KEKE K KORE RORCKCK KRHA RRR IS Nothing Follows -X X X K K X X X X copy For: Henry and Sons Academy 9534 Beasley Knolls Apt. 858, Warrenton, KS 11608 1 25 94 96% 5 1 50 91 93% 52 25= 82 84% - §.00 Failed P Passed NC No Credits - 1 75 88 90% 2 00 85 87% a GRADING SYSTEM 1 00 97 100% | 9 50 79 81% 2 75 76 78% 5 3 00 75% INC Incomplete 5 W Withdrawn UW Unauthorized Withrawal. CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or professional subject within a ser ¥ PROPERTY AND MONEY ACCOUNTABILITIES. A — st (Not valid without the University seal) Ks kK Amy Powers0 7 Elizabeth Lyons Prepared By: V4 0 Well? University Registrar Checked BV. ~=._Diane Brown"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "tor",
        "ocr_text": "Wo 0 PUP TROR 5 UNRO 027 PUP 1324 a Rey. 0 1986 04 04 2017 10224 Republic of the Philippines BO ee eee 4. Petty Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 3666784 Student Name an Robert Woods Date: 1971 10 47 Address PSC 8657, Box 2603, APO AE 76681 Date of Admission 1995 01 11 Entrance Credential Transcript of Records from |. wit wna =. . Carpenter Pargons College Elementary School Rivera PLC College 7 77 Me Year Graduated 4 O84 High School “weeney Lee College Year Graduated 1976 College Odom Group University r Year Graduated 2004 Attended: Semester: 4 Summer: 2 cRALOMED. with the de; i gree of Master in Software Pioiiest ing I (MPA) on 2014 11 08 from Edwards Group School_ Sarah i Ht per Special Order (C) No. 80- 345201 13 s. 2003 dated May 8, Debs i i Htc Pemy Rollins Academy _ Ys GRADUATE SCHOOL i i! 2008 Summer i AFS 742 operat Qperatina Systems 3 00 4 || i perating Systems i sae 1994 1998 First Semester 2 00 3 i IOG 931 Probability and Statistics 7 1450 4 i I} IRA Ana} Web Development 100 5 || LTS 890 -. Software Engineer 3 00 5 1] 2009 2007. Second | (| IMM 009. Ethics and Professional Re: Responsibil ility 195 2 i XIE 149 Data Analvtics 2 75 3 | IZX 786 Digital Logic Design _ 225 5 I I GGF 307 Data 2020 1 and Aj Igori ithms 2. 75 4 i || DQN 524) Human- -Computer Inters interaction 1 75 2 i| Artificial intelligence 3 i 1 nama 1983 1983 Seckee er as | OVS 272 Business Process Ree Reengineering BA 4 I ‘| TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2013 10- 10 %XOH N X X K X K X K X K K K K K X X- 3OX X E X X X- Nothing Follows PORWR -KOX X X X X K X X X X K N X X. “X X X X K i! |! opy For: Henry and Sons Academy i 9534 Beas! ley Knolls Apt. 858, Warrenton, KS 11608 i GRADING SYSTEM. i 00 = 97- 10 1% 1 25 94 96% 1 50 91. ‘93% 1 75 88 90% 2 1 00 = 85 87% 2 25 82 84% [| il 2 50 79 81% 2 75 76. 718% : 3 00 75% :§ .00 Failed :P= Passed NC = No Credits i} INC Incomplete W Withdrawn UW Unauthorized Withrawal. i CREDITS One college unit is at least weveniean H 17) full hours of ine Iruction in academic or Professia sub pject within a 2 semester-—~ i “te OF ALY PROPERTY AND MONEY ACCOUNTABILITIES. 1 Prepared By: Bray Powersisi) “f Elizabeth Lyons Checked PA Di iane eB r own University Registrar “scommeme SI SSSR RGN ISGU Tet eeseemnn tte re ne ed Node en PS CI me A Urner “sneer pnb iencstenb cay wes wpniesnnisaiien ae"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO 027 Rev. 0 N° PUP ARGS 1982 03 31 2008 07 24 KRSITY Op wits Of», GB Republic of the Philippines wre ew eee ___Perry Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR RY GRADUATE SCHOOL _— eee STATE U OFFICIAL TRANSCRIPT OF RECORDS _— Student Number 4385019 iz) Student Name Sara Goodwin Date: 1998 11 30 Address 92666 Oneill Stream Apt. 878, East Marcus, NJ 61019 Date of Admission 1989 12 04 Entrance Credential Transcript of Records from — —---—- Choi, Ryan and Simpson University Brown Weaver Institute 7 Elementary School Year Graduated 1996 High School \\ Mecall Phelps School Year Graduated 1989 College Peters Stewart School Year Graduated 41998 Attended: Semester: 4 Summer: 2 | SUBJECTS L | CODE DESCRIPTIVE TITLE GRADES CREDITS —_— ENTRANCE DATA: “GRADUATED with the degree of Master in Object Oriented Programming (MPA) on 1982 02 20 from Stewart Lee Institute _ Smithport per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003. _________Perry Rollins Academ -~ GRADUATE SCHOOL 49001 Summer SCN 633 (Mobile Application Development 2 00 3 nformation Security ZTT 972 2013 2007 First Semester 1 25 S VCL 589 Object Oriented Programming 2 75 1 IMA 104 3 Mobile Application Develooment 195 4 AWP 478 Technopreneurship 2 00 4 1977 1993. Second Semester _JQQ 210- Ethics and Professional Responsibility 124 4 SOT 580 Research Methods in IT 1 50 Q OCJ 302 Machine Learning _ 1 25 1976 1975 FAX 493 Numerical Methods 2 00 5 2015 2003: First Semester SEB 667' Web Development 1 00 2 SN Research Methods in IT 5 J 682 1980 2009 _Second Semester 1 00 SDF 606 Business Process Reengineering 2D 4 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2014 11 09 XeX X XOX X K X X X X X K K X K X K X X X K X X X- Nothing Follows -X X X X X X X X X X X X X X X X X X X X K XX X COPY FOR: Siiffin, Parker and Sawyer University 493 Hubbard Park Apt. 535, New Michaelchester, UT 78251 GRADING SYSTEM 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84% 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P Passed NC No Credits INC Incomplete W Withdrawn UW Unauthorized Withrawal. CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or professional subject within a semester. i PROPERTY AND MONEY ACCOUNTABILITIES. Heather Esparza 0 0 9 | Al Prepared By: 9 Susan Rogers (Moar! uf My University Ropietrar el (Not valid without the University seal) Checked Py: Jennifer Thompson"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO 027 Rev. 0 N° PUP FORM 24948 1982 03 31 2008 07 24 Republic of the Philippines ote em wee eee ne __Perry Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR wee GRADUATE SCHOOL eee STATE U 5 ‘ OFFICIAL TRANSCRIPT OF RECORDS _ Student Number 4385019 ra Student Name to Sara Goodwin Date: 1998 11 30 Address 92666 Oneill Stream Apt. 878, East Marcus, NJ 61019 Date of Admission 1 12 04 a Entrance Credential 989° 12-¢ of Records from — —---. —- oe Chol, Ryan and Simpson University Elementary School Brown Weaver Institute Year Graduated 1996 High School Mecall Phelps School Year Graduated 1989 College Peters Stewart School Year Graduated 41998 Attended: Semester: 4 Summer: 2 SUBJECTS CODE DESCRIPTIVE TITLE GRADES CREDITS ENTRANCE DATA: “GRADUATED with the degree of Master in Object Oriented Programming (MPA) on 1982 02 20 from Stewart Lee Institute _ Smithport per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003.” _ _ ___ ____Perry RollinsAcademy SSS GRADUATE SCHOOL 1901, Summer SCN 633 Mobile Application Development 2 00 3 nformation Securit ZIT 972 2013 2007 First Semester 1 25 VCL 589 Object Oriented Programming 2 75 1 IMA 104 5 Mobile Application Development 195 4 AWP 478 i Technopreneurship 2 00 4 1977 1993, Second Semester _JQQ 210. Ethics and Professional Responsibility 1 245 4 SOT 580 Research Methods in IT 1 50 9 OCJ 302 _Machine Learning _ 1 25 1 1976 1 FAX 493 Numerical ainods 2 00 5 2015 2003, First Semester SEB 667' Web Development 1 00 2 SNJ 682 Research Methods in IT 1 00 5 1980 2009 _Second Semester SDF 606 Business Process Reengineering DD TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2014 11 09 XOX X X X X X X X X X X X X X X X X X X X X X X xX- Nothing Follows -x x x x xX x x X X X X X X X X X ~X X X X X X X X COPY FOR: Ciriffin, Parker and Sawyer University 493 Hubbard Park Apt. 535, New Michaelchester, UT 78251 ——— ee GRADING SYSTEM 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 00 85- 87% 2. 25 82 84% | 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed ; P Passed NC No Credits INC Incomplete W Withdrawn UW Unauthorized Withrawal. | REDITS One college unit is at least seventeen (17) full hours of instruction in academic or professional subject within a semester-— _ REMARKS: CLEARED OF PROPERTY AND MONEY ACCOUNTABILITIES. (Not valid without the University seal) Prepared By: Heather Esparza 0 80 9 thal (Moan / olf Susan Rogers Checked BY. Jennifer Thompson University Register ee"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "tor",
        "ocr_text": "N 0 PUP TROR o U Nene Rev. 0 PUP Ber 948 1982 03 31 2008 07 24 Republic of the Philippines _ _ Perry Rollins Academy “SEFICE OF THE UNIVERSITY REGISTRAR a wuese GRADUATE SCHOOL OFFICIAL TRANSCRIPT OF RECORDS | Student Number 4385019 a Student Name Sara Goodwin Date: 4998 11 30 Address 92666 Oneill Stream Apt. 878, East Marcus, NJ 61019 Date of Admission 4989 12 04 Entrance Credential Transcript of Records from — =-~27 Choi, Ryan and Simpson University Elementary School Brown Weaver Institute Year Graduated 996 High School ' Mecall Phelps School Year Graduated 1989 College Peters Stewart School Year Graduated 1998 Attended: Semester: 4 Summer: 2 SUBJECTS CODE DESCRIPTIVE TITLE ENTRANCE DATA: “GRADUATED with the degree of Master in Object Oriented Programming Stewart Lee Institute » Smithport (MPA) on 4982 02 20 from 5201 13 s. 2003 dated May 8, 2003. per Special Order (C) No. 80 34 _Perry Rollins Academ GRADUATE SCHOOL 49001 Summer SCN 633 , Mobile Application Development 2 00 3 nformation Security ZTT 972 2013 2007» First Semester 1 25 2 VCL 589 Object Oriented Programming 2 75 1 A 404 3 Mobile Application Development 495 4 AWP 478 __ Technopreneurship __ 2 00 4 _ Second _JQQ 210- Ethics and Professional Responsibility 1 94 4. SOT AR0 Research Methods in IT 1 50 2 OCJ 302 _ Machine Learning _ 1 25 1 1976 1975 FAX 493 Numerical Methods 2 00 5 2015 2003 First Semester SEB 667' Web Development 1 00 2 SNJ 682 Research Methods in IT 1 .00 5 1980 2009 _Second Semester SDF 606 Business Process Reengineering 994 4 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2014 11 09 X X K X X K X X X X X X XXAER seeK K K H MCK R X X X K K K K K K K MGR RGIS Sp Nothing Follows -X X X X X X X copy. FOR: Giffin, Parker and Sawyer University New Michaelchester, UT 78251 493 Hubbard Park Apt. 535, 2 00 85 87% 2 25 82 84% d NC No Credits GRADING SYSTEM 1 00 97 100% 1 25 94 96% 31 50 91 93% ;1 75= 88 90% 2 50 79 81% 2 715 76 78% 3 00 75% 5 00 Failed P Passe INC Incomplete W Withdrawn UW Unauthorized Withrawal. One college unit is at least seventeen (17) full hours of instruction in aca subject within be cel demic or professional CREDITS NTABILITIES. =] =a (Not valid without the University seal) x fi AK Heather EsparzalD 0/ YY Susan Rogers Prepared By: -. Mdhoam 919 Susat checked BY: Jennifer Thompson versity Registrar"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "tor",
        "ocr_text": "PUP 1 RUR 5 UINIWU UE! Rev. 0 : Nt PUP 24948 1982 03 31 2008 07 24 Republic of the Philippines a wresm mw aeweesee ___Perry Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR ee GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS +4 a Student Number 4385019 Student Name e Sara Goodwin Date: 1998 11 30 Address 92666 Oneill Stream Apt. 878, East Marcus, NJ 61019 Date of Admission 1989 12 04 __ Choi, Ryan and Simpson University Transcript of Records from _.--.-— Entrance Credential Elementary School Year Graduated High School Brown Weaver Institute 96 Mecall Phelps School Year Graduated 1989 College Peters Stewart School t Year Graduated 1998 Attended: Semester: 4 Summer: 2 SUBJECTS 7 DESCRIPTIVE TITLE 7 | GRADES CREDITS ENTRANCE DATA: “GRADUATED with the degree of Master in Object Oriented Programming (MPA) on 1982 02 20 from Stewart Lee Institute _ Smithport per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003. _- _ GRADUATE SCHOOL _ Perr -Rollins Academ 49001 Summer SCN 633 aoe alee Development 2 00 3 nformation Security 211 972 2013 2007, First Semester 1 25 2 VCL 589 Object Oriented Programming 275 1 ILA 40 4 3 Mobile Application Development 1975 4 AWP 478 __ Technopreneurship 2 00 4 1977 1993. Second Semester _JQQ 210- Ethics and Professional Responsibility 1245 4 SOT 580 Research Methods in IT 1 50 Q OCJ 302 Machine Learning _ 4 25 1 1976 1975 FAX 493 Numerical Methods 2 00 5 2015 2003 First Semester SEB 667! Web Development 1 00 2 SNJ 682 Research Methods in IT 1 00 5 4980 2009 Second Semester SDF 606 Business Process Reengineering ale 4 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 201 4 11 09 ReX K R K K K R X K X K H K N K A RCHGR MRSS SS Nothing Follows xX UK MOK HLK X X K X K X K X X XK AKANE Griffin, Parker and Sawyer University COPY FOR: ~-- 493 Hubbard Park Apt. 535, New Michaelchester, UT 78251 GRADING SYSTEM 1 00 97 100% 1 25= 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84% 2 50 79 81% 2 75 16 78% 3 3 00 75% 5 00 Failed P Passed NC No Credits INC Incomplete W Withdrawn UW Unauthorized Withrawal. One college unit is at least seventeen (17) full hours of instruction in acade subject within le: il PROPERTY AND MONEY ACCOUNTABILITIES. HF hyfalt _ Heather Esparzalo 0 7 Prepared By: (hood! ufsolig Susan Rogers checked BW Jennifer Thompson University Registrar mic or professional CREDITS (Not valid without the University seal)"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "tor",
        "ocr_text": "Rev. 0 4982 03 31 PUP For 948 2008 07 24 Republic of the Philippines wae eesee soe -Perry Rollins Academy OFFICE OF THe UNIVERSITY REGISTRAR on GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS Date: 1998 11 30 Cade a wesee* Student Number 4385019 Student Name Sara Goodwin Address z 92666 Oneill Stream Apt. 878, East Marcus, NJ 61019 4989 12 04 _ __ Choi, Ryan and Simpson University Date of Admission Entrance Credential Elementary School t of Records from _ =27 7 Transcrip Brown Weaver Institute Year Graduated i 4996 High School ' Mecall Phelps School Year Graduated 1989 College Peters Stewart School Year Graduated 41998 Attended: Semester: 4 Summer: 2 SUBJECTS DESCRIPTIVE TITLE ‘| GRADES CREDIT ENTRANCE DATA: “GRADUATED with the degree of Master in Object Oriented Programming (MPA) on 4982 02 20 _ from Stewart Lee Institute ' Smithport per Special Order {C) No. 80 345201 13 s. 9003 dated May 8, 2003. P GRADUATE SCHOOL erry Rollins Academ 4Qq01 Summer SCN 633 Mobis Applicaton Development 2 00 3 nformation ecurity ZTT 972 Information rr pirst Semester 125 VCL 589 Object Oriented Programming 275 LA 410A Mobile Application Development 495 4 AWP 478 __ Technopreneurship. 2 00 4 1977 4993. Second Semester _JQQ 210- Ethics and Pro essional Responsibility 125 4 SOT ARO Research Methods in IT 1 50 a OCJ 302 Machine Learning 4 25 1 1976 1975 FAX 493 Numerical Methods 2 00 5 2015 5003s First Semester SEB 667! Web Development 1 00 2 SNJ 682 Research Methods in IT 1 .00 5 1980 2009 co! r Business Process Reengineering 998 4 REHENSIVE EXAMINATION ON 9014 11 09 Oat pix x xx ELLE TERRE ESS 6 SDF 60 TOOK AND PASSED THE COMP. BEKO EEE Nothing Follows ryer University \\Ichester, UT 78251 X X X- Griffin, Parker and Saw COPY FOR: ---—~ 493 Hubbard Park Apt. 539, New Michae ; 2 00 85 87% 5 125= 82 84% RAD TEM 1 00 97 100% 1 25= 94 96% 1 50 91 93% 5 1 75 88 90 sab ma as 2 50 19 81% 9 73 16 18% 3 00 15% 5 00 Failed P= Passed NC No Credits INC Incomplete Ww Withdrawn 5 UW Unauthorized Withrawal. _ CREDITS One college unit is at least seventeen (17) full hours of instruction academic or professiona NTABILITIES. AND MONEY ACCOU ee CL PROPERTY s Not valid without the University seal) re A h _ Heather esparzal 0/ 7 een Mors oly University OO istrar Prepared By: Checked VA Thompson"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "tor",
        "ocr_text": "PUP TROR S UNRO 027 PUP Rok! 18 14 1977 12 23 1992 07 10 Republic of the Philippines we ee mem om mae eeew .Petry Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL Sek STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 8524695 Student Name a Terry Richardson Date: 9003 12 14 Address 731 Willams Pike, Nathanfort, iD 74276 Date of Admission °005- 01 14 Entrance Credential Transcript of Records from _ _ Montoya, Andrews and Wong College Elementary School Brown, Bruce and Scott institute Year Graduated 2009 High School Lopez. Waish and Arellano Schoal Year Graduated 2010 College Le Ltd College Year Graduated 4995 Attended: Semester: 4 Summer: ae U. BJ i E c i S_ ee ee _| GRADES CREDITS = ome oes ovsnannoonsr coshanoommeiicrnsiceisrercmaeenanommtrnamieracst f EE i ENTRANCE DAT. DATA: 1 i| “GRADUATED with the degree of Master im Human Computer interaction || | (MPA) on 2018 02 22 frorn Bates, Thompson and Rodgers School, Tj imothystad i {| per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003. \\| __ Perty Rollins Academy GRADUATE SCHOOL 19022 ,, Summer || GEH 560 Database Management Systems 2 29 4 I YIN 398 Linear Algebra 475 4 | TOE 461 Cloud Computir fa 2 50 4 |} wir ota) Web Development 400 4 l || STT 808 _. Computer Architecture _ 3 00 A 1 _ATD 693. Philippins ine History and Governance 300 2 1 |, EIR 482 Technopreneurship 2 00 3 | VNK 149 _Operating Systems _ 225 5 1 1 1972 1981 | MSV 847 Numerical Methods 495 5 rf 1981 1975. Hiest Se 20 i |, OLO 004! Probability and Statistics 2 25 4 1 He ap Database Management i 1} EWW 508 Systems _ : 3 00 4 it . 1989 1996 Second | || CJD 542 Business Process Reengineering mare) 2 i tl TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 1982 05 26 1 i M N N N N K K X X X X K K X N K M K RGM K R K K x- Nothing Follows -x x X M K X X X X X K M X X X R K XM K K K N K R 1 1 copy For: _Brennan Hines College. i i 0976 Murphy Light Suite 566, Taylorville, CA 86622 1 00 97- 100% : x 20 94- 067 130 91- -93% 51 75 88 90% 2 00 85- 87% ee 25 = 82. 84% fos 2 50 79 81% 2 75 76- 18% 3 00 75% + 5 0¢ Failed P Passed NC No Credits a INC Incomplete W Withdrawn UW Unauthorized Withrawal. a | CREDITS bie ind unit is at least seventeen (17) full hours of instruction in academic or professional i £ 6 _ Ronald James s0 9 l/ deh Reginald Thompson Checked Ch in nay LH oll oway niversity Registrar Prepared By: scargronessenmer res emncnasei EECCA SISTORDAAEPAA PORES DOME HESS PEO IDET TBETEAL A EEN L EAE NA IO ENDED NEE IEE ws serene"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "tor",
        "ocr_text": "% PUP TROR 5 UNRO 027 No 9384 4 4 Rev. 6 PUP FORD 1977 42 23 1992 07 10 Republic of the Philippines Bree me wae mee ~.--Petty Roilins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 8534625 Student Name —_— Terry Richardson Date: 2003 12 14 Address 731 Willlams Pike, Nathanfort, ID 74276 Date of Admission 2005- 01 14 Entrance Credential x Transetipt of Records from _ W... ... _ ___Montoya, Andrews and Wong College Elementary School Brown, Bruce and Scott Institute Year Graduated 2009 High School Lonez. Walsh and Arellano Schoo! Year Graduated 2010 College Le Ltd College F Year Graduated 1995 Attended: Semester: 4 Summer: 2 [pment ener ence roneoa enna ssa setenv aasentstotocesiesenaem oes SrapSENn evince =a] SUBTECTS 92 0 72 aa i _DESCRIPTIV E TITLE GRADES _ CREDITS i “GRADUATED “with the degree of Master im Human Computer interaction I (MPA) on 2018 02 22 from Bates, Thompson and Rodgers School, 7 imothystad i} per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003. i asm Pemy RollinsAcademy ==» GRADUATE SCHOOL i 1022, Sumymner i GEH 560 Peleloae Management Systems 2 25 a 1 i inear Algebra i MIME 1972 2000 First Semester taled | || TOE 461 Cloud Computing 2 50 1 ll || ie ota Web Develooment 400 A i STT 808 _. Computer Architecture _ 3 00 4 1 1] 1997 1970. Second er 1 LATD 693 Philippine History and Governance 3 00 3 i |, .LIR 4a3 Technopreneurship 2 00 3 [| || VNK 149 _Operating SUC aE 2 25 3) i 1972 1981 i! || MSV 847 Numerical Methods. 1 25 5 i 1981 1975, First Semester || OLO 004) Probability and S Statistics 2 25 4 1 || EWW 508 ae ae 3 00 4 | 1989 1996 Seer meeter || CJD 542 Business Process Reengineering 200 2 [| TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 1982 05 26 i ROMERO K R X XK K K R K R K K EEK R E R K X- Nothing Follows “KoX M K E X K N K X K K K K X K K X K K K X K X i copy For: _Brennan Hines College | 0976 Murphy Light Suite 566. Taylorville, CA 86622 | GRADING SYSTEM 1 00 97 100% 1 25 94 96% 130 = 91 93% 1 75 88 90% ; 2 00 85 87% 2 25 82 84% | 2 50 79 81% 2 75 76 78% 3 00 75% ; 3 00 Failed P= hae NC No Credits i i INC Incomplete W Withdrawn UW Unauthorized Withrawal. i: CREDITS One college unit is at least seventeen t 17) fuil hours of instruction in academic or professional i subject within is Whar 18 82 ffs Regi na id Thompson Checked cA Ci in aah 4 lolloway niversity Registrar ne se LL TL LTT CNT LE TENT CE CC TTS NEON NEALE CIN TEE ON NAO NON Aenean Sn seepndiaatresarmessteneea meee smsonuie ema Kenner emo eran"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "tor",
        "ocr_text": "Rev. 0 4977 1 2 23 4992 07 1 Republic of the Philippines rere ee __Perry Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR aw GRADUATE SCHOOL 3 ‘on In. OFFICIAL TRANSCRIPT OF RECORDS Date: 2003 12 14 Student Number 8534625 Student Name Terry Richardson Address 731 Williams Pike, Nathanfort, ID 74276 Date of Admission 2005 01 -14 Entrance Credential Transcript of Records from ‘--—--— _Montoya, Andrews and Wong College Elementary School Brown, Bruce and Scott institute on Year Graduated 9009 High School ‘Lonez. Walsh and Arellano School Year Graduated 2010 College Le Ltd College f Year Graduated 4995 Attended: Semester: 4 Summer: 2. _ SB IECTS SUBJECTS CODE DESCRIPTIVE TITLE ENTRANCE DATA: “GRADUATED with the degree of Master in Human Computer Interaction (MPA) on 2018 02 22 from Bates, Thompson and Rodgers School, Timothystad per Special Order (C) No- g0 345201 13 s. 2003 dated May 8, 2003. a Perry Rollins Academ GRADUATE SCHOOL 4OR2 Summer GEH 560 Datanaig Managemen Systems 2 29 4 inear Algebra YIN 398 near AlGe TE rst Semester 175 4 TOE 461 Cloud Computing 2 2 50 a Vie 21283 Web Development 1 an 4 STT 808 _ Computer Architecture 3 00 4 _ Seco _ATD 693. Philippine History and Governance 2 00 2 AAR 483 Technopreneurship 2 00 3 VNK 149 “Operating Systems 2 25 5) 4972 1981 MSV 847 Niimerical Methods 4 25 5 4981 1975 OLO 004! Probability and Statistics 2 25 4 EWW 508 Databag Management 3 00 4 1989 4996 r ann 2 4982 05 26 X X X X KXK H EE ic ess Reengineering MPREHENSIVE EXAMINAT: ION ON “XeX X X K X E EE CJD 542 Business Proc TOOK AND PASSED T. HE CO a iN” Nothing Follows -x X X KX Brennan Hines College. A 86622 COPY FOR: -~—~- 7: 9976 Murphy Light Suite 566, Taylorville, C 2 00 85 87% 2 25 82 84% GRADING SYSTEM 1 00 97 100% 1 25= 94 96% 1 50 91 93% 1 75= 88 90% 2 50 19 81% 913 16 18% 3 00 15% 5 00 Failed P= Passed NC No Credits UW Unauthorized Withrawal. tion in academic Or professional INC Incomplete ,We= Withdrawn t least seventeen One college unit is (17) full hours of instruc CREDITS _ subject within a sem PROPERTY AND MONEY ACCOUNTABILITIES. iversity seal) Reginald Thompson (Not valid without the Un Ronald james0/ Fiversity Registrar Prepared By: V4 Atorndr! olg Checked BY: Cindy Holloway"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO O27 n JO ce) A Rey. 6 1992 07 10 Republic of the Philippines mn apeem w wan neseaa «ea Sify Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 85346295 Student Name Terry Richardson Date: 2003 12 14 Address 731 Williams Pike, Nathanfort, 1D 74276 Date of Admission 2005 -O1 1 Entrance Credential Transcript o Records from _ _ ... .. Montoya, Andrews and Wong College Elementary School Brown, Bruce and Scottinstitule SS Year Graduated 2009 High School ‘Lonez. Walsh and Arellano School Year Graduated 2010 College Le Lid College F Year Graduated 4995 Attended: Semester: 4 Summer: 2 “SURIHCTS _ DESCRIPT! IVE TITLE “GRADUATED with the degree of Master im Human Computer interaction | (MPA) on 2018 02 22 from Bates, Thompson and Rodgers School, “Tj mothystad per Special Order {C} No. 80 345201 13 s. 2003 dated May 8, 2003.” i oe ieeaaeene ah emy Rollins Academy _ GRADUATE SCHOOL | 4022, Summer {| 1 GEH 560 Dalabase Management Systems 2 25 A ' inear Algebra | YIN 398 1872 2000 iret Sensdytion 1 75 4 | TOE 461 Cloud Computing 2 50 4 vie o1mt Web Development 1 00 4 1 STT 808 oo uter Arch rchitediure oe 3 00 A | -ATD 693. suited ine Hi a wien Governance 3 00 8 |, .LIR 43 Technopreneurship 2 00 3 (| VNK 149 _Operating Systems _ 295 5 1 1972 1981 a 1 || MSV 847 Numerical Meth nese, 1 25 5 i 1 1981 1975: Finet Semester 1 || OLO 004 Probability and Statistics 2 25 a 1 || EWW 508 niebesysiems 3 00 1 i 1989 1996 Second er 1 || CJD 542 Business Process Renee BAN 2 I 1 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 4982 05 26 1 K X XM X K K N K X K K K K R K K K K K K R R K R X- Nothing Follows -x xX K K X XK K X K X X X K X X K X H K K R X 1 copy ror: _Brennan Hines College 1 0976 Murphy Light Suite 566, Taylorville, CA 86622 acerca eam i 00 - 97- 100% :1 25= 94. 96% :1 50= 91 93% ; 1 75 88 90% 2. 00 85 87% ; 2 25 82 84% | 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P Passed NC No Credits i INC Incomplete Ws Withdrawn UW Unauthorized Withrawal. i 1 CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or professional I _ subject within a Bic ansaid o. {Not valid without the Uni iversi ay an Prepared By: ae JamesiiI e7 2 wfeoly Regi inald Thom son Checked BY. a Holloway niversity Registra inne sc lett SP OLENA CO ERE SSE ESSE TESS EE AA NEE SOS sess as eRe SE OMNES NAOA SA I SECDI OEE CAE NEAT OELENTEATD CO I C DA S ALE S EAD LL LLL AD DEAT sacaestecneranecirp oes iO AEST ERO ADEA SEL ASEM LAL SALLE EAS NEEL DE LE AE va"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO 097 Bernt 1977 12 23 1992 07 10 Republic of the Philippines BO Reem en meee. Perry. Rolii lins Academy OFFICE OF THE UNIVERS| ITY REGISTRAR soa “© GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Nurmber 8534625 Student Name Terry Richardson Date: 2003 12 14 Address 734 Wiliams Pike, Nathanfort, ID 74276 = dmission Sees ene 2005 01 a Records from TT rr 7 —~Montoya, Andrews and Wong College Elementary Schan i] Brown, Bruce and. Scat f finatitans Year Graduated 2009 High School Lonez. Walsh and Areliano Schaal Year Graduated 2010 College i Le Lid College Year Graduated 4995 Attended: Semester: 4 Summer: 2 eG UB I EC it sa 2 _DESC RIPTIVE at Ee a _. [orapes Hl ENTRANCE Data, i| i “GRADUATED with the degree of Master in Human Computer interaction i i| (MP A) on 2018 02. 22 frorm Bates, 7 Thompson and Rodgers School, Tynothystad i| Hl per Special Orde; \"{C) No. 80- 345201 13 5 2003 dated May 8, 200: i if Cres seca OMy Rolling S Academy Ce __- GRADUATE. SCHOOL i i 1022 Summer i GEH 560 Database Management Systems 2 25 4 [] I j ial Algebra i i] YIN 398 1972 2000 First Semester 1 75 Hl rt TOE 4614 Cloud Computing 2 50 1 | wir oag; Web Devel lopment 100 4 [! || STT 808 -. Computer Architecture 3 00 4 i 1997 1970. Second Semester i| ‘| _ATD 693. Philippine History and Governance 3 00 3 i -LIR 4a3 Teehnopreneurship 2 00 3 i VNK 149 Operating Systems 2 25 5 i MSV 847 Nunecical Methods 1 25 5 i i 1981 1975 5s first Seme cer i OLO 004) Probabil itv and Statistics 2 25 4 i I Eww 508 Data age Management 4 I i : 1989 1990 Second Se, Ler 3 00 Cup 542 Business Process j Reengineering 2nn 2 [| TOOK AND PASSEn THE COMPREHENSIVE EXAMINATION OW 1982 05 26 | XoX K X X X X HX y y X X X X X X x x- “AOKX X K N K K~ Nothing F Follows a ge oe ei i Cc _Brennan Hj ines College. i| 0976 Murphy, Light Suite 566, laylorville, CA 86622 GRADING SYSTEM. a 1 00 Ge ;125= 94. 96% 1 50 91. ~93% 175 = 88 90% 6; 2 00285, ~87% 2 25s 82. 84% i] 2 50 79. 81% 52 75 76 78% 3 00 75% 5 5 00 Failed > P Passe i NC No Credits I INC Incomplete W Withdrawa ;UWs Unauthorized Withrawal, CREDITS One college unit 'S at leass Seventeen (17) fell hours Of instruction | a within ch S 4 —— neon \"REMARKS, academic or Professional (| een nectan nn ee entre ate a eeaeene ects i nenetnmenene == CLE D MONEY ACCOUNTABILITIFS {N (Not vai las Sas i Checked aA Cindy Ho SANS eens, Oe coRete astm en mesma SMe enn stacey nie CANA neers SARC Ronm tetany Seren mcteRees men 4 1920/ Re ina Id Tho mpso nay niversity dl ro Ate msc rasemererasy"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO 027 N 0 Rev. 0 pup 40198 1975 06 30 1977 12 22 Republic of the Philippines wom meee eee —.--Perry Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL ae on STATE U Student Number 1362065 OFFICIAL TRANSCRIPT OF RECORDS Student Name . Eric Wood Date: 1994 05 23 Address 9712 Rodriguez Forge, Haydenstad, CA 10954 Date of Admission 20 02 1 Entrance Credential 2020 02 1 of Records from _. wom te: Norton LLC Institute Elementary School : Pena Wilson University Year Graduated 2005 High School Ferauson, Rhodes and Kelley School Year Graduated 1995 College i Young Vincent Institute f Year Graduated 1989 Attended: Semester 4 Summer: 2 SUBJECTS | CODE DESCRIPTIVE TITLE GRADES ENTRANCE DATA: “GRADUATED with the degree of Master in Ethics and Professional (MPA) on 1995 09 18 from Gillespie, Scott and Bell University, New Kellyview per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003.” _ ____Perry Rollins Academ -~ GRADUATE SCHOOL 1975 Summer UYC 789 Introduction to Computing 1 75 5 Data Analytics FOF 929 1982 2015 First Semester 2 75 i XEE 120 Numerical Methods __ 2 75 4 FLAN ARQ2} Object Oriented Programming 1 AN 1 FLR 917 __ Artificial Intelligence 3 00 5 2002 2003, Second Semester _DRW 128 Introduction to Computing 275 5 RRR 796 Web Development 1 50 4 ZLP 567 Physical Education and Wellness 1 00 4 2004 2022 PLU 200 Oneratina Systems 1 25 1 2020 1999, First Semester CBS 794! Project Management 1 00 1 TZG 990 _— Project Management 2 75 n 1990 2008 _Second Semester FCS 079 Business Process Reengineering 1 AN 3 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2011 -08 16 X X X X X X X X X X X X X X X X X K KEX X K K X x- Nothing Follows “XOX X K K X X X X X X X X X X X X X X X X XK X X PY FOR: Bishop, Johnson and Price School co Scho 98640 Jamie Loaf Apt. 972, West Thomasside, OK 85240 GRADING SYSTEM 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84% 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P= Passed NC No Credits INC Incomplete W Withdrawn UW Unauthorized Withrawal. One college unit is at least seventeen (17) full hours of instruction in academic or professional subject within ence CREDITS (Not valid without the University seal) Prepared By. Melanie Padilla 0 0 9 14 ifso jg Henry Henderson Checked BY Danial Baker University Registrar See —e ee"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO O27 Ao ei PUP 10) 4 28 ae 5 0 06 30 1977 12 22 Republic of the Philippines wotreem we meen mareen «-- tfy Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 4362085 Student Name , Eric Wood Date: 1994 05 23 Address o 7 12 Rodriguez Forge, Haydenstad, CA 10954 Date of Admission 20 20 02 18 Entrance Credential Transcript of Records from _ 0 0 2 Norton LLC institute Elementary School Pena Wilson University = = Year Graduated 2005 High School ‘Ferquson, Rhodes and Kelley Schoo! Year Graduated 1995 College Young Vincent Institute f Year Graduated 41989 Attended: Semester: 4 Summer: 2 a UB B J E Cc US i CODE 4 _ DESCRIPTIVE ‘TY ue ED | GRADES ti _ CREDITS a i || il ENTRANCE DATA: | “GRADUATED with the degree of Master in Ethic and Profs agional | (MPA) on 1995 09 18 from Gillespie, Scott and Bell University, New Kell lyvi ew t) per Special Order (C) No. 80 345201 13 s. 2003 dated pee ie 2003.” H eee ee nee, _Petry Rollins Academy 0D i 4075 Summer (| YC 789 introduction to Computing 5 ‘ oy 6 ine Z i FOF 929 Data Analytics 1 1982 2015, First Semester || XEE 120 Numerical Methods 2 75 4 1 i EAAIAL O22} Object Oriented Proarammina 4 450 1 || FLR 917 _. Artificial intelligence _ oe 3 00 5 1 2002 2003, Second r || -DRW 128. Introduction to Computing 275 4 || BRR 726 Web Development 1 50 4 i ZLP 567 Physical Education and Wellness 1 00 4 l 1 2004 2022 i ‘| PLU 200 Operatina Systems 1 25 4 i 2020 19992 erieste) || CBS 794! Project Management 41 00 1 } T7G 990 Project Management os 2 75 4 . 1990 2008 Second Bemester | FCS 079 Business Process Reengineering 41 AN 3 i TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2011 08 16 ia X X K K K K X K K K K X K K K K K K N X M R X x X- Nothing Follows -x x x xK x x x M X N K K K X X K K X K X K N K R | COPY FoR: Bishop, Johnson and Price School | 98640 Jamie Loaf Apt. 972, West Thomasside, OK 85240 i OO . 97- 100% To 5 94- 96% 1 50 91- 93% 1. 75 88 90% 2 00 85 87% 2 25 82- BAG i 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P Passed NC No Credits l INC Incomplete W Withdrawn OW ; Unauthorized Withrawal. One college unit is at least seventeen (17) full hours of instruction in academic or professional i Subject within a semester. ws i “(Not valid without the Universit ity seal) Prepared By: Melanie Padil a lP 82 9 ad ufeolg Henry Henderson Checked BY: Daniel Baker University Registrar"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "tor",
        "ocr_text": "PUP TROR S UNRO D27 Rey 0 alo ha we PUP AQ’ 98 1975 06 30 1977 12 22 Republic of the Philippines ee \"_Perry Rol lins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL Student Number 4362065 Student Name a Eric Wood Date: 1994 05 23 Address 5712 Rodriguez Forge, Haydenstad, CA 10954 Date of Admission 5020- 02 18 Entrance Credential Transcript of Records from —.---—~ sk: Norton LLC Institute Elementary School PenaWisonUniversiy SSS Year Graduated 2005 High School ’Fercuson, Rhodes and Kelley Schoo Year Graduated 1995 College Young Vincent Institute Year Graduated 41989 Attended: Semester: 4 Summer: 2 —UsieCis oo DESCRIPTIV! E TITLE 1 ENTRANCE DATA: “GRADUATED with the degree of Master im Ethics and Profesional {MPA} on 4905 09 18 from Gillespie, Scott and Bel University, Now Kell lyvi iew lI per iis Order (C} No. 80 345201 13 s. 2003 dated May 8, 2003.” \\| ee _Perty Rollins Academy UATE SCHOOL i ii i \\ 1075 Summer uYe 789 5 Introduct ion to Computing 1 75 5 i OE Oo ata Analytics [| FOF 929 1982 2015, First Sem 2 15 4 || XEE 7120 Numerical Methods 275 4 |) EWA ant Obiect- or ented Proarammina 450 4 r FLR O17 Artificial intelligence 3 60 5 1 2002 \"2008 Second Semester i _ DRW 128. introduction to Computing 2? 745 5 i RRR 7968 Web Development 1 50 4 | ZLP 567 Physical Education and Weliness 4 00 4 2004 2022 \\] PLU 200 Overatina Systems 4 25 4 i| i 2020 1999. First Semester r || CBS 794! Project Management 1 00 1 1 || TZG 990 Project Management 2 15 4 | 1990 2008 Second Semester || || FCS 079 Business Process Reengineering 459 2 i TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2011 08 16 i Lh a eNA K K K K X K K K X X X K K R HOM- RMB HN Nothing Follows -x x X X X x X x- “MoK X K K X X X K R K K X H K K COPY FOR: Bishop, Johnson and Price School || 98640 Jamie Loaf Apt. 972, West Thomasside, OK 85240 1 1 00: . 97- 100% Fo 5} 125 = 94- 96% 1 50 91 93% 1 75 88 90% 2, 00 = §5 87% 2. 2 25 = 82 84% i GRADING SYSTEM i 9 50 79 81% 2 75 76 78% 3 00 75% > §.00 Failed Pe Passed NC No Credits | 1 INC Incomplete -W Withdrawn UW Unauthorized Withrawal. | CREDITS One c sain unit is at least seventeen (17) full hours of instruction mm academic or professional | \"Melanie Padi al P80 79 dormir! pols Henry Henderson Checked gh Daniel. Baker Univérsity Registrar Prepared By: eit aon NON N AA EN NTEOLLDTE NE Ie ep eR ONEONTA OS ED EEN AICTE eiewmmiaraninn ei OtBOAS NSS CL A A EE AAA mevuaremantnacn sit APSA ELTA ITE ILA cncsroiesramnesis AEN ADELA ADSL AE A 0 settee eh NEALE ALE"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "tor",
        "ocr_text": "Lh a N PUP cn a 98 1977 12 22 STATE U Student Number Student Name Cn ee ee PUP TROR 5 UNRO 027 Rev 0 1975 06 30 Republic of the Philippines _ Perry Rollins Acader ny OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL 1362065 _ Eric Wood Date: 1994 05 23 Address 5712 Rodriguez Forge, Haydenstad, CA 10954 Date of Admission 5020- 02 18 Entrance Credential Transcript of Records from u...-- Norton LLC Institute Elementary School Pena Wilson Unh versity oe eee Year Graduated 92005 igh School Ferauson, Rhodes and Kelley School Year Graduated 1995 College Young Vincent Institute Year Graduated 49R9 Attended: Semester: 4 Summer: 2 rt CODE Lneinmermuet mem pee ty im il {MPA} on “SUBIECTS cerneeeninn nnn En ene _ DESCRIPTIVE’ TITLE | GRADES i [ENTRANCE DATA: 1 “GRADUATED with the degree of Master in cts aonsibty 1995 09 18 from Gillespie, Scott and Bell University, New Kellyview per Special Order (C} No. 80 345201 13 s. 2003 dated May 8, 2003.” Perry Rollins Academy GRADUATE SCHOOL 4075, Summer _ UYC 789 introduction to Computing 1 75 5 FOF 929 Data Anaviics 2 75 | XEE 120 “Numenioal Jethods ? 75 4 ENANE aR) Obiect Oriented Programming 750 1 FLR 917 Artificial Intelligence 3 00 5 2002 2003 Second Semester _DRW 128 introduction to Computing 2745 5 RRR 726 Web Development 1 50 4 ZLP 567 Physical Education and Wellness 41 00 4 2004 2022 PLU 200 Overatina Sysiems 1 25 4 2020 1999: First Semester CBS 794) Project Management 1 00 1 ii MOK -K K M M N K X K M R K K E GRADING SYSTEM | CREDITS bi fb without the University seal Prepared By Melanie Padil a /2 80/ fF hs LY Vi A ipeyp fh (Gee, ie enenle cued CIGCKeG 2Y T7G 990 Project Management 2 15 4 : 1990 2008 Second Semester ECS 079 Business Process Reengineering 1 AA 3 || TOOK AND PASSED 1 THE COMPREHENSIVE EXAMINATION ON 201 1 08 16 (-K K K X X M K X X X- Nothing Follows -x x x x x xX X X K X K X K X K K K X K X K K X X COPY FoR. Bishop, Johnson and Price School 98640 Jamie Loaf Apt. 972, West Thomasside, OK 85240 1 00 97 100% 1 25 4 96% 31 ,L75= 88- 90% 2 00 zz: 85 87% 5 2 25 82 84% 2 450 79 21% 2 75 76 78% +: 3 00 Jo. 5 OO = Failed P Passed NC No Credits INC Incomplete W Withdraw: a UW Unauthorized ithrawal. One ce eee unif is at least seventeen (17) full hours of ins struction in academic or professional Ig henry Henderson University Registrar Daniel Baker"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "tor",
        "ocr_text": "wwe ADI 98 PUP TROR 5 UNRO 027 Rev. 0 1977 12 99 1975 06 30 VERS BOe “Le Republic of the Philippines SN wv mem mw mas nese .__Perry Rollins Academy OFFICE OF THE UNIVERSITY R EGISTRAR PP Er GRADUATE SCHOOL -- cay OFFICIAL TRANSCRIPT OF RECORDS Student Number 1362065 a Student Name an Eric Wood Date: 1994 05 23 Address 5712 Rodriguez Forge, Haydenstad, CA 10954 Date of Admission 2020 02 14 8 Entrance Credential Transcript of Records from |. tit ee Norton LLC Institute Elementary School Pena Wilson University\" ~77 ~=>-~ == Year Graduated 2005 High School Ferauson, Rhodes and Kelley School Year Graduated 1995 College Young Vincent Institute Year Graduated 1989 Attended: Semester: 4 Summer: 2 CODE DESCRIPTIVE TITLE GRADES CREDITS - _— _ _ __ ____ ——— ENTRANCE DATA: “GRADUATED with the de gree of Master in Fthieg and Professional ity from Gillespie, Scott and Bell Uni versity, New Kellyview -345201 13 s. 2003 dated May 8, 2003.” _Perry Rollins Academ (MPA) on 1995 09 18 per Special Order {C) No. 80 __ GRADUATE SCHOOL 1975 Summer UYC 789 5 introduction to Computing 1 75 5 ata Analytics FOF 929 1982 2015 First Semester 2 75 XEE 120 Numerical Methods 2 75 4 EW ag} Obiect Oriented Programming 1450 1 FLR 917 __ Artificial Intelligence 3 00 5 _ Second Semester -DRW 128 Introduction to Computing 275 5 RRR 796 Web Development 1 50 4 ZLP 567 Physical Education and Wellness 1 00 4 2004 2029 PLU 200 Oberatina Systems 1 25 1 2020 1999, First Semester CBS 794) Project Management 1 00 1 Project Mana ement 4 12ZG 990 190 2008\"; Second Semester 2 75 FCS 079 Business Process Reengineering 1 5n 3 2011 08 16 AOXOXOKK X X X X X X X K X X x- X X X X X X xX x COPY For: Bishop, Johnson and Price School 98640 Jamie Loaf Apt. 972. West Thomasside, OK 85240 —_ —_ a, SSS -wTT—— - GRADING SYSTEM 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 50 79 81% 2 75 76 a === 2 00 85 87% 2 25 82 84% = /6 78% 3 00 75% 5 00 Failed P INC Incomplete Ww Withdra CREDITS wn; UW One college unit is at least seventeen (17) full hours of instruc Passed NC No Credits Subject within q Semester ——— Bo TT _ - re REMARKS: CL OF i PROPERTY AND MONEY ACCOUNTABILITIES. 1 (Not valid without the University seal) Prepared by. Melanie Padilla 0 0 9 ifso jg Henry Henderson Checked By. Daniel, Baker University Registrar"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "tor",
        "ocr_text": "G 4971 11 19 STATE U Student Number Student Name Address Date of Admission Entrance Credential Elementary School Year Grad uated High School Year Graduated College year Gradu ated 4q7a Summer SNQ 710 SBS 118 RRQQTS pEL RTA BFA351 -ELP 283. WRK 390 KVY 457 ZDP 619 \\) 171 031! \\| QAC 339 KIS 232 ENTRANCE DATA: MoK K- Re BoK- XK =e Ke OFFICIAL TRANSCRI Repub _Perry Rallins Academy NIVERSITY REGISTRAR GRADUATE SCHOOL PT OF RECORDS OFFICE OF THE U 9465487 Jake Lin MD nue, Smithfurt, WV 23681 4980 03 01, Transcript ol 2015 86010 Fritz Stravel Turner Crane University “Galinas Watson College 1982 1997 (MPA) on per Special Orde ATED with the degree 0 Munoz LLC institute ~~ suBIECT 9023 06 10 from Soto, Lee a r {C} No. a0 345201 13 8, Web Development Communication Skills 1987 -.2018.. First Semester Project Management Computer Architecture _ Systems Analysis and Design 1976 2020. Second Semester Probability and Statistics Comm Ethics and Professio! 1976 unication Skills nal Responsibility 2019 Nimerical Methods 4975 200424 Numeri iret Semester cal Methods Computer Networks Semester 1999 1989 Business Process TOOK AND PA Xo K M K- GRADING SYSTEM REMARKS: 1 ir i ti 1 iy {ee {Not valid without ee Prepar MeK R- KKK RoR KR the University sea) 9g .. Second Semester Reengineering SSED THE x x x- No copy FOR: 75803 Steven Isle, Aivaradoland, 1 00 97 100% 5 {NC Incomplete A” ad By Emily Hampton! checked BY ~=— Joshua Jenkins scorer estennecsmceonecn te cc aeee ene cnt lic of the Philippines COMPREHENSIVE EXA thing Follows -*-x-* 1 25 94 96% 1 50 91 (2 75 76 78% 5 -W Withdrawn ofga/ J fraa y sal WB I F (Vv bine yt WP PLZ University Registrar Date: 2000 09 30 Hamilton, Washington and Gonzalez Academy ‘Records from —.---— TL Attended: Semester: 4 Summer: 2 Master in Technopreneurship nd Johnson School, North Tormmytown 3003 dated May 8, 2003.\" GRADUATE SCHOOL nena Perry Rollins Academy nm 2 75 5 2 50 2 275 A 4 00 2 75 4 275 4 4 25 3 4 25 2 2 25 4 4 00 5 1 79 Z 975 4 MINATION ON 2900 04 20 K X K M K KORR -¥-X X K- MER MOM KOM MBS ___ Walker Ltd School. - SD 34124 225 82 84% No Credits 5 -93% 1 75 88 90% 2 00 85 87% 5 3 90 78% 5 00 Failed Pp Passed NC UW Unauthorized Withrawal. (17) full hours of instruction in academic or professional Jonathan Watkins GRADES CREDITS ey One college untt is at feast seventeen subject within a semesters —Y a ra CLEARED oF ALE PROPERTY AND MONEY ACCOUNTABILITIES. 2"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO 027 0 Rev. 0 N° PUP 68988 2008 10 22 1971 11 19 Republic of the Philippines es ___Perry Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR i GRADUATE SCHOOL el STATE U OFFICIAL TRANSCRIPT OF RECORDS 4 Student Number 2 9465487 a Student Name —_— Jake Lin MD Date: 2000 09 30 Address 86010 Fritz Stravenue, Smithfurt, WV 23681 1 Date of Admission 1980 03 01 . Entrance Credential Transcript of Records from —---.-—~ Hamilton, Washington and Gonzalez Academy Elementary School Turner Crane University woes Year Graduated :2015 High School ' Salinas Watson College Year Graduated 1982 College Munoz LLC Institute t Year Graduated 1997 Attended: Semester: 4 Summer: 2 SUBJECTS CODE DESCRIPTIVE TITLE GRADES CREDITS ENTRANCE DATA: f Master in Technopreneurship “GRADUATED with the degree o (MPA) on 2023 06 10 from Soto, Lee and Johnson School, North Tommytown per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003.” _ H __Perry Rollins Academ 4972 Summer SNQ 710 Web Development 2 5 5 Communication Skills SESE 1987 2018 First Semester 2 50 2 RRQ 975 Project Management __. 2 75 4 RE A713 Computer Architecture 1 00 2 BFA 351 _ Svstems Analysis and Design 2 75 1 _ Second Semester _ELP 283. Probability and Statistics 275 1 WIRX 290 Communication Skills 1 25 3 KVY 457 Ethics and Professional Responsibility 1 25 2 1976 2019 ZDP 619 Numerical Methods 2 25 4 1975 2004. First Semester IZ1 031! Numerical Methods 1 00 5 1 75 2 QQC 339 Computer Networks 1999 1989 .Seco 2 74 1 KIS 232 Business Process Reengineering TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2000 04 20 X X X X X X K X X X X X X K X K X K K X A K K K X- Nothing Follows -x X X X X X X- r M X X K X X X X X X X X X X X X X copy For: ____Walker Ltd School_- 75803 Steven Isle, Alvaradoland, SD 34124 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84% 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P Passed NC No Credits INC Incomplete W Withdrawn UW Unauthorized Withrawal. CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or professional subject within le anc i PROPERTY AND MONEY ACCOUNTABILITIES. GRADING SYSTEM REMARKS: a (Not valid without the University seal) SS id Emily Hampton 0 2 9 Ue ih Prepared By: Onoab/ feo 19 Jonathan Watkins Checked FY: Joshua Jenkins versity Registrar"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO 027 PUP 28: 588 7008 1 0 22 1971 11 19 Republic of the Philippines __Perry Rollins Academy moWeesm ww ese wesw ese OS FUSSY Us) OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS ¥4 Student Number 9465487 a Student Name Me mon Jake Lin MD Date: 2000 09 30 Address 86010 Fritz Stravenue, Smithfurt, WV 23681 Date of Admission 4980- 03 01 Entrance Credential Transcript of Records from _ _ _--.. _.- _Hamilton, Washington and Gonzalez Academy Elementary School ; Turner Crane University Year Graduated High School | Salinas Watson College Year Graduated 1982 College Munoz LLC Institute t Year Graduated 1997 Attended: Semester: 4 Summer: 2 [_ SUBJECTS LL CODE DESCRIPTIVE TITLE GRADES CREDITS ENTRANCE DATA: “GRADUATED with the degree of Master in JTechnopreneurship (MPA) on 2023 06 10 from Soto, Lee and Johnson School, North Tommytown per epee Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003.” _Perry Rollins Academ GRADUATE SCHOOL 1072. “Summer SNO 710 Web Development 2 15 5 Communication Skills SBS 118 1987 : Yeret S 2 50 2 RRQ 975 Project Management 2 75 4 REH 7141} Computer Architecture 100 2 BFA 351 _ Systems Analysis and Design 2 75 1 1976 2020, Second Semester _ELP 253. Probability and Statistics 2 745 1 UIRX 290 Communication Skills 1 25 3 KVY 457 Ethics and Professional Responsibility 1 25 2 1976 2019 ZDP 619 Numerical Methods 2 25 4 1975 2004, First Semester IZ1 031! Numerical Methods 1 00 5 QQC 339 Computer Networks 1 75 2 1999 1989 -Secoi r KIS 232 Business Process Reengineering 9 7A TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2000 04 20 X X X X X X X X X X X X X X X K X X K X X X xX x x- Nothing Follows -x x x x x xX X X X X X X X X X X X X X X X X X X copy For: ___ Walker Ltd School___ 75803 Steven Isle, Alvaradoland, SD 34124 GRADING SYSTEM 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84% 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P Passed NC No Credits INC Incomplete W Withdrawn UW Unauthorized Withrawal. CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or professional subject within ae (Not valid without the University seal) Emily Hampton 2 0 9 hoot 9 9 Jonathan Watkins . versity Registrar Checked PY: Joshua Jenkins ity Reg Prepared By:"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO 027 yp B83: 588 7008 10 22 1971 11 19 Republic of the Philippines etree wee eee ~.--Perry Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR idl GRADUATE SCHOOL -— STATE U OFFICIAL TRANSCRIPT OF RECORDS | Student Number 9465487 fe) Student Name - Jake Lin MD Date: 2000 09 30 Address 86010 Fritz Stravenue, Smithfurt, WV 23681 Date of Admission 1980 03 01 Entrance Credential Transcript of Records from ~.-..._ —--.. —.- Hamilton, Washington and Gonzalez Academy Elementary School 7 Turner Crane University Year Graduated :2015 High School | Salinas Watson College Year Graduated 1982 College Munoz LLC Institute i Year Graduated 1997 Attended: Semester: 4 Summer: 2 SUBJECTS | CODE DESCRIPTIVE TITLE GRADES CREDITS ENTRANCE DATA: “GRADUATED with the degree of Master in Technopreneurship (MPA) on 2023 06 10 from Soto, Lee and Johnson School, North Tommytown per ain Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003.” _Perry Rollins Academ GRADUATE SCHOOL 1072 Summer SNQ 710 Web Development 2 15 5 Communication Skills SBS 118 1987 ' First S 2 50 2 RRQ 975 Project Management _. 2 75 4 REH A713 Computer Architecture 100 2 BFA 351 _ Systems Analysis and Design 2 75 1 1976 2020, Second Semester _ELP 253. Probability and Statistics 275 1 IIRX 290 Communication Skills 1 25 3 KVY 457 Ethics and Professional Responsibility 1 25 2 1976 2019 ZDP 619 Numerical Methods 2 25 4 1975 2004, First Semester IZ1 031! Numerical Methods 1 00 5 QQC 339 Computer Networks 1 75 2 1999 1989 _ Second Semester KIS 232 Business Process Reengineering 9748 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2000 04 20 X X X X X X X X X X X X X X X X X X X X X X X x x- Nothing Follows -x x x x x x X X X X X X X X X X X X X X X X X X copy For: ___Walker Ltd School___ 75803 Steven Isle, Alvaradoland, SD 34124 GRADING SYSTEM 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84% 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P Passed NC No Credits INC Incomplete W Withdrawn UW Unauthorized Withrawal. CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or professional subject within a ee” of i PROPERTY AND MONEY ACCOUNTABILITIES. (Not valid without the University seal) ey 60, (1 erepared By. Emily Hampton 2 80 7 hoy fo /9 Jonathan Watkins Registrar Checked BY. Joshua Jenkins worsity Reg REMARKS:"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "tor",
        "ocr_text": "Ne PUP 685 88 1977 17 19 Republic of the Philippines _Petry Rellins Academy PUP TROR S UNRO O2? Rev. 0 2008 10 22 OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U ae eee o OFFICIAL TRANSCRIPT OF RECORDS Student Number 9465487 Student Name 8 ener Jake Lin MD Date: 2000 09 30 Address 86010 Fritz Stravenue, Smithfurl, WV 23681 Date of Admission 4980- 03 01 Entrance Credential Transcript of Records from Lo... _... Hamilton, Washington and Gonzalez Acacemy Elementary School TumerCrane University stCt CS Year Graduated é 9304 5 High School Salinas Watson College Year Graduated 1982 College Munez LLC Institute Year Graduated 4997 Attended: Semester: 4 Summer: Z oo 3s UB T E c iy SS Ce _DESCRIPTIVE att! E ENTRANC CE DATA: || per Special Order (C) No. 80 345201 13 s. 2003 dated eau 8, 2003.” H oe een _Perty Rollins Academy ss Cs GRADUATE SCHOOL 1072, Summer SNQ 710 Web Development SBS 118 Communication Skilis i 1987 2018, First Semester RRQ 975 Project Management | REBAR TA vompuler Arohiecture || BFA 351 1976 2020. Second Semeste (| ELP 283. Probability and Statisti ics |} UIRX 390 Communication Skills KVY 457 Ethics and Professional Responsibi 1976 2019 ZDP 619 Numerical Methods. 1975 2004. First Semester |} 121031! Numerical Methods ‘|| QOC 339 Computer Networks “GRADUATED with the degree of Master in Technopreneurship 1 (MPA) on 2023 06 10 from Soto, Lee and Johnson School, North Tommytown lity 2 50 2 275 A 100 2 i 2 75 4 275 4 1 1 25 3 1 25 2 l| 225 A 4 00 5 1 75 2 i 1999 1989 Second ter. || KIS 232 Business Process Reengineering Do 7K 4 1 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2000 04 20 1 K X X K X X K K X X K K X K K K K X K X X N X X- Nothing Follows -x x X K K X X M X X K X X X K X X K X K K X K X copy For: _Walker Lid Schooi___ I 75803 Steven Isle, Alvaradoland, SD 34124 \"GRADING SYSTEM 1 00 97- 100% ;1 25= 94- 96% 1 50= =S1: 93% 1 75 88 90% 2 00 = 85 87% 2 25 82 84% 2 50 79 81% is 76 78% 3 00 75% ee Failed P Passed NC No Credits ] [| INC Incomplete W Withdrawn UW Unauthorized Withrawal. i | CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or professional [i IL. ee within a eT e H REMARKS: ra ae fh, yal af Checked Joshua Jenkins CLEARED OF ave PROPERTY AND MONEY ACCOUNTASILITIES. woh he Jonathan Watkins University Registrar"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "tor",
        "ocr_text": "; PUP TROR 5 UNRO 027 NP nerdR243 78 PUP FO! I+ 1978 10 01 2010 07 01 Republic of the Philippines Bowrmem wee eee. _ __Perry Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR dean GRADUATE SCHOOL ae STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 8075203 Student Name >... Emma Schmidt Date: 1994 11 18 Address PSC 4933, Box 3760, APO AP 53406 Date of Admission 2011 05 0 Entrance Credential Transcript of Records from Elementary School - ——~ -_ _Meadows Parker School Burton, Cook and Waters University Tee Year Graduated >2015 High School | vans Miller Academy Year Graduated 2013 College Shaw, Thomas and Peters University Year Graduated 2015 Attended: Semester: 4 Summer: 2 SUBJECTS | CODE _ DESCRIPTIVE TITLE ___| GRADES CREDITS ENTRANCE DATA: “GRADUATED with the degree of Master in Systems Analysis and Design (MPA) on 1971 02 14 from —_ Nguyen Ltd Academy _ Millerview per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003.” ss. ...__Perry Rollins Academ GRADUATE SCHOOL 20n5 Summer FGL 185 N Communication Skills 2 50 2 umerical Methods KES 283 1999 1985 First Semester 2 25 4 KNV 944 Information Security 1 50 4 VINER TY Human Computer Interaction 2 00 5 AGK 033 _. Numerical Methods. 3 00 4 1992 2022 Second Semester _QHE 916. Project Management 1 75 3 TFA 765 Computer Networks 2 00 2 JJP 826 —Machine Learning _ 1 75 4 1997 1976 DYV 436 ata Analytics 2 25 1 1991 1990: First Semester UGN 959) Digital Logic Design 1 25 3 RVL 010 Physieet Education and 2 25 5 :1995 2009 _ Second Semester KDX 129 Business Process Reengineering TOOK AND PASSED T, HE COMPREHENSIVE EXAMINATION ON X XX X X X X x- Nothing Follows 195 1982 07 03 i, Gee E2GX X X X X X K X X X x 5 X x x x XOX X X X X X X X X X X X X X K x- COPY For: ___Harris Reid College _ 602 Melissa Summit Suite 292, Port Victoria, [A 44477 GRADING SYSTEM 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 50 79 81% 5 2 75 76 78% 3 00 75% 5 00 Failed P Passed ;N INC Incomplete W Withdrawn UW Unauthorized Withrawal. CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or Professional subject within a seme 2 25 82 84% C No Credits (Not valid without the University seal) net Foster 2 s2 9 tl nding! ufso y Margaret Guerrero Natalie Rivera ersity Registrar et ae ee ee ee Prepared By: J Checked"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5S UNRO 027 Rev. 0 4978 10 01 2010 07 01 Republic of the Philippines ee ee ee ee _Perry Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Nurmber é 8075203 ss re Student Name Emma Schmidt Date: 1994 11 18 Address PSC 4933, Box 3760, APO AP 53406 Date of Admission 2011 05 08 f Entrance Credential Transcript of Records from ~~... ~—- =: Meadows Parker Schoo! Burton, Cook and Waters University ~— Elementary School Year Graduated :2015 High School | 'vons Miller Academy Year Graduated 2013 College Shaw, Thomas and Peters University Year Graduated 2015 Attended: Semester: 4 Summer: 2 || CODE DESCRIPTIVE TITLE GRADES CREDITS | TIES ———e SSSSSSaeaSaSSQawwnwaw nw| ENTRANCE DATA: 1 “GRADUATED with the degree of Master im Systems Analysis and Design 1 I (MPA} on 4971 02 14 from Nguyen Ltd Academy _ Millerview 1 \\| per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003.” 1 _ ___ Pertry Rollins Academy _ GRADUATE SCHOOL 1] 1 FOL 185 Ny Communication Skills 2 50 2 1 umerical Methods l KES 283 4999 1985 First Semester 2 29 4 | KNV 944 information Security |. 4 50 4 | Manic 470i Human Computer Interaction 2? 70 5 1 AGK 033 Numerical Methods. ee 3 00 4 || .QHE 916. Project Management 1745 3 1 TFA TBS Computer Networks 2 00 2 || JJP 826 _ Machine Learning _ 4 75 4 l 1997 1976 | DYV 436 Data Analytics 2 25 4 l 1] 1991 1990, First Semester i || UGN 959) Diaital Logic Design 1 25 3 | RVL 010 Physieeelinges a 2 25 5 1 1995 2009 Second Semester | KDX 129 Business Process Reengineering 495 4 | TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 4982 07 03 I KEX XCK K K K K X X X K X K X K K X KEK X K X K X- Nothing Follows “K K X K K X X XM X X K X K X K X X X X K X K K K | copy For: __Harris Reid College __ | 602 Melissa Summit Suite 292, Port Victoria, |A 44477 i eatin pean SSRI IE EP I LTO <= seer naa i i GRADING SYSTEM 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84% i i 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P Passed NC No Credits i {| INC Incomplete W Withdrawn UW Unauthorized Withrawal. || CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or professional [REMARKS ee Prepared By: Janet F ster 2 0/ d ifsoly Margaret Guerrero University Registrar Natalie Rivera nl Checked cacecen waneenecarrenemmenncsitties tases SNAIL D eC TEE TITEL COT OL"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "tor",
        "ocr_text": "No 0 PUP TROR 5 UNRO 027 Rey. 6 PUP L343, 1978 10 01 2010 07 04 Republic of the Philippines Bowne ween mens 2 ..Perty Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number Student Name Acidress Date of Admission 2011 -05- 08 Entrance Credential Transcript of Records frorn Elementary School Year Graduated »2015 High School i vens Miller Academy Year Graduated 43 8075203 Emma Schmidt PSC 4933, Box 3760, APO AP 53406 Date: 1994 11 18 ~~~ ~.. Meadows Parker Schoo! Burton, Cook and Waters \"3 University oes College Shaw, Thomas and Peters Uni iversity Year Graduated 2015 Attended: Semester: 4 Summer: 2 if _DESCRIPTIVE TITLE if “ENTRANCE DATA; “| i] “GRADUATED with the degree of Master in Systems Analysis and Design I} i (MPA) on 1971 02 14 from Nguyen Ltd Academy __, Millerview || i per Special Order (C) No. 80 345201 13 5. 2003 dated May 8, 2003.” i I seen _Perry Roll lins Academy _ \"GRADUATE SCHOOL [| I onnk Summer I FGL 185 Communication Skills 2 50 2 || Numerical Methods i memes 1999 1985 First Semester 2 25 a i KNV 944 Information Security $ I} RANI 47) 1 50 4 {} Human Computer Interacti ion POO 5 | AGK 033 -.___ Numerical Methods 3 00 4 1] '| 1992 2022, Second Seme || -QHE 916. Project Management 1745 2 if TFA 78K Computer Networks JUP 826 _Machine Learning __ 1 75 4 i i 1997 1976 t DYV 436 Data Analytics _ 225 4 | UGN 959) »,Piait tal Logic Design 1 25 3 1 RVLO10 ee Welinessc ant 2 95 5 | 1995 2009 Second Semester t! KDX 129 Business Process Reengineering 4908 4 A TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 1982. 07 03 lI RoX K X K X K X K N X X K N N K N, “A SOK M K X X X- Nothing Follows HORA M X X X X X K R XN N K K X M K K_K. ~X K X 1 i i i if T COPY FOR: ___Harris Reid College a i 602 Melissa Summit Suite 292 Port Victoria, lA 44477 i i “GRADINGS SYSTEM. 1 00 97- 100% Ze 125= 94. 96% Hs ‘1 50 9} -93% .15 88- 90% :2 2 00 85 87% 2. 2 25 = §2- 84% To: | 2 50 79 81% 22. 15 76 78% ; 3 00 75% 5 00 Failed P Passed -NC No Credits i INC incorindeiy. W Withdrawn UW Unauthorized aad i| CREDITS One ean hs unit is at Sod seventee n (47) full hours of instruction in academic or professional iy SS tenner onetaannecoemnneneeenn mentee nnn eee ~ (Not ve val slid wi ithout t 18 Universi ity seal) Prepared By: Jane Foster 2 80, ee Ov fuoywinr/ sifsoia Margaret Guerrero Checked N atali ia Riv ivera University Registrar SAE TNE NC COENEN IO AO RE tte inertness =H Tent UR eneneneme Seana coment RES ER ERO eS US ET hme a mos"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO O2? ASO Rev. 0 Ne verb E43 SEAOGY 2010 07 01 Republic of the Philippines _Pery Rallins Academy A A Os em ER a, ae Ow om, meee on sth sar OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 8075203 Student Name Emma Schmidt Date 1994 11 18 Aciciress PSC 4933, Box 3760, APO AP 53406 Date of Admission 2011 05 08 Entrance Credential Transcript of Records frorn 2 00000... . ~. Meadows Parker Schoo Elementary School Burton, Cook and Waters eUtoon ~e eee Year Graduated 904 5 High School | vons Miller Academy Year Graduated 2013 College Shaw, Thomas and Peters University Year Graduated 9015 Attended: Semester: 4 Summer: 2 “SUBJECTS _ ea E is iota “GRADUATED with the degree of Master im Systems Analysis and Design (MPA) on 1971 02 14 from NguyenLidAcademy _ Millerview per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003” onan nnnun Pemy Rollins Academy GRADUATE SCHOOL onnk Summer [| EGL 185 Communication Skills 2 50 9 1 ES 99° Numerical Methods i 1 omens 1999 1985 First Semester 69 | KNV 944 information Security __ 1450 4 t [|] nantes 4703 Human Computer Interaction 20 5 i || AGK 033 i Numerical Methods 3 00 4 || I 1992 2022, Second Semester 1] _QHE 916. Project Management 1 75 a i TRA 765 Computer Networks 2 00 2 {| JJP 826 _Machine Learning __ 1 75 4 | 1997 1976 i DYV 436 Data Analytics 2 25 4 I 1991 1990: First Semeste i || UGN 959) Digital Loaic Design 1 25 3 i Dp nysical Education anc 5 [| 1 RVL 01 0 soon aie Second Semester 2 29 1 || KDX 129 Business Process Reengineering 198 4 | TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 1982 07 03 1 K X K X X X K X K X X K X K X K K X K X R A K X X- Nothing Follows -x x x K M x x KM K X K K K X K K N X K R K NEK N copy For: ___Harris Reid College __ 1 602 Melissa Summit Suite 292, Port Victoria, |A 44477 || GRADING SYSTEM : i 00 97- 100% 125 : 94. 96% fo 4 50 91- 93% 1 75 88 90% 2 00 = 85 87% 2 25 82- 84% i 2 50 79 81% 2 75 16 78% ; 3 00 75% 5 00 Failed P Passed NC No Credits i [| INC Incomplete W Withdrawn UW Unauthorized Withrawal. i L CREDITS nie so unit is at t leaas seventeen (17) full hours of instruction in academic or professional if Prepared By: 1 Janet Fpstera7 Ay ay i! (of20 9 Margaret Guerrero oe oa University Registrar crests Natalie Rivera areeehe Hegiatre scarey ent AL aR si SAS GER geri ASSAM ier coments at"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "tor",
        "ocr_text": "2010 07 04 Republic of the Philippines _etry Rollins Academy Wo Me ee GRADUATE SCHOOL STATE U . OFFICIAL TRANSCRIPT OF RECORDS Student Number 8075203 Student Name Emma Schmidt OFFICE OF THE UNIVERSITY REGISTRAR PUP TROR 5 UNROO27 Rev. 0 1978 10 01 Date: 1994 11 18 Address PSC 4933, Box 3760, APO AP 53406 Date of Admission 2011 -05 08 Meadows Parker School Entrance Credential Transcript of Records from _ 2---..--. ~~~ |. Elementary School Burton, Cook and Waters University. SS Year Graduated -2015 High School iwons Miller Academy Year Graduated 2013 College Shaw, Thomas and Peters University Year Graduated 2015 Attended: Semester 4 Summer: 2 SUBJECTS | Jj _DESCRIPT IVE E TITLE, GRADES ne REDIT S | ete senisninnmicseesraenntineaass came eISSN RAMS aman MEI encores sre enone aro ee ele sree renner | pene inte SG seenan ance oe arate re ree waminaunnsnensinasiatunpnne eeunnnienanesiceeCatencntcstintrestastasinrenas rane RADU ASA NANI nnn NTI TCT Nt et ENTRANCE DATA: i SS SSS onnn Summer FGL 185 Communication Skills KES 283 Numerical Methods || 1999 1985 First Semester || KNY 044 information Security |} MANI2 4701 Human Computer Interaction 1 AGK 033 Numerical Methods 1992 2022. Second Semester || -QHE 916. Project Management _ Desi Computer Networks JJP 826 _ Machine Learning 1997 1976 || DYV 436 Data Analytics 1991 1990. Fist Sen || UGN 959! Digital Logic Design 7 Physical Education and RVL 010 ew weliness. | 1995 2009 .Second Se || KDX 129 Business Process Reengineering a 1 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION 1 “GRADUATED with the degree of Master im Systems Analysis and Design if i. (MPA) on 1871 02 14 from Nguyen Lid Academy _ 1) per Special Order {C) No. 80 345201 13 s. 2003 dated May 8, 2003.” it ___ Perry Rollins Academy _ GRADUATE SCHOOL i || X K K N K XM N XK X X K X K K K K K K K K K H X X x- Nothing Follows -x x xX K M X K X X X X M K X K K M K X X K A K X rl copy For: __Harris Reid College __ 602 Melissa Summit Suite 292, Port Victoria, |A 44477 Millerview 2 25 4 4 50 A i 2 0 5 3 00 A 1 175 2 2 00 2 1 75 4 i 22 1 25 3 1 2 25 5 498 4 ON 1982 07 03 1 00 97- 100% : 1 as 94. 96% 1 50 91 1 93% 175 88 90% 2 00 85 87% 5 2 25 82 84% I 2 50 79 81% 2 75 76 78% 3 00 73% 5 00 el P Passed NC No Credi ts i INC Incomplete W Withdrawn UW Unauthorized Withrawal. One college unit is at least seventeen (17} full hours of instruction in academic or professional subject within a semester. Bo 3 ea ecliareraraiasie oft REMARKS: 1 enuent OF scx Poavety AND MONEY ACCOUNTABILITIES. i (Not v valid without the Uni iversity seal) 4 Prepared By: Sie {Foster 9 7 Checked BY: Natal ie Rivera Margaret Guerrero University Registrar"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "tor",
        "ocr_text": "Rev. 0 No 3 were la 1973 12 31 1976 04 04 Republic of the Philippines a pa __Perry Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL a <= a Student Number 4495355 Student Name Norman Phillips Date: 2006 08 31 Address 55537 Dorsey Brook Apt. 817, Port Elizabethburgh, OH 86348 Date of Admission 1983 01 31 Entrance Credential Transcript of Records from ~.-..--~ =--> =; Elementary School Dickerson PLG University. —=—SsSt C CS STATE U OFFICIAL TRANSCRIPT OF RECORDS Kelly Inc School Year Graduated 1998 High School | Gould Barnes University Year Graduated 2005 College Mcintosh Martinez Academy Year Graduated 2012 Attended: Semester: 4 Summer: 2 SUBJECTS CODE DESCRIPTIVE TITLE ENTRANCE DATA: “GRADUATED with the degree of Master in Computer Architecture (MPA) on 2015 07 05 from Lee, Stephens and White School, Port Lisafort per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003.” ___Perry Rollins Academ GRADUATE SCHOOL GRADES CREDITS 4027. eet 9 50 EBS 601 achine Learnin 1 QRA Data Analytics 1 50 5 358 1989 1981, First Semester DIB 053 Technopreneurship 2 75 4 Rie on} Human Computer Interaction 195 3 HSK 587 __ Software Engineering 1 50 5 _ERJ 736. Linear Algebra 1745 A PIO 937 Cloud Computina 3 00 1 CSL 703 Communication Skills _ 1 25 3 1995 2010 WGV 436 Diaital Loaic Design 1 25 4 1971 1970, First Semester RPP 156! Numerical Methods 1 75 3 MPE 946 _— Artificial Intelligence 1 75 4 2016 1975 r YCZ 645 Business Process Reengineering 41 4N 2 2016 12 16 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON X X X X X X X K X X X X X X X K X X KoX K K K K X> Nothing Follows -xX X X K X X X X X X X X X X X -~X X X X X X X X X COPY FOR: Giant, Mills and Gonzales Academy PSC 9114, Box 6086, APO AA 78271 GRADING SYSTEM 1 00 97 100% 1 25= 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84% 2 50 79 81% 2 75 16 78% 3 00 75% 5 00 Failed P Passed NC No Credits INC Incomplete W Withdrawn UW Unauthorized Withrawal. One college unit is at least seventeen (17) full hours of instruction in academic or professional subject within ok PROPERTY AND MONEY ACCOUNTABILITIES. CREDITS REMARKS: CL A T2 BT) (Not valid without the University seal) 3 On A Kerry Gonzalez0 7 Ys 4 iy A A Pe ufsola at =a Checked BY: Alexandra Morgan (ace ei ee ne ame eel"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "tor",
        "ocr_text": "N 6 5987 1 PUP TROR S UNRO 027 Pup FORD Rev. 0 1976 04 04 1973 12 31 Republic of the Philippines Hote eem meee ene 2. Pery Rallins Academy OFFICE OF THE UNIVERSITY REGISTRAR OFFICIAL TRANSCRIPT OF RECORDS Student Nurnber 4495355 Student Name e Norman Phillips Date: 2006 08 31 Address 55537 Dorsey Brook Apt. 817, Port Efi izabethburgh, OH 86348 Date of Admission 1983- 01. ~3 4 Entrance Credential Transcript of Records from... ce Kelly inc School Elementary School Dickerson PLO University ess Year Graduated 1 O98 High School Gould Barnes University Year Graduated 2005 College Mcintosh Martinez Academy Year Graduated 2012 Attended: Semester: 4 Summer: 2 Ss U ‘B J E c TS S | CODE , 5 || ENTRANCE DATA: | “GRADUATED with the degree of Master in Computer Architecture i| (MPA} on 2015 07 05 from Lee, Stephens and White School, Port isafort i per Special Order (C) No. 80 345201 13 s. 2603 dated May 8, 2003.\" | a a ...Perry Rollins Academy GRADUATE SCHOOL i 1987 Summer i FBS 601 Machine Learning 2 50 1 [| i A Data Analytics 1 50 5 i 388 1989 1981, First Sem: 1 [| DIB O53 Technopreneurship 275 4 || |} mie sant Human Computer Interaction 425 3 || HSK 587 __ Software Engineering 1 50 5 i 1975 1992. Second ; i ERJ 736. Linear Algebra 1 75 | PLO 937 Cloud Computina 3 00 | CSL 703 Communication Skills _ 1 25 3 || WGV 436 Diaital Loaic Design 4 25 4 | RPP 156 Numerical Methods oS rl ‘|| MPE 946 Artificial Intelligence 1 75 | || 2016 1975 Second Semeste 1 YO7 645 Business Process Reengineering 1 AO 2 1 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2016 12 16 | X K K M K X X K X K K X K X N K X K N X N K K K X- Nothing Follows -x x x K x x xX X K X X X X X X X N X K K K X K X | i COPY FOR: Grant, Mills and Gonzales Academy | PSC 9114, Box 6086, APO AA 7827 7% [GRADINGSYSTEM: —~—~«41 00 97 100%. :125 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84 J +, bd i 2 50 79 81% 52 75 76 78% 3 00 759 5 00: «= Failed; P= Passed ; NC No Credits | ' Unauthorized Withrawal. 7 I INC Incomplete W Withdrawa UW Unauthorized Withr we sademie or nrofessional i CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or profes: Z | subjec é within a semester: P, j i . en 1 t is ‘REMARKS: e University seal) yn Kerry Gonzal lez 10 80 79 R (Ws Luann! ‘upsolig Am Soto k University Registrar Checked BY Alexandra Morgan th (Not v valid without vi ORNS ERISA MOIAMA TOES een CE NPT ASH REECE TEP RIC HE neeneseecsonensete A LASS SARNIA EAE."
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO 027 PUP Beye 871 1973 12 31 1976 04 04 Republic of the Philippines __Perry Rollins Academy me oWeesm ese eee es FAIS SAUL Us) OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 4495355 Student Name __ Norman Phillips Date: 2006 08 31 Address 55937 Dorsey Brook Apt. 817, Port Elizabethburgh, OH 86348 Date of Admission 4 983 01 31 Entrance Credential e Draseetet of Records from _ _ _ _ _.-. ___ _ _____ Kelly Inc School Elementary School Dickerson PLC University = SS Year Graduated 4 998 High School Gould Barnes University Year Graduated 2005 College Mcintosh Martinez Academy i Year Graduated 2012 Attended: Semester: 4 Summer: 2 DESCRIPTIVE TITLE GRADES CREDITS ENTRANCE DATA: “GRADUATED with the degree of Master in Computer Architecture (MPA) on 2015 07 05 from Lee, Stephens and White School, Port Lisafort per ance Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003.” _ _Perry Rollins Academ GRADUATE SCHOOL 1027, \"Summer | SUBJECTS a aa CODE EBS 601 Machine Learning 2 50 1 ORA Data Analytics 1 50 5 398 1989 1981 First Semester DIB 053 Technopreneurship 2 75 4 RIe on} Human Computer Interaction 1945 3 HSK 587 _. Software Engineering 1 50 5 1975 1992. Second Semester _ERJ 736. Linear Algebra 1745 5 PIO 937 Cloud Computina 3 00 1 CSL 703 Communication Skills _ 1 25 3 1995 2010 WGV 436 Diaital Loaic Design 1 25 4 1971 1970, First Semester RPP 156! Numerical Methods 1 75 3 MPE 946 _ Artificial Intelligence 1 75 4 2016 1975 _Seco r YCZ 645 Business Process Reeneineecae 1 AN TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2016 12 16 X X X X X X X X X X X X X X X X X X K X X X X x x- Nothing Follows -x x x x x x X X X X X X X X X X X X X K X X X X COPY FOR: Crant, Mills and Gonzales Academy PSC 9114, Box 6086, APO AA 78271 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84% 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P Passed NC No Credits INC Incomplete W Withdrawn UW Unauthorized Withrawal. One college unit is at least seventeen (17) full hours of instruction in academic or professional subject within es enc GRADING SYSTEM CREDITS (Not valid without the University seal) ee fi Kerry Gonzalez o 0 9 Prepared By: 7 j lifso hg Am Soto Checked ZY: Alexandra Morgan University Registrar"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "tor",
        "ocr_text": "1976- 04- a 4 eT yy Republic of the OR Ree Be ek ee ee GRADUATE arse ns Academy OFFICE OF THE UNIVERSITY REGISTRAR PUP TROR S UNRO O27 Rev. 6 1973 4 2 3 4 Philippines SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 4495355 Hi Student Name _ Norman Philips Date: 2006 08 34 Address 55537 Dorsey Brook Apt. 817, Port Elizabethburgh, OH 86348 Date of Admission i 0983 01 31 Entrance Credential Dense of Records from Uw. «Kelly Inc School Elementary School Dickerson PLC University tsti CSt tS Year Graduated 4 998 High School Gnild Barnes University Year Graduated 2005 College Mcintosh Martinez Academy f Year Graduated 9012 Attended: Semester 4 Summer: 2 CODE _DESCR RIPTIVE TITLE 3RADES 0 CREDITS i ea ecto Sa ees SU OO Ue AG Ec eS Je ratte anny H ENTRANCE. DATA: 1 “GRADUATED with the degree of Master im Computer Architecture (MPA) on 2015 07 05 from Lee, Stephens and White School, Port jsafort \\ per Special Order (C} No. 80 345201 13 s. 2003 dated May 8, 2003.” i ee ee ee __Perry Rollins Academy _- GRADUATE SCHOOL 7 4927, Summer EBS 601 Machine Learning 2 50 1 l ORA Data Analytics 4 50 5 | ae 1989 1981, First Semester i || DIB 053 Technopreneurship 275 4 / RIG on} Human Computer Interaction 495 2 1 || HSK 587 _. Software Engineering _ 4 50 5 1] 1975 1992, Second Semester | ERI 736. Linear Algebra 1 74 5 | PLO 927 Cloud Computing 3 00 t || CSL 703 Communication Skills _ 1 25 3 i 1995 2010 || WGV 436 Diaital Loaic Desi ign 1 25 4 || RPP 156! Numerical Methods 1 75 3 l || MPE 946 Artificial Intelligence 1 75 _ || 2016 1975 Second || YCZ 645 Business Process Reengincering 459 2 | TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 9016 12 16 1 X H X K K N K M K K K K K K K K R X H K X 8 K E x- Nothing Follows -x xX x K X X X X X X K X X X K X K XM X M K A R X 1 1! COPY FOR. Grant, Milis and Gonzales Academy i a ee ame aoe im i i PSC 9114, Box 6086, APO. AA 78271 i 7 1 00 . QT. 100% a1 1 25 94 96% 5 1 50 in 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed ; P= Passed NC No Credits | ~~ Ae “Nr ECR OS OENORENT 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84% | INC Incomplete W Withdrawn UW Unauthorized Withrawal. || CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or professional i i subject within a semester; | eannennnenunatnnnannsnininntnhnitanrehannt nea nenentns 1 CLE il Lqsrpacmmecsaticies amaeeaestoe aaa TO, (Not valid without the University seal} =,” é o jos Prepared By: Kenny G Gonzalez! fs if Amy Soto Checked pf: newts Morgan University Registrar"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "tor",
        "ocr_text": "PLIP TROR S UNR Ver Rey O Ne ore eh 1973 12 34 1976 04 04 Republic of the Philippines _Perry Rollins Academy Te CICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL sme OFFICIAL TRANSCRIPT OF RECORDS Student Number 4495355 i i Student Name Do Norman Phillips Date: 2006 08 31 Address 55537 Dorsey Brook Apt. 817, Port Elizabethburgh, OH 86348 Date of Admission 1983. 01 31 Entrance Credential Transcript of Records from —-.-—~--- >>: Elementary School Kelly Inc Schooi Dickerson PLC ‘Un iversity Year Graduated 1998 High School Gnuid Barnes University Year Graduated 2005 Me Mart aca rey cintosh Martinez Acacemy moe Attended: Semester: 4 Summer: 2 Year Graduated 2042 SUBIECTS ha _ DESCRIPTIVE ET are ENTRANCE I DATA: | “GRADUATED with the degree of Master in Computer Architecture l 1 (MPA} on 2015 07 05 frorn Lee, Stephens and White School, Port [Lj safort | per Special Order (C} No. 80-< 345201- 13 s. 2003 dated May 8, 2003.” I i| oe ee POTTY R -Roilins Academy D | 4027. Summer | FBS 601 Machine Learning OBA Data Analytics 4. 50 5 388 1989 1981. First Semester 1 DIB O53 Technopreneurship 245 4 (| Rie san) Hurnan Computer Interaction 4 O85 3 il 1 HSK 587 Software Engineering _ 4 50 5 1 i 1975 1992. Second Semester | ERI 736. Linear Algebra 1 7A A I PLO 987 Cloud Computina 3 00 | CSL 703 Communication Skills 1 25 3 WGV 436 Diaital Loaic Desi ign 425 4, | 1971 1970: First Semesters i RPP 156 Numerical Methods 1 75 3 1 : Artificial Intelligence 4 MIPE 946 2016 1975 Second Sem 1 79 1 YCZ 645 Busines 38 Process Reengineering 4 BN 2 1 1 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2016 12 16 1 MORK K KOKOR K X K K X X R N K N K HEX K R K K X- Nothing Follows -x x X K X X X M K X A X K X K K K KK K ARK i 1 CcoPY FoR: Grant, Mills and Gonzaies Academy 1 PSC 9114, Box 6086, APO AA 78277 I \"GRADING SYSTEN 1 OO= 7 100% Joy 125 == 94. 96 Yo wi. 50 91 ~93% 5 LTS 88 90% 2 00 wz 85 87% 2 25 B2 84% 1 2 50 19 81% 2 75 76 78% 3 00 75% 5 00 Failed P Passed NC No Credits i CREDITS INC Incomplete W Withdrawn UW Unauthorized Withrawal. i| One college unit is at least seventeen (17) full hours of instruction in academic or professional i” ae - Oo subject wi we ithin a semester” ~~? . “(Not vali id with youl the Un versity seal) en a os Gonzalezie 8 a poe i why! ifsohe Amy Soto University Registrar Prepared By: Checked ho Al exalt ndra Morgan"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO 027 Rev. 0 N° 46875 2016 03 31 pUP FORMTNO. FA 1980 12 17 Se) a Republic of the Philippines a ow ween ~--—Petty Rollins Academy wa fox OFFICE OF THE UNIVERSITY REGISTRAR « oo GRADUATE SCHOOL Ye TE U a OFFICIAL TRANSCRIPT OF RECORDS e N b 8477210 “an. pon ein oo Brian Riley Jr. Date 2011 10 15 Address 84073 Quinn Green, Davidberg, FM 19074 atc leatce os oe EE 2008 03 27 Records from —. -...— —— Jones, Collier and Mcbride School Elementary School Anderson Johnson Institute Year Graduated 2020 —s High School \\ leon Group University Year Graduated 1976 LLC Universit oe Graduated 2002 a ~~ Attended: Semester: 4 Summer: 2 e SUBJECTS L_ soos Gn te DESCRIPTIVE TITLE GRADES CREDITS ENTRANCE DATA: “GRADUATED with the degree of Master in Artificial Intelligence (MPA) on 1987 02 22 from Scott Ltd School _ »Mclau hlinfort per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003. __Perry Rollins Academ GRADUATE SCHOOL 4028 Summer IZQ 433 Physical Education and Wellness 1 25 3 Web Development 1 MJD 478 1971. Mret S 1 50 ZFL 188 Digital Logic Design 2 25 3 RIC ae 3 Linear Alaebra 200 5 PUX 479 __ Computer Networks 1 50 2 1979 2019, Second Semester _RGS 476. Machine Learning 1745 3a XOD 838 Information Security 1 00 3 IHH 731 Human Computer Interaction 1 75 1 CBR 501 price Management 3 00 3 1997 1974, First Semester MNQ 404! Artificial Intelliaence 2 00 2 WOT 501 Phiippine History and 2 00 2 1980 2021 .Second Semester MML 751 Business Process Reengineering 175 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2020 07 25 X X X X X X X X X X X X X X X X X X K X X X X X X- Nothing Follows -x x x x x x x x x Xx X X X X X X X X X X X X X X COPY FOR: Young, Miller and Lopez Academy 4704 Brian Port, Blackbury, SD 39682 GRADING SYSTEM 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 87% 2 25 82 84% 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P Passed NC No Credits INC Incomplete W Withdrawn UW Unauthorized Withrawal. One college unit is at least seventeen (17) full hours of instruction in academic or professional subject within 6 en 2 CREDITS REMARKS: CLEARED PROPERTY AND MONEY ACCOUNTABILITIES. (Not valid without the University seal) SC ais a Prepared By. David Cochran 2 0 79 Oa A he A (0f39 9 Cheryl Frederick Checked BY: Stephanie Thompson University Registrar"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "tor",
        "ocr_text": "48875 pyP FORM HG. A 4980 12 17 Student Number Student Name Address Date of Admission Entrance Credential Elementary Sc shoal Year Gradu yated High School Year Graduated College Year Graduated IFO 433 MJD 478 || ZFL 188 i mie RRA || pUX 479 RGS 476. XON RB IHH 731 CBR 501 MINQ 404! || WOT 501 || MML 751 cREDITS \\| N K K K- RR ~BaK Ke ww 4S wa B47 2008- 03- Tramscri 9020 Repu blic OFFICE OF THE UN GRADUATE SCHOOL 7218 Brian Riley Jf, 84073 Quin 2/ ipt of Ree cords from —.-- Anderson- ann Group University Grant LLC University 4976 2002 TOOK AND PASSED oR Bo Be Bow “GRADING “SYSTEM hout Checked 4 AEs ie thompson of the Philippines Pet ryt Roll ins Aca demy CEEICE OF T VERSITY REGISTRAR a se Rey 0 2016 03 31 PT OF RECORDS nn Green, Davidberg, FM 19074 Jones, Collie dene we oe ce a Johnson ‘Institute CLEARED OF Abe i a“ a he a psf ithe Uni versity seal) id Cophra cr ane PROPERTY AND MONEY ACCOUNTABI Chery! University y and Mobride School Attended: Semester: Sum MRR Beha Ao Date: 2011 10 15 mer: 2 CREDITS a SUBJECTS ~~ \"DESCRIP TIVE Ti TLE (GRADES ENT! RANCE. DATA: “G GRADUATED with the degree of Master im Artificial intelligence (MPA) on 4987 02 22 from Scott Ltd School Mclaughlinfort per S Spec ial Order (C} No. g0 345201 1¢ s. 2003 dated May &, 3008.” ce ee eee Perry F -Rollins Academy GRADUATE SC SCHOOL 1 10RA ; Summer i Physical Education and Wellness 4 25 3 I Web Development 4 50 4 || 4971 197 72, First Semester {| Dig ital L ogic, Design 225 3 Linear Alaebra 200 5 \\| Computer Networks 4 50 2 (4979 2019. See Second Se Semester \\| Machine Learning 475 | information Security 4 00 3 Human Computer interactio 4 75 4 022 1972 Project Management 3 00 3 1997 4974, First Semester Asti ificial intelligence 2 00 2 WDD nee istory an 9 \\| 4980 seo Second Semester 2 00 \\| Business Process ‘Reengineering 4 75 4 i NSIVE EXAMINATION ON 9020 07 25 \\| eK KK MORK KH \\| THE COMPREHED MeKe KOK RK K BeE E Ke Nothing Follows “KR KOBOKOR- KK COPY FOR: Young, Mill er and Lopez’ Academy i A704 Brian Port, BI fackbury, SD 39682 \\| 1 00- -91- 100% 4 25 94 96% 5}. 50 91. 93% 175s 2 88- 90% 32. 2 00 85 87% 5 2 25 82 84% 2 50 79 81% 52. 1§ 76 78% 5 3 00 15% 5 00 Failed p Passed ,; NC No Credits INC Incomplete -W Withdrawn 5 UW “Unauthorized Withrawal. One college unit is at least seventeen (17) full hours of instruction in academic or professional subjec rwithin semester” ww <<<\" a ae ——Oo ———=— a LITIES. Frederick Registrar"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "tor",
        "ocr_text": "N o PUP TROR S UINRO 027 NY Rey 0 e 8 PUP AGE £5 1980 12 47 2016 03 34 Republic of the Philippines Smee wee ween. 2. Petty Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECOR DS Student Number 8477210 ee Student Name Brian Riley Jr. Date: 2011 10 15 Address 84073 Quinn Green, Davidberg, FM 79074 Date of Admission 2008- 03- 7 Entrance Credential Transcript of Kec cords from oo Jones, Collier and Mcbride Schoo! High School tenn Group University Year Graduated 1976 College Grant LLC University Year Graduated 2002 Attended: Semester: 4 Summer: 2 i DESCRIPTIVE TITLE _GRADES | CREDITS I ENTRANCE DATA: if OT, o.. “GRADUATED with the degree of Master in Artificial intelli igence || (MPA) on 1987 02 22 from Soot Lid School Mel Says infort i per Special Order (C) No. 80 345201-] 2003 dated May 8 Per rry Roll ling s Academ ye 7% = GRADUATE SCHOOL FOR, MRPirier I7Q 433 Physical Education and Wellness 1 25 3 MJD 478 Web Development || 1971 1972, First Semester 90 1 FEL 188 Digital Logic Design 7 25 3 1 |) RIG KER Linear Algebra 300 5 f PUX 479 Computer Networks 1 50 2 l i 1979 2019. Second Semester _RGS 476. Machine Learni ing 175 3 XOD 838 information Security 1 00 3 IHH 731 Human Computer interaction 1 75 1 2022 1972 CBR 501 Project Management 1997 1974, First Semester 3 00 2 MNQ 404) Artificial Intelligence 2 00 2 rf WOT 501 Phe isn an 2 [| 1980 20- 3 Second Semester 2 00 | MME 751 Business Process Reengineering 175 A i TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2020 07 25 [| ROXOXOK N M K K K X K X K K K K K K NK X X R X X X- Nothing Follows ROBO K KOKO RM M KX K K X K X N KK K KX K K COPY FOR: Young, Miller and Lopez Academy 4704 Brian Port, Blackbury, SD 39682 i ie GRADING SYSTEM 1 00 = 97. 1 100% si. 25 = 94. 96% fo 4 91 93% 5 1 75 88 90% 2 00 = 85 87% 32. bt 2 50 79 81% , 2 75 76 78% 3 00 75% §.00 Failed P= Passed NC No Credit ifs 7 INC Incomplete W Withdrawn UW * Unauthorized Withrawal. CREDITS One celle Be unl is at feast Seventeen (27) fell hours of instruction in ac ademic or professional i REI MARKS: 1 7 a (Not valid without the University seal) a“ 4 Prepared By. David Coc hran 2 80 79 19 v4 (Whey! ufso/} 32 9 Chery Frederi ck vhecked 2Y Stephanie Thompson University Registrar"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "tor",
        "ocr_text": "No PUP 08 f 9 1980 12 17 STATE U Student Number Student Name Date of Admission 2008- 03 27 Entrance Credential Elementary School PUP TROR 5 UNRO O27 Rey 0 2016 03 31 Republic ef the Philippines cur mem wenn warene 2. a erry Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL OFFICIAL TRANSCRIPT OF RECORDS Brian Riley Jr. Date: 2017 10 15 84073 Quinn Green, Davidberg, FM 19074 8477210 Transcript of Records from Jones, Collier and Mcbride School Anderson- Johnson. Institute Year Graduated 9020 High School Year Graduated College Year Graduated ENTRANCE DATA: _ teon Group University Grant LLC University 2002 Attended: Semester: 4 Summer: 2 SUBJECTS. “GRADUATED with the degree of Master in Artificial Intelligence {MPA} on per T Spee “4088 1I7Q) 433 Physic 1987 02 22 from ScottLid School =; Melaughiinfort al Order (C} No. 80 345201 13 s. 2003 dated May 8, 2003.” _Perry Rollins Academy Cl GRADUATE SCHOOL Su rrirrer sal Education and Wellness 4 25 3 “MJD 478 Web Development 4 50 4 19714 ZFL 188 Digital if MIG AeA, 1972, First Semester Logic Design 2 25 3 Linear Alaebra cue 5 PUX 479 Computer Networks 1 50 2 H 1979 2019 Second Semester RGS 476. Machine Learning 1745 3 XN 838 information Security 1 00 3 IHH 731 Human Computer Interaction 4 75 4 2022 1972 CBR 501 Project Sianagement 3 00 3 1997 1974, First Semester _ MNO 404: Artificial Intelligence 2 00 2 WOT 501 ee evemanes 2 00 2 MML 751 Business “GRADING sy ST EM | CREDITS i “REMARKS: a (Not valid without the Un iversity S Prepared 1980 2021 .Second Semester Process Reengimeering 474 1 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2020 07 25 [| 0 XOK H X K K X X X N K K K X M M K K M X K R K X X- Nothing Follows -x X xX X M X X M X N X K K K N K NON K MOM K NN copy Por: Young, Miller and Lopez Academy 4704 Brian Port, Blackbury, SD 39682 00- 97- -100% 1 25 94 96% 5 1 50 91 93% 5 1 75 88 90% 2 00 85 87% 2 25 82 84% 2 50 79 81% 2 75 76 78% 3 00 75% .$.00 Failed P Passed NC No Credits INC Incompicte W Withdrawn UW Unauthorized Withrawal. One college unit is at least seventeen (17) full hours of instruction in acadentic or professional subject within a seniesis Seah) David Cochran 080 79 a ufsoly Chery! Frederick EA Stephanie Thompson University Registrar By: DESC SRIPTIVE TIT LE GRADES CREDITS"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "tor",
        "ocr_text": "aes PEE lcigs PUP TROR 5 UNRO 027 Rav 6 1980 12 17 2016 03 34 Republic of the Philippines SP mam mw men mene... Perty Rolli ins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U Student Number 8477210 Student Name i Brian Riley Jr. Address 84073 Quinn Green, Davidberg, FM 19074 Date of Admission 2008 03 27 Entrance Credential Transcript of Records from __ Elementary School Date: 2011 10 15 rr: ~-- ~~. Jones, Coll cl ier and Mcbride School Year Graduated :2020 High School lann Group University Year Graduated College Year Graduated 1976 Grant LLC University 2002 Attended: Semester: 4 Summer: 2 GRADES i ENTRANCE DATA: 13 einige ee ataaeeeasencamanntg he “GRADUATED with the degree of Master in Artificial intelligence {| (MPA) on 1987 02 29 from Scott Lid Schoo} + Mclaughlinfort per Special Order (C} No. 80 345201 13 5. 2003 dated May 2 Seemann PeMy Rollins Academy Te y at GRADUATE SCHOOL 19088 Summer I7Q 4323 Physical Education if Wit and Weliness 1 25 3 I eb Development Hn. 8 8 1971 1972, First Semester || ZFL 188 a 1 50 1 Digital Logic Design RIG ger 7 2 25 3 Linear Algebra PUX 479 Computer Networks = 300 5 1 50 1979 2019 Second Semissiey -RGS 476. Machine Learning 175 {| () XO a3R information Security IHH 731 1 00 uman Computer Interaction 1 75 1 I 2022 1972 ‘| CBR 501 Proiect Management 3 3 00 3 | 1997 1974, First Se i) MNQ 404) pAttificial intelligence 2 00 2 i nilippine istory and i WOT 501 Governance 2 j » 1980 2024 \"Second Semeste 2 00 vance |) MML 754 Business Process Reengineering 175 4 I TOOK AND PASSED THrE 2020 07 25 Fi RIOK K R 5 5 X- Kona x x x. COMPREHENSIVE EXAMINATION ON [| -X X X X X X K x K- x3 “XOXK X K X X REX X R Ky Nothing Follows “X X X X [| ler and Lopez Academy COPY FoR: Young, Mil z Academ i i| Port, Blackbury, SD 39682 i 4704 Brian 1 00 97 100% | 25 94 96¢ Ls . 1 50 91 93% 1 735 88 90%, 2 00 85 87% 2 25 82 84% 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P= Passed NC No Credits | i INC Incomplete W Withdrawn UW Unauthorized Withrawal. || CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or Professional if 5 REMARKS: subject within a se rena oemacrnminnnnicmmammmo ee ~—noennteneninnermamnannggeal Re nn nermnrsnenamemna rnieseomscstomne moans niversity seal) Prepared By: David 2 Cochran /ofsd} a fh eye! sifso jg Cheryl Frederick Checked pi: Stephanie Thompson University Registrar Sea cereNaram easy AS eee ene reson Serene eerneewa ate nmmcmc ce tereecerenecans siento Sentara rere em tc ewes mt"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "tor",
        "ocr_text": "PUP TROR 5 UNRO 027 N° ur AME BO 1970 06 20 1989 11 29 Republic of the Philippines Perry Roilins Academy Ce ee ee ee 2 ~~ OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 5866204 Student Name Anna Davis Date: 1997 02 24 Address 958 Veronica Lodge, Coreyhaven, |A 38765 Date of Admission 2006 08 1 Entrance Credential Transcript of Records from _ ~.-.. ... Morton, Gonzalez and Bridges School Elementary School Green, Hernandez and Porter Academy Year Graduated 1985 High School ‘Montgomery, Snyder and Weaver University Year Graduated 1975 College Valencia, Nelson and Yu University Year Graduated 2000 Attended: Semester 4 Summer: 2 eee _SUB JE Cc S22 —— 4 cee || CODE ‘DESCRIPTIVE TITLE GRADES CREDITS |, De ee Oa eee TO ee meee e Eeeeeetseetteeieesteeeneeesenenateiemeneoeeeinees a coe! : ENTRANCE DATA: | “GRADUATED with the degree of Master im Probability and Statistics 1 {MPA} on 2015 06 18 from White LLC Academy _ sNew Sarahview I) per Special Order (C) No. 80 345201 13 s. 2003 dated May 8, 2003.” | ee eee ee ee _OETY Rollins Academy _ GRADUATE SCHOOL 1 1007 Summer I JNB 933 Probability and Statistics 1 25 5 1 DGO Systems Analysis and Design 1 50 4 | 080 1986 2021, First Semester || PLJ 711 Object Oriented Programming 1 50 3 1 |} cin zRas Operatina Systems 2 PH 4 | JZW 349 _. Software Engineering oe 2 50 4 || _QLE 098. Computer Architecture 275 5 1 FOK 289 Computer Networks 1 25 Q (| FXO 623 Object Oriented Programming 2 25 4 1 2023 1973 1 SDX 093 Systems Analvsis and Design 2 25 2? 1 1982 1990, First Semester 1] 1 VIL 717! Cloud Computing 2 50 2 || WBH 879 Data Analytics 3 00 5 I] 1998 1975 Second Semester || PKP 438 Business Process Reengineering 200 3 1 TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2019 05 04 | X X X X X X X X X X X X X K X K X K K X X X X K X- Nothing Follows -x x x x x x x N Xx x X X X X K K X K X X K X X X copy For: Peterson PLC Academy | 653 Nash View, Lake Samantha, DC 21780 || GRADING SYSTEM 1 00 = 97- 100% 4 25 94 96% 1 50 .91- 93% 1 75 88 90% 2 00 85- 87% 2 25 82- 84% ~]| i 2 50 79 81% 2 75 76 78% 3 00 75% 5 00 Failed P Passed NC No Credits i INC Incomplete W Withdrawn UW Unauthorized Withrawal, CREDITS One college unit is at least seventeen (17) full hours of instruction in academic or professional 1) subject within a semester (Not valid without the University seal) Prepared By: J ckie Lamb 82 7 A ckie amb ufsolg rik Bartlett Checked BY: Stacey Lopez University Registrar Teele eect einem cna inten emeemeammemeeeeaenemenen emeeeeenmatne emma tenaennnaneeeeeenteteemneneeeeee eee ne"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "tor",
        "ocr_text": "O puprShRESS PUP TROR 5 UNRO 027 Rev. 0 1989 11 -29 1970 05 20 Republic of the Philippines BO em . Perry Rollins Academy OFFICE OF THE UNIVERS| TY REGISTRAR PB GRADUATE SCHOOL mn STATE U OFFICIAL TRANSCRIPT OF RECORDS ~~ Student Number 5866204 a Aa. Student Name DL -Anna Davis Date: 1997 02 24 Address 958 Veronica Lodge, Coreyhaven, IA 38765 Date of Admission 2006 08 1 @) Entrance Credential transcript of Records from ‘__ 2 ts —~Morton, Gonzalez ang Bridges School Elementary School Green, Hemandez and Porter Academy” en Year Graduated 1985 High School ‘Montaomery, Snyder and Weaver University Year Graduated 1975 College Valencia, Nelson and Yu University Year Graduated 2000 Attended: Semester: 4 Summer: 2 IT — Lo _ SUBJECTS | CODE ; DESCRIPTIVE TITLE ee | GRADES me ENTRANCE DATA: “GRADUATED with the de (MPA) on 2015 06 18 ’ New Sarahview per Special Order (C) No 80 345201 13 8. 2003 dated May 8, 2003.» so Perry Rollir GRADUATE SCHOOL | JINB 933 Probability and Statistics 1 25 5 DGO Systems Analysis and Design 1 50 1 080 1986 2021 First Semester PLJ 711 Object Oriented Programming 1 50 3 Flll sRR} Operating Svstems 295 4 JZW 349 -. Software Engineering 2 50 4 _ Second Semester _QLE 098. Computer Architecture 275 5 FOK 9a9 Computer Networks 1 25 o) FXO 623 OPlect Oriented Programming 2 25 4 | 2023 1973 ‘| SDx 093 Systems Analvsis and Design 2 25 2 1982 1990, First Semester VIL717) Cloud Computing 2 50 2 WBH 879 Data Analytics 5 1998 1975 _ Second Semester 3 00 PKP 438 Business Process Reengineering 200 3 TOOK AND PASSED Trp COMPREHENSIVE EXAMINATION ON 2019 05 04 ees aa ee enna, Nothing Follows DIR RAK RIKI IKI COPY For: _Peterson PLC Academy 653 Nash View, Lake Samantha, DC 21780 | GRADING SYSTEM 1 00 97 100% 1 25 94 96% 1 50 2 00 85 87% 2 25 82 84% 2 50 79 81% 32 75 76 78% 3 00 75% 5 00 Failed p= Passed ;: NC No Credits NC Incomplete w Withdrawn UW Unauthorized With CREDITS One college unit is at least sevent (Not valid without the University seal) Prepared By: J Ckie amb80 9 V Gobaenie! ihe Checked py: Stacey Lopez Erik Bartlett University Registrar"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "tor",
        "ocr_text": "No ne ABZRS- 1989 11 29 STATE U Student Number Student Name Address Date of Admission Entrance Credential Elementary School Year Graduated High School Year Graduated College Year Graduated i ENTRANCE DATA: “GRADUATED with (MPA) on 2015 06 18 from i per Special Order (C) No. 80 345201 Sterne eMy Rollins Academ my _ i 1907, Summer OFFICIAL TRANSCRIPT OF RECORDS 5866204 _Anna Davis 2006- 08 10 Transcript of Records from: 4985 Montgomery, Snyder and 1975 Valencia, Nelson and Yu University 2000 Weaver University _DESCRIPTI v. E T rt T LE White LLC Acad Republic of the Philippines he 2 ee .etry Rolli Ins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL 958 Veronica Lodge, Coreyhaven, IA 38765 the degree of Master in Probabili ...Morton, Gonzalez and Bridges Schoo! Green, Hernandez and Porter A Academy mes fa Attended: Semester: 4 my and Statistics eMmy _ New Sarahvi lew -13 s. 2003 dated May 8, 2003.” nnn GRADUATE SCHOOL neocon aRaceennarewane or Date: PUP TROR 5 UNRO 027 Rew 0 1970 05 20 1997 02 24 i Summer: 2 ADES _CREDITS: i JNB 933 Probabi litv and Statistics 1 25 $s) DGO Systems Anal lysis and Design 7 50 4 |} _ 080 1986 2021, First Semester il PLJ 711 Object Oriented Programming _ 1 50 3 i Ein are Operating Systems 2? OS A JZW 349 -.___ Software Engineering _ 2 50 4 1973 1972. Second Semester [| .QLE 098. Computer Architecture 275 5 I} FOK 9R9 Computer Networks 1 25 9) FXO 623 Object Oriented. Programming 2 25 4 i 2023 1973 (| SDX 093 Systems Analvsis and Desi ign 2 25 2? VIL 717) Cloud Computing ng 2 50 2 || WBH 879 _Data Analytics #.00 5 i| 1998 1975 _ See: || PKP 438 Busir ness Process Reengineerin, 3 TOOK AND PASSED THE COMPREHENSIVE EXAMINA TION ON 2019 05- VA X X X K X x XoRR X X N X A X K K R K HEK X R N E X- Nothing Follows -x. NK K H X A K X KN K X X X X K X K X X K K X K X LI copy ror: Peterson PLC _ Academy i 653 Nash View, Lake Samantha, DC 21780 [crapines SYSTEM nese | REMARKS: 2 50 79 81% 2 75 76. 18% ; 3 00 15% : UNG Toovaplcw. W : Withdrawn ;UW One college unit is at least seve nteen (17) full hou subjec 2 Ww vithi a sémester- ile ; 00 97- 100% 1 25 94 96% 1 50 91 9 3% 1 75 88 90% 2 00 85. 87% 2 25 82 84% ; 5 00 Failed ; P= Passed NC No Unauthorized Withrawal, ‘rs of instruction in academic a OF AE PROPERTY AND MONEY ACCOUNTABILITIES. otk, Bartlet Credits OY professional ae t rity Registrar"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "tor",
        "ocr_text": "PUP TROR S UNRO O27 ATO Rev. 6 Nv nck 88 1970 05 20 4989 411 29 Republic of the Philippines ae eum m mae wmsnm a __Perty Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL STATE U OFFICIAL TRANSCRIPT OF RECORDS Student Number 5866204 os Student Name —— _Anna Davis Date: 4997 02 24 Address 958 Veronica Lodge, Coreyhaven, IA 38 65 Date of Admission 2006- 08 10 Entrance Credential Transcript of Records from _ —..-. -.- —— Huei on, Gonzalez and Bridges School Elementary School Green, Hernandez and Porter Academy Year Graduated 7 ORS High School ‘Montgomery, Snyder and Weaver University Year Graduated 1975 College Valencia, Nelson and Yu University =\" Year Graduated 2000 Attended: Semester: 4 Summer: 2 “SUBJECTS _ 2S a ‘LE _GRADES CREDITS “<GRADUATED with the degree of Master im Probability and Statistics 1 (MPA) on 2015 06 18 from White LLC Academy _ »New Sarahview per Speue Order {(C} No. 80 345201 13 s. 2003 dated May 8, 2003.” 1 _Perry Rollins Academy GRADUATE SCHOOL srt Ne SIE neh nee c vi 4007 ‘Summer it JINB 933 Probability and Statistics 1 25 5 DGO Systems Analysis and Design 4 50 4 gaa 80 1986 2021 First Semester 7 i} PLJ 711 Object Oriented Programming 1 50 3 {| |} ern zaat Operating Systems 996 A | JZW 349 _. Software Engineering 2 50 A 1 1973 1972. Second Semes .QLE 098. Computer Architecture 2745 5 1 OR ON? Computer Networks 4 95 5 (| FXO 623 Object Oriented Programming 2 95 4 1 2023 1973 ' SDX 093 Systems Anailvsis and Design 2 29 2 i! i 1982 1990, Hiss? Semester i VIE A Cloud Computing 2 50 2 1 || WBH 879 Data Analytics 3 00 5 1 i! 1998 1975 Second Semexter | PKP 438 Business Process Reengineering 200 3 || TOOK AND PASSED THE COMPREHENSIVE EXAMINATION ON 2019 05 04 | r X X K X K X K R K X KM N K K K KM K K M R K K K K X- Nothing Follows -x x x K N x M M X X X X X X X K X X M K X N N X 1 i] 1 copy For: _Peterson PLC Academy 1 653 Nash View, Lake Samantha, DC 21780 1 GRADING SYSTEM 1 00 = 97. 100% -1 25= 94- 96% 51 50 = 91. 93% 1 75 88 90% 2 00 : 85 87% 12 25 82 84% i] i 2 50 79 81% ce 76 78% 3 00 75% 5 00 = Failed P Passed NC = No Credits i INC Incomplete W Withdrawn UW Unauthorized Withrawal. || CREDITS cals renene hiide is at Spinich seventeen (17) full hours of instruction in academic or professional i REMARKS ibe resmenemnvimameecsmmnnenmncantnneaeceysurenemetnenai nereem (Not valid without the Uni Freer sity are —- = Prepared By: Jackie L. nla: hy, A pollg rik Bartlett Checked J Stacey, Lopez University Registrar"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "tor",
        "ocr_text": "Alo Ne rupr ARE GS 1989 11 29 304 STATE U Student Number Student Name Address Date of Admission Entrance Credential Elementary School Year Graduated High School Year Graduated College Year Graduated JNB 933 PLJ714 [| St ama} || JZW 349 ‘| _QLE 09. FOK 989 |) VIL 7417) I {MPA} on 2015 06 18 from »New Sarahview {| per Special Order (C} No. 80 345201 13 s. 2003 dated May Sesame ah eMy Rollins Academy _ 1 25 5 DGO Systems Analysis and Design 080 1973 1972, Second 2 | SDX 093 Systems Analvsis and Design 2 50 2 WBH 879 Data Analytics PUP TROR S UNRO 027 Nev, 6 1970 05 20 Republic of the Philippines Str ese me mew miee ne «.. WP Ory Rollins Academy OFFICE OF THE UNIVERSITY REGISTRAR GRADUATE SCHOOL OFFICIAL TRANSCRIPT OF RECORDS 5866204 _Anna Davis Date: 4997 02 24 958 Veronica Ladge, Coreyhaven, IA 38765 2006 08 10 __ : Transcript of Records from 1985 ‘Montoormery, Sryder and Weaver Ui 1975 Valencia, Nelson and Yu University 2000 new een ne. Morton, Gonzalez and Bridges School Green, Hernandez and Porter Academy oe niversity Attended: Semester: 4 Summer: 2 SUBJECTS ORO EC ener ere caenameneathps “GRADUATED with the de gree of Master in Probability and Statistics White LLC Academy 8, 2003.” i —-—___________ __ GRADUATE SCHOOL 1007, Sumsyner [1 Probability and Statistics 1 50 1 1 1986 2021, First Semester [| Odject Oriented Programming 1 50 3 Operating Systems 295 4 [| Software Engineering 2 50 4 Computer Architecture 75 5 I Computer Networks 1 25 2 Object Oriented Programming 2 25 4 i 023 1973 ; 225 2 982 1990: #irst Semester Cloud Computing 1998 1975 _ Second Ses er || PKP 438 Business Process Reengineering | TOOK AND PASS. X X X X K X X K xX- i X K K X X N K XR E K K X N K X K- Nothing Follows I] 1 GRADING SYSTEM Prepared By: J C 2nN ED THE COMPREHENSIVE EXAMINATION ON 2019 05 04 Hy POOR BP K HACK K R X K X K R 4 X K X K X K X COPY FOR: _Peterson PLC Academy 653 Nash View, Lake Samantha, DC 21780 1 00 97 100% 1 25 94 96% 1 50 91 93% 1 75 88 90% 2 00 85 8 2 50 79 81% 2 75 76 78% 3 00 75 1% 5 2 25 82 84% ii 73% 5 00 Failed P Passed NC No Credits i INC Incomplete W Withdrawn UW Unauthorized Withrawal, I] One college unit is at least Seventeen (17) full hours of instruction in academic or professional i subject within a H rl 7 7 OF ALE PROPERTY 4ND MONEY ACCOUNTABILITIES. i Pe kie Lamb 2 90 79_ i ALT td hy’ (ifso g Erik Bartlett Sin ey Lopez University Registrar"
    }
]