[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "AT EStet Study o7 Graduates of Y nines of ET 1 Ragion WA A Tracer Study on the Eninepy Ventures of T ET Graduates of framing Center, Region fy Lopez, Casira and Brooks four fata as nsycemgans tor Bachelor of Science in Infor Systems Burharn, Kathy y Barnes, Aaron V. Seodman. Lisa D Meciain, Michelle Prt Sarah Snyder Seniembig7s igs"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "end Brooks stint nfornation Durham, Kelly W Barnes, Aaron V. Goccman, Lisa D Meclain, Michelle 8 Pot Sarah Snyder fembtie7s"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "ATracer Study on the Entrepreneurial Ventures of TVET Graduates of TESDA Training Center, Region IVA Net A Tracer Study on the Entrepreneunal Ventures of TVET Graduates of TESDA ‘Training Center, Region IV A An Under ths Faculty ot Lopez, Castro and Brooks Institute Bachelor of Science in Information Durham, Kelly W. Barnes, Aaron V. Goodman, Lisa D. Mcclain, Michelle R Peo Sarah Snyder Septemb1979"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "- the Entre; ial Ventures of TVET \"Graduates Of TESDA ee} ng Centar Regier WX ATracer Study on ti Ventures of VET Gi at 4, TESDA 1s Region RE ‘e Undorgmduat Tess resented tothe Pauly of Lopez, Castro and Brooks Institute ‘partial fulfillment ofthe requirement for the degree Bac! f ir helor of SSienee in Information Researcher Durham, Kelly w. Barnes, Aaron Vv. Goodman, Lisa D Mcclain, Michelle R Po Sarah Snyder Septembi979"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "A Traces Study un the Cniepvenairis! Ventures of TVET Graduates of TESDA Trakiing Center, Region IVA, oS A Tracer Stuy oe the Entreprenouriat Vertes ing Con ONes, Si Ragen WSESOA Aa Later hua Ricca precmnad w 8u Hain ot Lopez. Gastro and Brooks inctitite Anpaceal fatncns of dae rageramenes fe tae Ape? Bachelor of Sgeegce in trformation Roscashave Durham, Kelly W. Barnes, Aaron V. Goodmen, Lisa D. Meclain, Michelle Pet. Sarah Snyder Septemb1979"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "A Tracer Study on the pyran Ouicomes o} Graduates of “RRS TB) Ae Ueengatans Yes puenctas ts co Vargas Adams Sc! Hence in aRGUrSINB n, Jeffrey ©, Ruiz, Savid White, Ashley V Kolly, Diana M, Yroy Sharp January 984"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "A Tracer Study on the Emy Pee OO eS of BSIT Graduates of LPU Batangas (2018 2023) A Tracer Study on the Employment Oo f BSIT Graduates of BE SSiangas (2018 3853) Ao Undergraduate Those Vargas Adams School ruirement fr the dogs Bachelor of Science in eho rahip Franklin, Jeffrey C. Ruiz, David S. White, Ashley V Kelly, Diana M. Po! Troy Sharp Januam984"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "Tracer Study on the Fa ranges tere) NSIT Graduares oF LPU o the Employment \"Owe Tracer reo on ae ee ne Ainaergndvans Treisman 9 BE YSN ot Vargas Adams School ta pre abit fe rasnenras he Se Boge UTNE Frankiin, Jeffrey C. Ruiz, David S. Whnts, Ashiey V. Kelly, Diana M. roe Troy Sharp Januamige4"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "A Tracer Study on the Employment Outcomes of BSIT Graduates of LPU Batangas (2018 2023) A Tracer Study on the Employment Outcomes of BSIT. Graduates of LPU Batangas (2018 2023) An Undergraduate Thesis presented tothe Faculty of Vargas Adams School 1 partial fulfillment ofthe requirements for the degree Bachelor of Sc “Enfrepreneursnip Researchers Franklin, Jeffrey C. Ruiz, David S. White, Ashley V. Kelly, Diana M. Pot. Troy Sharp Januan1984"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "& Tracer Stidy 99 ihe Empioyment Franklin, Jettrey ©. Ruiz, Davi S Troy Sharp Jaruent964"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "HME ir Of AEE Graduate Tracer Career p, Pals he Rety Fishe: College gence in HOS: fer Re CAMA Rose p ole Bingory Ae, Aibse> Septembiggs"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "Ed Alumni of PNU Manng the Career Paths Of BEEd Alumni of PNU Manie Class of 2019 Graduate acer say: Assessing the Cc of Ini Of Pi Aang GEE or SGIg° ‘An Undererduate Thess presented othe Facuky of Montgomery Fisher College ‘partial fulfllment of the eguircments for the degree Bi f Science ir Png Sh Sage’ in Roscantor Daniels, Stephanie J Jensen, Jennifer R Goodman, Rose p. Austin, Nichole C Prot. Gregory Martinez Septemby 988"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "Sm ONS Facute of Monigomery Fisher Coluge Bachalo of Scie Malt Roca HS2D, dennifer Goodman, Rosa P Austin, Nichole ¢, Prot Gregory Martine Sepiemiy one"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "fUcMande. Clase es Ot BEES Anum of F NU Manda, Ciass of 2619 ey Graduate Tracer Shuyy y: Assessing the REE REN AEA Arey SG ontryaiions Mew prose te he baeny of Montgemary Fishor College Pe! Renmer 0 8 ragusconce bro ey Basis eee Dantes, Stephane J Jensen, Jenniter R Goorman, Rose P. Austin, Nichole 6 Pol Gowgory Martie Sspiembrarge"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "Graduate Tracer Study: Assessing the Career Paths of BEEd Alumni of PNU Manila, Class of 2019 Graduate ere St Esa Ce 1 Path: of *BHU hiania, Class ot 2019 ‘An Underpraduat= Thess presented tothe Faculty of Montgomery Fisher College 4 patil fulfilment of the requirements fr the degree Bact nce Researcher: Daniels, Stephanie J. Jensen, Jennifer R. Goodman, Rose P. Austin, Nichole C. Prot. Gregory Martinez Septemb1988"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "‘An Gvahsation of Fimpioyabity and Job Salistaction ‘Acnong BSME Graduates ot MSUT {2017 2022} An Evatuation of Em MSUATE ‘An bbotapradae Theo proses wth Pacaty of Robles Rodriguez Schoo! te proud ftcteent of ie gern forthe See Bachelor HSA in Medicat Bailey, Dustin J. Villa, Nataiie B. Lawson, Kelly 1. Roberts, Catia D Prot. Cheittopter Young June 2000"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "ation at E BSME G ra 17- in J. Villa, Natalie &. Lawson, Kelly fy Roberts, Cailtin rot Ohvistopher Young June 2060"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "An Evaluation of Employability and Job Satisfaction ‘Among BSME Graduates of MSU4IT (2017 2022) An Evaluation of Employability and Job. Satisfaction Among BSME Graduates of MSU IIT (2017 2022) An Undergraduate Thesis presented tothe Faculty of Robles Rodriguez School Jn partial fulfillment ofthe requirements for the degree Bachelor f Science in Medical Researchers Bailey, Dustin J. Villa, Natalie B. Lawson, Kelly N. Roberts, Caitlin D Prof. Christopher Young June 2000"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "An Evaluation of Employabili and Job Satisfaction Amon Bone rect of MSULIIT ‘b61 71 2022) ‘An Underadate Tass post 19 the Faculy of Robles Rodriguez School ‘paral ulfllmce of he egiremens fo the degre Bachelor Fearignse in Medical Rescate Bailey, Dustin J. Villa, Natalie B. Lawson, Kelly N. Roberts, Caitlin D, Prof. Christopher Young June 2000"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "ose page y ph Among BSME Graguates of MSU4IT (2017 2002), aia An Evaluation of F: Ey ond Job Satisfaction SME Graduates of MSUAT 17 2022) Aa Uden: Tepes wits Facahy of Robles Rodnguez School pat Mba of the eegaerins br te poe Bachelor 4 eScieges, Medical fewareacn, Bailey, Dustin J. Villa, Natalie 8. Lawson, Kelly N Roberts, Caitin D trot. Cheieiopner Young June 2000"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "Tracer Study on the Professional Development of BSBAAlumni from DLSU Dasmarinas Tracer Study on the Professional Development of BSBA Alumni from DLSU Dasmarifias An Undergraduate Thesis presented tothe Faculty of Chen, Olson and Cruz Institute Jn partial fulfillment ofthe requirments for the degree Bachelor of Science in Civil gineering Researchers: Todd, Colleen C. Todd, Michelle R. Bell, Emily S. White, Daniel A. Pet Brian Tran Februar1996"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "n the Pi Ba Trace Deve ror DLSU O: fessignal Dever opment of 8 i, SU Dasmet a and Crue insti een, 0 ache! sence Civ Eaeens set Gran Tran Fepnuartgaé"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "Tracer Study of Ihe: Professional Development of of BSBA Aluinse From DLSU Dasmariss groin Te yon and Cruz fastitute oner, Todd, Cetleen C. ‘Todd, Michella R Beil, White, Danie! HAL ret Brian Tran"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "Tracer Study on the Professional Development of BSBAAlumni from DLSU Dasmannas Tracer Study on the Professional Development of BSBA Alumni from DLSU Dasmarifias An Undorpnduate Theis presto o the Faculty of Chen, Olson and Cruz institute Jn paral futllment ofthe requirements fo the dogo Bachelor of Science in Civil ngineering Rowarchers Todd, Colleen C. Todd, Michelle R. Bell, Emily S. White, Daniel A. Pe! Brian Tran Februar1996"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "frecer Study on the Professional Develop of iF aa from DLSU Dasmari Tracer Study on the Professionai Development of BSBA Alumni from DLSU Dasmarifias Aa Vncorwraane These prsowied tthe Facet of ‘Chen, Olson and Cruz institute a prc fitment oft reqanerem fou te gece Bache! BERS in Civ Porcentans Todd, Colteen ©, Todd, Michalle R. Bell, Emily White, Danie! A. ’* Brian Tran Februartgoq,"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "aA acer arees Te Stokes, Julia S n, Joshua Ae Doyle. Chiistina Mi est Care Hanis May 2070"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "Career Tiaiectories of BSHM Graduates: A Tracer ‘Study of UST, Batch 2026 Career Trajectories of BSHM. Graauates: A Tracer Study of UST, Batch 2026 An Undenpatuas Dee prencren tc baal of Aeawaries, Proctor sod Cacmol Gniersty a arate of ts vegutcenes ahe 9 Powacr Stokes, Julia S. Martin, Joshua H. Thompson, Lauren F. Doyle, Christina M he\" Came Hanis May 2010"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "Graghuaies: A Tracer Career Trajectories of BSH 1 BSHM fy of UST. Stokes, Julia 8. Martin, Joshua H. Doyle, Christin OS Came May 2010"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "Career Trajectories of BS Study of Us Trajectories of BSHM 202 Graduate: AT Atseantes, Proctor ancl Gare Unteerity B noody Stokes, Julia S. Martin, Joshua H. ompson, tauren F Doyle, Christina M May 204"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "Career Trajectories of BSHM Graduates: A Tracer ‘Study of UST, Batch 2020 Career Trajectories of BSHM. Graduates: A Tracer Study of UST, Batch 202 An Undergraduate Thesis presente to the Faculty of Alexander, Proctor and Carroll University In partial fulfillment ofthe requirements forthe degree Bachelor Sense,” Medical Researchers Stokes, Julia S. Martin, Joshua H. Thompson, Lauren F. Doyle, Christina M Pro Carrie Harris May 2010"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "(RIN ING Suce: Graduates oF B: Success of BSEd Engtish PBSU from 2018 ig 4404 Hufiman Mec oh Oo Bachelor of Science ir Mathematics George, Brandan ny Soneaiee, Howard J i. Samantiia 4. &, Danial Februargois"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "Graduates of Baty 35, BSEd English Graduates of BSU from 2016 t6 2021 ey o Tracking the Success of BSEd English Graduates of BSU from 2016 to 2024 An Underpraduate Thess tod othe bac Huffman Mccullough College MEMES Fr the dosece eNaRh at lence im George, Brendan Gonzalez, Howard J Young, Samantha A Chase, Daniel J, Pot Kimberly Rogers Februar294 5"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "UGURING tie Dt O% Graquates of BSI fro. Tracking Graduate Georgy George rendan Ni Gonzaiez, Howard J ne, Samantha a Chase, Danial J Kimberly Rogers Pebruar204§"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "acting the Suscess yf SSE Engin Graduates of BSU from 2018 tn Sos Tracking the Success of BSE Graduates of 85U ean 5 peti estore Bachelor of Science in Mathematics te wa Rescanters Seorge, Brendan Ni Gonzaiex, Howard 4 Young, Samanihs 4. Chase, Daniel J Kirbietly Rogers Pabruarcacc"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "Jee ESTES VY Gradua of Of BSU from Hacking the Suc Ge uals of Hutt, ullough College Bachelor of Science in Mathemaics Young, Samant na Chase, Daniel Kimberty Rocers Februarsg4 5"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "hie aerate Gh Empiosmant Araong Bue ibe Reh eece hea demic Mapa ising of Ficsway A Tracer Study on the Ret Hevanwe of Acadeanic Eparabon is Cument empower Ann Gratuates ot Univeusdy of the Eos?” ‘6 Leona Thesis revs s Hacuty of Freeman, Jones and Costa ‘sstiats Petar Fete of the gine nthe gn (Sete in Mechanicar Rogers. Kenneth, t Delsciuz, Cynthia a Moraes, Catherine Ford, Chiistopher a Pamets FH Januantg73"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "AA TEBE Suton te Relevance of Acad: Prcperaion to Curent ployment Among BSCS Graduates of Universty ofthe East A Tracer Study on the Relevance of Academic Preparation to Current Employment Among BSCS Graduates of University of the East An Undergraduate Thesis presented tothe Faculty of Freeman, Jones and Costa Institute {partial fulfillment ofthe requirements for the degree Bachelor of Science in Mechanical gineering Researchers: Rogers, Kenneth T. Delacruz, Cynthia A Morales, Catherine R. Ford, Christopher A. Prof Pamela Larsen Januan1973"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "‘A Tigcet Study on the Relevance of Academic Preparation to Current Eploymen Among BSCS Saas el mean aH Sa A Tracer Study on the Relevance of Academic Preparation to Current Employment Among BSCS Graduates of University of the East An Undergraduate Thesis prescntod to the Faculty of Freeman, Jones and Costa Institute ‘In partial fulfillment ofthe requirements forthe degree Bachelor of Science in Mechanical ngineering a Rogers, Kenneth T. Delacruz, Cynthia A Morales, Catherine R. Ford, Christopher A Prof Pamela Larsen Januan1973"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "Ema oY On the. FELL ot Academe: Preoaraton to Current Empoy' en eg BSCS Sten, Peart to Ca o A Tracer Study on Preparation to C BSCS Graguat the Retevance of Academic ‘ument Employment Amor 'eS of University of the East Freeman, Jones and Costa Institute Bachelor of Science in Mechanical ‘ngineenng Rogers, Kenneth T Delactuz, Cynthia A Morales, Cathenne R Ford, Christopher A P™\" Pamela Larsen Januan 973"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "A Tracer Study on the Relevance of Academic Preparation to Current ‘Employment Among BSCS Graduates of Universty of the East ‘ATracer Study on the Relevance of Academic Preparation fo Current Employment Amon: BSCS Graduates of Universty of the Eas An Undergraduate Thesis presente tothe Faculty of Freeman, Jones and Costa institute Jn partial fulfillment ofthe requirements forthe degre Bachelor of Science. in Mechanical ngineering Researcher: Rogers, Kenneth T. Delacruz, Cynthia A Morales, Catherine R Ford, Christopher A Prof: Pamela Larsen Januani973"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "1 Se SS Se BSE INE Ase Sho he °o A “Ee eRe Laguna (2015 20200 setter penser Reid Fernandez Academy ‘erate hime ofthe requirements forthe degree in Warren, Deborah R. Davenport, Tonya D. Hawkins, Lee T. *« Tom Greer March2008"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "mm EM agate Graduate Emptoyabiity and Litelong Learning: A Trace® Study of ine Cakage of Ns and Sciences, OLSU Laguna (2015 2020) As Underpants Taos rosea othe acy of Reid Ferandez Academy ‘pas! Flite of tas rogues wy te ogee moc Seen tomatoe Warren, Deborah R Davenport, Tonya D. Santos, BryanA Hawkins, Lee T. Tom Greer March2008"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "Graduate Employabilty and Lifelong Learning: A Tracer Study of the lege tre ans Sswnces, BLEU: Laguna 2016 2020) Graduate Employability and Lifelong Learning: A Tracer Study of the College of Arts and Sciences, DLSU Laguna (2015 2020) An Lindorpraduate Thesis presented tothe Faculty of Reid Fernandez Academy Bachelor of Science in rchitecture Researches Warren, Deborah R Davenport, Tonya D. Santos, Bryan A. Hawkins, Lee T. Pe Tom Greer March2008"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "Graduate Emplyabity and Lifelong Learing A Trager Sty of the College of Arts and Seences, DLSU Laguna (2015 2020) Graduate Employability and Lifelong Learning: A ‘Tracer Study of the College of Aris and Sciences, DLSU Laguna (2015 2020) An Undergraduate Thesis presente to the Faculty of Reid Fernandez Academy 1n partial fulfillment ofthe requirements forthe degree Bachelor of Science in ae ‘Archi ecture. Resear Warren, Deborah R. Davenport, Tonya D. Santos, Bryan A. Hawkins, Lee T. Pet Tom Greer March2008"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "Graduate Employabty an Lifelong Learning: A Tracer Sty ofthe Lees Scences, BLSU. Laguna 2015 2020) Graduate Employability and Lifelong Learning: A Tracer Study of the College of Arts and Sciences, DLSU Laguna (2015 2020) An Undergraduate Thess presented to the Faculty of Reid Fernandez Academy tn pata ffillment ofthe requirements for the degree Bachelor of Sci i eh Resae. een Researches: Warren, Deborah R Davenport, Tonya D. Santos, Bryan A. Hawkins, Lee T. Pet Tom Greer March2008"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "Richavd: Chavez Academy miertary Edt Cooley, Lisa ©. K. Pris Katies Smitty overnb2o20"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "g a8 BSN Ay ooiey, Lisa Maine: Wilkams, Abig Chitstersen, Vince ror Kaitlyn Siaith Novemb2029"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "Richard SomOhaver Acaderny Cooley, Lisa ©."
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "Post. Grasuaien On gernes a Fes iad” An Undergraduate Thesis prosentod tothe Faculty of Richardson Chavez Academy te paral fillet of the raguarement or the SERPS Bachelor of Elementary Education Rowton Cooley, Lisa C. Martinez, Jason K. Williams, Abigail B. Christensen, Vincent D. Pret Kaitlyn Smith Novemb2020"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "K Nove"
    }
]