[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "May 2022 acer Study on BS Computer Scence Gra luates of STI College Chbaa (Batch 2019 2074) is Hiiguel V. Ba ta, Kristine L. De Guzman, Calo P Rivera, and Elaine M. Co ABSTRACT stacy a 2s of BS Comparer Science at uahon The majority ar wek S oF data analysts. Hes piegiamanhg ad hands on projects as valuable preparation. jhe sturdy found that graduates raiod ther col fruhing as effective in buikding techn neeuing renforement inclade sv mentation, The ceoort suagests 2 ne and ndusiry but was th hand project ation between cated before"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "May 2022 Tracer Study on 83 Comput Cubao (8: ence Gi ich 2019 2024) Miquel V. Bautista, Krsting L De Guzman, Carlo P. Rivera, and Elaine ASSTRACT vicomes of BS: chao (Batch anne jay raining A sented the emmploymsat Coragater Science radua Ti Galiege 2024), Using descrplive research, ihe study 2 alignment, Salary levels, and satistaction with college high percentage of gradustes secured jabs wittin six months of graduation. The marty are work ware Sngneers, Web Sevelopers. or data ondants clea prache, urs projects as vakiable ly found fat gacustes sled their collage in butiding technical skils, However, aresis n ans project documentation. The fepoi academe anc"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "May 2022 Tracer Study on BS Computer Science Graduates of STI College ‘Cubao (Batch 2019 2024) Mi V. Bautista, Kristine L. De Guzman, Carlo P. Rit igual ‘and Elaine M. Co ee ABSTRACT 2010 2024) the study examined job ‘raining percentage of graduates secured jobs within six months of graduation ‘are working as software e programming courses and hands o' rojects 2s vanuable Srogrammning courses a n pi as that ites rated thes college hon. The study ng as eflectve in busing technical skis. However, areas reinforcement include system design and ng syst pr documentation. The academe ‘but was truncated before"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "May 2022 Comprter Science Graduates of STI Cotege Tracer Staty on BS Come (Batch 2019 2024) Miquel V. Bautista, Krietine L De Guzman, Carlo P. Rivera, and Elane M. Co ABSTRACT plogramining Courses ANSON DIORes ts vite ieparaton, The study found tat college ung as eflectve in Ler ical skis However, ares reniiorcementwclads sysiem design and propet documentation. The: reer suggests stronger coordmation ‘Scacleme and industry bul was truncated before"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "My oe yuter Science Srauates of STI College “Tracer Study on BS Comp! ‘Batch 2019 2024) Cubao Miguel V. Bautista, Kristine L. De Guz man, Carlo P. Rivera, ‘and Elaine M. Co ABSTRACT This tracer el document employment ‘outcomes of BS gata stl aR oGtba0 (Batch 5 jol apie 300) sn Using dec Fan bet mereemtage on of ye reluates atures 7 tcp The eee are working 25 Software engineers, weD ‘Respondents cited practical ning 8 cuen e 3t er inical skills. Honerer oes fem design and pr “Sefcement incl ae: syst Frongen coordination tween documentation ‘The r on Th put was runcated Def"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "January 1986 Tracer Study of BS Psychology Graduates of PUP Manila (Batch 2019 2023) Mana L. Santos, John P Dela Cruz, and Enka M Villanueva ABSTRACT This tracer study aimed to determine the employment status relevance of academic preparation, and professional engagement Of BS Psychology graduates trom PUP Manila Data were collected through online surveys and follow up intermews with respondents ‘across vanous sectors The study highlights that most praguates found employment within six months affer graduaton Howe ver several noted that their current roles were not directty aligned with then degree specialization Findings further suggest the need for curnculum review to enhance workplace readiness Respondents ‘expressed high satisfaction with the university s academic rigor Many graduates pursued further studies in counseling and clinical psychology Challenges identited include lack of mental health training exposure dunng college Recommendations indude"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "See Tracer Study of BS ob Seesates of PUP Mania (Batch Maria L. Santos, John P. Dela Cruz, and Erika M Villanueva ABSTRACT to status, erences ee aimed ransnine, the employment hey OA BS Psychology graduates 1a pi Data were eros vail Save a low rte a Were cl tou employee a Sy ha that most tes, Beg ah foles were not yptoned wth curriculum review ie canon 5 fe rus on with the university s acasesee Many ate pat"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "~ January 199 Tracer Study of 8S Psycholo gy Gtaduates of PUP Mania (Batch 2048 3093 Maria L Joke P Dela Cruz, and Enka i. Vihanweya ABSTRACT SOF UGY aimed te determine the Bee pi acate nn preparation ard prot Faduates torn Pe SPIE YS. at sectors Th, found employment povment status onal JP Mania Data it Foles were ne Fradines turer 0 enhance workplace rea Uh satstackon wath de unive aduates pi Psychology Cha: H s acads ounseling an ie lack of 7 ommencte sued further studies inc mges Kentted ick"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "January 1986 Tr of BS Psychology Graduates of PUP Manila (Batch ‘acer Sey of BS Psychology Gime Maria L. Santos, John P. Dela Cruz, and Erika M. Villanueva ABSTRACT This tracer study aimed to determine the employment status, Jelevance of academic preparation, and professional engagement of BS Psychology graduates from PUP Manila Data were collected through online Surveys and follow up interviews with respondents across various sectors. The study highlights that most graduates found employment within six months af Several noted that their current roles were not direct"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "— danuiary sage aduales of PUP Manila (Baten 2) dobn Fata Griz, and Enka ag al ASSTRACT Tisis tracer tudy aimed te o le the: CMPIOVTER status seieyanee of academic preparavon ‘ofessional engagemsnt of BS Ps 2g) fam FUP Manila ata were Seen, ug air Toteavup inlerviews witn respsieierne nig Study Bighlghts ibatwnoc ghee a Sik Menthe after graduation Ligue J ATet ties were nat daecny aligned wilh fo ana, Ptings ‘tear suggust oe es for ew to enhance Workplace ragety Respond expressed igh satist ihe universtys acagerae niger Mery graciusies pursved further sieieene ounsefing ana chiucat Psychology, Chatlonay Koi meniat health taming expo: Oommen S nclucde tes"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "dune 2024 doyment Gutcomes of BSEd Engl Five Year Review Rafsel J. Mendoza, Carla R. Gutierrez, Bryant. Ramos, and Angelica P. Sorat ABSTRACT a empkiyment outcomes of 5 vaseaty of Santo Tomes from 2087 employability, job reevance, and prot sevciopment opperursties. Majonty of the graduates wer absorbed by private schoais winin Meio Manila, A smeatier percentage pursued gracuat f cormmunication Ses, The study emphasizes m experiences and teacher traning, Gradustes Sa fay ifs sold language foundation. Howe respondents expressed cancem about the lined exposure {o Teoderh educational lechnology, The researchers propose, 2 Enages with public msltuiiens and regional Senpuses 16 imprave. Further analysis needed to"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "Fue. dora, Carls Ratael J. Men june 2024 of BSES Enghsh Animnt of UST A vear Review i, Gutierrez, Bryan L. Ramos, and Angelica P Sonano ABSTRACT The study explores the gia ne J erough quantialive and qualtative sioyabiity. i ceased em bed hy prvaie scl respondents expressed moder ec strengthens carnpus age swersiy f Sante Tomas tro pinent opportuni 2 AUrsUEd GraGuat rabonel technology. prove Further a ering, the research ate ga os. Majanly of the grat hools within Metso Manila Amal ie fifted to carporale STE A her trainngg 3 foundatian. However, concen atutons an th pubic ronal siysis IS Fe eae"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "Employment Outcomes of BSEd English Five Year Review Ratae! 4 Mendoza, Carla R. Gutierrez, Bryan |. Rares, and Angeica P ABSTRACT sidy explored the employment outcomes of BSEd English 28 from the University of Santo Torans iroie 2017 to 2022. Through quanttatwe ard qualitative data gathering, the resoarch assasaed eniployabiity, job relevance, and professional development opportunities, Maorty of absorbed by prvate schools wip wet aduate studies of shifted to eizes the :mportancs practicum expenences and teacher training Gradusies ST for fs salia tanguage foundation. However Hs expressed concem about Ihe limited exposure alionai technclogy. The researchers propose g nk, 7 “institutions and regional UTIDUSES IG IMpPTSWe, Far 8 needed to “OPORE. of"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "June 2024 Employment Outcomes of BSEd English Alumni of UST A Five Year Rewew doza, catia Guterrez, Bryan Ramos, and Ratael J. Men ‘Sonano ABSTRACT ae setmage puro Beireeion tots he study empha vasizes the importance «tase Graduates ote ae ded UST for is solid ates jon However, ‘the limited expose to"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "June 2024 Employment Outcomes of BSEd English Alumni of UST: A Five Year Review Rafael J. Mendoza, Carla R. Gutierrez, Bryan L. Ramos, and Angelica P. Soriano ABSTRACT The study explored the employment outcomes of BSEd English graduates from the University of Santo Tomas from 2017 to 2022 hrough quantitative and qualitative data gathering, the research assessed employability, job relevance, and professional development opportunites, Majority of the graduates were absorbed by private schools within Metro Manila. A smaller percentage pursued graduate studies or shifted to corporate communication fields, The study emphasizes the importance of practicum experiences and teacher training, Graduates commended UST for its solid language foundation. However, respondents expressed concern about the limited exposure to modern educational technology. The researchers propose strengthening linkages with public institutions and regional campuses to improve. Further analysis is needed to"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "— Hecember 1997 Josech C. Tan, Mich: ele G. Bautista, and Franc Sum ABSTRACT analy MestGated the carser tralectories of BS information Technology alu of FEU inahne ot Technology. Using racer nodology. the study focused on eng yMenl We, salary hifses tO Job placement Resulis teres weete siaploved within one year of nent: 2 Gevelopers or eelancing, 2 rend vite Positive employment 3 Noted gaps in Project management trainin Chiates as technically proficiee! but ne n. The stidy Conchustes that {s with industry trends wealkd Addioria on are still being"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "December 1987 Career Frajectories of BS information Technology Graduates of FEU institute of fechnology Joseph Tan, Michelle G. Bautista, and Francs R. Lira ABSTRACT This sty inveatinatod th cares clories of BS information fechnoiogy alumn of FEU tnstlute pt ioe sa er study focused on employment Type, salary ‘evel, ee ey ce of TT courses 1 fb placement Rests reveal that 93% of graduates were emplayed within one year on respondents are now soRware developers oF statishe rest 0 980 ape eran gemen rau cs, aman nn Employers rated rachates a8 ech cay Da necaing: een communcaton The study concludes thet aneura ‘commurycation. capstone Projects w hop intustry bends wou Additonal data on progression are still peing"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "December 1987 Career Trayectones of BS Information Technology Graduates of FEU Institute of Technology Joseph C Tan, Michelle G. Bautista, and Franas R Lim ABSTRACT This study investigated the career trajectones of BS Informaton Technology alumna of FEU Insitute of Technology Using tracer methodology, the study focused on employment level and relevance of IT courses to job placement. Resuits revealed that 93% of graduates were employed within one year of graduation Many respondents are now software developers or systems analysts ‘Others ventured into dial freelancing, a trend accelerated by he pandeme Despite posite employment statsbcs, rest management training Employers fated graduates a Sedma proficient but needing improvement in communication. The study concludes that aligning Capstone projects with industry Tends wets Addeonal dats on salary progression are stil beng"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "December 1987 Career Trajectories of BS Information Technology Graduates of FEU Institute of Technology Joseph C. Tan, Michelle G. Bautista, and Francis R. Lim ABSTRACT This study investigated the career trajectories of BS Information Technology alumni of FEU Institute of Technology. Using tracer methodology, the study focused on employment fype, salary level, and relevance of IT courses to job placement. Results revealed that 93% of graduates were employed within one year of graduation. Many respondents are now software developers or systems analysts. Others ventured into digital freelancing, a trend accelerated by the pandemic. Despite positive employment statistics, respondents noted gaps in Broject management training. Employers rated graduates as technically proficient but needing improvement in communication. The study concludes that aligning capstone projects with industry trends would. Additional data on salary progression are still being"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "December 1987 tories of BS Information Technology Graduates of Career Traject FEU Institute of Technology Joseph C. Tan, Michelle G. Bautista, and Francis R Lim ABSTRACT “This study investigated the career trajectories of BS Information Technology alumni of FEU Institute of Technology. Using art Te oI O8Y, the study focused on employment type, salary level ‘and relevance of IT courses to job placement, Results revealed 1 re 30 of graduates were employed within one year of graduation. Many respondents are now software developers &r sYatems analysis. Others ventured into digital freelancing. 2 trend temsjarated by the pandemic. Despite positive employment statistics, respondents noted gaps in project manageren Reis aiploviers rated graduates as technically proficient But neecra inprevednentin communication. The study concludes that algn a wPipetone projects with industry trends would. Additonal data on salary progression are stil being"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "Au ATi aduates of (2018. La Salle Medic BS Nursing Gi nd Heath S Study Carlo V. Manale, De Roel F. Arriol ABBYRACT 1 study was conducted on BS Nursing graduates S sband Health Sciences instikite covering batches r employment deslinations, ion with their undergraduate atluates ate Hote"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "August 2006 A Tracer Study on BS Nursing Graduates of De La Salle Medical and Health Sciences Institute (2018 2022) Angela M. Torres, Carlo V. Manalo, Denise L. Santiago, and Noel P. Arriola ABSTRACT Atrgoer study was conducted on BS Nursing graduates from De La Salle Medical and Health Sciences Institute covering batches 2018 2022. It sought to identify their employment destinations, licensure examination performance, and satisfaction with their undergraduate training. The findings showed that 87% of the aracuates are employed in heatthcare setings locally and abroad ‘The majority cited hospital based work, while a few transitioned into academic or research positions. Graduates noted the strong emphasis on clinical practice as a key strength of the program. However, areas needing improvement include simulation lab access and exposure to community health. The study recommends strengthening career guidance services. The data also show"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "2608 A Tracer Siudy on 88 Nursing Graduates of De La Salle Medical and tute (2978 2022) Denise L. Santiaga, and Noel P Amcia ABSTRACT ef study was conducted on BS Nursing graduates from De La Salle Medica! ar Heaith Sciences Institute covering batches 2018 202: K sought fo identify their emalaymant ations, censufe examination performance, ard sabsfaction with their uadergraduale taining. The findings showed that 87% of the gigouates are employed in healthcare settings locally ari abroad The majonty cited Respital hased work, while a few transitioned inte a7 However, are 208 ond Sapo strengthen Gemtic oF peseatch postions, Graduates noted the vical practice as a key Ste Recding improvement include uve to community he: ale fiat ‘The study recommends servines. The data also show 3cr"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "Ang 40 V. Man Noel Arndt ABSTRACT 1 surly was conducted on 8S N La Sai 2038 3022 i S01 riploved hospita a positions. Graduates not emphasis on as a key cirenyth of th However, areas needing improvement inclu and exposure to commiinity health. The study recomraends"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "ann August 2096 A Tracer Study on BS Nursing Graduates of De Lit Salle Medical 2nd Healin Sciences institute (2018 2022) Angela M. Tones, Caro V Manalo, Denise |. Santiago, and Noel. Andie ABSTRACT Atracer study was conducted on BS Nursing graduates from De Le Salle Medical and Heakh Scences Insutute coven batches 2018 202? it sought lo identfy ther employment destinations hcansure Sawnination pedormanoe, and satisfaction with ther undergraduate training Tie fiacings snowed that 87% of the gracuates are employed in healtcare settings iocally andl abroad The majority cited hosnital- based work, while a few transitioned into academic of reseaich postions, Grarluates rated tne strong emphasis on clinical practice es a kay strength of the progam However, areas needing mproyement inckide simulation tab access and exposure i community Nexith. The study recommends trengthening carest guudance services. The data also show"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "March 1994 Analyzing the Employability of BS Accountancy Graduates from Ateneo de Davao University Reina D. Navarro, Paulo J. Domingo, Hannah R. Galvez, Victor L. Gonzales, and Carla M. Aquino ABSTRACT This research analyzed the employability of BS Accountancy graduates from Ateneo de Davao University within a five year window. The study investigated factors influencing CPA board exam success and initial employment opportunities. Results indicated that graduates with internship experience had a higher probability of Securing audit firm placements. Respondents also identified soft skills, such as communication and adaptability, as essential career assets. The university s strong linkage with local accounting firms played a key role in job absorption. Despite these strengths, some graduates felt unprepared for taxation practices. Recomimendations include curriculum enrichment on digital accounting systems. Limitations of the study include sample size and respondent bias, suggesting further"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "March 199 oo bil Analyzing the Empoyabi de Danae oany Graduates from Reina D. Paulo J. Hota Viet ina Navarro, Pa and Ca aah Galvez, Victor ABSTRACT This mates forsee eycedithe Bene! 20 Unwerdgy Bet year iniversity wit ‘ive-) Window Thee Y imestgntey actors influencing CPA besa exam success and initial ment opportuniti Results in baba Graduates with meee Iship exper nce had an ngher rol sec laceme: identi verumcaton and aday jas Sets. The unit with »Ounting rms paves akeyrae in job pear as \"Reems me inte cant nrchmento dital size a one oy ee"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "Anaiyzing in Reine 2. Ma ne Erm Pattio J Demir nzales S foit ti eiIS Re. Oi and adaniaintity 2 woiversity s stro. fetkage wt a sey Foie in 1b absorpio, ATE Yor tay within a fh S Accountancy had high espondents dso n. Fespite the"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "es Analyzing the Employability of BS ‘Ateneo de Davao University yulo J. Domingo, Hannah R. March 1994 Accountancy Graduates from Galvez, Victor Reina D. Navarro, Pai Gonzales, and Carla M. Aquino ABSTRACT This research analyzed the employability of graduates from ‘Davao Unversity “Fre study investigated factors BS Accountancy within a five year board influencing CPA inities. Results had a higher ts also window. ‘exam success and initial indicated that g} ‘with internship EXDenence probability ‘audit firm placements. ident Bentified soft skills, such as communication ‘and adaptability, essential career assets. ’s strong Wnkage with local ing firms played jd spite these ‘strengths, unprepared for taxation pract menrichment on sot of the study size account ing systems, Crijent bias, suggesting further"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "arch 188 Analyzing the Employability Ateneo de ©: Victor Navarro, Paulo J. Domingo, Hanah R: Galver isonzales, and Catia M. Aquine Reina D. ABSTRACT ability of BS Accountancy sity within a five yeat fed factors mfluencing CPA tard tae tinal employment epportundies. Resul Bi graduates welt p expert! Seeennig audi frm placements. Respondents 4 Jch as commnunicalion and adapiabilt ce The university s sirang linkage W Fayed a Key rie in job absorption Despite Hess Srengins, some graduates felt un This esearch analyzed tes from Ateneo ce jow. The siudly investiga probab idenified sot sk ar ude cumculum ennghment oF aig of the Study include Samole Size sung fuithe"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "April 196 8f BS Mechanical Enginean: University, Chawset 30 2g Alumni of Mania Joshua T Castite, Maureen L Reyes, and Patric V¥ Marquez ASSTRACT The tracey Study expt Engineerng graciiate ceserch gd the career placement of BS Mechanical foi Mapua Unewrsity Class of S56 The foymesit st lary ranged, and lextons abtainsd Ss revenied that 95% of I eee SMA Olio year, musty im conten clio 9 nustnies Bi paduates are nsw working overseas. The study ai fed aise eval 2 impact of Mape ee Et eags EMTCUILM On career propey eee Respondents Sighlghted the useluinese of labaratary in Howes the absence of strana mene The study suggests develogs fh oe tat Ship was noted as a gap Biuinovied intemship prograns to exposure. Further data analysis wa infesvuptedd as the survey"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "eee April Tracer Study of BS Mechanical E; i Unversity, Class of Sag? AU of Mapua 196 Joshua T. Castillo, Maureen L Reyes, and Patrick Vv, Marquez ABSTRACT The tracer stu; lored the career placement of Pines oalemers carn BS Mechanical ymentgrverSity, Class of 2026 Mat ch assessed em, oyment status, salary ray Ie, and pomessional certifications obist Findings revealed that 95% of Bimanais Were employed wathion year, mostly in construction and manufacturing industios Several graduates are Now working ove evaluated the mes Mapua s \"utepmes based curriculum on eat ig IS Z develsiond Mentorship was notes a gap. The study suggeste Dosen? 29 alumneted iternshyrae es 3 93 to nance echoes exposure. Further data analysis woe pled as the survey"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "Apr 7998 acer Study of BS Bi ginger Hass af 220 Humni of Mapa eyes, a1 ick V Marquez ihe tracer study expiored the carey sting graduates research a tof BS Mechanical Class of 2020. The feveaied that 95% of Fesportdents were smployed withir oStly in Construction and manuiacturng induct, Graduates are now workin 448. the study also evaluated the impact of Me based curricisurs or Career preparedness Respondents ighted the usel laboratory mienwve courses sosence of strong mentorship was need as 4 gap ests developing aiuminiied intemshio progearss Heol eapasure. Further data analysis was iileripiid he survey as"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "ei ese eaich assessed employinent rofessional c res} Tracer Study of BS Mechanic, ‘al Engineer April 199 Alumni of Mapua University, Class of 20207 he tracer study explored the Gareet placeme -ngineering gradu i ates from Mapua ertifications obtained nts were e} niversity. nt of BS Mechanical Class of 2020. The workin, one gas: The study also evans impact of Mapiia s \"9 utcomes based curriculumor oF Tater ereParedness. Respondents highlighted the usefulnese GF laboratory intensive cos However fs devgitong Mentorship was sngec> as a gap The study suggests eveloping alumni led internship Programs to nhance technical exposes urther data analysis wa ferrupted survey"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "cee Toate Apri 4999 Tracer Study of al Engi i racer VY OFBS Iara eno eeng Aken Of Mania Joshua T. Castitio, Maureen t Reyes, and Patrick V. Marquez ABSTRACT nt of BS Mechanical graduates from Mapia sony Clase of 2020 the The tracer stu the career ene: Enancerag grouaies fom taps Pees assessed €, statu Certifica! professional"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "February 2019 Career Path Analysis of BSBA Major in Marketing Graduates of University of the East Caloocan Diana C. Perez, Mark L. Cruz, Samuel R Morales, and Kristine ly ABSTRACT This tracer study focused on the career paths of BSBA Marketing ‘Management graduates from the University of the East Caloocan. It determined the extent to which their current jobs are aligned wih their educational background, Results show that 82% of graduates are employed in marketing, sales, or entrepreneurship sectors. Others transitioned into digital marketing or advertising. Graduates credited their success to the university s practical business training. The study emphasized the need for continued industry immersion programs. Some respondents noted the limited access to internship slots during their studies. Recommendations for strengthening alumni tracking systems were proposed but not fully"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "February 2619 Career Path Analys University of the suet R. Morales and Kristine ABSTRACT sudy focused on th ement graduates from the Unt delerfnined the extent to whi educational background. Re ates are employed in Tarketin grad ronip sectors 2 unnersity S Hthe need for nangants roles using their studies sity fon PECL cess to meernship eginening aiurnni Wacking cortiaued in! the buted a Recommendations for sir proposed bul no! fy"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "we. Fe uiaty 204 Career Path Anat, 15 OF BSBA Manor in Mache eroty oP the East C: ting Graruates of fooran Dura Perez, Mark i Crm, Samuel 8 Sorates, anu Ke stine “y ABSTRACT This Wace: stady focused on the career paths of BSA Markeung Sanagenvery gracuates trum te Unweraty a be ae Salcccan |h deteoned the esent to whch Oe coke TDS are SIGNED wid they educated BKYOUAG Resists sivow mat Ao, HO Aduates ore employed a ane Sales su tons Others transmoned inte Gingiai Marke tng I inY Graduates ceated ther saeco to he university s Pate rai STainag ibe study emphasved tre meee OEE iaushy mmerdon programa ‘Seme resect hoted the braved access to mtemsiup shx s during toe stuches Cormendaions to strengineneig alamo ACKING Sysiems were PFOpESEE bul Het tuily"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "February 2019 Career Path Analysis of B: SBA Mayor in Marketing Graduates of loocan University of the East Cal Diana C Perez, Mark L. Cruz, Samuel R P Uy Morales, and Knstine ABSTRACT Ogr the limited access to internship ‘alumni tracking systems were rengthe nin Recommendations for str proposed but not fully"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "friaty 2049 Career Path Analysis of BSBA Major in Marketing Graduates of varsity of the Rast Ca aC Pere, Mark LC: oraz, Samuel R, Mera 86d Kristine by ABSTRACT atu ity focused on the carer ps ins of BSBA Marketing gracusates from the University of the £2: extent to which their currentios are af backgrounc. Resuils show Ihat loved in tnarketing, Sates, or «3 iransitoned info digital masks edited ther success to the university icky need for MmeTsiOn progran s. Same responder i Sia intershis 1 sttengtheni proposed but or averting. Graduat practical business tinued inelisst the lim"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "al September 2014 Tracer Study of BS Architecture Alumni of National A Graduate Tra University (2017 2021) Lorenzo M. Chua, Beatriz G. Fernandez, and Allen T. Go ABSTRACT A graduate tracer study Was conducted among BS Architecture lumni of National Univereia from 2017 to 2004, Th ti loyment ii tat are aks lentity em, Sans, licensure status, and skil appleabtis Ena revealed that 76% of Passed the Architect respondents have ‘censure Examination. des fi t pi offi Re mack ie fits OC government planning Sheet NU’ design oe mer a nts praised 'dy proposes inte rating s green architecture in Ad tional interviy are schedu| to ee Realaetetas a ea CE he iit wa ng."
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "__ September 20 chitecture Alumai of Nationa! Study of BSA University (2017 2021) Lorenzo M Chua, B: ABSTRACT nducied among BS Acchitecti th 201? 19 2021, The goa was 70 identify emipioyn appicabiy. Findings passed the Architectur qe firms or government planning ofhices design slidios and thess méntorsn: Suns Were raised regarding limited sustainably tocused courses. The study proposes integrating green architectu? mogules in the, 1 Adicitional ite cpaouiad ko OL ts f HIGEN Vahedare i ‘Sotiware Gurng"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "Sepiember 2044 tudy of BS Architecture Atm of Na! sivbrsity (2047 2005) and Allen 7. Go yaa, Beatz G. Remand Lorenzo MON ABSTRACT tracer study was canduciad among BS Architect anal University trom 2077 1 202). The gaat was ferns, censure Status, a: ad shiis 7% ol respondents have for Wary work rt Respondents prawsesi rograms, Howeve! natlity tocused chitechire hed ‘led to mover i) jes in the, cumneyton jeonal intervi he apt asnese he Ton fie navrative was cub dus ont ancate pial Gata 1 Soleate inte"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "September 2014 tional Lorenz 2, ant Alle: ABSTRACT ng ii imnited eae ses imegraling 5 ifes a the, curr aye"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "Mi Uhua, ABSTRACT ‘arralive was cut dh"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "tracerstudy",
        "ocr_text": "a November 19 ms TSP OFR SASEE Mamematcs Students of R Ocampo, Enka Ls Paolo M. Salazar, and ABSTRACT matics raduation of BSE pitathe Students trom the Unmengy cuicomes rear it analyzed their e, loyment rai Pursutt of graduate studies ults, nd deep roles of working in curculum Graduates cited the tid mony pursued aang\" ‘and rewarding Ne UP acader Careers. J UP. MIC Envir it th The findings yonment as both chalie even OOY. The study cone ‘posure to classrcom lopment iniiaives wang woes Mat continuous pega OT the enhance teacher reach the tun GIscussion of implications wesnesS: though"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "tracerstudy",
        "ocr_text": "November 1997 -d ti ident: Pos recat OOF EISEN Rg StHgens oF Nathan R. Ocampo, Erika L. Jimenez, Paolo M. Salazar, and Jessica C. Tan ABSTRACT The tracer study assessed post graduation outcomes of BSEd Mathematics students from the University of the Philippines Diliman. It analyzed their employment rate, job satisfaction, and pursuit of graduate studies Results indicate that most are now teaching in secondary schools or working in curriculum development roles. A minority pursued data analytics careers Graduates cited the UP academic environment as both challenging and rewarding The findings suggest that mathematical modeling and statistics courses are highly beneficial in non teaching professions. However, a gap remains in exposure to classroom technology. The study concludes that continuous professional development initiatives would enhance teacher readiness, though the full discussion of implications was"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "tracerstudy",
        "ocr_text": "Post. Gradu; “Ue oor AS Ed pp! November 1997 Nettie matcs Students of"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "tracerstudy",
        "ocr_text": "November 1997 Post Gradualjpn. Outcomes ot Sep Matha Students of Nathan R. Ocampo, Enka L Jimenez, Paolo M. Salazar, and Jessica C. Tan ABSTRACT"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "tracerstudy",
        "ocr_text": "November 1997 Post. ‘ost. Gradualipp Outcomes of AGES ‘Mathematics Students of Nathan R. Ocampo, Erika L. Jimenez, Paolo M. Salazar, and Jessica C. Tan ABSTRACT The tracer study assessed post graduation outcomes of BSEd Mathematics students from the University of the Philippines Dilan 1 analyzed ther employment rate, job satisfaction, and pursuit of graduate studies. Results indicate that most are now teaching in secondary schools or working in curriculum, development roles. A minority pursued data analytics careers. Graduates cited the UP academic environment as both challenging and rewarding. The findings suggest that mathematical modeling and statistics courses are highly beneficial in non teaching professions. However, a gap remains in exposure to classroom technology. The study concludes that continuous professional development initiatives would enhance teacher readiness, though the full discussion of implications was"
    }
]