[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "travelorder",
        "ocr_text": "Rapuistic of thy NT OF ED CATION “es Jannahbury VISION OMfodgesbera DEP 2009 11 04 TRAVEL ORDER Grade 14] Teachers for Destination: Lanehaven oe 4O73 O2E 9911 42 Means of Transportation: Public Travel is on: Sourae of Funcs: APPR BegeBranct hfurt, IL “8888 wi) i Or james Bel i Solicitor"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "travelorder",
        "ocr_text": "Eze Republic of the Philippines WE g DEPARTMENT OF EDUCATION Be “Slaow aac, Hannahbury 2009 11 04 TRAVEL ORDER Grade 1 Teachers for Discrete Mathematics (Please see attached list) Purpose: To attend a consultative meeting with CHED regional officials _ regarding the implementation of new academic policies. The meeting will clarify compliance requirements for ongoing programs. Destination: Lanehaven we 1973 02 21991 11 12 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds APPROVED: RE voi mn Midtend Dr. James Bell Date| 997 04 02 Solicitor Time: _9 41 AM T By:"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "travelorder",
        "ocr_text": "fe voATION. annahbury or igtow ofeagesberd Repub ac of She 2009 11 04 TRAVEL ORDER Discrete Mathematics attached Hat} aches grade 1478 yease Ste eneD regis onal, officials _ policies ring programs. to attend a consultative meeting eins niation of new aca fe Purpose regarding mp wit Per anice aan Lanehaven Lee 4973 02 81991 1112 te Means of Transportation: Py Travel is on Local Funds source of Pands: fH eA acd Dr, James Bell Solicitor"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "travelorder",
        "ocr_text": "Republic of thy Philippines WZ DEPARTMENT OF EDUCATION Region DIVISION aR gesber Hannahbury 2009 11 04 TRAVEL ORDER Grade 1 Teachers for Discrete Mathematics (Please see attached list) Purpose: To attend a Consultative meeting with CHED regional Officials regarding the implementation of new academic policies. The Meeting will clarify compliance requirements for Ongoing programs, ination: Lanehaven Date: 1973 0245 1991 11 12 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds APPROVED: DepEBranchfurt aware y: [sass ED FS! Pate] 997 04 02 Time: _9 41 AM By: Dr. James Bell Solicitor"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Phitippines DEPARTMENT OF ED CATION ARIMeNT oF edu“ Hannahbury Regicn 9 DIVISION Q odgesberg 2009 11 04 TRAVEL ORDER Grade 11 Teachers for Discrete Mathematics {Please see attached list} Purpose: To attend a consultative meeting with CHED regional officials regarding the implementation of new academic poticies. The meeting will clarify compliance requirements for ongoing programs. Destination: Lanehaven Cee 41973 02 21091 11 12 Means of Transportation: Public Vehicle Officiai Business Travel is on: Source of Funds: Local Funds area ~, APPROVED: SepEBranchfurt, | RE‘. 2D ‘att ix } Dr. James Bell datef 997 04 02 me c a “94 AM. _ Solicitor Ly by: _f_"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines MZ DEPARTMENT OF EDUCATION ‘egion wiser eran Barbertown 1982 12 05 TRAVEL ORDER Grade 6 Teachers for Artificial Intelligence (Please see attached list) 0 To Participate in a training worksho, on adminis Purpose: improvement for a i 7 cademic units. trative Process streamline internal he output will be used to documentation and workflow systems. South Mike 1979 041 1992 04 27 Means of Transportation: Public Vehicle Destination: Date: Travel is on: Official Business Source of Funds: Local Funds “Ey APPROVED: Ye PEDbanisburgh RE Sa. FD ky, I riper 01 05 Brendan Martin Time _ 4 44 PM harmacist, hospital By:"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "travelorder",
        "ocr_text": "sanubie of the Philiopines 3 Repubiie of tre Phifiopine’ prow 2 DEPARTMENT OF EDUCATION Barbertown Region DIVISION @Ranborough 4982 12 05 TRAVEL ORDER Grade Teachers for Artificial intelligence {Please see attached list) To participate ina trainieg workshop, on administrative process Purpose: improvement for academic units ne output will be used to streamiine internal documentation and workflow systems. Destination: South Mike Date: 4979 044\" 1992 04 27 Means ot Transportation: Public Vehicle Travel is on: Official Business Local Funds Source of Funds: APPROVED FapEdpendiSdush | pee gre Ure TESS 7 H H ptr, f SALE aa Brendan Martin Joel 988 04- Pharmacist, hospital"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "travelorder",
        "ocr_text": "ON Republic of the Philippines Pez Le DEPARTMENT OF EDUCATION Rs Region Ss, KZ DNISION CFanoogn Barbertown 1982 12 05 TRAVEL ORDER Grade 6 Teachers for Artificial Intelligence (Please see attached list) Purpose: To participate in a seme, orkshop on administrative process improvement for academic units. The output will be used to streamline internal documentation and workflow systems. South Mike 1979 042 1992 04 27 Means of Transportation: Public Vehicle Destination: Date: Travel is on: Official Business Source of Funds: Local Funds APPROVED: DepEDbaniafurgh arin y: i RE sae. ED I date 988 01 05 Time: _4 11 PM By: Brendan Martin Pharmacist, hospital"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "travelorder",
        "ocr_text": "ANS fos Phun Ca i) Se; Republic of the Philippines Tid E 3 aplide dros OF EDUCATION By Seox emma Barbertown 1982 12 05 TRAVEL ORDER Grade Teachers for Artificial Intelligence {Please see attached list) To participate in a training workshop on administrative process improvement for academic units. The output will be used to streamline internal documentation and workflow systems. Destination: South Mike Date: 1979 04\" 1992 04 27 Purpose: Means of Transportation: Public Vehicie Travel is on: Official Business Source of Funds: Local Funds ett APPROVED: DepE Danii Bbugh HUMVCSEY a f, JET REews., ED) Brendan Martin *1988 01- 05 Pharmacist, hospital"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "travelorder",
        "ocr_text": "the Keates VEE INT OF EDUCATION D miso\" gona Barbertown DEPARTM Re. 1982 12 05 TRAVEL ORDER Grade Teachars for Artificial intelligence iPlease see attached ety Purpose: To participate in a training workshop on administrative process me improvement for academic u is. The output wil be used is streamline interng| decumentati aU0N and workflow Systems. South Mike 1979 041 1909 04 07 Oestination: Date: Means of Transportation: 5 Travel is an ficial Susine $3 Source of Funde- Local Funds i Rice Fier re lees eT we ale i Brendan Martin i i i i Pharmacist. hospital j"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "travelorder",
        "ocr_text": "EDUCATION outh “DIVISION OF ryigview nristy 1974 09 16 TRAVEL ORDER Grade 4 Teachers for Linear Algebra {Please see attached ler} Purpose: To attend the CHED sponsored orientation on the new general education curriculum. The ofentation will help faculty align instructional content with updated competency standards North Judithfurt Date: 1979 025\" 1998 08 29 Destination: Means of Transportation: Public Travel is on: ONicial Business Source of Funds: Lozal Funds Lora! OMentoyaborough i Biases ee re ae, i ROR TS grist nes Rises SD on Can GBs Greek, o Joseph r I os7014 05 23 Daten atte Patent attorney"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "travelorder",
        "ocr_text": "Ly south Chiisty 1974 09 16 L ORDER Grade 4 Teachers for Purpase To attend the CHED sponsored orientation on the n “_— education Uriculun orentation y instruc content updated com North Judithfurt 1979 024 1968 03 20 Means of Transportation: ral Date: Source of Fy WEB: Local Fy Joseph Castra Patent attomey"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "travelorder",
        "ocr_text": "Republic of t he Philippines MZ DEPARTMENT OF EDUCATION out! DIVISION op, Ericview y 1974 09 16 TRAVEL ORDER Grade 1 Teachers for Linear Algebra (Please see attached list) Purpose: To attend the CHED sponsoreg Orientation on the new general €ducation Curriculum. The Orientation will help faculty align instructional content with Updat ‘ed competency sta North Judithfurt 1979 021 1998 08 29 Means of Transportation: Public Vehicle Indards. Destination: Date: Travel is on: Official Business Source of Funds: Local Funds DMentoyaboro aru r RE a3. ED d 222014 05 23 Time: _11 31 PM By: APPROVED: gh Joseph Castro Patent attorney"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "travelorder",
        "ocr_text": "“get VISION OF Erigviaw 1974 09 16 TRAVEL ORDER 2 Teachers for near Algebra new general ity align andards. North Judithfurt Dates 1979 022\" 1998 08 29 Means of Trans: Travel is on: Saure Joseph Castre Patent atlomey"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines fuer DEPARTMENT OF EDUCATION South Region 1 DIVISION OF Ericview bris y 1974 09 16 TRAVEL ORDER Grade 4 Teachers for Linear Algebra (Please see attached list) Purpose: To attend the CHED sponsored orientation on the new general education curriculum. The orientation will help faculty align instructional content with updated competency standards. North Judithfurt Date: 1979 02 1998 08 29 Destination: Means of Transportation: Public Vehicle Travet is on: Official Business Source of Funds: Local Funds (_ dMMettoyaborough wee RE sa. ED rteband 11 o904 405 23 Joseph Casiro ic “131M Patent attorney"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "travelorder",
        "ocr_text": "Blakefort 201 7 08 19 TRAVEL ORDER Grade 4 Teachers for Mobile Application Development fPiease ane Stacked fist Purpose: To conduct iNStitutional visit to MOde! Universiny for enchmarl rogram outcomes assessment, The gathered ing: Ullized in revising as: Ssessment tools. Cestination: Port Mark 1979 07 C1978. Means af Transpertation 14 28 2 Putlic Vehicle Travel is on: Official Business 1268 Source of Funds: Local Funds Arab, J Sara Silva Textile designer"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines DEPARTMENT OF EDUCATION We ee ow exusceer Blakefort 2 2017 08 19 TRAVEL ORDER Grade Teachersfor Mobile Application Development (Please see attached list) Purpose: To conduct an institutional visit to a model university for benchmarking on program outcomes assessment. The gathered insights will be utilized in revising assessment tools. ee. Port Mark Lo 1979 07 C1978 11 28 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds hate i. APPROVED: Aw wer gna 4 RE sea w ID Sara Silva JL dete1983 04 18 C Time: _5 56 PM T By: Textile designer"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "travelorder",
        "ocr_text": "DEPA UCATION oe Blakefort DIVISION B niliachester 2017 08 19 TRAVEL ORDER Grade 4 Tes we for Mabie Application t Development Please see atta st) To conduct an institutional visit to a model univers sity for benchmarking on program ouicomes ass essm The gathered Inst nts will be ‘utiized in revising sesesmenl it foals. Port Mark oe 4979 07 (1978 14 28 PPRO We BOAO. LE Sara Silva 4 i Sara Silva it 4983 04 18 Textile designer"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Siz DEPARTMENT OF EDUCATION A “DIVISION p§ @Bnilachester B a kefo rt 2017 08 19 TRAVEL ORDER Grade Teachers for Mobile Application Development (Please see attached list) Purpose: To conduct an institutional visit to a model university for benchmarking on program outcomes assessment. The gathered insights will be utilized in revising assessment tools. Destination: Port Mark Date: 1979 07 C1978 11 28 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds Sep: hate APPROVED awe ) akan, RE Sa w ID Sara Silva Je ml 963 04- 18 Textile designer"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "travelorder",
        "ocr_text": "SEs Republic of the Philippines WZ 3 Bar DEPARTMENT OF EDUCATION i Le iy Region a A DIVISION BBriachester B a kefo rt 2017 08 19 TRAVEL ORDER Grade 4 Teachers for Mobile Applicat ion Development (Please see attached list) a To conduct an institutional visit to a Model university for Purpose: benchmarking on pr. I Hy ogtam outcomes assessment. he gathered insights will be utilized in revising assessment tools. ination: Destination Port Mark Date: 1979 07 C 1978 11 28 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds oe APPROVED: a DepED hake RE Sao. ED I Date] 983 04 18 Time: _ 5 56 PM By: Sara Silva Textile designer"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "travelorder",
        "ocr_text": "Po, Republic of the Philippines ez % DEPARTMENT OF EDUCATION 3 Bw jy Region 9 Tonyh ave n tee DIVISION OF cast katie 2023 08 23 TRAVEL ORDER Grade Teachers for Numerical Methods (Please see attached list) To participate in a conference on innovation and Los technology in education. The event will highlight new approaches to teaching using Al and digital platforms. Destination: Allenshire Grice 2013 05121977 04 11 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds APPROVED: DepGonzalezton RE za. LD Gicione Ld Dustin Rios J dat2006 06 06 Comptroller C Time: _1 47 PM T gy:"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "travelorder",
        "ocr_text": "\"’ Tonyhaven 2023 08 23 TRAVEL ORDER ore 4 Teac for Grade 1 Teachers Numer ase gee atiached To participate in a conference on innovation and technology in education. The event will highlight new approaches is teaching using Al and digital platiorms. Ajlenshire Date: 201 8 O5521977 04 14 Purpose: Means of Transportation: Public Source of Fu mB \"hy feo 8292 w ale 006 06 06 A? PM CT Hore Dustin Ries Comotroller"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "travelorder",
        "ocr_text": "NT OF EDUCATIO ON PFO on ox OF ae Kate Ton y h a ven 2023 08 23 TRAVEL ORDER Grade 4 Teachers for Numericai Methods [Please see attached list) Purpose: io eon innovation and event will hig alight new sing Al and digi ital platforms, f education, The approsees! 10 teaching y Allenshire 2013 050 67704044 Destination: Date: Means of Transportation: Public Vehicle Travel is on: Source of Funds: APPROY, ePGonzalezton eae ip i ee PLS 4] ce 2006 06 06 Dustin Rios Comptrotler"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "travelorder",
        "ocr_text": "ie 2 Tonynaven 2023 08 25 TRAVEL OR PER 4 Teachers for Numerical Methods (Please See atiached list} Grade innovation and Agni new faitorms. To participate ina conference on innove ~. The event will hight technology 1 education. 1 t ing AV and digital Purpose: approaches to teaching Us! Means of Transportation: Pubie Vehicle Jravel 15 of: Official Business Local Funds Source OF funds: APPR Dustin Ries Comptrotier"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "travelorder",
        "ocr_text": "and Republic of the Philippines Wak 4 DEPARTMENT OF EDUCATION eA Fy Region 9 DIVISION oF, wan bonyhaven 2023 08 23 TRAVEL ORDER Grade Teachers for Numerical Methods (Please see attached list} Purpose: To participate in a Conference on innovation and technology in education. The event will highlight new &pproaches to teaching using Al and digital platforms. Destination: Allenshire 2013 054 1977 06 11 Means of Transportation: Public Vehicle Bate: Travel is on: Official Business Source of Funds: Local Funds Rrosiaataiecas pa APPROVED: f Pep Bonzalezton RWG i , titer, RES s iD Dustin Rios ic Comptroller"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines PE semana OF An d rewb U rg h DIVISION OF cos 1973 07 28 TRAVEL ORDER Grade {4 Teachers for Environmental Science (Please see attached list} To attend a workshop on accreditation document preparation Purpose: and compliance verification. The output will directly support the institution s upcoming program evaluation. —— South Natalie Date: 4998 07 4C 1984 06 19 Means of Transportation: Pubiic Vehicle Travel is on: Officia! Business Source of Funds: Locai Funds Searetel APPROVED: ~BepMadisonview hes TED stead Tb Sabrina Peterson rom aa Exercise physiologist UF on. wis tai"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines PN Fee, i. DEPARTMENT OF EDUC. ab Region DIVISION OF .52 ine Ak ATO ndrewburgh ern TRAVEL ORDER Grade 11 Teachers for Environmental Science (Please see attached list) To attend a workshop on accreditation document pre aration Purpose: and compliance Venfication. The output will directly Support the institution s upcoming program evaluation. es South Natalie ete 4998 07 *C 1984 06 19 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds Po APPROVED: SepMadisonview Rita. LD J. dete 987 08 30 12 43 PM Sabrina Peterson Exercise physiologist"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Phil; Pd DEPARTMENT OF ED ANON uo Seton oF ndrewburgh 1973 07 28 TRAVEL ORDER Grade {7 Teachers for Environmental Science {Please see attached fist} Purpose: Yo altend a workshop on accreditation document preparation and compllance verification. The output will directly support the in on s upcoming program evaluation. Destination: South Natalie Bate: 1998 07 4 1984 06 19 Means of Transporiatien: Public Vehicle Travel is on: Source of Funds: Local Funds pret onncosis APPROVED: Beplfadisonview is sears rage a aa B0ewe ED an ono ne i Sabrina Peterson i Exercise ohysiclogist"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "travelorder",
        "ocr_text": "HIVISION OF 1973 07 28 Gracie 1] Teachers for mental Science {Please see atta t} ment preparation directly support uation. workshop on accreditation do verification. The outpul ion s upcoming program Purgese To atiend a oe and comphanc the institut South Natalie Date: 4998 07 +C 1984 06 19 Travel is on set Pr aA Rate Sabrina Peterson Exercise physiologist"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines DEPARTMENT OF EDUCATIO a “Gsiaonoe'. ANdrewburgh ‘ast Geoigovite 1973 07 28 TRAVEL ORDER Grade {| Teachers for Environmentai Science {Please see attached fist} Purpose To atiend a workshop on accreditation document Bee paraton and compliance verification. The output wili directly support the institution s upcoming program evaluation. Destination: South Natalie Date: 1998 07 4C1984 06 19 Means of Transportation: Public Vehicie Travel is on: Official Business Source of Funds: Local Funds ee ~~ APPROVED BepMMadisonview PUMCTB YF j grinds f ; 7 RU veare =D Sabrina Peterson Sete] 987 08 30 Exercise physiologist Time: 1243 PM"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "travelorder",
        "ocr_text": "ie F got NO fog, Republic of the Philippines a DEPARTMENT OF EDUCATION est - Region \"“ stad DIVISION @ownborougn hase TRAVEL ORDER Grade 12 Teachers for Systems Analysis and Design (Please see attached list) t seminar for academic then management and To take part ina leadership developmen’ administrators. Purpose: coordinators. The training aims to streng supervisory skills among middle leve! Lake Latashachester Destination: 4981 -10422016 06 12 Date: Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds oe inehic APPROVED DepMartinshire Awe y + i s [sos al Jasmine Walker >= 2000- AM. Clinical psychologist"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines DEPARTMENT OF EDUCATION Ni Region 1 dy est DIVISION BBwnborough hase 2006 10 21 TRAVEL ORDER Grade {Teachers for Systems Analysis and Design (Please see attached list) To take part in a leadership development seminar for academic pumpose: coordinators. The training aims to strengthen management and supervisory skills among middle level administrators. ae Lake Latashachester pete: 1981 10 22016 06 12 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds APPROVED: DepEMartinshiré AWE Roan. LD JL d2t2000 04 20 (Time: _6 55 AM T iy ae Jasmine Walker Clinical psychologist"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Wz DEPARTMENT OF EDUCATION pagan West DIVISION @Bwnborough Chase 2006 10 21 TRAVEL ORDER Grade {Teachers for Systems Analysis and Design (Please see attached list) Purpose: To take part in a leadership development seminar for academic coordinators. The training aims to strengthen management and supervisory skills among middle level administrators. Lake Latashachester wie 198 1 10422016 06 12 Destination: Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds APPROVED: DepEMartinshiré REG ED se SRE w Jasmine Walker I eo 028 Clinical psychologist"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines IZ DEPARTMENT EDUCATION Region est DIVISION @%Bwnborough hase 2006 10 21 TRAVEL ORDER Grade 2Teachers for Systems Analysis and Design (Please see attached list) Purpose: To take part in a leadership development seminar for academic coordinators. The training aims to strengthen management and supervisory skills among middle level administrators. Lake Latashachester Date: 1981 -10422016 06 12 Destination: Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds APPROVED: jrakrrd, Jasmine Walker Clinical psychologist DepEMartinshiré ANW WE T' RE a8. ED JL 22t2000 04 20 C Time: _6 55 AM T By:"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "travelorder",
        "ocr_text": "Nn ONG . a %G, Republic of the Philippines Tat se 3 me DEPARTMENT OF EDUCATION <4 LI py, Region 1 West DIVISION B Swnborough Chase 2006 10 21 TRAVEL ORDER Grade 1 2Teachers for Systems Analysis and Design (Please see attached list) To take part in a leadership development seminar for academic Purpose: coordinators. The training aims to strengthen management and supervisory skills among middle level administrators. Destination: Lake Latashachester Date: 1981 -10422016 06 12 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds APPROVED: oem DepMartinshire ANE Y ) RE “ose. ED asin Wolke IL Det2000 04 20 ini |é Time 6 85 AM Clinical psychologist LT By: fe }"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines WidZ DEPARTMENT OF EDUCATION __ Port. *SIVISION OFanaville Kimberlyside 2010 12 23 TRAVEL ORDER Grade {(Q Teachers for Web Development (Please see attached list) To serve as an institutional representative in the academic POE consortium planning meeting. The goal is to finalize agreements on student exchange and faculty sharing initiatives. Destination: Hannahport BALE 1978 07 1993 10 27 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds cong? APPROVED: DepEIChenstad\\ REZaz. ED lL 2ete1 977 07 06 (CC Time: _5 18 PM T ay: Jessica Chavez Pilot, airline"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines SWZ DEPARTMENT OF EDUCATION Rocke an Olt “DIVISION OFbanavilie Kimberhyside 2010 12 23 TRAVEL ORDER Grade {QTeachers for Web Development {Please see attached list} To serve 2s an institutional representative in the academic Purpose: consoriium planning meeting. The goal is io finalize agreements on student exchange and faculty sharing initiatives. Destination: Hannahport Date: 1978 07*< 1993 10 27 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds ~~, APPROVED DepEihenstad\\ i RW i i iad STA Rng. Ree ED) seaga Che Cc Time: _ 5 18PM Pilot, airline T ~~)"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "travelorder",
        "ocr_text": "DEPARTMENT OF EDUCATION Danaville wine site ISION of. 2010 12 23 ORDER Grade 1O7Te: Web Development attache aS ani institutional representative in Planning meeting. The goal is to fina’ student ey Xchange and facuity sharing hannahport Date: 197 B- O7 1993 10 27 MM, acadernic agreements atives ans of Transpo oY Source of Funds: ities a abs Jessica Chavez Pilot, airline"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "travelorder",
        "ocr_text": "fe Part Kimberlyside Republic of tr UCATION DIVISION Ofpanavilte 2010 12 23 TRAVEL ORDER Grade {Ovaachers for Web Development iPinase see aittac hed fiat} Purpose: To serve a8 an institutional tepres ative in the academic consortium planning meeting The ments on student exchange and fact ty sharing Weave, Bastination: Ha nna port Date 4O7B O7 S1995 10 27 Means of Trangportation: Fa Travel is on: Local Funds Source of Funds: Jessica Chavez Pilot, airline 192 gr? s108"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines WAZ DEPARTMENT OF EDUCATION Port “DIVISION Of} anoying Kimberlyside 2010 12 23 TRAVEL ORDER Grade 1 QTeachers for Web Development (Please see attached list) Purpose: To serve as an institutional representative in the academic coos consortium Planning Meeting. The goal is to finalize agreements on student exchange and faculty sharing initiatives. Destination: Hannahport Date: 1978 07%€ 1993 10 27 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds se APPROVED: DepEIChenstad\\ atmirg y 7 REZaz E I Date 977 07 06 Time: _5 18 PM By: Jessica Chavez Pilot, airline"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines WAZ DEPARTMENT OF EDUCATION N Ww Region 10 DIVISION OF ake, N athe n 1995 11 25 TRAVEL ORDER Grade 8 Teachers for Data Analytics (Please see attached list) Purpose: To attend a national training program on research ethics and _ __data management. This will enhance compliance with institutional review standards and research integrity protocols. Nicholasfurt Date: 2018 1 11 11979 12 31 Means of Transportation: Public Vehicle Destination: Travel is on: Official Business Source of Funds: Local Funds — APPROVED: DepRonaldsida RE Sas. ED Aigtionnd bd Jesse Hines dete} 985 09 24 Teacher, secondary school Time: _5 18 PM y By:"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "travelorder",
        "ocr_text": "Kos NG fe, Republic of the Philippines Wz S wa DEPARTMENT oe eestor WwW *SIVISION OF” ale, Nathan 1995 11 25 TRAVEL ORDER Grade 8 Teachers for Data Analytics (Please see attached list) Purpose: To attend a national training program on research ethics and data management. This will enhance compliance with institutional review standards and research integrity protocols. Nicholasfurt Destination: Date: 2018 11 11979 12 31 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds APPROVED: (— DepERonaldsid& S258 w Jesse Hines Date] 985 09 24 Teacher, secondary school Time: _5 18 PM T ay: eames"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "travelorder",
        "ocr_text": "ian Republic of the F PABes DEPARTS MENT oe EDUCA TON “OTISIO a8 OF dan 1995 11 25 TRAVEL ORDER Grade Teachers for Data Analytics {Please See attached Vist} am on research ethics and nce compliance with To attend a national training Pi ot Cleat dala management. This wilt institutional review standards and research integrity pratecats. Gestination: 2 i cine Nicholasfurt Dae 2018 111 1979 12 31 Means of Transportation: f cial Business Travel Source of Funds: Local Funds APP “Dep onal idside BULEDE TES f | BESes. ED (pba oaiet 85 09 21 Jesse Hines Teacher, secondary school"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "travelorder",
        "ocr_text": "-- Se nisi W fie the OF EDUCAT! iON Re 40 Lak SIVISION OF dy 4995 11 25 TRAVEL ORDER Data Analy jiics Grade Teachers fer attached (Please See gram on research ethics and Purnese: To attend national training pre data managemen This wi ace comple: with institutional review giandards and esearch integnty rot fOCaS. Destination: es! af _— Nicholasfurt oo BOAR TAM Tes) Means of Transee eriation: Vehicle Travel ie or: Source of Funds: oS APPROVED: jf (ren Tv eneee? tf Jl h Meta’ Jesse Mines yp gchoo! 1996 0924 Teacher, sec sondary"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "travelorder",
        "ocr_text": "ot. Republic of the Philippines Pez 5 DEPARTMENT OF EDUCATION ic ion N WwW B *OIVISION OF datsn Nath an 1995 11 25 TRAVEL ORDER Grade 8 Teachers for Data Analytics (Please see attached list) To attend a national training program on research ethics and ment. This will enhance compliance wit Purpose: data manage! institutional review standards and research integrity protocols. Destination: Nicholasfurt Date: 2018 11411979 12 31 Means of Transportation: Public Vehicle Official Business Travel is on: Source of Funds: Local Funds acannon APPROVED i Fors (~ Dep Ronaldside ‘phan Jesse Hines vate] 985 09 24 Teacher, secondary school C. Time: 5 18PM RESae; 2D |"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "travelorder",
        "ocr_text": "Republic of DEPARTMEN 8 DIVISION Woniteroury L i a da la ny d 1981 07 03 TRAVEL ORDER Grade 9 Teachers for Research Methods in IT iPlease seq attached list Purpose: To participate in a Short cour: Sé On instructional design and online Pedagogy, The lee S wit be applied in developing blende learning courses for next Sémesier. Jasonborough 2014 07 12915 1297 Means of Trangportation: Publis Vehicle Destination: Date: Travel is on: Official Businags Source of Fung: i Funds APPROVED Carolyn Rodriguez Visual merchandiser"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Pee 2 Sat. 5 4) DEPARTMENT OF EDUCATION Lindaland 3 2 Region 8 DIVISION QJénniferbury 1981 07 03 TRAVEL ORDER Grade Q Teachers for Research Methods in IT (Please see attached list) tional design and Purpose: To participate in a short course on instruc online pedagogy. The learnings will be applied in developing blend learning courses for next semester. ee 2014 07 '12015 12 07 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds DepED Sout r% APPROVED: C653 w JL dete1976 04 19 Time: _12 41 PM T By: Carolyn Rodriguez Visual merchandiser"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "travelorder",
        "ocr_text": "EDUCATION isa, LIndaland 1981 07 03 TRAVEL ORDER Grade Q Teachers for Research Methods in IT hed st) To participate in a short course on instructional design and Purpose: ras a vanes nt online pedagogy. The learnings will be applied in developing blended learning courses for next sem PEE: 2014 07 \"2015 12 07 Maans of Tranaporiation: Public Travel is on: Official Business Source of Funds: Lac Pen w ep i ee ttre, shane Carolyn Rodriquez ae a i Visual merchanciser"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philip: Pee DEPARTMENT OF EDUCATION - Lind land 8 DIVISION Ofnniter 1981 07 03 TRAVEL ORDER Grade Q Teachers for Research Methods in iT {Please see attached Hat} Jo participate in a short course on instructional design and oniine pedagagy, The leamings will be applied In developing blended learning courses for next semesier. Jasonborough 2014 07 12015 1207 Destination: De Means of Transportation: Public Yravel is on: On CUSINeSs Source of Funds: Local Funds APPRO! y ee ae 4 Carolyn Rodriquez Visual merchandiser"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "travelorder",
        "ocr_text": "epublic of i Republic of the Philippines Fetk DEPARTMENT OF EDUCATION A Lindaland Region a DIVISION ORanifersury 1981 07 03 TRAVEL ORDER Grade Q Teachers for Research Methods in (T [Plaase see attached {ist} To participate in a short course on instructional design and Lal aa online pedag ogy The learnings will be appi fied developing blended learning courses for next semester. Destination: Jasonborough ner 2014 07 '\"12015 12 07 Means of Transportation: Public Vehicle Travel is on: Official Business Source of Funds: Local Funds APPROVED “Bepeo - Soup sere alee, STi 7a RU ess a) Carolyn Rodriguez nate] 976 04 19 Visual merchandiser me: 12 41PM. LF T f£ —) A MOAR AAAS é"
    }
]