[
    {
        "image": "tor_synth_10_aug1.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province ORarandia Leeton OFFICE GF THE‘ ae TRAVEL ORDER No: 2007 Date: 2042 05 08 POSITION SALARY /Month Christine Campbell Technical sales engineer Kimberly Brown Surveyor, quantity Official Station Al South lexa sf Port Samantha Meaas of Transportation Date of Depar 1984 05 20 Date of Retum 4 974 1 O 4 5 esent the rship mee Purpose of Travel 8s potent A projects. Appropriation to which travel s Joe Barry Psychiatrist"
    },
    {
        "image": "tor_synth_10_aug2.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province Obarazvilla Leeton OFFICE OF THE “h2tered management No: 2007 Date: 2012 05 08 NAME s POSITION SALARY Month Christine Campbell Technical sales engineer Kimberly Brown surveyor, quantity Official Station Alseatiler Destination s Port Samantha Means of Transportation Des of Departse 1984 05 20 Date of Retm 1974 10 15 Purpose of Travel To represent the institution in the academic partnership meeting with neighboring state universities. The meeting will discuss potential collaborations on extension and research projects. Appropriation to which travel should be charged: PERSONAL Joe Barry Psychiatrist Copy Furmished: HRMO"
    },
    {
        "image": "tor_synth_10_aug3.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province Obarazviilla Leeton OFFICE OF THE “battered management TRAVEL ORDER No: 2007 Date: 2012 05 08 NAME s POSITION SALARY Month Christine Campbell Technical sales Ki engineer imberly Brown Surveyor, quantity Official Station Aloe er Destination s Port Samantha Means of Transportation Date of Departure 4 984 05 20 Date of Retum 1 974 1 0 1 5 Purpose of Travel To represent the institution in the academic partnership meeting with neighboring state universities. The meeting will discuss potential collaborations on extension and research projects. Appropriation to which travel should be charged: PERSONAL Joe Barry Psychiatrist Copy Fumished: HRMO"
    },
    {
        "image": "tor_synth_10_aug4.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province Oarandiia Leeton Chartered management No: 2007 Bate: 2012 05 08 NAME s POSTION SALARY Month Christine Campbell Technical sales engineer Kimberly Brown Surveyor, quantity ficial Station Sou Official Station. Alcscat ith or Destinations Port Samantha Means of Transportation me \"1984 05 20 Date of Return 1974 10 15 Purpose of Travel Daie of Dep: sities. The mee’ igh 8S gia rations on extension wn research projects Appropriation Joe Barry Psychiatist"
    },
    {
        "image": "tor_synth_10_aug5.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province Obaravvilla Leeton OFFICE OF THE “2 eted management TRAVEL ORDER No: 2007 Date: 2012 05 08 NAME s POSITION SALARY Month Christine Campbell Technical sales engineer Kimberly Brown Surveyor, quantity Official Station Alseatiler Destination s Port Samantha Means of Transportation Date of Departure 984 05 20 Date of Retr 1974 10 15 Purpose of Travel partnership tne ston cighboring stats universities. The meeting will discuss potential collaborations on extension and research projects. Appropriation to which travel should be charged: PERSONAL Joe Barry Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_1_aug1.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province GRahanctad Grantiand OFFICE OF THE Solicitor, Scotland TRAVEL ORDER No: 4996 Date: 2025 09 11 NAME s POSITION SALARY Month Justin Mclaughlin Landscape architect Amanda Edwards Careers adviser Destinations East Caitlin Means of Transportation Date of Departure 2019 05 02 Date of Retain 4993 02 06 To attend the reg academic symposium on innovative teaching methodologies organized by the Commission on Higher Education. activity aims to enhance faculty competency and share best practices among participating institutions. Purpose of Travel Appropriation to which travel should be charged: PERSONAL William Nelson Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_1_aug2.png",
        "label": "travelorder",
        "ocr_text": "Republic o¢ oF F the Phil Ppines Province rtreametar, Grantiand NAME s POSITION Justin Mclaughlin Landscape architect Amanda Edwards Careers adviser Sout Alexander East Caitlin or J Station Destination’: Means of Fransportation Date of Depatnue 20 1 3 05 02 Date of Renun Purpose of Tra vel Appropriation ta which trave i should be cha Witiam Neison Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_1_aug3.png",
        "label": "travelorder",
        "ocr_text": "ublic of the Philippines Province af nhanctad Graniiand OFFICE OF THE Solicitor, Scotland fercnaseersennnnann newsmen eee OTT TEE, PETRELLI oe mn semen TRAVEL ORDER xo: 4996 Date: 9025 09 11 NAN POSITION SALARY Month Justin Mclaughlin Landscape architect Amanda Edwards Careers adviser Official Station Ase er Destmatons East Caitlin Means of Transportation Daie of Departure 204 9 05 02 Date of Return 4 993 02 06 To attend tne regiona Purpose of Travel Appropriation to which travel should be charged’ PERSONAL William Nelson Psychiatrist Copy Furushed HRMO"
    },
    {
        "image": "tor_synth_1_aug4.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province afnhanctaq Grantland OFFICE OF THE Solicitor, Scotland TRAVEL ORDER No: 4996 Date: 2025 09 11 NAME s POSITION SALARY Month Justin Mclaughlin Landscape architect Amanda Edwards Careers adviser Official Station Alssatder Destinations East Caitlin Means of Transportation Date of Departure 2019 05 02 Date of Retum 4993 02 06 Purpose of Travel Pete ee aca ericad by ine Gommimussion On Higher Education. The activity aims to enhance faculty competency and share poss praceces among participating institutions. Appropriation to which travel should be charged: PERSONAL William Nelson Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_1_aug5.png",
        "label": "travelorder",
        "ocr_text": "ANGE Oh ahanctad Grantiand OFFICE OF THE Solicitor, Scotland 2025 09 44 WARY Monthy Justin Mclaughlin Landscape archifec Amanda Edwards Careers adviser Official Stator South Official Staton Alexander Destinations East Caltin Means of Transp Date of Departure 20 4 9 05 02 of Travel Appropriation to which iravel should be charged: PERSONAL William Nelson Psychiatrist"
    },
    {
        "image": "tor_synth_2_aug1.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province of North Stephenland OFFICE OF THE adminSrator No: 4987 Date: 2023 14 14 NAME s POSITION SALARY Month Mary Martin Biochemist, Clinical Jordan Zamora arrister s clerk Official Station Al Sait, Destination s An dersonbury Means of Transportation Date of Departure 1 99 1 -09 26 Date of Retum 2004 12 24 r Te ticipate in th tional inar workshi Purpose of Travel outcomes based ete hationa align course Sohcb, ony ED standards. The training will help improve Curriculum di elivery and assessment design. Appropriation to which travel should be charged: PERSONAL Hector Ford Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_2_aug2.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province of North, Stephenland OFFICE OF THE adminitrator TRAVEL ORDER No: 4987 Date: 2023 11 11 NAME s POSITION SALARY Month Mary Martin Biochemist, clinical Jordan Zamora _Barrister s clerk Official Station A South Destinations Andersonbury Means of Transportation Date of Departure 4991 09 26 Date of Retum 2004 12 24 To participate in the national seminar workshop on outcomes based education to align course syllabi with CHED standards. The training will help improve curriculum delivery and assessment design. Purpose of Travel Appropriation to which travel should be charged: PERSONAL Hector Ford Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_2_aug3.png",
        "label": "travelorder",
        "ocr_text": "ippines fand OFFICE OF THE adminSrator Nos 4987 Date: 2023 41 11 NAMES SAi Mary Martin Biochemist, clinical Jordan Zamora Barrister s clerk Olheial Stan. Alexander Andersonbury sof Tansportanon Pate of Depa 1991 09 26 Date of Reauy Purpose of Travel Appropuation to which iravel shou Hector Ford Psychiatrist Copy Fumished HRM"
    },
    {
        "image": "tor_synth_2_aug4.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philig Province of 1 Stepheniand OFFICE OF THE Arts administrator Bate: 9993 14 44 NAME s ALARY Month Mary Martin Biochemist, clinical Jordan Zamora Barrister s clerk MMficial Station Se Ofer! Stari Alexatiler Desil s Andersonbury Means of Transportation Date of D 1991 09 26 of Return Purpose of Travel vat Seminar workshoo or Bi with bon to which wavel should be i PERSONAE Hector Ford Psychiatrist Copy Funuished: HRMO"
    },
    {
        "image": "tor_synth_2_aug5.png",
        "label": "travelorder",
        "ocr_text": "jolic of the P Province of. N Siephenland OFFICE OF THE ouminls rator eno ESTE TEL EONS No: 4987 Date: 9093 14 14 REATARD SIR cna NAME s POSTTION SALARY /Month Mary Martin Biochemist, clinical Jordan Zamora garrister s clerk Official Station Aloo: ey JEX ay Andersonbury as of Transportation Date of Departure 4091 09 26 Date of Return Parpose o Appropriation to whieh travel should be ch PERSONAL Hector Ford Psychiatrist"
    },
    {
        "image": "tor_synth_3_aug1.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province tfervihararigh North Colin Trade mark OFFICE OF THE $= \"395 85 TRAVEL ORDER No: 2016 Date: 1988 12 01 NAME s POSITION SALARY Month Jacob Oconnell Clinical biochemist Thomas Landry Sub Official Station Aer Destination s Coryborough Means of Transportation Date of Departure 2 20 4 9 0 8 0. 4 Date of Retum 201 8 02 22 Purpose of Travel To represent the college in the inter university conference on sustainable campus development. The event will provide insights into green initiatives and institutional sustainability practices. Appropriation to which travel should be charged: PERSONAL Meaan Smith Psychiatrist Copy Fumished: HRMO"
    },
    {
        "image": "tor_synth_3_aug2.png",
        "label": "travelorder",
        "ocr_text": "TRAVEL ORDER No: 2016 Date: 4 1O88. Jacob Occrnell Clinical wert a biochemist Thomas Landry Sub toni A South oti Destuapon s Coryborough Mean. of Emsportaton Date of Dey 2019 08 04 2018 02 22 Poypose of Applopnanhern to which travel shouted be doPERSON AL Meaan Smith Psychiatrist"
    },
    {
        "image": "tor_synth_3_aug3.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province tferviharaiigh North Colin OFFICE OF THE \"age mark TRAVEL ORDER No: 2016 Date: 1988 12 01 NAME s POSITION SALARY Month Jacob Oconnell Clinical biochemist Thomas Landry Sub Destination s Coryborough Means of Transportation Date of Departure 20 1 9 0 8 0 4 Date of Return 9018 02 22 Purpose of Travel To represent the college in the inter university conference on sustainable campus development. The event will provide insights into green initiatives and institutional sustainability practices. Appropriation to which travel should be charged: PERSONAL Meaan Smith Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_3_aug4.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province Bfarvihnarough North Colin Trade mark OFFICE OF THE \"Sisrney TRAVEL ORDER no: 2016 Date: 1988 12 01 SALARY Month NAME s POSITION Jacob Oconnell Clinical biochemist Thomas Landry Sub Official Staion nscatter Destinations Co ryborough Means of Transportation Daie of Departure 20 4 9 0 38 0 4 Date of Retam 201 8 02 22 Purpose of Travel To represent the college in the inter university conference of sustainable campus development. The event will provide insignis into green initiatives and institutional sustainability practices. Appropriation (0 which travel should be charged PERSONAL Megan Smith Psychiatrist Copy Furnished HRMO"
    },
    {
        "image": "tor_synth_3_aug5.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province tar vdbarenich North Colin OFFIC Trade mark FICE OF THE Tigde ma SRA AG pnearnemeaneonnonnssi msn an No 2016 Date: 1988 12 04 NAME s POSIT SALARY Month Jacob Oconnell Clinical Thomas Landry bischerm st Official Station Aeouth Oxa nder Coryborough Destination s Means of Transportation Date of I Purpose of Travel Appropriation to which travel should be charged: PERSONAL Meaan Smith Psychiatrist Finished: HRMO"
    },
    {
        "image": "tor_synth_4_aug1.png",
        "label": "travelorder",
        "ocr_text": "ppines ye Scientist, OFFICE OF THE nat ale ALES, pate: 1971 06 02 ARY Month atapase Lauren Ramirez tape Emily M administrator muy edina ceramics designe! South Alexanaerl OfBeial Station. Micheltleburgh 4980 02 19 4988 09 27 Date of Retr Purpose of Travel yyration fo swhickh trave: Victoria Myers psychiatrist"
    },
    {
        "image": "tor_synth_4_aug2.png",
        "label": "travelorder",
        "ocr_text": "East Samanthe OFFICE OF THE Scientist research SAS EEA xen nent eames Ne: 4997 Date: 1977 06 02 Lauren Ramirez ade Emily Medina Cer SALARY /Month labase maunistrator amics designer out Ti aa 1980 02 19 4 988- 09 27 Date of Retum Purpose of Travel document be Appropriation fo which travel should be charge: PERSONAL Victoria Myers Psychiatrist Copy Farnished: HRMO"
    },
    {
        "image": "tor_synth_4_aug3.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province of West East Samantha OFFICE OF THE Sensi esearch TRAVEL ORDER No: 4997 Date: 1971 06 02 NAME s POSITION SALARY Month Lauren Ramirez atabase . administrator Emily Medina ceramics designer Official Station algxander Destination s Michelleburgh Means of Transportation Date of Departure 4980 02 19 Date of Retum 1988 09 27 Purpose of Travel To conduct benchmarking visits to partner universities for curriculum enhancement and program accreditation preparation. The trip will allow the collection of sample documentation and evaluation frameworks. Appropriation to which travel should be charged: PERSONAL Victoria Mvers Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_4_aug4.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province of West East Samantha Scientist, research hs) OFFICE OF THE 9° \"(maths TRAVEL ORDER No: 4997 Date: 4971 06 02 NAME s POSITION SALARY Month Lauren Ramirez atabase Emil M di administrator mily Medina Ceramics designer Official Station 2 Ae ler Destination s Michelleburgh Means of Transportat jon Date of Departure e 4 980 0 D2 9 Date of Retum 1 9 88 09 27 Purpose of Travel To conduct benchmarking visits to partner universities for curriculum enhancement and progrart accreditation preparation. The trip will allow the collection of sample documentation and evaluation frameworks. Appropriation to which travel should be charged: PERSONAL Victoria Mvers Psychiatrist Copy Fumished: HRMO"
    },
    {
        "image": "tor_synth_4_aug5.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Ph Province of .. East Samantha OFFICE Oe THE Se cientist, iilippines i ae No: 4997 Pate: 1977 06 99 POSITION SALARY Mont ‘b Lauren Ramirez ade? fabase Emily Medina ministre Sior Ceramics designer Official Station South Alexander Michel lleburgh Destination s Means of Transportation ure Date of De 1980 02 19 1988 09 27 Date of Retum Parpose of Travel Hon and ey el should be charged: PERSONA lion to which tray; AL Victoria Myers Psychiatrist Copy Fr HEMO"
    },
    {
        "image": "tor_synth_5_aug1.png",
        "label": "travelorder",
        "ocr_text": "Rep No: 2000 Date: 1988 05 29 Stacy Weber Museun education of icer Ricky Munoz Broadcast engineer Otficig! OutR Al Sena Destination’: East Emi y Means of j TANSporfation Date of parture Date of Renan Purpose of Tray el AS Dpropriation tq which trave Matthew Harris Psychiatrist"
    },
    {
        "image": "tor_synth_5_aug2.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province of New Corev Susanville OFFICE OF THE jyerncyer, No: 2000 Date: 1988 05 29 NAME s POSITION SALARY Month Stacy Weber Museu education officer Ricky Munoz __ Broadcast engineer Official Station Al South er Destinations East Emily Means of Transportation Date of Departure 7 4 998 07 1 8 inn 2004 02 18 Purpose of Travel To attend the annual convention of the Philippine Association of Colleges and Universities. The goal is to establish academic linkages and exchange institutional best practices. Appropriation to which travel should be charged: PERSONAL Matthew Harris Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_5_aug3.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province of New Corev Susanville OFFICE OF THE ,aineyen., TRAVEL ORDER No: 2000 Date: 4988 05 29 NAME s POSITION SALARY Month Stacy Weber Museum, education officer Ricky Munoz _ Broadcast engineer Official Station Ales South Destination s East Ernily Means of Transportation Daie of Departure 4 998 07 1 8 Date of Returm 2004- 02- 18 Purpose of Travel To attend the annua! convention of the Philippine Association of Colleges and Universities. The goa! is to establish academic linkages and exchange institutional best practices. Appropriation to which travel should be charged: PERSONAL Matthew Harris Psychiatrist Copy Pumished: HRMO"
    },
    {
        "image": "tor_synth_5_aug4.png",
        "label": "travelorder",
        "ocr_text": "ublic of the Philippines Province of New Susanville Surveyor, en RETOOL ILI, TRAVEL ORDER No: 2000 Date: 4988 05 29 NAME s POSLTION SALARY Month Stacy Weber Museum, education officer Ricky Muno0Z Broadcast engineer ilieial Stator Sout osc see asa er Destinaton s East Emily Means oF Transporlahon Bate of Departure 4 §$98 07 1 8 Date of Retum 2004 02 1 8 To attend the annual convention of the Philippine Purpose of Travel een io Association of Calleg and Universities. The goai is to est ie linkages and exch institutional best practices. hould be charged: PERSONAL Appropriation to which trave Matthew Harris Psychiatrist Copy Furmshed HRMO"
    },
    {
        "image": "tor_synth_5_aug5.png",
        "label": "travelorder",
        "ocr_text": "Nes 2000 Bate: 1088 95 99 NAME s POSITION Stacy Weber d Museum, education officer Ricky Munoz Broadcast engineer South Alexander East Emily Means of T Date of De; 1998 07 18 2004 02 18 To attend the annual A Date of Return Purpose of 7 Appropriation to which travel shoi Matthew Harris Psychiatrist urnished"
    },
    {
        "image": "tor_synth_6_aug1.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province of ,Fest... Mirandamouth OFFICE OF THE Sureyor, minerals TRAVEL ORDER No: 4989 Date: 2022 06 01 NAME s POSITION SALARY Month Christine Schneider Chartered loss adjuster Jeffrey Johnson Engineer, civil (contracting) Official Station Al et i Besiueitie Teresachester Means of Transportation Date of Departure 1 979 06 23 Date of Retum 201 3 1 1 -27 To participate in a facul development program Purpose of Travel hosted by the University, of the Philippines cine training includes modules on instructional material design and student centered learning approaches, Appropriation to which travel should be charged: PERSONAL Nicole Johnson Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_6_aug2.png",
        "label": "travelorder",
        "ocr_text": "blic of the Philippines ince of Mirandamouth OFFICE OF THE Surveyer, minerals JER No: 4989 Date: 2022 06 01 TRAVEL O. NAME s POSITION SALARY Month Christine Schneider Chartered loss adjuster Jeffrey JONNSON Engineer, civil (contracting) Station Soutt Ajexander Ee Teresachester Means of Transportation Date of Departure 4 979 06 23 * 2013 11 27 Te participa hosted by i training includes mod design and student centered lear i: PERSONAL Date of Re Purpose of Travel Appropriation to which travel should be ¢’ Nicole Johnson Psychiatrist Copy Furnished HRMO"
    },
    {
        "image": "tor_synth_6_aug3.png",
        "label": "travelorder",
        "ocr_text": "PpInes fai ndamout h OFFICE or THES Surveyor, minerals emvmenincencen cso nena Svein ne eater POSITION SALARY ‘a faye! Date: 2099 08 04 Christine Schneider Chartered loss aqjuster Jeffrey Jonnson Engineer, civil (contracting) Month Official Station Soutr Aléxande: Mesinationss Teresachester Means of Ty we Fy 06 28 Date of Return 88 On ing uot centers, ed PERSONAL Appropr approaches, 8 to which travel sho sald be ohg AP Ni cole Johnson sy chiatrict"
    },
    {
        "image": "tor_synth_6_aug4.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province of 4 Fést... Mirandamouth OFFICE OF THE Surveyor, minerals TRAVEL ORDER No: 4989 Date: 2022 06 01 NAME s POSITION SALARY Month Christine Schneider Char ered loss adjuster Jeffrey Johnson Engineer, civil (contracting) Offfcral Station Aloeatiler Destination s Teresachester Means of Transportation Doe of Departwe 1979 06 23 Date of Rem 2013 11 27 Purpose of Travel To participate in a faculty development program hosted by the University of the Philippines. The training includes modules on instructional material design and student centered learning approaches. Appropriation to which travel should be charged: PERSONAL Nicole Johnson Psychiatrist Copy Furnished HRMO"
    },
    {
        "image": "tor_synth_6_aug5.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province of -Fah u Mirandamouth OFFICE OF THE Surveyor, minerals TRAVEL ORDER No: 4989 Date: 2022 06 01 NAME s POSITION SALARY Month Christine Schneider Chartered loss adjuster Jeffrey Johnson Engineer, civil (contracting) Official Station peel DES Teresachester Means of Transportation Date of Departure 41 979 06 23 Date of Retum 90 4 3 1 4 -27 : To participate in a faculty development program Purpose of Travel roeted by the University of the nlippines: The instructional material training includes modules on ins design and student centered learning approaches. Appropriation to which travel should be charged: PERSONAL Nicole Johnson Psychiatrist Copy Fumished: HRMO"
    },
    {
        "image": "tor_synth_7_aug1.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province Rf machurah West Brenda OFFICE OF THE Chiropodist TRAVEL ORDER No: 2019 Date: 1998 02 01 NAME s POSITION SALARY Month Linda Burns Occupational . therapist Melissa Carrillo Education officer, museum Official Station AI tt esiiettene East Stephaniehaven Means of Transportation Date of Departure 4 979 07 27 Date of Retum 1 980 1 2 07 Purpose of Travel To present a research paper at the 2025 National Research Conference on Higher Education. The study contributes to improving institutional policies on academic quality assurance. Appropriation to which travel should be charged: PERSONAL Victor Mullins Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_7_aug2.png",
        "label": "travelorder",
        "ocr_text": "Province Rim: West Brenda OFFICE OF THE Chiropodist No: 2019 Bate: 4998 02 04 Linda Burns Occupational therapist Melissa Carrillo Education officer, museum dificial Station South Official Station Ake Dei East Stephanishaven Means of sportation Date of Departure 979 07 27 Purpose of Travel siudy contribu on a to which trav charged: PERSONAL Victor Mullins Psychiatrist"
    },
    {
        "image": "tor_synth_7_aug3.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province R machiirah West Brenda OFFICE OF THE Chiropodist TRAVEL ORDER No: 2019 Date: 1998 02 01 NAME s POSITION SALARY Month Linda Burns Occupational . therapist Melissa Carrillo Education officer, museum Official Station Ae er Destination s East Stephaniehaven Means of Transportation Date of Departure 4979 07 27 Date of Return 1 980 1 92 07 To present a research paper at the 2025 National Research Conference on Higher Education. The study contributes to improving institutional policies on academic quality assurance. Purpose of Travel Appropriation to which travel should be charged: PERSONAL Victor Mullins Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_7_aug4.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province R machiirah West Brenda OFFICE OF THE Chiropodist TRAVEL ORDER No: 2019 Date: 1998 02 01 NAME s POSITION SALARY Month Linda Burns Occupational . therapist Melissa Carrillo Education officer, Official Station Al South Destination s East Stephaniehaven Means of Transportation Date of Departure 4 979 07 27 Date of Return 1 980 1 92 07 Purpose of Travel To present a research paper at the 2025 National Research Conference on Higher Education. The study contributes to improving institutional policies on academic quality assurance. Appropriation to which travel should be charged: PERSONAL Victor Mullins Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_7_aug5.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province R mashurah West Brenda OFFICE OF THE Chiropodist TRAVEL ORDER No: 2019 Date: 4998 02 01 NAME s POSITION SALARY Month Linda Burns Sorel Melissa Carrillo Education officer, Official Station 2 Al South patie er East Stephaniehaven Means of Transportation Date of Departure z 4 979 07 27 Date of Retum 4 980 1 2 07 To present a research paper at the 2025 National Pexpese of Travel Reasearch eteence on Higher Education. The study contributes to improving institutional policies on academic quality assurance. Appropriation to which travel should be charged: PERSONAL Victor Mullins Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_8_aug1.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province Mhdraamaith East Allenville OFFICE OF THE Prison officer TRAVEL ORDER No: 2001 Date: 2005 06 29 NAME s POSITION SALARY Month Danielle Mcbride Production . manaaer Lisa Hicks Tourism officer Official Station Aloe er Destination s South Lisaborough Means of Transportation Date of Departure 202 1 -02 1 5 Date of Return 1983 09 1 7 To undergo training on digital learning tools and learning management systems. This will support the integration of e learning strategies in classroom instruction. Purpose of Travel Appropriation to which travel should be charged: PERSONAL Samantha Anderson Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_8_aug2.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Pr Province Oh trac East Allenville OFFICE OF THE Prison officer Date: 2005 06 29 eure thy NAME s POSTON SALARY Moath Danielle Mebride Production 7 manaader Lisa Hicks Tourism officer South Alexander Destuation s South Lisaborough Official Stahion Means of Tr oration pace 2021 02 15 Date of Return vos 1983 09 17 Furpose of Travel To undergo training on ‘ jearning management systery the integration of e learming sirate classroom instruction. i: PERSONAL learning tools and Tt support in Appropriation to which travei should be charg Samantha Anderson Psychiatrist"
    },
    {
        "image": "tor_synth_8_aug3.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province Mhdaraamainth East Allenville OFFICE OF THE Prison officer TRAVEL ORDER No: 2001 Date: 2005 06 29 NAME s POSITION SALARY Month Danielle Mcbride Production 9 manaader Lisa Hicks Tourism officer Official Station Al South ly Desiiiaiton s 5 South Lisaborough Means of Transportation Date of Departure 9021 02 15 Date of Retum 4983 09 17 Purpose of Travel To undergo training on digital learning tools and learning management systems. This will support the integration of e learning strategies in classroom instruction. Appropriation to which travel should be charged: PERSONAL Samantha Anderson Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_8_aug4.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province OhaAraamaiith East Allenville OFFICE OF THE Prison officer TRAVEL ORDER No: 2001 Date: 2005 06 29 NAME s POSITION SALARY Month Danielle Mcbride Production . manader Lisa Hicks Tourism officer Official Station Neer Destination s South Lisaborough Means of Transportation Date of Departure 202 1 -02 1 5 Date of Return 1 983 09 1 7 Purpose of Travel To undergo training on digital learning tools and learning management systems. This will support the integration of e learning strategies in classroom instruction. Appropriation to which travel should be charged: PERSONAL Samantha Anderson Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_8_aug5.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Phillor Provinde Dinriroamne th st Allenville OFFICE OF THE Prison officer eenanann: ec 5i0t CREEL EIS, ne: 2001 SALARY Month POSITION Danielle Mcbride Production = menader Lisa Hicks Tourism officer Official Station As ler South Lisaborough naoa s Means of Transportation Date of Retum figital leaming tools ane. St 5 Purpose of Tr avel of elearning straieg! ssroomt struction. nould be charged: PERSONAL priation 16 W hich tras Samartha Anderson Psychiatrist Copy Fora hed: HRMO"
    },
    {
        "image": "tor_synth_9_aug1.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Phil Province of South Carlosfurt OFFICE OF THE intelligence analyst RCRA RTE IARI across Ase AIEEE HENLE CEPA REESE 8 ON IONE A EERE ELE ES LETTS No: 4987 NAMEYs POSITION SALARY Month Henry Johnson Legal secretary Vi i cha es! a Ce ry Medical laboratory scientific officer ee Official Statior Sout een Alsxander Destination s Don nefu rt Means of Transportation Date of Return 4 9087 05 14 g To ajtend the seminaron adve and stalishoal enha Appropnation to which travel should charged: PERSONAL Laura Rivera Psychiatrist HRMO"
    },
    {
        "image": "tor_synth_9_aug2.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province of ,. North South Carlosfurt OFFICE OF THE Intelligence analyst TRAVEL ORDER No: 4987 Date: 1998 09 28 NAME s POSITION SALARY Month Henry Johnson Legal secretary Micha ela Perry Medical laboratory scientific Officer Official Station Aleut er Destination s Donnafurt Means of Transportation Date of Departure 2023 02 01 Date of Retum 1 987 05- 1 9 se of Trav To attend the seminar On advanced research Purpose of Travel methodologies and starstoy analysis. fhe training aims to enhance the quality of faculty research outputs and publications. Appropriation to which travel should be charged PERSONAL Laura Rivera Psychiatrist Copy Fumished: HRMO"
    },
    {
        "image": "tor_synth_9_aug3.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province Of .. North South Carlosfurt OFFICE OF THE Intelligence analyst TRAVEL ORDER No: 4987 Pate: 1998 09 98 NAME s POSITION SALARY Month Henry Johnson Legal Secretary Michaela Perry Medical laboratory Scientific fficer Offi Official Station Ase, Destination s Donnafurt Means of Transpor tation Date of Departure 2023 02 01 Date of Return 198 7 05 19 Panos of Hav RANCOEBS Sm 2 anance esern training aims to enhance the uality of faculty research outputs and Publications. Appropriation to which travel should be charg ed PERSONAL Laura Rivera Psychiatrist Copy Furnished HRMO"
    },
    {
        "image": "tor_synth_9_aug4.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province of ,_North South Carlosfurt OFFICE OF THE Intelligence analyst TRAVEL ORDER No: 4987 Date: 1998 09 28 NAME s POSITION SALARY Month Henry Johnson Legal secretary Michaela Perry Medical laboratory scientific Official Station Nee er Destination s Donnafurt Means of Transportation Date of Departure 9023 02 01 Date of Return 1 987 05 1 9 : To attend th i d A training aims to enhance the quality of faculty research outputs and publications. Appropriation to which travel should be charged: PERSONAL Laura Rivera Psychiatrist Copy Furnished: HRMO"
    },
    {
        "image": "tor_synth_9_aug5.png",
        "label": "travelorder",
        "ocr_text": "Republic of the Philippines Province of «- North South Carlosfurt igence analyst OFFICE OF THE Intell TRAVEL ORDER no: 4987 Date: 1998 09 28 NAME s POSITION SALARY Month Henry Johnson Legal secretary Michaela Perry Medical laboratory scientific Official Station ntscaitder Destinations Donnafurt Means of Transportation Date of Departure 2023- -02 01 Date of Retum 4 987- 05- 4 9 eq research To attend the. semi oat and rial gest a ane lysis ty of faculty odolog training aim enhance the quale resea arch outputs and pu ations. Purpose of Travel -avel should be charged: PERSONAL Appt opriation to which tra Laura Rivera Psychiatrist Copy Furnished: HRMO"
    }
]