[
    {
        "image": "unithead1_synth_10_aug1.png",
        "label": "unithead",
        "ocr_text": "University of Santo Tomas Personne! Department Manta 1018 POSITION DESCRIPTION: DEPARTMENT HEAD COLLEGE OF ENGINEERING Submited BY: WALEY SANDERS MO November 08, 2025 Introduction: Th soconert setnes 9 pontion requrements and expectations Key Responsibilities Exeene nomenataive easerine ove’ al Geatnent spwrtons and scaseme progeny Formate swatege pars and coectves consent wth cohege and errernty gous Recrat eves and wine uae faeuty and nomenve sft Acca wiowces reMang busget sbkce and eqsenet Io Neer Geoameet Aectors Promete excelance o teaching. \"each and commnty entrar eevee Coorsnate cares Sevecomert Bnd rer. 19 meet MOAT ae ‘oceta neecn «Implement guaity aszarce mentees and patceute m acomstaton processes Recrvent Seoarmert rterests m colage and ewvernty governance ‘ructaws« Foner colaborabve relatorahes wih ertemat patra tr stsené cpserntien «Access student concert and ensue stvery of guy Seaceme Requred Quaificatons and Competencies Teme segs (POE) m seprprate acaseme ta om secrete emery Asean og 8) year of seccensta taenng and nomnatatve exoererce Enubianed ovtaton research wi sutatartat pticatons m peer severees GET Prevos exserance an proyam coordrute, sesurnert char eaev ert poate Excertona aaserane gustan wt abity to enor and motvate teams «Stang rteperiera wits ad abit to bald consensus among Serie groves Comprenenave wicertanang of Pricore hares eaucaton system and poles Expererce m extemal atons Knerasng and resource mobazaton Demoravated commenert to vert. equty and mekative excetence Proven sty to manage comien prqwcts and mange prortes Tectrology sary wa trownage Cree secateral movie Professors srvecoment 9 aasetne goverarce o Me acca management oenes ‘The Unt Head serves a he pieasare cf the Unversty Prsisent and reperts rect to (he Vice Present for Academe Aftars. The postion equres decation to te eevernty 5 mann of aeaseme excelence research arovaton and commanty ‘eevee Interested and quad appicarts may sutmé ther comprehensive eurosan ‘ie, apghcaton ter and supporing documects tothe Human Resouces Otc (Ory snertnted cana wi be contacted fr mtevare Tha penton Sexcrgton may 00 custoed an ensenenny to mast Ge changing coats of Ge tathaien end eewe"
    },
    {
        "image": "unithead1_synth_10_aug2.png",
        "label": "unithead",
        "ocr_text": "POSITION DESCRIPTION: DEPARTMENT HEAD COLLEGE OF ENGINEERING Submis BY WALEY SANOERS MO Nowerber 08, 2025 Introduction: tm socomer svtnes 0 pouton reurenents and expectant: Key Responsibilities «Ewes nominative entering over at Gepariment operons and sense poems Formate vraege fans and cctves consntent wih eolage and Ciresty gens Reon. Govelop. and vam que’ tery and aamenstatie sft Iiccane esowees nekcng beget. teace, and eqsoment te Nappa ceperenert sectors Promata ecetence Seacheg, \"each and communty externcr orton Coongrate comeuaem Seveopment and revs to met mary and soewtn neeen inpament quity asuzance meanews and partcpate m sccrestaton ocensen Represent Sagaronent meerests m colage and every governance recnoes «Fonte cotaborstve riatorsnes wih extemal partes for student corornnes -Aatrens stusent concerns and nase Gebvery of @uty Beadome Requred Quatifcatons and Competencies Terns! sages POE) m seoroprate seas fai rom secreted warty Ae aunt ogre Hy youn of saccensta tncnng and nomena enowrence Eaabinnes piston n esewen Wt Suovlarea DuRCHRON pewrcevawed OTN Provo experence a progam coorsratar sepatmert ha waa Bert SoRtSr Exceptona asevne gonites WO sbity fo repre and moby ae ams Stang eerie sibs an amity fo bad corneresn Bmorg Sverye goes Conpwersive untevtaning of Pragore ngre eacator ty iem anc pokes Exsererce o erlera ators trernang ang iarce mooazaton Denorst ated “commana to Qvernty wasty Bnd eclave encetence Proven ably to manage compen prety and mato prortas Techroiogy tarry mth knowesge of Care eccuers orev mors Professors! srecomert waserine governance Maher seater tage ovens ‘The Unt Mee nerves at the ptnanice of he Unwveraty Pressent and por Seecty 12 he Vice Present fr Acasome Attar. The poution requrws decaton to te Srentr maser of maseme excelence wheuch mover and Commanty servce ements nd quates sephcarts may Sat ther conprenersiee care wnen ese, sppicaton wee and supporing decent to he Human Resouces Oice Cnty shortinted candies wil be contacted for mterview The positon desengtion may"
    },
    {
        "image": "unithead1_synth_10_aug3.png",
        "label": "unithead",
        "ocr_text": "POSITION DESCE COLLEGE OF Ft troduction: Yr aossouasgetmes te pests caceeant gn. Key Responsibilities SoR 3008 -Fanaate testes pars on Sepanmen vttent ssteeatie tes Competencies tes sTecinogetavvy wih eroe eon Pm. goveessnce oe se ite ane tee Coy rises vanctates meet Ie chasing seeds ome ee"
    },
    {
        "image": "unithead1_synth_10_aug4.png",
        "label": "unithead",
        "ocr_text": "University of Santo Tomas Personnel Department Mania 1015 POSITION DESCRIPTION: DEPARTMENT HEAD COLLEGE OF ENGINEERING Submited BY: HALEY SANDERS MD November 08, 2025 Introduction: This document defnes the positon requirements and expectation: Key Responsibilities: Exercise administrative leadership over al department operations and academic programs» Fomulate sate plans and objectives consistent with clege and University goals» Rect, develop, ad retain ques facuty and administrative stat ‘locate escurces inci budget, space, and equpment to supper depariment functions «Promote excelencein teaching, research, and community extension activites Coordinate curieuum development and revision to meet industry and societal needs «Implement quaity assurance measures and paiipte in acorestaion processes» Represent ceparmen interests in colege and unversty govemance Structures Foster elaborate relaonships with exteralparines for student coporunities» Adsress student concerns and ensure devery of quaty academic Required Quaifcations and Competencies: Terminal degree (PADIEAD) in appropiate academic eld from accredited university ‘Atleast eight (8) years of successful teaching and administrative experience Established reputation in research with substantial pubcations in peerreviewed jours Previous experience as program cootnator deparment cha, or equivalent postion Exceptional leadership quaities with aby to inspire and motivate teams Strong Interpersonal skis and abaty to buld consensus among diverse groups Comprehensive understanding of Piipine higher edveation system and poices Experience in extemal lations, fundraising, and resource mobiization Demonstrated commitment to diversity, equ, and inclusive excelence Proven ablty to manage ‘complex projects and multivleprortis Teahnology savyy with knowiedge of currant ‘educational imovations «Professional development in leadership, governance, o higher ‘edveation management prefered ‘The Unt Head serves a the pleasure of the University President and reports rectly to the Viee President for Academie Aas. The postion requires deiction othe university s mission of academic exealence, research imnovaton, and eommunty service Interested and quafld appécants may submit ther comprehensive curiculum vitae, appScation letter, and supporing documents tothe Human Resources Office (Only shortistes cancates wil be contacted fr intarvew. This postion desertion may bbe revised as necessary to meet the changing needs of the institution and ensure"
    },
    {
        "image": "unithead1_synth_10_aug5.png",
        "label": "unithead",
        "ocr_text": "University of Sante Tomag Persoonei Sena tinont sosee Menie 19 5 POSH ION DESCRIETon SEPARTMENT HEaD COLLEGE OF ENGINEERING KOTAY, HALEY sancens jy Nevasniver 08, 2030 Satroduetion: \"Be coosmien dete 0 pation rps Key Responstbittias, 1 Sn est O84 depacetntegnahs ta and betes Seem «omit wraps orate onteesty goats 180 Gaus Gt, i sage ae eet dat sak Sarna ic sero tatice iersiy goversany Fiaital pees os peacraciuad nents Sree ting Rica teas» Sng SHES a6 ay uy Svante Grose 2M nea erg ‘cain sasagertnt MOE acs, grcemtnoe or he Ga Uo Heat sares 3 pence tho Un fe Vion Peston! fr Aesenome ates tear Seni ad etna ey soe han Oo et 2 wctateg occa Resa: Si tetens omen wane cocacesio as Fass p20 Wei Sn chargine weg ee 89 denerigtin may. Se teae6 m nevesyan 2 mn"
    },
    {
        "image": "unithead1_synth_1_aug1.png",
        "label": "unithead",
        "ocr_text": "Polviechine University of ony PR Bevetooent dey begs Mere 191g POSITION DESCRIT oy UNIT HEAD REsEancy: AND DEVELOSMENT HOMSA NE MaRtC SROREG Novenives 92\" tas BOS ucthen: Yas esi ota ay respon 9 a eo Key Resporsibitias Rese Custer sini Compatancing PERT tein Feeaen Benguet,» See rae sonrnnene expen Stones mumienes 8 eoseen toe Train, ae estate «Par eee eseeth Rate, ted meres en MH Eas ea gee Reem sten shes Onmanienny ne Teena abe Seater eget Resende ct aei8 sasseanse tem edger oeneren, eee a"
    },
    {
        "image": "unithead1_synth_1_aug2.png",
        "label": "unithead",
        "ocr_text": "Polytechnic University of P+ i orcs! One 4 Mensa 1290 POSITION DESCRIPTION. UNIT HEAD RESEARCH AND DEVELOPMENT fabeniney MARIO BRON Nevembnx Gz, 2025 iparoduction Tee teewuy wanes ve sey etpewttes weed RUMEN for Om BOON Kay Responsibities Peete asng anna a Ree OV 8 Gagarin Bago 0 ceectacar yuo Wk sevens eunclenst meas «Sept ane eve Ia 8 Sat pacers OND ELEN BOM CCN AML MEIN WNIT ‘rste masse aeeioarant mymmareabon, soa myerteart fe vinta pat esac selves Manas Sagan Laiget retmeces ons taeomes ect) aa ec Footie manne) serves, wary paseo et ceaeere Cabins Coors wih shar wagons 0) 2 Mine Prema te nats eaatwy “bo ompeorce wih awe NE, pokes, CED gust, acd eSOLMNES MUNI Le Casty Neer Dane. wt ern emcees tcc be aatinted prosasies «Fewer Apatow 628 Reqared Quaticavene and Compeiencien Besta degre v Goueuton Useageena. or waver Sau cine mgarnd Hirer Si enn year progente ecawrence mye Letaban 20m an ‘ettintat expereere orm Saewe a ant MGORNET IN HBO Pree Moen went masnar th pubreatrn toy 29Chee MaRS Feevins eran ant rt caren neato HA 1 Enya and Ekg «Sg wahytes stlemvcten W ‘eomsr e ting sotees« Dencratitac norparce m sarge SeONg 2nd SE argon Eopasaree nae rgayent 4 pare Bas ert Keema 2a) SUE? SIMEONG pd BERN Bren Prcaey ge eeu hanes aaeagenset, a wiecae optim» Coma 4raey a anh, we same Mana soem Mast proves: Aaazeats Prvtenzor an oF Maer 8 per SHED vmware ‘es pute gran were nar wren aie Pen were apn ere van coer ny ek donee MONS Tie secntet tat teense Se gre stmt a pelenncny canton ae ss aha opin ttre sy apa tom te ne oe rmwcene let fearines tt Mn soveats aaearar Mem ‘rorteg unaes CV. smiean re warmer tents Pace meme Revncoes The werent; sasarves te art te macy tis postion dousriguee bev"
    },
    {
        "image": "unithead1_synth_1_aug3.png",
        "label": "unithead",
        "ocr_text": "Polytechnic University of PH HR Development Offer coms Manda 1010 POSITION DESCRIPTION: UNIT HEAD RESEARCH AND DEVELOPMENT Submited By: MARIO BROWN November 02, 2025 Key Responsibilities: “Provide satel andersip nd recon fr the depart is akgrment with ret Sige on acocemicexcabence standars» Spervse and evaluate (26 cat perermance. ensuring profesional Gveopmest and continuous enerovement Dyunee coveuum cevelpment, plementation, and assessment 19 Maran SOUN ciccaton avery Manage ceparmestl budget, resources. an f68teg a Syne ettcancy -Facuaate research activites, scholly pubscatons, seg Requred Qualifications and Competencies: cages n Education, Management, of reavant cig requred «Mim “TP seven (7) years progressive experience in higher education administration era crpesence in program development, implementation. and evatation «Proven er Nilor research pubtcaton, and academic leadership» Excelent wetten and ‘Sas commanzaton shits in Englah and Flpno Suong arate, prctien sohving. ad Gceatonmating bates» Demonstrated competence strategie pinning ad change management Experence in stakeholder engagement and partners development» Knowdge of quaty asserance framewosts and accretaton processes «Proficiency i eaget preparation, teancia management, and resouce optmazatn Compr Weary a tamuarty with academic management systems Must possess Associate Professor ark or her as per CHED requrements “This pontion operates under the general supervision ofthe Deaw Vice President and Taubes nda coorsnateon wih various uersty ofces and extemal stakeholders. ‘Tre neumbent must demonstrate the highest standards of professional conduct and (tical benaviee Aopleaton deine tity (20) days from the date of tis Srowcement Interested candidates shoud submt complete application reqarements ‘Totodng updated CV. eredentiis, and endorsement letters tothe Offee of Human eg we unvernty reserves the right to modify thes position description based"
    },
    {
        "image": "unithead1_synth_1_aug4.png",
        "label": "unithead",
        "ocr_text": "Polytechnic University of Devetnonent Offs Manse 19 3 POSITION DESCRIPTION, UNIT HEAD Pi DEVELOPMENT ARCH winiind AY: MARUG BROWN Hever Intyodueston: Tre wowing nttnes the hay cespomsbites ard sit ans For is post Key Responsibilities Provide stag endesiiy 18 deve fer the seperti genet wth “pettuions: gon sve anavers: weoaten Sha avast Sty rent, wnassnantsinn, yu sscsunin te eta _qatty education devery «Monae depsrenacts ooget, ese afosivay nes atioenty« soles, sebusry puossotions, and estonia vobscrans Cacsnte oa sina aracen o Sces for negara ntaties Braue som repatene, aig vraructaten stnncs ase Ses Reqtites Qualifications ona Competennies Sages is Edacstan, Sasegeman, oc cebvact bane i seven yas progestive expeseige 9 Dgher ecvemion xinwatraten sinantl mavane cen powom aaceoersaie Fone mesearh, pubsatizn sok aeadenis east Brostent iten aod ‘ua! conmunaston su8 Bap jong wand. prokien eoieg, an eeisicnanahing alates Demonstare: orenpelance m states zm and ohare managamess xuerunce in stalabetse atysisoent and patnarp Gavacgment« songs of uaty suns tamenase ans tee noat espatin, Snares agugenvas. ea tes 6 waugunent sySane 2 OED sequrerents This eeston operates woe the gana nugensian of Ine Danie Prasad 2d Toe nnunsens ust dersqastar the ghost stones of grteesire ‘avn. Apgsexon onan i iy (2) aye athe dat ssises sng tt somite agososen retuerents pespius and sovorsenans taro oe One oh Resaces. Tre university reserves the ng to matty ins postion desecptor"
    },
    {
        "image": "unithead1_synth_1_aug5.png",
        "label": "unithead",
        "ocr_text": "Polytechnic University of PH HR Devaloninans Site snanwe Sonae 2978 fl POSITION DESCRIPTION UNIT HEAD RESEGRCH AND DEVELOPMENT subrine s aaRGO BROW Howamingr 02, 2025, Sngrerdasdion: The towing cures to hay eipanshies and wean Car 8as m8 Key Respoasit: Pros sa earn ane ct fh npn age with Spa ad asccome exeasices stances ~Sapervan od Sef fea sak pernaran sig Peamnasceveg ant a extinasn epoN en Cerise onearn daveopns. emyamntéatan, ssaesmect tweaks Sjavtssdconien deny <aonage ounce Mute, ietccees and fe Stesbiny ard ution) Sey ecomoh ates, hc ese, 8 Sescesvr setneraticns Gomréaaie wih her arson ws sr ain awe for strona ebacins Eraure en pie neh meaty Pes, CED mows, ns aeraiatan sondas L faly erecta, Me a nur ovens tearing fe elas pocedins “Fatt aocacve war Seqares Qusslicotions and Comparencey tesieone Sages 2 EGsiaton, Manageesaet a rigeant Serene regabe Mier Lerensie years pogrestve aaparence ihe duane oamieistatan~ Saontais sapenence a roger dnsinpaek, xaieertso, are evasion Praete tess cesord mresngeh glasba, wit arasarie leaders «Txt wien a al comunsnanan st Ergish ant Fig Strong many! preter wivng, Ganaionmnancg atiiins iamonetited venparance e satags Seciry os NN raragemnest -Expevenue hy aLsehtta: angayamand 6 pummantip decreanet rege ol ey asyerwine Favawotes 29 zeorestaton pucesxet Pefecensy 9 Soaipe segacation, ines) managarrat, afl eseuree optiniase9 Game iars0y ibd banty wth aan reragerase syste «abst oaneey Actoriate Prsfostor ark a inte 9 pe SHED nacarenas in eae gars iim fe pines eapormtor ifthe Seance Pre veges qian toa alae wth Tt RAC EL ON Eka {Toe suerboon mise animate Mghest stands of prfesz nat ponds ioe omar, Apieation oadine 9 Wet (22) days ce tha date Tronmoannt imamestad caxttnes shied seb sorigiate raters rere ents ooing ounen 2, onsdentals, and seers sates 9 e OF of Furie Fetcunnse the vonwnny nesmrves eight to oc 1s susan cesesption Rasa"
    },
    {
        "image": "unithead1_synth_2_aug1.png",
        "label": "unithead",
        "ocr_text": "Atenes de Manila Universi ee of Karan Rescuctec Suezon Cy Hee hohe SCRIPTION: OFF OF ENGINEER NGS BY NOCLAIH, Pho wis ercunncanies te Key Fesponsititi comarca Re 2688 ar ace 38 aes esata ete, Sree 58d conten re NER curiam Seaviepane Ft Bae, mses. ont taesen sna stat wthse, catia ponents ag sea rith Tat ster sencemve 08s ans aces nae oy SIS Corns wt aretey oe ete ee nate Lead faely ence, pameten e sees Atoondcy to ectaenes montane foasives Quastrstone Rese etetrstana 5008 ter. 809 Compeeocies saat, Santee rOgestve srpusenoe 1h ekreeance pagar secsemen er vesenck, aubicaten ant teednen eaten wttan aoe arith S35 Eagan ia Paes Seep me PaboenrsOg. ae ment SN Dnitate opeten sea foning axe change Remap a ene Nate emmy seen seeoeorec Sitiedee ot asity seswance ramnemahe ne oon ute reper, Crane 2rd tata Protas an SRE asibSne nee «Maan, ‘hes acai seine mpsenart Seiya ce. aot sudan ron, fink: maven snd costae wines be senate Sagat on a Bestomance acahat ai"
    },
    {
        "image": "unithead1_synth_2_aug2.png",
        "label": "unithead",
        "ocr_text": "Ateneo de Manila University Otte of Human Resources Goezon ony 108 POSITION DESCRIPTION: DEPARTMENT HEAD COLLEGE OF ENGINEERING Submited BY: TRACEY MCCLAIN October 14, 2025 Introduction: The role encompasses the folowng responsities and quafcations Key Responsibilities,"
    },
    {
        "image": "unithead1_synth_2_aug3.png",
        "label": "unithead",
        "ocr_text": "Ateneo de Manila University Cnce o oma Renrcen ces Quezon Cay 1108 POSITION DESCRIPTION DEPARTMENT HEAD COLLEGE OF ENGINEERING Submited) TRACEY MCCLAIN October 14 2025 Introduction, 1h -s econsattes te tetowng snsonsciten and quitestors Key Responsibilities Prove watage watering tnd Srecten to te Sesame ermert we (ravenna goat ind scosene excalarce vanaarah Sugar and erate tae Detar petemace earry pentons Seveapment Ind Cre mere cOeewee nevcuem sevenement mpemertaten and annenumert to Matar (gents eoeaton come) Manage saparments busy orcas and tts Crecteey ond whearey Facute nears acbetey schotary pakeators and Recor coumormars Cooranute wt ater acetone ty and nome sve (Arcee ratnora meseves “Exsce compuarce 2 coversty ponces CHED gamers ane morwstanen area» Laas act rerament promaton ed tere prcenten necorsng is estabinned prceaes :Fouler 4 poxtve wo Requred Quaifeatons and Competencies Dectorme sages Eavcaton Management of reavat ouccine auras Menem o tever 7 youn pagentns expmrence hope ecucaton nomnaitcn Sietrea ergererce pagan serecomert moenertaen id. Busten Proven aes cord e oenewen ptcateon wns season aacerve Excelent wn an oa commoneater tan» Engen Fuge «Stang mnayten pobem sang me cecaenmanng sites Denorsiated comowtence m Watege planning Ind CMge neragenert Experence sunenoce engagement and perverse seveoomert Krowadge of gusty minarce hamenons ana sccrestaton processes Profcency age peparaten tmarcc management and rvoce cgtmaaton Compute teracy ane famaarty wi seaseme maragemert systems Mua pownens Ansocate Professor aa or hares a per CHED reaarements ‘The Deparnert Haas wos covey 9 tacuty sta and susents to aovance he cecements seasons mater and corteute 9 amernty wise maven Reguar tetornance ersten wi be conducted haved on evlabinned mates Bnd hey petormarce macaton Agescanons mat be buomtied Dough the overnty nine ‘wersemert sora wane thew (18) cays tom pontng Compete soc amertary swosrements mat be sacred molsing academe Cresent potest centcates Bnd erences Tha poster Sencroton serves 20 2 gude tor role expectations and"
    },
    {
        "image": "unithead1_synth_2_aug4.png",
        "label": "unithead",
        "ocr_text": "Ateneo de Manila University et a Hees Meseresn Guazen Cay $108 POSITION DESCRIPTION: DEPARYMENT HEAD. COULEGE OF ENGINES ANG Sobmited #y Taacey Moc AIN Oeuber 14, 2038 Seiroductt oft, The eaten AEE te olosing ressenenites and guaiages: ‘ey Responsibilities ‘rateys woterhi ond czas tor the Hegaanen Rigger wth nstiiuat goats at mages farce staniat Sugaecnn aed waa it Ay 201 sat! cartoorarce emery reertirny Gevaert ana norainaut oapwovemiet Ghee curicaen cretainent ipamaesstion and asneramece to Maan ously esuasian tea) sags dasucinarae alge evetvek, 398 facomes Sienyay are eMewery Fema resents sete nang, ens Aensenis tolbicatns Vowsne With te auacarin sa and wtmocte cee ‘thee far natlsers! waives Essie gompSaney wih usvemnty necceh Gad Neguators, an seccesaaion sandards “Lad any secrete ets rerun procecsss aesaning fo apstathad oeemes «Posie Frequred (uatteetions and Competericins ie dapat io Bovestc, Managemsee, ea: pet gsi aR ‘of seven (0) yaar Frosreanive eapaninnenwfigim ehtzaton amittnace Suosrantin expanrce is arogeart deanizamsrt, eofonrtation. ane #rsbohs feack vei seach, jabs, EN ga oanie assole Seosiezomating abltins Dercestised vampetenua m Wateps amas aN age gaeeet« Experancu a viata wegagenant and painestop deeymine ‘eowthogs of ualty assurance taeanar wnt araredthn processes -Prtotee Dasaes pracatnn. Enancin meeragomect, ab ascume wean eabon Certoe se ssy sod famibamy wh eeadeane managameeh aysterm Musi posnevs Ate Professor rah or ipbus as ogt CED rence The Dagarrest Has? wens inset faewty sal and stidants te athena tee <Basaman g szademe sussion ah cunts io wiveinnyese etaines, Reger (orhomiscee atintns i be coneintes Dates on aatsbitrad seins SE bee atcoranse intesters, Apptsatans sa ip ahrnstes nwa Ye ese ars aoe ‘ecraionet poral wit, ean (15) ove ton aestg, Cumeete senior, egteraants ml Se etashad meaty icatenie wedanteis, ete cies (gud taferenoes. Thus wuetenn Sesgution tarvou oe sale tee voe eeeentne ee"
    },
    {
        "image": "unithead1_synth_2_aug5.png",
        "label": "unithead",
        "ocr_text": "wuos POSITION DESCRIPTION: DFSARTMENT HEAD COLLEGE OF ENGINEERING Setistene Bye rea Gectobes 14, 2555 ROL este monompassas the Seen Kay Responsiisities Frode tusiege lexan ans drt oie dopant agen 2 su peamiance, swing potent aeons sae erates eee ners vein Severe, marnesan, i ssuent Yo wa9 raaty sauce aay ange Sasori yet rete ea ee iechiay are dlerey fanctale waenth avons shan esegios. aod Senin seeabariens Coane vt sine maser ats wea seman es te eating thos» Eaven conpanea tah covery pes, G8 sytoes, ana acon Sacaaite “Laos fants tenmase. Potek k dane ceases ueoarg te eeautosed poems “Fats 92 Wak Regured Qiotiestions and Cempeteriiee Doctocate degree is Funan, Manageraee, 0 oe ‘even (7) yeas wagessice meron? Higher edie an owSH HIER avert espenanne m prSGrEO Geveopmt, MRA, a0 erie» Brogae sCK civ m egEBTON orienta, ane acai alg» Exvgianeootm ova saemmzatn Ges 9 Taylad ana Piva» Sonny enayhew peseawnsctny, and ecinornasing sath Gemiceatates corepatense in wrtege eoenng ave bangs of unity arsezore sar stein prneniag “Pnboency eget sresatabon. Ean maragenan, Sctresoues ocazton Compa ety eS San say win ate acne nyster att pobEet Asna ecieaate rash os Signer a6 par CHES megavemart re Departnany Hoa wore clseiy with Fay, sith anu sinets to situs the evariwins scocanie musian se ence insay mse eitves, Ragas petovaree wcshation wi be cancyotea eanae on atabinte mats an #53 aremanee seivates, Appicatms rust Se Subrnti Noeugk ee anueen s one \"eorsvest pl witha Saar £73} days Hove neaing, Cempste osker tery ragunione mot De sasted soho scaseme Cees, woteecna! certates,"
    },
    {
        "image": "unithead1_synth_3_aug1.png",
        "label": "unithead",
        "ocr_text": "Universily of the Philippir Geman, Quezon 2 POSITION DESCRIPTION. DEPARTMENT HEAD GRADUATE SCHOO! Gobind by? RanpY HERRERA Hevember 10, 2025 Entrnductin: the ele anconpasces the folowing cmaponeities ans qalfcatons ke Gees os cue aons and anatamisaotetes or ne ut ersuing igen sn persiy mace «Gavel 2Ht mplanont sage aes, pola. aed sracusates Responcibilties fox uni efegrvaness« Sepereize pesernel oolng ring trey, patomanse -madaton, on jokes Sevetymant« Prepare 2d manage sol tage, Neate panies, ans entice Rscal zasronaky Deatnata hs aity and at sthance woxra catity and sent earang asinomes Esttin patneteios ws _nausty. gweromant agencies, and other sskahades «Maroe ota with 2 plies, geveronan agus, aw ecsiedtaton cubty asrcnras ntsinaa wesotng wngears, robegies Fauutats gonin mentin betisar ont mentees aoe miety ewpsaton owns as Ponuired Quaifcations and Comnetenniee fone cogresin Ekeaton Moasperant, oF leant Saritie vepsied Mmmm es haiesabueaion sarin ct sever (yeas pgessive erpe ‘beast ecgarenue 0 seogeam development, Impinnaitaon, smi aveuatin: «Proven ease wound n ebaarah pager, snd sozen 9 see esp «Eaastery anan ane lr commureating okie in Engi ard Higire« Seong arate, zeodtam sg, 28 Ihesticimaing antsy Derunseatad uomngsne starag vannng anu orange reanagemen Exrestace shui angagema 04 catistap o8 eaypnent Kozareage of qahty assurance Resse 309 seetestaton processes Prsiency oige aeparcten, Frawaat managemant av vaseues celnimaton Comesr iaraay Bvt fanvbanty wiv aoadene anaqerant systems Must sass Asso Frotascer ark o ngher 25 per CHED meuresiats ‘The Daparmnart Han wots Sessly wth tout, sit ora ssants adam te Gesanmarts apasemie wetion any conta to wamecyenice msatves Ragusae pester eva ows cqniyotes nagay onesies ena ana ve Pevornieve mamsime. agonovone most de ubmmeted igi he awernsy' erie ecnamnt px) wit aon (18) ys Nom posting. Uemgete desea) regsremaris este mlazhad neluirg sasdeme ceteris, prefer tinal cenicates,"
    },
    {
        "image": "unithead1_synth_3_aug2.png",
        "label": "unithead",
        "ocr_text": "University of the Philippines Human Resouces Office Diiman, Quezon Cty 1101 woes POSITION DESCRIPTION: DEPARTMENT HEAD GRADUATE SCHOOL Submited By: RANDY HERRERA November 10, 2025 Introduction: The rle excompasses the folowing responsibities and quafeations: Key Responsibilities: Drect a operational and academic activities ofthe unt ensuing alignment with siversty mission Develop and implement sratepe plans. pokes, and procedures for unt effectiveness «Supervise personnel clung hing, traning, perfomance ‘vauaon, and professional development «Prepare and manage annual budget. montor cxpenctures, and ensure fiscal accountabity- Coote with faculty ans staff 0 crhance progam quaty and student fearing catcomes -Esabish partners with industry government agencies, and other stakeholders» Montorcomplance with institutional poiies, goverment reguatons, and acerestatonrequrements Lead ‘quaity assurance iatvesincung program reviews and contewous maovement processes Faciltate communaion between unt members and unversty Required Quaifcations and Competencies: Doctorate degre in Education, Management, or elevant scipine requred« Minimum of seven (7) yeas progressive experence in higher education administration ‘Substantial expennce in rogram development, implementation, and evahuaion Proven track recordin research, pubbeaton, and academic leadership Excebentwtten and ‘al communication sias in Engh and Fina» Steng anaytial, problem solving. and decisionmaking abites Demonstrated competence m stratepe planing and change ‘management Expesence in stakehalier engagement and pariershp devetopment» Koowlesge of quaty assurance framewors and accredtation processes» Proseency in ‘budget preparation, francis! management, and rescue optimization Compute racy ‘pd famanty with academic management systems Must possess Assocate Professor rank or higher as per CHED requirements ‘The Deparment Head works closely with facuty, staf, and students to advance the epariment s academic mision and contnbte to universiy wide mtatves, Regu ‘erormanee evaluation wl be conducted based on estabished mets and key Perermance incators, Appicatons must be submited trough the university s onine"
    },
    {
        "image": "unithead1_synth_3_aug3.png",
        "label": "unithead",
        "ocr_text": "University of the Philippines Human Resouces Otfce Diliman, Quezon City 1104 i POSITION DESCRIPTION: DEPARTMENT HEAD GRADUATE SCHOOL Submited By: panoy November 10, 2028 HERRERA"
    },
    {
        "image": "unithead1_synth_3_aug4.png",
        "label": "unithead",
        "ocr_text": "ORIPTICN OEPARTHE! AQUATE SOHo Rauby HEBER lovemoar 69. 2028 introduction: Te w+ aecamgacane in flowy mtnonamions ane cuetaies erie enciverase «Sune se epuat, ae srteesiona aevelarment «Porn rapraeg sutcomas Estas? Regus 0"
    },
    {
        "image": "unithead1_synth_3_aug5.png",
        "label": "unithead",
        "ocr_text": "University of the Philippines ti Retour oe ‘Dihaae, Queen Gir 120% eiane POSITION DESCRIPTION: DEPARTMENT HEAD GRADUATE SCHOOL Sette! mane weacena Hoverntes 10, 228 TROR ERIC: Th ws meceenes feng reagent pit usted Key Rosponsibiities Beussah pares vite mien Mentor ceraperes wah, iestudana picws, goveemcect meu. a tour eatin oR «a ‘sinysasirenss mines acta, RBI cartes ae conta unpresmcnent paesses- Festina corwsameaias ttnrewn wt suetone we conto Rewutee ViuaWietene ans Competencies asinite deyroa ip Bevesn, Maxagoone SANIT oes meorasis axperance a igh azmton noroatece RODEEE eetanca sagen sertepeton. saptenscenen, 2s moet» Fagen SELLA Runwst, nittemn, anc cere enteang Eton coment Fee” Ene ae Figs Showy rayon peeneeneeig ag Ds 5 weeps arniny ond sage aera lee ona «irr, ech ean «Pitaaiey atom Camentie eccey aus mocmgesnart vstams «let posness Aesemoe Picton 08 er tcc an sa HED taasencnte Sacer 8 wdvnee an ard enact cceeeny wcte caves, Regen tain meme 3 ay Sd BaD Dhe 4 a Sesame suntan misninn beciomena nessa"
    },
    {
        "image": "unithead1_synth_4_aug1.png",
        "label": "unithead",
        "ocr_text": "Ateneo de Manila University ‘foe of Human Resources ‘Quezon Ciy 1108, POSITION DESCRIPTION: UNIT HEAD LIBRARY SERVICES Submited By: TRACY MARTIN October 24, 2025 Introduction: Ths positon seseroton detats tn cuties ang cequraments as flows: Key Responsibilities: Dect a operational and academies sotties ofthe unt ensuring abgement wth University mission» Develop ane implement sate plans, poices, and procedures focuntetfectveness -Supen se personne inclusing hg, ang, pefomance expenses, and ensure fiscal account Coorénate with faculty and stat 19 enhance program quaity and stunt leaming ovtomes- Establish partnerships with igus, goverament agencies, ad cher stakeholders Mentor eompiance wih instal pois, government regustons, ans aosrestafon requirements Lead processes Facitate communication betveen unt members ang unversty Required Quaiffeations and Competencies: Doctorate degree in Education, Management, o relevant disipine required Minimum of seven (7) years progressive exparence in ngher eguoaten asmnustaton ‘Substantal experence in program development, implementation, nd evaluation Proven ‘rack ceoordinrasenron, pussoaon, ang acacemie langershe «Exoslant writen ane ‘ra communication shal mn Engin and Fepno «Strong aration, prolen soving, ane ecson mating ates Damonatatas competence n statape panning and ohange management Excerence in stakehoter engagement and parnersip develooment Kooniagge of quaity aauranceframencrks and accrastaton grovasses Prefosency 0 budget preparation, fnancal management, nd resource optimization» Computer itraey and famiarty win academic management systems Must possess Associate Professor rank or higher 25 per CHED requirements ‘This postion operates under the general supension of the Dean Vie Present and requresraguarccordnaton win vanovs unverstyoffoes ang external stakanogers ‘The incumbent must demonstrate the Nghest standards of professional conduct and tical benavir. Applicaton deadine s thy (20) days from the date of ths [rrcuncement Inteestes canscstes shoul submit complete appocatn requrements including updated CV, credentials, and endorsement lees tothe Offce of Human Resources. The university reserves the right to modify this position description based"
    },
    {
        "image": "unithead1_synth_4_aug2.png",
        "label": "unithead",
        "ocr_text": "Ateneo de Mania Univer Counen Cay 1138 RUPTION LMT HEAD UIBRARY pOSITION DE SERVICES Sabato? By) TRACY MARTIN tntzedluction: Tht osssan see Key Responsinitties neo ee E ae geeagmen Pigare aos mage 2 Cronos wt tv onees pages Sats slvcens earning estaones Estar TNaasy, govesmen ayer, 458 tne straraere Mneer <n gouarnins sagustians, ont accraanare Paauweinenis Lea Ts itr Braga Mesa ane Bente mpACNTENE susty asseeunce ereensses Fes Regures Custicatons and Competencies cos Of seoum (Tyas onyessng excne tak Spa HPCh SE ORIENT. PIE ite tage 9 Center, Management, of hana acetre reas Mean Sng weunaten norenages snanageres Erowwerce 1 iakeroter sngapenecr und parents om mcomert Ascwiedge 2 quai asuunance Wameneree we enetastatn® srscesse? Pretaoray Di sapien Snancalwirygymnest ae ozée spkmaeien «Cone e3o4 Bos tanatrs, #1 anasenie vanapemane systens Moet ncaness Anazote Drains ane oe gee 99 o80 SHED) 1 Tha sons atures code he ess catw 4a oF Ye Daan Vise Prone? ant ner win ois cath ae i nen eect ieentas ercaates oe eomnta neonate nagarsnens ssersty eeserves Pe nigh Bo soe seas Resets"
    },
    {
        "image": "unithead1_synth_4_aug3.png",
        "label": "unithead",
        "ocr_text": "Aieneo de Maria University Set Haman Reson ‘Qenes hy 1198 POSITION DESCRIPTION UNIT HEAD UBRARY SERVICES Sahoiteet i TRACY MARTIN elec ff, 2025 Wstrosductany, Tes sesten cencnptien is esate and mecaeEnestt eee: Kay Hasponsitiitios ‘Sent super ane scenic satan Fe se aseg Mn wh cemy aunnen Tiveip ne spans MEG ato, (TED, 308 SERS Te ont afgcianaet Sxpenona pera ooking Meng. Vang. yoann cose, sn erosion Grceagra Pegaso wate WO age, NESE Tienes, aes ensue fede mney» Conelrash Wh Seoty an #28 29 Srascon reggae ae ae soaking secre «Gia AMT 4 Pennie, guvemeeee agin a tas sts Mato aemaban0 Ah aetna poison. gece epIOSORS, RECTAN RSS «Aa [panty syinanee wrens felting enya tne an gntssans povees Frecerave Fecntaia cries etn ne EMER OM EY Ragures Quasiestons and Compatencie: ieinrcin agen i Rekenion Mmunyrtect. er eaeiae scien, Gesomee yews sempestve mpmacon 9 ashe wetatn abit ‘Sutotea! exparanre prOSren AAPG. BAT eSIEBON, 2 eva «FN ara werand event. RGESON, 8 gaat aera» Exc Och ar ar woxmueseaian sk 0 Eaghch ant Fini ~S00g wisn, putsue Neen, Ha Srosuaecting aus anmanatatec comqatence a neste psig 3G OER murayains Raponance akan eagagmirt Bed erence tear Tecmnye i sndty onconcn tenes 208 mln ecieos Present) fe usps pasatatie, Seasoet marsgemen, ct reece tpt an amas Hiery ej aosnoiy wit: cadmas maraemeet syssent eh aotseks ABST rete av ee ate a0 Ps CHED repent sin poston pers coe te pected napus af the Dearie Prenat rsdbas npn exist ears welvorsty (ines Ana yatenat sutheer Fhe crmertars es aamencatssh test anes of retest sacs ANS onced bennse, Raphi Sent Cy (2) apt fare ase romans nance SANBSTS PEAS EU ROR ASEAN RAIS ‘Pov enact Gs, chai, 25 ambarsae Str wo the i ok Hore ig reniy on wv fica Da at"
    },
    {
        "image": "unithead1_synth_4_aug4.png",
        "label": "unithead",
        "ocr_text": "Atereo de Mania Unversty position ett Ba gece tena Swe a Gaueznn Gry 108 DescRIprion UNIT HEAD. 1 JORARY by TRACY MARTIN ena es toes Clpewew ane enter! Dee pan cons Requres posers wee Triaten teas, ger cpecteree sage 9 ance” Manan EN anamen Eanaen 2208008 TUS emer conmares 0° aecators sos Congeenc et cee wreeuian Senne SH TE cen Prevent ot a een cw we verte senate a De Rennes wren ean 38 8 ca gncs of peta ‘ane cae Ft re ena ie teMty TN FO"
    },
    {
        "image": "unithead1_synth_4_aug5.png",
        "label": "unithead",
        "ocr_text": "Aleneo de ‘ks Untvecsity We aman Passes ‘Gueson cy 1108 Hae SOSITION DESCRIPTION: UNIT HEAD. LBRaRY SERVICES Siri TRACY MARTIN October 24, 2025 Hetrodatelom: Te soxtion secerpsion din Gens 90 rere 96 eet Dect a8 operatzan aad seaemie acts sof sheet ecu seve 08 aaa states 3 acer tn 8. pins. 0 mcceret cans persemoe insaing hom. Masog pecymaven sv tresnions devsiogmin:- Prepare ons manage eae PPaemteies, ie enaure fl aoe yay erbinae mopam qutiy and stent iearing oxtoones iat, veers agers, 8 tie sakatinaere Mi ‘estioseat aceon, grvemeneet repeaican ane pay asevarce eaanee euiing Processes -Fackiats sone Seedrate vit tansy ek Sat to searetatcn caqcremines haat SRAM evi os cates mapas ement wens Latent memory ac weep ero Qualifications are Cornpatescine: Deotornte cape v Easoation Fn rcpt faves 1) paaet coppessive expeneiae m tghw aneaton pore ee Rasa eremencn rea devotee iaeesztOn are oben «Pega TLR wees, peateaten, ot souctine lavas» Exsaton tion ne Freer Ge sis Ege 3a Fn «ang ations petmecoog ad SES aie Nee -Gemceruates mpaterca ere pmo od oho anrmrant Exeeoonen n atotahaner arguement ard parsnriny cotemne SEEN catty atene tase ons ane aeomstaton ponsnen Peony in maa a Neh Rees maniac, and sin apsresten Cet Re Siero wh assdanss management sywris sian presen aan Protease att oe vines as pa OU anaguees, ce aac D eaparcinents \"i eovton sarates antec the prs ecg SOR Mae canteen vith vate sweaeey sees we Sars eon, Tx Rowen cont dnceaal the ses saebass of prateneconl eve ica teen. hgpkeaton seat in ey days teen ne tote atte seen fed cancéaten simi ade corsyte acpteaton secubenents SEARS se? GV. ence, and endorsement to tho Ohtes ee Rasowens. The urivevaiy sean the seit eae ain the Downe Pease ant"
    },
    {
        "image": "unithead1_synth_5_aug1.png",
        "label": "unithead",
        "ocr_text": "Ateneo ce Manila University: hee fama Revooees gos ‘uvazen Oty 1108 position DESORPTION UNIT HEAD RESEARCH AND DEVELOPME! ‘oman: CASSANORA ALVAREE Movember 02, 2023"
    },
    {
        "image": "unithead1_synth_5_aug2.png",
        "label": "unithead",
        "ocr_text": "Ateneo de Manis University inwroduction: Tee gonton ante s Required Quaite a, ane orga"
    },
    {
        "image": "unithead1_synth_5_aug3.png",
        "label": "unithead",
        "ocr_text": "Ateneo de Manila University foe of Human Resources ‘Quezon Giy 1108, POSITION DESCRIPTION: UNIT HEAD RESEARCH AND DEVELOPMENT Submited BY: CASSANDRA ALVAREZ November 03, 2025 Introduction: The postion entals the folowing key duties and quafeations: Key Responsibilities: Provide sratege leadership and Seton fr the department in afgrment with insttuonal goals and academis excelence standarés» Supenise and evatste fauty 4nd staf perfomance, ensuing professional development and continuous improvement Oversee curicuum development, implementation, and assessment maintain ‘ust education delivery Manage departmental budge, resouces, and facies Hfectuely and effeenty« Facdtate researc aettes, scholar publeations, and {zasemiccolstertions Coornate with ther academic uns and asminstratve ces for nsttutonal nitive Ensure compsance wth unverstypotzies, CHED ‘egdstons, and sceestaton standards Lend fay cecrstmer, promotion, 3nd tenuce processes aecoring fo estabished procedies «Foster 3 postive work Required Quaiffcations and Competencies: Eamed Doctorate degree in relevant field from a recognized institution At least fve (6) years of fulime teaching experience in higher education Demonstrated leadership experience in academic or administrative roles ‘Strong record of research, publiations, and scholaty contrbutions Excellent ‘communication, interpersonal, and organizational sks Proven ability to work ‘colaborstivaly with diverse stakeholders Knowledge of CHED policies, ‘accrediation standards, and higher education tends Experience in budget ‘management and resource alacation Commyimant to academic excellence, integrty, and continuous improvement Profsency in eduestonal technology ‘and management information systems Must meet faculty rank qualifications 9 required by CHED Preference given to candidates wih administrative taining ‘and certfestions ‘This postion operates under the general supervision ofthe Dean Vice President and requies egdarcoorénation wih vanous unvarsty offices and extaral stakeholders ‘The incumbent must demonstrate the highest standards of professional conduct and ethical behavior. Applicaton dean sthity (20) days from the date of hs [announcement Inteestes candidates should submit complete appecation requrements including updated CV, credentials, and endorsement letters to the Office of Human Resources. The university reserves the right to modify this position description based"
    },
    {
        "image": "unithead1_synth_5_aug4.png",
        "label": "unithead",
        "ocr_text": "posit DEVEL onesies, Key Prove wratege ease Sen goo 8 2 oe nat petarmance, eraung Stee sageatony ant 38 Reguces Quasteators aut Competencies en orga conunters Sroitedge of SHED poten’, Soenoratoely tn 100 ="
    },
    {
        "image": "unithead1_synth_5_aug5.png",
        "label": "unithead",
        "ocr_text": "Ateneo de Manila University ‘fon o Haran Beer Z ‘Dusson Cay 1998 as POSITION DESCRIPTION. UNIT HEAD RESEARCH AND: DEVELOPMENT ESRNORA ALY ORES Be plovarnber 43 uveducthost. The peasion ante the atucing aay sitios itey Responsibilities Frviestatagi dein ari dest fe he dome iors yoat ard aoadeie nttance RES sinh pecormance. sire wees deueingnere Hh CEMENT OLE et ast wae pectin 40 2 6 Hey Sere earerdin ovseogmer. anetatat, 3d a pully coon devey arte Caines! Dut, eins a facts Gacy rd siey -Featio eseorl aciibes, rohan pticaers, ond getateratians Deorinace i ae esa vas Se TE Stara ates Etre compan won sewewraty gota. CH Sgubens. apd ances san ves Lea fect reserent, premeron, ed eosin processes accarng etcbuahes pastures «Festa 8 yest wok Riecared Quaitcalims and Dompeensea: ime Eaned Doctorate Garon mn mayan’ fel rom x recogn ze’ 2 inant few ()yoar of uBdame tusching expestznse si nigher education Teosanatetee teadeni: expoeses mo ecadenc sr wonciskatie ws ‘Shong icon! of sesserch, publeatons, and sohciary contusions» Event ‘Sursmuninatin, bterpacsone, a8 ercerizaticral oie oven ahi 1 work Catvoretvely mi deren sinbabosiers Kroweagy of CF enneitaion srendaeds, nd hayes adussion ends Exparerice 0 Palget ronagnunert and jeeouree atoestian Ceavesnant tn uote areetEnon, Tener and conthueus iquevament Profeenay i aesational econ: Ena management information ayoies Must mat ‘st ecuced Oy C220 Pretemnice guen in candalvaes win adomnaatve kainng sd verticstons The poster operas nie panel sapere of the Deanne Prana seculos reparation wah vats wwertg Ofc ant tiem siakeboars Tae nasrrbsek mr amarat at te haf sansa of uahasanw concect ae tics seneion Apgonation tande Pity £20) Says hans tee cs Spnconcamant lnerestad candiiten shout use ceenpaie opyeion neces ‘recent, avd enone on 9 te CPon of Fae inntoting pain’ C', LRKASE RS. ae eee ee ihe toi snavtines dosedinticn ‘254"
    },
    {
        "image": "unithead1_synth_6_aug1.png",
        "label": "unithead",
        "ocr_text": "Polytechnic University of PA Na Gvetezene ten a Marta 0 8 POSITION DESORIPTION: DEPARTMENT HEAD COLLEGE GF ENGINEERIGG smn ty serene ON Neem G8, 25 perce: Yes drcenne es ne seta aunt aed Tepes Key Responsiztities “Sos a agra ana aaa setniens of ban asa aa cee econ nt weseasars eAtagy Sita, pie, med ee St prnennn dng Reg, RNs ato Peeaate aed Ege SESE SARA, ODE is wt etarraccnes «Su wetdian o08 praessanos trainees» Sromertme, wc eraveg Se socounucy arose wth ests 4 prance pagres oosty 24 sneee aang seems» Gutaelah prinrstess we Re Foternmies sgenies, set cane sakenotse «Blane em WA, Seine gets genimnae cepinmiens, abt senredeato agave «Leet Tey cease daanets Peano BGO NERY INS UPAR POAT STS Serer «ravine somroteaiee eww aed nek an eY Reeguirad Guadtetiine and Crenpalercs: povseata span Fraion, Mavagiemac, se iso Seige HN “Pekees Gi sume uptnece spariense w grae eatin aon I+ ‘Sobre avpnnenes is pagram Beery ephoatai, A aawete «PE iio wn een insisy= Etat Pa a Sat examen «xii Er Be Pp 9 DG MEI. COREA, HE Smonwmnarig widens Goreaneiiad aaspetence m skaters arin a6 these onpeners Eagar arian: ngugimie sn yates Sardewe8« Renconae eu sasueanas rami and arorentaens utanes Puaes ny Nope eaniiton, anc! macagenet. a7 resucee cpkmasdan Semana? vs teary wih Neadeie myer ystems «Mi poneess Asta Prager ith or Sater 62 owe EHED ror “Din govton umes unter a ewe exsist Deon ce Pane Fenian gee exertion wit niin ervey Tie At axa asta Te bans mat demarante ce ne wane of peter ron ioe earns Agiseetnn caine 5 ey MD) ay tras re OF BA Crecsamet eeceved carpeataa ord sito copie ape eee ‘patting need Cv, ementons. 998 once acon ae to x OM of Reh eae cee voter acaneas fe Holt i meaty thie porta Gerception Red"
    },
    {
        "image": "unithead1_synth_6_aug2.png",
        "label": "unithead",
        "ocr_text": "Prlytechnic University of PH HR Devaiocsete Otten Marka 1016 POSITION DESCRIPTION: DEPARTMENT HEAD COLLEGE OF ENGINEERING Savminet By epemey Lyne Nevwember 03, 2225 ferry introduction: 1 aoneveet comes tm portion meguecw ant pectin: Key Responsibilities: Detet 28 apeevtens ang meter ae SvPy De ant em igre rivensy 230% Davey ant kasama suatepe Bars puis. an preva forex Mtectowrens» Saperise parva Tclakig feng Sarg cererna ze wcnemsen, ud polesionsl cvvcorenet «Paper and savage ams Doget. enter lusentires, 206 wabee Mea wncereallty Gooranace wah Kasay ad aM WS hese posta Gekty Bel sl warweg naccenen Esta aertipe nee), purest agentes, WS abe sakansanrs «Monee camaionne ih cocina pokes. qrvemeect repéatons, 200 azeeiaion eeoenents Land (patty annearne DN eng BOY TE term A Cortes EteOM et prscences -Foemzue soneeason Sete! el aberdeen) Renuiree Qualtestions and Compatercinn *Dastoate dagen FAseaion, Metagenens cx regan Gaui rquted Minmr of seven (7) vas Bopension anpesence m Map adveation amine taien Ratan ooerere nn 7am onrdcpevent mplamenae. md evmuton Prerae ‘wazk rez a reneneeh puede me So wse HeeerHD Exc eiet uct Id fra exmsmwneaton ths a Eegpeh are higieg Surg Maite sb 0g Cesion taking ahitinn Derertaed conzetene m vratege Yumitg we charg: snasagensert Eee Vande engage 2 SUE Geelon eat Noemie easly aeruatnn tamer) aes seat yacoesses Piety bala prepereten feanew mansparert ad srcece ommraon Corner Kerang ed ternary i ace manage me aya Mat pabaeet ANS rotenne care or aghn pas GHED eesrererts {pow operates von the gare suptcrinion of te Danna Petia ad eauivs mga Coertnaten WB vacous winyty Ans wf exma! seme ‘The newman nt aomomaca te Nant starsinds cf neon sonst at Win Eetanior Apycatn Seaton 9 Bet (2) A091 om Be ate of 2H Rearcesent ineystee cancdtes sre Wibm complete ApOEESRSR Maurer Ot lerkang updated CY, evils, and acorn Wars 9 fice oP Maat Revmecee The univanty reserves he mabe t mudlty wen pustion desserption nates"
    },
    {
        "image": "unithead1_synth_6_aug3.png",
        "label": "unithead",
        "ocr_text": "Polytechnic University of PH HR Development Offee Manda 1016 ua POSITION DESCRIPTION: DEPARTMENT COLLEGE OF ENGINEERING nEAD Submited BY: JEFFREY LYNCH November 03, 2025, Introduction: Ths document detnes the postion requirements and expectations: Key Responsibilities: Direct al operational and academic activites ofthe unt ensuing akgrment with \\iversity mission Develop and implement stratege plans, poices, and procedures for unt effectiveness Supervise personnal inclung hing traning, perfomance ‘evaluation, and professional development» Prepare and manage annual dpe, mone ‘expenctures, and ensure fiscal accountabty Coorénate with faculty and stato enhance program qualty and student leaming outcomes »Estabsh parinerships with industry, government agencies. and othe stakeholders» Mentor complance wih Instnutonal ptcies, government regdatons, and accretaton requirements Lead qualty assurance iniatvesincusng progam reviews and continuous improvement Processes Facitate communicaton between unt members and univers Required Quaifications and Competencies: Doctorate degree in Edveation, Management, or relevant Sscipine raqured Minimum cf seven (7) years progressive expesence in higher education admistation- ‘Substantial experience in program development, mplementaten, and evahiaton- Proven ‘rack recordin research pubication, and academic adersip Excelent witten and ‘ral communication sis in English and Fipina Strong aniyieal poblem schving, and ecision making abies Demonstrated competence in stratege planing and change management Experence in stakeholder engagement and pannership development Keowiedge of quaity assurance frameworks and accredtaton processes Profincy a budget preparation, financial management. and rescue optimization Computer tracy ‘2nd famiarty with academic management systems Must possess Associate Professor rank or higher as per CHED requrements ‘This postion operates under the general supervision of the DeanView President ans requres reqarcooration with varous unversty offces and extemal stakeholders ‘The incumbent must demonstrate the hghest standards of professional conduct and ethical behavior. Appleaton deadline i tht (20) ays fom the date ofthis announcement. Interested canddates shoud submit compete appicaton requrements including updated CV, eredantas, and endorsement eters tothe Office of Human"
    },
    {
        "image": "unithead1_synth_6_aug4.png",
        "label": "unithead",
        "ocr_text": "Polytechnic University of PH HR Development Otfce noses Mania 1016 POSITION DESCRIPTION: DEPARTMENT HEAD COLLEGE OF ENGINEERING Submited By: JeFEREY LYNCH November 03, 2025, Introduction: Ts secumen setnes he sos ton reguremerts and expetatons Key Responsibilities: _Drest a oneravonl and scadeic activites ofthe unt ensuing abgnment wth ewsty masen Deveos ans mpement sratape pars, soles, ae sovences for wntetlectveness »Superse personnel acing hrm. tan petomane Sraeston, ard prtessona evecpmert Prepae and marage avrua eager enter sxsenditwes, ana ensure fiscal accountaty Coorénate mth facuty aoa alte erfarce program avalty and student earang outcomes -Eatanhan potneseny can waity asswance nnatves neusng progam 1eaton, and evaiation «Proven pubicaten, ang acasemic eadersno «Excelent writen are Seq Sammaneston sas Engisn ana Fino «Stong anaytea. peoemsoncy ang seesor matog abites Denorstates competence m statege pamnng oo oeege raragenent Experence m staheroce engagement ard patrerino ee eeomen® ‘ramenoees and accreaiaon processes »Profeency francs management, an resource aptmaaton «Computes nosey 23 farsaety win acaseme management systens Must possess Assecne Professor rank or ngher as per CHED requremerts ‘Ths boston otrates under the genera susersion of he DeanVice Present and (eaures rapa scordraten wth varous unverstycffces ana external stonsvone The mcumbert mest demonstrate the highest standards el profestonal corse a ea beraver Appicaton ceasing sthty (30) 388 fom he oo of announcement, Inteestes cancdates shoud suet neing updates CY. credent Resouces. The u 15 19 he Otfe8 of Haman eversty reserves the nght 10 modiy this poRten destentrn yreag"
    },
    {
        "image": "unithead1_synth_6_aug5.png",
        "label": "unithead",
        "ocr_text": "Poltechnis Unive Ba ty of PH Beewosanen: se oe Woot 1219 POSITION DESC; COLLE ASRS serrary cvunie Nocantiar oy atde RUT OF ENGindEs INLET eon etews oe Heit eae a eepessatenc Kay Responsitittigs Sette scone Resonton, sues yea Sestansa extsumey Sri earch shor, hates paaine ov Revawen Yoo a"
    },
    {
        "image": "unithead1_synth_7_aug1.png",
        "label": "unithead",
        "ocr_text": "De La Salle University Homan Resource Management Manda 1004 a POSITION DESCRIPTION: DEPARTMENT CHAIR COLLEGE OF SCIENCE Submited By: STEPHANIE GARCIA ‘October 17, 2025 Introduction: Ts cocunertsetnes the postion requrements and expectatons: Key Responsibilities: “Direct a operational and academic actvties of the unt eniveng agent wih Ceiversity masion Develop and mplament strategie pans, poles, and procedures ter nd eectveness Supenine perscanal inclung hing. taining. perfomance (evaation, and professional development» Prepare and manage annual budget, monitor ‘Txpendtures. and ensue fea! accountabity« Coordinate wih facuty and staff 0 Ccerance program quaity and student eaming outcomes Estabiah parnesps wth \\Raustry, government agencies, and other stakehoiers Montor complance with instnsionl pci, government regdatons, and accrestation reqarements Lead (qaity assurance niiatves inching program reviews and continuous improvement processes Facitate communcation between unt members and woivesty Required Qualifications and Competencies: Teeminal degree (PRO ESD) in approprate academic fda accreted waivers ‘Atleast eight (B) years of successful teaching and admbstrative experience Estabtahed eputaton research with substantial pubicatons in peer reviewed oasis 1 Previous experance as program coordinator, apartment chat, oF eqaiet postion ‘Exceptonal leadership quastes with aby to inspire and motivate teams Sto G interpersonal shils and absty fo Bald consensus among Svese GroWPs Comprehensive understanding of Phapine higher education system and pokes» ‘Expevance n extemal relations, fndrasing, and resource mebitzaton Demonstrated Conmament te dversty. equty, and chsive excellence «Proven abity to manage Soon projects and male prontien Technology savvy wih knowledge of cure ‘ccrmora! neovatons Professional development in adershp, govemance, ghar ‘edveation management prefered “The Unit Head serves atthe pleasure ofthe University President and reports etl 10 ihe Vice President for Academe Atlas. The postion reqares Geication tothe eeenty s mission of academic excelance, research innovation, and community Stncce, Interested and quaiied appheants may avome ther comprehensive caevtan Mtoe. appieaton iter, and supporting documents to the Human Resources Ofiee ‘uy snorted canadates wit be contacted for interview. Ths pontion desertion may ‘pe ural an agyepnary meet oe chancing neds of the insti and ensure"
    },
    {
        "image": "unithead1_synth_7_aug2.png",
        "label": "unithead",
        "ocr_text": "De ia Satie Uinversiny Home Rice Manaennes IPLION DEPARTMENT CHAIR Noe con ne maensy genet ote AY BNET Hey Manns AEE Sr aiowet Caawn ont sage ave tetpee beana og 98, wet wok temg encawat “Lea See Inne oe ons pian weputiens ee oettnas enemies eat seven ay ones Reqvent Duaity: yore Tears anne BES Unsrany Ereenict are wou YE Wien d seaman acelgney oman oroviten ee cae ey Rennes a tebe abet in My) hams ee 10 wasew ee os Sm et ae octets Oo Meet Me comp ee 1 inner can ome a,"
    },
    {
        "image": "unithead1_synth_7_aug3.png",
        "label": "unithead",
        "ocr_text": "De La Salle University Homan Resouce| Manta 1008 ION: DEPARTMENT CHaip- E Comet STEPHANE oaRciA October 17 2535\" POSITION DEscRipry COLLEGE OF SCIENC tomas"
    },
    {
        "image": "unithead1_synth_7_aug4.png",
        "label": "unithead",
        "ocr_text": "De La Salle University pana Marae Ninaganent SS come POSITION DESCRIPTION: DEPARTMENT CHAR COLLEGE GF SCIENCE Sevenbond Oe STEP MADE DARE, October 17, 2825 Introdsctia To cos mest setean a poution ngureaces ot eaywainn, Key Responsibitttes Dims oxen ind ease pve oe wk ern Hemet we <ttraty warns vg wd wat wag Ben. cn. 0 ee ek (aan srecenrers Depee penanen nchsony tag. vane peomane Titbien we puterscny tacearaune Pana ne mie Sr Dalat eit raceme aca encuiny Coaesis mo meat We CA Sharm contr ee staat wing osrn Eeteonh urns Titty ores perce, wa ce rence «Mest sample 0h Canter prcen premece mqanon, snd saver apes ARS Wity mance nenonen acing pagan iv tnt eer geet Seisee Troctue eonemcmena: hee eran 4 wren Regard Quittcators and Compstenies Terme cugren (PPOAO) 9 smpregrate enters Sa em aoeredint ery moan ee yeas cf veceennt tachi and snare epee Eacaivned epaanins san wi CPieraee eahance HARTI IOC. \"Sanaa punheanorn ote emer AS rowers tae egensant penton ouoee mat muse Sons «BRS"
    },
    {
        "image": "unithead1_synth_7_aug5.png",
        "label": "unithead",
        "ocr_text": "Dela Satie University fone 1 Saragement onda 1954 ER STION DESCRIPTION: ofpaRrEnT CHAN POLLEGE OF SCIENCE Ribier Be sTepnace Gascin Dewine: 17, 2825 Untrwdisction: thes acest Seta 2 genta Rey Responsibititios Does a sow aan nd seater ace Neo tnerte and mpteratins ns 8 8 ang ae poh rcenn, DUne i stance ewan pnw. pace coe oor oey SIME RID Aoewee peatene cctaang sg, rey eae eaiseoe ane on enue seston moi cay ae sha Beaty. geveronee ageemn. ane Srey Sak RD yovunmen pens, seg aeectatan tegmeoees et See Be Mes sete eng pga me ont set caine ore srserates “Feta conmaseitn bapueen iat macros oot ane Rented Qusiteatons and Competency Teed tne HIER: sees bce A nas a 8) yeas of suezan th tor Esatiaies ocanes wth her iain -Ahuctce canary ney Ny S28 nae nae encarta eaatin ena wat Seba puteinen Seno fase CARIN sito a pros comnérees depatna tis etait ee SreRara ase wactin wit seyi0 mace ma wens nom Senne Sirens wt sd aby tw nai rerman ogtoare pees Sossaecun uadtntandg of Pitcine nay tees syste to pint Egerance eens restora Sararating, ar maoane mabdenicn Ommorroaed EER chests. eins se mize acetone Mover aot, eon Sea cess a8 mgt sss Tantingy aD whe maw eas SNES memictns «Fctesct covet mageahn, goresonoe Goer sso monegnetst eee The Unt one serves ot fhe pinaswe mo Bw ew Pontos Sox Asations ABs Tre moana peacree detain ce oe wrecernty s miston af atta exoatios, Rehr mewatsn gad mney Serine ates ad gated ippican “ry Wnt es somgeomernie cerca vite anstostien tar is siagaring secumiin is the Mena llenroren ine ite stern cars ou cortices tari, Ts poate Satgton May De cevinen’ a8 eresssry U2 sone? tm camper aumet ef tid oreme ee emarsy Passes a ager Sem 0"
    },
    {
        "image": "unithead1_synth_8_aug1.png",
        "label": "unithead",
        "ocr_text": "Polytechnic University of PH HR Develooment Offce Mania 1016 POSITION DESCRIPTION: UNIT HEAD QUALITY ASSURANCE OFFICE Submited By: ya RANDY MARTIN October 28, 2025 Introduction: The ro: ‘encompasses the following responsibilities and qualfieations: Key Responsibilities"
    },
    {
        "image": "unithead1_synth_8_aug2.png",
        "label": "unithead",
        "ocr_text": "Polytechnic University of PH ik Daversament Ge owes aaanie “OIE POSITION DESCIPTION: UNIT HEAD QUALITY ASSURANCE OFFICE fohnatey pe, RAREN’ MARTIN Graber 38 B28 Jeneuduction: Tree enconnansne he Coben espormties ant quater nan Kay Ressonaltiities: Eeanne sonic maiariie ava\" eojarimars oper ae ane projnes “Panne Sete as el seis arco wah Ege Crees gown tae een. tt stan muaies fal it eis et irate esau te Wath. spate BE MITRE TS SURE HONS ‘anasar icme aatetens mn eacnng, entath a ny aN seeotes “Coven varia Sere wn eve {9a ssABy at Gavel owt» non ay Hue NEGATE RTH DEMEEEON fesvenres Bopewsge sear: stoves alee 3 wae SHR Seiwa» Pale cohen senses Wh em yaar HS aR arporunten Asress ster covet a erase Slay Fry sondeme vampetetciss asad edosnia daqrue a sean feta tn 2 sagrined mattunes AL Joes tue oh yours of bine onching axcetarae hse #Enewien Denonsbated eatertve axporshan seat ern oF semtatne 5+ Song evn af meseas, pubesatrs, and petals eaveuteon Eacetant eoersiniaaton, weamenona Bra sequnisataria: xe” Proven aE to Wore lotsvornny or Soeme wasenokeany Rrowtedge 2f CHD peste semadactan ston, and ghar adusaten beds Expartrnee 0 bute lagnagemeri ats lescure stewie» Consnrers eomteine exealens lenge and eararuaus wgcavemant Prareney me weucbtina cheney asa maagenre tartan wim «Yash mat Cain nk ate ae ssuien By CHED- Prefemnon given We canainies meh aSreanntve bait se cetacaon Reagan Gualtistons 2 “Toe tunt Hast nana a tn aeaice oF Woeraiy meee ae ease date 13 ‘ae Praia te Aaptaone #taes, Toa satin MnUPea Sate” we vetoes issn of anaes exSWaNE CENA nnceStON Are SORT sieve baronies ant sion ppkcarn ray wnt be somsennuewee BTN oe, seofeain trig yoe eter eer R Suet cecamanis ve Pa Mysine Renowtras GH Dey stendcwe cana wo Se tact er “This 2 ssrervinu. This aiion dasonpegn ae tap sPeAnG Os AUOROEY 10 anes Gop chapriny ncn a UGS GaseapeiTs"
    },
    {
        "image": "unithead1_synth_8_aug3.png",
        "label": "unithead",
        "ocr_text": "Polytechnic University of PH HR Develooment Otte Mania 1016 POSITION DESCRIPTIO! ASSURANCE OFFICE ‘Slbmited By: nam. RANOY MARTIN October 28, 2025 INIT HEAD QUALITY Introduction: The rie encompasses the folowng responsbites and quaifeation: Key Responsibilities: Enareive aominatrtvelacaraip ovr a Separment operon and sae programs Formate sate pans and oestves consatet wih cobege ans Covers gol» Reena. develop, sd tan quad fey and admistatve tf ‘cca resouces nein bude. space and equpment io Suppo deparmert, tarctors «Promote exzesence escnng. esexeh and communty etenson scevses Coornate ean Sevecpmen an e SCh 0 meet may a testa noes Inpementquty ansrance maanres and partite acorstaton frocessen Represent partment eteretscolge and wnverstygovemance Srctares «Foster colatoratve reuters wah extemal pares for stuaert coperantes «Ares susat concerns and entre caver of Guy acasemc Required Quaifications and Competencies: += Eamed Doctorate degree i relevant fed from a recognized sttution At least five (6) years of fultime teaching experience in higher education Demonstrated leadership experience in academic ar administrative roles ‘tong record of research. publications, and scholarly contrbuttons Excelent ‘communication, interpersonal, and organzatonal skis Proven abilty to work ‘colaboratvely wih diverse stakehoisers Knowledge of CHED poles. fccredtaton standards, and hgher educaton trends Experence n budget management and resource alocaton Commtment to academic excelence, Integrty, and continuous improvement Profeiency in educational technology ‘The Unt Head serves atthe pleasure ofthe Univery President and reports dec the Vice President for Academic Affairs. The postion requires decation to the awersty s masion of academe excelance, esearch nnovaton, and communty ‘tervoe, Interested and quad appicarss may suomt ther comprehensive curcun vane, apphcaton eter, and supporting documents to the Human Resouces Offce ‘Ony shorted candsates wil be contacted for intervie. This postion Gescrpton may be revised as necessary to meet the changing needs of the institution and ensure"
    },
    {
        "image": "unithead1_synth_8_aug4.png",
        "label": "unithead",
        "ocr_text": "Polytechnic University of PH HR Develonment Office Mania 1016 POSITION DESCRIPTION: UNIT HEAD QUALITY ASSURANCE OFFICE, ‘Submited BY aR. RANDY MARTIN October 28, 2025; Introduction: The oe encompasses the folowing responsbiies and quafeatons Key Responsibilities: Exercise administrative leadership over a epariment operations and academie. rogram Formulate strategic pans and objectives consistent with colege and “nwversity goals Recruit, develop, andrea quale facuty and adminsrave salt ‘Alocate resources including budget, space. and equpment to support deparment ‘unetions Promote excelence i teaching. research, and communty extension ‘2etites Coordinate euricutin development and revision to meet industry and ‘Societal needs Implement qualty assurance measures and pariipate in scarestation ‘rocesses Resresent depariment interests in colege and university goverance Structures «Foster colaboraiveretationships with external partners for student cpportunties Address student concerns and ensure deivery of qualty academic Required Quaificatons and Competencies: Eamed Doctorate degree in relevant field from a recognized insthuton At least five (5) years of fultime teaching expenence in higher education Demonstated leadership experience in academic or administrative roles ‘Sttong record of research, publications, and scholaty contibutions Excelent ‘Communication, interpersonal, and organizational sks Proven abit to work colaboratively wih diverse stakeholders Knowledge of CHED policies, ‘cereditaton standards, and higher education trends Expenence in budget management and resource alocation Commitment to academic excellence, integrity, and continuous improvement Proficiency in educational technology land management information systems Must meet faculty rank qualfcatons as required by CHED Preference given to cans certficatons ‘The Unt Head serves a the pleasure ofthe University President and reper Sect 0 the Viee President for Academie Atars. The postion requres desicaton tothe rivers’ missin of academic excellence, research innovation, and community service. Interested and quate applicants may suomi the comprehensive cursouum vitae, appicaton letter, and supporting documents tothe Human Resources Off. Only shortisted caciates wil be contacted for interview. This position desction may be vevised as macenaary to nase tho cher mwian. This position d"
    },
    {
        "image": "unithead1_synth_8_aug5.png",
        "label": "unithead",
        "ocr_text": "Apechinic University of PH UR tamara Ott ange 1956 POSITION DESCRIPTION: UNIT HEAD QUALITY ASSURANCE OF ICE Salona Ba» Getober 28, 2028 2 SANTI erection. tor sm anensanes te fimeng etsiies and gators Ney Responses: Eavine ascii -encwai Gir 3 Sepanrtnsepesinns a8 ata smoprane Farman hinge ps ss earn) oar oth nice Bh Sect gn Seen, ep daa ee Hae SO RUG Daseae Yevences Pc el SEE ame CRUZ WHS Sear ppatute «ico Geena NEN, FBeUEN a CaN ONAN setees Saardeate eee Povecetek Hr Nar 1 eet EAB at ove ete gies ate; aaah MaDe oh Rete wR froveston Bamana deserve! gestae cg ant eure ea Srurices “Foster woes recrsrgn wah ata pastoaes ar tt cneevumtis Acie Sten onan we argc Ser Faas Boat Ferien Catestinns ant Cenegetenctes Bama Doctorate Hegiee i nlevnn’ fd Fon a eso gnaad msttution AS east fee (1 yours of Sots teaching wxmenence wighar acusaien Deciontatad acarvhip axpecense 1 nondeie or aemmaniten ick Seong meu ot mseweh, cublestons, and sshalady eaneornane Ercetent somumumeaten, nimpsseons, and sngoneauenat seis Pen aby to eH coteavativnty eth Geran slakenctier dnawedge of SHED getces, reeds Marans gnc Mig? education teas Raperanine Sedget wneneganant ona esate alps Gomme aeaseme aerwTINce Integety, and eaninvioan enguevarsent Pasecancy 6 eoestcnal eenesegy rd management avornation asters Mist ate: fansity rank quadentons 69 requised 9p CED Prterance gran te ours eth wlearatobee wang Tas Une Haas verses at cleans of oe Usseesny raibant and rai iach 6 ne ine Precio tor Avasaene Airs. Tee paseo ezaree Season ve 8 ‘uneeys mince Of aexseene ane, ESOC ARSE Bs nse Serve ioteatue a tins aoyacaets rey yuo Ser ouigrebwevn eereors ‘rtae, posoation kas, ay auercring donunmry ia tne Homan Resouces Celie (On aravusted conseins wit he coneacted Wace, Tie soho dot Fe ograed 1s necceesry 16 meat ihe cheney Sekt af the Saez ae are"
    },
    {
        "image": "unithead1_synth_9_aug1.png",
        "label": "unithead",
        "ocr_text": "Poiytectnic Unversity of PH sir avatnonact seen POSITION DESCRIPTION DEPARTMENT CHAIR OLLEGE OF ARTS asst age ssn ART Gotunae TY, 2528 Hptradiucdden: Tee cosiien dneeesian eae th ates se cere See Kay Responsiuiltian Brice stag nara nd denn forte sagrtant Sige Jnotooep gous ond anaceme mavetance samen» Spr wat nite My steps. cr ETSI MTN AD man RANE TQeenree sumen éreeroan, mgt, 0S vRNA 9 nt sot eaurition davary ange Aspen eat, ACU and fies ped wenty «Fact vevance soeten, Coty sabia. ad se sats «Cosy we ih aS aS Hak aS Sacer worn wobroees rane Seabee DI om ATAS HONS, 1 Srecntons, aed ashen ae «La Soy MSMR, ANE, 3 iivre navenund asvesding ve aneahane weeds Fontes a jastive nec Reqaned Cuaieecaties an Commaneces ‘ecg (ENED) aparine asad Tak me smc iesty Jabsat age th yuan o eeweahs uonry and samissitico aspect Foiakcaron region m omen wit esnozat pttatins e aeenTeOwNe eS cress acpetnon vn geet OOP, CADE CS. oF IETS ‘Exceptonal aaimstas cares wt aby Bo neine ant tate earns 2G eernasd la ae vig to Dai cease ie AME A Cemmmarsine eeereantang o Paine Tigde weeaion eps vod weet Sepenaron G mind eeatere, Heh, as sneses nets» Damssustas Geonmitngs 2 Soershy, eat, abd matxae sxeeonee Pras2n sty ARS cirren npn ed mie ples »Yocoowuanyon 7y wh newpct vrameasene were» Frases SRrPhe Ts RUSUD, IRMA. AINE sovcetien canageroet geen “Toe egreesns Ma wits th 42 fava, ie wants to eens srry emcee mien ans one arin it anor PERS Jemcomarce cesaine a eomdantes Hane et asian tte 998 srromanoe meen, pico mus te WOM Suge the avers wa eruned gata wan fia (6) days Tr S B0g, Conan camer Teemnentn mans stasis vetting mentee cneertat, eens! cesta aac rmens, Fein panes ncerstion 297s #8 a uth He Toe enh wS"
    },
    {
        "image": "unithead1_synth_9_aug2.png",
        "label": "unithead",
        "ocr_text": ""
    },
    {
        "image": "unithead1_synth_9_aug3.png",
        "label": "unithead",
        "ocr_text": "iytechnic University of PH HR Boveuoment Othee Monte 1218, POSITION DESCRIPTION: DEPARTMENT CHAIR COLLEGE OF ARTS: ap aLtisow Mi eioves 2, 228 Intyoduction: Tas aes soles ues olen and enorme se todaes Key Responsibilities: rove strange lance sv eon for he sanwiment nag lnstivionaigiah ard scalenia necaierne suaes se staf yeronanes, excatuy orcescinal deveogene ard eominones uatty sdunaten dete Manage soya age, 250 aan ius, Sco eacam corsborwins Cinenite wih capa asin uote oes fer naitspens otter Enso cpnpinne i nvm poe, CED tepibiens. 203 aostediatan stands =a feeuhyreerstnec, pemabon 27! tenure pocesses aecaing i etattshad arcadia -Feste 4 postin 2A, ara hens sie ane Regina Chaifestons and Competencies ESD} manpage seas [Estasienie rennin m rasconah yh cuotntas pustiavnan poem eed aes leigetonce ae peugran cnuinaten seronmnent at op equngt asin Erccutins ieersip quains wi sy io sp nora #8 ond compratansive uvlertandag of Diappane ghey edvezton system ar pec Evoeraige maniems! rato, fostwenng, and eiawee meprision Lanonetates Swmnamant /e svarety equty, und moueive exaetonta «ova ity to mage scempiar pacts aud munis eri Teciateny giew ott Noo edge cur eaicalanas enevations «Pression! develope neers, governance shee se ansgarnet jetened pecormanee whemces. hgntcatoes miss asedowest pvtl win oer (2) says rom posing. Semple cocumentay regsremants must te tinct maining cates ese, seaessinal cores en oe cence tet pe ten ne totes sea"
    },
    {
        "image": "unithead1_synth_9_aug4.png",
        "label": "unithead",
        "ocr_text": "Polytechnic University of pay $92 Panam sca sere Mave tee POSITION DESCAUTICK DEPARTMENT CHa. COLLEGE OF ARTS Seibow seere PA Bn Sash cea a Bes eoteeess 2 Se, Po PR Nid Ste eg Seon 9 agnor wth mera 2 waters eaccdmce see Pt 98 mata Facaty ‘he Lassen Haag Serene seasene"
    },
    {
        "image": "unithead1_synth_9_aug5.png",
        "label": "unithead",
        "ocr_text": "Polytech ty of BH He caveinnment Ofer Sani 19 8 BOSITION DESCRIPTION. DEPARTMENT CHAIR GE OF ARTS Re Oecioher 27, 20 Introduction: TH son desorption cet th esas and agua 3 Helou Key Responsibilities shaship a cain fer te Separate agen wth (seasons onience stenseeds Sipeige and visuals fosty Sioee tone serare recesses socatcng to estabhsned procadines Faser 3 esiine watt Soreness a Reguiked Quatt nin eayise PAC EAD) sopra sez Pars exnararon a8 Drogen sonst nest: quater Hepasons koe 298 hy te Hell agnasnags amen ete erate Comrehensive ancastaning of Pigs higher auction 5) Experane in 5, fowasing, 21d se continent to sesty. aquty, av wckshe ecalnca Pray aokiy termnage x ejects ard mila pastas» Tecbnangy carey wie knowledge ct cument eojeatons: wopiatons Pistessonn cevagament ssi se sos to atone so se eSusion vil be ocd Bota in avtnas aos ao Say os. Apeboatons ust He suberiedteusge ta veri’ caine rates port wien Wea (5) days tom sostng, Condete soeusiticry vexgsrem be attached nedng scare ereceniss, professions ct"
    },
    {
        "image": "unithead2_synth_11_aug1.png",
        "label": "unithead",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES, POSITION DESCRIPTION. CHAIR DEPARTMENT CF ‘Sia iaeom ieants 1078 Peps LAURA JOHNSOH Mme sepaan be 27. 228 Purpose ‘The pevnaey Pwene ot Oee pension lo ede stage lerwas ant adniesaes Sremige for We eategeicaparmen i seecreaise wth the ninety s ninaon alen 2646 comm sams. The incumbent rprecite for fetta aeaderse rusetence amet tewnstnn mach Hs eaeaeth, ans est it; Veen saris, Tht denen terres as te che cease ad atmentanie cee De ok. enperabte er pening soyemarg. Sreteng. set euPatny SF yogi: Sd epuratont. The se ares soaberation trey. Ht sheen. and evn ction te abrance ‘Re ns eats and sertstete Yo enctutaral aBactvennns Kay Snetens rate SRR dete A IeBeEENT. Hoty ERLIMEN EAL deveipit’ eget managaners start tears socrtnation wel sorghanee wth CHED veplatons ant soestaton anew, The oncom hate mont asnanee 210r9 eaten. \\erca80m communicate 229 a8 comnts axtacces myrscemeet The Peano iaesents Be wat m Sey CANN, eta ponmernhi. ane emma ergagwnes, TO8 GOH Binys oa ym aerating Oe ys Authority Decision making ‘The conten telte han anaes 2 mate Seeaions ageing acateme pra. feteron masters, tty Regma, 20 cares mae nee EDs ret iver Devine and aaiguumy soneranee Ths menans suena GENE clorngs, tins SShaaoet. and Iny namloes Scbihveen Fea Rie, PME IE De GPO Pee ng CCAR a DOTNNNE HOES rs parton ard folded HAR. Ute nanny Dews e eaeem Accountaibitity The powton rer 8 accortaie to 9 Vee Reta he Assewene Mareen) Perse to cee unt garesoires, ashertrnes J arage yetones, me marieneree ef unr anaars Fegan repering ane oatemarne Oks0n mest ‘nacernig coewans at gam Het Pes Recon kms NaN Yonscenaas Le DERM MIRON BOERS SRO TITIA 48 Ian, 2 NeRtENRE trae smrvpy The ccumtent cua! semions e Smarty SF Rata Nant ceclance mm Morea pains and wec tees Ae soue asesaNaetty papier"
    },
    {
        "image": "unithead2_synth_11_aug2.png",
        "label": "unithead",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES POSITION DESCRIPTION: CHAIR DEPARTMENT OF Sta Meba, Mania 1016 Prepared by: LAURA JOHNSON Date September 27, 2025 Purpose “Tne pracy purpose of is postion 1 prove sategs nase and sonnsaive revs forth slegeldegarmer a accrsance wh he vvesy s MS8ON, v8, Ss eve vues Te neumbert response for fosters academe exelece fromeing nmottve eng ad reach and ensong cua ster serves, Ths fosten serves asthe he! aca ard aarinatve fice fhe on response {ournng ginny. Secing and erasing a pogans ad operates. Thee seoures eotazomten win facay sat, ser ne ereal sarod’ fe aoarce thents gas ne conrowe fo nttona enecbveness. Key nets nee Covclon seveogmen and assessment uty rctuamest an dveomer. doe smarogemen steer afarscoornaten and conplance wth CHED regains ane “eestaon sana, Theporton Peer moat dons stong leaders. Srceant communcaten stn andconmamert 9 artauces meroveret TH Seonbert represents he wnt a werty count ental patesNeS ad Conmonty engagements. Tha ponton pays a cnc fe avarcng the overs’ Authority Decision making ‘The poston alder has authorty 10 make decisions regarding academic poboes, ceurrewisn moseatons, faculty asignments, and operational mater with ‘stabished unversty gadeines and budgetary constants, This inudes approval of course ctlenngs, class scheaus, and facuty workload dstrbution. Final autherty rests win tne postion hoe for hang recommendatons. perfomance evaluators. ‘and personne! actions for faculty and stat, subject to unverstypotcies and cobectve Accountaibility “The potion nor issecounaie the Vice Present for Acai Ata Urversty Pencort fo overt unt pefomanse, aavenert of atepscotves and ovtrarce 2 quity stancoss. Rega resong 2d pfomarceevsuaton 255 Tidtcne efecoveness and go atarme Accouabuty neces face isons (Coupe maapener. eng soponrae we faces, ana martaning feat regey Tee nzonbent must emonstate stench ot palpate och a6 Conpusce wih fear polces and psa, Academe aceutabaty pate?"
    },
    {
        "image": "unithead2_synth_11_aug3.png",
        "label": "unithead",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES POSITION DESCRIPTION: CHAIR DEPARTMENT OF ‘Sta. Mesa, Mania 1016 Prepared by’ LAURA JOHNSON Date: September 27, 2225, Purpose ‘The pimay purpose of ths postion is ‘Students, and extemal stakeholders to advance the wits gels and contrbte to attutonal effectiveness. Key enctons neken Accountaibility ‘The poston holder is accountable tothe Vice President for overall unt perormance, President for Academic Attas Univerty achievement of strategie cbectves, and"
    },
    {
        "image": "unithead2_synth_11_aug4.png",
        "label": "unithead",
        "ocr_text": "POLYTECHNIC UNIVERSiTy OF THE PHILIPPINES, EQSITION DESCRIPTION: cHy Sta Mesa, Mania 1016 holly LAURE JOHNSON ‘AIR DEPARTMENT OF Purpose Tre soma upon motown mma $20 o cament nae Me cman 9 eh 12 Darang organ 190 eases OM a fos m9 2 researc ars enemy Ran 29. aces eroces 10 aovance roumnertraeesees ine nt a Vv ergagenents Tos posses Authority Deci Accountaibility The box ton noe 360"
    },
    {
        "image": "unithead2_synth_11_aug5.png",
        "label": "unithead",
        "ocr_text": ""
    },
    {
        "image": "unithead2_synth_12_aug1.png",
        "label": "unithead",
        "ocr_text": "a ATENEO DE MANILA UNIVERSITy ERMC DESCRETIN DEAN COLLEGE oF Loyola Heights, Quezon City 1108 Prepared by: DANIEL. JOHNSON: Date: October 07, 2025"
    },
    {
        "image": "unithead2_synth_12_aug2.png",
        "label": "unithead",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY POSITION DESCRIPTION: DEAN COLLEGE OF Loyola Heights, Quezon Cty 1108 Prepay. DANIEL JOHNSON Date etone 7, 2028 Purpose “The sontonsestabshes c poue sna leadesne and eects maravenet of tre aeaseme wnt ensung every of gray eBveson reeaoh and etenson Teves Toe neuen! oncbons as te prmarycecwonmaker ad regresenate cf theuet nna an extern frome, Coe responsoutes cle sates 93rnng pegon sevecomer, esoove naragenes, ans ant a 7aree The postin Ne thst ens tat burt actvtan gh zh omen sles, CHED marcas, ae Povessora screiaton recovers nae martaneg academe Freecom 23 Stora asanomy Toe waures autng pe mactanng sostve eatenstes Tir cucesty aomousvavon estema panne aur ane conmany stare’ ‘as eves repesering Ie vos nfusraang atte, aus parreshos restore ctabraors, ard sternatona inkapes, Leese essnsiies (compass foutycevecomest suset soseas staves, caregum 7ov3ten and scoeozn paucity exarcenest The peanbert mus eat an sve SERS aues suesey sonar enoy are separa ne aotesnena ponth Authority Decision making ‘Ths postion exareises avtnnty ever all academic and adminsrative funcions of the nt, neluing pogam planning, faeuty develonment, and resource management Decisonmaking comer extenss to matters creat atfectng unt cneratons wie aoherng to Unversity pons ana governance svctures The neumbent has auterty to estaban unt peices. procedures, and prortes consstent wih insttviera gudeines Ths ncludes deosons on teaching assignments research owes, and Accountaibility “The sonton ors sezounaie the Vice Pender for Reason Aan Unversty Teacont ta avert unt setomanse anevenert st satepscoastves and Torecace of uy stondaas Regia egong as petomarceevaatonaes8 TES caccrseness ans gon ata Accovomuty neces asa isons toca maagenen eaeng spuorse ve d eseuces are mariana farsa Negey Tee nzonbent mus Senonstate senaisn of palpate feck a6 Conpusnce win nara plces ana pocsaes Acaeme acouabety pmei2"
    },
    {
        "image": "unithead2_synth_12_aug3.png",
        "label": "unithead",
        "ocr_text": "Peewee atasanemar es 1EO DE MANILA UNIVERSITY AG POSITION DEST! Fee Ranta, Corse by DANIEL Parpote nn ey pry es ec ee a Se ines RITA cane nagenszibes cevaie state SBC. ee enacted Rec ats OH SEY ESE wane et Fr aan seeten ai io cess pees, OED Nest: FE Terentonal acceediabon ourenens leg en a ve naam, Tee in rags rg wna NaS acer! perners, ane ene mu BY ‘jewines To cenbes f fe unt nosed een co wniersay anes rng en ag ME, EE esis gesaies acon esianaraions, ses veerati! RENTS. aa any drome, ase! sssezn on, run mes SE secrean ncenny esparsamert, Tha nent es an asi eae nr vss vest rns Meaty, #8 SHaRURY HME ASH nutizority Becislon making sone png pen, Sy EIN wat ‘Ses nating pos antes ne rains casey ae sere ie uncrersty aces and pernaree st nt onan corse th do ents ne ASST, ORR. ech pies, aes hone ro nena deans aero aioe» Acconntaibility em enrie saamasse fe Yo Biss fo eaten RS mooring wed Dat 62 ARID ABN Takaty cba Mee eens se, gd maisaaneg So Presi tor orev ur garrmanc. #6 Iramonanee fussy owsaese. Reet ‘Dheshin tarueant 2 goa aman, A cee nodget emer, IONS HOUTA we THT cage Toe teroban ri cera seis FO ace eon Gnaceel pvaies sponau, Resse 80007 evan fas Pape"
    },
    {
        "image": "unithead2_synth_12_aug4.png",
        "label": "unithead",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY Erenices AMMIMIGTOA TER” COLLEGE OF Loyola Heights, Quezon City 1108 Prepared by: DANIEL JOHNSON. October 07, 2025 Purpose ‘The postion is estabished to provide visionary laadershp and effective management of ‘he academic unt, ensuing deivery of high quaty education, research and extension ‘seevioes. The incumbent functions 2s the pimary decision maker and representative of ‘he unt in intemal and external forums. Core responsiites include statepeplanang, Program development. resource managemeet, and quaity assurance. The poston heer ‘must ensue that al unt activites aign with unversty poleies, CHED mandates, and ‘rofessiona accredtaton equrements whie maintaining academic freedom and ‘esttutonal avtonomy. The role reques bulking and maintaining reductive relaonships wth university administration, extemal partners, nn, and community stakeholders ‘This includes representing the unt in fundraising actives industry partnership, ‘esearch cofaboratons, and ntemationa inkages. Leadership responsiaties ‘ercompass faculty development, student success intatves, cumcukum innovation, and ‘esearch productivity hancement. The incumbent must create an incive ‘evvronment that values versity, prometes equty, and supports the proessionl growth Authority Decision making ‘This postion exercises auhorty over al academic and administrative functions cf the ‘et, including program planning, facuty development, and resource management. Decision making power extends to matters eect atectng unt operation whe ‘cheng to wiversty policies and governance stuctues. The incumbent has authrty to establish unt ptcies, procedures, and pronties consistent with nstiutonss \\iaelnes, Ths icles decisions on teaching asignments, seach prone, and Accountaibility The postion holders accountable tothe Vice President for Academic AMfas Universty Present fr overal unt prtomance, achievement of strategie cbectves, ané imatterance of qualty standard, Regu reporing and peromance evahiation assess leaderahipeectveness and gol attainment. Accountabty includes sca respons tay {or budget management. enssing appropiate ue of resources, and manning faancit integrty. The meumbent most demenstrate stewardship of pubic prvate funds and, Complance with financial pokies and procedures. Academic accountabty"
    },
    {
        "image": "unithead2_synth_12_aug5.png",
        "label": "unithead",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY POSITION DESCRIPTION: DEAN COLLEGE OF Loyola Heights, Quezon Cty 1108 Prepared by: DANIEL JOHNSON Date: Qetober 07, 2025 Purpose Tha seven sentatiaes poe visa ase and effec management re comme wna ese snr Nay ean, EA a exter Mevocn Tne seomoer ciara mh pay Gecsco mat! 28 Bro aitona on ene fevers, Core responce roe oe serronane wxcove manager ego assearce The poston he Re caine oc mes gy nth vty posts, CHED mandates, 2 cet scewataon eqormert eae matanag aacene fede 28 sa tegees baka nd mararng prosave rtorshes na onmeny sates pete rcompass facuty development, esearch productvty enhancement. The ncumbert Crovonment that values diversity. promotes eau. Authority Decision making secses naorty oe a acacens and aéminstave fnetons of he ae renner magn pannng fauty crvecpmer, ag escurce mangement ee pone ener to mates ere atecing nt epratons wie ne sty ana govemance stvstaws. The meUnbct has aay a ec pastus pennant ports conan wih estar wefan cewoes orca on tac arent, search rate, a Accountaibility srsoreon hier accra otha Vie Present fr Aca tars Une TILED eu wnt poromance sencvenest of seatepe ceive, 294 eetmeance of aaity standards, Reguar reporting and perfomance evahation a44655 attanmect Accourtabity metus fiscal respons ty must erate an nehsive rd sunpars the professional gowth {er budget management. ens0g rege The neonbent must demonstrate sewarsne of paiiprae fines ad Conpuance wth tnancial paces ad procedures, Academ aeccutaty"
    },
    {
        "image": "unithead2_synth_13_aug1.png",
        "label": "unithead",
        "ocr_text": "TY OF SANTO TOMAS AR TIMERS Purpose wes ane morse ng Authority Decision making tee ovis ad: Fay wNDDETy TOMBE GANNON"
    },
    {
        "image": "unithead2_synth_13_aug2.png",
        "label": "unithead",
        "ocr_text": "ores nt a MORN spt Fh ease were 2 eae ne sh atta senage apace Peet tty Tn ne ensepants a Stee, am pre eet piveg cutie ‘Wonbece Sarvs 98 ing magi He Hades whe caver cote ames ie oe Sakata eepgerent Toe Seton, vasectizning 2f hpyinn Wane ynaes The 8 ROWE, 26 sebaboetnn Sempating sitet, aay sence BNOM Wt tebe set atmo ca ee, ‘easecrh eae ith te ask. Toe Seite eargize ng fae of axeaten rhs must ere 1008 Fonte Hotahoites, aed mak Sativoriy Decision making 9 eS tty i deine reper seater putting, 7, aR eprcstong Roses seciisnianin, The"
    },
    {
        "image": "unithead2_synth_13_aug3.png",
        "label": "unithead",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS POSTION DESCRIPTION: CHAIR DEPARTMENT OF Prato rreo erence spate Bovevard, Mansa 1015 Prepared by. BEVERLY ROLLINS De: September 22, 2028 Purpose"
    },
    {
        "image": "unithead2_synth_13_aug4.png",
        "label": "unithead",
        "ocr_text": "UNIVE! RSITY OF SANTO TOMAS CHAIR DEPARTMENT OF Sestomter 2 262% Purpose co exits to bad a ns ob anges fie seen 2 as ope cag sive gg Stans ve uncompasas seanuin epderenip, soneisinte ‘essing aigonan wih netstat 2 eccateeal sy. Th yansgeren, a! shisteg shaving responses, The nsuiert serves #5 the sy oa ane rears te 2 ots. This cote seg sarang ram serenpry sofas helio naive everseng aoasenve ety psonsnce anager, veica ch aueaton, 3d sitkerolter wgagemment The aaores expertie ghey adoraion nitrates, endestanding Pr ans gabias 306 abby 9 nau oompian cryaizatona: dynanigs. Toe rises, aage inane lsscear ni nemanss ‘aterng eum ol eazstance Sonoran, 8 05 tha suppor beth set auto and inten! Authority Decision making Tne gestion ae hay ety nae sacksons gaming satan cones euros maskicaions, “ascty aesigumen, and quertinat moter witha ‘uhiarene 9 bodgelay sameracts, sna marepaseray wShancil decison svaking, The revo sjaet wou, Sess 3"
    },
    {
        "image": "unithead2_synth_13_aug5.png",
        "label": "unithead",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS oat Purpose oe comes gar"
    },
    {
        "image": "unithead2_synth_14_aug1.png",
        "label": "unithead",
        "ocr_text": "POLYTECHNIC UnweRsrry of ROSTRIN DESCRIPTIOHY Sia, sean Prepie P28 pow 6 Saas ri 2 iterabond cae Marine tcaly Sntannen tees swan jndssiey eaters re SC BF wats oy. pemnes a oe Authority Devidan waking S008) vase 3 soe a St roe Saute ‘somber nas ‘csnencee Seige aaeastes, Hx mune Otel tla ee saree, sae os THE UALTTY assuRanoe ORIG Ere eicahee #8 cms etsesoae, Petals pameer in, Seater mapas 2084 Wind, esta 00m a ones OREO 0 petaNatea poy SN, The gi Bee ate 1300, te acy theta, cen sexton. snd anagerea, som atiatnw as, ere eer matt ansears Ter anpesatins, naive Cte to Cagummin pe"
    },
    {
        "image": "unithead2_synth_14_aug2.png",
        "label": "unithead",
        "ocr_text": "POLYTECr TRIG UNIVERSITY OF THE pap faa ste TORIPTION: HEAD Quai ry sSauRANCE Si. Masa tants Hage Pasties MALES gape PRE cess 38, ae 5A Th pate pene SHED mandsies, ws ae ouirtsingscaparsx tee ace ct ttt 8 nites hiking 8 aaveaning pene enemas ena orton, hart, 34 eomny sateney ‘ite cba any Wk ae Bien th Bcheasiena ascredtaion guerre a Ted chases cepreems wis petsies Fenech sweaes 3s wabanen ae ‘rina ta aises Honey Phe sesenierd mat opeaie as nehnere FON Sat, ant Samp 9 Authority Decision making ASPs eat oe Gost ot ucts, spnacone Sohatny acacamis Fechie tasata utassen ore pesemm mangers rate hae Toe ‘oso wae imines Seinen or mae wacertty snyatscon se gen ty to apevare epee, Se heat niin spec elutes resp ade Seorugueaes, cewealecticenees, ne maximzanon abt mt hy aarene Sopra Wt rasan of avin ste natin apsssace a zane. ant anevne Demectons snc im ai Faas soba, Ton seserar"
    },
    {
        "image": "unithead2_synth_14_aug3.png",
        "label": "unithead",
        "ocr_text": "UE RM er Bae POLYTECHNIC Uaiyi SHTY OF THE PH ined, Ss POSITION DESCRIPTION HEAD -aUaL FY ASSURANCE Beeometes sanciaRk ste, Purpose The gostion is anabiched to nite i SE SASTw e804 etry oe Maga somone Servet, Te cmt fnctars 88 tae poe he sens ans eaten foo srogran devon Bites accra, mea wo a ca, ME ws eke at acing atetag en ms Jer SeOMY Mtns, extemal parse, somes een Mm) stkehoiies THE Eh steering het i neraaany noes ey paashss canes NON. senate manos Insc eee wi sty devdasnnnt. ssietseconts inten rere ‘seat prosscswny antaaunent, Dy aces end etribe sanagernin of vy deosionenater ad eps or apa ete 2 8 aing Phx poet nicer San wn wsiety pening aS oats whe mast acaienie Puthority Decision making Aonbecty 2 eta ine sable. etcince wnat i ad pescnninneene, me makes een drone a Ses ated sats apn omneicd e wi tena inv mgroom oewatena a Acconntathiiity Pw. The te Seats. sem pan 818 Wh UNS positon fe ane wheetnee, search oeskKarn ries os etecierens i easerseg sion we shakey gintias Paseo RENSPECTA, tostelactionsa, 266 maxmunionee oan 8. The aeaticn foie mst sscount tr cupnadinven rota, \"PN rg sete od bn 9 yooh raat 1% seatenin ONY EnguceMEe. THe zeus mrogEtrer, end ateareeecant ofS us seceareat at"
    },
    {
        "image": "unithead2_synth_14_aug4.png",
        "label": "unithead",
        "ocr_text": "POLYTECH Y OF THE PHILIPPINES Posi ON DESCRIPTION: HEAL: Sie iiesa, Mant 1016 Dopovelbs MBUREEE Dae corona TY ASSURANC: Paspose ka sm aes aber win une a8, 8 teointen euremgnt 8 i svioramy. The 20 re sy croetas aguty, ane svoazra ne Autwnity Decision making: agtch, a8 2esate ager sa powies Ine runtaet"
    },
    {
        "image": "unithead2_synth_14_aug5.png",
        "label": "unithead",
        "ocr_text": "POLYTECHNIC LINIVERSITY OF THE PHILIPPINES RIPTION: HEAD QUALITY ASSURANCE POSITION DESC! St. Hens, Sands 1926 Peano hy: MAUREEN SARRERA eae: of, 78 Purpose npn che oe very tsi eve macapet Sevouners wi eee ean hy een, Sunt al et ener te. Gte espera eke Shae cis ragares tang ane marsasvig pocntvs cestonaige ih ney seronasain een sorta, Shao, BE commmuy ameraitee nies, aay pater, sodksiin enzecsies eoronipass fanny ateiagmers, state Suceaze Man, cumton eiorabe, a search pedaciety er set mest asia Hose Authority Deciston making Wis negated seth to age apes emanes, uze rave, wd er gS 2 Funes Wat arena trig stonatzas. Mig aigarseees. naw pevaans, and Accountatbility Sra aie eins on opacrns Snes teen opiate"
    },
    {
        "image": "unithead2_synth_15_aug1.png",
        "label": "unithead",
        "ocr_text": "ES _ O DE LA SALLE UNIVERSITY MANILA POSITION DESCRIPTION: DEAN COLLEGE OF 2404 Taft Avenve, Mana 1004 Preparedby IAN BARAJAS Date: Ozteber 22 2008 Purpose Authority Decision making ‘The poation holder has authonty to make decisions regang academic polcies, cumrovtum modticatons, tact assigements. and operations matters wih ‘stablaes university guidelines and budgetary constants, Ths includes approval of course offerings, class schedules, and facut workload datrbuton. Final autherty ‘ests with the postion holder fr hing recommendations, pertomance erataons 204 personnel actions for facuty an stat, subject to unversty polcies and colectve ‘acherence to budgetary constants, and transparency in fnancial decision making. The ‘mumbent mast jstty expenditures, demonstrate vate for investment, and manta Accurate francia records subject to aude. Academe accountabity encompasses ‘tied"
    },
    {
        "image": "unithead2_synth_15_aug2.png",
        "label": "unithead",
        "ocr_text": "DE LA SALLE UNIVERSITY MANILA POSITION DESCRIPTION: DEAN COLLEGE OF 2401 Taft Avenue, Mania 1004 Prepared by: AN BARAJAS. Dae: October 22 2025 Purpose ‘Ths poston exh to fad and manage a aspects ofthe acaceme uns operations, “mrtueag agement with nsttutoral svatege objectives and mactannng high standarss of ecucatonal guity The rie encomsasses academe waceshe. seminstatve ‘maragemert, and statepe panning respons bites. The ncumbent serves 38 he rncialtason between the unt and unversty sgminstraton representing the nierests ot acuty. stall and stucents whie aovaneng nstzional goss Ths menses partcpaton m unversty wde committees, poicy development, and s stege planning itatves, Essent functions nvolve overseeng academic sroyram ceveopnent ‘scuty petomance maragemert resource alocston. ane stakeholder engagement The postion equres expese n higher eaucaton sommstiaten undersanéng of Proce ‘veatena poles, and abity to navigate complex orpanzatena dynames. Thy Iescerane rie cemands fosierng a cutie of excelence, mrovaton, and otaberaton ‘thin the unt. The neumbent must balance competing rocties, manage averse akenolders, and mate deestons that suppon both unt autonomy and nstivtoa Authority Decision making ‘The postion hokey has auhorty to make decaions regarding academic pokes curecken meceatons tacuty assqrmects, and operatona matters wane \"ntebinned unversty quceines and budgetary constrants. Ths neces approval ot coate otengs, cass scheckies, and faculty wonioad Satroaion Fea autnrty ‘sts wan the ponton hid for hrng recommendations. peomance evavatens, 273 personel actions for facuty and staf. sub to unversty poles and conectve Accountaibility"
    },
    {
        "image": "unithead2_synth_15_aug3.png",
        "label": "unithead",
        "ocr_text": "DE LA SALLE UNIVERSITY MANILA. POSITION DESCRIPTION: DEAN COLLEGE OF 2401 Taft Avenue, Manila 1004 Prepared by JAN BARAJAS Date: octovar 22 2028 Purpose “Ts postion ext tle and manage a apes of the aademis uns operations suring aigement th stutonal sate objectives and mating high standards ef educatonal quay. The le encompasses academic leaders, admit management, and statge plain responses. Thenconber serves 2 he enc Eason been the ut ans onversty asrntaton cereserng heiress of facty, sa, nd stucets whe avancing nation goals This notes bartcpaton in west ide commites pleydevdepment. and sate aming ‘tates. Ester nctons move overseeing acdemic progam Sevecpment {seat peomance management, resource sceton, ne stateholer engagement. The poston regres exgurine nigh eoieaton amination, ndestanng of Papin ucatoral polis, ad aby fo navigate complex organizational dari. This Ics le Semangs foster a cote of exces, imvatn, and clabraion sn te ot The ineombert most bance competing pts, manage Sere \"akenoers and make Sesion tat suppor beh stony antral Authority Decision making The postion toler has ator to make dein earsg academic pokes Corti medfestons, fay stigunents, dopa mais win ‘stsched unvesty guinea and ugly contrat, Tha uses spot of Coase ofesge, cars shes, and cy Wood extn, Fa oy tts wth he posto herr hing recommen, perfomance e katons td pesca aeons far acy and tal sect toes pss ane atesine Accountaibility The postions ecole fal specs of unt pera lag academia oun seces nay devcopmer ane erative cee) Eaton xis ce osiever of eseished yous, efecive este zane enone ‘attra main, Fal sceettyreqeee pet aed anager Zinn o bogey constants, and tarspareoyn ean decson making. The iebert met iat epentres, emorstte vv for nvesimen. ond marth use ancl eos suet san aden cout excompssses Page ter?"
    },
    {
        "image": "unithead2_synth_15_aug4.png",
        "label": "unithead",
        "ocr_text": "DE LA SALLE UNIVERSITY MANILA SITIO IPTION: DEAN COLLES 2404 Tati Avenue, Maris 1004 oy: aH Bal aera a s operates, aig i sins aunnageiee, sr ‘pscing Saas tata te uit ae emus a ff faut, sal, and civaners ate aevating ettaional yes Ths inusee sagie pling ure sate ooerseeng a son deeopiert yee oration, wd The eee cexcentsa in tigher edesation ainiistaton, unecrtadey ot Phigeine iy i navigate con ex cgzetinac dyramn. Tt soy 2 cokare of exowanne, iewwsien, and extortion ety stesso goes eth uns atone a stan postion req Deciston moateinas Sie yO cilaniohas unwary usaieas sso eng, a8 ee ees Accountaibiliry om sehevenere of eataninree gone, efectve renour ohana meson Figen anoint Hireroron to outa ora sil dering, Tad bert auoeidtvmas, demeostss vias fr nnestnent and mann bs aia fo uk AesoaM agora emnorsaaaes"
    },
    {
        "image": "unithead2_synth_15_aug5.png",
        "label": "unithead",
        "ocr_text": "EE DE LA SALLE UNIVERSITY MANILA POSITION DESCRIPTION: DEAN COLLEGE OF 2401 Taft Avenue, Manila 100 Prepared by: IAN BARAJAS Dale: ctoee 22 2025 Purpose Thi poston ex oad ad mag spect fthe casei t s epee, Tung angen nin stir! Satepe copes sa mavanng hg sans Secon quay. Theme encmgaies dade ash amine Scopes a svaege pang responses Toe ncumbert eves 3 he napa tance bencen ent at covery aaminseatn repeserng the terest asaya and sets we ar acng rtnanal goat Tas ches Sorsogon saverstyee commie. ply evelopment, and sates Paning ‘ves Essent tectens ave ovesenngaeaomie ogram Seopa ‘Seon petomane mangement. ressuceszaton ans tanec ergagenet. The Serccagos eqse nipe ccnaton amnion, ndetanang Pagpe ‘Strano, ne yo savgate compe craton james. Th iciip oe senansesteng oer of excelre, mova sr eatabraton ‘Tanne sn Tre nanbent mus bales comping pts, manage verse oneroces, aw ate ces tht appr toh ow aaoromy and nen Authority Decision making ‘The poston holder has authorty to make decisions regang academic poles, caren modfieatons, feulty ssignments, and operational mater wih ‘stabished university gudelnes and budgetary constant, This includes approval of course offerings, class schedules, and faculty workload fstrouton. Final authorty rests wth the postion holder for hing recommendations, perfomance evatuatons, “aed perscenel actions for facuty and staf, subject to university potcies and ctectve Accountaibility The pontion cco fe a aspects ow operons ning seem uy. Treci necese tay Secopmen, an aannatave etic), Evasion fees Setter ot enataned gus. eesive reste azaion sn cob 2 Sofmnora mason Fea seeetabyeqzes poset rare maragemes. Ser ctu sven, and tarepneny a fare cessing. The FEETE Rites eaoenaces cmonstate ve fo neesimer ans marian Senate taangal ears sje an. Ace so tby encompasses Page 12"
    },
    {
        "image": "unithead2_synth_16_aug1.png",
        "label": "unithead",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY POSITION DESCRIPTION: DIRECTOR GRADUATE Loyola Heights, Quezon City 1108 ‘repared by: CHRISTIAN GOLDEN Dale: ozteber 18, 2025 Purpose ‘The positon is established to provide visionary leadership and effective management of the academic unt, ensuing delivery of high quality edveation, research, and extension services. The incumbent functions as the pemary decision maker and representative of the unt in intemal and extemal forums. Core responsiblies incude strategie planning. program development, resource management, and qualty assurance. The postion holder ‘must ensue that all unit acts aign with university polcies, CHED mandates, and ‘professional accreditation requirements wie maintaining academic freedom and ‘nstavtonal adtonomy. The oe requres bulng and maintaining productive relationships with unversty admestaton, extemal panners, alums and community stakeholders ‘This includes repcesenting the unt in fundraising activites, ndustry patnershin. ‘esearch colaboratons, ad itemationa inkages. Leadership responses encompass facuty development, student su2cess intiatves, eumeutum inovaton, and research prosutivty enhancement. The incumbent must erete an inchusive ‘enveenmant that values diversity, promtesequty. and supports the professional growth Authority Decision making ‘hry i vee ih onion fo yoy operators ecg academic sete. esouceulzaton, and penne! management win the nt. The ‘Deane mates nependet datos en ane atrs a cones wth teeny adrieon ensign poy eee nce The po dar tas dagled ahoty to appv cpr expenses, mince ravel and manage (ea hou win spony gt seas Map expends, ne pln, sd Accountaibility eco ets wth ths poston or ahievng ut goal rated fe eadeie trcelence, seach pedutvly and communtyengagumart, The neambent Crate on cfecoveress nese, managment, an fvacement fhe us Tani wd sate plies, Pranidsveosliy chs espera gt ‘eau cettactrenss, ed manicaten of aati mamres. Te potion telder mest scent expenses, mantan appropiate ocumeran, sd ernie englonce wth ning earnest aniston ani pts. The neuen Papi"
    },
    {
        "image": "unithead2_synth_16_aug2.png",
        "label": "unithead",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY, POSTION DESCRIPTION, DIRECTOR Lesyote Mente, Gueron Oty 4106 Rapid: CHRISTIAN GCLOEN BAe oxrabe 8b, 250% Perpowe Toa prion cheb tc vlna fei sd eect Mannose Cee conn tery ong eats Rap a ets ee rowan hckane ae pat ca ke mp ty mearce. Th pt er the vt in ina etal fo ronan seeatgwind, pease MEEgSTE, a fon esi Sat Bn at aicg ap with amnesty feteenann seoteaalin careers whe miahang acetic teeton and censors coe covey abner san, exer parsers, ues ad omar StabaRvAte Tae ites sopescvting fh unt fdeanieg atin, ests pares, sesnaniestanoeatons, an nfemnstors Sewage, Lepdartiprezz0n ues seornan, sce? soxanes eas, eankdem veowaten, a6 sththnst apenenny To tie ue Sale Eo aang sacipees tty poenah peohtndy ersten Toe icenbark ut cease an tive Sircormest hen vues enzesis poonates ei, nd surpats the cession ror Authority Declsdanmaking Mhouieg seuss ect cd satel mgenac ee, Tt Seirectmanes cements rotons care rans andr SSrraiy cimvinrc v tiatcne pny amas store, The penn se wr evann same ong aeanens Mayr eases, ma. Agcountalsiiity ‘pevecama ny rast wn ie ponies sehen ot gus slate io ane pear, reams net, 298 sens emigre, Tha tewribent ‘Fouares on etectwecanss a lexbiebie, maragienstt avd sivancemet Pr Us hiasnn ana aratagis ames. Financ acnsuntbiy mates rszoraie Bae canaguuen, sostetiacdvoness. an suena of acuatinsexeweas, The geiian noite mt sev fe eapeowteneh, matin sgpcetite scree, 8 882 onvplonan win acing ceqsvernens et ctitanal fei maken, The now Pa tae"
    },
    {
        "image": "unithead2_synth_16_aug3.png",
        "label": "unithead",
        "ocr_text": "aU ATENEO DE MANILA UNIVERSITY eres on etecovenens 0 ase, crtuen and seaage prontas, Fare _ crragenet. costattectvenens, \"aed mamizaon of eat \"Toe poston inaeean serene wees aces. The neem"
    },
    {
        "image": "unithead2_synth_16_aug4.png",
        "label": "unithead",
        "ocr_text": "NIVERSITY, FOR GRADUATE, Lovie Heights, Quezon city 1108, Paaparot 1ST HN Purpose soe seadenie ust, emicy Sony serenvon, a0 sitar soiuees, The gnu fess as the pina easton aa a os sessgrasines noun eens ane sragien cavmgiany, esourre mianagemian, one gay a 2 onsian Noise re ent incr a wt ie tht 8 sor ates Bw be ae race ng nd mabtansng erngint wry sais. pofezcenat we mstaiing scadainc ee re wrens aomnstemen, extn pana, ahr. and eon lassi vndusiny mitanoement Toe novinbens Authosity Decision maki ‘Aheniy ts vest inthis pension fr dey tony cpeeatens beeing armen fsengtnd wiaes maeconsact dein siiesty atminatation on sien pokes ee Ban buts Seegateg strony to ascnn ines tn annownd Uist aon Acosuntaibilin Accousnabty sass wth ths postion or aotiaving uit gous relates to readin n remus a8 comiionty age Messe in adap, esaeene. ss} ndeangkaneel of he as subi noha sutra onget f siatase rears The reson sada sien eiyerses, aue 2e ave ad varage use aipenas sion and stress pve. Posen a syegsites, msn soar dooaer cumpancs win avkieg requiomests 204 nstesisatfeansal paces, The ocenests"
    },
    {
        "image": "unithead2_synth_16_aug5.png",
        "label": "unithead",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY POSITION DESCRIPTION: DIRECTOR GRADUATE Loyola Heights, Quezon City 1108 Prepared by: CHRISTIAN GOLDEN Date ctor 1, 2028 Purpose ‘Tne pons enabanes oso soar leases an festa management of the scaderc unt ensuong diver of gray etueaon resach and evensin aed external furs. Coe responsties eldest paring cst enue tat unt ate gn wan onversy sic, CHED mansites, ns Detessonassrstatonegorments ne mantaning adem freecon ans nstttonsaonomy, The ro reaures Song ane mantenng posite retook vith wives anita, etenal partners, aun and commun stale ‘Ths nce epesering te unin drain atv, nny paresis ceseavncoisoratons, ans ntenatoninkages Lscesh responses research productivity enhancement. The incumbent must ereate an inclusive ‘envionment that values versity, promotes equty, and suppers the professional growth Authority Decision making Accountaibility Accourably ests wih his postion fr ahivng unt gol ltd io academic tercelnce, esearch prodvetvy, and eommunty engagement, The incumbents management, costaflectvenes, and matmiaton of avaiable resources. The poston holder must account for expences, manisnaproprate documentation, and eneure cempance wih audg equreenis and wstiona mania poses, The neunbent pmeio2"
    },
    {
        "image": "unithead2_synth_17_aug1.png",
        "label": "unithead",
        "ocr_text": "Le IVERSITY OF THE PHILIPPINES POLYTECHNIC UN POSITION DESCRIPTION HEAD QUALITY ASSURANCE ‘Si Mesa, Manda 1016 paserred sure Smaart wh mann ROT ponent Traces oy ree comeanses seaseme Masene anne venan Toe wvenbert reas 38 seccess, (a0 ace wtbzaten, and corer rent teases gos, eet mo maragenert sr maven Face mecceabity eas Pe co a tnaree SeenennaheG"
    },
    {
        "image": "unithead2_synth_17_aug2.png",
        "label": "unithead",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES POSITION DESCRIPTION: HEAD QUALITY ASSURANCE ‘Sta. Mesa, Mania 1016 Prepared by: JEANETTE SMITH Date: october 08 2025 Purpose This postion exists to lead and manage al aspecs of the academic unt’ operations, ‘ensuing abgement with nsttvional strategie objectives and mantaiing hgh standards of edveatonal quaty. The role encompasses academic leadership, adminstrative ‘management, and strategie planing responsibltes. The incumbent serves a8 the ‘recip lason between the ut and unversiy administration, representing the interests of fact, stat, and students whe advancing institutional goals. This includes aricpation in university wide commitees poicy development, and strategic panning Intitves. Essential functons involve oversesing academic program development {aculty perfomance management, resource alocation, and stakeholder engagement. The positon reques expertise in higher adueation administration, understanding of Piippine ‘edveational poles, and abity to navigate complex organizational nami. This leadership role demands fosterng acute of excelence, innovation, and colaberation Within the unt. The incumbent must balance competing poties, manage verse stakeholders, and make decisions that support both unt autonomy and institutional Authority Decision making The postion Neder has ater 0 mate ceiions rearing acacemic soos, cxereum mestestors facut armen and opeatenal maes wna cstanahed uiversty qudeines and budgetary constants. Ths ncdes approval of course ctlerogs ass schees, and faeuy wonlesd strbaion Fl aaorty ‘ess won te postion hale fox eng ecormencatons pefemarce exauatord aed price! ators fr acu and ta suet unversty pees an cost Accountaibility ‘The poston accoutable fora aspects of wt opratons neg academe uty student success facut developmen, and ssminsvatveefcency Evauaton focuses con achevement cf estabeshed gas, fete resource tsa, and contro fo ‘ettutonl mason. Fiscal ccountaiyrequres pret fnancal management erence budgetary constants, and varparency i franca decsonmatng. The Incumbent mus sty expenses, demensate vate or vestment, and mata accurate financial records subject fo aust. Academic accoutabity encompasses age 2"
    },
    {
        "image": "unithead2_synth_17_aug3.png",
        "label": "unithead",
        "ocr_text": "PHILIPPINES POLYTECHNIC UNM POSITION HESCRIETION 4! SPY ASSURANCE Sian bees, Marts 194 Paelbe SERNETTE SUNTH Oatebe 98, 202% Parpose the oxtioe eis 189 a nang asus oth senses uals oS serene wit cain soc: whens 20 mabey ars ponte gunoaine (ORGSINp, oC airacoe snd etusge ior aparetones. 7 Daur 40 25 ce para cameo vot brs waver RENPINTOSN een He srecate net ang states whee apres warns gah, Ti sects paves rectus, pny coven, £8 sen”: AG aeeacs Bevan uneiara stv cree Seas Poa Sele cere damm manages esse afore. sakes gazes 1 aa ues eapanun mn mgr efacee arasenaien, ongenradag PNR shot aee 20 pe agosto yea cose Gents fstang cutee of eratence Mea eee pe one. The nein on mst babnce crnpatig Donte, Mage Eee veto spon Boh wh cee ah AERO educational way, The rh #00 “semavalire, ans see dest Avthority Decision making sn prot ete tas mabey 22 mse eins eng eA ators, fnsty mune, ond spar ates WAS iinhed utivereny goxtinas and Rusgeiay cantar, Tey ewe sepa of ay wae eaves peurse tleage, 208 TheDsES 0 ots ants oe poste be fe: eg reearar sess So Pag a alt, suet Accountaibility Tee posing ssa eke aa a osncd goon ehanee esr AER, 27 SENS areas faa seca ets ah OCB maa aaa ere canny ane tmmsanacy io fapsal decors Tae a gy meaiges, carte ibe x ype, 2 8D eae re das sans anh Pine soso Sengastat una aprons malig acute: by satezeies Paes"
    },
    {
        "image": "unithead2_synth_17_aug4.png",
        "label": "unithead",
        "ocr_text": "POLYTECHNIC UNIVERSITY OF THE PHILIPPINES POSITION DESCRIPTION: HEAD QUALITY ASSURANCE ‘Sta. Mesa, Mania 1016 Prepared by: JEANETTE SMITH Date: ctor 08, 2028 Purpose “Ts postion ext tle and manage a apes of the aademis uns operations suring aigement th stutonal sate objectives and mating high standards ef educatonal quay. The le encompasses academic leaders, admit management, and statge plain responses. Thenconber serves 2 he enc Eason been the ut ans onversty asrntaton cereserng heiress of facty, sa, nd stucets whe avancing nation goals This notes bartcpaton in west ide commites pleydevdepment. and sate aming ‘tates. Ester nctons move overseeing acdemic progam Sevecpment {seat peomance management, resource sceton, ne stateholer engagement. The poston regres exgurine nigh eoieaton amination, ndestanng of Papin ucatoral polis, ad aby fo navigate complex organizational dari. This Ics le Semangs foster a cote of exces, imvatn, and clabraion sn te ot The ineombert most bance competing pts, manage Sere \"akenoers and make Sesion tat suppor beh stony antral Authority Decision making The postion hoker has aay to make decisions reparing academic ois, cerrouom mostetons fbuty airmen, ans operational mates iin tstabisned uverty genes and busty constants, Ts ues pea oh Cours ots, eats studies, ad tae wonton dtc Feal arty ‘ests wth he poston hole fr fing recommendations, perfomance eats es personel atons fr faculy and taf subject to university poten ad cosine Accountaibility The postions ecole fal specs of unt pera lag academia oun seces nay devcopmer ane erative cee) Eaton xis ce osiever of eseished yous, efecive este zane enone ‘attra main, Fal sceettyreqeee pet aed anager Zinn o bogey constants, and tarspareoyn ean decson making. The iebert met iat epentres, emorstte vv for nvesimen. ond marth use ancl eos suet san aden cout excompssses Pag ie2"
    },
    {
        "image": "unithead2_synth_17_aug5.png",
        "label": "unithead",
        "ocr_text": "POLYTECHNIC UNIVERS TY OF THE PHILIPPINES POSINOM DESCRIPTION HEAD QUALITY ASSURANCE i Bowmen 4\") 0 ma id mage empeets 0) Re aan TS weet, wauory wenn HO rere PIN SetneN BS MARCIE OS awe concen uty 9 ee erica: Beate Mat Bere EE nagemen ae veaage: paceang wepeatatint THe mete Seren m8 Ee eee (a sat. a ant dente whe ntvareing ratnenenss Goan Te rebtoe ee ere Meaney Cnet Sem lart motes crmeeny Soxsmn 59 29 Coram aoty pecenares magnon sepoven aceaten ae wis ema Megamart The Laorten ros arene hap LER NSS, eterno Prone sa mre solewk we Katey Sega compen sprain Soramet Tm easel in sens tion 2 estan 7 qromiinee, seevats ant oiheraton wine tne sk The tame mast Sonne SomeEiy Haas, mraHS Creme enaaden, Od sane SeenON DR EPR NT BAO IA Petar Authority Decision making ‘he aceon tiger Ag matey aN oR candy Heaters gabe emeanes team (Sey CUMIN ond ara HIE NN uUaNe! Soe) paves aNd meta coraeaes Th welanes queen et owne AAUngs ONS NRA ts tty emt Cention Pink eat SL Sons Me Na ny MeRmEREtENe, STARE ERTS 2 pernanrat sete Sr Hay ae Mat, Butt te anraraty Net an eneche oer be alguien EON, at Ranccarmey franct donaianmaing. Toe Start ma pty eastethows, Seema uae If rennet ANE mer penal ek OI taped ah Kewteme AEC ADe mC oapiat"
    },
    {
        "image": "unithead2_synth_18_aug1.png",
        "label": "unithead",
        "ocr_text": "ATENEC DE MANILA UNIVERSITY POSTION OF SCRIPTION: DEAN COL! EGE OF enmerowin Lope Hees, Quezon Cry 1106 Supeedinn LACEY TOCD Date Ceara 20, 2008 Purpose ‘ha pony mapite 0s panton a prove sivas ACRIND AS anne ROVe ere fr te emaeicrpatnart m acc orsanie 9 tne Arey S OHI, eR. cet een osee Tha emtent 4 nnpern i tr anerng penser exces, rman renee nach ee enaaerh. Be emma Pay axons orcas, Tok fentne vrevs ns the chat tenis ae aimee te ta nt, reget fo pein oiperainy, mceng. we exnising wt prigams ans spmctions, The sm nae cokaeeranan A tty. sa Statens A HCE SAIC Me aCe e wirs goste ane emmarnce ty mAonat tweens. Kay neers oh cote som Sev genet rt ene en, faedy Mec BS deveceme. maraguomect eacess ons soertinaten, we crmpance win CED ween cecsewnon ianaanes, Tha patos ter mot ramnaonae sng =200rI. crcatueh even ancsion MMS. ant comment rermnasae moeremet, The peamterk mac0Ute Dh Hk 8 mH SRD, MNO RES, BA commas engagents TAA pundion par 3 ec Se adv ew strays Authority Decision making oe poe Scar ns merase) nah ennd GHTIG ase Bate pronauton estcanorn. (aedty aw gmarts, An seater ers mM ented anetrnty petaasn ane vestry contacts Ths matacen appro of seu etenge. ans kc, ane tty weiaed dnt Fo many ets one te pact bar fa Rig eormnrtaen. paannarEe maNMS a4 pevvomss! sen Si \"zaty wt wnt aabpat to vmeernty Bem and ee Tve cp arena of entiahet gusit, ware senewee win, 9 eartmne 12 sevtersenss onatinn nea! acecaenaney me poten Neanci MIAN, oreerce io eran sorbate, and Narapineney Sean dacsinnnating TM ower snc sty sepa, armeraae whe Yor Reenter Id ONE"
    },
    {
        "image": "unithead2_synth_18_aug2.png",
        "label": "unithead",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY POSITION DESCRIPTION: DEAN COLLEGE OF Loyola Heights, Quezon City 1108 Prepared by: LACEY TODD Date: Cetober 28, 2025 Purpose The par pone th poston so provide stage mash an aminstatne renin ategl capri ccrice wih vary mason, vn Sire vaber. The scoters epunaal foforeng sesame exer romain mcrae odin and sna and ey ety std evn. TA Foston server a ech scare ane tow tthe, eapestie ternary, outing. aetna, ad erating 3 pags adopts, Tee teers cease wih cy sa sade, an errata 9 once tbe uns qos and cotta ohstional eflechenest Key hnctons eke Coren devement and assesment acy rcatmer and eee bgt tragenent rset afrscooaten aa compares wth CHEDregustos ans isin stars, The pton hol oat amon sng eae, ‘eaten emmncaio sss, and commtinet o cries enpovenet. The ‘nembent preset the nt unverity comes, extra! pater, and onmunty enapenes. Th postion ay a ena ee advange west Authority Decision making ‘The postion older has authority to make decisions regarding academic poles, ‘curouum mediation, facut assignments, and operational matters wii ‘estabished unversty guidelines and budgetary constraints. This includes approval of course offerings, class schedules, and facuty workload Sstrouton. Fa athorty rests with the postion holder fr hing recommendation, performance evaluations, ‘ad personnel actions for faculty and staf, subject to university plies and colectve Accountaibility The postion is accountable for al aspects of unt operations incung academic quaty, student success, faculty development, and administrative efcieny. Evaluation focuses on achievement of estabished goals, elective resource utzaton and conrbuton to instutoal mssion Fiscal accourabatyrequres prudent facia management adherence to budgetary constraints, and transparency i fancial decsion mating, The lncumbent mus sty expendties, emonsvate vale forivestment, and manta accuse feancil recor subject to aut. Academic accountabity encompasses pam orl"
    },
    {
        "image": "unithead2_synth_18_aug3.png",
        "label": "unithead",
        "ocr_text": "ATENEO DE MANILA UNIVERSITY POSITION DESCRIPTION: DEAN COLLEGE OF Loyola Heights, Quezon City 1108. Prepated by: LACEY TODD Dale cctovar 28, 2028 Purpose The pany pose oth poston it prove strategic leaden andadninsatve veri forthe solepelieparmert in accordance wih he wives miss, vo, romsing innovate teaching an renee, ans agurng city suse sees Th poston serves asthe chief acaderic and admit fie fhe nt responsible segues cosberaton win faut, sa, sens, ane exer staves fo avance crrovlonseveomer ana sesame, uty rote! an Severe, Sot Inaragerent, student affarscorénafon, and congtane wth CHED repators and {ereaton stands. The poston her mest demonstrate stoners moument present tne unt n univers councils, ext ‘community engagements. This poston plays aerial rol in advancing the univers’ sannersnos, ans Authority Decision making has authority to make decisions regarng academe poces, ceureuum modieatons, faculty asignments, and operational matters within established university guidelines and budgetary constrains. This includes approval of course offerings, class schedules, and acuity workload dstroution. Final authority resis with the position hldr fo ing recommendations, perfomance evaluations, and personne ations for acuity and staff, subject to university pobcies and colectve Accountaibility student success, facuty development and aemiesrave effcency. Evauation fesse eunben must sity expenses, demonstrate va for nvestment, nd maaan crate financial records sje fo aus, Academic accouabity encompasses pei?"
    },
    {
        "image": "unithead2_synth_18_aug4.png",
        "label": "unithead",
        "ocr_text": "= SSSSE S SCSN_C C ATENEO DE MANILA UNIVERSITY POSITION DESCRIPTION: DEAN COLLEGE OF Loyola Heights, Quezon Cty 1108 Prepared by: LACEY TODD Date: October 20, 2025 Purpose The pinay pone of ths poston to provide state kadeshp ad aminstatve ves ft caaplsparmentnscecance wah he wavemnya nates rece 2 ee vas. The neumbet espe rete scaseie mosses bemcing mova aching an seach nd enya Hetero Ths boston serves a the cet academic ad aamnstave ow ofa a espeawe fe parnog. nang, secing an ersuaing al poems and opeaion Tee recurs coteraion ith act, sat students and eco sttenades io orev She ont gas and conte tomate eectenee hay frsone roven uresendevdcpment and atestment, acy vecrament ae ceveore, age Ianogument, suerte coornaon, and conplance nth CED teoaoor a 2cerditen standart. The ponte hor mat comorsote sry leet ‘cetetconmuneaton sis snd commento conscoen mprvenens Te ‘eanbent represents teu n wiverty comes eens pameston one communty gages. Ths poston pay a eno hoovreng he caves’ Authority Decision making The poston alder as ata Yo mate decsins earg season pois, certs mosteatons fact stigmas, and eprtons maton take stashed uiversty gains and bug conse, The eoctes spol course ctengs, cass schaes, an fauty wond atten Fol ecnony ‘sts th he potion her hing ecommenatans parammone eon, 24 pesca ations acy an af, us to ieny pone od cee Accountaibility ‘The position is accountable for ll aspects of unit operations inching academic quality, ser seca, forty ceveopmens and amintaneeflewney Ermenoneees cn achevement of esttiaed gous. eeciveesooce asson sod somoten es ‘sttuonal mission, Fea accortabty reures pe franead mascgenet erence to budgetary constants, an Varsparency nfl decent. The ‘ncunben must sty expends, emenstate vu er esters ae monean accuatefnancia ecarin nc fo auc. Acari scountaty socooponaen a"
    },
    {
        "image": "unithead2_synth_18_aug5.png",
        "label": "unithead",
        "ocr_text": "Ee ATENEO DE MANILA UNIVERSITY"
    },
    {
        "image": "unithead2_synth_19_aug1.png",
        "label": "unithead",
        "ocr_text": "ll UNIVERSITY OF SANTO TOMAS: DESCRIPTION HEAD RESEARCH AND ‘posevard, Manda 1015"
    },
    {
        "image": "unithead2_synth_19_aug2.png",
        "label": "unithead",
        "ocr_text": "MAS POSTION Espafa Boy Property DANIEL EVSHS DAE piewonter 268 ESEAROH AND pose ransgeniet of stent feretens 2s the gery dee repesematve of zoogeam deaciepmert, reseurse manspaonert, 230 quity assurance, The postan bee Hon antag aign it onan, Tra ovens Me snasietaiy eatanrene ty Decision making Ts pe it nae ogra Dacisnnaking come extends 10 ters eaotyateoting urs speratins whe “ocvweniy reins ans geverance sevatures, The seimigan na ately toni pas, racers, 30d pias asistart win neon! srclotes teins on nashing etionenta, season prombas oe oes portion on aang we swuted to soaceme omens engagement. The zeumoant lecvusot un afevsvereae a iecsartip: maggunens and ssamameet of fhe uti’ sot soy stage mt “testveness, 09 0 compbznse wt sting regub anton ae istiatoal Seancig pccies. Tee cube"
    },
    {
        "image": "unithead2_synth_19_aug3.png",
        "label": "unithead",
        "ocr_text": "ee UNIVERSITY OF SANTO TOMAS POSITION DESCRIPTION HEAD RESEARCH AND Espaha Boulevard, Mania 1015 ‘epared by: DANIEL EVANS Date: November 04. 2025 Purpose ‘The postion etabished o prove vsonay leaders an fecive maaan: of Tre ceatemie ut ensuring devery of hgh qalty education, research, and extension eee pe ncumbeet functions as the pemary teson maket and represents ot Tete nrenal and exera forens. Coe responsbites ince strategie Panna vanagemert, and quaity assurance. The postion Pole Sign wth unversty policies, CHED mandates, and academic freedom and nkages. Leadership responses reepossfacuty development, student success ifiaives, cmmevim novation, a research productvay enhancement (Goveonment that values versity, prom ‘Authority Decision making ‘ver a academic and administrative functions ofthe Te perwcng program panning. faculty development, and resource management ecuon mating power extends to matters ret affecting unt operations w e _acherng to university poses and governance ‘iranian unt poses, procedwes, and ponies consistent with insti} ‘S Gemen Tha cues Geions on teaching assignments research pos, 2 ‘This postion exercises authority ‘Acoountabilty rest with this postion fr achieving wit aareence, research product, and communty engagement. The ineumben Cratated on eectivenes in leaders, tmision and strategi pois, Financial ac"
    },
    {
        "image": "unithead2_synth_19_aug4.png",
        "label": "unithead",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS, POSITION DESCRIPTION: HEAD RESEARCH AND Espafia Boulevard, Mania 1015 Prepared by: DANIEL EVANS Date: November 04, 2025 Purpose ‘The postion i established to prove visionary leadership ad effective management of the academic unt. ensuing delivery of high quality education, research and extension ‘services. The incumbent funetions as the pimary decision maker and representative of the unt in intemal and extemal forums. Core responsbities include strategie planing, royam development resource management, and quaity assurance. The postion heer must ensure that a unt actives aign with unversty pocies, CHED mandates, and ‘roessional accreditation requirements while mastaning academe freedom ad \"nsttutonal avtonomy. The role requres balding and mantaning productive rlstonships with uriversity administration, extemal panes, alumni, and communty stakeholders. “Ths ieludes representing the unt in uncraiing acts, inausty partnerships, research colaborations, and international inkages. Leadership responses encompass faculty development, student success intiatives, curcuum innovation, and research productity erhancement. The incumbent must create an inclusive ‘eoveonment that values diversity, promtes equty, and supports the professional ruth Authority Decision making This postion execs author vera scadenie ad tintave nto the tea mckng pan paneng ey development, ad ereuce managers Deccion mating poner extend tomate ety atecing it operate whde oberng io nove pls and govemancesintrs, The burbs aoty to estaish unt pees, posed, and pris content wah nett {gsines, Ths eles ects cn eachng stg, seach pores, nd Accountaibility pecrrtbty rests with hs potion fo acing unt gos seo aati Cesare, seach pods. ad command engagunest. The weber Srauated onefecvenss a ledershp, management, an vances fhe wits ‘isen and sete ponies, Franll accoutaby ches rexposbi gt TTanagunat cosefcctrenss, ad maimcaton of aalablerexowces. The ponton Toe mst scent fr rps, marian apes cciraton ar ese compiance nth noSig eqarenent destin favo poss, The neunbe papi"
    },
    {
        "image": "unithead2_synth_19_aug5.png",
        "label": "unithead",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS POSITION DESCRIPTION: HEAD RESEARCH AND. Espafia Boulevard, Manila 1015 Prepared by: DANIEL EVANS Dale: November 04, 2025, Purpose ‘Tne pons erabahe o provide vsonary lasers and fectve management of the academic unt ensuring every of igh uty education, research and ertesion serves, The neuen! funetons as the pany deo maket and reresentatve of thet in intra an externa frame, Coe responsiites le sate panning program cevecpment rexcurce management, and qty aesrace. The poston Mer trust ensre hata unt aces ab th uversty pce, CHED mantes, ans Persona acrestatonrecoremers he mantarng academe reson and ‘titra atoomy, The rere ing a mantainng poste reatonstios wren covers aorintaton, eterna panes, ann commun stakes “hs nchades epesering teu naira acts, nny paresis researon colabraors, and nterntona bape. Lasers responses rconpassfcuty Seveopent suset scene intiaves, coum ivan and ‘esearch posstty eohncement. Theineombert most reat anineusve nveonmert tha aves divest. pometes eat and super the professional roth Authority Decision making Tis postin exercises ata oe al cadmic nd arin cons the Co lig progam pling fay deve and exeace manager Oecsin maingporer een fo mates Sec fering protons wie coven to wivery poe and goemance ste, The meat hs abo} {oct nt plies, precedes, and pes ersten th rsutna foams, Ths hes Gaon onary nsipet, esearch pis, 20 Accountaibility eco ress wih is poten chev goss eed academic Creer, seach edo and commun) engagement The hearer Crautedenefeciveners leap, Manger a sane ft wis Inason nd stp pois, Frere scent Pcs: repose beet Imoagemen costertveres, ad maxiasion of arta resarces, Te poston Toler st cca fer expend, anton appropiate drumaraion an ere onpiace wth ating requrerents and astute nani pois. The ncumber Pag ie2"
    },
    {
        "image": "unithead2_synth_20_aug1.png",
        "label": "unithead",
        "ocr_text": "SS\" UNIVERSITY OF SANTO. TOMAS"
    },
    {
        "image": "unithead2_synth_20_aug2.png",
        "label": "unithead",
        "ocr_text": "ES UNIVERSITY OF SANTO TOMAS POSITION DESCRIPTION: HEAD QUALI spake Boulevard, Mania 1015 Di ITY ASSURANCE Preparedby: ALICIA PEREZ ME: October 20, 2025 fo make decision regaring academic posies, carta fenton. cut assignments, and opeatena mate se saabished wvesiy gudeines and budgetary crseaces This nets approval of course offerings, class se"
    },
    {
        "image": "unithead2_synth_20_aug3.png",
        "label": "unithead",
        "ocr_text": "UNIVERSITY oy SANTO Tomas POSTON DESC AI Espade Boutevarg, Manis 5015 Seperation ama pepes HS cetrear 29, 20s HEAD -SUAUITY assURaNCE ‘enables, see a i Sgn yanniss Tae \\eatneshic to canara ai sreetence, mnvston, and eatseraton satan Te PEBL t ame opens ga ecage és shaker, se mite eis tat segnee Ho en ronasy wa netutnnd Authority Decisions anaking \"Ss Baio fr ache en gats mised to teeth. so earmatty mngauemeen Ie “as i eases, maragesion, ad wens misono sttege SE OF eas ty chee repete eager ra it Sessions an mvennaion se oi escorces. The pont compte, eee ls espenstwes mmc apreron semaine SceNaNatON. and eine sto mithing ripiconnes wisinrweon rn BORK BohSas. The mcumene"
    },
    {
        "image": "unithead2_synth_20_aug4.png",
        "label": "unithead",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS POSITION DESCRIPTION: HEAD QUALITY ASSURANCE ESpafa Boulevard, Mania 1015 Prepared by: ALICIA PEREZ Date: oetober 20, 2025 Purpose “Ts goston exit tls and manage a apes of he aademis uns opraons sung airmen th situtenal sate obetves and martaig high standards ef educatona quay, The ole encompasses academic leaders, aéminstatve rmarogemer, and statege planing responses. Theincomber serves 25 he enc basen btveen te unt ans ones asrintaton ceresering heiress of facut, sa, and sucets nie avarcng nation goals Ths notes anpatonnunversty ige commie, piey Sevecpment, and segs anang ‘btatves. Ester nctons move oveseeng assem peogan Sevecpment ‘sooty peomance management, resoue lceton, ne statehler engage. The poston requires exgeraenhgne cuca amination, ngesanng of Papin ational polis, ad aby to navigate complex orazationl dares. This Issn a Semangsforterag a cote of exceense, innovation, and clabrsion sn et The neombert moat ane competing pres, manage Sere sakensers, and make Sesion tat spor Beh tatoo ana nto Authority Decision making The poston oder has autoy to make decisions reparing academic ois, corroulm moststons fbutyassgrmen, ans operators mates in tetabahesunverty gues ana busty covarants, Ths noses aorvaof tear oflerngs, cars schede, and aly world taton ial tory ‘ests vith the poston hole fr fing recommendations, prlomance evans ed personel actions fray and taf subject owners pcos and oesive Accountaibility Account ets with ths positon fr achieving unt goals ate to acai cvclene eseuch reduc. ad communi engagemert, Theincumber i tauated on effectiveness in lendeship, manager, ad adrancemert fhe is isin and sep pes. Fhancial aceoabity ches response but Imanagemer costafetvenes, and masizaton of araate rescues. The poston Toler mest acount fr expences, mantain appropiate documeriaten, and ensure omplance with audting equrments and nsivinal mania poses. Te ncurbert Page tor2"
    },
    {
        "image": "unithead2_synth_20_aug5.png",
        "label": "unithead",
        "ocr_text": "UNIVERSITY OF SANTO TOMAS: POSITION DESCRIPTION HERO QUALITY ASSURANCE Banat tenors’, Monks 1013 sparsity: dy sCiA PERE Farpose “Yeu panon arnt Hes and sanagy &S spects 2 er ons une RHA, eonsing iagmset oh matters Sate Syreoea ars rota Nish oF aan guy. The rears ies Seacimes ieceay ARIE anapemes. we snepe panes sponses, The numbed ames a seca neon rate Bat nt ad caves ON seen, apres oe eee Teianaty, al ane resents wae atvanceg natin! gant, Tes oiadea mt asabon, Cail foes mei cpaues a cmverct pion ernie, eacy Deioprerk sé sete Ba eersaning pease sega ovale Peony petomanen wnansgriet. se tain, or saaeoesee eee, Tht petnor nes een sss, 0 way Y8 7 Sonceesng non set feng craton ne Tse eqennane ose Bence ec saeco, a ste ain rieg thes wha aberrant tanceg A Piteion te nein amereatist gvarsce. Ts tame ct neces, Teweatee, 58 ASEM peers, ange COSES bent em econ Authority Decision making ‘Toe postion tele Ne sce ret aewishas srewenly panies 9 Tati mes ienega, ches Sos. 74 Sty WENA teeta oth peat tes Tc hong stoamma oe peor scion on enya 2a Acconntaibllity arse wee wih 2 poston He en eer, ach pe 8ECI. BE RI crate cn eaatnerens aA ANHGAENES, E SHEER eee, Fanci eoceutar ity scenes Senses peste ane CSovarernent, metaverse, WX! emer hat tocar He aap, ata RSE gan aie seramenss nk msetionst fraraat PO scx ty to mae Gesers enjoy Nea He, resto, tase HESAMOS, GO ALANS NED NES neat Tes pote sepia eataoen Bas aikcy eho, piece BUSES ida to eveersty colo wa echt ae poe nem te neater: ry emergent, Tae OES Soscuansri, 28 Taper pape"
    }
]