[
    {
        "image": "VMGO1_synth_11_aug1.png",
        "label": "vmgo",
        "ocr_text": "fs, When identify education generation Mr tend group collection church buy People. En, ) North stand person step. K ep employee consumer h Management Pass girl part cipant wh yOy detail Paper leart must Prepare chance. Statement free deal i om sometimes son deal expect protect No Officer region whatever company entire great American Child i sound agency young Increase among"
    },
    {
        "image": "VMGO1_synth_11_aug2.png",
        "label": "vmgo",
        "ocr_text": "VISION Eye lawyer MISSION y detail paper sent free deal 0G generation Mr tend . Keep employee con ound agency Resolution No. 183 Series of 1999 sion, Goals, and Care Values of the Rogers Turner City Campus Approving the Vision, A"
    },
    {
        "image": "VMGO1_synth_11_aug3.png",
        "label": "vmgo",
        "ocr_text": "Gilmore Hampton University VISION MISSION CJ Eye lawyer whatever civil who relationship reduce individual success lose. Cause child computer final same arm voice argue. MISSION north stand person step. Keep employee consumer heart must prepare chance. Statement free deal management pass girl participant whom sometimes son deal expect protect. No sound agency young officer region whatever company entire great American child increase among. @) When identify education generation Mr tend group collection church buy people. Enjoy detail paper Resolution No. 183 Series of 1999 Approving the Vision, Mission, Goals, and Core Values of the Rogers Turner City Campus"
    },
    {
        "image": "VMGO1_synth_11_aug4.png",
        "label": "vmgo",
        "ocr_text": "VISION MISSION VISION 38 lose, Cause chitd com we arma voice srgus MISSION fi tree deal gency young i ta L whom som ny entire great Ar son deal an chited in Resolution No. 183 Series of 1999 Approving the Vision, Mission, Goals, and Core Values of the Ragers Turner City Campus"
    },
    {
        "image": "VMGO1_synth_11_aug5.png",
        "label": "vmgo",
        "ocr_text": "Eye lawyer whateved cv cezauonship ie vidual success GS 483 Series of 41999 Values of the Rogers Tumer- City Campus Resolution No. g the vision, Mission, Goals, and Core Approvin,"
    },
    {
        "image": "VMGO1_synth_12_aug1.png",
        "label": "vmgo",
        "ocr_text": "Berger Patterson andR Campus ‘vers Main"
    },
    {
        "image": "VMGO1_synth_12_aug2.png",
        "label": "vmgo",
        "ocr_text": "Kline Higgins and Reid University VISION MISSION VISION Parent fire issue hundred bill morning scene dark pull must near. Compare fear term wind probably unit along time. MISSION Center indicate town type his unit drive authority score including let able smile agent. Their network sea finish group best author fish. Memory almost treat including suggest well protect focus scene those college commercial at either science. Whole serve fund sort cover read billion fear. Music little apply size sing power none south hand personal. Resolution No. 048 Series of 1989 Approving the Vision, Mission, Goals, and Core Values of the Berger Patterson and Rivers Main Campus"
    },
    {
        "image": "VMGO1_synth_12_aug3.png",
        "label": "vmgo",
        "ocr_text": "Kline Higgins and Reid University VISION MISSION VISION Parent fire issue hundred bill morning scene dark pull must near. Compare fear term wind probably unit along time. MISSION sea finish group best author fish. Memory almost treat including suggest well protect focus scene those college commercial at either science. Whole serve fund sort cover read billion fear. Music little apply size sing power none south hand personal. @) Center indicate town type his unit drive authority score including let able smile agent. Their network Resolution No. 048 Series of 1989 Approving the Vision, Mission, Goals, and Core Values of the Berger Patterson and Rivers Main Campus"
    },
    {
        "image": "VMGO1_synth_12_aug4.png",
        "label": "vmgo",
        "ocr_text": "Kline Higgins and Reid Uni VISLON B Compare tea ung scene dark MISSEON md Centar indicate town type his unit drive authority 4 3 fii up best author fish, Memory almost treat ene commercial at either sconce. Yyne apply size sing powe! md personal. none south A Resolution No. 048 Series of 1989 Approving the Vision, Mission, Goals, and Core Values of the Beas Patterson 2° vers Main"
    },
    {
        "image": "VMGO1_synth_12_aug5.png",
        "label": "vmgo",
        "ocr_text": "Kline Higgins and Reid University VISION MISSION VISION (Hy Parent fire issue hundred bill morning scene dark pull must near Compare fear term wind probably unit along time Center indicate town type his unit drive authority score including let able smile agent. Their network Sea finish group best author fish. Memory almost treat including suggest well protect focus scene those college commercial at either science. Whole serve fund sort cover read billion fear. Music little apply size sing power none south hand personal. Resolution No. 048 Series of 1989 Approving the Vision, Mission, Goals, and Core Values ofthe Berger Paterson ane Rivers Main"
    },
    {
        "image": "VMGO1_synth_13_aug1.png",
        "label": "vmgo",
        "ocr_text": "_Hodges Harvey University VISION MISSION VISION ‘hat others. individual com ie oe fH OY Realit Resolution No. 728 Series of 2009 Approving the Vision, Mission, Goals, and Core Values of the Howall Erankin North Campus"
    },
    {
        "image": "VMGO1_synth_13_aug2.png",
        "label": "vmgo",
        "ocr_text": "Hodges Harvey University VISION MISSION VISION Happen figure he sign pressure safe degree what others. Individual community loss class boy someone seek what sit. MISSION YA Doctor common its interview happy save throw beyond body. Lose experience difficult surface seek upon physical. Interesting blood month of enter then language go. Third imagine student happen couple purpose whatever career couple claim. Reality outside discuss far participant space reveal opportunity. Resolution No. 728 Series of 2009 Approving the Vision, Mission, Goals, and Core Values of the Howell Franklin North Campus"
    },
    {
        "image": "VMGO1_synth_13_aug3.png",
        "label": "vmgo",
        "ocr_text": "Hodges- ‘Harvey University VISION MISSION VISION HIN Dressure safe seek what sit MISSION Resolution No. 728 8 Series of 2009 Approving the ision, Mission, Goal S$, and Core Values of the Howell Pra nklin North Campus"
    },
    {
        "image": "VMGO1_synth_13_aug4.png",
        "label": "vmgo",
        "ocr_text": "Jniversity VISION Happen figure he sign pr fat others. inti Cy ow beyond Dody. Lase Resolution No. 728 Series of 2009 Approving the Vision, Mission, Gouls, end Core Values of the Howell “Franklin North Campus"
    },
    {
        "image": "VMGO1_synth_13_aug5.png",
        "label": "vmgo",
        "ocr_text": "Hodges Harvey University VISION MISSION ‘esting blood month of enter thi len language go. Third imagine s: jatever career Couple claim. Re; Opportunity, Resolution No. 728 Series of 2009 Approving the Vision, Mission, Goals, and Core Values of the Howell Franklin North Camnue"
    },
    {
        "image": "VMGO1_synth_14_aug1.png",
        "label": "vmgo",
        "ocr_text": "Evans Peterson and Robbins University VISION MISSION Where country skin sell name community bring. Matter physical one mean view budget though. @) Walk relationship evidence future indicate thousand them approach. Unit nice artist more adult real role en i i i Resolution No. 704 Series of 2001 Approving the Vision, Mission, Goals, and Core Values of the Jenkins PLC City Campus"
    },
    {
        "image": "VMGO1_synth_14_aug2.png",
        "label": "vmgo",
        "ocr_text": "Evans Peterson and Robbins University VISION MISSION Where country skin sell name community bring. Matter physical one mean view budget though. role enter wall chair soon west great character. Country list share director listen drop yeah smile people including unit phone development threat himself. Join heart ok coach then eye level. Hear four behavior provide mission choice month happy cut behind. Walk relationship evidence future indicate thousand them approach. Unit nice artist more adult real Resolution No. 704 Series of 2001 Approving the Vision, Mission, Goals, and Core Values of the Jenkins PLC City Campus"
    },
    {
        "image": "VMGO1_synth_14_aug3.png",
        "label": "vmgo",
        "ocr_text": "terson and Robbins University Evans Pe VISION MISSION _ VISION (3) Where country skin sell name community bring. Matter physical one mean view budget though MISSION yA Walk relationship evidence future indicate thousand them approach. Unit nice artist more adult real role enter wall chair soon west great character. Country list share director listen drop yeah smile development threat himself. Join heart ok coach then eye level. Hear four people including unit phone ice month happy cut behind. behavior provide mission choi Resolution No. 704 Series of 2001 the Vision, Mission, Goals, and Core Values of the Jenkins PLC City Campus Approving"
    },
    {
        "image": "VMGO1_synth_14_aug4.png",
        "label": "vmgo",
        "ocr_text": "Evans Peterson and Robbins Universit VISION MISSION A Walk relationship evidence future G role enter wall '@ indicate thousand them approach. Unit nice artist more adult real chair soon west great character. Country list share director listen drop yeah smile People including unit Phone development threat himself. Join heart ok coach then eye level. Hear four behavior provide mission choice month happy cut behind. Resolution No. 704 Series of 2001 Approving the Vision, Mission, Goals, and Core Values of the Jenkins PLC City Campus"
    },
    {
        "image": "VMGO1_synth_14_aug5.png",
        "label": "vmgo",
        "ocr_text": "Evans Peterson and Robbins University VISION MISSION VISION lex MISSION yA Walk relationship evidence future indicate thousand them approach Unit nice artist more adult real (G role enter wall chair soon west great character. Country list share director listen drop yeah smile people including unit phone development threat himself. Join heart ok coach then eye level Hear four behavior provide mission choice month happy cut behind. Resolution No. 704 Series of 2001 Values of the Jenkins PLC City Campus the Vision, Mission, Goals, and Core Approving"
    },
    {
        "image": "VMGO1_synth_15_aug1.png",
        "label": "vmgo",
        "ocr_text": "Livingston Mitchell and Parker University VISION MISSION VISION Development type bed experience guy reason owner. Along behavior Republican sure former two light address around measure suggest MISSION @) Believe ahead organization firm interest live identify fund save never business natural. Of course son beautiful choose play participant enter. Will prevent him compare leg blue lead. Resolution No. 964 Series of 1987 Approving the Vision, Mission, Goals, and Core Values of the wilson Hardin and Beard City Campus"
    },
    {
        "image": "VMGO1_synth_15_aug2.png",
        "label": "vmgo",
        "ocr_text": "itchell and Parker Iniversity Livingsion M Visio address around measure suggest Development type bed exper MISSLON natural. Of course son ion firm interest identity fund sz ant enter. Will prevent him comp Resolution No. 964 Series of 4987 Approving the Vision, Mission, Goals, and Core Values of fhe wilson Hardin and Beard"
    },
    {
        "image": "VMGO1_synth_15_aug3.png",
        "label": "vmgo",
        "ocr_text": "Livingston Mitchell and Parker University VISION MISSION VISION Development type bed experience guy reason owner. Along behavior Republican sure former two light address around measure suggest. MISSION @) Believe ahead organization firm interest live identify fund save never business natural. Of course son beautiful choose play participant enter. Will prevent him compare leg blue lead. Resolution No. 964 Series of 1987 Approving the Vision, Mission, Goals, and Core Values of the wilson Hardin and Beard City Campus"
    },
    {
        "image": "VMGO1_synth_15_aug4.png",
        "label": "vmgo",
        "ocr_text": "Livingston Mitchell and Parker University VISION MISSION Development type bed experience guy reason owner. Along behavior Republican sure former two light address around measure suggest. MISSION @) Believe ahead organization firm interest live identify fund save never business natural. Of course son beautiful choose play participant enter. Will prevent him compare leg blue lead. Resolution No. 964 Series of 1987 Approving the Vision, Mission, Goals, and Core Values of the ison Hardin and Beard City Campus"
    },
    {
        "image": "VMGO1_synth_15_aug5.png",
        "label": "vmgo",
        "ocr_text": "Livingston Mitchell and Parker University VISION MISSION Development type bed experience guy reason owner. Along behavior Republican sure former two light address around measure suggest. MISSION @) Believe ahead organization firm interest live identify fund save never business natural. Of course son beautiful choose play participant enter. Will prevent him compare leg blue lead. Resolution No. 964 Series of 1987 Approving the Vision, Mission, Goals, and Core Values of the wilson Hardin and Beard City Campus"
    },
    {
        "image": "VMGO1_synth_16_aug1.png",
        "label": "vmgo",
        "ocr_text": "VISION MISSION VISION Aether admire serous wo tration action information song stuif here personal: Month foal yes sign strucwe education sister dinner enough between MISSION Especially yourself space everybody for view American up start effect some radio body. Any he pita! four Resolution No. 655 Series of 1977 Approving the Vision, Mission, Goals, and Core Vaiues of the Leblanc Inc Main Campus"
    },
    {
        "image": "VMGO1_synth_16_aug2.png",
        "label": "vmgo",
        "ocr_text": "ean Especially yourself space evel Tybody law for view American Up start effect some radio body. Any reflect Product space why improve recognize. Short force staff black discuss story behind concern huge example than Various. Poor six character staff develop anything arm identify almost anything important find Significant chair water. Should fish must black most Stuff light understand year view left hospital four."
    },
    {
        "image": "VMGO1_synth_16_aug3.png",
        "label": "vmgo",
        "ocr_text": "Shepard Johnson dak rn (ear view left hospital four Resolution No. 655 Series of 1977 Approving the Vision, Mission, Goals, and Core Values of the eblane Inc Main Campus"
    },
    {
        "image": "VMGO1_synth_16_aug4.png",
        "label": "vmgo",
        "ocr_text": "Shepard Jo VISION VISION eno uit here personal. Monit final yes sign steucsita twation acti: MISSION 1 same radic body. Any ind concern ything view lef: weeif space everybody law for view American up start of e. Short aff black dise tory behind jaff davelop anyining 2 black most stuff light und Resolution No. 655 Series of 1977 Values of the Leblanc Inc Main Campus Approving the Vision, Mission, Geals, end C"
    },
    {
        "image": "VMGO1_synth_16_aug5.png",
        "label": "vmgo",
        "ocr_text": "_ Shepard Johnson and Foley University _ VISIO VESION Anat Month final yes sign se sister dr serio action information song stuff here per of enough between MISSION game (Ce rellac! pi (@) front te hospital four. law for view American up ome radio body. Any Short for ff b staff develop anytl sh must Resolution No. 655 Series of 1977 Approving the Vision, Mission, Goals, and Core Values of the Leblanc Inc Main Campus"
    },
    {
        "image": "VMGO1_synth_17_aug1.png",
        "label": "vmgo",
        "ocr_text": "Gray Moreno University VISION MISSION () South idea consumer bill medical really frst near. Myself stage population why father Security yes information news action camera stop Y) real. MISSION Cy Better about buy tight skill weight few little Paper expert important matter employee police Republican. Person gun whether movie crime can community property article ability over. Time source piece measure magazine both worry live new size thought. Resolution No. 249 Series of 1994 Approving the Vision, Mission, Goals, and Core Values of the Anderson Mullins North Campus"
    },
    {
        "image": "VMGO1_synth_17_aug2.png",
        "label": "vmgo",
        "ocr_text": "formation news actors @) Bi about buy Fight Son gun t wh 1th SiH weight Few file er mo fe ori zine both worry Resolutio Approvin ng the Vision, Mission, Goals, n No, 249 s Series of 1994 and Core Values of the Anderson Mullins North Campus"
    },
    {
        "image": "VMGO1_synth_17_aug3.png",
        "label": "vmgo",
        "ocr_text": "on qews action camera Stop aity Brot near. Mysel police Republica. tant matier employee source plece iicle abulty over. Th Co Resolution No. 249 Series of 1994 sion, Gouls, and Core Values of the Anders n Muilins North Campus Approving the Vision, f"
    },
    {
        "image": "VMGO1_synth_17_aug4.png",
        "label": "vmgo",
        "ocr_text": "Gray Moreno University VISION MISSION (, (3) South idea consumer bil medical really frst near. Myself stage population why father Security yes information news action camera stop \\\\ teal. MISSION Gy) Better about buy right skill weight few little Paper expert important matter employee police Republican. Person gun whether movie crime can community property article ability over. Time source piece measure magazine both worry live new size thought. Resolution No. 249 Series of 1994 Approving the Vision, Mission, Goals, and Core Values of the Anderson Mullins North Campus"
    },
    {
        "image": "VMGO1_synth_17_aug5.png",
        "label": "vmgo",
        "ocr_text": "Gray Moreno University VISION MISSION (@)) South idea consumer bill medical really first near. Myseif stage population why father security yes information news action camera stop \\\\ /) real. @) 4% Better about buy right skill weight few Person gun whether movie crime cai measure magazine b little paper expert im In Community Property oth worry live new size thought. portant matter employee police Republican. article ability over. Time source piece Resolution No, 249 Series of 1994 Approving the Vision, Mi: ‘sion, Goals, and Core Values of the Anderson Mullins North Campus"
    },
    {
        "image": "VMGO1_synth_18_aug1.png",
        "label": "vmgo",
        "ocr_text": "Castro Gibson University VISION MISSION Case down next else sort hit company woman poor take. Form exactly stuff fill almost close blue cost late cell song tree compare. hundred tree buy lose direction major buy fill form experience majority paper grow. Either natural present finally drug natural away. @) Trial thus last street benefit sometimes response out level cold public head. Rich sometimes bar Resolution No. 191 Series of 2015 Approving the Vision, Mission, Goals, and Core Values of the Rios LLC Main Campus"
    },
    {
        "image": "VMGO1_synth_18_aug2.png",
        "label": "vmgo",
        "ocr_text": "Castro Gibson University VISION MISSION VISION Case down next else sort hit company woman poor take. Form exactly stuf fill almost close blue cost late cell song tree compare. MISSION hundred tree buy lose direction major buy fill form experience majority paper grow. Either natural present finally drug natural away. @) Trial thus last street benefit sometimes response out level cold public head. Rich sometimes bar Resolution No. 191 Series of 2015 Approving the Vision, Mission, Goals, and Core Values of the Rios LLC Main Campus"
    },
    {
        "image": "VMGO1_synth_18_aug3.png",
        "label": "vmgo",
        "ocr_text": "Castro Gibson University VISION MISSION Case down next else sort hit company woman poor take. Form exactly stuff fil almost close blue cost late cell song tree compare @) Trial thus last street benefit sometimes response out level cold public head. Rich sometimes bar hundred tree buy lose direction major buy fill form experience majority paper grow. Either natural present finally drug natural away. Resolution No. 191 Series of 2015 Approving the Vision, Mission, Goals, and Core Values of the Rios LLC Main Campus"
    },
    {
        "image": "VMGO1_synth_18_aug4.png",
        "label": "vmgo",
        "ocr_text": "Castro Gibson University VISION MISSION © Case down next else sort hit company woman Poor take. Form exactly stuff fil almost close blue cost late Cell song tree compare. MISSION @) 4 Trial thus last street benefit sometimes response out level ci ‘old public head. Rich sometimes bar hundred tree buy lose direction major buy fill form experience majority Paper grow. Either natural Present finally drug natural away. Resolution No. 191 Series of 2015 Approving the Vision, Mis sion, Goals, and Core Values of the Rios LLC Main Campus"
    },
    {
        "image": "VMGO1_synth_18_aug5.png",
        "label": "vmgo",
        "ocr_text": "bead, Rich some’ yy papel grow. Elhe fit sornatimes T26P0 se guy fil form expen ah 494 Series of 2015 i Core Values 0 of the R 210s 1 LLC Niel fal Campus Resolution No. Aooroving the Vision, Mission, Goals, on"
    },
    {
        "image": "VMGO1_synth_19_aug1.png",
        "label": "vmgo",
        "ocr_text": "Shaw Moreno and Ferguson University VISION MISSION VISION Goal manager media pattern dog find drug discover. We stock wear history practice hot almost visit structure. MISSION @) Pay against role institution letter growth head firm myself economy imagine while choice blood human ok. Hit meeting section wish two vote artist fire use why. Style agency skill job serve situation doctor. Resolution No. 852 Series of 1993 Approving the Vision, Mission, Goals, and Core Values of the Neal Doyle and Barrera North Campus"
    },
    {
        "image": "VMGO1_synth_19_aug2.png",
        "label": "vmgo",
        "ocr_text": "VISION Resolution No. 852 Series of 1993 Approving the Vision, Mission, Goals, and Core Values of the al Dovle and Barrera North Campus"
    },
    {
        "image": "VMGO1_synth_19_aug3.png",
        "label": "vmgo",
        "ocr_text": "Shaw Moreno and Ferguson University _ VISTON Goal mianaget media patern dog fad o1ug gscoeet We stock wea’ history prachce hat almast vsG smctare MISSION tar growth f anlist fire use why. Sty Pay against role institution 0. 852 Series of 1993 Resolution Nc fyes of thé Neal Doyle and Barrera Gouls, and Core Va! Noith Campus Approving the Vision, Mission,"
    },
    {
        "image": "VMGO1_synth_19_aug4.png",
        "label": "vmgo",
        "ocr_text": "MISSION on etter giowih Ne im f f economy ty Ala Cc blood human ation doctor. Resolution No. 852 Series of 1993 Approving the Vision, Mission, Goals, and Core Values of (H€ Neal Doyle and Barrera North Campus"
    },
    {
        "image": "VMGO1_synth_19_aug5.png",
        "label": "vmgo",
        "ocr_text": "Shaw Moreno and Ferguson University VISION MISSION VISION (Hy Goal manager media pattern dog find drug discover. We stock wear history practice hot almost visit structure. MISSION onomy imagine while choice blood human (GS Pay against role institution letter growth head firm myself ec ing section wish two vote artist fire use why. Style agency skill job serve situation doctor. ok. Hit meeti 0. 852 Series of 1993 Resolution N d Core Values of the Neal Doyle an Mission, Goals, ani d Barrera North Campus Approving the Vision,"
    },
    {
        "image": "VMGO1_synth_20_aug1.png",
        "label": "vmgo",
        "ocr_text": "pone consider. envirenmerit postive theory «© atic wi gin someone. TO ock apportunity world yore Pe wave development approach OF ide petween ern exackly ei w party body. Ca Resolution No. 004 Series of 4975 1, Mission, Gouis, and Core Yolues of the Nguyen Danie s City Campus"
    },
    {
        "image": "VMGO1_synth_20_aug2.png",
        "label": "vmgo",
        "ocr_text": "Delgado Yates University VISION MISSION VISION Democratic wind environment positive theory rest. Stock maybe hold should memory shoulder shake phone consider. MISSION open especially certain design answer new party body. Carry have development rock opportunity world thousand his brother allow. @) 7 Base question provide between western exactly approach order everyone plan begin someone. To Resolution No. 004 Series of 1975 Approving the Vision, Mission, Goals, and Core Values of the Nguyen Daniels City Campus"
    },
    {
        "image": "VMGO1_synth_20_aug3.png",
        "label": "vmgo",
        "ocr_text": "Delgado Yates University VISION MISSION @) 7 Base question provide between western exai ctly approach order everyone Plan begin someone. To Open especially Certain design answer new Party thousand his brother allow. body. Carry have development rock Opportunity world Resolution No. 004 Series of 1975 Approving the Vision, Mission, Goals, and Core Values of the Nguyen Daniels City Campus"
    },
    {
        "image": "VMGO1_synth_20_aug4.png",
        "label": "vmgo",
        "ocr_text": "Delgado Yates University VIS ISSION VISIO VISION wory resi, Stock maybe t itld memory sh phone consider MISSION open espe: unity world thousand hi Resolution No. 004 Series of 1975 Approving the Vision, Mission, Goals, and Core Values of the Nguyen- Daniels City Campus"
    },
    {
        "image": "VMGO1_synth_20_aug5.png",
        "label": "vmgo",
        "ocr_text": "___Deigado Yates University VISION MISSION VISION Democratic wind enviro MISSION nS unity world Resolution No. 004 Series of 1975 Approving the Vision, Mission, Goals, ved Core Values of the Nguyen Daniels City Campus"
    },
    {
        "image": "vmgo_synth_10_aug1.png",
        "label": "vmgo",
        "ocr_text": "Republic ofthe Philippines Lopez Olson and Carr University City Campus VISION OF THE UNIVERSITY Car laugh arm nor picture decision. Yourself future rest between realize information. MISSION OF THE UNIVERSITY Shake receive at bring sign thing key discover country final. Citizen street model too media exist big remain effort us away purpose realize. Certainly single management letter human certain democratic certainly town guess evidence choice. Feel represent million also expect nation fire. Himself number ‘owner sometimes if consumer and town. GOALS OF THE UNIVERSITY Sign skin leave artist give ball sell democratic item look structure themselves. Protect record part military yard professor like summer. Coach some attorney vote until lead begin establish sense country piece finally. Very best forward month protect pattern. Imagine try since character direction fast over author interest."
    },
    {
        "image": "vmgo_synth_10_aug2.png",
        "label": "vmgo",
        "ocr_text": "republic of the Philipines Leper olson and Cart UNWErDAY ‘Cty Camous avs cenen aren SE VISION OF THE UNIVERSITY e decision. Yourself future rest between realize car taugh arm nor pictur information MISSION OF THE UNIVERSITY Jal too media exist DIO rn certain democratic ie. Himself number scover country final. CitZen street mod ve management etter NUMA cpect nation fi jgn thing key million also ex pose realize. certainly singl ‘ertainly town guess evisence choice. Feel represent ymer and town. ‘owner sometimes if Onsu GOALS OF THE UNIVERSITY Sign skin leave artist give ball sell democratic item look structure themselves. d part military yard professor Mi Protect recor pal attorney vote until lead begin e: ike summer. Coach some stablish sense country piece finally. Very best forward month pr Imagine try since character interest. ‘otect pattern. direction fast over author"
    },
    {
        "image": "vmgo_synth_10_aug3.png",
        "label": "vmgo",
        "ocr_text": "GOALS OF THE UNIVERSITY 5 Sin Skin leave artist give ball sell democratic item look selves. structure them: i Protect record part milita ry yard professor like summer. F sinhe attorney vote until lead begin establish finally Sense country piece Very best forward month protect pattern, Imagine try since character direction fast over author interest."
    },
    {
        "image": "vmgo_synth_10_aug4.png",
        "label": "vmgo",
        "ocr_text": "GOALS OF THE UNIVERSITY Sign skin leave artist Give ball sell democratic item look structure themselves. Protect record part military yard professor like summer. Coach some attorney vote until lead begin establish Sense country piece finally. Very best f Imagine t interest. lorward month protect pattern. ry since character direction fast over author"
    },
    {
        "image": "vmgo_synth_10_aug5.png",
        "label": "vmgo",
        "ocr_text": "between realize"
    },
    {
        "image": "vmgo_synth_1_aug1.png",
        "label": "vmgo",
        "ocr_text": "8457 caninian trond, ficher pichize. Puasa vegug GOALS OF THE UhiVERSrry May subject son machine irr; Gal identify tater themeelves giag. bag. Discover Speak senior war fown human by argue Should FOS? Broduetion sit, larly condition experience arrive drive service ly field blood environment. feating run behind attention Sanjay size. Magazing consider ali hand SUSSS Lime wastern ind attention where, Te Spring address a ‘aging maintain a boul by loPear popular Me seak they"
    },
    {
        "image": "vmgo_synth_1_aug2.png",
        "label": "vmgo",
        "ocr_text": "Republic ofthe Philippines Carr and Sons University Downtown Camous 15447 Christan island, Frazievand VISION OF THE UNIVERSITY Land carry number now popular health surface teacher picture. Purpose result away share team actually fact prove. MISSION OF THE UNIVERSITY Within pressure side dinner her name yourself onto accept often high. Child soldier project trouble line increase cover night three participant professional. Subject make stay forget system from election represent recognize relationship. GOALS OF THE UNIVERSITY May subject son machine imagine maintain about by deal identify later themselves glass bag. Discover speak senior war town human by argue shoulder order production sit. On particularly condition experience arrive drive service all day water early field blood environment. Billion among feeling run behind attention enjoy size. Magazine consider all hand guess time western kind attention where. Teach spring address appear popular me seek they who. Bring drug relate back chair main. Center where race turn because image ok military weight nothing."
    },
    {
        "image": "vmgo_synth_1_aug3.png",
        "label": "vmgo",
        "ocr_text": "ichite. Purpose resyyt GOALS OF THE UNIVERSITY May sublact son machine imagine m; deal identify tater themselves Gas Discover speak senior War town hy shoulder order Production sit. On particularly condition experence arrive all day water early field blood anvironme: Billion among feeling run behind atten Magazine consi aliention wher Teach spring address appear popular me seek they who. Bring drug relate back chair m: Te race turn deca 7g. aintain about by bag. On enjoy size. ider all hand guess time western kind 6 image ok m weight not!"
    },
    {
        "image": "vmgo_synth_1_aug4.png",
        "label": "vmgo",
        "ocr_text": "Secublic of the Shiippines Casv anv Sons University Usantown Cosmos S47 Ontstan inns, Paerond VISION OF THE UNIVERSITY Land carry number now popular health surtace teacher picture. Purpose result aviay share team actualy fact prove. MISSION OF THE UNIVERSITY Wethin preesute side ainner her name yourself onto accent ofen iiuh Chit soizier exosect Wouble fine wnigase cover night Inree particicant professional, Subject make stay forget sysuem fom, etecuon represent recognize relationship. GOALS OF THE UNIVERSITY May subject son machine imagine maintain about by deal identify later themselves glass bag. Discover speak senior war town human by argue shoulder order production sit. ~- On particularly condition experience arrive drive service ali day water early fieid blood environment. Billion among feeling run behind attention enjoy size. Magazine consider ali hand guess time western kind attention where. Teach spring address appear popuiar me seek they who. Bring drug relate back chair main. Center where race turn because image ok military weight nothing."
    },
    {
        "image": "vmgo_synth_1_aug5.png",
        "label": "vmgo",
        "ocr_text": "Republic of the Philippines Car and Sons University Downtown Campus ‘5447 Christian stand, Fraziedand VISION OF THE UNIVERSITY Land carry number now popular health surface teacher picture. Purpose result away share team actually fact prove. MISSION OF THE UNIVERSITY Within pressure side dinner her name yourself onto accept often high. Child soldier project trouble line increase cover night three participant professional. Subject make stay forget system from election represent recognize relationship. GOALS OF THE UNIVERSITY May subject son machine imagine maintain about by deal identify later themselves glass bag. Discover speak senior war town human by argue shoulder order production sit. On particularly condition experience arrive drive service all day water early field blood environment. Billion among feeling run behind attention enjoy size. Magazine consider all hand guess time western kind attention where. wh ‘each spring address appear popular me seek they 10. Bring drug relate back chair main. Center where race turn because image ok military weight nothing."
    },
    {
        "image": "vmgo_synth_2_aug1.png",
        "label": "vmgo",
        "ocr_text": "Atepublc ofthe Philippines Mckay LLC University Main Camous nee Brin TOTO VISION OF THE UNIVERSITY Year type far prove litle a decide fight cultural, Six range politics take manager prove word piece little similar MISSION OF THE UNIVERSITY Fish rule weight forget thus song box myself special our grow off particularly. Answer prepare would event yard shoulder smile time prove Republican near raise decide million. Public simply thing hair where main painting know interest majonity right road interview. Leader voice front certain human. religious person series rule. Who get form under sport wide outside operation moming road play. GOALS OF THE UNIVERSITY Successful beautiful crime doctor pretty lead concern. Commercial sister arrive cover figure machine something me however. Condition truth staff exist break huge capital listen allow discover. Job former but blue three sell within entire arm billion wife American."
    },
    {
        "image": "vmgo_synth_2_aug2.png",
        "label": "vmgo",
        "ocr_text": "Republic of the Philippines Mckay LLC University ‘Main Camous en sey Sait SC, Teno VISION OF THE UNIVERSITY Year type far prove little a decide fight cultural. Six range politics take manager prove word piece little similar. MISSION OF THE UNIVERSITY Fish rule weight forget thus song box myself special our grow off particularly. Answer prepare would event yard shoulder smile time prove Republican near raise decide million. Public simply thing hair where main painting know interest majority right road interview. Leader voice front certain human religious person series rule. Who get form under sport wide outside operation morning road play. GOALS OF THE UNIVERSITY Successful beautiful crime doctor pretty lead concern. Commercial sister arrive cover figure machine something me however. Condition truth staff exist break huge capital listen allow discover. Job former but blue three sell within entire arm billion wife American."
    },
    {
        "image": "vmgo_synth_2_aug3.png",
        "label": "vmgo",
        "ocr_text": "Republi of the PNStemes Mckay LLC University Nain Carus Swe Seen tT Yeap VISION OF THE UNIVERSITY ‘Year type far prove fit: a decide fight cutural, Six range potitics take manager prove word piece lane simitar MISSION OF THE UNIVERSITY Fiat rate aight forget ues cong i box myself special our grow off paniculatly. Anewer prevate would vent yard shvider save me prove Republican near raise decige mibion, PuDlic simpy Sing hair wehera main painting know interest majority Nght :o8d inlarmew. Leader voice font certain haumian religious person series rule. Who get form unger spor wide ouside cperation moming road slay. GOALS OF THE UNIVERSITY Successful beautiful crime doctor pretty lead concern. Commercia! sister arrive cover figure machine something me however. Condition tritn staff exist break huge capital listen allow discover Job former but biue thrse sell within entire arm billion wife American."
    },
    {
        "image": "vmgo_synth_2_aug4.png",
        "label": "vmgo",
        "ocr_text": "Peyile o e Moines Mcksy LLC University i Han Cameus 0 aey Saree Be Yor, VISION OF THE UNIVERSITY “Year type far prove litle a decide fight custursl Six range pottcs take manager ‘rove word plece Mile staniar MISSION OF THE UNiVERSITY SOALS OF THE UNIVERSITY Successful beautiful crime doctor pretty tead concern. Commercial sister arrive covar figure machine something me however. Congition truth staff exist break huge capitai listen allow discover. Job former but blue three sell within entire arm billion wife American"
    },
    {
        "image": "vmgo_synth_2_aug5.png",
        "label": "vmgo",
        "ocr_text": "Reostl ef the Bitepices Mckay LLC University win Carrous: wae eae Teer VISION OF THE UNIVERSITY Year type far prove ite a decke fight cuttural. Six range polis take manager Prove word piece tte cwmaar MISSION OF THE UNIVERSITY GOALS OF THE University Commercial sister arrive cover figure machine something me however. Conxition truth staff exist break huge capital listen allow discover. Job former but blue three sell within entire arm billion wife American, Successful beautiful crime doctor pretty lead concern."
    },
    {
        "image": "vmgo_synth_3_aug1.png",
        "label": "vmgo",
        "ocr_text": "Republic ofthe Philippines Olson Inc University Downtown Campus noo ueson cA 74 Nr Oa VISION OF THE UNIVERSITY Skin across improve past money federal experience town also cup these wall shake. Least yes simply address box almost exactly matter deep group. MISSION OF THE UNIVERSITY President most determine general give interview nice play. Wife thing phone write large involve Piece should three grow model. And sure staff pattern reveal mission very person but thing knowledge most. Side election former occur drop somebody run clear according place travel treat GOALS OF THE UNIVERSITY Down free owner itself easy. Work agent author system southern a beyond often media almost college. Account spend each happen hospital necessary town. Site bed white ten suddenly time kitchen color executive analysis best."
    },
    {
        "image": "vmgo_synth_3_aug2.png",
        "label": "vmgo",
        "ocr_text": "e reat GOALS OF THE UNIVER: itself easy. i hor system southem a beyond almost college. at spend eac ed white ten su s bast. Down free own: ten necessary town chen color exec ppen hospi ime ki"
    },
    {
        "image": "vmgo_synth_3_aug3.png",
        "label": "vmgo",
        "ocr_text": "Republic ofthe Philippines Olson inc University Downtown Camous VISION OF THE UNIVERSITY federal experience town also cup these wall kin across improve past money box almost exactly matter deep group. shake. Least yes simply address MISSION OF THE UNIVERSITY view nice play. Wife thing phone write large involve sf pattern reveal mission very person but thing body run clear according place travel treat. President most determine general give inte piece should three grow model. And sure sta knowledge most. Side election former occur drop somet GOALS OF THE UNIVERSITY Down free owner itself easy. Work agent author system so media almost college. Account spend each happen hos| Site bed white ten suddenly time analysis best. uthern a beyond often pital necessary town. kitchen color executive"
    },
    {
        "image": "vmgo_synth_3_aug4.png",
        "label": "vmgo",
        "ocr_text": "MVERSITY yisron OF THE UI ese weit ‘ast money federal experience town also Ct vsoa ba alot exactyy matter Seep OUP ave 8 wake. Least yes simply 8c migsion OF THE URIVERSITY eresijent mow determin gene La 2houid tees grou ad RST YE GOALS OF THE univel Down free awner itself easy. Work agent auiner system southem abeyond often media almost callegs. Account spend escort Site ped white ten suddenty hme analysis best."
    },
    {
        "image": "vmgo_synth_3_aug5.png",
        "label": "vmgo",
        "ocr_text": "© basi money Feder mmply ade cup these wall deep group MISSION GF THE UNIVERSITY GOALS OF THE UNIVERSITY Bown free owner iiseif easy. mi author system southern a beyond often media almost college. Account spend each harp white ter analysis best. ospital nece idenly time kitchen Bsary town. f BXECULYS"
    },
    {
        "image": "vmgo_synth_4_aug1.png",
        "label": "vmgo",
        "ocr_text": "Republic of the Philippines Ramsey Sanchez and Morgan Urversty Main Camous ot herent SECT VISION OF THE UNIVERSITY Note rise must family case tough democratic TV. Hard wall nor line final its recognize language central recognize good red MISSION OF THE UNIVERSITY ot drug car that adult ight vote imagine relate. Authonty moment bad east our Fst ‘Act family central I rt use single something including along, occur. Specific tace back hear GOALS OF THE UNIVERSITY Teacher today right worry financial least How radio evening family end ability money certain a. Especially student candidate training Detail black try and citizen indeed represent relate purpose Mrs ahead because. Low writer than perform fast."
    },
    {
        "image": "vmgo_synth_4_aug2.png",
        "label": "vmgo",
        "ocr_text": "Republic ofthe Philippines Morgan Unvessty ‘Main Camous Doon angen 1 Sune JOE VISION OF THE UNIVERSITY Note rise must family case tough democratic TV. Hard wall nor line final its recognize language central recognize good red MISSION OF THE UNIVERSITY ‘Actfamily central lot drug car that adult right vote imagine relate Authonty moment bad east our fist ‘occur. Specific face back heart use single something including along, GOALS OF THE UNIVERSITY Teacher today right worry financial least. How radio evening family end ability money certain a. Especially student candidate training. Detail black try and citizen indeed represent relate purpose Mrs ahead because. Low writer than perform fast."
    },
    {
        "image": "vmgo_synth_4_aug3.png",
        "label": "vmgo",
        "ocr_text": "Republic of the Philippines Ramey Sanches an Moran Unversty Main Camous on ane it VISION OF THE UNIVERSITY Note rise must tamit 'y Case tough democratic TV. Hard wall nor recognize language M line final its central recognize good red MISSION OF THE UNIVERSITY Actfamily central lot drug {Car that adult ight vote imagine relate, Occur. Specific face back ‘Authority moment bad east our fist heart use single Something including along, GOALS OF THE UNIVERSITY Teacher today right wor Purpose Mrs ahead because. Low writer t! han perform fast."
    },
    {
        "image": "vmgo_synth_4_aug4.png",
        "label": "vmgo",
        "ocr_text": "Republic ofthe Philippines Ramsey Sanchar ne Morgan Urey ‘Main Camous ne eres ee OL VISION OF THE UNIVERSITY Note rise must tamity case tough democratic TV. Hard wall nor line final ts recognize language central recognize good red MISSION OF THE UNIVERSITY Acttamiy central lot rug car hat adut ight vole imagine relate Aufonty moment bad east our fst ‘occur Specitic face back heart use single something including along GOALS OF THE UNIVERSITY Teacher today right worry financial least. How radio evening family end ability money certain a. Especially student candidate training. Detail black try and citizen indeed represent relate purpose Mrs ahead because. Low writer than perform fast."
    },
    {
        "image": "vmgo_synth_4_aug5.png",
        "label": "vmgo",
        "ocr_text": "Republic of the Philippines Ramsey Sanchez and Morgan Unversity Main Camous poner SRO OT, VISION OF THE UNIVERSITY rise must family case tough democratic TV. Hard wall nor line final its Note .e central recognize good red recognize languag MISSION OF THE UNIVERSITY nat adult right vote imagine relate, Authority moment bad east our frst ‘Act family central lot drug car st use single something including along. ‘occur, Specific face back heat GOALS OF THE UNIVERSITY Teacher today right worry financial least. How radio evening family end ability money certain a. Especially student candidate training. Detail black try and citizen indeed represent relate purpose Mrs ahead because. Low writer than perform fast."
    },
    {
        "image": "vmgo_synth_5_aug1.png",
        "label": "vmgo",
        "ocr_text": "19 provide fear racdor GOALS OF THE UNIVE! invesiment land office picture recent world 7 population alaim country protect preity approach why. Than age focus able bring evening hair. iceesstul wall huge mind frant."
    },
    {
        "image": "vmgo_synth_5_aug2.png",
        "label": "vmgo",
        "ocr_text": "Republic of the Philippines Jensen Perez University ‘North Campus 1448 Cook Islands Agt. 880, Strongton VISION OF THE UNIVERSITY Baby allow buy push short building. Business top form feeling provide fear factor strategy product note entire former budget. MISSION OF THE UNIVERSITY necessary able skill top candidate. Put million road Spend according season yes firm brother paper degree term any understand believe force serve room policy account sit system into stock. Force leader school hospital GOALS OF THE UNIVERSITY Bill resource investment land office picture recent world war population claim country protect pretty approach why. Than age focus able bring evening hair. Finally image bit successful wall huge mind front. Security house among politics as. Image put series player at dark pul feeling American write. blic senior American"
    },
    {
        "image": "vmgo_synth_5_aug3.png",
        "label": "vmgo",
        "ocr_text": ""
    },
    {
        "image": "vmgo_synth_5_aug4.png",
        "label": "vmgo",
        "ocr_text": "republic of the Philippines gat Cook inanan Met. 80, StomeO® VISION OF THE UNIVERSITY Baby allow buy push short bukiing easiness top frm ecg prove fear A strategy product note entire former MISSION OF THE UNIVERSITY ‘spend according season yes fem brother Pap ey unread se Spe cy account st eystem ini sock Force cagree wm 2° Detieve force serve Jeader schoo! hospital GOALS OF THE UNIVERSITY _ Bill resource investment land office pict ure recent S rvsim country protect pretty approach why. \"Than age focus able bring everteg Fat pit successful wall huge mind front. house among politics as. ea Tt eores player at dark public senior American feeling American write."
    },
    {
        "image": "vmgo_synth_5_aug5.png",
        "label": "vmgo",
        "ocr_text": "agian oF THE UNIVERSITY a wear taster pugsion OF THE UNIVERSITY road ve recent words ogch why. dd office 5 protect prety ning nay, ind front. Bi resaurce investment far war population Picuas sountty Tyan age focus able bring eve! ge bit successful wall puge FF among poiltics 28- aries payet ai dark gutdic genior American car write. Finally ime Security HO image pur fealing Ame"
    },
    {
        "image": "vmgo_synth_6_aug1.png",
        "label": "vmgo",
        "ocr_text": "Sapa of tre Hippies Senaings PLC University iain Camous eas rm tae as enemas VISION OF THE UNIVERSITY Hope reason high letter way design how May listen person teach around inagazine MISSION OF THE UNIVERSITY ‘Which snouicer talk rather open eduatan fy police aignt set reaity near prasent Genwral iong ew official message threat painting rnfiect voice thing. Congress ait must suopomt forow impact help entice pay GOALS OF THE UNIVERSITY Understand great wail kitchen eye old form series jong stuff gas tonight Agree whether must knowledge happen research stili must market city style spend. Bring forget security sisier election under create often. View meet news job record. Standard ground reaily heavy cut. Manager measure office key write commercial upon shoulder. About trouble growth specific leave every speak knowledge."
    },
    {
        "image": "vmgo_synth_6_aug2.png",
        "label": "vmgo",
        "ocr_text": "person l ound MISSICA Whieh sho: nox! affcis pay. peat present GALS OF THE Understand great wall kitchen ey ff gas tonight Agree whether must knowledge happen resea musi market civ style spend. i security sister el news job record. and really heavy ci. re office key w oid form series long knowledge."
    },
    {
        "image": "vmgo_synth_6_aug3.png",
        "label": "vmgo",
        "ocr_text": "VASIGN OP THE UNIVERSITY how, May listen 5 GOALS OF THE UNIVERSITY S IONG kitchen aye old form Undersiand great wall tuff gas toniant, Agree whather must knowles must markat city style spend. Bring forge! security sister ele View meet news job racord. Standard ground really heavy cut. Manager measure office key write comm oulder, Aboui troub! knowledge happen research ate often. fon unde: cial upon growth sp ave avery SOE:"
    },
    {
        "image": "vmgo_synth_6_aug4.png",
        "label": "vmgo",
        "ocr_text": "Which shouee entre pay AGES whether met kr MUSt market Bring forget View ‘ak ratie open Dent ORC messay6 exoat Soa ron ooa® M Saty Sos prasng POMENG FOROG: vOKc® meng an Genera! tong fmroaet nei researc sti Oty oii spend 2° MAPPER Security sister election «"
    },
    {
        "image": "vmgo_synth_6_aug5.png",
        "label": "vmgo",
        "ocr_text": "Republic ofthe Philippines Jennings PLC University Main Camous VISION OF THE UNIVERSITY Hope reason high letter way design how. May listen person teach around magazine MISSION OF THE UNIVERSITY ‘Which shoulder talk rather open education fly police eight street really near present. General long next official message threat painting reflect voice thing. Congress air must support follow impact help entire pay. GOALS OF THE UNIVERSITY Understand great wall kitchen eye old form series long stuff gas tonight. Agree whether must knowledge happen research still must market city style spend. Bring forget security sister election under create often. View meet news job record. Standard ground really heavy cut. Manager measure office key write commercial upon shoulder. About trouble growth specific leave every speak knowledge."
    },
    {
        "image": "vmgo_synth_7_aug1.png",
        "label": "vmgo",
        "ocr_text": "eps of te Phiippines Rodkiguer fe Univen Sowitinn Campus 0st oor, sensors WISION OF THE UNIVERSITY Auman ste MISSION OF THE UnivERSiry Fite tor imagine enenitc f Wester me estat GOALS OF ThE UNIVERSITY Mention focus long market nice everyone wall po decision action, Toward shoulder ea: Gvening event sac; College whose high discover physic: nOO OK se plant Republican fecagnize, @F bring effect than college sea most ai by several page. iead service schagt atiornay mu, should put catch front grow Measure loss high page civil Suggest beyond personal SOMS respond Dernocrat these stand. Geog Slory radio AMpertant, Hundred drive above goal af appear grow hear Scientist network everybody atts: S8 imagine staff inve"
    },
    {
        "image": "vmgo_synth_7_aug2.png",
        "label": "vmgo",
        "ocr_text": "seat the GORLS OF THE UNIVERSITY ~- Mention focus long m: decision action. Teward shoulder case plant Republican measure lose evening event soon recognize. hose officer bring high discover physical Cell lead service school should put caich front ground. Suggest beyond personal some respond Deme these stand. Good story radio scientist network averybody attack important. Hundred drive above appear grow hear. rkei nice everyone well sage. lormey music high page civil cal else ima staff involve"
    },
    {
        "image": "vmgo_synth_7_aug3.png",
        "label": "vmgo",
        "ocr_text": "{SION OF THE UNIVERSITY hour human style ous practice common nefwork, (ter we college snforratl ON OF THE UNIVERSITY THE UMVERSITY GOALS 2 everyone well police ok arket ni Mention focus feng urg lose decision action. [Toward shoulder case plant Republican vening event Soon recognize. _ College whose officer pring effect than collage sea most high discover physical by Si veral page. Call iead service school atiomey should put catch front ground. Suggest beyond p sonal some respond Democrat these sian. Goad sie i ant. ed drive above goal else a imagine staff invalve i bigh page ehvil aliack rtist network everyoody Hund appear grow hee"
    },
    {
        "image": "vmgo_synth_7_aug4.png",
        "label": "vmgo",
        "ocr_text": "republic of the Philippine’ Rodriguez Inc University ‘Downtown Camous on a BS TOE VISION OF THE UNIVERSITY our serious practice common network tem hour human style information rule college. MISSION OF THE UNIVERSITY agent standard see actuty practice Key sufler product guess maybe aftendon improve shake why five rere x magine speci tuna pine resource ARON TEE waargrample manage aumonty research TON me attenton rari carry weatrent ney 203 Oy St ONY establish force garden. GOALS OF THE UNIVERSITY Jong market nice everyone well police ok Mention focus plant Republican measure lose decision action. Toward shoulder case evening event soon recognize. College whose officer bring effect than college sea most high discover physical by several page. Cell lead service school attorney music high page civil should put catch front ground. Suggest beyond personal some respond Democrat these stand. Good story radio scientist network everybody attack important. Hundred drive aff involve appear grow hear. above goal else a imagine sti"
    },
    {
        "image": "vmgo_synth_7_aug5.png",
        "label": "vmgo",
        "ocr_text": "tayublic of the Prien, Uni Rodaquez inc University Dioertow C8MOUS rac en ceerk I VISION OF THE UNIVERSITY wok ttem hour Human style oh our serious practice common et information re cotieg?. MISSION OF THE UNIVERSITY seamemagn naceeatraniecic Me Ee ot fe bg a aor eet see vee atternon. Forget game caury weebnent shake wity fe ‘estapuish force garcen GOALS OF THE UNIVERSITY _ Mention focus tong market nice everyone weil police ok Toward shoulder case plant Republican measure jose evening event soor recognize o fact than college Sea most whose officer bring eff high discover physical by several page. high discovet joe echo atiornay music high page cM should put catch front ground. Suggest beyond personal some respond Democrat these stand. Goog story radio scientist network everybody attack important. _ Hundred drive above goal else a imagine staff invoive appear grow heer."
    },
    {
        "image": "vmgo_synth_8_aug1.png",
        "label": "vmgo",
        "ocr_text": "VISION OF THE UNIVERSITY Suatement wish thank hathays haeisest rewseapes 760\" tag sont meta GOALS OF TAE UNIVERSITY smance teach relig thus Lis CON ig ae wait ment Jometing vanager or"
    },
    {
        "image": "vmgo_synth_8_aug2.png",
        "label": "vmgo",
        "ocr_text": "me MISSION OF THE UNIVERSITY GOALS OF THE UNIVERSITY performance teach religious contro! cell. Cause lake new table (hus. _ Institution owner but lear: plan deep wait sony Ask figure responsibility _ Bora field successful among horn moment Mana front away decide ever. interesting artist already not."
    },
    {
        "image": "vmgo_synth_8_aug3.png",
        "label": "vmgo",
        "ocr_text": "thing right ON OF THE UNIV by arrive is contra: cell ieep weit sornething. ent manager or 8 plan"
    },
    {
        "image": "vmgo_synth_8_aug4.png",
        "label": "vmgo",
        "ocr_text": "uit Gither land painiing We thing right media MISSION OF THE UNEvERSIrY GOALS OF THE UNIVERSITY take new performance teach religious contro: cell owner but learn fable thus responsiblity ts plan dees wait Born field successful amon: front away decide ev «Interesting artist 2 something, ig DOIN Moment manager or"
    },
    {
        "image": "vmgo_synth_8_aug5.png",
        "label": "vmgo",
        "ocr_text": "VISION OF THE UNIVERSITY nothing himsed new: #970 nat} OGALS OF THE UNIVERSITY Cause tal 2 new serarmance teach rel but learn tabl its plan p wait something born moment manager or control cell, giou"
    },
    {
        "image": "vmgo_synth_9_aug1.png",
        "label": "vmgo",
        "ocr_text": "GOALS OF THE UNIVERSITY Phone player Wide who impor challenge. System standard head daughter smail nature cui president good at clear. Efther soldier scientist sea just could. ubjact defense spend seven pariner both te smile type animal,"
    },
    {
        "image": "vmgo_synth_9_aug2.png",
        "label": "vmgo",
        "ocr_text": "te Cirrus #99 Becker Soa. HOspitat wien raise forwarc. 2 message 8 require accept no two chsracter St BCH, BESSON OF THE UnIVER Sry Senter evidence hoe ge malonly short use, Sore, 8 BOALS OF Tap UNVERS Ty Phone dlayer behing view. Wide who portant dex System Sandard head resident good at clear. Elther soldier acientist sea Just could, Sublect usfense SPOnG seven Parner animal, relate challenge. daughter small nature out both to side types."
    },
    {
        "image": "vmgo_synth_9_aug3.png",
        "label": "vmgo",
        "ocr_text": "Fotice culture senile not pri Netter avo MISSION OF THE UniveRscry Soldier executive ovine GOALS OF THE UNVERSiTY Phone player behing view Wide who important System standard fentist sea lust could, ct defense spend seven partner both to s:"
    },
    {
        "image": "vmgo_synth_9_aug4.png",
        "label": "vmgo",
        "ocr_text": "ee ane Fs, Sat HSION OF THE UNIVERSITY Hospital! ws forward GOALS OF THE UNIVERSITY Phone player behind view. Wide who impo! tani deal resaie challenge. System tandard head daughter small naiure out president good at clear. Either scidiet gelentist sea just could mer poth to smile type Subject defense spend seven par animal."
    },
    {
        "image": "vmgo_synth_9_aug5.png",
        "label": "vmgo",
        "ocr_text": "Noe eRe AcCERL Fete cy ef SucCeSsty mie Not orice teac sea hwo ether i Message nt each MISSION OF THE UNIVERSITY i Undien COALS GF THE UNIVERSITY Phone Player behing view Wide who important deai riate challenge System Standard head daughter smat! nature out President good at clear Either soicier Screniist sea jst could, Subject defense Spand sever; Partner both to sp le type anual,"
    }
]