[
    {
        "image": "workload1_synth_10_aug1.png",
        "label": "workload",
        "ocr_text": "Facuty Workload Distnbuton College of Scwence Phrysical show wite follow store draw movant agteamant. Somebady wide prove ctin cept altroagts cow Teaching Load: 14 units (13 hours week) Research: Active -- Great project Extension: 3 activities Administration: Coordinator Community Service: 2 engagements tonege of Heme UE Sector Proven Cance magn mamt aah gem My BEE Review Penman: 4. Prepare documentation: compile workioad records, teaching schedules, research outputs, extension activities, and any supporting evidence. 2. Pre check by Chair: department chair performs completeness check and requests any missing items 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the college. 4, Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days) 5, Consolidate findings: reviewers subinit written findings and recommended adjustments te the chair 6. Decision and communicate: chair reviews recommendations, finalizes workioad adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within 5 working days of noiification; appeals are handied by the collage committee."
    },
    {
        "image": "workload1_synth_10_aug2.png",
        "label": "workload",
        "ocr_text": "doy 8 SPO\" we flow store raw reveal agremeng Somebody wide prove one report although oor Teaching Load: 14 units (13 hours week) Research: Active Great Project Extension: 3 activities Administration: Coordinator Community Service: 2 engagements 1. Prepare documentation: compile workload records, teaching Schedules, research outputs, extension activities, and any Supporting evidence. 2. Pre check by Chair: department chair performs a completeness check and requests any missing items. 3. Assign reviewers: chair assigns two impartial reviewers with relevant ©xpertise from the College. 4. Review Period: reviewers evaluate the and identify di i S, submitted materials Standard revi lew window: 10 wers submit written findings and idjustments to the chair. 7. Clarification appeal within 5 wot ity may submit Clarifications or handled by the col rking days of Notification; €ppeals are lege committee."
    },
    {
        "image": "workload1_synth_10_aug3.png",
        "label": "workload",
        "ocr_text": "- Teaching Load: 14 units G hours week) hy Active Great project Extension: 3 activilies Agrministration: Coordinator Community Service: 2 engagements 4. Prepare documentahcn: Comp 5 outputs, extents i records, teaching vities, and any rf hair, depariment chair performs 4 sary? ng iterss 1G lnpartial reviewers with from the colleges 5 evaluate the submitted mat (standard review witt we TO reviewers submit written findi is to the chair. unicate: chair reviews nalizes workload adjusimen in writing. ation apoeal: uty me 5 working days of nots ied by the college commutice. is, and notifies"
    },
    {
        "image": "workload1_synth_10_aug4.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution College of Science Physical show wife follow store draw reveal agreement. Somebody wide prove one report although door. Teaching Load: 14 units (13 hours week) Research: Active Great project Extension: 3 activities Administration: Coordinator Community Service: 2 engagements cag cf Sounn ULC Seni, Pract: De bag mete ae 2s Review Process: 4. Prepare documentation: compile workload records, teaching schedules, research outputs, extension activities, and any supporting evidence. 2. Pre check by Chair: department chair performs a heck and requests any missing items. rs: chair assigns two impartial reviewers with ‘om the college. wers evaluate the submitted materials ies (standard review window: 10 completeness C! 3. Assign reviewe' relevant expertise fr 4. Review period: revie and identify discrepanci working days). di 4 indings an: 5. Consolidate findings: reviewers submit written fi recommended adjustments to the chair. 6. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within 5 working days of notification; appeals are handled by the college committee."
    },
    {
        "image": "workload1_synth_10_aug5.png",
        "label": "workload",
        "ocr_text": "forkioad Distribution Physica! stow wile follow store draw revead eymemant Sumebody wide prove one rope 201 Teaching Load: 14 units (13 hours week} Research: Active Great oraject Extensior: 3 activities Administration: Coordinator 7 Community Service: 2 engagements Sess ry Review Pranesa: 1. Prepare documentation: compile workload records, teaching schedules, research oulpuis, extension activities, and any supporting evidence 2. Pre check by Chair: department chair performs a com: Hi and reques 3. Assign raviewers: chair assi relevant expertise from the cal 4, Review period: reviewers ev: uate ihe submitted materials ans identity discrepancies (standard review window: 10 days). 5. Consolidate findings: reviewers submit written fink man ded a adjustments te the cha gs and eviews oad adjusiments, and notifie Clanticotin 3 appea appeal within 5 working Gays handled by the ay submit claritic: potfcation; appeais age committee. fONs OF"
    },
    {
        "image": "workload1_synth_1_aug1.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution School of Education Career create which style policy energy rule shoulder. Message keep pass best. Decade on people accept cover grow course. Teaching Load: 16 units (14 hours week) Research: Minimal Blue project Extension: 0 activities Administration: Coordinator Community Service: 1 engagements ‘Sond et Eaeaton— Gap Sees PLE Process: Team pce Ten oan 9 wt Review Process: 1. Prepare documentation: compile workload records, teaching schedules, research outputs, extension activities, and any supporting evidence. 2. Pre check by Chair: department chair performs a completeness check and requests any missing items. 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the college. 4. Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days). 5. Consolidate findings: reviewers submit written findings and recommended adjustments to the chair. 6. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within 5 working days of notification; appeals are handled by the college committee."
    },
    {
        "image": "workload1_synth_1_aug2.png",
        "label": "workload",
        "ocr_text": "Fecutty Workload Distribution —. Schoo! af Education Teaching Load: 16 units (14 hours week} Research: Minimal Blue project Extension: 6 activities Administration: ~ Lommunity Sery; 2. Pre check by Cha completeness chack Assign reviewers: relevant &xpertisa 4. Review benod: rey; and identi working days), 5. Consolidate finding: recommended adjustme: Decision a) nd commu recommendations, fi the faculty mambe, search outputs, extension activities, Supporting 8vidence, lewers evaluate fy discrepancie: ordinator ice: 4 engagements if: department chair Performs a and requests any missing items, chair €8Signs twa impartial reviewers with from the college. the submitted materiats (Standard Feview window: 10 iS: reviewers Submit written findings and nts to the chair nicaie: chair reviews inalizes wo; ad adjustments, and notifies in writing,"
    },
    {
        "image": "workload1_synth_1_aug3.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution School of Education Career create which style policy energy rule shoulder. Message Kee PASS est. Decade on people accept cover grow course. Teaching Load: 16 units (14 hours week) Research: Minimal Blue project Extension: 0 activities _ Administration: Coordinator ity Service: 1 engagements Community cence cog nnes hE Mat TH IACI a compile workload records, teaching Review Pracess: 4. Prepare documentation: schedules, research outputs, extension activities, and any supporting evidence. ent chair performs a issing items. 2. Pre chec! reviewers with completeness check and requests any mi: 3. Assign reviewers: C! ins two impartial relevant expertise from the college. 4, Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days). os Consolidate findings: reviewers submit writtet recommended adjustments to the chair. 6. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submi appeal within 5 working days of notification; aPP' handled by the college committee. n findings and t clarifications OF eals are"
    },
    {
        "image": "workload1_synth_1_aug4.png",
        "label": "workload",
        "ocr_text": "ng Load: 16 units - Research: Minimal Blue or Extension: 0 activities Administration: C Org! nator {1 engager ‘ds, feach and any two in ers evaluate t the paricies (standard review y 5. Cons H recon recommendations, the fac: alr reviews workloac adjusiments May suomi clarifications or are"
    },
    {
        "image": "workload1_synth_1_aug5.png",
        "label": "workload",
        "ocr_text": "~ Teaching Load 16 units (14 hoursAveek) Researc Blue projec O activities Administration: Coordinator Community Service: 1 engagements reviewers with t expert rise from th 4, Review nev entify dis working days}, bmitied m wi 10 ilen fingin is to the chair. 8. cha’ iy reviews."
    },
    {
        "image": "workload1_synth_2_aug1.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution College of Science Our ever street large business authority medical. Impact move build reason power. units (31 hours week) Research: Active Listen Project So Rio Marna ome: ces ‘Steaua nee, Review Process: 1. Prepare documentation: compile workload records, teaching Schedules, research outputs, extension activities, ang any Supporting evidence, 2. Pre check by Chair: department chair"
    },
    {
        "image": "workload1_synth_2_aug2.png",
        "label": "workload",
        "ocr_text": "Faculty workload Distribution College of Science authority medical. Impact mov? puild reason power our ever street large business Teaching Load: 20 units (31 hours week) Research: Active Listen project Extension: 4 activities Administration: Community Service: 2 en cone snes risen EM TONE prone ase serge d records, teaching mpile workloa' s, and any Review Process: extension activitie’ documentation: col 4. Prepare schedules, research outputs, supporting evidence. yy Chair: department chair performs ‘issing items. 2. Pre check b’ reviewers with 3. Assign reviewers: relevant expertise from the college. pmitted materials 4. Review perio te the su! and identify disc! jew window: 10 working days) d: reviewers evalua’ repancies (standard revi 5. Consolidate findings: reviewers submit written fil recommended adjustments to the chair. 6. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within 5 working days of notification; appeals are handled by the college committee. ndings and"
    },
    {
        "image": "workload1_synth_2_aug3.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution College of Science Our ever street large business authority medical. Impact move build reason power Teaching Load: 20 units (31 hours week) Research: Active Listen project Extension: 1 activities Administration: Program Chair Community Service: 2 engagements Cote Somos aa Sow Renan Manna ourey Hock Seas Sra wa Review Process: 1. Prepare documentation: compile workload re schedules, research o1 supporting evidence. 2. Pre check by Chair: department chair performs a completeness check and requests any missing items. 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the college. 4. Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days). 5. Consolidate findings: reviewers submit written findings and recommended adjustments to the chair. 6. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty mai appeal within 5 working days of noti handled by the college committee. cords, teaching utputs, extension activities, and any 'y Submit clarifications or fication; appeals are"
    },
    {
        "image": "workload1_synth_2_aug4.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution College of Science Our ever street large business authority medical. Impact move build reason power: Teaching Load: 20 units (31 hours week) Research: Active Listen project Extension: 1 activities Administration: Program Chair Community Service: 2 engagements cote Somce— an tore Rar Mtn Moy Pees Bena aT Review Process: 4. Prepare documentation: compile workload records, teaching schedules, research outputs, extension activities, and any supporting evidence. 2. Pre check by Chair: department chair performs a completeness check and requests any missing items. 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the college. 4. Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days). 5. Consolidate findings: reviewers submit written findings and recommended adjustments to the chair. 6. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within 5 working days of notification; appeals are handled by the college committee."
    },
    {
        "image": "workload1_synth_2_aug5.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution College of Science Our ever street large business authority medical Impact move build reason power Teaching Load: 20 units (31 hours week) Research: Active Listen project Extension: 1 activities Administration: Program Chair Community Service: 2 engagements seme Seas arg 0 oo Review Process 1. Prepare documentation: compile workload records, teaching schedules, research outputs, extension activities, and any supporting evidence. 2. Pre check by Chair: department chair performs a completeness check and requests any missing items 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the college. 4. Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days). 5. Consolidate findings: reviewers submit written findings and recommended adjustments to the chair. 6. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within 5 working days of notification; appeals are handled by the college committee"
    },
    {
        "image": "workload1_synth_3_aug1.png",
        "label": "workload",
        "ocr_text": "Facuy Workload Dhstrititc forvesd throat. ManagerTons Vey giant stuff need. Developenent it Than sree gh feo prove Teaching Load: 24 units (31 hourshveek) Research: Ongoing Mean project Extension: 4 activities 7 _ Adminisiration. Program Chait Community Service: 4 engagements ac en 0 PB. ES SEE a records, teaching compile workloe any mentation 5, axiension activities, ron outnut scheckilas supporting i 2, Pre check completeness sheck af 3, Assign reviewers: ONE assigns tw ge from the college. reviewers evaue ies tstandare review Wit perform: rnissing te o impartial rev ewers with 2 the submitted materials relevant expert dow: 19 4, Review panos and identify discrepan working days). 5 Consolidate findings: reviewers sun recoramended a6. ugiments fe the chair, air review! 6, Deck cummunicate: Fnalizes workload’ ad is mit written findings 7. Clas appeal within working days handied by the collage sommities."
    },
    {
        "image": "workload1_synth_3_aug2.png",
        "label": "workload",
        "ocr_text": "Facutty Workload Distnnuban —- Business School 19 ans pla suit used: Dovelopmant join sing conoid war’ dueat Management evens Teaching Load: 21 units (31 hours week) Research: Ongoing Mean project Extension: 4 activities Administration: Program Chair Community Service: 1 engagements Hevlew Precest 4. Prey tation: compile workload rec rds, teaching pare document ules, research outputs. 4 tension activiti and any upporing evidence. 2. Pre check by Chair: department chair performs completeness check and requesis any missing i 3. Assign reviewers. chair assigns two impartial ré relevant expertise from the college. 4 Review pened: reviewers evaluate the submitted materials ang identify discrepancies (standaid review window: 10 working days). 5. Consotidate findings: reviewers submit written findings end recormmended adjusimanis 10 the chai 6. Decision and communicate: chaii reviews: racornmendations, finalizes workioad adjustments and notifies the faculty member in writing 7. Clarification appeal’ feculty nay submit appeal within 5 working days of notification, ap handied by the college comimiee. salions OF eals are"
    },
    {
        "image": "workload1_synth_3_aug3.png",
        "label": "workload",
        "ocr_text": "nt joie sing consider forward threat. Macagemant every Teaching Load: 24 units (31 hoursAveek} Research: Ongeing —- Mean project Extension: 4 activities Administration: Program Chair Community Service: 1 engagements Hy SE RENO: ee Renee eee Ng re Review Prowese: compile workload records, tes arch outputs, exte: idence, supporting e 2. Fre c by Chair: department chair performs compistenass check and requests any missing Hems, 3. Ass’ ‘eviewers. ir assig relevant expertise from the college 4, Review pesiod: reviewers evaluate the submitied matariais and identify sorepancies (standard raview window: 16 working days}, 5. Consolidate fi recommended a: 8. Dacisi NGS! justments Mand commu recommendations, fina! the faculty member in wr ag 7. Clarification appeal: faculty may submit clarifications or appeal within S working days of notification: appeals are handled by the college commniities. nents, and notifies"
    },
    {
        "image": "workload1_synth_3_aug4.png",
        "label": "workload",
        "ocr_text": "- Teaching Load: 27 unlis 4 hourshvesk)} Research: Ongoing -- Mean project 4 activities ion: Program Chair Community Service: 1 engagements Review Process: 4, Prepare documentation: compile wi fdoad records, teaching i and any artiment chair performs a request any missing items 3 iwo impartial re Pre ack by Chait: oe completensss check 3. Assign reviewers: chai releve 4, Review period: MOTs and identity discrepancies (standard review working 1g aye) wars With mitted mater adow: 1 revie wers submil writen findings and icate: s, finalizes workload adjustments, and notifies member in wriling 5 facut ity may submit ola ing days of notification; appeals are f oe commitice. ications oF"
    },
    {
        "image": "workload1_synth_3_aug5.png",
        "label": "workload",
        "ocr_text": "plant stult need, Daveten Aveek) Mean project Teaching Load: 24 units (34 hours: Research: Ongoing dension 4 actividies [= _ Administration: Program Chair _ Community Service: 1 engagements ce NU GML HS NEAT eaves Review Proves q, Prepare documentation: compile workiaad racords, weaching sonedul research oulpurs, extension activi 3, and any suppor: evidence 4 chair performs 8 Chair: depanmed! 2. Pre check compieiene: check and req asis any missing items awe impartial reviewers with chi relevant expertise from the college 4, Review period: reviewers evaluate the submitted materials and identify digcrepancies istandard review vandow: 40 3, Assign reviews! working days). 5 Consolidate Andings. reviewers submit written findings and recommanded adjustments {9 the chai. ramunicate: ck Views E adiusiments. and noufies 6. Decision and endations in writing. af: faculty may SU) mit clarifications OF of notification, appeals are 7. Ch appeat within handied by ti"
    },
    {
        "image": "workload1_synth_4_aug1.png",
        "label": "workload",
        "ocr_text": "Foruily Workload Disintution ~. College of Are art Letters, Congress attack ecard munth program histary face Property candtdnto fa down. Saciel wart everybody career group Teaching Load: 19 units (32 hours week) Research: Ongoing Finally project Extension: 3 activities Administration: Dean Support Community Service: 4 engagements mentation: compile workioad records, teaching Schedules, research out, Puts, extension activities, and any Supporting evidence. 2. Pre check by Chair: department chair performs a 3 Tequests any missing items. 3. Assign reviewers: chair assigns two impattial reviewers with relevant expertise from the college. 4. Review Pernod: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days}. 5. Consolidate findings: reviewers submit written fi recommended adjusiments to the chair, Decision and communicate: chair reviews recommendations, finalizes workload adjusiments, and notifies the faculty member in writing 7. Clarification appeal: faculty may submit Clarifications or appeal within 5 working days of notification; appeais are handied by the college committee. ndings and"
    },
    {
        "image": "workload1_synth_4_aug2.png",
        "label": "workload",
        "ocr_text": "Faruity Workload Diettibution Colege of Artz and Letters ‘Congress sitack vecerd marth program Nistory face. Property candi 7 be ae te fai den Soin’ war Teaching Load: 19 units (32 hours week) Research: Ongoing Finally project Extension: 3 activities Adrninistration: Dean Support Community Service: 1 engagements CONN LA AL NO mn PE PU A RD eS a Review Process: 4. Prepare documentation: compile workload records, teaching schedules, research outputs, extension activities, and any supporting evidence. 2. Pre check by Chair: department chair performs a completeness check and requests any missing items. 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the college. 4. Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days). 5, Consolidate findings: reviewers submit vaitten findings and recommended adjustments to the chair. 6. Decision and communicate: chair reviews 7 recommendations, finalizes workload adjustments, ang notifies the faculty member in writing. 7. Clarification appeal’ faculty may submit clarifications or appeal within 5 working days of notification; appeais are handied by the college commitise."
    },
    {
        "image": "workload1_synth_4_aug3.png",
        "label": "workload",
        "ocr_text": "Faulty Workload Distribution —- College of Acts and Lotters Congress atiack record month program tistary face. Property candidate fu! down. Social wart evorybody career grip Teaching Load: 19 units (32 hours week) Research: Ongoing —— Finally project Extension: 3 activities Administration: Dean Support Community Service: 1 engagements SRE 0 et RL Pn a enn em BoE ey ag hs 98 Ra mS Review Proress: 1. Prepare documentation: comptie workload records, teaching schedules, research outputs, extension activities, and any supporting evidence. 2. Pre check by Chair: department chair performs a completeness check and requests any missing items. 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the coliege. 4. Review period: reviewers evaluate the submitted materiais and identify discrepancies (standard review window: 10 working days). 5. Consolidate findings: reviewers submit written findings and recommended adjustments to the chair. 8. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies ths faculty member in writing. 7. Clarification appeai: facuity may submit clarifications or appeal within S working days of notification; appeals are handied by the collegs committee."
    },
    {
        "image": "workload1_synth_4_aug4.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution College of Arts and Letters Teaching Load: 19 units (32 hours week) Research; Ongoing inally Project Extension: 3 activities Administration: Dean Support Community Service: 4 engagements COP ees. Wak Ht aia Proms: Pape ren 'Stowtany capta now ax ne a peru, Review Process: 1. Prepare documentation: compile workload records, teaching Schedules, research outputs, extension activities, and any Supporting evidence, 2. Pre check by Chair: ubmitted materials and identify discrepancies (standard review window: 1 working days), Consolidate findings: reviewers submit written findings and recommended adjustments to the chair, ecision and communicate: chair reviews recommendations, finalizes workload adjustments and notifies the faculty member in writing, 7. Clarification &a appeal within 5 wo, peal: faculty May submit Clarifications o) handled by the rking days of Notificati r On; appeals are College committee,"
    },
    {
        "image": "workload1_synth_4_aug5.png",
        "label": "workload",
        "ocr_text": "Fecutly Workicad Distrioution ~- College of Arts and Lotters Congress sitack record month pragrmin history face. Property candidate tall down, Soci want sruerybode carats go. Teaching Load: 19 units (32 hours week) Research: Ongeing Finally project Exterision: 3 activities Administration: Dean Support Community Service: 1 engagements by 2A eLeINY FC oun Nie Em eS Keene Ea eEE te REN ea Pm NE Review Precem: 4. Prepare documentation: compile workload records, teaching schedules, research outputs, extension activities, and any supporting evidence. 2. Pre check by Chair. department chair performs a completeness check and requests any missing items. 3. Assign reviewers: chair assigns two impartia! reviewers with relevant expertise from the college. 4. Review period: reviewers evaluate the submitted materials and identify discrepencies (standard review window: 10 working days). 5. Consolidate findings: reviewers submit written findings and recommended adjusiments to the chair. 6. Decision and communicate. chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within working days of notification; appeals are handled by the ccliege commities."
    },
    {
        "image": "workload1_synth_5_aug1.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distibution Business School (Charge see back imesiment sericuy if choice. Break Congress son ‘evel chid brother pess Teaching Load: 13 units (19 hours week) Research: Ongeing —~ Fire project Extension: 3 activities Adrninistration: Coordinator Community Service: 1 engagements ‘Suans Sere! Group Wintnn Senth Process: Fast b0 k dhoove of exat Review Pracew: 1. Prapare documentation: compile workload records, teaching Schsdules, research outputs, extension activities, and any supporting evidence. 2. Pre check by Chair: department chair performs a compieteness check and requests any missing ttems. 3. Assign reviewors: chair assigns two impartial reviewers with relevant expertise from the college. 4. Review period: reviewers evaiuate the submitted materials and identify discrepancies (standard review window: 10 working days). 5. Consolidate findings: reviewers submit written findings and recommended adjustments to the chair. §. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeai: faculty may submit clarifications or appeal within 5 working deys of notification; appeals are handied by the college committee."
    },
    {
        "image": "workload1_synth_5_aug2.png",
        "label": "workload",
        "ocr_text": "child brothe ice. Brsak Congta: Teaching Load: 13 units (19 hours week) Research: Ongoing Fire projec Extension: 3 activities Administration: Coordinator Community Service: 1 engagements 4. Prepare docume: vies, researc: pporing evidence. e oheck by Ch sornple 3. Assign relevant exin 4. Review p comple workload records, teaching s, extension activities, and ary outge lewers: chair assigns two impartial reviewers with ihe colleg recommended ad} Hand communicats dations, finalizes w jenis, and neviies ration 8 are y submit clariti y or tification; apne: un 5 working days of a handied by the cc cominlé"
    },
    {
        "image": "workload1_synth_5_aug3.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution Business School Charge see back investment serious ‘f choice. Break Congress son level Child brother pass. Teaching Load: 13 units (19 hours week) ~- Research: Ongoing Fire project Extension: 3 activities Administration: Coordinator Community Service: 1 engagements Sushess Schoo!— Group Watson Smith; Process: Food book choose of exist Review Process: 1. Prepare documentation: compile workload records, Schedules, research outputs, extension activities, and any Supporting evidence, 2. Pre check by Chair: department chair performs a completeness check and requests any missing items, 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the College, 4. Review period: reviewers evalua and identify discre i Pancies (standard review window: 4 working days). 5. Consolidate fi recommended a teaching ndings: reviewers submit written findings and djustments to the chair. Decision and communicate: chair reviews recommendations, finalizes worklo ad adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit Clarifications or appeal within 5 working days of Notification; appeals are handled by the college committee."
    },
    {
        "image": "workload1_synth_5_aug4.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution Business School Charge see back investment serious if choice. Break Congress son level child brother pass. Teaching Load: 13 units (19 hours week) Research: Ongoing Fire project Extension: 3 activities Administration: Coordinator Community Service: 4 engagements Business School Group Watson Smith: Process: Food book choose of exst Review Process: 1. Prepare documentation: compile workload records, teaching schedules, research outputs, extension activities, and any supporting evidence. 2. Pre check by Chair: department chair performs a completeness check and requests any missing items. 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the college. 4. Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days). 5. Consolidate findings: reviewers submit written findings and recommended adjustments to the chair. 6. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within 5 working days of notification; appeals are handled by the college committee."
    },
    {
        "image": "workload1_synth_5_aug5.png",
        "label": "workload",
        "ocr_text": "H choice, Brack Congrans eon leved cited broth Change see bY Teaching Load: 13 units (19 hoursiweek)} _ Researoh: Ongoing Fire px oject Extension: 3 activities Adrninistration: Coordinater Community Service: 1 er ngagements ‘tessa Sr; Proce Fed 2 Buerinecs Seha0h—= Os Review Process: 1. Prepare docume! tor compile workload records, te Hing sch edulas eareh outputs, ies, and a supperting 2. Pre check b Chair. and Pecosts any! m i impartial g items. 3. ssign te aviewai viewers with relevant expertis the submitied materia s ed review wirow. 10 4 findings and 5 6 re dae findings. review recommended adjusiments to the che 6. Decision and communicate chairs andations, finalizes work! oad adjustments ber in writ eal: faculty may sul nd notifies clarifications oF are within y the college committee."
    },
    {
        "image": "workload1_synth_6_aug1.png",
        "label": "workload",
        "ocr_text": "arent from apcond insu. Right cexnate trot units (26 hoursiweek) ocal project Teaching Load: 13 Active ‘ activities iminigtration: Dean Support Community Service: 2 engagements a cesenton— Neon tae rein ese Feweest PHS workload (| eiion: epare document oh arch outpuls, extension activities Suppo! 9. Bre check DY Chair. depart! nt chair performs yeness check is any MHSSING Hems. jal reviewers with cor 2: 3. Assigh revi’ gns we impart pert 4, Review period: nd identity di days}. 5, Consolidate findings: reviewers gubmit written: fi commended adj icate, chair reviews iments, aod notifies ers, chai? ass 9 trom the colleg?. reviewers evaluate ine (standaré review window: 40 ited materials and culty May submit clarifications of of notification: appeals are Chari appeal within nandied by He calleg?"
    },
    {
        "image": "workload1_synth_6_aug2.png",
        "label": "workload",
        "ocr_text": "roin second iss Local proje stration: Dear: Support Community Service: 2 engagements Pravese: ih or s (standard review window: colleg iwritten"
    },
    {
        "image": "workload1_synth_6_aug3.png",
        "label": "workload",
        "ocr_text": "1D of Eh ation Teaching Load: {3 units (26 hourshveek) Research: Active Local project Extension: 4 activities Administration: Dean Support Community Service: 2 engagements Provess: nm Ss ules, Ch output, SuBbOrtINg evidens Pre check by Chai partment chgir Orig 28S check and reque 3. Assign reviews S relevant expert 4 compile workload exte: performs NiGate findings: rey recommended fOn and comm recommendat WETS SUDMIE writ $s fo the ch ty member in writing. icat apasal: f; r 78 working days of not he colle committe: riications or floation: appeals are handled by {"
    },
    {
        "image": "workload1_synth_6_aug4.png",
        "label": "workload",
        "ocr_text": "Scheal siioass Dastrihution sat from 9809 pact pacticutiay gece ache address very OS Teaching Load: 13 units (25 hours week) _ Research: Active —~ Local project _ Extension: 4 activities _ Administration: Dean Support _ Community Service: 2 engagements erencgnen than, ae Ts PE wea nnece Se mantation. comple sad records, teaching outputs, extension activities, and any Review Process: 4. Prepare docu schedules, research supporting evidence. Chair depat ament Chae performs 6 jasing tems. Pre check 6 awers with ness Che: yesis any t gas two impartial 1 cand req ohait &¢ from gre colles? ad materials expense 4, Review period: reviewers avaluate the submit discrepancies {standard review window: 19 deni findings and jewars submit WE 5, Consel the chair. recone nded 6. Decision and coremun recommendaiors finaliz. the facuily member in we 7. Clarification appeal 5 working flege cate: chat 7 eS es workload adjusiments, and nouhes submit cla acuby may BON, appeals are ys of protic ommitie?. apneal witht nandied by the"
    },
    {
        "image": "workload1_synth_6_aug5.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution School of Education Remember act lose that other im, act particularly. End nice create throu. she four study finally from. Lose ighout from second issue. Right seem adult address very place Teaching Load: 13 units (26 hours week) Research: Active Local project Extension: 1 activities Administration: Dean Support Community Service: 2 engagements Seheel of Eoveaton— Ine Moon, Lee and Ken; Process: Water crete other someone. Review Process: 1. Prepare documentation: c schedules, research outputs. supporting evidence. 2. Pre check by Chair: department chair performs a completeness check and requests any missing items. 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the college. 4. Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days). 5. Consolidate findings: reviewers submit written findings and recommended adjustments to the chair. 6. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within 5 working days of notification; appeals are handled by the college committee. ‘ompile workload records, teaching extension activities, and any"
    },
    {
        "image": "workload1_synth_7_aug1.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution School of Education Animal real thought. Though add memory plan example. Teaching Load: 24 units (24 hours week) Research: Minimal Behavior project Extension: 0 activities Administration: Program Chair Community Service: 1 engagements ‘School of Eéveaton and Sons Moris LLC: Process: Him factor recently star big form, Review Process: 1. Prepare documentation: compile workload records, teaching schedules, research outputs, extension activities, and any supporting evidence. 2. Pre check by Chair: department chair performs a completeness check and requests any missing items. 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the college. 4. Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days). 5. Consolidate findings: reviewers submit written findings and recommended adjustments to the chair. 6. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within 5 working days of notification; appeals are handled by the college committee."
    },
    {
        "image": "workload1_synth_7_aug2.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution Schoo! of Education ‘Asien! reat thought Though add memory plan exemple Teaching Load: 24 units (24 hours week) Research: Minimal Behavior project Extension: 0 activities Administration: Program Chair Cornmunity Service: 4 engagements shen of cation wot fens Meni A: Pract ee tnctn sec wi gO Review Precese 4, Prepare documentation: compite schedules, research outputs, extension ac! supporting evidence. 2. Pre check by Chair: department chair performs completeness check and requests any missing ems. 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the coltegs. 4. Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days}. findings: reviewers gubmit written findings and 5. Consolidate recommended adjustments to the chair, &. Decision and communicate: chair reviews recommendations, finalizes workload adiusiments, 4 notifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within 5 working days of notification; appeals ere handled by the coliege committee. workload records, teaching tivities, and any"
    },
    {
        "image": "workload1_synth_7_aug3.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distnbuttoiy Anurnat reel thovoht “Though add memory plan example Teaching Load: 24 unils (24 hours week) Research. Minimal Behavior project Extension: 0 activities Aaministration: Program Chair Community Service: 1 engagements Revs 4. Prepare documentation: compiie workload records, teaching schedules. research outputs, extension activities, and any supporting evidence 2. Pre check by Chair: department chair performs a ieness check and requesis any mis 1 reviewers: chair assigns two impertial reviewers with relevant expertise from the college 4. Review period: reviewers evaluate the submitted materiais fy discrepancies (standard review window: 10 working days) idate findings: reviewers sub recommended adjustments to the chair 6. Decision and comreaun chair reviews recommendations, workioad adjustments, and notifies Procest itlen findings a 7 ity may submit clarfications or appeal s Gf notification; appeals are handied by the college committee."
    },
    {
        "image": "workload1_synth_7_aug4.png",
        "label": "workload",
        "ocr_text": "n= School of Facuily Workload Distrib a nsal thought. Though aris exemple Teaching Load: 24 units (24 hoursAweek) Research: Minimal -- Behavior projec’ Extension: 0 activitl Administration: Program Chair Community Service: 1 engagements Review Preece: 4. Prepere docu drecords, leaching hedulas, re: ities, and any pporting evidence, @. Pre check by completeness check and reques depanrr 3. Assign reviewers: chai expertise from t bmil written findir he chair. onair review! 8. Decision and comr recommendations, ft the faculty memb 7. Clarification appeal: facully ma appeal within 5 working days of n: handied by the college committee."
    },
    {
        "image": "workload1_synth_7_aug5.png",
        "label": "workload",
        "ocr_text": "iy Workload Distribution Schoo! of Education ugh? Though add memezy plan exami Teaching Load: 24 units (24 hours week) Research: Minimal Behavior project Extension: 0 activities Administration: Program Chair Community Service: 1 engagements Se aes ein se i fom nm compile workioad records, leaching activities, and any pleteness check and requests any c n reviewers: chal a ns two impart relavant expertise from the col reviewsrs evaluate th ited materials wancies (standard review window: 10 were WN al revi swers submit written findings and ihe chai chair review! s workioad adjusime mended adju ision ane comin and notifies OF handle by the collage comn"
    },
    {
        "image": "workload1_synth_8_aug1.png",
        "label": "workload",
        "ocr_text": "ty Workluad Distribution Age 6 Among interest Teaching Load: 12 units (28 hours week) Research: Ongoing Always project Extension: 2 activities Administration: Coordinator Coramunity Service: 3 engagements 4. Prepare deocumeniation: compile workload records, fea hing ‘oh oulpuls ities, and any evidence. Chair, department cnair perfor and requests any missing iterns. wears With evaluaie the submitted materi 8 (standard review window: 10 4, Review p and identify disc it written findings and J communicate: ons, finalizes woi handled by the emiegs committee,"
    },
    {
        "image": "workload1_synth_8_aug2.png",
        "label": "workload",
        "ocr_text": "Facuity Workload Distribution -~ School of Education Amana ietareating souace sonic eaction cae cxsae. Hage oh away eNO court Teaching Load: 42 units (28 hourshweek) Research: Ongoing Aways project _ Extension: 2 activities Administration: Coordinator Community Service: 3 engagements eect Gaseation PLE Reh Ors OSH Uwsty hata? ween expe #00 Rertew Proves 4. Prepare documentation: compile workload records, teaching schedules, research outputs, extension activities, end any supporting evidence. ry Pre check by Chair: departme! completeness check and reques' 3. Assign reviewels: chair assigns two impartial relevant expertise from the college. 4, Review period: reviewers evaluate the suomitted materials and identity discrepancies (standard review window: 410 working days). 5, Consolidate findings: reviewers submit written: findings anc recommenced adjustments to the chair. 6. Decision and communicate: chair reviews racommendarons, finalizes workload adjustments, and noiifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications of appeal! withir 5 working cays of notification; appeals are pandied by the college committee. it chair performs ts any missing items. reviewers with"
    },
    {
        "image": "workload1_synth_8_aug3.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution School of Education ‘Among interesting source specific direction car Course. Age sit away environmental court Teaching Load: 12 units (28 hours week) Research: Ongoing Always project Extension: 2 activities Administration: Coordinator Community Service: 3 engagements Set60 of Eeueaton PLC Reh Gus: Process: Usuaty te st term mys energy Review Pracess: 1. Prepare documentation: compile worl schedules, research outputs, extension Supporting evidence. 2. Pre check by Chair: department cl completeness check and requests ai 3. Assign reviewers: chair assign: relevant expertise from the Colle 4. Review period: and identify discre; working days). 5. Consolidate findings: reviewers submit recommended adjustments to the chair. 6. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within 5 working day: ‘Ss of Notification; appeals are handled by the college committee. kKload records, teaching activities, and any ‘hair performs a ny missing items. S$ two impartial reviewers with ge. reviewers evaluate the submitted materials Pancies (standard revi lew window: 10 it written findings and"
    },
    {
        "image": "workload1_synth_8_aug4.png",
        "label": "workload",
        "ocr_text": "Workload Di Faculty Avan interes Age sit sway envirosmental court eaching Load: 12 units (28 hours week} Research: Orgel ng Abways profect Extension: 2 activiti Administration: Coc Community Service: 3 engagements Review Pracexs: 1. Prepare documentation: ho comple workload i hing ATAS a ing tems. \"0 impartial reviewers With 5 evaiuate the submitied materiais BI J identify repancies 3 fata ndard review window. 10 wor king days 5, Consolidate Heng mit clarifications or appeals are he one led by the cailege comir"
    },
    {
        "image": "workload1_synth_8_aug5.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution School of Education ‘Among interesting source specific direction car course. Age sit away environmental court Teaching Load: 12 units (28 hours week) Research: Ongoing Always project Extension: 2 activities Administration: Coordinator Community Service: 3 engagements Soa Eteaton— PLC Rich Gap: Process Usuay bet am myself ener Review Process: 1. Prepare documentation: compile workloai schedules, research oi supporting evidence. 2. Pre check by Chair: department chair performs a completeness check and requests any missing items. 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the college. 4. Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days). 5. Consolidate findings: reviewers submit written findings and recommended adjustments to the chair. 6. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit Clarifications or appeal within 5 working days of notification; appeals are handled by the college committee. id records, teaching utputs, extension activities, and any"
    },
    {
        "image": "workload1_synth_9_aug1.png",
        "label": "workload",
        "ocr_text": "ad: 14 units (22 reaching L Bes ch: Minimat Extension: 5 acti ivitles Administration: f Dean Support Community 8. 2 engag hours week) Feel project Servic ments ants le work! d records, tea! SNsion ac Vitie: riment chair bers j Tequests ary nissing ite: find: recommended adjus Dec} Aarification a) appeal with Rand} peal VS college d by the o y¥ submit clariti of notificas"
    },
    {
        "image": "workload1_synth_9_aug2.png",
        "label": "workload",
        "ocr_text": "_ Teaching Load: 14 units (22 hou siweek) Research: Mini nal Fee! project _ Extension: activittes Administration: Dean Support Community Service: 2 engagements wave Anerson, Pree workload records, teaching and any cal Process: Prepare do se chedule Sy mentation compil research outputs, OX anaian acu arorms ing tem ai reviewers with Chai pariment chai pe! check and pene any agigns two view period gisorepanc! ays}. aie findings: reviewers to the abt 5, Cons ommended adaustnents 6. Dect raanicaie. chair recommendations, finalizes workload faculty eraber in wing facu ng days ot Geet appeal within 5 wal ge committe handled by the cor"
    },
    {
        "image": "workload1_synth_9_aug3.png",
        "label": "workload",
        "ocr_text": "Facuily Workload Olstritution Schoot of Education Table name get more. Teaching Load: 14 units (22 hours week) Research; Minimal Feei Project Extension: activities Administration: Dean Support Community Service; 2 engagements SSN0T of Baveatn ne Wars ntenen: Procest. 8 regen vei 390 ay Review Procese: 4. Prepare documentation: coinpile wor schedules, research cutputs, exiensio: Supporting evidence. 2. Pre check by Chair: de, fkioad records, teaching activities, and any partment chair performs a requests any missing items. 3. Assign revie wers: chair assigns two impartial reviewers with relevant expertise from the college. 4. Review period: reviewers evaluate and identify discrepancies (standard working days), 5. Consolidate findings: reviewers submit written findings ang recommended adjustments to the chair. 6. Decision and communicate: ¢! recommendations, finalizes wal the faculty member in writing. 7. Clarification appeal: facui appeal within 5 working de hendied by the the submitted materials review window: 10 ‘hair reviews rkload adjustments, and Nnetifies ity may submit Clarifications of '¥S Of notification; appeals are College committee,"
    },
    {
        "image": "workload1_synth_9_aug4.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution School of Education Table name get more. Teaching Load: 14 units (22 hours week) _ Research: Minimal Feel project Extension: 5 activities _ Administration: Dean Support Community Service: 2 engagements sens of Easaion— Ie Wasa: Pees: gp apenas 2 Review Process: 4. Prepare documentation: compile workload records, teaching schedules, research outputs, extension activities, and any supporting evidence. 2. Pre check by Chair: department chair performs a completeness check and requests any missing items. 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the college. 4. Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days). 5. Consolidate findings: reviewers submit written findings and recommended adjustments to the chair. 6. Decision and communicate: chair revi recommendations, finalizes workload adi the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within 5 working days of notification; appeals are handled by the college committee. jews justments, and notifies"
    },
    {
        "image": "workload1_synth_9_aug5.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Distribution School of Education Table name get more. Teaching Load: 14 units (22 hours week) Research: Minimal Feel project Extension: 5 activities Administration: Dean Support Community Service: 2 engagements Shoal of Edeaton Ine Wardsnderson: Paces: Agu ein stir system any. Review Process: 1. Prepare documentatioi schedules, research out; supporting evidence. 2. Pre check by Chair: department chair performs a completeness check and requests any missing items. 3. Assign reviewers: chair assigns two impartial reviewers with relevant expertise from the college. 4. Review period: reviewers evaluate the submitted materials and identify discrepancies (standard review window: 10 working days). 5. Consolidate findings: reviewers submit written findings and recommended adjustments to the chair. 6. Decision and communicate: chair reviews recommendations, finalizes workload adjustments, and notifies the faculty member in writing. 7. Clarification appeal: faculty may submit clarifications or appeal within 5 working days of notification; appeals are handled by the college committee. in: compile workload records, teaching iputs, extension activities, and any"
    },
    {
        "image": "workload2_synth_11_aug1.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Science Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 20 units (30 hours week) Research: Proposal stage Chance focus. Extension Service: 3 activities. Administration: Committee Member. SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence. 2. Department pre check: Chair verifies completeness and requests missing items 3. Assign reviewers: two impartial reviewers are assigned by the Chair. 4. Review period: reviewers evaluate materials (standard window: 10 working days). 5. Consolidate findings: reviewers submit recommendations to Chair. 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing. 7. Appeals: faculty may submit clarifications or appeals within 5 working days"
    },
    {
        "image": "workload2_synth_11_aug2.png",
        "label": "workload",
        "ocr_text": "Facully Workload Report -~ College of Science Effective dat Ostober 15, 2025. SECTION 2: Summary of Assigned Duties ching: 26 units (30 hoursweek}. neice: activities, ninistraion: Commitice Membe: sroval Pontes cumentation: workload records, course schedules, arch outouts, and evisence 2 Department pre check. Chair verifies completene requests missing items 3. Assign reviewers: hwo snpartial reviewers are Chats 4. Review petied. reviewers evaluate materials (standard window 40 working day 5. Consoikiate findings: reviewers submit re Chair 5. Decision notify faculty in writing ?. Appeats: fac ssigned by the car finvaliz justments and notifies ity may Submit cl ications oF appeals within 5"
    },
    {
        "image": "workload2_synth_11_aug3.png",
        "label": "workload",
        "ocr_text": "Facuity Workload R port -— College of Science Effective date: October 15, 2025 HisivService: 3 ax Administration: Oo 1 Pepe: Be ‘epare documentation: wor earch cuipi 2. Department » NG evidence, check: Cheir verifies completenass and mS 2 Assign reviewers: tuo impartial reviewers are assigned by the Chaiv A. Review period: reviewers evaluate p 20 working days) 5. Consolidate findings: reviewers submit recon Chair 5. Decision notify Chair finalizes adjus faculty in writing. 7 Appeais: facully may submit clarifications or appeats withi working days ‘eriais (standard window: dations te tants and not ies"
    },
    {
        "image": "workload2_synth_11_aug4.png",
        "label": "workload",
        "ocr_text": "Facuity Workload Report —~ Con Efactwe dare October 15, 2025 SECTIONAL. Summary of Assigned Duves Tracing 20 ursts (3 Research Proves ExtersonSenne pours week i Stoye —- Chance focus SECTION 2: Benen sero ress 1 Prepare cacumentation workioad recorty COUISE Schediutes search outputs. and eviaer 2 Cepartinent pre choc fequesis missing tome 2 Assign reviewars Chase 4 Review pened 1 10 working days} 5 Conslictat chee Decision not faourty on write verites comph noSS BG ‘wo mpertial reviewors are ass CHIMES avelUaIO menerals (standard wing soa fe fixhngs reviewers SuDmit recom endations to"
    },
    {
        "image": "workload2_synth_11_aug5.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report Coliege of Science Effective date: October 15, 2025 SECTION 3: Summary of Assigned Duties Teaching 20 units (20 hours week} Research: Proposat Stage ~~. Chance focus. Exi ¢. 2 activities Aanhetener 6 Committee Member. SECYION 2: Review Agprovis Pracens 1. Prepare doctimentation: worklond records, course Schedules, feseaich outputs, and evidence 2. Department pre check. Chair verifies completeness and equests missing items. 3. Assign reviewers {wo impartia’ reviewers are assigned by the Chair 4. Review period: 1 10 working days) 5. Consolidate findings: reviewers submit recommendations to Chair. 6. Decision Aotity: Chair finalizes adjustments and notifies faculty in writing. 7. Appeals facutiy working days. ‘eviewers evatuate materials (standard window: May submit clarifications or appeals vathin S"
    },
    {
        "image": "workload2_synth_12_aug1.png",
        "label": "workload",
        "ocr_text": "'y Worktoad Report College of Science Elective date: October 18, 2025 SECTION 3: Stan FON 2 Seaview ap 1. Prepare documer Fesearch ouinuts, 2. Departeni ation: workiog and evidence ad records, course Chair verifies Onair 4 Review penod: reviewers evaluate materiais (sta dard window #S Submit rac: OmMeNtations to 6. Decision Solty: Chair finalizes ustments 7. Agpeals: faculty may Y Subrit ctantfications er ape working days within 5"
    },
    {
        "image": "workload2_synth_12_aug2.png",
        "label": "workload",
        "ocr_text": "ad Report -- College of Scisnes Faculty Work! Etectve dave: Qetober 15, 202 SECTION 3: Summary of Assigned Duties: Yeacbing 22 vats (33 nox Research Ongoing study ExiensionSerice: 0 activbe Administration: Program Chair. SECTION 2: Review Appravi Process: +. Prepare documentation workload records, course schedules, arch outputs, and evidence 2 Dapariment pre ohack: Chait v requests missing items 3. Assign raviewers: two impartial reviewers are assigned by the viftes Completeness and Chair 4 Review pariod: reviewers evaluate i 20 working days} 8, Consolidate findings. review Chair 6 Decision notity: Chair finaiizes adjuster iting faculty may submat clanficalions sxderd window: torsis (ate submit recommendations ats and notifies appesis within working days."
    },
    {
        "image": "workload2_synth_12_aug3.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Science Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 22 units (33 hours week). Research: Ongoing study Tough focus. Extension Service: 0 activities. Administration: Program Chair. SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence. 2. Department pre check: Chair verifies completeness and requests missing items 3. Assign reviewers: two impartial reviewers are assigned by the Chair. 4. Review period: reviewers evaluate materials (standard window: 10 working days). 5. Consolidate findings: reviewers submit recommendations to Chair. 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing. 7. Appeals: faculty may submit clarifications or appeals within 5 working days"
    },
    {
        "image": "workload2_synth_12_aug4.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Science Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 22 units (33 hours week) Research: Ongoing study Tough focus Extension Service: 0 activities Administration: Program Chair SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence 2. Department pre check: Chair verifies completeness and requests missing items 3. Assign reviewers. two impartial reviewers are assigned by the Chair 4. Review period reviewers evaluate materials (standard window: 10 working days) 5. Consolidate findings: reviewers submit recommendations to Chair 6. Decision notify Chair finalizes adjustments and notifies faculty in writing 7 Appeals’ faculty may submit clarifications or appeals within 5 working days"
    },
    {
        "image": "workload2_synth_12_aug5.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report -~ College of Science Effective date: Getober 15, 2025 SECTION 1: Sumunary of Assigned Duties: Teaching: 22 units (33 hours week). Research: Ongoing study Tough focus. Extension Service 0 activities. Administration: Program Chair SECTION 2: Reverw Aperova Process 4. Prepare documentation: workioad records, course schedules, research outpuis, and evidence. 2. Department pre check: Chair verifies completeness and requasts missing items. 3. Assign reviewers: two impartial reviewers are assigned by the Chair 4 Review oeriod: reviewers evaluate matenals (standard window: 40 working clays). 5. Consolidate findings: reviewers submit recommendations to Chair 6. Decision notify: Chair finalizes adjustments and notifies facutty in waiting. 7. Appeuis: faculty may submit clerifications or appeals within 5 working days"
    },
    {
        "image": "workload2_synth_13_aug1.png",
        "label": "workload",
        "ocr_text": "sty Norkload Report Callege 6} date: October 15, 2025 Duties eff SECTION 3: Summary of Assigned Taaching. 13 units (18 nowséveek) esearch: Proposal stage —~ Range focus ExtenseService: 3 activities. Administration: Commatze Memiet. SECTEON Zs Reine 2 Acrroree Proceso 1. Prepare documentation: workload records, course schedules, research outputs, and evidence, 2. Daparimesi pre check: Chair verifies comptes requests missing items 4. Agsign seviewors: two impartial reviewers ere assigned by the Chait A Review periest reviewers evaluate raaterais {standard window\" WO working days} 5. Consoiidate findings. reviewers submit recommendations to Chair 5. Desiston notify: Chair finalizes adjustments ans notifies: faculty in wating. 7. Appeals: facuity may submit clanfications oF appeals within 5 working days"
    },
    {
        "image": "workload2_synth_13_aug2.png",
        "label": "workload",
        "ocr_text": "atiege of Engineer Facnity Workload Repost tffective dave: October 15, 2025 SECTION 4: Summary of Assigned D eaching: 12 units (19 hours week) Research: Proposal stage —~ Range focu activites, mmmities Mi Extension Servic Administration: C: SRCTION 2; Review approval Pres 1. Prepare documentation: worktoe schedut research watpuis, and evidence. 2 Department pr air verifies completeness and requests missing tems 3. Assign raviewers: two imparti Chet 4. Flaview period. reviewers 10 working day: 5. Consolidate find Chatr Decision notify: Chair finalizes faculty in writin 7. Appeais: faculty may s: working days. i recerds, cours: i reviewers are assigned by the evaluate materials (standard window reviewars ubmit recommendations to simenis and notifies iS oF appeals withia 5"
    },
    {
        "image": "workload2_synth_13_aug3.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report —- Coltege of Engineering Effective date: October 15, 2025 SECTION 3: Sunwnery of Assigned Duties Teaching: 13 units (19 hours week) Research: Proposal stage -~ Range focus. ExtensionService: 3 actwties Administration: Commitee Member. SECTION 2: Review hoproval Process 1. Prepare documentation: workiced records, course schedules, Fresearch outputs, and evidence. 2. Dopai tment pre check: Chair verifies completeness and Tequests missing ttams. 3. Assign reviewers: two impartial reviewers are assigned by the Chair. 4 Review period: reviewers ovaiuate materials (standarc window: 10 working days) 5. Consolidate findings. reviewers submit recommendations to Chair. 6. Decision notify. Chair finalizes adjustments and notities facutty in waiting. 7. Appeals: faculty may submit claifications or appesis within S working days"
    },
    {
        "image": "workload2_synth_13_aug4.png",
        "label": "workload",
        "ocr_text": "Gollege ot Faculty Workload Report fie vive date: October 15, 2625 SECTION 4: Surnmary of Assigned Duties (38 noustweek) sopose! stage -~ Range focus. vService. 3 activities. ration. Commintce Me nits SECTION 2: Review answal Process xd records, course schedules: ay work 1. Prepare documentati research culputs, ant evidence 2 Depart Chair verifies completeness and ert pre ING HieMms. two impartial reviewers are assigned by the ris 3. Assign (evi lew peried: reviewers evaluate materials (standard window. plidate findings: reviewers submit recanimendations i ments and notifies is fi es ac. Decision ratify ally in writh 7 Agpeais: faculty may subme clar working days cations oF appeais within: 5"
    },
    {
        "image": "workload2_synth_13_aug5.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineering Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 13 units (19 hoursiweek). Research: Proposal stage Range focus. Extension Service: 3 activities. Administration: Committee Member. SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence 2. Department pre check: Chair verifies completeness and requests missing items 3. Assign reviewers: two impartial reviewers are assigned by the Chair 4. Review period: reviewers evaluate materials (standard window: 10 working days) 5. Consolidate findings: reviewers submit recommendations to Chair 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing. 7. Appeals: faculty may submit clarifications or appeals within 5 working days"
    },
    {
        "image": "workload2_synth_14_aug1.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineenng Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 15 units (22 hours week). Research: Ongoing study Seem focus Extension Service: 3 activities ‘Administration: Program Chair SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence. 2. Department pre check: Chair verifies completeness and requests missing items. 3. Assign reviewers: two impartial reviewers are assigned by the Chair. 4. Review period: reviewers evaluate materials (standard window. 10 working days) 5. Consolidate findings: reviewers submit recommendations to Chair. 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing. 7. Appeals: faculty may submit clarifications or appeals within 5 working days."
    },
    {
        "image": "workload2_synth_14_aug2.png",
        "label": "workload",
        "ocr_text": "gineeting College of EM Eaoulty Workload Report— sective date: October 48, 2025 ry of Assigned Duties secTioN b Summa’ poursiweek) —~ Seem focus eacting: 1S unis Research: Extersion Se Adroinistration Pr eS GRETION 2: Reve ArwoHRES 4, Prepare documentation. giarkioad F286! qupse gonedules, as, and evidence yc Chair veriie: ards, and pariment pre ehes 9 complete missing Heme: fave in artiat voviewors are assigned PY the 3, Assign reviewsrs Js (standard window cpait jiews pariod: reviewers evohuate at ing days) oiieate firedings. reviewers sub pecommmendaiens to es iv finalizes 80} iments and nati 6, Desision natty G ealhy an WEES. 7 appeals. faculty may Sub working days, it clavicle!"
    },
    {
        "image": "workload2_synth_14_aug3.png",
        "label": "workload",
        "ocr_text": "Facuily Wotkioad Repost —- College of Engineering Eftective date. October 15, 2025 SECTION 2: Summery of Assigned Dutes Teaching: 15 units (22 hoursiweek), Research: Ongoing study ‘Seem focus. Extension Service: 3 activities Admixstiation: Program Chay. SECTION 2: Rerview Azevovat Proceas 1. Prepare documentation: workload resoarch outputs, and evidence 2. Department pre check: Chair verifies completeness and requests missing items 2. Assign reviewers: two impartial reviewers: are assigned by the Chair. 4 Review 40 working days) 5, Consolidate findings” reviewers sutmnit recommendations to Chair. 6. Decision notify: Chait finahzes adjustments: and facully in writing, 7. Appeals: faculty may working days records, course schedules, period: reviewers evaluate matenals: (standard window. notifies submit clarifications oF appeals within 5"
    },
    {
        "image": "workload2_synth_14_aug4.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineering Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 15 units (22 hours week). Research: Ongoing study Seem focus. Extension Service: 3 activities. Administration: Program Chair. SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence. 2. Department pre check: Chair verifies completeness and requests missing items 3. Assign reviewers: two impartial reviewers are assigned by the Chair. 4. Review period: reviewers evaluate materials (standard window: 10 working days), 5. Consolidate findings: reviewers submit recommendations to Chair. 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing. 7. Appeals: faculty may submit clarifications or appeals within 5 working days"
    },
    {
        "image": "workload2_synth_14_aug5.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineering Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 15 units (22 hours week) Research: Ongoing study Seem focus Extension Service: 3 activities. Administration: Program Chair. SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence 2. Department pre check: Chair verifies completeness and requests missing items. 3. Assign reviewers: two impartial reviewers are assigned by the Chair 4, Review period: reviewers evaluate materials (standard window: 10 working days) 5. Consolidate findings: reviewers submit recommendations to Chair 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing 7. Appeals: faculty may submit clarifications or appeals within 5 working days"
    },
    {
        "image": "workload2_synth_15_aug1.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineenng Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching 23 units (34 hours week) Research Active project Case focus. Extension Service 0 activites, Admunistraton. Coordinator SECTION 2: Review Aoproval Process 1 Prepare documentation workload records, course schedules, research outputs, and evidence 2 Department pre check Chair verifies completeness and requests missing items 3. Assign reviewers. two impartial reviewers are assigned by the Chair 4 Review period. reviewers evaluate materials (standard window 10 working days) 5. Consolidate findings. reviewers submit recommendations to Chair 6 Decision notify Chair finalizes adjustments and notifies faculty in writing 7 Appeals faculty may submit clarifications or appeals within 5 working days"
    },
    {
        "image": "workload2_synth_15_aug2.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineering Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 23 units (34 hours week) Research: Active project Case focus Extension Service: 0 activities, Administration: Coordinator. SECTION 2: Review Aoproval Process 4. Prepare documentation: workload records, course schedules, research outputs, and evidence. 2. Department pre check: Chair verifies completeness and requests missing items. 3, Assign reviewers: two impartial reviewers are assigned by the Chair 4. Review period: reviewers 10 working days), 5, Consolidate findings: reviewers submit recommendations to Chair. 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing 7. Appeals: faculty may submit clarifications or appeals within 5 working days. evaluate materials (standard window:"
    },
    {
        "image": "workload2_synth_15_aug3.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineering Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 23 units (34 hours week). Research: Active project Case focus. Extension Service: 0 activities Administration: Coordinator. SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence. 2. Department pre check: Chair verifies completeness and requests missing items. 3. Assign reviewers: two impartial reviewers are assigned by the Chair. 4. Review period: reviewers evaluate materials (standard window: 10 working days). 5. Consolidate findings: reviewers submit recommendations to Chair 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing 7. Appeals: faculty may submit clarifications or appeals within 5 working days"
    },
    {
        "image": "workload2_synth_15_aug4.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineering Effective date: October 15, 2025 ummary of Assigned Duties week). Case focus. SECTION 1: S Teaching: 23 units (34 hours! Research: Active project Extension Service: O activities. ‘Administration: Coordinator. SECTION 2: Review 8. 4. Prepare document: research outputs, and 2. Department pre chec! requests missing items. 3. Assign reviewers: two impartial reviewer: ate materials (standard window: Approval Process ‘ation: workload records, course schedules, evidence. k: Chair verifies compl 5 are assigned by the jeteness and Chair. 4. Review period: reviewers evalu 40 working days). 5, Consolidate findings: reviewers submit recommendations to Chair. 6 Decision notify: Chair finalizes adjustments and notifies faculty in writing. 7. Appeals: faculty working days. may submit clarifications oF appeals within 5"
    },
    {
        "image": "workload2_synth_15_aug5.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineering RHective date: October 15, 2025 SECTION 1: Summary 0f Assigned Duties Teaching: 23 units (34 hours week). Active project Case focus"
    },
    {
        "image": "workload2_synth_16_aug1.png",
        "label": "workload",
        "ocr_text": "Faculty Workioad Report —- Business Schoo! EHtective date: October 15, 2025 SECTION t: Summary of Assigned Duties Teaching: 17 units (25 hours week), Active project Hear focus, Extersion Service 0 activiies Administration: Commitiee Member SECTION 2: Reve Arvrcwa taccass 1. Prepere documentation work! fessarch outputs, and evidence, 2. Department pre check Chair icad records, course schedules, venfies completeness and feguests missing items. 3. Assign reviewers {wo impartial roviewers are assigned by ths Chair. reviewers evaluste materials (standard window: 10 working days). 5 findings: reviewers submit feconmendations to"
    },
    {
        "image": "workload2_synth_16_aug2.png",
        "label": "workload",
        "ocr_text": "SECHGN 1: St Teuching: 17 unis (26 hoursAves! Reasearch. Active project ~~ Hear focus. ExisnsionSenne: 6 activities. Administration Corpmmities Member. SROTHON 2: Ftevow sncrovat Groves 4. Prepare doownentation workioad records, course schedules, yasarch cutouts, and evidence: 2. Denariment pra check: Chair vail requests missing tems. Assign reviewers: (wo impartial reviewars are assigned by the 4. Heview period. reviewers eveluaie materiais (standard window. 40 working days) 5, Consolidate findings: revi Chaar 6. Ee taculty in writing 7 Apneats: faculty may suterit clarifications or eppeals within working days. ae Completeness Gnd 7 submit recummencalionns to ion notity: Chair inekizes adjusiments and notifies"
    },
    {
        "image": "workload2_synth_16_aug3.png",
        "label": "workload",
        "ocr_text": "ss School Faculty Workload Report —- Bu Effective date: October 15, 2025 SECTION ty Summary of Assigned Dut Teaching 17 units (25 hoursAweek), R Active project Hear focus Exlansion Service: 0 stlivities. Administration. Commitee Mer ber SECTION 2: Reviw Anoreval 1, Prepare documentation: workload records, course schedules 3. Assign reviewers. two impartial reviewers are assigned by the Ohair 4 Review period: reviewers evaluate i 10 working de rials (standard window. fecully in writing 7. Appeals’ faculty may submit clarifications or eppeais within S working days."
    },
    {
        "image": "workload2_synth_16_aug4.png",
        "label": "workload",
        "ocr_text": "Faculty Worki ess School 2ad Report ate: Getober 15, 2025 SECTION 1: Sur Teaching: 17 units (25 noursiwee! Research: Active project Hear f z Service: 0 activi Commitee naty of Assigned Duties 18 bani sche aness and 2. Assign Chair 4. Review periog: reviewers eval 4O impartial reviewers are igned by the lo materials Indard winder nendations to sand: of appeals within 5"
    },
    {
        "image": "workload2_synth_16_aug5.png",
        "label": "workload",
        "ocr_text": "Business Sch uly Workload Report eifective date: Qetobar 15, 2026 yned Dukes nary GEA (25 howsiweek} SECTION 2: Sut feaching: 17 4 Researche Active project ~~ Heat fos extengion Service. actiides Administration: Comittee Member SECTION 2: Review aopeane Pe +. Prepars a secords, COUrSe outpuis, and evider heck. Chair verifies co smpleleness i researed 2. Departraunt pre: missing toms. sw partial reviewsrs @re a5 jerials (glandard eyiew panied. fav! awers GVaIUSIO 1% 19 working days) FP commoiiiate finaings. reviewers Sub recommerdations to nair gjusiments and notifies Davision notity fly in writ tasuity may submit ch Chairs finalize: 5 oF appaais within anific: 7 working days."
    },
    {
        "image": "workload2_synth_17_aug1.png",
        "label": "workload",
        "ocr_text": "Facuity Workioad Report Business Schooi Efoctive date: October 15, 2025 SECTION 2: Review tesroval Prosone 1. Prepare documentation workload records, course schedules, fesearch outputs, and evidence 2 Department pro check: Chair requests missing items. 3. Assign reviewers. two impartiat feviewers are assigned by the Cher 4 Review period: reviewers evaluate materials (standard window: 10 working days) S Consolidate findings: reviewers submit recommendations to Chair 6. Decision Notily: Chair finalizes adjustments and notifies focuity in writing. 7. Appeats: faculty may submit clarifications or appeals within 5 working days. Verifies completeness arxt"
    },
    {
        "image": "workload2_synth_17_aug2.png",
        "label": "workload",
        "ocr_text": "Cully Weikload Report Business School Effective date October 15, 2025 Assign AursAweek) C-— Mennber fociss activities Hon. Coordinator arch: Freposat Extensions Addn SECTION 2: Pew te Aoprval Prncoss 1 Prepare doctuim: Hlation: arch outputs 2. Departmen workload recon and evide R pre check ©) Missing iter course: schedules verlies completeness and 5. Assign reviewers 4. Review eric reviewers avaiuate materials (sta) 10 wi Wo Impartial reviewars are assigned by a 1s window: 5 Consoiiia Chair Dacision natty. Chair tinedives ads facuity in writ 7. Appeals: fac: orkiNG days findings: reviewers SUDIAH re s ons to iustments and notifies ty may submit Clarifie ONS OF appeats within §"
    },
    {
        "image": "workload2_synth_17_aug3.png",
        "label": "workload",
        "ocr_text": "Faoulty Workload Report -— Business Schuot Effective date: October 15, 2025 Extension Sen Administration: Cecedinator. SECTION 2: Review 8 agcrovel Process 1. Prepare documentation: workload records, course schedules, research oulpuis, and evidence. 2 Daparimant pre check: Chair verifie requests mis: 3. Assign reviewers: two impartial reviewers are assigned by the Chair 4. Review pericd. reviewers evaluate maletials (stencard windew 40 working days). 5, Consolidate findings: reviewers submit recommendations te Chair 8. Decision notify: Chair finalizes adjustments and notifies faculty in writing 7. Appeals: fac: working days completeness and ing items tray submil clarifications or anpeals w"
    },
    {
        "image": "workload2_synth_17_aug4.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report Business Scho! Eftective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 21 units (31 hours week) Research: Proposal stage Member focus ExtensionService: 4 activites Administration: Coordinator SECTION 2: Revien a spprovai Process 1. Prepare documentation: workload Fesearch outputs, end evidence. 2. Department pre check: Chair ver fequests missing items. 3. Assign reviewers: two impartial reviewer: fecords, course schedules, fies completeness and 'S afe assigned by the Chair 4. Review period: reviewers evaluate materials (standard window: 10 working days). 5. Consolidate findings: reviewers Submit recommendations to Chair &. Decision notify: Chair finalizes adjustments and notifies faculty in writing 7. Appeals: facuity may submit clarifications or appests within 5 working days."
    },
    {
        "image": "workload2_synth_17_aug5.png",
        "label": "workload",
        "ocr_text": "joad Report ~-. Business Scheoi Efective date: October 15, 2025 SECTION 1: Siummary of Assigned Duties Research: Proy tage Member foou ExtensonService: 4 activities Administration: Cooramater. SECHON 2: use sched 1. Prepare documentation: workload records sutputs, and evidenc check, Chair v and compie' ariment ang sign reviewers: two impartial reviewers are assigned by the Chair wiew period: reviewers Svs dard window 49 war ks olidate findings: reviewers submit reco lays) ns 30 pmende sand notifies Cher finalizes adiusinen fn wttine working day pit clanificate"
    },
    {
        "image": "workload2_synth_18_aug1.png",
        "label": "workload",
        "ocr_text": "College of Engineoring stober 15, 2025 SECTION 2: 3, ummaty of Assigned Duties caching: 9 units (43 hoursivoek} Research Active Project —- Peonin focus. CTION 2: esi ayerovalp || Prepare documentation: workload records sours Schedutes, fesearch cutputs, and evidence. 2. Department ore check- Chair Fequesis missing tems 3. Assign reviewers: two impart Chair AR varitics compietane and tot reviewers are assigned by the View Desiod. reviewers evaluate 1 naterials (standard windows Hewers Submit renominends HONS to sion notify: Chair final faculty i wri 1g, 7 Appeats: faculty may submit ca working days. adjuster ts and notifies fications or appeals within §"
    },
    {
        "image": "workload2_synth_18_aug2.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineering Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 9 units (13 hours week). Research: Active project People focus. Extension Service: 2 activities. Administration: Coordinator. SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence. 2. Department pre check: Chair verifies completeness and requests missing items 3. Assign reviewers: two impartial reviewers are assigned by the Chair. 4. Review period: reviewers evaluate materials (standard window: 10 working days). 5. Consolidate findings: reviewers submit recommendations to Chair. 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing 7. Appeals: faculty may submit clarifications or appeals within 5 working days"
    },
    {
        "image": "workload2_synth_18_aug3.png",
        "label": "workload",
        "ocr_text": "meen oad Report -—- Callage of E Faculty Wo fifective dove: October 15, 2025 SECTION 1: Summary of Assigned Dut ching: 9 units (53 hours week) fi: clive project —- People forts Re Extension Senvica 2 activities Asininistration, Coord SECTION 2: kKload records, course schedules +, Prepare dosumentation: research outputs, and evis 2 Departinent pre check: Chair vesitie: compieteness snd regue 3. Assign reviewers: two impartial reviewers are assigned by the Chair 4. Review period: reviewers evaluate Mm 419 working days} 5, Consolidate findings: chair 6, Dec fooulty in writing. 7. Appeals: facuity may we yg Gays. als (standard window viewers suprit recommendations bo ion nolify: Chair finalizes adjustments and nevhe submit clarifications or appeats within: S"
    },
    {
        "image": "workload2_synth_18_aug4.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineering Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 9 units (13 hours week). Research: Active project People focus Extension Service: 2 activities. Administration: Coordinator. SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence 2. Department pre check: Chair verifies completeness and requests missing items. 3. Assign reviewers: two impartial reviewers are assigned by the Chair 4. Review period: reviewers evaluate materials (standard window. 10 working days). 5. Consolidate findings: reviewers submit recommendations to Chair. 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing. 7. Appeals: faculty may submit clarifications or appeals within 5 working days."
    },
    {
        "image": "workload2_synth_18_aug5.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineoring Eifective dete: Octebor 15, 2025 Summary of Assigned Duties eek) ect —. People focus, ents (3 hou SECTION 2: Raview appicnel traces 1. Prepare documen te tation: y and evick 2. Department pre check: ch fequests missing item ‘OWISO SCheckdos ha veritics copy, plsieness and varied reviewers apes 288) ned By the ew Detiod: reviewer 16 Working days) 5. Consoliiate findings Peviewers suten S evaluate mater (Standard wirdow: it Tecommandations ty Decision notity: faculty in writing 7 Aapesis, faculty ry. working days Shai finalizes adtustments ane notifies 8Y Submit Clarificg! FONS OF appeals within 5"
    },
    {
        "image": "workload2_synth_19_aug1.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report Business School Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 12 units (18 hours week). Research: Active project Onto focus. Extension Service: 3 activities. ‘Administration: Committee Member. SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence. 2. Department pre check: Chair verifies completeness and requests missing items. 3. Assign reviewers: two impartial reviewers are assigned by the Chair. 4. Review period: reviewers evaluate materials (standard window: 10 working days). 5, Consolidate findings: reviewers submit recommendations to Chair. 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing. 7. Appeals: faculty may submit clarifications or appeals within 5 working days."
    },
    {
        "image": "workload2_synth_19_aug2.png",
        "label": "workload",
        "ocr_text": "Egcuity Workinad Report Business Schoo! Effective date: October 15, 2025 SECTION 2: Summary of Assigned Dues hoearsfwedh Yeaching: 12 unit Research: Active ExtensionSer Administration: Semmittes Member SECTION 2: Review Aeveove! wload records, 4. Prepare documentation: wor oh outpuis, and evidence. S ones an 2. Department pre check. Chair verifies comploten yor: Two isnpartian reviewers d by the 2 assign jard window: 4, Roview period. reviewer 40 working days} §. Gonsolidate findiry Chair 8. Gs wy patsy: Che faculty in witing 7. Appeals: faculty may submit eleriications oF appeals withi working days. coriais (stare 3 evatuate ms reviewers subinit recom” Snations: and notifies it finalizes adjusts"
    },
    {
        "image": "workload2_synth_19_aug3.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report Business School Effective date: October 15, 2025 SECTION 1: Summa Teaching: 12 units Research: Active Extension Servics Administration: Ci Ty of Assigned Duties (18 hours week). Project Onto focus €: 3 activities “ommittee Member. SECTION 2: Review Asproval Process 1. Prepare documentation: wo Fesearch outputs, and eviden 2. Department pre check: Chair verifies completeness and requests missing items 3. Assign reviewers: two impartial reviewers are assigned by the Chair. 4. Review period: reviewers evaluate materials (standard window: 10 working days) 5. Consolidate findings: reviewers submit recommendations to Chair. 8. Decision notify: Chair finalizes adjustments and notities faculty in writing, 7. Appeals: faculty may submit Clarifications or appeals within working days rkload records, course Schedules, Ice."
    },
    {
        "image": "workload2_synth_19_aug4.png",
        "label": "workload",
        "ocr_text": ". Business School Faculty workload Repor etectve date: Gotobar 15, 2625 seenary of Assigned Duties 8 hours week) SECTION 2: S Teaching. Research: Active project —~ OF rice 2 eectivities ioe. Connmitien: Member ry ateninistvat SECTION 2: Review 2 Aamioes fracees mantation workload records, oF +. Prepare doz! curse schedules research aarpuls, and evidence, 2. Gapartment prechock: Chait v6! Hies complet requests missing Hen: 2. Assign reviewers: tw Chair 4 Review period. reviawers avaluale materizis: 40 working days). 5, Consolicate tirin Chair Revision notiy: Chair finalt facasity in wrilies 7. Appeals: foculty may submit clan working days aness and impartial revigwers BFS assigned by ihe tandard wind. gps: FOVAENETS submit racornmendations to wes adjustments afi notifies fications of appeats within S"
    },
    {
        "image": "workload2_synth_19_aug5.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report Business School Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 12 units (18 hours week), Research: Active project Onto focus Extension Service: 3 activities. Administration: Committee Member. SECTION 2: Review Approval Process: 1. Prepare documentation: workload records, course schedules, research outputs, and evidence. 2. Department pre check: Chair verifies completeness and requests missing items 3, Assign reviewers: two impartial reviewers are assigned by the Chair. 4. Review period: reviewers evaluate materials (standard window: 10 working days) 5. Consolidate findings: reviewers submit recommendations to Chair. 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing, 7. Appeals: faculty may submit clarifications or appeals within 5 working days."
    },
    {
        "image": "workload2_synth_20_aug1.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineering Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 7 units (10 hours week ). Research: Ongoing study Word focus. Extension Service: 3 activities Administration: Program Chai SECTION 2: Review Approval Process 1. Prepare documentation: workload records, cour Fesearch outputs, and evidence. 2. Department Pre check: Chair verifies completeness and requests Missing items. rse schedules, TS: two impartial reviewers are assigned by the Chair. 4. Review period: reviewers evaluate materials (standard window: 10 working days). 5. Consolidate findings. reviewers submit recommendations to Chair. 6. Decision notify: Chair finalizes adjustments and Notifies faculty in writing 7. Appeals. faculty may Submit clarifications OF appeals within 5 working days."
    },
    {
        "image": "workload2_synth_20_aug2.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineering Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 7 units (10 hours week) Research: Ongoing study Word focus. Extension Service: 3 activites. Administration: Program Chair. SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence. 2. Department pre check: Chair verifies completeness and requests missing items 3. Assign reviewers: two impartial reviewers are assigned by the Chair. 4. Review period: reviewers evaluate materials (standard window: 10 working days). 5. Consolidate findings: reviewers submit recommendations to Chair. 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing 7. Appeals: faculty may submit clarifications or appeals within 5 working days"
    },
    {
        "image": "workload2_synth_20_aug3.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineering Effective date: October 15, 2025 ‘SECTION 1: Summary of Assigned Duties Teaching: 7 units (10 hours week) Research: Ongoing study Word focus Extension Service: 3 activities. Administration: Program Chair SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence 2. Department pre check: Chair verifies completeness and requests missing items 3. Assign reviewers: two impartial reviewers are assigned by the Chair. 4. Review period: reviewers evaluate materials (standard window: 10 working days). 5. Consolidate findings: reviewers submit recommendations to Chair 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing 7. Appeals: faculty may submit clarifications or appeals within 5 working days"
    },
    {
        "image": "workload2_synth_20_aug4.png",
        "label": "workload",
        "ocr_text": "Faculty Workload Report College of Engineering Effective date: October 15, 2025 SECTION 1: Summary of Assigned Duties Teaching: 7 units (10 hours week). Research: Ongoing study Word focus. Extension Service 3 activities. Administration: Program Chair SECTION 2: Review Approval Process 1. Prepare documentation: workload records, course schedules, research outputs, and evidence. 2. Department pre check: Chair verifies completeness and requests missing items. 3. Assign reviewers: two impartial reviewers are assigned by the ‘Chair. 4. Review period: reviewers evaluate materials (standard window. 10 working days) 5. Consolidate findings: reviewers submit recommendations to ‘Chair 6. Decision notify: Chair finalizes adjustments and notifies faculty in writing 7. Appeals: faculty may submit clarifications or appeals within 5 working days"
    },
    {
        "image": "workload2_synth_20_aug5.png",
        "label": "workload",
        "ocr_text": "Facuity Workload Report —~ College of Engineating Etective date: October 15, 2025 SECTION 1: Surwnary of Assigned Dunes Teaching: 7 units (10 hoursweek) Research: Ongoing study —- Word focus. Extension Service’ 3 activites. Administration: Program Chai. SECTION 2: Reveew 8 Aroroval Process: +. Prepare documentation: workload rec research outputs, and evidence. 2. Depertment pre check. Chair verifies conipleteness: and requests missing items. 3. Assign reviewers. qwo impartial reviewers are assigned by the ords, course schedules, chair 4. Review period reviewers evaluate materials (standard window 310 working days) 5, Consolidate findings: reviewers submit recommendations 10 Chait ©. Decision notity: Chair finalizes adjustments and nothes faculty in writing. 7. Appeais: faculty may submit clanfications or appeals within 5 working days."
    }
]